{
  "Player": [
    "Greetings, your majesty.",
    "I am looking for a quest!",
    "No, I don't think I know it...",
    "No, that sounds boring.",
    "Sure. I don't have anything better to do right now.",
    "Who's Drezel?",
    "Ooooooooh, THAT Drezel. Yup, I'll go do that then.",
    "Where am I supposed to go again?",
    "Why do you care about Drezel anyway?",
    "Do I get a reward for this?",
    "Soooooo...... that would be a 'no' then?",
    "Well, as I said, the King sent me to check you're alright.",
    "I'm not sure. Ask you what help you need, I suppose.",
    "Sure. I'm a helpful person!",
    "As you wish. One dead dog coming up.",
    "No, something about all this is very suspicious.",
    "Hello. I just moved in next door... Can I borrow a cup of coffee?",
    "I hear this place is of historic interest. Can I come in and have a wander around? Possibly look at some antiques or buy something from your gift shop?",
    "What am I supposed to be doing again?",
    "Well... I went to the temple like you asked me to... and I spoke to someone inside...",
    "Well... he seemed to be having some kind of trouble with a dog...",
    "Well okay then.",
    "I killed that dog for you.",
    "What's so funny?",
    "Yeah, I spoke to the guys at the temple and they said they were being bothered by that dog in the crypt, so I went and killed it for them. No problem.",
    "Did I make a mistake?",
    "B-but Drezel TOLD me to...!",
    "Y-yes your Highness.",
    "Okay, okay, I'm going, I'm going... There's no need to shout...",
    "It sounds like there's something alive inside it. I don't think it would be a very good idea to open it...",
    "Hello.",
    "My name's Player. King Roald sent me to find out what was going on at the temple. I take it you are Drezel?",
    "How is a river a good defence then?",
    "Tell me anyway. I'd like to know the full facts before acting any further.",
    "Ok, I can see how the river protects the border, but I can't see how anything could affect that from this temple.",
    "Yes, of course. Any threat to Misthalin must be neutralised immediately. So what can I do to help?",
    "Maybe I could kill it somehow then while it is asleep?",
    "How about some garlic?",
    "Okay, got it, find the key to your cell, and do something about the vampyre.",
    "Okay, well first thing's first; let's get you out of here.",
    "Ha! NO! You can rot in there for all I care you stupid priest! All hail mighty Zamorak! Death to puny Misthalin!",
    "You're right, we don't. It doesn't matter anyway.",
    "No, not yet...",
    "How do you know that?",
    "Oh.",
    "Okay, OKAY, I get the picture!",
    "I have this key I took from one of those Zamorakian monks!",
    "I have this key I took from one of the monuments underground.",
    "The key fitted the lock! You're free to leave now!",
    "Do you have any ideas about dealing with the vampyre?",
    "This water doesn't look particularly holy to me... I think I'd better check with the priest first.",
    "The key fitted the lock! You're free to leave now!",
    "I have some water from the Salve. It seems to have been desecrated though. Do you think you could bless it for me?",
    "I poured the blessed water over the vampyre's coffin. I think that should trap him in there long enough for you to escape.",
    "Okay.",
    "Why, what's happened?",
    "What can we do to prevent that?",
    "Couldn't you bless the river to purify it? Like you did with the water I took from the well?",
    "What's that?",
    "Kind of like a filter? Okay, I guess it's worth a try. How many should I get?",
    "What am I supposed to do again?",
    "I brought you some Rune Essence.",
    "How many more essences do I need to bring you?",
    "I brought you some more essences.",
    "So can I pass through that barrier now?",
    "Okay, I will keep it equipped whenever I fight werewolves.",
    "Well, I'm going to look around a bit more.",
    "Is there anything else interesting to do around here?",
    "Sorry, not interested...",
    "Well, what is it, I may be able to help?"
  ],
  "King Roald": [
    "Well hello there. What do you want?",
    "A quest you say? Hmm, what an odd request to make of the king. It's funny you should mention it though, as there is something you can do for me. Are you aware of the temple east of here? It stands on the river Salve and guards the entrance to the lands of Morytania?",
    "Hmm, how strange that you don't. Well anyway, it has been some days since last I heard from Drezel, the priest who lives there. Be a sport and go make sure that nothing untoward has happened to the silly old codger for me, would you?",
    "Yes, I dare say it does. I wouldn't even have mentioned it had you not seemed to be looking for something to do anyway.",
    "Many thanks adventurer! I would have sent one of my squires but they wanted payment for it!",
    "Well hello there. What do you want? You have news of Drezel for me?",
    "Drezel is the priest who lives in the Temple to the east of here. You're supposed to go make sure nothing's happened to him. Remember?",
    "The temple where Drezel lives is but a short journey east from here. It lies south of the cliffs, on the source of the river Salve. Don't worry, you can't miss it.",
    "Well, that is a slightly impertinent question to ask of your King, but I shall overlook it this time. As you are no doubt aware, this kingdom worships Saradomin, and is a peaceful place to live and prosper. The temple where Drezel lives stands on the Eastern border of Misthalin, and further East lie the evil lands of Morytania, a fearful land of undead monsters and Zamorakians. The sacred river Salve marks a natural border between our kingdoms, and the temple prevents any invasions to this land from Morytania. By keeping the water of the river blessed, our defences remain strong, as the fiends that inhabit Morytania cannot cross such a holy barrier. Drezel is the descendant of one of the original Saradominist priests who first blessed the river, and built the temple there. His job is to ensure nothing happens to the river at the source that might allow the evil Morytanians to invade this land. This is the reason why the lack of communication from him bothers me somewhat, although I am sure nobody would dare to try and attack our kingdom!",
    "You will be rewarded in the knowledge that you have done the right thing and assisted the King of Misthalin.",
    "That is correct.",
    "Well hello there. What do you want?",
    "You have news of Drezel for me?",
    "Ah, well that must have been Drezel then. What did he say?",
    "I expect you to offer him your full assistance in whatever he needs.",
    "Well hello there. What do you want? You have news of Drezel for me?",
    "YOU DID WHAT??? Are you mentally deficient??? That guard dog was protecting the holy well of the river Salve! Without the dog we could be in severe peril of attack!",
    "YES YOU DID!!!!! You need to get there right now and find out what is happening! Before it is too late for us all!",
    "No, you absolute cretin! Obviously some fiend has done something to Drezel and tricked your feeble intellect into helping them kill that guard dog! You get back there and do whatever is necessary to safeguard my kingdom from attack, or I will see you beheaded for high treason!",
    "Well hello there. What do you want? AND MORE IMPORTANTLY, WHY HAVEN'T YOU ENSURED THE BORDER TO MORYTANIA IS SECURE YET?",
    "NO NEED TO SHOUT??? Listen, and listen well, and see if your puny mind can comprehend this: if the border is not protected, then we are at the mercy of the evil beings that live in Morytania. Given that most of the inhabitants consider humans to be nothing more than over talkative snack foods, I would say that me shouting at you for your incompetence is the LEAST of your worries right now. NOW GO!"
  ],
  "Monk": [
    "Who are you, and what do you want?",
    "(Psst... Hey... Who's Roald? Who's Drezel?)",
    "(He is? ... Hey, you deal with this, alright?) He's just coming! Wait a second!",
    "(Drezel!)",
    "(Psst... Hey! The dog!)",
    "(Drezel!)",
    "What next door? What's 'coffee'? Who ARE you?",
    "(Psst... Hey... Is this place of historic interest?)",
    "They did? Ummm... (Psst... Hey... Are there any pipes in here, you reckon?)",
    "We don't have any! Thanks. Goodbye!",
    "Hello?",
    "Who are you?",
    "(Drezel!)",
    "Really? Hey, that's great!",
    "Yeah, maybe you should tell the King what a great job you did... 'Buddy'!"
  ],
  "Another monk": [
    "(Uh... Isn't Drezel that priest upstairs? Oh, wait. Roald's the King of Varrock, right?)",
    "(I don't know. Don't think so.)"
  ],
  "'Drevil'": [
    "Hello, my name is Drevil."
  ],
  "'Drezel'": [
    "I mean 'Drezel'. How can I help?",
    "And, uh, what would you do if I wasn't alright?",
    "Ah, good. Well, I don't think...",
    "(Oh! Yes, of course.) Will you do me a favour, bold adventurer?",
    "Drezel. Go away!",
    "(Shhh! It's the adventurer!) I want you to go kill the horrible dog in the basement for me. You can use the entrance in the mausoleum out there. You don't need to come inside to do it.",
    "*cough* For good old Drezel. Right, buddy?",
    "You again? What do you want now?",
    "Yeah, thanks a lot, buddy! Hahaha!",
    "Nothing, buddy. We're just so grateful to you."
  ],
  "Drezel": [
    "Haha! Really? Thanks, buddy! You see that mausoleum to the north? There's a horrible big dog underneath it that I'd like you to kill for me. It's been really bugging me! Barking all the time and stuff! Please kill it for me, buddy.",
    "Oh! You do not appear to be one of those Zamorakians who imprisoned me here! Who are you and why are you here?",
    "That is right! Oh, praise be to Saradomin! All is not yet lost! I feared that when those Zamorakians attacked this place and imprisoned me up here, Misthalin would be doomed! If they should manage to desecrate the holy river Salve we would be defenceless against Morytania!",
    "Well, it is a long tale, and I am not sure we have time!",
    "Ah, Saradomin has granted you wisdom I see. Well, the story of the river Salve and of how it protects Misthalin is the story of this temple, and of the seven warrior priests who died here long ago, from whom I am descended. Once long ago Misthalin did not have the borders that it currently does. This entire area, as far West as Varrock itself was under the control of an evil god. There was frequent skirmishing along the borders, as the brave heroes of Varrock fought to keep the evil creatures that now are trapped on the eastern side of the River Salve from over running the human encampments, who worshipped Saradomin. Then one day, Saradomin himself appeared to one of our mighty heroes, whose name has been forgotten by history, and told him that should we be able to take the pass that this temple now stands in, Saradomin would use his power to bless this river, and make it impassable to all creatures with evil in their hearts. This unknown hero grouped together all of the mightiest fighters whose hearts were pure that he could find, and the seven of them rode here to make a final stand. The enemies swarmed across the Salve but they did not yield. For ten days and nights they fought, never sleeping, never eating, fuelled by their desire to make the world a better place for humans to live. On the eleventh day they were to be joined by reinforcements from a neighbouring encampment, but when those reinforcements arrived all they found were the bodies of these seven brave but unknown heroes, surrounded by the piles of the dead creatures of evil that had tried to defeat them. The men were saddened at the loss of such pure and mighty warriors, yet their sacrifice had not been in vain; for the water of the Salve had indeed been filled with the power of Saradomin, and the evil creatures of Morytania were trapped beyond the river banks forever, by their own evil. In memory of this brave sacrifice my ancestors built this temple so that the land would always be free of the evil creatures who wish to destroy it, and laid the bodies of those brave warriors in tombs of honour below this temple with golden gifts on the tombs as marks of respect. They also built a statue on the river source so that all who might try and cross into Misthalin from Morytania would know that these lands are protected by the glory of Saradomin and that good will always defeat evil, no matter how the odds are stacked against them.",
    "Well, as much as it saddens me to say so adventurer, Lord Saradomin's presence has not been felt on the land for many years now, and even though all true Saradominists know that he watches over us, his power upon the land is not as strong as it once was. I fear that should those Zamorakians somehow pollute the Salve and desecrate his blessing, his power might not be able to stop the army of evil that lurks to the east, longing for the opportunity to invade and destroy us all! So what do you say adventurer? Will you aid me and all of Misthalin in foiling this Zamorakian plot?",
    "Well, the immediate problem is that I am trapped in this cell. I know that the key to free me is nearby, for none of the Zamorakians who imprisoned me here were ever gone for long periods of time. Should you find the key however, as you may have noticed, there is a vampyre in that coffin over there. I do not know how they managed to find it, but it is one of the ones that somehow survived the battle here all those years ago, and is by now quite, quite, mad. It has been trapped on this side of the river for centuries, and as those fiendish Zamorakians pointed out to me with delight, as a descendant of one of those who trapped it here, it will recognise the smell of my blood should I come anywhere near it. It will of course then wake up and kill me, very probably slowly and painfully.",
    "No adventurer, I do not think it would be wise for you to wake it at all. As I say, it is little more than a wild animal, and must be extremely powerful to have survived until today. I suspect your best chance would be to incapacitate it somehow.",
    "Interesting, but I feel that garlic would be too weak. Perhaps you could use the Salve itself to hold him at bay.",
    "When you have done both of those I will be able to inspect the damage which those Zamorakians have done to the purity of the Salve. Depending on the severity of the damage, I may require further assistance from you in restoring its purity.",
    "Oooooh... I knew it was too good to be true... then leave me to my fate villain, there's no need to taunt me as well as keeping me imprisoned.",
    "Well, let's just say if we cannot undo whatever damage has been done here, the entire land is in grave peril! So what do you say adventurer? Will you aid me and all of Misthalin in foiling this Zamorakian plot?",
    "How goes it adventurer? Any luck in finding the key to the cell or a way of stopping the vampyre yet?",
    "Well don't give up adventurer! That key MUST be around here somewhere! I know none of those Zamorakians ever got very far from this building!",
    "I could hear them laughing about some gullible fool that they tricked into killing the guard dog at the monument.",
    "Honestly, what kind of idiot would go around killing things just because a stranger told them to? What kind of oafish, numb-skulled, dim-witted,",
    "How goes it adventurer? Any luck in finding the key to the cell or a way of stopping the vampyre yet?",
    "Excellent work adventurer! Quickly, try it on the door, and see if it will free me!",
    "How goes it adventurer? Any luck in finding the key to the cell or a way of stopping the vampyre yet?",
    "Excellent work adventurer! Quickly, try it on the door, and see if it will free me!",
    "Oh! Thank you! You have found the key!",
    "Well excellent work adventurer! Unfortunately, as you know, I cannot risk waking that vampyre in the coffin.",
    "Well, the water of the Salve should still have enough power to work against the vampyre despite what those Zamorakians might have done to it... Maybe you should try and get hold of some from somewhere?",
    "Well excellent work adventurer! Unfortunately, as you know, I cannot risk waking that vampyre in the coffin.",
    "Yes, good thinking adventurer! Give it to me, I will bless it!",
    "Excellent work adventurer! I am free at last! Let me ensure that evil vampyre is trapped for good. I will meet you down by the monument. Look for me down there, I need to assess what damage has been done to our holy barrier by those evil Zamorakians!",
    "I will meet you downstairs by the monuments. I must see what damage has been done. Meet me there, I fear I may require more of your assistance.",
    "Ah, Player. I see you finally made it down here. Things are worse than I feared. I'm not sure if I will be able to repair the damage.",
    "From what I can tell, after you killed the guard dog who protected the entrance to the monuments, those Zamorakians forced the door into the main chamber and have used some kind of evil potion upon the well which leads to the source of the river Salve. As they have done this at the very source of the river it will spread along the entire river, disrupting the blessing placed upon it and allowing the evil creatures of Morytania to invade at their leisure.",
    "Well, I have placed a holy barrier on the entrance that leads to Morytania, but it is not very powerful and requires me to remain here focussing upon it to keep it intact.",
    "The creatures on the other side have already sensed a weakness and a ghoul crept in while I was setting the barrier.",
    "Be careful, if you go near it, they are vicious creatures. I've temporarily detained it in the room next to this one.",
    "What we need to do is find some kind of way of removing or counteracting the evil magic that has been put into the river source at the well, so that the river will flow pure once again.",
    "Should an attack come, they would be able to breach this defence very quickly indeed. What we need to do is find some kind of way of removing or counteracting the evil magic that has been put into the river source at the well, so that the river will flow pure once again.",
    "No, that would not work, the power I have from Saradomin is not great enough to cleanse an entire river of this foul Zamorakian pollutant. I have only one idea how we could possibly cleanse the",
    "Mages have an ore called 'rune essence' that absorbs magic and allows them to create runes. Should you be able to collect enough of this rune essence, it is possible it will soak up the evil potion that has been poured into the river, and purify it.",
    "Well I have no knowledge of these ores other than speculation and gossip, but if the things I hear are true around fifty should be sufficient for the task.",
    "Find me fifty Rune Essences and bring them here to me.",
    "Quickly, give it to me!",
    "I need [number] more.",
    "Quickly, give them to me! Excellent! That should do it! I will bless these stones and place them within the well, and Misthalin should be protected once more! Please take this dagger; it has been handed down within my family for generations and is filled with the power of Saradomin. You will find that it has the power to prevent werewolves from adopting their wolf form in combat as long as you have it equipped.",
    "Ah, Player. For all the assistance you have given both myself and Misthalin in your actions, I cannot let you pass without warning you. Morytania is an evil land, filled with creatures and monsters more terrifying than any you have yet encountered. Although I will pray for you, you should take some basic precautions before heading over the Salve into it. The first place you will come across is the Werewolf trading post. In many ways Werewolves are like you and me, except never forget that they are evil vicious beasts at heart. The dagger I have given you is named 'Wolfbane' and it is a holy relic that prevents the werewolf people from changing form. I suggest if you battle with them that you keep it always equipped, for their wolf form is incredibly powerful, and would savage you very quickly. Please adventurer, promise me this: I should hate for you to die foolishly.",
    "Greetings again adventurer. How go your travels in Moryania? Is it as evil as I have heard?",
    "Well, that sounds like a good idea. Don't get into any trouble though!",
    "Well, not a great deal... but there is something you could do for me if you're interested. Though it is quite dangerous.",
    "Well, I understand, you must be busy."
  ],
  "'Dibzil'": [
    "Get lost, then! I have important things to do, as sure as my name is Dibzil."
  ],
  "'Delzig'": [
    "You'll do this for good old Delzig, won't you, buddy?"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Priest_in_Peril?oldid=35962331’"
  ]
}