{
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "Additional dialogue optionsYou can discuss this issue on the talk page or edit this page to improve it."
  ],
  "King Narnode Shareen": [
    "Adventurer! It is good to see you again.",
    "The tree? It is fine, as it has always been since we foiled Glough's plans.",
    "Oh, I forced him to resign. I have now appointed a new Head Tree Guardian, Daero. He is learning quickly and serves me well.",
    "Nothing in particular... Well actually, yes – there is.",
    "Well, do you remember Glough's ship building facilities in Karamja?",
    "After you defeated Glough's demon I sent an envoy of my Royal Guard, the 10th squad, to oversee the decommission of the shipyard. They were ordered to use force if necessary.",
    "I... I don't know. I have heard nothing from them. I do not even know if they reached the shipyard!",
    "But I need to know what happened. These are elite soldiers – their disappearance cannot simply be ignored. I cannot wait any longer. And so I ask you: would you visit Glough's old shipyard in Karamja and find out if the 10th squad ever reached it?",
    "Thank you very much. You may need this Royal Seal to identify yourself as my envoy. Please report to me as soon as you have any information.",
    "Welcome back, adventurer.",
    "Thank you for doing this. What did you find?",
    "The name sounds a little familiar, but it is nobody I know personally.",
    "Never mind that – did you find anything out about my 10th squad?",
    "Do you believe him?",
    "Very well. I will now prepare some orders. You must convey them to my new High Tree Guardian, Daero.",
    "You will find him attending to business somewhere on the Grand Tree.",
    "Yes? How is the mission going...it has been quite some time since I sent you on your way.",
    "What do you mean 'over'?",
    "Yes, alright. Report on what happened.",
    "And what of my 10th squad?",
    "'We', [Player]?",
    "Well, now. It appears I cannot argue with that. Garkor obviously thinks highly of you, as do I. No service such as what you have done for me goes unrewarded in my kingdom. I personally made a visit to the Royal Treasury to withdraw your reward."
  ],
  "Player": [
    "And you too, King. How fares the tree?",
    "Good. What ever did happen to Glough?",
    "King, you look worried. Is anything the matter?",
    "What is it?",
    "Yes, they were on the eastern coast. What of them?",
    "I see... Were they successful?",
    "It is a long way.",
    "Ok, I'll do it.",
    "I'm trying to open the gate!",
    "I'm on a special mission for King Narnode of the Gnomes.",
    "Well, he did...",
    "Look, I have the Gnome Royal Seal.",
    "Since when?",
    "No, you don't.",
    "Have you seen any of King Narnode's Royal Guard recently? They were meant to be doing ... some work in the area.",
    "Who's Caranock?",
    "Hello!",
    "Glough? No. He has been forced to resign by the King.",
    "He was plotting to start a war between the Gnomes and humankind. Anyway, I am here on a separate mission. I am investigating the disappearance of the 10th squad of King Narnode's Royal Guard. They were to carry out some work in the area.",
    "You have no idea why they mysteriously disappeared?",
    "They were to oversee the decommission of the shipyard.",
    "Hello. I investigated the shipyard.",
    "I met a Gnome who goes by the name of Caranock. Do you recognise it?",
    "He calls himself a Gnome Liaison Officer. He seemed a little... odd.",
    "Caranock suggested they were blown off course by extreme southerly winds.",
    "I don't have any other information right now.",
    "Where will I find Daero?",
    "Are you Daero?",
    "I am an adventurer. I am currently in the service of your King.",
    "I have been asked to give you orders from King Narnode.",
    "Why is that?",
    "Tell me what the orders say!",
    "Where to?",
    "What lies to the south of Karamja?",
    "Monkeys? Like on Karamja?",
    "How will I travel?",
    "Are you coming with me?",
    "Why did the King send a squad of the Royal Guard?",
    "So the King worries we have come across an equally formidable foe?",
    "Who is Garkor?",
    "Why are the 10th squad so famous?",
    "What is a sapper?",
    "Who is Caranock?",
    "What is a Gnome Liaison Officer?",
    "I'm not so sure about Caranock...",
    "I do not know. He just seemed a little suspicious. He was very keen to see me leave.",
    "Let us go then.",
    "Who is it?",
    "I work better on my own...",
    "Wow! Why would Gnomes need such a place?",
    "Where is the hangar?",
    "How do I leave?",
    "How do I return here later?",
    "What is reinitialisation?",
    "Hello?",
    "I've been told to wait for the reinitialisation of the hangar. They mentioned your name.",
    "This is really embarrassing, but...",
    "Yes, I suppose I do.",
    "But...?",
    "How much?",
    "Ok then. You win again, Glough.",
    "So you can't reinitialise the gliders after all?",
    "Got it, so when I get back to the control panel I need move the last piece to complete the reinitialisation. That way no alarms will be set off.",
    "Okay Glough, here's your 200,000 gold pieces.",
    "I wish I could say the same for you.",
    "I'm not paying you anything.",
    "That's outrageous!",
    "No, I'd rather skin a monkey than take your help!",
    "I've had some practice in the past.",
    "Yes, let's go.",
    "No",
    "We are on a mission for King Narnode Shareen. I am [Adventurer] and this is Flight Commander Waydar.",
    "We are to investigate the disappearance of the 10th squad of the Royal Guard. Am I right in suspecting that you, Lumdo, are a member of the 10th squad?",
    "I have the Gnome Royal Seal.",
    "So are you Lumdo of the 10th squad?",
    "Where are the rest of your squad? Where is your Sergeant?",
    "Did you crash straight here?",
    "What did you do then?",
    "Presumably you are to guard the gliders until they return?",
    "You must take us to the island. I have orders from the High Tree Guardian to make contact with your Sergeant.",
    "You will not take me?",
    "Where are we?",
    "Did our glider survive?",
    "Will you take me to the atoll?",
    "What shall we do now?",
    "Do you recognise the gnome on the beach?",
    "Can you take me back to your kingdom?",
    "I cannot convince Lumdo to take us to the island...",
    "He claims to be under direct orders from Garkor to guard their gliders until the rest return.",
    "Can you do anything?",
    "You must do something!",
    "Waydar! Will you not accompany me to the island?",
    "But it is your mission to protect me!",
    "Hello?",
    "I am in the service of King Narnode Shareen. I have been sent here to locate the missing 10th squad of the Royal Guard.",
    "How long have you been here?",
    "Oh, that's quite alight...",
    "Well I suppose I ought to help you escape.",
    "Well how do I get out?",
    "Hello? Is anybody there?",
    "I am in the service of King Narnode Shareen. I have been sent here to locate the missing 10th squad of the Royal Guard.",
    "It certainly is... who are you?",
    "What are you doing here?",
    "How do you remain unseen?",
    "Is there any way I could be like that?",
    "How can you be everywhere?",
    "I'll be back later",
    "Hello?",
    "Good day to you Sergeant. I've been sent by your King Narnode to –",
    "How did you know that?",
    "Why do you need a human?",
    "Well –",
    "I know about the guards – I had to sneak out between the change of shifts.",
    "Awowogei?",
    "Have you seen these monkeys? You could never convince them to work for you!",
    "Don't be ridiculous! I'm a human – not a monkey!",
    "Yes, but –",
    "I can't even communicate with the monkeys!",
    "Hello?",
    "I am on a mission for King Narnode Shareen of the Gnomes.",
    "I have been sent to investigate the whereabouts of the 10th squad of his Royal Guard, which went missing during a recent mission to Karamja.",
    "Of course.",
    "I am currently in the service of your King. I was the human who exposed Glough's warfaring plans and defeated his demon. As far as I understood, the 10th squad were went to oversee the decommission of Glough's shipyard in east Karamja. Rumour has it you were blown off course. The King worried as to your fate, and sent me to investigate.",
    "No, I have been accompanied by Flight Commander Waydar. We flew south on a special type of glider and landed on a small island to our east.",
    "Yes, we have met. He ferried me across to the atoll.",
    "Waydar ordered him to leave his post. He is guarding the gliders himself.",
    "So why are you here?",
    "Then you gathered enough wood to fashion two boats. Your Sergeant and the rest of the 10th squad took the larger boat to this island, leaving Lumdo to guard the gliders and the other boat...",
    "Yes. What happened when you landed here?",
    "...",
    "Who survived?",
    "And of the rest?",
    "Why don't you just go overground?",
    "I see. I have spoken to your Sergeant. He believes that the best way to rescue the rest of your squad with the minimum casualties is to have an insider – a monkey working for us.",
    "Actually, it was more along the lines of a disguise...",
    "King Narnode Shareen asked me to...",
    "Why wasn't I told?",
    "But why a human? Why me?",
    "Why don't you just transform a gnome?",
    "Right. What do I have to do?",
    "What kind of items?",
    "What do we need for the monkey amulet?",
    "Where do I find a gold bar?",
    "Where do I find a monkey amulet mould?",
    "Where do I find something to do with monkey speech?",
    "I'll be back later.",
    "What do we need for the monkey talisman?",
    "Where do I find monkey remains?",
    "What if I need to be another type of monkey?",
    "Where do I find a magical monkey talisman?",
    "I'll be back later.",
    "Where do I find a place of religious significance to monkeys?",
    "Hello there little monkey.",
    "Oh I'm not a stranger...",
    "Hello again little monkey.",
    "I'm not a stranger...!",
    "I'm a monkey's brother!",
    "I knew your sister's mother!",
    "I'm just a monkey lover!",
    "Well I'll be a monkey's uncle!",
    "I've been... eating more bananas...just like you should be!",
    "Why are you bored?",
    "What kind of toy did Aunty say she'd give you?",
    "How many bananas did Aunty want?",
    "Yes, very mean... do you want me to get the bananas for you?",
    "But only if you promise to let me borrow your toy...",
    "Yes, I have some here.",
    "Yes, of course there are.",
    "Has Aunty given you the toy yet?",
    "Has Aunty given you the toy yet?",
    "Can I borrow it now then?",
    "Please?",
    "I know.",
    "I'd like to speak with Awowogei, please.",
    "Who is the Captain of the Monkey Guard?",
    "Hello?",
    "I have come to seek audience with Awowogei. I am told I need your permission to do so.",
    "I am envoy from the monkeys of Karamja. I have come to propose an alliance.",
    "Greetings, Awowogei.",
    "I am an envoy from the monkeys of Karamja. We wish to propose an alliance.",
    "Awowogei, please consider my offer carefully. We offer strength in numbers and our island would serve as a northern platform for defence. All that we ask for in return is peace.",
    "How am I meant to free one of them?",
    "Very well. I will be back later, with one of the captives.",
    "Ook! Ook!",
    "Ook!",
    "Ok!",
    "Er... Ook?",
    "Hello there, little monkey.",
    "How would you like to get out of here?",
    "That's convenient. When would you like to leave?",
    "Erm... to the happy, sunny jungle of Karamja...",
    "That's nice. Are you ready to go?",
    "No, I only have space for one.",
    "No!",
    "No!!",
    "Look, I already said no. If you want to come then jump into my backpack.",
    "I... er... I don't know! One minute I was asleep, and the next minute I was here surrounded by monkeys!",
    "Thank you.",
    "Yes, I have.",
    "Thank you.",
    "What about the proposed alliance, Awowogei?",
    "What do you mean?",
    "Who was speaking? What was said?",
    "What shall we do now?",
    "What kind of a plan?",
    "But you will be teleported straight into whatever trap they have prepared!",
    "But how will I join you?",
    "What?",
    "What is it?",
    "All I have to do is wear this sigil?",
    "Thank you.",
    "Rest assured, I will do so. How do I leave this place?",
    "I ... uh ... yes.",
    "No thank you. Who are you by the way?",
    "I'll ... keep that in mind, thanks.",
    "Okay...",
    "King Narnode!",
    "It's over – it's finally over.",
    "I mean 'finished'.",
    "With all due respect sir, if I told you, you would not believe me. I expect Sergeant Garkor will be sending you a full report soon enough.",
    "They all live – we suffered no casualties.",
    "I, uh, I'm part of the 10th squad now, I even have the sigil.",
    "Hello?",
    "Yes, let's go.",
    "Not yet. I'll be back later.",
    "Are you sure you cannot come to the island?",
    "I need to return to you kingdom.",
    "Oh, no reason..."
  ],
  "Option 1": [
    "Yes",
    "Talk about the journey..."
  ],
  "Option 2": [
    "No",
    "Talk about the 10th squad..."
  ],
  "Shipyard worker": [
    "Hey you! What are you up to?",
    "I can see that! Why?",
    "Narnode? I don't believe you. He wouldn't send a human!",
    "Tough.",
    "Wow. I haven't seen one of these since...",
    "...since Glough used to visit. Anyway. Please step inside, Sir."
  ],
  "Foreman": [
    "Do I know you from somewhere.",
    "I wouldn't know anything about that. You should see Caranock.",
    "Our Gnome Liaison Officer",
    "The workers are getting restless, Caranock.",
    "All this talk of Glough being replaced doesn't bode well for ... how shall I put this ... their morale.",
    "Those are all men with children to feed. Famished families. Worried wives. All of us rely on this shipyard. If something isn't done soon, there'll be revolt. And I won't be able to stop it.",
    "What something? You're always working on something. All we ever hear is bad news. First Glough disappears. Then news of a missing squad of the Royal Guard in our area. And what about that human sent by the King?",
    "I am still worried. What am I meant to tell the men?",
    "I hope you're right, Caranock, for your sake. My sake. For all of our sakes..."
  ],
  "G.L.O. Caranock": [
    "Who are you? Did Glough send you?",
    "Forced to resign??",
    "Royal Guard? I know nothing about them. Absolutely nothing.",
    "None whatsoever. What were they here to do?",
    "Decommission the shipyard... I see. Well, we have had some seriously strong southerly winds of late. They may have been blown off course during flight. I shall see personally to the decommission. You should report to the King immediately.",
    "I know...",
    "Look, I know.",
    "Stop worrying. I'm working on something.",
    "The human means nothing. If it becomes too much trouble, I will simply have it ... removed. In the meantime, let it continue to search for that blasted 10th squad.",
    "Stop worrying. I'm working on something – Glough left a few of his agents in the Gnome airforce. For now, tell your men to continue work on the battleships. Give me some time.",
    "It is good of you to meet me, Waydar.",
    "Well observed. How have you been keeping yourself occupied?",
    "My my. How things have changed somewhat since Glough's time... Now, what of the human?",
    "You may be right. Never mind – there are greater matters afoot. With Glough gone, it falls to us to continue with his plans. Also, the shipyard workers are becoming restless.",
    "Money for me, Waydar, and promotion for you. As you know, the 10th squad of the Royal Guard are slightly worse for wear on this island.",
    "What if they were to die? An entire squad of the Royal Guard goes missing in the jungle of Karamja... We could blame it on the humans.",
    "Precisely. He might even order an invasion. At the very least he'll step up on the defence. More orders for me, promotion for you.",
    "Ah yes – all that trouble with the Khazard. Last I heard, Bolren had retrieved the orbs of protection. Apparently some human lent their assistance.",
    "I agree. Anyhow, we don't want your human wondering as to your whereabouts. When the time is right, don't hesitate to... dispose of it.",
    "Good evening, Awowogei.",
    "Would it not be easier if they were somehow just to... die?",
    "I can assure you he will not. We will lay the blame at the humans' feet. Narnode will indeed declare war: not against you, but against humankind.",
    "Kill the foot soldiers and the rest of the 10th squad. My superior has sent you a few tricks which may prove useful.",
    "High magic: the ability to summon the entire 10th squad to a single location. And –",
    "Yes. And of course, you will also receive access to one of his 'pets'. You must be careful with these, as you have only one use of each. Ensure you set your trap well – none must survive lest they spread the truth.",
    "Ignore him. My colleague's official mission was to look after a human in the area, but don't worry: it is probably dead already.",
    "Good luck, Awowogei."
  ],
  "G.L.O Caranock": [
    "Why are you still here? You should report immediately to the King!"
  ],
  "Daero": [
    "Indeed I am – and you are?",
    "I see. You must be the individual who helped defeat my predecessor Glough. I hope you'll find me a more honest replacement.",
    "Well hand them over here then.",
    "It is written in an old military code. Bear with me whilst I decode this.",
    "I hope you feel like a quest adventurer.",
    "because you're going to get one.",
    "Given your recent performance of uncovering and neutralising a threat at the very extremes of Gnome hierarchy, the King has decreed that you are to undertake a reconnaissance mission.",
    "You are to be taken far to the south of Karamja, further than any Gnome has purposely travelled before. You are to investigate Caranock's claim that Garkor's squad were blown off course. You must really have impressed the King in the past.",
    "We do not know. Initial reports spoke of a large atoll populated by monkeys.",
    "From what I have heard, not quite like those monkeys...",
    "It is my responsibility to make arrangements for your mission. We will shortly visit a colleague of mine who will be accompanying you.",
    "I am afraid not. I must remain here to safeguard the Grand Tree. I will assign a Gnome agent to travel with you.",
    "The Royal Guard is composed of particularly elite soldiers who have proven themselves in battle. They are duty bound to protect the Grand Tree, its King and his interests. In the face of danger, they can more than take care of themselves.",
    "He worries about this, yes.",
    "Sergeant Garkor holds the command of the 10th squad. As a soldier, he is extremely able. IF his men are in trouble, he will be tirelessly working to save them. You should aim to make contact with him.",
    "They are, as you humans might say, the best of the best. As well as Sergeant Garkor, they have in their company a High Mage, two sappers and battle hardened foot soldiers.",
    "You might consider the role as that of an engineer. Or perhaps of a munitions expert.",
    "I have never heard of him. According to the report you made to the King he is the Gnome Liaison Officer at the eastern Karamja shipyard.",
    "It was a position Glough introduced. Gnome Liaison Officers are in general responsible for coordinating activities between Gnomes and other beings in our remote operations.",
    "In what way?",
    "I do not know him; he is from before my time. Glough would presumably have hand picked him.",
    "I must first introduce you to a colleague of mine who will be accompanying you on your mission.",
    "His name is Flight Commander Waydar. We must go now and meet Waydar. For security reasons I must ask you to wear a blindfold.",
    "Tough. You will be working with Flight Commander Waydar. We must go now and meet Waydar. For security reasons I must ask you to wear a blindfold.",
    "Welcome, adventurer, to the Underground Military Glider Hangar.",
    "We do not, if the truth be told. This hangar was part of Glough's contingency planning. Had the attacks by land and sea failed, he would have turned to air. It is fortunate that you managed to expose him. The military gliders in this hangar are a prototype for a much refined version of the standard variety we currently use. Let me introduce you to Flight Commander Waydar. Flight Commander Waydar, I would like you to meet [Player].",
    "Not just any old visitor Waydar; this is the person who exposed Glough and defeated his demon.",
    "Quite. He is now on a secret mission for the King. As you know, the 10th squad went missing during their mission to decommission the eastern shipyard of Karamja. We still do not know what happened, but evidence suggests they were blown far off course to the south.",
    "When reinitialisation has been completed, you are to fly to the south of Karamja with [Player] and accompany him on the mission.",
    "That Gnome is never stepping in this hangar again. He always was and still is a menace. Do you understand me?",
    "Very well. Notify me when you have managed to reinitialise. [Player], you will have to wait till reinitialisation is complete.",
    "We try to ensure the location of the hangar remains a secret. If you must know something, then know that it lies directly beneath the Gnomeball pitch. However, I cannot reveal the location of its entrance.",
    "There is a teleporter round the corner. You must use this.",
    "Come and find me on the Grand Tree. I will probably be at the bar.",
    "Glough left a code on the facility, which periodically needs to be entered if we wish to maintain the supply of power. Without going through the process of reinitialisation, we cannot power the mechanism which deploys the military gliders.",
    "Well done, adventurer. You have managed to break Glough's code. Now the process of reinitialisation is complete, you can truly begin your journey into the unknown.",
    "You are clearly a [man/woman] of many talents. Flight Commander Waydar, now that reinitialisation is complete, I order you to fly to the south of Karamja with [Player].",
    "You are to safeguard him on this potentially dangerous mission.",
    "[Player], speak to Waydar when you are ready to leave. And... good luck."
  ],
  "Option 3": [
    "Talk about Caranock..."
  ],
  "Option 4": [
    "Leave"
  ],
  "Waydar": [
    "Greetings High Tree Guardian. And greetings to you too, visitor.",
    "I see. Well, there are no more demons left here.",
    "Their standard gliders must have fallen prey to the tropical weather.",
    "We are no closer to reinitialising sir – the code is too hard. It is likely the only person who could do it is Glough.",
    "Yes sir.",
    "Yes sir.",
    "Understood.",
    "You should stock up well on food before our journey. I can carry only enough provisions for myself. Do you wish to fly right now?",
    "As you wish.",
    "I am not sure. We appear to have landed where the 10th squad crashed. The number of gnome gliders is correct. Unfortunately, it appears that none of their gliders survived the collision.",
    "Of course.",
    "What is the problem?",
    "His zeal in the matter is to be expected. The Royal Guard – in particular the 10th squad – are renowned for their fierce loyalty.",
    "I would rather not get involved. My mission is to protect you.",
    "You are becoming tiresome, human. As you wish. Foot soldier Lumdo of the 10th squad.",
    "I am Flight Commander Waydar. I believe you are under direct orders from your Sergeant to guard these gliders?",
    "I need not remind you that I outrank Garkor. As of this instant, your orders are to convey the human to the atoll and remain there until he needs to return.",
    "Then he can take up his issues with me personally.",
    "No. After all, somebody has to look after the gliders.",
    "Enough. Return here when you are done.",
    "It is good to see you again, Caranock. It is a strange island these monkeys inhabit.",
    "I am now a Flight Commander. My duties include testing Glough's prototype military glider.",
    "The human? Just somebody Narnode appears to have taken a fancy to. It is hard to tell why. I suspect the human was involved with Glough's fall from grace.",
    "I see. What do you have in mind?",
    "This I know. But I don't see how it leads to money or promotion.",
    "Narnode would be furious!",
    "Very clever. It might also serve us well to remind Narnode of Bolren's situation.",
    "Really? Typical meddling human behaviour. Nevertheless, it will stoke fires of worry. After all, the battle still continues.",
    "Understood. Military gliders are after all an untested form of transport...",
    "Caranock and I have a suggestion to make.",
    "The foot soldiers of the Royal Guard in your jail...",
    "You are of course welcome to your share of the profits.",
    "What of my human?",
    "Shall we return to Crash Island?",
    "As you wish.",
    "I am sure.",
    "Hmmm... as you wish... Why are you looking at me like that?"
  ],
  "Glough": [
    "You look frustrated, human.",
    "Of course they would. I'm the only one who knows how to do it.",
    "Let me guess, you need my help...",
    "I am able to remotely reinitialise...",
    "It will cost you...",
    "Oh... just a measly 200,000 gold pieces. Yes, I think that will do me nicely.",
    "Very well, then listen carefully. The glider hangar is the pride of the stronghold. It is well guarded... and alarmed. Were I to completely reinitialise the gliders from here it would trigger the hangar alarms. I'd rather my people didn't know I was assisting a human.",
    "Hear me out! I can set the hangar control panel so that you need only move one final piece to complete the reinitialisation.",
    "Finally, you're catching on. Now, I believe there is the small matter of payment...",
    "It's been a pleasure doing business with you.",
    "This isn't the last you'll see of me, human. Mark my words – the monkeys are listening."
  ],
  "Lumdo": [
    "Who are you two?",
    "What business do you have here?",
    "I might be. Do you have any way to prove that you are who you say you are?",
    "I see. Sorry for my distrust.",
    "I am indeed –",
    "Let me begin at the beginning, human. We were on our way to decommission Glough's old ship building facilities in eastern Karamja, as you probably know. However, we obviously chose the wrong season to fly. We were one gnome to a glider, so each was extremely light. Like leaves in a wind, we were blown south before we even landed on that island.",
    "Yes. The winds drove us into the treetops, which destroyed the canvas of our gliders. We dragged what remained of the gliders out onto this beach.",
    "While we were falling, Sergeant Garkor noticed a large populated atoll to our west. You cannot see it from here, but it is within sailing distance. We spent time gathering enough wood to fashion two boats. The Sergeant took the rest of the 10th squad in the larger of the boats to explore the island and to search for potential glider launch sites.",
    "Affirmative.",
    "And I have orders from the Sergeant to stay here.",
    "I will not take orders from you.",
    "I am under direct orders to remain here.",
    "Yes?",
    "That is correct, Commander.",
    "Garkor will not be pleased!"
  ],
  "Lumo": [
    "Look – a newcomer. I'd say let me be the first to welcome you to Ape Atoll, but I see you're already met the welcoming party...",
    "Hello – Who are you?",
    "Well we're certainly missing home, I'll give you that.",
    "Oh, not for too long ... The jaul guards keep us entertained every now and then too. Isn't that right Bunkdo?",
    "Oh yeah. Trefaji and Aberab – they're as dense as bricks. They do give mighty punches though.",
    "Your backside??",
    "Now, now lads, watch your language. You'll have to excuse them, human, they're only soldiers!",
    "So human, what can we do for you?",
    "Do your best to ignore him... To be fair human, you're not much help stuck in there...",
    "Well, you can try picking the lock on your door. Watch out for the guards though. We've been trying to pick ours but we haven't been able to do so yet."
  ],
  "Bunkdo": [
    "That's right Lumo. Remember the time when they got all confused when changing shifts?",
    "Indeed. My backside is still a little sore...",
    "I turned around at the wrong time...",
    "No it's alright [laddy/lass?], we quite like it in here."
  ],
  "Carado": [
    "Serves you bloody right too.",
    "Excuse me –"
  ],
  "Karam": [
    "That depends on who is asking...",
    "I see. As you can see, this is a dangerous place to be.",
    "Karam, 10th squad, Royal Guard. High Assassin at your service.",
    "I am thinking of a way to free my friends. In the meantime, I am helping those who further my cause.",
    "I have been gifted by Zooknock, our squad mage. I have saved his life on a number of occasions.",
    "Your best chance is to hide in this grass, human.",
    "I move quickly."
  ],
  "Garkor": [
    "A fine day you have chosen to visit this hellish island, human.",
    "Investigate the circumstances surrounding the mysterious disappearance of my squad. Yes, I know.",
    "The king and I are still in communication, albeit sporadic. I decided I need a human of your calibre to assist me. It is pleasing to see you are still alive.",
    "There is more going on than meets your eye, human. Did you not find it strange that an entire squad be sent to decommission a shipyard?",
    "Indeed. But there are more pressing matters at hand. Three of my squad have been captured and placed in the jail. They are watched over by somewhat overpowering guards. Before we can resume our original mission we must rescue them.",
    "Trust me; we too have considered this, but whilst it is possible for one, it is near impossible for three. We have considered many things. I have my squad mage and sappers working below us right now. My assassin Karam is operating in the village itself. I remain here so that I may overhear Awowogei's plans.",
    "The self-proclaimed ruler of the island. I have been listening to him for some time now. I believe we will incur a minimum of casualties if we have an insider – a monkey working for us.",
    "I wasn't suggesting convincing them, human, but you.",
    "Do not be so sceptical... you humans are considered to be quite closely related to monkeys.",
    "Go and see my squad mage, Zooknock. Tell him I have asked you to be 'disguised' as a monkey so that you may infiltrate the village. As you will see, he is something of an expert on the subject.",
    "Just go and find my squad mage, human.",
    "My my, Zooknock has outdone himself this time. You do look very much like a monkey you know.",
    "And by happy coincidence you appear to be just the right sort of monkey. I need you now to seek audience with Awowogei. Claim you are an envoy form the monkeys of Karamja and are seeking an alliance. You must win his trust if we are to succeed.",
    "Well done on winning Awowogei's trust. I overheard everything from here. However, your efforts may be in vain...",
    "Progress in the caves has been slow. Whilst you were in Ardougne, Bunkwicket and Waymottin overheard a slightly disturbing conversation.",
    "Listen closely whilst I narrate the details...",
    "Zooknock and I have come up with a plan.",
    "I hope you were listening closely. The teleportation spell that was provided will teleport ALL of the 10th squad, no matter where we may be. In effect, the spell will break Lumo, Bunkdo and Carado out of the jail for us.",
    "Indeed. This is where you come in. Do not forget that we are the 10th squad of the Royal Guard, and that we are more than capable of holding our own. With your assistance, we should be able to defeat whatever is thrown at us.",
    "Simple. We fool the teleportation spell that you are in fact a member of our squad.",
    "Zooknock knows Glough's grasp of magic well. He believes the spell is linked to the sigils that all of our squad carry. It is these sigils that identify us as a member of the squad.",
    "Welcome to the 10th squad, [Player].",
    "It is a replica Waymottin has made of our squad sigils. If you wear that when the spell is cast, you will be summoned along with the rest of us. You should prepare. Collect your thoughts and belongings and then wear the sigil. Hurry, human, we do not wish to enter this fight without you.",
    "Yes – but do not do so until you are ready.",
    "Ready yourself, human: the final battle begins!",
    "Well done, human! That was a most impressive display of skill.",
    "You should report to King Narnode immediately. Tell him that the 10th squad still survives and has suffered no casualties.",
    "Speak to Zooknock. He will arrange for you to leave."
  ],
  "Zooknock": [
    "A human... here? What business have you on Ape Atoll?",
    "Well you've found us – what's left of us, that is. I am Zooknock, the 10th squad mage. These are Bunkwicket and Waymottin, two of our finest sappers. I assume you will want to know how we got here?",
    "Your story first, human. What possessed you to travel to this forsaken island?",
    "You were sent alone?",
    "The so called Crash Island. We left there one of our number, Lumdo, to guard our gliders until our return.",
    "He did!? He was explicitly ordered to guard the gliders! How did this happen? Who is guarding the gliders now?",
    "Flight Commander Waydar you said? For some reason that name is familiar...",
    "The rumours are correct. We were indeed blown off course. Fortunately, we managed to find a small island to steer our gliders towards, else we surely would have drowned.",
    "Correct. I assume Lumdo told you this?",
    "We split up into several smaller groups to search the island for potential gnome glider launch sites. Whilst we knew the island to be inhabited, we did not expect its occupants to be quite so... militant.",
    "Monkeys. Lots of monkeys. They are unlike any other type of monkey we've come across. A far cry from the usual wild variety, these were armed with high quality weaponry and uncanny tactical ability. We were overwhelmed in numbers. Some of us managed to escape but the rest were taken captive.",
    "Myself, the Sergeant, Bunkwicket and Waymottin here. Karam, our assassin, probably managed to escape – he usually does.",
    "Lumo, Bunkdo and Carado were captured, as I said. We believe they are being held in the jail. We are working on a way to release them. I have sensed there lies a cavern to the north. We are attempting to tunnel to this northern cavern and then move upwards from there.",
    "We have considered this, but every entrance seems to be excessively guarded.",
    "Aha. He wants me to turn you into a monkey.",
    "I think you misunderstood, human. Do you know why you were sent here?",
    "Indeed. However, King Narnode Shareen is still in contact with Garkor! You were sent here because Garkor specifically asked Narnode for you!",
    "Before you arrived on this island, that information would have endangered both yourself and the mission.",
    "Garkor had long decided that we need a monkey insider. I have the necessary magic to perform the shapeshifting spell, but we needed a human to transform.",
    "It has been tried in the past, but the results were far from... satisfactory. Although we, like you, are related to the monkeys, the link is too weak for a successful transformation. That is why we need you.",
    "There will be two aspects to your transformation. We must first arrange it so that you are able to understand and communicate with the monkeys. We must also transform your body so that you may pass amongst them unnoticed. So that the effects of my spells are not permanent, I will invest their power into magical items which you must find. You can then use them at your will.",
    "For the spells to take full effect , they will have to be in some way related to the monkeys. I suggest that I invest the ability to communicate with the monkeys in an authentic monkey amulet. Similarly, the transformation spell should be stored in a monkey talisman of some kind.",
    "We need a gold bar, a monkey amulet mould and something to do monkey speech.",
    "I am not sure. You look wealthy enough to know the answer to that question anyway.",
    "They ought to be for sale in the village, but be careful: you probably will not be able to walk straight in and buy one.",
    "I don't know. I'm sure you'll think of something.",
    "We need some kind of monkey remains as well as an authentic magical monkey talisman.",
    "I'll leave that to your better judgement... However, bear in mind the type of remain might affect the type of monkey you become...",
    "Then bring me different monkey remains and another talisman.",
    "There ought to be something in the village. I cannot be sure, as I have not spent much time there.",
    "Well done, human. Now listen closely, human. I will cast a spell to enchant this gold bar with the power contained in these monkey dentures. You must then smith the gold bar using the monkey amulet mould. However, unless you do this in a place of religious significance to the monkeys, the spirits contained within will likely depart.",
    "Somewhere in the village. It ought to be obvious. Now give me a moment.",
    "Bear with me human: I must now cast an extremely powerful spell. It is not often we are successful in investing shapeshifting powers within objects.",
    "I am afraid I have not been able to fully invest my powers in that talisman. You may use it, but it will continue to draw its energy directly from me. The range at which I will be able to sustain it is limited. I cannot ensure it will be effective off the atoll. Furthermore, you will not be able to attack whilst using this, so be careful. Perhaps when I refine my spells I could look into making this possible.",
    "Well done, human. Bear with me now."
  ],
  "Monkey Child": [
    "Hello big-big. Aunty told me not to talk to strangers.",
    "You look strange to me!",
    "You're strange! Go away!",
    "Then who are you?",
    "Uh ah! You do look like my uncle!",
    "You look a lot bigger than last time, Uncle!",
    "I'm bored.",
    "Aunty told me to pick loads of bananas. She said if, I got bananas, she'd give me a new toy!",
    "Twenty! But I can't count! It's very mean of her, isn't it Uncle?",
    "Ok! Ook Ook!",
    "Ok Uncle!",
    "Did you get any bananas, Uncle?",
    "Wow that's a lot of bananas! Are there twenty?",
    "Aunty will be so happy!",
    "No, not yet... she said she's too busy dealing with something called humans.",
    "Yeah – it's really neat!",
    "But I only just got it!",
    "Ok then..."
  ],
  "Elder Guard": [
    "Grrr... What do you want?",
    "Only the Captain of the Monkey Guard or those he authorises may enter this building. You will need his permission to enter.",
    "He goes by the name of Kruk."
  ],
  "Kruk": [
    "What brings you up here, monkey?",
    "That's right – you do. What business have you on our island?",
    "I see. Very well, you look genuine enough. Follow me."
  ],
  "Awowogei": [
    "Greetings, visitor. What brings you to my island?",
    "I see. Ours is a strong and mighty lineage of monkey, visitor. We clearly do not need your offer of an alliance.",
    "What is your opinion, Murowoi?",
    "I must admit, I have always regarded your kind as our inferior cousins, visitor. However, I am well aware that you may have a few things to offer.",
    "Be silent, Uwogo. I have heard your kind are exceptionally resourceful. I wish to put this reputation to the test. You must be well aware your kind are hunted and trapped almost everywhere. I particular you may have heard of such activities in a city known to the humans as Ardougne. There are several of your kind kept captive there. I challenge you to free one and return it to me.",
    "That is for you to decide, visitor.",
    "Have you brought with you a captive?",
    "Well done! You have shown yourself to be very resourceful. You have managed to complete an extremely long journey remarkably quickly.",
    "You are clearly well acquainted with the ways of this world. We will talk more on this later. In the meantime, feel free to remain as long as you like on my island.",
    "I must think upon it some more and discuss the matter with my advisors. We will contact you when we are ready.",
    "It is always dark here, Gnome. Why have you asked to see me in private?",
    "Then be quick about it.",
    "Why would I want to do that? Your king would declare war on my island.",
    "Intriguing. I have recently secured an alliance with the northern monkeys, which may prove useful. What would you have me do?",
    "Such as?",
    "Even those who escaped?",
    "What human??",
    "I should hope so, for both of your sakes. Very well. I shall let you know when I have dealt with the Royal Guard.",
    "With access to one of Glough's 'pets', I don't think I'll need it..."
  ],
  "Uwogo": [
    "I don't believe him, Awowogei. Never trust a northern monkey.",
    "Don't listen to him Awowogei!"
  ],
  "Muruwoi": [
    "I think he seems trustworthy, sir."
  ],
  "Monkey minder": [
    "Why do you monkeys keep trying to escape? Good thing I've caught you before you got away, you little scoundrel.",
    "Let's put you back in your cage where you belong...",
    "What??",
    "I must be imagining things... monkeys can't talk.",
    "My word – what are you doing in there?",
    "Well, don't worry. We'll have you out of there shortly.",
    "No problem."
  ],
  "Monkey": [
    "Hello there!",
    "Escape!? It's all I ever think about!",
    "Where will you be taking me?",
    "Wowee! I was born there you know!",
    "Yes. Actually, can I bring some of my friends?",
    "Pleeeeease?",
    "Pretty pleeeeease?",
    "Pretty please with a banana on top?",
    "Ook!"
  ],
  "Bonzara": [
    "It looks like you're trying to escape. Would you like some help?",
    "Right you are.",
    "Never mind that child. You should worry more about who you are and the nature of the forces that have driven you here.",
    "We WILL meet again, Player."
  ],
  "[Monkeyface chathead]": [
    "Whatever could he mean?"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Monkey_Madness?oldid=36210095’"
  ]
}