{
  "Osman": [
    "Hmm, the ransom message the kidnappers gave you concerns me.",
    "Please get Ozan and meet me back up in the vault. There is something I need you both to see before you get it into your heads again to steal the Kharid-ib. Will you do this? It might get dangerous...",
    "Excellent. My guards inform me that Ozan is back loitering at the foot of the palace steps.",
    "Very well, perhaps some other time. Though I fear it is something of which only you and Ozan will be capable of doing.",
    "One other thing... Ozan gave me something to give to you.",
    "Well, are you bringing Ozan or not? I'll wait for you both upstairs, but please use the front door this time.",
    "I am wholly convinced your aim has always been to rescue Prince Ali, and that you were only trying to steal this diamond in order to pay his ransom. But I caught you in the act. And that was just as well, for – if you recall – the first part of the ransom message says to 'follow the path of the sun'.",
    "Forget that second part for a moment – I don't know what that alludes to. What I do know is that 'the path of the sun' is somehow linked to the Kharid-ib... The REAL Kharid-ib.",
    "True enough, but it is still not the real Kharid-ib. And if you had succeeded in stealing this fake, you would not have been able to find the prince. By getting you to follow this path of the sun, the kidnappers ensure that they are delivered the real diamond. There is no way to even find Prince Ali without taking the Kharid-ib, let alone rescue him.",
    "I shall not dishonour myself or the emir's memory by disobeying his last order.",
    "Because I understand how you think, Ozan, and I did not want you to attempt another theft... especially if all you ended up with was the fake.",
    "I'm not asking you anything. I'm not telling you anything. And I'm certainly not helping you to steal anything. Are we clear on that?",
    "Hmm, what I can tell you is that placing the heavy weight on the diamond display triggers an alarm, which is how I caught you before. So maybe you should just keep hold of it...",
    "Let's just say that your banishment was a lenient sentence. Whoever steals the diamond best not return to Al Kharid without it.",
    "Indeed. And you a great agent.",
    "Now, I shall lock this vault, and it shall not be opened again until the prince is safely returned. And remember: I was never here; this conversation did not happen. Good luck to you both.",
    "Well, congratulations are in order. You have safely returned Prince Ali home. That is, Emir Ali now he has succeeded his father. He'll prove to be a strong leader for Al Kharid.",
    "No, Ozan lost the diamond.",
    "I did not ask him to steal the diamond. In fact, I told him not to. That was his choice.",
    "Keep your voice down, girl. Ozan knew what was at stake. He chose his path and must take responsibility for his actions. Perhaps if his thieving skills were as good as he thinks, he'd have brought the diamond back with you.",
    "In this game, you have to be prepared for anything.",
    "You will do as you are told and return to your area in Draynor!",
    "Leela, please...",
    "Leela, please...",
    "Ah, Leela... That girl becomes more like her mother every day. She'll come around, she always does. Anyway, as I said before, congratulations are in order. You have shown yourself to be a most efficient agent, and for that you must be rewarded. Indeed, I may have more work in future for someone with your ability..."
  ],
  "Ozan": [
    "I'm sorry I slipped away after the emir's death. Had to clear my head, you know? Got myself officially reacquainted with Al Kharid – they have some tasty kebabs at Karim's.",
    "Really? Even after all that business in the palace?",
    "You think maybe he's come up with a plan to rescue Prince Ali? Then lead on! Let's go talk to him!",
    "Come one! Let's go see Osman in the vault.",
    "Sure thing. Talk to me again when you're ready.",
    "'...into the lion's mouth' Yes, I remember it.",
    "I've handled enough precious gemstones to know that's a real diamond!",
    "Then why tell us all of this?",
    "Wait, is it that you don't want us to steal the diamond at all, or just not the wrong diamond?",
    "Is this how spies ask for help?",
    "I don't suppose you can also NOT tell us where the real diamond is?",
    "Right...the heavy weight... And what would happen to someone if they were to steal this diamond?",
    "Right. Of course. You're a crafty one, I'll give you that. I see how it is you became spymaster. You'd make for a great thief.",
    "Come on, we've got to move fast. Grab the heavy weight again, then let's get out of here. If you've got any questions, we can talk once we're out of Al Kharid. For now, just trust me.",
    "Come on, we've got to move fast. Grab the heavy weight again, then let's get out of here. If you've got any questions, we can talk once we're out of Al Kharid. For now, just trust me.",
    "Good, now let's get out of here. You go first.",
    "Let's climb back down to the emir's bedroom window on the west of the roof.",
    "Grab the heavy weight from the scales again before we head up to the roof.",
    "Not that way - too many guards. Let's climb down and head back to the bank's roof.",
    "We'll get caught by the guards if we go that way. Plus, I don't like how that cat's looking at me.",
    "Let's climb back down to the emir's bedroom window on the west of the roof.",
    "Okay, we should use the rope to get back to the roof of the bank.",
    "We can't go down the ladder – it's too far to the next roof, and there are guards posted on the gate there. Maybe we could jump for it – there's a cart against the bank's south wall that could break our fall...and maybe our legs too...but we don't have much choice.",
    "This is going to be fun!",
    "Can we go again? Okay, this 'path of the sun' has got to be in the desert somewhere, so let's head around the back of the palace to Shantay Pass and get out of here.",
    "Excuse me? We're not taking you anywhere. Me and my friend here are heading into the desert.",
    "Like I just said: we're the ones going, not you.",
    "Right... I think you've had too much sun, effendi. You just stay here in the shade.",
    "Yeah, we just said...",
    "Really, you don't have to...",
    "Er, thanks...I think.",
    "Well, that was weird. Did it seem to you that Shantay was acting weird for a moment there?",
    "You don't think something was controlling him, do you? Like what Keli did to those mercs back in Draynor?",
    "Yeah, I guess. It was still weird, though. Let's just press on.",
    "Ah, take in that air – the open desert. Smells like adventure... and maybe just a hint of ugthanki dung. So, did you have any questions before we continue?",
    "Basically, yeah. He's sneaky, that one. You have to read between the lines of what he's saying. I guess that comes with the turf when you're a spy. He made it pretty clear he agreed with us about using the diamond, the REAL diamond to return the prince. But also that he's not officially supporting us, because of his orders from the emir. So he told us what we needed to know, then turned a blind eye. Taking none of the risk, but no doubt all of the glory if we succeed.",
    "Right now, it's like we were never caught, except that we didn't steal a fake diamond. So we'd be fine to go back to Al Kharid now...though we really should continue on and save Prince Ali. I'm thinking once we've retrieved the Prince, I'll steal the diamond back somehow and we can return them BOTH to the palace. That way, no one but us and Osman will ever know it was gone.",
    "Then I get branded a traitor of Al Kharid, and can never return on pain of death. Good times, huh? It's situations like this that make it all worthwhile.",
    "Nah, you'll be fine. Osman's smart enough to lay all the blame at my feet. With my reputation, that shouldn't be too hard for people to believe.",
    "Osman plain as said to not put it on the diamond display, but to keep hold of it. And thinking about it, it's a typically devious Kharidian trap... Hide things in plain sight, tempt you with a shiny decoy, and then throw in some nasty deathtraps just for laughs. It's the number one cause of death for professional tomb raiders, you know? Also, I don't know if you've read it, but the lore of the diamond has it that one of the nine ambassadors swallowed the diamond to steal it.",
    "Exactly! At least, I think so. We should find out for sure before we go any further.",
    "Alright, let's crack open that fat little ambassador and see what we've won!",
    "Hello, beautiful!",
    "Did that screech come from the diamond?",
    "Well, that's new. I guess Osman wasn't kidding about this diamond showing us the way...",
    "I dunno, but it's got a carving of Het's face on its base - he's the desert god those scales back in the palace vault were modelled on. This is definitely the right place to start!",
    "Any joy with that sundial yet?",
    "The detailing on the base seems to be of the lesser god Het, if that helps any? He's the most human-looking of all the desert gods. It looks like you've gotta rotate the sticky-up part to point at one of the symbols on the sundial's face. I doubt it'll help us here, but I could tell you a little about the desert gods...",
    "There are eight gods in the desert pantheon - one for every day of the week, plus another for luck. There's the head honcho, Tumeken, and his wife, Elidinis.",
    "Yeah, and they've got two kiddies: Icthlarin's an okay dude, but the less you say about his sister, Amascut, the better. She started out fine, but something happened to her - most people call her the Devourer these days, on account of her being a destructive, murderous psycho.",
    "Tumeken also created four 'lesser' gods, what that's supposed to mean. First you've got strongman Het. He's pretty popular in Al Kharid - the statue scales in the emir's vault was of him. Then there's Apmeken - she's a cheeky monkey. Next up is Crondis, a snappy crocodile goddess. And finally you've got lonely little Scabaras...but then I reckon you'd be lonely too if you had a beetle for a head.",
    "You're right, we've got more pressing matters.",
    "Nicely done! What did you do?",
    "You mean Het. Het sundial; Het symbol. That simple, huh? That beam of light coming out the sundial must be our 'path of the sun'. I guess that means we follow it. At this rate, we'll have the prince released before the day is out! Let's go!",
    "That damage was caused by dehydration from desert heat! Carrying waterskins is essential for desert survival. I gave you one of my spares. If it runs empty, find and cut a healthy cactus - you can find them all over the desert.",
    "The Shantay Pass sundial pointed south-west, and the rumble we heard wasn't too far away. My guess is that another sundial rising out of the sand.",
    "Look, there's the sundial, but...something's off. Let's get closer.",
    "What? That's not a very bandit-y thing to say!",
    "Oh my gods, it's the diamond! The Kharid-ib is talking to us through him.",
    "We'll see about that!",
    "Huh? The top part of this sundial has broken off. I bet those bandits have it...Are you ready to take them on?",
    "Sure thing. Talk to me again when you are.",
    "The last bandit dropped the broken sundial piece.",
    "I can't believe it – the diamond's trying to get us killed!",
    "And leave the prince to die? If we don't rescue the prince, Menaphos will start up the war again – how many innocent people will die then, just so a shiny rock can sit on its pedestal? Just because it can talk, doesn't mean it's alive.",
    "We should hurry and fix this sundial.",
    "Hey, good, you've got the part to fix that broken sundial.",
    "Any joy with that sundial yet?",
    "This one has an Apmeken design. Aww, look at that cute little monkey face. I doubt it'll help us here, but I could tell you a little about the desert gods...",
    "That's two! Looks like the next one is north-west of here. The rumble seemed muted this time, somehow... Let's go!",
    "Hey, is that the base of the sundial? Where's the sundial itself? Let's take a closer look.",
    "Oh, it's just the same piece that was broken off the last sundial. But where's the sundial itself? It should be here.",
    "That's enough out of you, diamond! We're not turning back! I've got a bad feeling about this... Hang on, it's more of a sinking feeling...",
    "Quicksand! This is great! I've never been in quicksand before!",
    "It'll make for a more exciting story when I retell it.",
    "Nah, quicksand's not that dangerous if you know how to escape.",
    "Just get your legs up and lay flat – make yourself buoyant.",
    "Er, it's not working... Why isn't it working? This isn't right! This isn't how quicksand works! Not real quicksand!",
    "I can't reach it either.",
    "Neither can I.",
    "Anyone! We're over here!",
    "I don't know what to do.",
    "Nothings' working. We can't get out! This can't be how it ends... Leela! She'll never know that I-",
    "Argh, my leg! You okay? We got lucky. If there hadn't been this cavern underneath, we'd have drowned in that quicksand. But not that lucky. I saw the diamond fall out of your pack when you landed... and I think I saw something scuttle away with it.",
    "It's just a diamond. If it could move by itself it wouldn't need us to take it home. Also, I didn't see where that sundial bit went either. But at least we found the third sundial! Could you look around and see what you can find? I landed on something hard; I've hurt my leg. I need to rest up for a moment.",
    "Wasn't the quicksand enough? Try searching one of these tunnels, maybe?",
    "Find anything?",
    "Having fun there?",
    "What am I sitting on? It's really uncomfortable... Oh, hehe. Um, hey, over here. I, um, found that missing sundial piece. I absolutely wasn't just sitting on it, honest. Well, the sun's not gonna shine on it there...",
    "All fixed! Over to you.",
    "Any joy with that sundial yet?",
    "This one has Crondis on it. You can see her crocodile jaw jutting out beneath the sundial's face. I doubt it'll help us here, but I could tell you a little about the desert gods...",
    "I didn't feel a rumble that time... Hmm, maybe the next sundial isn't so close, or it's because we don't have the diamond. But hey, at least the sundial lit up one of the tunnels!",
    "Probably not, but there's only one tunnel lit up. We'll just have to hope it leads us to the diamond.",
    "Ladies first...",
    "Wisdom before beauty...",
    "Come on, let's keep moving.",
    "Don't go fast! My leg still hurts. Just need to walk it off. I'll be fine. It's totally not just numb from sitting on that sundial piece for long.",
    "Let's get the diamond back first!",
    "*shh* Can you hear that? What is that noise?",
    "And that smell? Urgh!",
    "I think it's getting darker too.",
    "Looks bad, sounds bad, smells worse...",
    "But we need that blasted diamond back!",
    "I can just make out a tunnel ahead.",
    "I can't see a thing! With that noise and that smell, I'm almost glad. Aiiee! My shin! ... Err, what did I just step in? ... Hang on, I think I can feel a torch... No, that's definitely NOT a torch. Sorry about that... ... Ah, but THAT is. H-hang on, almost got it... ... Dung kalphites... Why did it have to be dung kalphites? ... Any one of these kalphites could be rolling the diamond around! It's a needle in a haystack! Well, a diamond in some, er...yeah. I mean seriously, come on. We're up to our eyeballs in-",
    "I know, I was just about to say we're in some really deep-",
    "Are you SHUSHING me?",
    "Ah, you're right! You're a genius! I can hear the diamond! We can use the noise to figure out which dung ball it's in! We should be able to see it sparkling too!",
    "Listen for the noise the diamond makes and keep your eyes peeled for it sparkling. I'll check out some kalphites myself - I'll shout if I see or hear anything.",
    "If we can't find the diamond that way, just try slicing open some of these dung balls.",
    "Look over here!",
    "I think I just saw something!",
    "There's one sparkling over here!",
    "Hey, I think the diamond noise just got a little louder. Look for one that's sparkling!",
    "A sapphire? Well, it's not a diamond, but it's a promising start.",
    "That one dropped an emerald! Look for another one that's sparkling!",
    "A ruby this time! We're making our way up - the next one's gonna be our diamond, I can feel it!",
    "There it is! You've found the diamond - quick, grab it before these little bugs roll it away again!",
    "Hey, great. That must have been the fourth sundial rising! And look: it's made a hole in the ceiling. It's too high to reach, though... Any ideas how we can get out of here?",
    "No way! Is that you, Leela?",
    "Sure is! We're both down here.",
    "Thanks, we'll be up in a second... *whispers* Before we head up, can we keep what happened on this little underground detour between us? *whispers* You know, what happened down here stays down here. Leela doesn't need to know.",
    "Haha, yeah, me too...so let's just get out of this dung heap – see you topside!",
    "Let's just say you don't wanna go down there; it's no cave of wonders.",
    "We are the help! But he at least sort of gave us the Kharid-ib...",
    "Well, technically...",
    "This was his idea! Leela, listen: the emir is dead.",
    "Why would you assume I did anything? He's been ill for ages and his heart just gave out.",
    "There's one other thing - the diamond... it's more than just a diamond. It' s been...talking to us, trying to get us to take it back to Al Kharid.",
    "Easy there, princess – you'll give me a bad reputation.",
    "Now, let's have a look at this sundial...",
    "Any joy with that sundial yet?",
    "It's got Scabaras on it. As if the kalphites down there weren't enough, now we're facing their beetle-headed patron. I doub't it'll help us here, but I could tell you a little about the desert gods...",
    "Okay, that's the last of them! It's pointing south-west.",
    "Yeah, that could be where Keli is holding the prince. Let's just hope we don't run into Amascut too. There's only room for one power mad, control freak of a lady in this kidnapping.",
    "Of course!",
    "Well, Keli knew about the path of the sun thing, so she's not giving up Prince Ali until she has the diamond in her hands. So I guess we'll just have to give it to her... but that doesn't mean we can't get it back once the prince is safe...",
    "So, let's go!",
    "Okay, that's the last of them! It's pointing south-west. So, let's go!",
    "That sundial pointed south-west. Let's keep an eye out for that Amascut temple Leela mentioned. Did you want me to tell you about Amascut?",
    "Okay, well Amascut is a goddess - she's the daughter of Tumeken, who's the head honcho in the desert pantheon. She started out okay - in fact, she was well-loved from what I hear. The temple we're looking for would once have been filled with her worshipers. But something happened to her - some people say during the God Wars, some say either just after or before it even started. Whatever it was and whenever it happened, though, she snapped...and ever since, she's been making life hard for people in the desert. And now she's done so much bad, caused so much destruction, that her followers have abandoned her and most just call her the Devourer these days.",
    "Sure thing, let's keep moving.",
    "If you've hurt the prince, I swear I'm gonna ki-",
    "... Fine. Let's just get this over with.",
    "Yes, we have the diamond. Hand over the prince.",
    "It's the diamond again – it's talking through Apep.",
    "It's the diamond again - it's talking through Apep.",
    "I don't know!",
    "Enough with the evil monologue, lady. You've got your damned diamond, now hand over the prince!",
    "Hey, Keli! Quit with the crazy! Just give us the prince!",
    "Hey, don't get me wrong. I'd be the first to admit you're pretty statuesque... but you're one camel short of a caravan, and the whole psycho kidnapper thing really damages your appeal. Now give us the prince!",
    "Hey, Apep – nice eyepatch. I can see why you wear it; it's to make your friend over there look half as ugly, right?",
    "Leela and I have your back. Take these guys out!",
    "That's those two thugs taken care of.",
    "You got us this far, so you should be the one to take the last step and free the prince.",
    "About that. I'm, er, I'm not sure how to put this...",
    "Yes, you three should definitely do that. It's been an honour rescuing the prince with you, my friends.",
    "That's probably the nicest thing you've ever said to me, Leela. But I cannot return to Al Kharid until I've reclaimed that diamond... somehow... from a goddess hell bent on destruction. A 100% crazy, perpetually angry, scarily vengeful, bona fide goddess... Hey, if nothing else, it'll be a challenge, right? Should be fun!",
    "And good luck to you, my friend. I'm certain we'll bump into each other somewhere down the path. And when I return the diamond, maybe you'll stop being so hard on me, eh, princess?",
    "See you around."
  ],
  "Player": [
    "Osman told me to pass on that your past actions are forgiven, and that you're welcome back as a citizen of Al Kharid.",
    "Nobody blames us for the emir's death. Apparently, it was a long time coming. Osman knows we were trying to do the right thing. In fact, he says he's got something to show us.",
    "Are you saying this one on display is a fake?",
    "So give us the real diamond – we'll go save him!",
    "And, hang on, who put our rope to the roof back in place?",
    "As clear as swamp tar.",
    "It's locked!",
    "I probably shouldn't destroy this...",
    "I probably shouldn't break in there again.",
    "It's locked[sic]",
    "Maybe I should go and collect Ozan from outside the palace. We still need to use the Kharid-ib to 'follow the path of the sun' to find Prince Ali and rescue him.",
    "Yeah, one moment he seemed really scared, then he got all confused. It was like talking to two different people.",
    "No, for one thing his eyes weren't glowing. Oh, and he didn't try to kill us.",
    "And if you can't get the diamond back?",
    "Would that be true for me too?",
    "So the real Kharid-ib was INSIDE the heavy weight the whole time?",
    "How is a sundial going to help us?",
    "Not yet - got any ideas?",
    "So they're like a king and queen?",
    "Who are the other four?",
    "I rotated the bit on top of the sundial to point at the symbol of the man.",
    "Ozan, I don't think it's the bandit doing the talking – it's like what happened with Shantay.",
    "Are you sure? It might just be trying to warn us. Maybe we should just turn back...",
    "Well, when you put it like that...we should continue on.",
    "Nope. Which god does this one depict?",
    "What is it?",
    "You're happy about this? How exactly is this great?",
    "But aren't we going to die? It's quicksand!",
    "And how do we do that?",
    "Er, I can't move.",
    "Okay, we need to try something else.",
    "I can't reach it.",
    "Its' too far away.",
    "I...can't...move...",
    "Help! Someone please help!",
    "I'm still sinking!",
    "Ozan! No! It can't end like thi-",
    "You don't think it was trying to escape on purpose, do you?",
    "This sundial is broken too?",
    "Nothing yet.",
    "These tunnels are too dark, I keep getting turned around.",
    "None yet - who's on this one?",
    "Can we trust this sundial, though? It's not on the surface where it's meant to be.",
    "*shh*",
    "*shhhh*",
    "I could do with not knowing myself.",
    "You wouldn't believe us if we told you.",
    "It's not that simple, Leela. Things in Al Kharid got...political.",
    "Yes! It wasn't Ozan's fault, Leela. Please, cut him some slack.",
    "Aww, this one's broken too!",
    "No, who's on this last one?",
    "What could that mean?",
    "What's the plan when we get there?",
    "What do I do?",
    "I...I can't stop her, she's too...powerful.",
    "Well, come on then, Stick and Stone, let's fight!",
    "You're leaving? But we've just rescued the prince!",
    "Good luck with that!",
    "You can't just blame that on Ozan!",
    "It wasn't that simple!"
  ],
  "Cat": [
    "Meow."
  ],
  "Shantay": [
    "Where are you taking me?",
    "I do not wish to go there – I'm scared.",
    "Please, take me back home.",
    "... Oh, er, hello, effendi. I'm sorry, I did not see you there. How can I help you? Are you heading into the desert?",
    "Here, I insist you take some supplies.",
    "It is done, effendi."
  ],
  "Bandit king": [
    "Why won't you take me back home?",
    "Turn back now; take me back to the palace.",
    "Take me back or you will die.",
    "... What? Who are these two? Kill them!"
  ],
  "Leela": [
    "Hello? Is someone down there?",
    "Ozan?",
    "You boys/two need a hand? Hang on, I will lower a rope.",
    "Over here!",
    "What is that godsawful stench?",
    "Alright... In which case, what news from my father? Is he sending help?",
    "What do you mean 'sort of'? Do not tell me you stole it!",
    "I do not believe you! You will never change!",
    "I sent you to my father for help, and this is how you go about it?",
    "What? What did you do?",
    "Oh, and that just coincided with your visit, I suppose?",
    "You are right, I'm sorry I snapped. Maybe you should tell me the whole story...",
    "What? Do not be silly. I grew up in the palace – if it were more than just a diamond, I would have known or heard about it. It is probably just your guilty conscience talking...or heat stroke. But you have nothing to feel guilty for. My father had no right to manipulate you like that, but that you did it anyway, even knowing what you might lose if things go wrong - that's very...selfless of you.",
    "You cannot just take the compliment, can you? Anyway, I am glad you're both here. Truly.",
    "Not to worry! I saw this bit fall off when it rose out of the sand. Here, let me...",
    "Fixed! From the sound of it, this should be the final sundial for you to solve.",
    "What was next? The lion's mouth was what the ransom note said, right?",
    "If I remember, there used to be an old temple to Amascut out that way. Amascut's animal aspect is a lioness, so perhaps that's what it means.",
    "You do mean Lady Keli by that, right?",
    "It is not much of a plan...but I suppose it is all we have got.",
    "Ozan, don't!",
    "What makes you think we trust you to hand him over once you have it?",
    "What in the world is...?",
    "By the gods, it really does talk!",
    "No, wait! You cannot.",
    "No, wait! You cannot.",
    "What in the world is going on?",
    "By the gods, it really does talk!",
    "Just do something!",
    "Er, centuries?",
    "We should do you a favour and put the other eye out... and maybe cut off your nose and ears too.",
    "Hey! Only Ozan gets to call me that! I mean, I AM NOT A PRINCESS!",
    "Ozan and I will support you. We have to defeat these two thugs!",
    "Come on, we should free the prince.",
    "I will leave the honour of freeing the prince to you.",
    "Oh, prince...you are right. It was his heart - I am so sorry we could not rescue you sooner.",
    "Then we should waste no time. We must get you safely home.",
    "We would not have got this far without you.",
    "Oh, Ozan.",
    "*sigh* We shall see...",
    "...I hope. Come on prince, it is time to go home.",
    "It is not all good news, father - we lost the diamond.",
    "That is unfair and you know it! He only did what you asked of him!",
    "No, you manipulated him into doing what YOU wanted. Just like you do with your agents! Just like you do with me!",
    "We were up against a goddess! Amascut was behind this whole thing!",
    "Well, I refuse to play your 'game' anymore.",
    "No, I am going back to Senliten! We are doing some actual good out there!",
    "I am leaving. Amascut and Menaphos are plotting gods-know-what. She has to be stopped...",
    "Oh, I shall return to Draynor, but not for you. I have some loose ends of my own there to deal with. I am done with you and your games!",
    "I am leaving. Amascut and Menaphos are plotting gods-know-what. She has to be stopped...",
    "I am sorry for how my father treated you and Ozan. At least you are not thought of as a traitor of Al Kharid.",
    "I came back to make sure that Khnum was being guarded. I am going to work with the locals to take down the Skulls gang - make Draynor a little bit safer. I have been stationed here so long, it is the least I can do.",
    "Once I have finished up here, I do not know for sure. All I do know is that Amascut is out there with the Kharid-ib, plotting untold destruction. And I feel partly responsible for that. If I can find a way to stop her, then that is what I shall do. But it will not be father's way - not any more.",
    "He is as infuriating as my father. But instead of taking things too seriously, he does not take ANYTHING seriously. Plus he has a way of just getting under my skin. I misjudged him, though. He has changed. He sacrificed going home to rescue Prince Ali. He is a true hero... ...just an annoying one."
  ],
  "Lady Keli": [
    "Well, well, well. This feels familiar...",
    "I see you have trained him well, Leela.",
    "Anyway, to business. Do you have the heart?",
    "The diamond first.",
    "What makes YOU think you have a choice? Give it to me!",
    "Do I really have to start making threats again? I will kill him! The diamond – now!",
    "So be it... Apep: kill the prince!",
    "That's your final warning. Say no to me again and I won't just kill him - I'll kill all of you!",
    "Do I really have to start making threats again? I will kill him! The diamond - now!",
    "So be it... Apep: kill the prince!",
    "That's your final warning. Say no to me again and I won't just kill him – I'll kill all of you!",
    "I grow tired of asking! If you won't give it to me freely, I'll force you to!",
    "Silence!",
    "Finally! After all these centuries...it's mine!",
    "In some ways, I've been after this heart since the day I was born.",
    "And now that I hold it in my hands, it's so small...so hard...so cold... That explains so much.",
    "Crazy? You dare call me crazy? I am beautiful! I am powerful!",
    "I'll pop your limbs from their sockets! I'll strip the flesh from your bones! I'll devour your SOUL! I'm not crazy! I am a goddess! I AM AMASCUT!",
    "[Soul!]",
    "[Heru, Apep: Kill these fools.]"
  ],
  "Apep": [
    "Please, no! Don't give me to her!",
    "Please, no! Don't give me to her!",
    "You can't make me!",
    "Looks like the lady wants you all dead.",
    "Sticks and stones, 'princess'.",
    "Watch it, Heru!",
    "Dervish!",
    "Whirling dervish!"
  ],
  "Heru": [
    "I'm scared! She'll kill us all.",
    "I'm scared! She'll kill us all.",
    "I'm scared! She'll kill us all.",
    "I want to go home!",
    "Yer, dead!",
    "Hahahahahaha- Hey! Take that back!",
    "Grrr!",
    "Yer, stick 'n' stone!",
    "Sunburst!",
    "Did I get 'em?",
    "Bwahahahahahaaaaa!",
    "Apep!"
  ],
  "[Apep and Heru]": [
    "..."
  ],
  "[Leela and Ozan]": [
    "Amascut!"
  ],
  "Prince Ali Mirza": [
    "Thank you, my friends. I am glad you have come to my rescue...but you should not have given her the Kharid-ib. I cannot believe my father would have allowed it.",
    "He is...dead?",
    "It is okay, Leela. He has been ill for a long time. He has been preparing me to succeed him as emir...but one can never be prepared for the death of a loved one."
  ],
  "Amascut": [
    "Ah, Jabari. What message does the emir have for me?",
    "Excellent. I may need your skills as an 'ambassador' again in the future.",
    "Ha! He thinks it his salvation, but it will be his undoing.",
    "I almost didn't. That beetle-brained fool, Scabaras, almost ruined things. But he's poked his head out of the sand now. I'll deal with him soon enough, and then nothing will stand in my way... Return to Menaphos; attend the pharaoh. I have business here."
  ],
  "Jabari": [
    "None anymore, my lady. My mission was a success. Osman was suspicious of me from the start - no surprise there - but he was so distracted with the kidnapping I had free reign of the palace. A tiny dose of poison in the emir's nightly incense did the trick. They believe his death to be of natural causes.",
    "The payment was also delivered.",
    "Did you get the heart, my lady?",
    "Yes, my lady. I live to serve, and serve to live."
  ],
  "Khnum": [
    "Oh, it's you - the [artful dodger/enforcer/Don/swindler]. Ha! You may not have been on my side, but you certainly earned your title...",
    "Look - I don't like you, and I'm guessing you don't like me. I don't regret my actions, but... ...if you see Ozan, at least tell him I'm sorry.",
    "Not happy with my assessment of your character, eh? Well, what sort of low-life scum DO you see yourself as, hmm?",
    "Ha! If you say so.",
    "Your current title isn't one I gave you."
  ],
  "Set your title to": [
    "[Artful Dodger/Enforcer/Don/Swindler]."
  ],
  "(See Transcript": [
    "Jail guard)"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Diamond_in_the_Rough?oldid=33006363’"
  ]
}