{
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "dialogue with the Prince/Princess, missing dialogue from one of the conversations with Prince BrandYou can discuss this issue on the talk page or edit this page to improve it."
  ],
  "Guard": [
    "Halt! Who goes there?",
    "I'm afraid the King won't give an audience to anyone except a worthy hero.",
    "Then you may pass."
  ],
  "Player": [
    "My name is [Fremennik name], will you not let me through?",
    "I am a member of the Heroes' Guild; does that not show my worth?",
    "I am known in these lands as [Fremennik name], Your Majesty. I come in search of a quest.",
    "If I may be so bold, Your Majesty, I think Miscellania would rest in capable hands with me.",
    "Then do not stray far, Your Majesty, for I shall soon return.",
    "And you say this is a mere formality, Your Majesty?",
    "I'm afraid I must decline, Your Majesty. The call of adventure is too strong for me to accept a sedentary life.",
    "Your Majesty.",
    "Not yet, Your Majesty.",
    "What am I meant to be doing again?",
    "How do I make peace with Etceteria?",
    "How am I supposed to get the Prince or Princess to marry me?",
    "How am I supposed to get the Prince to marry me?",
    "How am I supposed to get the Princess to marry me?",
    "What can you tell me about the King?",
    "What can you tell me about the Prince?",
    "What can you tell me about the Princess?",
    "What can you tell me about Queen Sigrid?",
    "Er...Hello, Your Majesty.",
    "Yes, I...",
    "Er, I...",
    "If I m...",
    "Your Majesty!",
    "I have been sent by King Vargas to negotiate a treaty of peace between your two great nations.",
    "This isn't already the case?",
    "What happened then?",
    "I shall go ask him to officially recognise Etceteria.",
    "Not yet, Your Majesty.",
    "Your Majesty.",
    "I have, Your Majesty. She says she will agree to peace as long as Miscellania recognises Etceteria as a sovereign nation.",
    "Why is that, Your Majesty?",
    "I'm sure I can convince her there are better anthems.",
    "Your Majesty.",
    "Not yet, Your Majesty.",
    "I have, Your Majesty. He says he will recognise the country when you change your anthem.",
    "I'm afraid he insisted, Your Majesty.",
    "I'll see what I can do, Your Majesty.",
    "Not yet, Your Majesty.",
    "I need someone to compose a new anthem for Etceteria.",
    "You can take your time, really...",
    "...that's lovely, thanks.",
    "I lost my copy of the *ahem* theme you composed...",
    "Yes, Your Majesty, but I'm afraid it isn't very good.",
    "I got Prince Brand to compose a new Etceterian anthem for me, but it's awful!",
    "Here you go.",
    "I lost the corrected anthem you gave me.",
    "I'm afraid I don't have one.",
    "Yes, here it is.",
    "Yes, Your Majesty.",
    "Not yet, Your Majesty.",
    "I'm afraid I lost it, Your Majesty.",
    "Your Majesty.",
    "I have here a treaty awaiting your signature.",
    "Your Majesty.",
    "Not yet, Your Majesty.",
    "I have a slightly strange request... The King needs to sign a treaty, but is unable to because he lacks a pen large enough for him to hold. Could you make me a nib of the right size?",
    "About the size of a helm should do it.",
    "I don't have one with me.",
    "I have one here.",
    "Your Majesty.",
    "Here it is, Your Majesty.",
    "Not yet, Your Majesty.",
    "Your Majesty.",
    "Good day, Your Royal Highness.",
    "As I'm sure you are aware, your father the King is seeking someone to rule the Kingdom in his stead. I have put myself forward, but in order for me to become ruler...",
    "Yes, Your Royal Highness.",
    "I take it you are not especially fond of any of them?",
    "Of course, Your Royal Highness.",
    "No.",
    "No, I was just showing you.",
    "What do you think of Advisor Ghrim?",
    "I think he's far too grumpy.",
    "No wonder you turned out like this...",
    "He's been very helpful.",
    "Sneaky sneaky stick da chompy.[Or other random remark]",
    "So, you practice archery? I see you have a bow mounted on your wall.",
    "Archery is a noble art!",
    "You should listen to your father.",
    "Archers are all cowards!",
    "Selling ring of poverty 30 mil![Or other random remark]",
    "So, tell me about all these other suitors you have.",
    "I don't know why they bother...",
    "Hahahaha! I can hold them still for you if you like.",
    "I have confidence in your skills, Your Royal Highness.",
    "You monster!",
    "I was only joking.",
    "Selling ring of poverty 30 mil![Or other random remark]",
    "My name is [Fremennik Name], Your Highness.",
    "If I may call you Astrid, Your Royal Highness.",
    "Very well, Princess.",
    "So what's the history of these islands?",
    "Why did he do that?",
    "Hahahaha!",
    "Well excuse me, Princess!",
    "He probably deserved it.",
    "What happened next?",
    "Don't threaten me with a dead fish![Or other random remark]",
    "What would you do if you ruled this Kingdom?",
    "That sounds like a good idea.",
    "What a silly idea! As if anyone would be interested!",
    "That's not very enterprising.",
    "What level do you need to cook cats?[Or other random remark]",
    "So why are you so interested in archery?",
    "I'm quite fond of it myself.",
    "You should stick to knitting.",
    "You should try swordfighting instead.",
    "Care to sign my petition for pet frogs?[Or other random remark]",
    "Good day, Princess.",
    "Of course, Princess.",
    "No, I was just showing you.",
    "Could it be that I have succeeded where so many before me have failed, and finally melted the heart of the fair Princess?",
    "Well, I've seen better...",
    "It's a lovely little country.",
    "It's boring.",
    "Look over there! A King Black Dragon![Or other random remark]",
    "Do you go out into battle often?",
    "And you call yourself an archer?",
    "I suppose you don't have much opportunity to.",
    "Hunting the mighty rabbits outside the castle? Slaying the foul fowl that terrorises the town?",
    "Nah, that Kalphite was weedier than your garden.[Or other random remark]",
    "What do you think of your brother?",
    "I really don't like him.",
    "And what a great bard he makes!",
    "I have heard better drains!",
    "Sneaky sneaky stick da chompy.[Or other random remark]",
    "Hello, darling.",
    "Princess Astrid, will you marry me?",
    "No, my darling, I was just showing you.",
    "Not yet, my darling.",
    "Good day, Your Royal Highness.",
    "As I'm sure you are aware, your father the King is seeking someone to rule the Kingdom in his stead. I have put myself forward, but in order for me to become ruler...",
    "Yes, Your Royal Highness.",
    "I think you may find I know good poetry when I see it, Your Royal Highness...",
    "Beards? Dangerous, flammable and make you look mad!",
    "Care to sign my petition for pet frogs?",
    "Cattle prod? Weapon of choice I reckon.",
    "Don't threaten me with a dead fish!",
    "He is clearly 1 cup short of a full service.",
    "I'm a little teapot, short and stout...",
    "I'm rubber you're glue.........!",
    "Lies!!! It's all lies!!!",
    "Look over there! A King Black Dragon!",
    "Lumbridge? No, I wouldn't be seen dead there.",
    "Nah, that Kalphite was weedier than your garden.",
    "Selling ring of poverty 30 mil!",
    "Sneaky sneaky stick da chompy.",
    "What level do you need to cook cats?",
    "Of course, I'd love to.",
    "Be still, my heart.",
    "That doesn't even rhyme!",
    "And then what happened?",
    "Oh. I see.",
    "So, you practice the harp? I see you have one over there.",
    "You will be the greatest bard!",
    "You're an awful bard.",
    "You should listen to your father.",
    "I am surprised you do not have hordes of people vying to be your betrothed, Your Highness.",
    "No-one's ever heard of you.",
    "They don't understand your poetry as I do.",
    "They're all already married.",
    "Good day, Your Royal Highness.",
    "Of course, Your Royal Highness.",
    "No, I was just showing you.",
    "I'm flattered to hear you say so, Your Royal Highness.",
    "My name is [Fremennik name], Your Highness.",
    "Very well, Prince.",
    "What would you do if you became ruler of Miscellania?",
    "A much nobler pursuit, to be sure.",
    "If only you were any good at them...",
    "You're just afraid of responsibility.",
    "I don't know if I have time for a whole saga...",
    "How inspiring!",
    "I think my ears are bleeding.",
    "That's not a saga!",
    "So, why did you decide to become a bard?",
    "How poetic.",
    "Wait, are you the moth or the mage?",
    "That's a strange metaphor...",
    "Good day, my Prince.",
    "Of course, Prince.",
    "No, I was just showing you.",
    "Could it be, my Prince, that you would consider wedding a crass adventurer such as myself?",
    "What do you think of your sister?",
    "I'm glad to hear it.",
    "You should listen to your father.",
    "What art is that?",
    "Not really, but it can't be that hard.",
    "I wouldn't presume to have the skill...",
    "There once was a man from Varrock...",
    "I'd love to!",
    "That was lovely. I'm touched!",
    "Eyes...ship...sail...what?",
    "That was awful!",
    "Hello, darling.",
    "Prince Brand, will you marry me?",
    "No, my dear, I was just showing you.",
    "Not yet, dear.",
    "Your Majesty.",
    "[She/He] has, Your Majesty.",
    "...is that all?"
  ],
  "King Vargas": [
    "Who are you? Who seeks audience with the King of this fair land of Miscellania?",
    "Ah, it pleases me to see such enthusiasm! I was once an adventurer such as yourself; even while fulfilling my duties as King of Miscellania, I would roam the lands in search of adventure, and strike down mighty foes with a single blow! Unfortunately, I was a little too daring, and attempted to brave the icelands, where I finally met my match. I survived, barely, but I was cursed for the rest of my life to stay in this form. Which leaves me incapable of performing my duties as ruler. This is why I am looking for an exceptional soul to be regent of this fair kingdom of Miscellania.",
    "Hahaha! You are bold, [Fremennik name], but then I have yet to see a good ruler who was not. You will first have to demonstrate your worth. You are a good warrior, that I do not doubt; however ruling also requires a good grasp of diplomacy. We have been at war with neighbouring Etceteria for hundreds of years; however, I think both of us have rather lost our appetite for hostilities. Now may be an opportune time to make amends. If you manage to negotiate peace with them, then you will truly have shown your skill as a diplomat.",
    "Wait! There is one more matter to discuss... a mere formality, of course. By Miscellanious tradition, one may not become ruler of the kingdom if one is not part of the royal family. You will have to convince either my daughter, Princess Astrid, or my son, Prince Brand, to marry you.",
    "I am sure they won't be able to resist your heroic charms. You can ask Ghrim for advice; that's what he's here for, after all.",
    "I can assure you that I managed to heed that same call, and ruling this land was no hindrance to me. However, I understand your decision. Fare thee well!",
    "How are you getting on, [Fremennik name]? Have you talked to Queen Sigrid of Etceteria?",
    "Hmph! You can tell her I'll officially recognise her country as soon as she changes the Etceterian national anthem.",
    "It's insulting! The title alone, \"You're Stupid, We're the Best\", should be enough to give you an idea!",
    "How are you getting on, [Fremennik name]? Have you convinced Sigrid yet?",
    "How are you getting on, [Fremennik name]? Have you convinced Sigrid yet?",
    "I doubt I will be able to hold an ordinary pen well enough to sign the treaty. You will have to find a pen large enough for me to hold.",
    "How are you getting on, [Fremennik name]? Have you found me a pen yet?",
    "How are you getting on, [Fremennik name]? Have you found me a pen yet?",
    "Excellent! And now, with a flourish, I sign the end of the rivalry between our two proud kingdoms! Now, has either of my children agreed to marry you?",
    "Well, keep at it then!",
    "Ghrim tells me that the population is not yet very supportive of the idea of having you as ruler. You should try to gain their support.",
    "Ghrim tells me that the population would be glad to have you as a ruler.",
    "How are you getting on, [Fremennik name]? Have either of my children agreed to marry you?",
    "How are you getting on, [Fremennik name]? Has my [daughter/son] agreed to marry you?",
    "How are you getting on, [Fremennik name]? Has my [daughter/son] agreed to marry you?",
    "Excellent, excellent.",
    "Ghrim tells me that the population is not yet very supportive of the idea of having you as ruler. You should try to gain their support.",
    "Ghrim tells me that the population would be glad to have you as a ruler. I see no reason to delay your regency any further. Ghrim, please proceed with the ceremony.",
    "That is all. I wish you luck as Regent. Speak to Ghrim if you require assistance."
  ],
  "King varg": [
    "How are you getting on, [Fremennik name]? Have you talked to Queen Sigrid of Etceteria?"
  ],
  "Advisor Ghrim": [
    "Greetings, [Sir/Madam].",
    "Negotiating peace with Etceteria, [Sir/Madam].",
    "Wooing either the fair Prince Brand or the equally fair Princess Astrid, [Sir/Madam].",
    "Wooing the fair Princess Astrid, [Sir/Madam].",
    "Wooing the fair Prince Brand, [Sir/Madam].",
    "Gaining the support of the population, [Sir/Madam]. Currently, [your percent]% of the population supports you.",
    "You will need 75 % of the population in your support in order to become Regent.",
    "This is enough for you to become Regent; I should talk to King Vargas if I were you.",
    "You should go talk to Queen Sigrid of Etceteria.",
    "You should talk to the King.",
    "You should go talk to Queen Sigrid of Etceteria.",
    "You should find someone to compose a new anthem for Etceteria.",
    "You should get another copy of that anthem.",
    "You should show the anthem to Queen Sigrid.",
    "You should show the treaty to the King.",
    "You should find a way to make the nib and body for a very large pen.",
    "I think you may find that talking to them would be a good way to start.",
    "You could hardly go wrong with a gift of flowers, and of course talking to him is important. He is also very receptive of praise for his musical performance.",
    "You seem to have impressed him at least somewhat. He has quite the sweet tooth, and is very fond of cake, if you take my meaning...",
    "He has grown very fond of you; you would do well to show you are fond of him too.",
    "When the time comes to actually ask for his hand in marriage, do not forget the engagement ring.",
    "I have watched the admirers come and go, trying to win her heart, and I can tell you this is no easy task. You can hardly go wrong with a gift of flowers, and of course talking to her is important. I also hear she favours suitors who knows how to dance.",
    "You seemed to have impressed her at least somewhat. She is quite the archer, collects bows, if you take my meaning...",
    "You seemed to have impressed her at least somewhat.",
    "She has grown very fond of you; you would do well to show you are fond of her too. When times come to actually ask for her hand in marriage, do not engagement ring.",
    "She has grown very fond of you; you would do well to show you are fond of her too. When times come to actually ask for her hand in marriage, do not engagement ring.",
    "King Vargas would often go and help out his subjects in their daily tasks, when he was still able to do so, and they loved him dearly for it. Currently [your percent]% of the population supports you.",
    "You will need 75 % of the population in your support in order to become Regent.",
    "This is enough for you to become Regent; I should talk to King Vargas if I were you.",
    "What would you like to know, [Sir/Madam]?",
    "King Vargas was once a brave and noble adventurer, well-loved by his subjects. Unfortunately, he was cursed while seeking a quest in the icelands to the north, and is now unable to reign.",
    "Prince Brand has always dreamed of becoming a famous bard; unfortunately, his musical and literary skills are somewhat lacking. He has no interest in ruling the kingdom, and seems to spend his time daydreaming or composing quite awful poems, and sagas of totally mundane events. He is rather vain, if you'll pardon my saying so; he will greatly appreciate any compliments on his poetry. He also has quite a sweet tooth.",
    "Princess Astrid thinks she'd be perfectly capable of ruling the kingdom, but her father doesn't trust her enough by herself. Especially since she devotes herself to the - as the King sees it - cowardly skill of archery rather than the noble skill of melee combat... She is fond of jewellery, and of course she collects bows. She is also quite the conversationalist. She has many admirers, but has yet to be impressed by any of them.",
    "Queen Sigrid is quite envious of King Vargas, since he has the larger kingdom. The King and she have never seen eye-to-eye, but I think if you approach her you may find her quite reasonable.",
    "Greetings, [Sir/Madam].",
    "Oh dear. Well, that is only to be expected. May I see it, please?",
    "Hmm, yes...allow me to make a few adjustments. There you go, [Sir/Madam]. Are there any other matters in which I may be of assistance?",
    "Greetings, [Sir/Madam].",
    "Do you have another copy of the prince's anthem for me to correct?",
    "If you bring me another, I can correct it. Are there any other matters in which I may be of assistance?",
    "Yes, sir. We are gathered here today to witness the rise of a new hero to the regency of the Kingdom of Miscellania, to continue the work of our great King Vargas who is unfortunately now no longer able to rule. By the powers invested in me by the Miscellaneous Constitution, I declare thee, [Fremennik name], to be the new Regent of this fair kingdom. May you bring success and prosperity to Miscellania and to all of its people."
  ],
  "Queen Sigrid": [
    "Hello.",
    "Have you come for a particular reason? I am a busy Queen, you know. I had to attend the opening of a new orphanage this morning.",
    "And this afternoon I shall be receiving the Embassador[sic] of Karamja and accompanying him on his week-long tour of Etceteria.",
    "Then this evening we shall be putting on a grand ball! All of the kingdom's nobility will be present!",
    "Oh, who am I kidding...nothing ever happens here. I always wanted to be a princess when I was a girl. If I'd been told it would be like this, I wouldn't have bothered.",
    "Yes? Did you want something?",
    "Great nations? Don't make me laugh. Still, peace sounds like a nice idea. He will, of course, have to recognise Etceteria officially as a sovereign nation.",
    "I'm afraid not. Last time we met I called him a pompous old fool for thinking he was still worth anything as an adventurer. He promptly declared war, claiming the land of Etceteria belonged to Miscellania. When he realised neither of us had an army, he was ever so angry!",
    "He set off for the icelands to prove me wrong and, well, I expect you saw what happened to him.",
    "Hello. Have you talked to Vargas yet?",
    "Hello. Have you talked to Vargas yet?",
    "What? But it's a great anthem, I composed it myself! Listen! ''You're stupid, we're the best, Etceteria beats the rest! and Queen Sigrid is very pretty, King Vargas is a fool, hey, nonny-nonny!''",
    "Well, it can't be helped I suppose... You'll have to find a bard to write a new one though. And there isn't a bard to be had for love nor money in Etceteria.",
    "Hello. Have you found a new anthem yet?",
    "Hello. Have you found a new anthem yet?",
    "Let's see now...",
    "'Etceteria, Etceteria,Oh what a great country it is,Etceteria, Etceteria,So I wrote a song about it.'",
    "'It's somewhere in the sea,And it looks very nice,If it weren't for your ancestors,It wouldn't be there at all,'",
    "'And when things aren't going too well,We sing this lovely song,And then we'll all feel so much better,It won't take very long.'",
    "Oh dear, no, this simply won't do. Find a better one.",
    "Hello. Have you found a new anthem yet?",
    "Let's see now...",
    "'Etceteria, Etceteria,Of our country we are proud!Etceteria, Etceteria,Let all sing its name out loud!'",
    "'Rising high above the water,The jewel of the North!Our mothers and our fathers,To build this land came forth!'",
    "'And in the times of darkness,Sing praises of our land!And in our hearts we can be sure,Our victory is at hand!'",
    "Why, this is quite good! I'm surprised! Here is a treaty declaring what we've mutually agreed to. I've already signed, so all it needs is King Vargas' signature and it'll be official.",
    "Hello. Has Vargas signed the treaty yet?",
    "How silly of you. I'll make you another."
  ],
  "Prince Brand": [
    "You've come to the right bard! I'll write one for you immediately!",
    "No problem, I'm already done! Here, listen!",
    "'Etceteria, Etceteria,Oh what a great country it is,Etceteria, Etceteria,So I wrote a song about it.'",
    "'It's somewhere in the sea, And it looks very nice, If it weren't for your ancestors, It wouldn't be there at all,'",
    "'And when things aren't going too well, We sing this lovely song, And then we'll all feel so much better, It won't take very long.'",
    "Here's a copy, you can keep it!",
    "Don't mention it, [Sir/Madam].",
    "Fear not! I made many, many more!",
    "Good day, [Sir/Madam].",
    "...you have to marry somebody in the royal family, namely myself?",
    "Ahahahaha! Come now, what interest would I have in a crass adventurer like yourself? What would you know of the poetry that flows through my veins like an avalanche through a peaceful mountain village?",
    "This may be the case. I am willing to give you a chance; if you impress me enough, I will consider accepting to marry you.",
    "...What?",
    "...What?",
    "...What?",
    "...What?",
    "...What?",
    "...What?",
    "...What?",
    "...What?",
    "...What?",
    "...What?",
    "...What?",
    "...What?",
    "What's wrong, [Sir/Madam]?",
    "What's wrong, [Fremennik name]?",
    "What's wrong, dear?",
    "Thank you. It's nice to be appreciated.",
    "Thank you, [Fremennik name].",
    "Thank you, dear.",
    "I'm staying right here.",
    "What's so funny, [Sir/Madam]?",
    "What's so funny, [Fremennik name]?",
    "What's so funny, dear?",
    "You dance well, [Sir/Madam].",
    "(Transcript missing. edit)",
    "Let's not get ahead of ourselves now, [Fremennik name]!",
    "You flatter me, my darling.",
    "(Transcript missing. edit)",
    "(Transcript missing. edit)",
    "No thank you, dear.",
    "I composed a poem, would you like to hear it?",
    "I got upThis morning,And had an eggFor breakfast",
    "I'm glad you liked it.",
    "Quiet! What would you know about poetry?",
    "No, that's the whole poem.",
    "Yes; I play the lyre and the harp, and compose songs, poems and sagas to move you, to delight you and entertain you! Sadly, my father does not think much of the art. What do you think?",
    "I'm so glad you agree!",
    "I am insulted, [Sir/Madam]!",
    "I'm sorry you feel that way.",
    "And why do you think that might be, [Sir/Madam]?",
    "I am insulted, [Sir/Madam]!",
    "Mmm, a very good answer, [Sir/Madam].",
    "Hm, no, I don't think that's the right reason.",
    "Good day, [Sir/Madam].",
    "Are these for me? Really?",
    "Thank you! They're lovely!",
    "Oh, all right.",
    "You have perhaps more poetry in your soul than I first thought, [Sir/Madam]...",
    "Oh, but I realise you have not yet told me your name!",
    "Then I shall I call you [Fremennik name], [Sir/Madam], and you shall call me Prince.",
    "I am glad you agree.",
    "I am insulted, [Fremennik name]!",
    "Perhaps you are right...",
    "I composed a saga, would you like to hear it?",
    "Don't worry, it's quite short. Here we go!",
    "Once upon a time there was a Prince,And Brand was his name,He always had a song in his heart,And a rhyme in his head,",
    "And he became the world's greatest bard,And delighted one and all,With his songs and sagas,And Brand was his name!",
    "Thank you! I thought I would compose something for future generations, to tell them my story.",
    "If you don't appreciate my singing, you are free to leave!",
    "It's a short one, I'll admit...",
    "Poetry and music have always fascinated me. I am drawn to them like a moth to an overenthusiastic mage who has set himself on fire.",
    "Why thank you. Sometimes I amaze even myself.",
    "The moth!",
    "It is a simile, but what do you know of poetry?",
    "Good day, [Fremennik name].",
    "Is this for me? Really?",
    "Thank you! It's lovely!",
    "Oh, all right.",
    "I must admit I am growing quite fond of you, [Fremennik name].",
    "Not yet, my darling; let us just say my heart is a maze of inescapable tunnels, and you are the light at the end of one of them.",
    "We don't always see eye-to-eye, but she understands my art better than our father.",
    "Of course, she couldn't understand as well as you do, my darling.",
    "I'm sorry you think so.",
    "Music and poetry. Surely you haven't forgotten already?",
    "Tell me, have you ever composed any poems yourself?",
    "You don't seem to understand poetry at all...",
    "You're right, it takes great skill and inspiration to be a great poet such as myself.",
    "Don't lower the art of poetry with such bawdy rhymes!",
    "I wrote a song about you. Would you like to hear it?",
    "Your hair is like a waterfallOr perhaps a bramble bushYour eyes are like an ocean on whichI want to sail the ship of our love!",
    "I'm glad you liked it, my darling.",
    "Was it really that hard to understand?",
    "Fine! See if I write you any more songs!",
    "Hello, dear.",
    "I couldn't possibly accept this.",
    "Is this for me? Really?",
    "My heart is an open book to you, my darling, and all the pages say yes... ''Yes''! We'll have to put off the actual ceremony until we can find a priest, but you can tell my father I have agreed to marry you.",
    "Oh, all right.",
    "How are you doing, my darling? Have you convinced my father yet?"
  ],
  "Derrik": [
    "Good day, [Sir/Madam]. Can I help you with anything?",
    "Hm...I may be able to manage that. What sort of size?",
    "All right, but I'll need an iron bar to make it from.",
    "Well, come back when you have one.",
    "Good. Just a minute... Here you go! One giant pen nib!"
  ],
  "Princess Astrid": [
    "Good day, [Sir/Madam].",
    "... you have to marry somebody in the royal family, namely me?",
    "You realise, I hope, that I have many admirers.",
    "That is true. However, I am willing to give you a chance; if you impress me enough, I will consider accepting to marry you.",
    "I couldn't possibly accept this.",
    "Are these for me? Really?",
    "Thank you! They're lovely!",
    "Oh, all right.",
    "You've already given me some, but thank you.",
    "Impressive. I like someone who knows how to dance.",
    "Your dancing never ceases to amaze me, [Sir/Madam].",
    "He's a bit scary sometimes, but he's always so nice to me! When I was young, I called him Uncle Ghrim.",
    "I'm sure he'd lighten up if you were nicer.",
    "I'm insulted, [Sir/Madam]!",
    "Yes, my father made a wise decision when he chose him to be his advisor.",
    "...What?",
    "Yes; my father thinks it is a cowardly art, but I find there is just as much courage, and more skill, involved in going into combat with just a bow and quiver. What do you think?",
    "I'm so glad you agree!",
    "I'm sorry you feel that way.",
    "I am insulted, [Sir/Madam]!",
    "...What?",
    "They never cease to bother me. They swarm around me like flies, all hoping to win my heart. Perhaps I should use them for target practice!",
    "I don't know why YOU bother.",
    "How do you know I wouldn't hit you as well?",
    "...What?",
    "You are perhaps a more interesting man than I first took you for, Sir... Oh, but I realise you have not yet told me your name!",
    "Then may I call you [Fremennik Name], Sir?",
    "You may call me 'Princess'.",
    "Well, nothing very exciting ever happened until my father declared war on Etceteria...",
    "Queen Sigrid of Etceteria insulted him.",
    "It's not that funny.",
    "I'm insulted [Fremennik Name]!",
    "He realised that neither of us have an army.",
    "...What?",
    "Very little. It's not as if there's much to it... I might try to set up trade with other islands.",
    "Thank you.",
    "Watch it or you won't get the chance to do better.",
    "Fine. You try to do better!",
    "...What?",
    "I'm not sure. Even when I was little, archery always fascinated me.",
    "It's good to know someone who shares my interests.",
    "I'll knit you a lovely jumper, shall I? It'll keep you warm when I have you exiled to the icelands.",
    "That's not really the kind of thing I'm interested in.",
    "...What?",
    "Good day, [Fremennik Name].",
    "Is this for me? Really?",
    "Thank you! It's lovely!",
    "Oh, all right.",
    "I must admit I am growing quite fond of you, [Fremennik Name].",
    "Not yet, my dear; let us just say you have made it onto the shortlist.",
    "So, my dear, what do you think of Miscellania?",
    "I'm quite fond of it my self...",
    "I'm glad you like it.",
    "Then perhaps you shouldn't be thinking of becoming its ruler.",
    "...What?",
    "Not often, no. I sometimes go hunting...",
    "I take what chance for practice I can get.",
    "Exactly! Perhaps you could take me with you sometime, dear.",
    "That's not funny.",
    "...What?",
    "We don't always get along, but I'm sure he's a nice guy at heart.",
    "That's not a nice thing to say.",
    "Haha! Oh yes, quite the bard, he is.",
    "You don't sound like a nightingale your self!",
    "...What?",
    "Hello, dear.",
    "*giggle* My, aren't you the charmer?",
    "That's very sweet, darling.",
    "Is this for me? Really?",
    "Oh, my dear. I thought you'd never ask! Of course I'll marry you! We'll have to put off the actual ceremony until we can find a priest, but you can tell my father I have agreed to marry you.",
    "Oh, all right.",
    "How are you doing my dear? Have you convinced my father yet?"
  ],
  "Do you wish to try and earn the hand of Princess Astrid in marriage?WARNING": [
    "Once made, this decision cannot be changed."
  ],
  "Do you wish to try and earn the hand of Prince Brand in marriage?WARNING": [
    "Once made, this decision cannot be changed."
  ],
  "Prince brand": [
    "...What?",
    "...What?",
    "Hello!",
    "You are silly!",
    "Oh, I would never concern myself with such trivial matters as those involved in ruling a Kingdom. My interests lie solely in the arts."
  ],
  "Congratulations! You have completed": [
    "'Throne of Miscellania' - Complete this Experienced quest."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Throne_of_Miscellania?oldid=35334874’"
  ]
}