{
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "Dialogue if you don't have a hatchet at chopping part of dream realm, dialogue with Lokar Searunner, dialogue with the rest of the pirates at all points of the voyage, misc dialogueYou can discuss this issue on the talk page or edit this page to improve it."
  ],
  "Player": [
    "Hello there.",
    "Hey! Don't call me outerlander! I'm known as the mighty [Fremennik Name]!",
    "You don't look like a Fremennik yourself...",
    "You've been away from these parts a while?",
    "Erm... no... That's you then, is it?",
    "Why did you leave?",
    "Oh..... Kaaaaay.....",
    "Was the world good then? Only, you seem to have returned to Rellekka after all.",
    "I see. So where are you and your scurvy seadogs headed to next? Arrr shiver-me timbers!",
    "Sorry, got caught up in the moment.",
    "The Moon Clan... I think I've heard of them...",
    "A problem?",
    "Cosmic. But you went there okay?",
    "Why not, I've always wondered what the state of my innards are!",
    "A Seal of Passage? What's that?",
    "So I have to try and bring peace to two warring nations who have been fighting for centuries?!?!",
    "Well, I will try. I am the mighty [Fremennik Name], after all!",
    "So I just have to go talk to Brundt the Chieftain and tell him I want a Seal of Passage? That's it? Because in my experience simple tasks like that always seem to take longer than I expect...",
    "Okay, I'll be right back.",
    "No thanks, I'd like to live.",
    "Well, 'bye then.",
    "Well, 'bye then.",
    "Well, 'bye then.",
    "Not yet...",
    "Hi there, Brundt. Could you help me out with a seal of passage?",
    "Well, I've heard that there have been great troubles between your people and those of the Moon Clan. I was hoping to help, so I need a seal of passage to show my intentions.",
    "I will see what I can do. Can I have the seal then?",
    "Hi there.",
    "Oh, you know. Ongoing negotiations.",
    "I'm glad you're confident in my abilities.",
    "I lost my seal of passage!",
    "Uh... yeah... Well, Brundt the Chieftain gave me a seal, but I think I lost it somewhere along the way...",
    "Yup, I've got it right here!",
    "Arrr! Yar! Let's be on our way, yar!",
    "Um... isn't that how pirates talk?",
    "Why yes! Tally-ho!",
    "Not just yet...",
    "Hello again Lokar.",
    "Can you take me back to Rellekka please?",
    "Nothing thanks! I just saw you here and thought I'd say hello!",
    "Hi Lokar, can you take me back to your ship?",
    "Yes please.",
    "No thanks. I've changed my mind. Again. I don't want to go.",
    "Well, 'bye then.",
    "Hello.",
    "Uh... something something open, something something food?",
    "Okay...",
    "Hello there.",
    "What are you doing?",
    "Okay. What are you doing?",
    "A few hours late or a few miles down the road?",
    "Great. What are you doing?",
    "Okay, OKAY!",
    "Hey, how you doing?",
    "I'm not a stowaway! That Lokar guy invited me aboard...",
    "Hello. See anything good through your telescope there?",
    "You seem unhappy about that... Wouldn't a barbecue on the beach be fun?",
    "Hello.",
    "No, Lokar offered me a lift in Rellekka actually.",
    "I kind of am, and I kind of aren't. It's a long story.",
    "'Bye.",
    "So... You're a pirate, huh?",
    "How's that working out for you?",
    "You mean you have insurance?",
    "I can imagine.",
    "I'm not a stowaway! Honest! I was invited here!",
    "Why, what do they usually look like?",
    "Okay then...",
    "Brrrr! Its cold up here!",
    "REALLY?",
    "You know, I've always wondered what life as a pirate actually entails.",
    "I'm not a stowaway! I was invited aboard! By Lokar! Ask him!",
    "I'm not a stowaway! I was invited aboard!",
    "Aren't you a little short for a pirate?",
    "More info than I wanted, thanks!",
    "Yar! We be pirates, yar! Avast, ye scurvy land-lubbing lychee!",
    "Okay. Sorry.",
    "Well, I was planning on visiting the Moon Clan, but I have to say your ship is very impressive.",
    "Yes, she's certainly one of the finest boats I've seen on my travels!",
    "So how's life as a pirate?",
    "I'm a freelance troubleshooter.",
    "Mostly killing things for money and delivering items around the planet for people. I collect stuff.",
    "Can't complain, can't complain..",
    "Aye-aye cap'n!",
    "Oh, Lokar offered me a journey. He said you could take me to the island of the Moon Clan.",
    "So... You won't take me to Lunar Isle?",
    "So... What can you tell me something about this 'Moon Clan'? It all seems very mysterious I must say...",
    "What kinds of items?",
    "No, I guess it isn't.",
    "What were you doing at Lunar Isle anyway? I always thought pirates would be... You know. Out pirating.",
    "So you went to Lunar Isle for supplies?",
    "So what made you change your mind?",
    "M-monsters?",
    "So you didn't attack the Moon Clan because you were worried you would yourself be attacked by these monsters trying to make your escape?",
    "The next reason?",
    "It was?",
    "Yes, yes you did.",
    "That reason being?",
    "Okay then...",
    "I was hoping you could tell me a bit about your ship. I must say, it's really very impressive.",
    "I used to own my own ship you know... It was called the Lady Lumbridge if I remember correctly... I wonder what happened to it...",
    "Your last ship? Why, what was wrong with it?",
    "And of course the rest of your crew...",
    "Um... no, I actually meant it was a shame that so many of your crew must have died in the shipwreck.",
    "Can we sail to Lunar Isle now? I must say, it all sounds very intriguing over there...",
    "Okay, keep my Seal with me at all times, check. Can we go now?",
    "Um... Way to sail a boat?",
    "No, actually. I don't really want to know anything that you can tell me. In fact, I don't even know why I began talking to you in the first place!",
    "That was possibly the most pointless journey I have ever taken in my life.",
    "Who?",
    "Can we try again?",
    "Are we there yet?",
    "What do you think caused it?",
    "Iiiinteresting...",
    "Was the ship supposed to go in a big loop like that?",
    "Any idea what caused it?",
    "Pretty crazy sailing you guys got here!",
    "Wow. Pretty rubbish sailing just then, huh?",
    "What do you think might be happening?",
    "A jinx?",
    "Uh... yes... But... I'm pretty sure I didn't do anything. I hope.",
    "Hey, are you the navigator?",
    "Think you can navigate us a course on this ship that isn't a BIG STUPID CIRCLE?",
    "C'mon now... If you're the navigator, then it stands to reason it's your fault we didn't sail anywhere!",
    "Well maybe I will go and talk to the Captain about you.",
    "Fine, I will.",
    "I am, watch, here I go.",
    "Yeah, you'd better be.",
    "Yeah, but not for long.",
    "Fine, I'm gone.",
    "Not yet, but I will.",
    "Hey there captain.",
    "Can we try again?",
    "Perhaps the navigator made a mistake when he plotted the course?",
    "I'll go ask him what happened for you, Captain.",
    "I'M NOT A STOWAWAY! GAH!",
    "I, uh, kind of didn't bother to go and talk to him yet...",
    "Maybe we were just unlucky that last time?",
    "It can't hurt, right?",
    "This crazy sailing... Think it could be the navigator's fault?",
    "Yeah, I guess.",
    "That sailing was horrible. I blame the navigator.",
    "Yeah, you're right, sorry.",
    "The captain seems to think that the navigator is repsonsible for the problems with the ship...",
    "Hmmm. Okay, thanks.",
    "The rumour is that it's all the navigator's fault that the ship keeps going around in a big circle.",
    "You think this is my fault?",
    "What? NO! Look, I'm pretty sure it's nothing to do with me...",
    "I'll go and speak to the navigator immediately.",
    "Do you know of any reason why the navigator would be deliberately sabotaging our journey?",
    "Okay then.",
    "Hello there. What can you tell me about the navigator of this ship?",
    "How can you never have spoken to him? There's only like 10 people aboard the entire ship!",
    "Hey, think the problems with the ship is the navigator's fault?",
    "I bet it's the navigator's fault.",
    "The weirdness with the ship.",
    "I blame the navigator for the ships weirdness.",
    "Yeah, me neither.",
    "Absolutely rubbish sailing. It's the navigator's fault, right? You're with me on that, yeah?",
    "...and Player is the greatest pirate who ever lived?",
    "You know what? I like you. Although admittedly I haven't tried any of your food...",
    "Hello there. That navigator. Rumours say that it's his fault the ships going round in circles now.",
    "Well, the Captain thinks it must be his fault!",
    "So... Call yourself a navigator huh? Way to plot a course that's a big circle!",
    "Oh really? What's that then? Wrong kind of waves? Your steering wheel got stuck?",
    "I'll have you know that I am a personal friend of the Captain, and he himself invited me aboard for a small cruise around Lunar Isle along with a variety of local delicacies and beverages!",
    "Oh, absolutely. Me and him go way back. Waaaaaay back. We're like... apples and custard. Everybody says so. Yup, me and Captain Renney, we're a team.",
    "Right. Bentley. That's what I said.",
    "Oh, yeah, it's like a nickname. Only his friends are allowed to call him that.",
    "Wow, he must hate you.",
    "Well, that's all beside the point. It's all your fault and I'm going to make sure the Captain fizzles your gizzard, or whatever it is you pirate types do to each other.",
    "Oh really? And what would that be then? And you had better be good, or Captain Renney is going to shiver your timbers for good!",
    "Right. Whatever. Carry on.",
    "Uh... We do?",
    "Oh, absolutely he did, yes. I just uh, have these lapses in memory occasionally.",
    "Er... Right. I'd better go find that jinx before someone else accuses me of this being my fault.",
    "I've found you, YOU JINX!",
    "Sorry. I thought you might be, and that I could trick it out of you by shouting it at you as an accusation.",
    "Well, not yet, no. But there's always a first time for everything.",
    "(sigh) I suppose so... It just won't be as much fun...",
    "Oh captain, my captain.",
    "Oh yes. He tried to hide his incompetence by blaming the ships' problems on a jinx of some sort.",
    "No, I'm still pretty sure it's just the navigator being really rubbish at his job...",
    "Right. And when you say 'we' need to find you actually mean...?",
    "Yeah, I was afraid you were going to say that... Okay, I'll try and track down this jinx for you.",
    "(sigh) Yes, Captain.",
    "Hello there. So, I'm wondering if you know anything about a jinx at all?",
    "Quick question: What exactly is a jinx anyway?",
    "Hmmm.",
    "So why is it such a big deal to sailors?",
    "Wait, so someone with magical powers can deliberately place a jinx upon someone or something?",
    "Someone highly magical like, oh, let's say for the sake of argument, the inhabitants of Lunar Isle, a.k.a. the Moon Clan?",
    "So somebody from the landing party must have gotten themselves jinxed... Thanks a lot 'Eagle-eye', you've been extremely helpful.",
    "Hello there!",
    "Actually, I'm not after food, I'm after information...",
    "...Can I just ask you a few questions?",
    "No, that's fine. I appreciate your time. So... I have reason to believe that a jinx has befallen the ship due to someone offending the Moon Clan somehow... I was wondering if you knew anything about that...",
    "Wait... So the whole crew except yourself were at a big feast on Lunar Isle? Was there drink involved at this feast?",
    "So a bunch of drunk pirates feasting on Lunar Isle. I think I have my suspect for when the Moon Clan were offended. Thanks for the help there, Beefy!",
    "I have a couple of question to ask you about the big feast on Lunar Isle you went to last time you went there.",
    "Did you see anyone being rude to the Moon Clan at all?",
    "And I don't suppose you saw anyone slip away in the middle of the festival or anything?",
    "Okay, tha- Wait, you say you saw the First Mate slip away in the middle of the feast?",
    "Thank you, you've been very helpful.",
    "So... Finally we get to the truth... MISTER Davey-boy. IF that's even your REAL name.",
    "What? NO. No, Davey, this is about YOU! This is about your LIES and your BAD behaviour!",
    "I know your SECRET Mr first mate! I know that you are a PHONY! I know that you were NOT where you claimed to be on the night in question!",
    "Oh, come come, Davey-boy! It is too late to weasel your way out of this one!",
    "Oh, you know... your ALIBI?!?!",
    "YOU know. How you told me that you were at that feast on Lunar Isle ALL night? Well, let me tell YOU that you are a LIAR! I have an eyewitness that SAW you leave the feast, and go off and do who-know-what for a good TWENTY MINUTES! I think it is time to come clean, Davey-boy. I think we should hear the truth.",
    "AH-HA! I KNEW IT!",
    "So why didn't you tell me this before?",
    "Wait, what do you mean it's not one of your usual responsibilities?",
    "So why didn't he?",
    "Wait, so he wasn't even at the feast?",
    "So the cabin boy wasn't at the feast at all? WHY DIDN'T YOU TELL ME EARLIER?!?!",
    "It's only the single most important thing you've said to me since I've met you!",
    "Well, I guess this explains why the Cabin Boy's been acting so suspiciously... I'd better go and have a word with him!",
    "It was you!",
    "Yes, you left in the middle of the feast, what did you do? You're a spy for the Moon Clan aren't you.",
    "Admit it!",
    "I'll go get the captain, a plank and a hungry shark!",
    "Yes! 1-nil to the [Player]!",
    "What did you ask her to do?",
    "I dunno. Some people! I will see what I can do.",
    "You best not be lying!",
    "Ah-ha! I've found one!",
    "One down, four more to go!",
    "Two down, three more to go!",
    "Three down, only two more to go!",
    "Four down, only one more to go!",
    "That's it, I've removed all the symbols, and hopefully the jinx.",
    "The jinx should be gone now!",
    "No worries. It was all down to the cabin boy, it seems.",
    "Spare me the life story, can we go now?",
    "Sorry.",
    "Thanks Cap'n.",
    "Take me to your leader.",
    "Isn't that what you're supposed to say when you meet a new race of people?",
    "OK. Is he rich and powerful?",
    "Great. Thanks. And where is she?",
    "Okey dokey... yeah.",
    "Hello.",
    "I'm...",
    "What? How'd you...",
    "We do? This is going to take some getting used to.",
    "Great promise?",
    "Well, I'm seeking some kind of settlement between your clan and the Fremenniks. I understand there has been a dispute for a great many years and being a member of the Fremennik clan I wanted to come as a representative to see if something couldn't be sorted out.",
    "That's what I was hoping you may be able to help me with. Can you tell me more of why you don't feel your people get on with the Fremenniks?",
    "I think you'd be quite surprised at how flexible they could be. I think they just feel like you put yourselves on a higher pedestal to look down at them. They don't like that and can't see what is so special about you and your ways.",
    "Fine. I am always eager to learn. What sort of thing had you in mind?",
    "I'm not so sure I want to wait years to solve this... Is there any way I can just attempt this ritual now?",
    "That's OK. What do I have to do?",
    "Chicken?",
    "Hi.",
    "The Oneiromancer told me you may be able to help...",
    "I don't think I'll ever get used to you people reading my mind. Yes, a potion of Waking Sleep? I need it to go to the...",
    "You know that's really quite rude!",
    "Well, I was hoping you could tell me how to make one?",
    "There's no harm in trying. Right...?",
    "You really know how to instil discomfort don't you?! How do you make...",
    "Thanks.",
    "Hello again.",
    "I have indeed.",
    "So what next?",
    "OK.",
    "Hi.",
    "I have indeed!",
    "The helm.",
    "The cape.",
    "The amulet.",
    "The torso.",
    "The gloves.",
    "The boots.",
    "The trousers.",
    "The ring.",
    "Hello there.",
    "You know the ceremonial clothes?",
    "Well that's unfortunate, because I was going to ask how I might go about getting some.",
    "Sorry?",
    "Okay.",
    "Interesting.",
    "You know the ceremonial clothes?",
    "Yes please!",
    "That seems like a fair deal.",
    "No thanks.",
    "I'm good thanks, bye.",
    "I'm on the lookout for ceremonial clothing so I can visit my dreams. I don't suppose you could help me out?",
    "Because you're a kind person and like helping people in need?",
    "I'm listening...",
    "Hmmm.",
    "Bob?",
    "Well you do seem to have a moustache growing.",
    "Pauline?",
    "Oh no. Can't you give me some kind of clue?",
    "Dave Floob-Raid-Traid",
    "Jave Nag-Brabik-Faide",
    "Jane Blud-Hagic-Maid",
    "Woo hoo! Not the most normal name is it?",
    "Sounds like they were totally insane.",
    "Sorry, yes please.",
    "June Slagit-Magic-Aade",
    "Tina?",
    "Hi. Say, that's a nice amulet you're wearing.",
    "On your head.",
    "You have, I can see it.",
    "Your lucky tiara? What happened to it?",
    "I see wot I cen do, yeah? I mean, I'll see what I can do.",
    "Hi.",
    "I have indeed, want to trade?",
    "Hello there.",
    "Can you tell me a bit about your people?",
    "How about the values of the Moon clan?",
    "Well... I know things about myself. I know I like hot chocolate!",
    "...",
    "... I'm listening.",
    "Huh?",
    "I'm looking for a ring.",
    "It's to go with the ceremonial clothes I need for visiting the dream land.",
    "Buried it? Why would he do a thing like that?",
    "It's worth a shot.",
    "About that ring...",
    "Thanks... I hope.",
    "I'm not going to talk to someone that calls me 'sweetie'?",
    "Hi, could you refresh my memory: what am I supposed to be doing?",
    "I've got the Lunar helm!",
    "I've got the Lunar torso!",
    "I've got the Lunar trousers!",
    "I've got the Lunar gloves!",
    "I've got the Lunar boots!",
    "I've got the Lunar cape!",
    "I've got the Lunar amulet!",
    "I've got the Lunar ring!",
    "Thanks!",
    "What's going on?",
    "But you can't know you're in a dream whilst dreaming, you'd wake up!",
    "Ok. So how do I wake up?",
    "This all seems very deep. What am I supposed to do now?",
    "This is the strangest place I have ever been.",
    "Good point.",
    "This looks like an interesting island.",
    "What? That's a but sudden. What kind of race?",
    "That doesn't seem fair – mine's all curvy and yours is straight.",
    "If you insist.",
    "Ok.",
    "No thanks.",
    "I won!",
    "I'm just making the most of the abilities I worked hard to develop. That's all!",
    "Hi.",
    "Well... I found myself on a sort of race course, facing an opponent. He had a straight route to travel, but mine was weaving and littered with obstacles. He has it easy and I seemed to have the hard route. But I still beat him.",
    "I had the more difficult path to travel, but I was faster and wanted it more – I hurried through it while he just walked. That shows a few things, not all paths are easy to take, but if you want to succeed, and are willing to put in the effort you can come out successful.",
    "Hello.",
    "Troys? Oh trees?",
    "They're very nice, but you seem to have been chopping some down.",
    "I dunno.",
    "Fine. I can chop down trees.",
    "So I have to chop down trees and place twenty logs in the center, first to do so wins.",
    "Ok, let's go!",
    "Not on me, no.",
    "Thanks.",
    "Not just yet.",
    "Thanks.",
    "Hi.",
    "Well... I went to an area where I had to cut down trees as fast as I could! I had to do it against another man, and he kept asking me questions on what I could achieve.",
    "This is tricky. I think it was showing the importance of being able to know your own abilities and having confidence in them. You need this to beat opposition in whatever form that might present itself.",
    "Hello there.",
    "A journey? Don't talk to me about journeys! I'm surprised I have any feet left with all the walking I have to do!",
    "To be honest, I spend a lot of my time not knowing a single one of those things!",
    "Very well.",
    "I think I understand better now: it is very useful to be able to remember where you have been, where you are and where you are headed. I need all three to progress, unless I worked with trial and error, which you do sometimes have to do I suppose when looking into the future as the future is undecided.",
    "Hi.",
    "Well... I went to this place with loads of platforms. I had to jump across them, but some of them weren't real and I fell away as I stepped on them. I had to remember where I was on the grid and recall the route I was taking.",
    "I suppose there is a great deal of importance in knowing where you are and where you are going. Having goals and remembering your past. It helps you make the right decisions!",
    "Hello.",
    "Erm... I'm scared. What?",
    "Ok...",
    "Ok. Thanks!",
    "Hi.",
    "Well... I visited this strange platform covered in dice. I was then challenged to turn over selected dice in what seemed like a game of chance. But I think there was some logic behind it all.",
    "Got it! You have to appreciate that there is always a certain level of the unknown in life, but there is always an answer, you just have to play the game and hope that you'll succeed.",
    "Hello there. What's going on?",
    "Huh, wait a sec, who are...",
    "You're not all there are you?",
    "Suppose I may as well have a go.",
    "I think I'll pass.",
    "I see. There's a lot more to communication than words. Thank you.",
    "Hi.",
    "Well... I found myself meeting a man that only seemed to interact using body language. I basically mimicked what he was doing and before I knew what was happening, it felt like we were friends. It was very strange.",
    "Yeah, I think it was illustrating the importance of being able to relate to others, and that a great deal of thoughts and emotions are shared between people. We can learn a lot from each other, so I suppose friend relations are important.",
    "Hello there. What's going on here?",
    "Huh?",
    "This is too weird. I...caaannooot...uuunnnnderstaaaand...youuuu!",
    "That's ok. So what is the point of this place?",
    "Erm, ok, I can't turn down an offer in this place.",
    "Phew!",
    "Yeah, yeah. What now?",
    "Hi.",
    "Well... I went to this area where I had to play this strange game involving numbers. I had to understand what this guy was saying, but he was mainly talking in numbers. It was most weird.",
    "To me it was about trying to understand someone else to proceed I suppose.",
    "Excellent. Now what?",
    "Of course, I'm ready.",
    "I'm not ready yet, give me some time.",
    "Leave me alone... Me...",
    "I did it! I confronted myself!",
    "Let's see what this says... It seems to be my life story... 'It was in the age of the fifth that a child was born of simple beginnings. Even though [he/she] started [his/her] life with little money to [his/her] name, and nothing but a dream of adventure, [he/she] began [his/her] career by...'",
    "Huh? Was it all a dream?",
    "I've done it! I understand now!",
    "To start with, six very important things I needed to know of myself: Make sense of others to understand yourself, you must be able to relate to others, you must use your abilities to progress, you must be aware of your past and present to help you in the future, you must harness your confidence, and you must appreciate the unknown.",
    "Excellent. I think if you make contact with the Fremennik, and tell them your willingness to communicate and share, you'll find plenty of eager ears.",
    "Thanks!"
  ],
  "Lokar Searunner": [
    "Don't talk to me outerlander! I don't have time for the likes of you!",
    "Can't say I've heard of you. So they let your sort into the clan nowadays? Wow. Things have really changed since I've been gone...",
    "Yes, I suppose that's true... I have been gone such a long time...",
    "Oh, you haven't heard of the infamous Lokar, scourge of the northern seas?",
    "Forgotten already? Tch! I have no regrets about why I left!",
    "As a young man, I learnt that the Fremennik way of life was too slow for me... Oh, sure, every so often we got to go on big raiding parties, looting and pillaging the weaker islands around here for food and profit, but... Well, after a while, that was all I looked forward to doing. Growing crops, milking cows, catching and cooking food, the day to day activities of our life... THEY'RE SO BORING! No, I knew what I wanted to do, and that was attack innocent people going about their daily business, steal all their money, then spend it on wine, women and song!",
    "So I ran away from Rellekka to become a PIRATE! It's way more fun. Plus you get to see the world.",
    "Yes, I have returned here, but that's only because we're short on supplies.",
    "You're trying my patience...",
    "Indeed. Well, the rest of the group are at Lunar Isle at the moment. It's where the Moon Clan live.",
    "I'd be surprised if you hadn't, they're the Fremenniks' most hated enemy! They've been at war with them for hundreds of years! Hmmm. Actually, that might be a problem for you then.",
    "Yeah, they're a really powerful race of mages. They'd read your mind and see that you're a Fremennik straight away, then probably turn you inside out and feed you to the birds.",
    "Yeah, but I think the Fremenniks are a bunch of losers. They probably picked up on that. Look, I know a way you'll be able to travel there without, you know, getting killed and that, if you fancy a trip!",
    "That's the spirit! Well, what you want to do is go and talk to Brundt the Chieftain and get a Seal of Passage from him.",
    "Well, it shows that you're a diplomat for the Fremennik, so you'll have immunity from being killed and stuff. It's an ancient tradition not to attack anyone bearing a Seal of Passage, because they're probably on a diplomatic mission. Or well connected with powerful allies. Either way, killing them is usually a bad idea.",
    "What? I never said you had to bother trying to do that, you just have to pretend like you might. No skin off my nose if those losers want to get slaughtered by the Moon Clan, just more stuff for me to loot when they're all dead.",
    "Yes.....",
    "Yeah, just go over and talk to the chief loser. You might have to tell him some rubbish he wants to hear, but that's it. Come back here when you got it, my supplies are loaded and I'm good to head back to our ship.",
    "Oh, so you're a loser like the rest of the Fremenniks then? See ya around, loser.",
    "Hey there [Fremennik name]. So you get that seal thingy off of the Brundt the Chieftain yet?",
    "Well hurry it up, okay? I'm sick of this dump of a town, I want to go back to the ship!",
    "Sorry I am not going to take you to Pirates' Cove.",
    "So you got that seal yet from Brundt the Chieftain? Can I leave this dump of a town?",
    "What are you? Useless? Go get another one from Brundt the Chieftain, and hurry it up, I don't want to be here any longer than I have to be!",
    "So you got that seal yet from Brundt the Chieftain? Can I leave this dump of a town?",
    "Great! Then let's head back to my ship! You ready to go now?",
    "...Why are you talking like that?",
    "Only the very stupid ones... I suggest you DON'T talk like that to my crew. They will probably assume you are mocking them and kill you. So let's start again: Are you ready to go?",
    "I suppose that will have to do.",
    "Well hurry it up okay? This place is a dump, and I'm a vicious blood-thirsty pirate, not your personal travel agent",
    "Here we are at the Pirates' Cove! You'll find the captain already on board.",
    "Hi again [Fremennik name]! What can I do for you?",
    "Hey, if you want to go back to Loserville with the Loser Gang, who am I to stop you?",
    "Hey, I knew you seemed cool when I met you [Fremennik name]!",
    "Sheesh! Make your mind up, pal, I'm not a taxi service! Do you want to go or not?",
    "You are possibly the most indecisive person I have ever met..."
  ],
  "Brundt the Chieftain": [
    "A seal of passage? Whatever for?",
    "Ah, [Fremennik Name], many have tried, but the Moon Clan are by no means a sharing group of people. They do everything by magic, which is something we never use. But they are so secretive about it – if only they would share, we wouldn't have to kill them all the time!",
    "If you are to bring peace to our two warring clans, then perhaps it is best that you do...",
    "Yes? Ah, [Fremennik name]. How goes the peace talks with the accursed Moon Clan?",
    "I see. Well, I don't hold out for much hope!",
    "Then you had better take a replacement and be less careless in future."
  ],
  "'Beefy' Burns": [
    "The galley ain't open fer food yet whipper-snapper, ye'll hafta come back later if'n ye be wanting food.",
    "Aye, ter be sure, yer yella-bellied land-lizard!",
    "Aye, if'n yer say it's true then it must be!",
    "Player yer say? Aye, well I guess that they must be if'n that's what ye're telling me there."
  ],
  "'Birds-eye' Jack": [
    "Hi.",
    "I'm the navigator. My job is to ensure the ship travels where it's supposed to go once it's moving by constantly checking our bearings against our plotted course, using charts and a sextant. People often think that we just sail off when we feel like it, but its actually far more complicated than that! Why, when you think of just how much sea there is out there, ANYTHING could happen if there wasn't a competent navigator on board ensuring that we reach our destination safely and in the shortest possible time!",
    "As I say, being a navigator is a real skill - you really have to think on your feet! Yesiree, once we get sailing, it's all up to me to make sure we don't run into trouble or go off course! Yep, as the rest of the crew basically stand around not doing much, I'll be the one in the cabin, comparing wind speeds, landmarks and charts with my sextant, making sure that we get to the destination on time, and on course! You could almost say that I'm the linchpin of the entire operation! Why, if it wasn't for me, the rest of the guys might be sailing for, oooh, hours, and be slightly off course and never even known it! They might even be a few hours late for their destination! Or a few miles down the road from it! And then where would they be?",
    "Exactly!",
    "Oh, just relaxing while I wait for the ship to cast off. When we're sailing I'll be very busy you know! I'm probably the single most important person on board when we're sailing!"
  ],
  "First Mate 'Davey-Boy'": [
    "It is customary when stowing away on a vessel to not introduce yourself to the Captains First Mate, oh foolish one.",
    "I see. Well, don't distract me as I'm making preparations for departure. Try not to distract any of the crew either, Zamorak knows it's hard enough to get them to do any work around here without strangers wandering round the ship asking them inane questions"
  ],
  "'Eagle-Eye' Shultz": [
    "Not really, just those creatures on the island. Don't worry, we sent some men out there to deal with them. The captain said we might have a barbecue out there.",
    "You obviously haven't met the cook yet...",
    "Really? Seems strange to me, I made a point of watching our course last time we sailed, and we didn't deviate at all, but somehow ended up back here.",
    "I'm not so sure about that..."
  ],
  "Pirate Crewmember": [
    "Ah, good day to you sirrah! Your face is unfamiliar, did you perhaps join us aboard the ship at Lunar Isle?",
    "Oh, really? You don't look like a Fremennik to me!",
    "Sorry I don't have time to hear it then! See you around young fremennik-who-is-not-really-a- fremennik!",
    "Hello.",
    "It's what it says on my pay-packet at the end of the month.",
    "Pretty good so far. All the grog and loot that we can plunder, plus full medical including dental.",
    "Not as such. If any of us get sick we kidnap a doctor and don't let him go until we're better. You'd be surprised what an incentive for expert health care that is.",
    "ARGH! SOUND THE ALARM! STOWAWAY ON BOARD! STOWAWAY ON BOARD!",
    "Oh, sorry, my mistake then. You must admit you do look a lot like a stowaway though.",
    "Errr.... I've never actually met one...",
    "You think this is cold? Up by Acheron it gets so cold that when you talk you see the words freeze in the air in front of you!",
    "Nah, not really. I was exaggerating for humourous effect. It is very very cold though!",
    "Well, at the moment it mostly involves being asked random questions by a stowaway.",
    "Hey, whatever pal. Just make sure the captain doesn't catch you, pirates don't like stowaways much.",
    "Sorry, can't stop, the Captain will have my guts for garters if he catches me slacking off talking to the stowaway.",
    "Yeah, whatever guy, it doesn't really matter who you are I'll get in trouble!",
    "My mother was a gnome. Apparently it was a very painful birth.",
    "Hello to you too.",
    "Please don't talk like that, it is extremely irritating. Also, please don't call me a lychee, whatever that may be.",
    "Hello there. So what brings you aboard the Lady Zay?",
    "Aye, she's a beauty alright! The Lady Zay has been my home for many hard months, through storm and sun, and she always gets us to here we were headed!",
    "That she is lad, that she is.",
    "What kind of question is that? How's life as a... I dunno. Whatever it is that you do for a living.",
    "What does that entail then?",
    "So how's that life?",
    "Well, there you go."
  ],
  "Captain Bentley": [
    "Hmmmm? I don't recognise you as one of my men, what are you doing aboard by ship?",
    "Oh he DID, did he? (sigh) I sometimes regret ever allowing that vagabond to join the crew. He has a very bad work ethic, and I have to say his attitude can be very confrontational.",
    "Well now, I didn't say that. We are returning there again soon anyway, as our last visit was most profitable. In fact as soon as our boys are finished loading stocks we should be ready to depart! Now, as captain of this ship I feel I must play host, even if you aren't exactly a welcome guest, so was there anything you wished to know?",
    "The Moon Clan? Oh, very fine people. Very hospitable. We had heard that they are very wary of strangers, and dislike people just showing up on their island, but when we sent a landing party aboard they all seemed more than happy to see us. Well, they even threw a big festival in our honour! Anyway, they had a large supply of items that we felt we could use on the high seas, so we made a few trades with them, and were on our way.",
    "Well, I'm not sure how much you've heard about them, but they are magical experts. They sold us many runestones, as well as a few good luck charms and talismans and such to help us on our voyage. Yes, they might have been a little secretive about that strange temple, and the old lodge of their in town, and I must say they certainly have the strangest house I have ever seen in my life in their little village, but it was a pleasant trip all round, and I look forward to trading there again in the future. After all, it's not everywhere that a pirate captain and his crew can rest ashore without having to worry about the authorities catching them, is it?",
    "Was there anything else you wished to ask me about while I'm not busy?",
    "Well, obviously the actual pirating is a big part of our agenda, but we like to think of ourselves as non-regulated merchants. What good is plunder if you have nothing to spend it on, hmmmm? Likewise, I am a forward thinking captain, and endeavour to invest much of my plunder back into the ship and its crew, so that we can be a better and more efficient force for theft upon the seas.",
    "Well, obviously not initially. Obviously, our first thought was to show up, rob them blind, then take off again with the plunder spilling from our decks.",
    "Well, firstly there were the monsters.",
    "Oh yes, hundreds of the things. The island's swarming with them you know. Dirty smelly beasts, as big as a wolf! Yes, you'd certainly better be either handy with a blade or quick on your toes if you wanted to spend much time outside of their village with those things around everywhere.",
    "Oh yes, absolutely. That and the next reason.",
    "Yes, the next reason being that the Moon Clan are quite stupendously powerful magicians. You'll notice it as soon as you look at them, really quite, quite powerful indeed. As soon as we saw them we lost any thoughts about trying to attack or steal from them. Which as it turned out was lucky for us.",
    "Oh yes. They can read minds, you see. If we'd shown up there thinking about robbing them they would have just killed us all on the spot. I did mention that they are extraordinarily powerful magicians, didn't I?",
    "Ah, I'm glad I did. Because they really, really are. And mind-readers. Yes, all in all I'm glad we didn't try any funny business in the end after all. Plus there's that other good reason.",
    "Well, when you are a crew of successful pirates, it becomes more and more difficult to ever moor somewhere and spend your loot. People are far too quick to call the guards on a troublemaker nowadays. So finding a village where people are more than happy to trade with you regardless of who you may have just stolen from and killed. I like that non-judgemental attitude of theirs!",
    "Anything else you wanted to know before we set sail?",
    "Ah, a connoisseur! Yes, she's named the Lady Zay, and I may say, is one of the finest ships to ever sail the seas! It was a steal from the Karamjan shipyards. And when I say it was a steal, I mean to say that myself and some of the lads broke in and stole it one night. I don't know who they were building these warships for, but whoever it was seemed to be a little on the short side. We had to do a little remodelling of the doors and rooms so that we didn't have to crouch around everywhere, but I've finally got here just how I want her, and we have enough cannons down below decks to bombard a small town I'd wager!",
    "Interesting. You never struck me as being Captain material, but I guess there's a ship out there for everyone... The Lady Zay is certainly a big step up from my last ship anyway.",
    "Well, it just wasn't sturdy enough! I was on a perfectly routine raiding expedition to the east of here, when we ran into a squall, that pushed us towards the rocky shore. A few select men and myself managed to escape with our lives intact on a small row boat, but the rest of my crew were washed ashore as the ship was wrecked on those jagged rocks. Ah yes, it was a tragedy... To lose such a fine ship in such an insulting manner...",
    "Who? Oh. Yes. The crew. Yes, it was a tragedy. I'd paid them in advance you know, I'll never see that money again!",
    "Was it? Well, if you say so. Actually, the last I had heard quite a few of them had survived, and had set up a little hideaway next to the remains of the shipwreck. If you're particularly worried about them, perhaps you might like to go and pay them a visit someday, and make sure to bring a lot of easily transferable wealth with you. They love people visiting with easily transferable wealth. Now, was there something you wished to talk to me about? Time is pressing on and we really need to set sail soon if we want to make the most of the winds.",
    "As long as you keep your Seal of Passage with you at all times while you are on the island you should be okay, even if you are a Fremennik. I'm not kidding, they are a very dangerous people, and it would NOT be wise for you to travel there without your Seal Of Passage marking you as a diplomat.",
    "Ah, yes indeed! The winds seem good, so let's make a move!",
    "Well... THAT was deduced strange!",
    "This... This is VERY strange!",
    "Hmmmm. You could perhaps be more grateful to someone offering you free transport, but then I suppose you are a friend of Lokar's, and a Fremennik, so I suppose the rudeness is natural. Make sure you are ready for departure, I will be issuing orders to set sail shortly.",
    "I... I don't understand... This is all very strange...",
    "That course was plotted, we had a fair tailwind the whole journey... BUT WE HAVEN'T BUDGED AN INCH! I just don't understand it... Maybe you should speak with Jack.",
    "Our navigator. He's at the rear of the ship, one floor below deck.",
    "Yes, you're right, perhaps it was just a freak wind. Off we go!",
    "In all my years as a captain... I... I just don't understand what's going on...",
    "Hello again.",
    "What are you wanting now?",
    "Hmmm, you think so? Perhaps I'd better ask him about that... But... His course looked true... I just don't understand...",
    "You will? Well, thank you! You're very helpful for a stowaway! He's one floor below deck. To the rear of the ship.",
    "So what did the navigator have to say for himself? Does he have any explanation for why we keep sailing in a big circle every time we try to get to Lunar Isle?",
    "I see...",
    "Oh, you want me to try and set sail again?",
    "I suppose so. Off we go!",
    "So you've spoken to my navigator again, yes? What does he have to say for himself?",
    "A JINX you say??? Aye, I have to admit that does sound like a logical explanation...",
    "No, no, a jinx, that makes all too much sense I'm afraid... Well, the solution is obvious. We need to find out who or what has been jinxed and remove it from the ship immediately.",
    "Well, as Captain I have certain responsibilities that must be fulfilled, so I would greatly appreciate a little assistance in tracking down this jinx...",
    "Good girl! Let me know if you find out anything important.",
    "Really? Good work, landlubber!",
    "Pesky kid. Ah, but I remember when I was a cabin boy. Many years ago, I started off as...",
    "No need to be rude.",
    "Very well. It's off we go!",
    "Here we are! Lunar Isle!"
  ],
  "Parrot": [
    "Stowaway! Stowaway! *Squark*",
    "Lokar's a loser! *Brakawk*!",
    "Fight the law! *Squawk*",
    "*Squawk* Run fer yer lives lads, it's a monster! *Squawk*",
    "Bunch of blooming loonies! *Brakawk*",
    "*Brawwwwwwk* I want guns, lots of guns! I want guns, lots of guns!",
    "*Squawk* Move it or lose it, move it or lose it.",
    "She's blowing a storm, cap'n! *Brarrrrrrk*",
    "*Squawk* Way to sail a boat! Way to sail a boat! *Brarrrk*",
    "Below deck, below deck.",
    "Stowaway! Stowaway! *Squark*",
    "*brakawk* He means you dummy! You dummy! *Squawk*"
  ],
  "Jenny Blade": [
    "In all my years as a pirate, I have never seen such sailing!",
    "If I was a less superstitious person, I would suggest an evil magic of some kind.",
    "Well, I guess it could be... Seems a little strange for him to do that though."
  ],
  "Jack Sails": [
    "Pretty sure it wasn't, no...",
    "Absolutely none at all...",
    "You know, speaking ill of someone behind their back isn't cool."
  ],
  "Murky Pat": [
    "Weird, the ships never done that before...",
    "He's an arrogant fool, but he gets the job done. I'd have to say the Captains wrong about that."
  ],
  "First Mate 'Davey-boy'": [
    "I have literally never seen anything like it! The ship seemed to... I don't know, suddenly swing round as we approached shore! then somehow we were right back where we started! This is all very peculiar if you ask me, I have never seen anything like it in all of my years on the high seas.",
    "Well, my first thought would be that we have jinx aboard.",
    "Yes, a jinx. Someone who has recently come aboard and seems to be bringing us bad luck. If it is a jinx, the only answer would be to throw them overboard as shark food. You just recently came aboard the ship yourself didn't you? Because I don't recall us having any trouble before you showed up.",
    "Well, you had better hope it isn't your fault. If there's one thing I hate more than a stowaway, it's a jinx.",
    "Is it now? That sounds like exactly the kind of thing that a stowaway and a jinx might say to throw suspicion off of himself.",
    "Ah, so you finally admit you are a stowaway and a jinx!",
    "Well, for your sake I hope you're right. Killing people is such a chore."
  ],
  "\"Bird's-Eye\" Jack": [
    "That I am. Why?",
    "I'm SURE I don't know what you mean!",
    "Now listen here bucko, my course was true, like all my others, and if you have a problem with how I do my job, then you'd better go and speak to the Captain about it, because I don't appreciate a stowaway wandering in here and criticising me!",
    "You'd better do that then.",
    "Well do it.",
    "Oh, I'm sooooo scared now.",
    "But you're still here.",
    "Well you better go then.",
    "What do you want, spoken to the captain yet?",
    "Frankly sirrah your rudeness is quite appalling! My calculations and plotted course were expertly calculated, and there can be only one reason why the ship has failed to arrive at its expected destination.",
    "I do not have to take this kind of abuse from a common stowaway.",
    "Really? You don't seem like the type he would make friends with.",
    "You mean Captain Bentley?",
    "No you didn't. You called him Captain Renney.",
    "Yet I have known him for over 20 years and he has never asked to be referred to as anything except Captain Bentley.",
    "And indeed, he has never mentioned any stowaway looking vagabonds as friends.",
    "But it wasn't my fault! Look, see for yourself! All co-ordinates for the journey are carefully plotted to all visible waypoints and landmasses! There can be only one POSSIBLE explanation why the ship hasn't reached its destination, as I mentioned before!",
    "You mean Captain Bentley?",
    "Magic. It must be magic. Somebody must have jinxed our ship, but I have no idea who would have done that or why. Although your highly suspicious behaviour towards me, and the mysterious sudden appearance on board at the *exact time* that this jinx appears to have been brought upon us would seem to make you the obvious candidate. And we all know what we do to someone who is a jinx.",
    "Oh, I'm sure your good friend Captain Bentley has told you all about the last jinx we had on board.",
    "Oh, it was horrible. I never knew the human body could contain so many mackerel. And then that thing they did with the tinderbox and the cheese... I still wake up with nightmares about that sometimes...",
    "What? I'm not a jinx, we've already had this discussion!",
    "That approach works, does it?",
    "I think a more subtle approach might yield you better results."
  ],
  "'Betty' B. Boppin": [
    "No, and I can't believe he would."
  ],
  "'Beedy-eye' Jones": [
    "Sorry, I've never spoken to the man.",
    "Dunno. Sorry."
  ],
  "'Picarrion' Pete": [
    "Yup, could be. Could well be."
  ],
  "Tommy 2-times": [
    "What is?",
    "Could be I suppose."
  ],
  "Bedread The Bold": [
    "His fault, eh? Well, I never liked him much anyway."
  ],
  "\"Eagle-eye\" Shultz": [
    "A jinx you say? Argh, those are evil things!",
    "Ah, well they take many forms. Sometimes it just be a person with such staggeringly bad luck that everything they do or say invariably leads them into trouble and commotion, through no fault of their own. Everything they touch will always bring them misery, and everything they think they have achieved will always end in disaster.",
    "But then there is the other kind of jinx, the even worse kind. It is a curse put upon someone, often attached to an object of some kind, and is done deliberately, so that misfortune will always follow the owner of that object.",
    "Ah, well now. When you're on land, bad luck can be an annoyance, and possibly even bring you grief, but is rarely deadly. A jinx on land may fall over tree roots, or lose their coins down a drain, or some other irritation. But at sea! With nothing saving you from the cold murky death of drowning except the wood below your feet? Why, jinxes can kill not just you, but the entire crew of a ship! They are an evil thing indeed, and the only thing you can do to save yourself and your crew is to forcibly remove the jinx from the ship as soon as possible. Dead or alive. Or casting some kind of anti-curse magic upon the jinxed item might work, but to be honest, throwing them over board is quicker.",
    "Oh, yes. But they would have to be a very magical and very evil person to risk the lives of an entire ship over some trivial matter.",
    "Well, I suppose so... But for them to curse our entire boat? Someone from the landing party must have done something highly offensive to them at the feast for them to place such an evil enchantment that risks the lives of the entire crew."
  ],
  "\"Beefy\" Burns": [
    "Sorry, the galley's closed for restockings! Yer'll hafta come back later if'n ye be wanting food!",
    "Wussat? Some kind of alkyhol? If'n it ain't grog I don't be stocking it!",
    "Aye, that yer may, long'n as yer don't mind me carrying on with me restockings while we talk.",
    "The Moon Clan yer say? Ah, well I dinna know much about them folks, when everyone else went to that there big old feast I stayed aboard the ship... I gots ter be honest, I never trust any food I ain't prepared meself!",
    "Aye, ter be sure!"
  ],
  "\"Lecherous\" Lee": [
    "Aaaahhhh yes... I was quite taken with their hospitality!",
    "Well, we were all in high spirits, but I certainly didn't see anything like that going on.",
    "Other than the First Mate, no I didn't see anyone slip away from the feast.",
    "That I did. I don't think he saw me see him leave, but it was definitely him. I watched him head towards our ship, and he came back, oh, I don't know, twenty minutes later or so. I doubt anyone else saw it, he just slipped away in the midst of the festivities.",
    "No problem."
  ],
  "First mate 'Davey-boy'": [
    "Hmmm? You're finally confessing to being a stowaway and a jinx?",
    "Oh, what on Gielinor are you on about now?",
    "Night in question? Phony? Secret? What ARE you blathering about now?",
    "I have absolutely no idea what on earth you are talking about.",
    "Alibi?",
    "What? Well of COURSE I was at that feast all ni... Hmmmm. You know, now that you come to mention it, you are correct, I did leave the feast.",
    "Oh, do calm down, it was nothing particularly interesting. I merely had to inspect the rigging was secure before the ship was docked securely for the night. It's one of those things you have to do, in case a storm blows up while we're asleep and yanks the ship off to sea unattended.",
    "Well, clearly it slipped my mind. It's not one of my usual responsibilities, so obviously I didn't think much of it.",
    "It's the cabin boys' job to make sure that the rigging and sails have been safely secured before disembarking the ship. Pirates Regulation #445-328.",
    "I have no idea. I couldn't find him at the feast, so I left to secure them myself.",
    "Not that I could see, no. And I do recall I spent some good time looking for him.",
    "I suppose it slipped my mind. Surely it can't be of any importance, a runt like that?",
    "If you say so."
  ],
  "Cabin boy": [
    "Me?",
    "No!",
    "But...",
    "Ok, OK! I confess.",
    "There's no need to brag! Yes, I left the feast. I was lured by a girl from the Moon Clan, she promised me control of the ship if I did this simple task for her. I couldn't resist. Have you any idea how hard it is being a boy on a ship full of pirates?! I had no idea it would turn out how it has.",
    "She showed me some symbols, she then asked me to draw five of them throughout the ship. Some kind of magic jinx. Please don't tell the Captain! He'll kill me! If I ever get to that island again, I'm going to see what she has to say for herself.",
    "You'll need a special kind of lantern to see them, there are five symbols in total I think. I vaguely remember what I put them on. One was up on a wall. One was on a container. One was on a box of some sort. One was on a support. The last one is hazy, all I remember is that it was big and metal.",
    "I'm not! Honest. Look, I have a lantern and lens here, put them together then light it with a tinderbox. Then you can use it to search the ship for the symbols."
  ],
  "Option 1": [
    "Rub away!",
    "Yes"
  ],
  "Option 2": [
    "I'm no cleaner!",
    "No"
  ],
  "Meteora": [
    "Wot?",
    "Well, mate, we don't av no leader, so I ain't gonna take ya to um. We au wav eqwuv rights's un stuff, yeah? But if ya wont an intro go live it up wiv da Onerimancer.",
    "No man, SHE, is dead-wise yeah? She is responsible for initiation rituals an stuff.",
    "She angs out in souf east of ouw island.",
    "Huh?",
    "Wot?",
    "I ain't gat no amulet on me ed.",
    "Oh ah, is a replacmant for me lucky tiara, yeah?",
    "Ah, is bad, yeah? One o doews Suqah did nick it. Wish I ad it back, yeah.",
    "Gud.",
    "Yo yo yo! You got me tiara yet?",
    "Sure, yeah, gimmie it yo."
  ],
  "Oneiromancer": [
    "Why hello, how are you today?",
    "Fine. Yes I know.",
    "By reading your mind. But that's not important. We have some important things to discuss.",
    "Of course! I can see that you come bearing great promise.",
    "Please. Just tell me why you have come to our island.",
    "A very honourable objective, but how do you suppose this will be possible.",
    "We are very in tune with magic as you have no doubt observed, but we have yet to meet one Fremennik with the perspective that this is of any value. They are always picking at us to reveal our secrets, but why should we when they view us so.",
    "Hmmm. Well you are one of them. Perhaps if you can understand our ways, that will at least be a start. How does that sound to you?",
    "Well, we have a ritual called 'The View of Self Dream'. It is a ritual that we all have to go through. You see the path to understanding magic is through understanding ourselves. It is a power innate to every living creature, but it takes a great understanding of self to tap into. One of the best ways to understand ourselves is through our dreams. These are a demonstration of our subconscious, our subconscious being raw and true. But it takes many years to get into a situation where you are ready to attempt it.",
    "I don't mind you trying, but I really doubt you'll achieve anything. There are also a fair few preparations you'll have to make first too.",
    "You are going to need to do a few things. You'll need a waking sleep potion, a Lunar staff, and ceremonial travelling clothes. Start with the potion, I suggest you go have a word with Babab Yaga in her chicken house, she will be able to help you with the making of the potion.",
    "Yes, you can't miss it, it's walking around the north of the town.",
    "Have you got the potion to give me?",
    "Well done, I'll take that for safe keeping.",
    "Next we will sort you out with the staff before the clothes. You are going to have to get hold of a Dramen staff first. You will need to take it to the air, fire, water and earth altars to imbue it with power to convert it into a Lunar staff. Bring that back to me and then we can get on with the next stage. And don't worry, you'll be able to do anything you can with the new enchanted version of the Dramen Staff as you could with its ordinary form! Including visiting the lost city!",
    "Managed to get the Dramen staff enchanted?",
    "Well done, pass it here. Now we can get on with the next stage – your suit! There are 8 parts to this. Which would you like to hear about?",
    "The helm needs to be made from an ore you can only get from the mine on this island. You'll see some stalagmites that you can mine from.",
    "There should be one of these floating around somewhere. Talk to some of the people in the village and I am sure one of them will be able to help you.",
    "You should go and speak with Meteora, she always seems to be wearing one on her head for some reason. She might give that to you.",
    "You'll find a monster called the Suqah that is indigenous to this island. You'll need one of their hides to make your own torso, which you can tan only in this town.",
    "You'll find a monster called the Suqah that is indigenous to this island. You'll need one of their hides to make your gloves, which you can tan only in this town.",
    "You'll find a monster called the Suqah that is indigenous to this island. You'll need one of their hides to make your boots, which you can tan only in this town.",
    "You'll find a monster called the Suqah that is indigenous to this island. You'll need one of their hides to make your trousers, which you can tan only in this town.",
    "You should probably go and speak to Selene, she will be able to help you as she always seems to have bits and pieces like that hanging around.",
    "Well you need to be making your Lunar clothes.",
    "Well done, I'll take that for safe keeping.",
    "Well done, I'll take that for safe keeping.",
    "Well done, I'll take that for safe keeping.",
    "Well done, I'll take that for safe keeping.",
    "Well done, I'll take that for safe keeping.",
    "Well done, I'll take that for safe keeping.",
    "Well done, I'll take that for safe keeping.",
    "Well done, I'll take that for safe keeping. Ah you have everything! Good work! Now, I'm going to give you some magic kindling from the first magic tree that ever grew. I shall also give you back your ceremonial clothes which I want you to put on, take hold of the Lunar staff, pour your potion on this kindling and burn it on the giant brazier in the centre of town. If you've done all this correctly, you'll be transported to the land of dreams. I can't help you from there on, that all depends upon your understanding of your self. Good luck!",
    "You do, I'm not sure I believe you. Tell me what you've learnt.",
    "That's great! I would never have imagined someone from mainland could have had such an open mind to learn such things! I shall spread the word among our people. After this I can't see why we can't start to get along.",
    "Well done! You must be rewarded for this great deed. You're now more than welcome to use the altar behind me to craft the astral runes that we use here on the island. These runes will allow you to use a new set of spells. Simply pray at the altar behind me to gain the knowledge."
  ],
  "Baba Yaga": [
    "Ah! A visitor from a distant land! How can I help?",
    "With a potion?",
    "Dreamland?",
    "Sorry. Carry on.",
    "Of course. Are you sure you're ready to take on the dream land?",
    "Well, some people have gone mad from visiting their dreams.",
    "You'll need 1 guam leaf, 1 Marrentil leaf and a Suqah tooth ground using a pestle and mortar. Combine these in a vial with water and BAM! You've got your potion! You should be able to get the ingredients from the Suqah monsters. You'll also need a special vial. I have one here."
  ],
  "Rimae Sirsalis": [
    "Welcome to the clothes store. How might I help?",
    "I certainly do! A real tricky set of garments to make.",
    "All I can really help you out with is the tanning of the hides.",
    "The ceremonial clothes are made from the hides of the suqah. Bring them to me and I will tan them for you. You can craft them into the top, trousers, gloves and boots.",
    "It's an interesting creature, the suqah. You see, they have been indigenous to this island since we arrived. They seem to thrive on eating the minerals that exist in the mines below the town. We try our best to live in harmony with them, becaue they provide us with a great many materials when they die, and, in turn, we have given them magic to help protect themselves.",
    "Got any suqah hides you want me to tan?",
    "At 100 gold pieces per hide, that'll cost you... [#] gp.",
    "A pleasure doing business with you!"
  ],
  "Pauline Polaris": [
    "Ah, I know the ceremony very well. Maybe I can help. I do have a cape, but why would I want to give it to some random person off the streets?",
    "Nice try. But I am always glad to help a person in need, if they can demonstrate some insight.",
    "How about you try to guess my name!",
    "How rude!",
    "Get out of my sight!",
    "Ah, you'd think so, but no. That is my alias. I want you to tell me my REAL name! I have one first name, and a triple barred surname!",
    "Let's see... Okay. Change a letter from the word Dane to get my first name. The first part of my surname rhymes with wood, the third part rhymes with spade and the second rhymes with magic.",
    "Nope. Not even close.",
    "That's it! Well done.",
    "It's not my fault my parents had an over active imagination.",
    "Do you want this cape or not?",
    "Ha! Nice try, but no."
  ],
  "Selene": [
    "Greetings sweetie. How can I help?",
    "Ok. Like what?",
    "Let me see... We value knowledge of self because it is this that gives us our strength! It is most important!",
    "I was meaning something a little deeper than that. We also like to see someone listen. You know how they say a wise man listens?",
    "Did you hear me?",
    "Most wise.",
    "Well there are a great many rings darling, try to be more specific.",
    "Ah, I see. I'm afraid to say I don't have one of those. But... I do know that my grandfather hid such a ring, but he passed away a long time ago. There is a chance he buried it though.",
    "He was an archaeologist. Well, more of a treasure hunter. When I was little he always used to bury items around the island and give me clues and maps to find them. If you're lucky you might find one of those rings.",
    "I remember those days fondly, hours of digging around, dodging boulders, pits of snakes...",
    "Ah, yes. The clue I have written down here says: From water's source you should follow, crossing the western-most bridge and travelling further south-westerly to a bloom of blue.",
    "No need to be rude dear!"
  ],
  "Ethereal Man": [
    "Don't you know, you're in the land of your own dreams!",
    "Well, this is a waking sleep.",
    "Just use this lectern – it's the book of your life, all that has been, all that is and blank pages for all that will be. In reading this you will return your mind to reality and the continuous world.",
    "That is totally up to you. This is a test, it wouldn't be fair if I gave you the answers now would it? But I can tell you that there is a selection of tasks that you can choose from. I like to call them, 'A game of chance', 'Communicating in numbers', 'Chop, chop, chop away', 'Where am I?', 'The race is on!', and 'Anything you can do...'.",
    "Then you don't know your mind too well, do you!",
    "Have you learnt anything?",
    "And what lesson do you suppose that teaches?",
    "Very, very good!",
    "Have you learnt anything?",
    "And your thoughts on its meaning?",
    "I am very impressed.",
    "Have you learnt anything?",
    "Interesting. Do you have any interpretations?",
    "Bingo!",
    "Have you learnt anything?",
    "What do you suppose that means then?",
    "Spot on.",
    "Have you learnt anything?",
    "That's dreams for you. But there must have been some logic behind it!",
    "That seems about right to me.",
    "Have you learned anything?",
    "And did you learn anything from this? What do you suppose this part of your dream was trying to tell you?",
    "Exactly. By understanding others around you and through communication with your surroundings you can in turn learn a great deal about yourself.",
    "That's it! You've learnt the 6 core lessons: Make sense of others to understand yourself, you must be able to relate to others, you must use your abilities to progress, you must be aware of your past and present to help you in the future, you must harness your confidence, and you must appreciate the unknown.",
    "There is one more challenge you must face. I can't tell you what to expect, you are still being tested. Would you like to face your final challenge?",
    "Well done, I think your lesson is complete, best you wake yourself up! Go read the book on the lecturn."
  ],
  "Ethereal Expert": [
    "Oh it is. Fancy a race!?!",
    "I bet I can beat you to the other end of this island, I'll take the left route and you can take the right.",
    "Well, that's life I'm afraid, it's never as easy as you would like, you have to take the path that's dealt!",
    "You'll see, so how about it?",
    "Noooo! How could you beat me? Very well.",
    "True. A very important thing to remember! Now be gone!"
  ],
  "Ethereal Perceptive": [
    "Why ello young sir. Do yow like me troys?",
    "Ya, troys.",
    "Well, ya. Hey, bet you canna chop dem troys.",
    "Ya dunno? Wew you godda know what yow can dow. Ow can you judge wot you need ta practice or learn?",
    "Ok, chop longs and pile e mint centar. First ta twenty wins.",
    "Wew ya.",
    "You got a hatchet?",
    "We ow you gonna chop dem troys? I can give yow a bronze hatchet, but nowt more.",
    "Wew done. I can see you do have a good command ov yur abilitoys.",
    "Remember this, yow need to know wot you can do so ya know what to learn. Now off ya go!"
  ],
  "Ethereal Guide": [
    "You know everything is a journey!",
    "I know. I know. But at every step, it was important that you knew where you had been, where you were and where you were headed.",
    "Let's see how you fare in here. Try and get to the other side and you'll see what I mean.",
    "Well done! So tell me, what have you learned?",
    "Very deep! Excellent, I'm glad you learnt something. I shall send you back!"
  ],
  "Ethereal Fluke": [
    "Let's have a game, [Player]! It's a game of luck! Or is it... Hahaha!",
    "Look around and you'll see a selection of dice. I will call out a number. You must then roll over the dice to get the top faces adding up to create that number. For example. If I said '15', you'd have to turn over the dice to get the following numbers at the top: 6 + 4 + 2 + 1 +1 +1 = 15, but the dice are perhaps not all that random!",
    "The number you want is: [Number].",
    "You've done it! Good work. Remember: It is important to respect that luck plays a part in things, but that doesn't mean there is not a reason and logic behind your surroundings. If you look hard enough you can see the reason.",
    "Ok, back you go!"
  ],
  "Ethereal Mimic": [
    "Follow my lead!",
    "See what you will learn! Tee hee hee.",
    "Hey! This is your dream! So what do you say?",
    "Follow!",
    "Yep, you've got it! You soon picked that up! Can you see how important it is to be able to communicate and relate with others? You can gain a lot of knowledge from it.",
    "Ok, back you go!"
  ],
  "Ethereal Numerator": [
    "127369186!",
    "879732749 31764 762 908723089?",
    "Oh sorry. I'm not 7676908 used 768 to speaking 1324719 like this. It's not 90181 easy 901823 890 to talk 13127 without 90809 saying 90789 numbers.",
    "I dunno. Fancy a 4354353 game? Try and 353 complete these 43553 43543 sequences using 56367 the numbers around 24757 27 you! You will have to tell me the next two numbers in the sequence.",
    "That's it! I think 34132421 you've got 12341 the hang of 124151 this now!",
    "Please remember this: You must 23235 be able to 23526 communicate and understand 26243 others, they 2627422 have wisdom and 4363472 experience to 235725 share!",
    "Off you go!"
  ],
  "Me": [
    "Are you me? Am I you?",
    "You do know those clothes make you look fat!",
    "Call that an attack? Try this one on for size!",
    "Oooo. Get you! Strong words from such a weed!"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Lunar_Diplomacy?oldid=36152258’"
  ]
}