{
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "Some dialogue missingYou can discuss this issue on the talk page or edit this page to improve it."
  ],
  "Lava-flow miner Sven": [
    "Are you interested in dwarven mining? If you're an experienced miner, you might appreciate a tour of the Lava Flow Mine.",
    "Alright, are you ready now?",
    "It's where the city gets most of its power. We've tapped into a magma vent, and we use its heat to power the steam machinery that runs the mine carts.",
    "Player, welcome back!",
    "Everyone, this is Player! [He/She] helped out during the chaos dwarf attack! [He's/She's] a hero! Just...  a hero!",
    "Player, feel free to work the Lava Flow Mine - it's a great source of Mining experience. I'm right here if you have any questions.",
    "You can go into the Lava Flow Mine if you want now, human.",
    "Three of them recovered. I'm afraid one was too badly wounded. If it wasn't for you, though, they'd all be dead.",
    "If it wasn't, we wouldn't be standing here. Everything in the city relies on it - heat, water circulation, even clean air. The central boilers have been breaking more often since the incident, but we've been keeping on top of the repairs."
  ],
  "Player": [
    "I'd like the tour.",
    "What's the Lava Flow Mine?",
    "I tried to save the miners, but I wasn't fast enough.",
    "The Black Guard left the miners to die!",
    "The guards said their orders were to fix the machinery.",
    "They walked right past the dying miners!",
    "What makes you think Veldaban was involved?",
    "It was a chaos dwarf!",
    "You'll take Veldaban over my dead body!",
    "What do I need to do?",
    "Why did they arrest you?",
    "Why are you so angry?",
    "It's more complicated than that.",
    "You should try to calm down.",
    "Goodbye.",
    "Why did you arrest Veldaban?",
    "Veldaban's popular. Arresting him makes you look worse.",
    "You mean you don't think Veldaban was involved?",
    "Is it even legal for you to hold Veldaban?",
    "Tell me about the Lava Flow Mine.",
    "What did you want to do about the miners?",
    "I was there when the explosion happened.",
    "Goodbye.",
    "Why did you arrest Veldaban?",
    "Tell me about the Lava Flow Mine.",
    "What did you want to do about the miners?",
    "You made the right choice.",
    "It was a difficult decision. I understand.",
    "You killed those miners. You're a monster.",
    "I was there when the explosion happened.",
    "Goodbye.",
    "Why did you arrest Veldaban?",
    "Tell me about the Lava Flow Mine.",
    "So the chaos dwarf blew up the primary boilers?",
    "So the chaos dwarf blew up the secondary boilers?",
    "So the chaos dwarf blew up the distribution vents?",
    "What did you want to do about the miners?",
    "I was there when the explosion happened.",
    "Goodbye.",
    "Why did you arrest Veldaban?",
    "Tell me about the Lava Flow Mine.",
    "What did you want to do about the miners?",
    "I was there when the explosion happened.",
    "It was a chaos dwarf.",
    "I saw the Black Guards abandon the miners.",
    "I rescued some of the miners.",
    "Goodbye.",
    "I've talked to everyone I need to.",
    "Why are only four directors here?",
    "Who are you, anyway?",
    "I'll go and talk to them.",
    "Does anyone know where Meike is?",
    "Don't listen to Hreidmar!",
    "He's abducting people and turning them into chaos dwarves!",
    "He took his company out of the city.",
    "He bribed the boatman to destroy the statue.",
    "He's got a twirly moustache! He's clearly a villain!",
    "I should go.",
    "I should go.",
    "We're looking for Meike.",
    "We really need to find Meike.",
    "Are you alright?",
    "You're not joining the protests?",
    "Goodbye.",
    "We're looking for Meike.",
    "We should just kill him.",
    "We should discredit him.",
    "We could get into the records chamber first.",
    "I'll meet you both at the library.",
    "Could you open the display case, please?",
    "Here, take this soft clay.",
    "Can you tell me more about the library?",
    "How do these eras correspond with the Ages of the world?",
    "Thanks for the information!",
    "What do you know about impenetrable rocks?",
    "The big one in the mines south of the city. Dondakan's big rock.",
    "Yes, what exactly does that mean anyway?",
    "Does that mean I will have to deal with this demon again some time?",
    "Can you tell me more about the keys?",
    "Can you show me the way to the Barendir caverns?",
    "What did Meike mean, you don't want to face it?",
    "Have you really been agitating against the Consortium?",
    "I have to do something else.",
    "Never mind.",
    "What's that way?",
    "Pretty Flower?",
    "Oh, okay.",
    "Oh, okay.",
    "We should go after him.",
    "Let him go. He's not a threat.",
    "We should get reinforcements.",
    "What about other divisions of the Black Guard?",
    "What about a team of heroes?",
    "What about the trolls?",
    "Could the trolls make a difference?",
    "I don't know why they haven't got involved already.",
    "Why are you so scared of the trolls?",
    "Never mind.",
    "I'm going to go and talk to them, with or without you.",
    "I have to do something else.",
    "I have to do something else.",
    "I'd like to see you try to eat me!",
    "I need to talk to you.",
    "How can I prove I'm worthy?",
    "I'll just be going.",
    "We want you to help defend Keldagrim from chaos dwarves.",
    "Lots of chaos dwarves for you to eat.",
    "The dwarves of Keldagrim will be grateful.",
    "Colonel Grimsson made fun of your name.",
    "I'll just be going.",
    "Why do you have such a silly name?",
    "I'll just be going.",
    "What are you doing here?",
    "How's your Farming coming along?",
    "How can I get Pretty Flower to listen to me?",
    "But Pretty Flower was talking to me earlier!",
    "Pretty Flower is deaf?",
    "I'm not a crazy person!",
    "Wait, what pretty flower are you talking about?",
    "Mmm... soup.",
    "I thought you were talking about the warlord.",
    "Could I have a pretty flower?",
    "I'm making soup.",
    "I need to give it to Pretty Flower.",
    "*sigh*",
    "I need to give the plant to the warlord.",
    "Just give me the flower!",
    "Bye.",
    "I want something to remember you by.",
    "Bye.",
    "Bye.",
    "Bye.",
    "Bye.",
    "Take a look at this pretty flower...",
    "I thought you might want to make some soup.",
    "You see the flower? That's you, that is. Haha!",
    "It's a gift from Colonel Grimsson.",
    "Do you know where Veldaban is?",
    "Hello, Veldaban.",
    "Your Majesty.",
    "I don't understand how you ended up as king.",
    "Shouldn't your father, Dondakan, be king?",
    "Why didn't Meike make herself queen?",
    "What's happened to the Consortium now?",
    "Will you have the statue rebuilt with your head?",
    "So you're a king - what now?",
    "Plus you're not even the rightful king.",
    "What do you mean, what you're turning into?",
    "So what are you going to do?",
    "How do you think Veldaban is doing as king?",
    "Have you taken over Veldaban's job?",
    "Where is Veldaban?",
    "Do you need any help?",
    "I should go now.",
    "Did the wounded miners recover?",
    "Is the mine up and running again?"
  ],
  "Foreman Jack": [
    "It's magnificent isn't it? Just ... magnificent! All the mining companies pooled together to build this place. If you ever needed proof that the Consortium is good for Keldagrim, this is it.",
    "Wait, who's that? Hey! You there! You can't be in here without authorization!",
    "This is awful! Just ... awful! Sven! Quick, run to the palace and tell the Consortium what's happened. Human, please help us! We need to free those miners!",
    "You're alive!",
    "hank you, human! I'll look after the wounded if you just bring them to me.",
    "Are you alright?",
    "Thank Guthix you're here! There are still miners trapped! Hey! Where are you going?",
    "This is just ...",
    "He's unconscious, but he'll live.",
    "Is he... no, he'll be okay.",
    "She's dead! Dear Guthix. Please, human, there's one more miner. They might still be alive.",
    "Another one dead. This is awful. Just ... just awful. It's not your fault, human. I know you did all you could. You should go now. I'll look after the wounded and make sure the ... others get a proper burial."
  ],
  "Miner": [
    "Thank Guthix you're here, human. I can't walk... I think my legs are broken. if you carry me back to the foreman, I'll be okay.",
    "I'll live, thanks to this human.",
    "Where did you ...? Never mind, I'm just glad you're here. Get me to the foreman an I'll be fine.",
    "I'm ... I'm fine, I think... Just get everyone else out...please.",
    "Ugggh... thank you, human. I think I'm going to pass out now..."
  ],
  "Black Guard": [
    "Our orders are to get the machines working first. I'm sorry.",
    "Veldaban? You're under arrest on suspicion of involvement with the attack.",
    "Veldaban's been inciting violence against the Consortium. The company directors want him investigated. If you think he wasn't involved, you can come to the palace and defend him.",
    "If you saw something, you should come to the palace and tell the company directors. Maybe you'll be able to get your friend off the hook.",
    "S-sirs! Ma'am! Please forgive my interruption...",
    "Chaos dwarves! Our scouts have spotted a chaos dwarf army in the Barendir caverns.",
    "There's something else.",
    "There's a crowd outside the palace, at the east door. They're gathered around someone, he's making a speech.",
    "It's Hreidmar, the old head of the Red Axe. He's saying something about a king.",
    "Sirs! Ma'am! I mean... Your Majesty!",
    "News from Barendir! The chaos dwarf army has been routed by trolls!"
  ],
  "Protester": [
    "Down with the Consortium! Murderers! Consortium murders!"
  ],
  "Veldaban": [
    "Player! Over here!",
    "What are you doing here? No, never mind that. I heard there was a chaos dwarf attack. Was anyone hurt?",
    "I saw a Black Guard hazard squad go in here. Weren't they able to rescue the miners?",
    "What? Lieutenant Brae's in charge of the Black Guard now. She wouldn't leave people to die!",
    "Orders from the Consortium!",
    "Lieutenant Brae isn't like that, I'm sure.",
    "They must have had orders from the Consortium. I know the Consortium put profits ahead of people's lives, but they've never done it this blatantly! Well, this time the game's changed. When word spreads about this, I think we could be looking at a full-scale revolt.",
    "What? That's absurd!",
    "I'll go quietly, player, if you want to help me, come to the meeting room at the top of the palace and convince them I wasn't responsible.",
    "Don't, player! I'll go quietly. If you want to help me, come to the meeting room at the top of the palace and convince them I wasn't responsible.",
    "What are you talking about? I had nothing to do with it!",
    "Player! Tell these maniacs to let me go!",
    "Yes, what?",
    "Convince the company leaders to let me go!",
    "Talk to the company leaders. You'll have to get each of them on our side.",
    "The leaders all care about different things, so you'll need to take a different approach with each of them.",
    "Even if you think you've got one to agree with you, they might change their mind again if you say the wrong thing.",
    "Once you've talked to all of the leaders, talk to the general secretary.",
    "Because they can't take criticism!",
    "I've been speaking out against the Consortium. I've been telling people the truth! The Consortium happily let people die as long as they keep making money. There are a lot of people that agree with me.",
    "Now I've been proved right. There's an explosion in the Lava Flow Mine, and what do the companies do? Do they save the miners' lives? No! They fix the machine to keep their profits rolling in.",
    "But because I've been criticising the Consortium, they think I was involved in the attack!",
    "They let those miners die in order to save their machine! It's never been so blatant: the Consortium doesn't care about people, only profits.",
    "Oh, shut up.",
    "Gah! Alright, I'll try, if you think it'll help.",
    "Thank you. I... humbly accept your judgement.",
    "You stuck-up cave pigs! You had no right to keep me in the first place!",
    "Come on, Player. Let's get out of here.",
    "On, no... not Barendir, not again...",
    "You stuck-up... I mean, with respect, I urge you to reconsider.",
    "Talk to them again, Player! There's still time to change their minds.",
    "He's got them eating out of his hand.",
    "Listen, I know someone who might be able to help us: Meike, the leader of the Monarchist Society. We should find her. Maybe someone in the crowd knows where she is.",
    "No. That's why we came to see you.",
    "Player, what if it was Meike who got arrested? We should check at the Black Guard HQ.",
    "Lieutenant Brae, what's this man charged with?",
    "We badly need to find Meike. Klaas, if you'll tell us where she is, I'll see what I can do for you.",
    "Ah, well. For a charge like throwing stones, the Black Guard can't hold you for long anyway.",
    "And with the Black Guard stretched thin controlling the riots, you might not see another guard again for hours. Isn't that right, Lieutenant?",
    "So, for example, if someone were to take you into the slums and break both your legs for not giving them the information they need, they might never catch whoever did it.",
    "Thank you, you've been very helpful.",
    "Meike. You're not an easy person to find.",
    "We need your help. You're an expert on the monarchy. Down at the palace, Hreidmar is-",
    "He's a villain, Meike. He's kidnapping people, turning them into chaos dwarves. The chaos dwarf army is under his command.",
    "We've got to stop him. There must be something we can do.",
    "We can't. He's in plain view. The mob would tear Keldagrim apart, starting with us.",
    "He's been careful. We may know what he's up to, but we don't have strong evidence to tie the Red Axe to the chaos dwarves. It would be our word against his.",
    "We've got to stop Hreidmar. There must be something we can do.",
    "If only we could. No one can get in there.",
    "For Guthix's sake! This is no time for qualms!",
    "I'll see you at the library, Player.",
    "Let's get this door open. I think the crowd at the palace is getting agitated.",
    "Good work, Player!",
    "What's the matter?",
    "He altered the records. That's what we expected.",
    "Listen, Meike... Hreidmar cannot be allowed to take power. He's evil. It doesn't matter what the line of succession says.",
    "You wouldn't...",
    "Meike, I don't want... There must be some other way.",
    "Colonel Grenda is in charge of the Black Guard. We don't need to worry about that.",
    "Alright, Player. I can show you the way. Let me know when you're ready.",
    "Alright, Player. Meike's right, we should investigate the chaos dwarf army. Hreidmar won't need to be the rightful king if he can take over the city by force.",
    "Alright. Follow me.",
    "She meant that it's in Barendir; the chaos dwarf army is camped out in the Barendir caverns.",
    "And she's right. The thought of going back to that place...",
    "There was a battle there between the Black Guard and the trolls. The worst we'd had in decades. Tunnels were literally choked up with bodies.",
    "It's where Colonel Grimsson went beserk (sic) and got his scar. We all came away with scars, though, physical or psychological. The thought of going back there...",
    "But that's where the chaos dwarf army is, and that's where we've got to go if we want to stop them. Let's get it over with.",
    "I'll be in the Laughing Miner.",
    "I'm not a commander any more. I resigned from the Black Guard.",
    "*sigh* Just tell me what's happening, colonel.",
    "The Consortium's locked down, Lieutenant Brae's barely able to keep the city under control, and there's no help coming from Keldagrim.",
    "Convenient, aren't they? No need to bring torches into Barendir.",
    "Gods, I hate those crystals. Sparkle, sparkle, sparkle. It's like they're mocking all the death and pain that happened in these caves.",
    "We don't need to go that way, Player.",
    "That's troll country. Those caverns belong to Pretty Flower.",
    "Shh! Not so loud!",
    "Pretty Flower was the only troll warlord who survived the Battle of Barendir. Now he's the most powerful warlord in this area.",
    "His name strikes fear into the heart of every dwarf soldier. They say he wears a belt of dwarf skulls.",
    "Grimsson. You don't need to do this. Turn back your army.",
    "What happened to you, Grimsson? You were a harsh officer, but you were never cruel. We all looked up to you.",
    "You don't... you don't remember, do you? The Red Axe wiped your memory too!",
    "They've brainwashed you, Grimsson! You're even more brainwashed than me! Ha, ha, ha!",
    "You coward, Grimsson!",
    "Grimsson's abandoned his command post, but he'll have fallen back to a fortified position.",
    "I thought he'd have more honour than that. I should have known better.",
    "That would mean the two of us against the whole Red Axe army. I don't care how mighty a warrior you are, two of us against an army would be suicide.",
    "I'd like to believe you, but the size of his army suggests otherwise.",
    "That's a good idea, but where from?",
    "The Keldagrim Black Guard is tied up keeping the peace, and there's no easy way to recall the Black Guard from across the world.",
    "No, I think Colonel Grenda's First Division are the only Black Guard help we're going to get.",
    "This is an army we're dealing with, not a single enemy. I don't think any individual is going to make the difference we need.",
    "No! You're not really suggesting...",
    "Well, they could, if they entered on our side, but I don't see how you can arrange that. There's no predicting what the trolls will do.",
    "Neither do I, but I thank Guthix that they haven't.",
    "There's not been a major attack since the Battle of Barendir. We've kept out of these caves and Pretty Flower has left us alone. I worry that he's been building up an army to attack again, though.",
    "Grimsson must have been sensible enough not to antagonise them.",
    "Why aren't you? You must have met trolls before. They eat humans as well as dwarves.",
    "Alright, go. I'll be back at the Laughing Miner if you need me.",
    "If you want to go and talk to the trolls, you can do it without me. I'm staying here.",
    "I hope you've got the trolls on our side, Player.",
    "Meike's just told me how she... sorted out our problem with Hreidmar. It seems the records don't point to him after all.",
    "It's done now.",
    "There's someone coming onto the balcony.",
    "Guards! Arrest that man!",
    "Guards! I said arrest that man!",
    "Don't call me 'sir' any more, lieutenant. Call me 'Your Majesty'."
  ],
  "Sven": [
    "Please, everyone settle down. No one's allowed into the mine. There's nothing to see here!"
  ],
  "Green Gemstone director": [
    "We murdered two miners in order to get a machine running! How do we spin that?",
    "And what do you want, human? Can't you see we're busy?",
    "Yes, what do you want, human? Are you here to gawp at how dwarves care more about money than life? It's a good day for that.",
    "Veldaban's a known agitator against the Consortium. He's accused us of being in league with the Red Axe.",
    "I don't know if a trial will find him responsible for the attack, but we've got to keep him under guard until the crowd has died down.",
    "It's the single most important piece of machinery in Keldagrim, and I'm not going to tell its operational details to an outsider!",
    "I voted to save the miners! Not everyone around this table is a murderer, despite what you and Veldaban might think.",
    "Really? What happened?",
    "Yes, that's what we heard.",
    "I know! We ordered them to. Alright? The Consortium has blood on its hands. You don't need to remind me.",
    "Oh, thank Guthix. I wish more dwarves were like you.",
    "Look, I know you and Veldaban are allies. If you're both prepared to help us like that, then maybe we shouldn't get in your way.",
    "The human rescued some of the miners, which is more than anyone else here can say. If he will vouch for Veldaban, then I say we should let him go.",
    "If that's your attitude then I retract my decision.",
    "Have Colonel Grenda send the First Division to guard the caverns. Quickly!",
    "Veldaban, human, please... If there's anything you can do to calm that crowd outside down, please help us.",
    "If we let Veldaban go he'll portray us as monsters. We've got to keep him away from the crowds until we've got things under control.",
    "We still have to decide what to do with him. We need to discuss this further."
  ],
  "Brown Engine director": [
    "We had to do it. Didn't we? If we hadn't, then ...",
    "Sometimes I wish I'd never become a company director. I wish I hadn't had to make that decision. Those miners are dead and we could have saved them... but we had to do what we did.",
    "It was the Yellow Fortune director's idea. We have to manage public opinion, and Veldaban was having a negative effect on it.",
    "The Blue Opal director is the expert. You should ask him if you have any technical questions.",
    "I voted to save the machines. I mean we had to, didn't we? It's like the Blue Opal director says. More people would have died if we'd saved the miners instead. We did the right thing, didn't we?",
    "How can you say that so casually? You're as heartless as the other directors.",
    "Thank you, human. At least someone is prepared to be sensitive about this, rather than shouting. Listen, there's no point in keeping Veldaban detained. We don't have anything on him. I say we should let him go.",
    "I know...",
    "No, you...you can't take that tone with me! I'm a company director!",
    "I guess you saw first-hand what we did, then.",
    "We've done enough that's questionable today. We shouldn't add wrongful arrest. We should let Veldaban go.",
    "We can't put down a revolt at the same time as repelling a chaos dwarf invasion! We're doomed!",
    "We can't risk letting Veldaban go. We've got to keep him for the moment."
  ],
  "Blue Opal director": [
    "Of course we had to do it! We shouldn't need to spin this at all. If people just understood how the machines work!",
    "Idiots! Sentimental, soft-minded fools!",
    "We saved hundreds of lives. We did the right thing. If those people outside would listen for five minutes they'd understand.",
    "What? Oh, yes, him. You should talk to the Yellow Fortune director about that.",
    "Finally! Someone interested in the details of the problem!",
    "The lava comes from the sub-Barendir magma vent. Lava is siphoned off and runs along channels.",
    "Heat rising from the lava heats water in the primary boilers suspended over the lava channels.",
    "The resulting steam is channeled into the seven secondary boilers in the centre of the mine.",
    "From there, it's pushed through distribution vents to the various machines around Keldagrim. The mine carts, the Blast Furnace, and so forth. Everything relies on those distribution vents.",
    "No, no, no! It wouldn't have been able to get close enough to them. They're suspended over the lava!",
    "Yes! At least you're paying attention, not like these other idiots.",
    "Listen, you're clearly smarter than most of the mob out there. You're certainly smarter than some of these idiots on the Consortium.",
    "If you want us to release Veldaban into your care, that's what I'll recommend we do.",
    "Don't be stupid! The distribution vents run throughout the whole city. No single explosion could damage them all.",
    "I voted to repair the mine machinery, and you would have too if you understood how machines worked.",
    "If the power was down for more than a few minutes, it would go into complete shutdown and we wouldn't get it back up for days.",
    "The mine carts would stop running. We wouldn't be able to bring in food. People would starve.",
    "We couldn't afford to be sentimental. We had to let a couple of miners die in order to save hundreds of people.",
    "Then you would appreciate how bad the damage was and how important it was that we fix it right away!",
    "If we keep Veldaban under arrest we'll just find a way to bungle the situation further. If we let him go, maybe he and this human can help us.",
    "For Guthix's sake! What is it now?",
    "Veldaban, you're free to go. Get out of here.",
    "Veldaban and this human are clearly as stupid as some of you. We don't want them running around causing further harm. I say we keep Veldaban here."
  ],
  "Yellow Fortune director": [
    "They don't understand how the machines work, and they're hardly in the mood to learn! That's what you wanted, isn't it, Veldaban? You forced us to make this choice so that we look like murders.",
    "I said this would happen. We saved the city, but we look like murderers.",
    "We can hardly arrest the chaos dwarf. The Consortium must be seen to be taking action! Plus, Veldaban is a focus of anti-Consortium feeling. Getting him off the streets might slow the revolt down.",
    "He's a rabble-rouser. He's been stirring up feelings against the Consortium ever since he resigned from the Black Guard. But perhaps you're right. Arresting him could do more harm than good. If you promise to keep him under control then I think we should let him go.",
    "Personally, I don't think so, but that's not the point. What matters now is public perception, nothing else.",
    "Don't be so naive. You know what the law is in Keldagrim? The Consortium can do what it likes, that's whatt the law is.",
    "It's a symbol of Keldagrim's technological prowess.",
    "I voted to save the miners! And these other fools would have, too, if they weren't so out of touch!",
    "I understand the argument that getting the machine running was more important, but we could never sell that to the mob outside. That's what's important now.",
    "Yes, I know - and it doesn't put you in a good light, does it? You'd be under arrest along with Veldaban, if I was sure it wouldn't cause a diplomatic incident with the human lands.",
    "As much as we don't like him, Veldaban's a popular figure with the people. Keeping him locked up might do more harm than good. We should let him go.",
    "As do I. We can't have Veldaban spreading that sort of talk about the Consortium. We need to keep him until he's calmed down.",
    "Who's the crowd's ringleader? Veldaban is still here.",
    "Oh, Guthix. The Monarchists...",
    "Veldaban is a focus of anti-Consortium feeling. We should keep him away from the crowds for now.",
    "People of Keldagrim! Please listen!",
    "The Consortium has guided this city for the past five hundred years.",
    "Recent events, however, have made it impossible for the Consortium to stay in power.",
    "These are troubled times, and there is truth to the Azdaran Fragment. 'No band of petty councillors can preserve this city through its darkest days – only a king.'",
    "We have, therefore, authorised the opening of the records chamber in order to determine who is the rightful heir to the throne.",
    "The Consortium will step down and become an advisory body under the new king."
  ],
  "Consortium general secretary": [
    "The Consortium's first item of business is to decide how to deal with Mr. Veldaban.",
    "This is not a formal vote, the leaders are attempting to reach a consensus decision. It appears to be taking some time.",
    "I suggest you speak to each of the company directors before they pronounce judgement.",
    "Very well. I believe the Consortium is ready to pronounce judgement. Sirs, ma'am, have you reached a decision about the prisoner?",
    "Thank you. Veldaban will remain here for now.",
    "Thank you. The matter is concluded. Veldaban, you are free to go with this human.",
    "Thank you. Veldaban will remain here for now.",
    "This is an emergency meeting of the Consortium. Some of the directors elected to stay near the trade floor to handle the economic repercussions of this crisis.",
    "I am the Consortium's general secretary. I am not connected with any one company, but am employed by the Consortium as a whole to help with administrative tasks.",
    "Ladies and gentlemen, I have studied the family histories in the records chamber. There is one man in Keldagrim who has an incontrovertible claim to the throne.",
    "The rightful king of the dwarves is... Veldaban."
  ],
  "Hreidmar": [
    "The Consortium government is both corrupt and incompetent! The incident in the Lava Flow Mine proves that!",
    "Even now, a chaos dwarf army stand poised to attack the city! Only a strong leader can keep us safe from this menace!",
    "Our ancestors knew this would happen. Remember the Azdaran Fragment! The oldest document in our city's history.",
    "'No band of petty councillors can preserve this city through its darkest days – only a king.'",
    "The Age of the Consortium has failed us! It is time to go back to the Golden Age! The Age of Kings!",
    "All I ask... All I ask us that the Consortium open the sealed records chamber. The family trees in there will show us who is the most direct descendant of King Alvis.",
    "Only the rightful King of Keldagrim can save the city now. Only a king!",
    "At last, I shall have my birthright...",
    "Veldaban?",
    "Lies! I am the rightful king!",
    "My army will overrun the city! You will pay for denying me my throne!"
  ],
  "Crowd": [
    "Only a king! Only a king!",
    "Only a king! Only a king!"
  ],
  "Protestor [1]": [
    "Only a king! Only a king!",
    "I think they normally meet in the King's Axe inn.",
    "I think he's talking a lot of sense. Why shouldn't we listen to him?",
    "No one can turn ordinary dwarves into chaos dwarves. That's impossible.",
    "Of course he did! He wanted to get away from the corrupt Consortium system!",
    "That's ridiculous! He's a supporter of the monarchy. Why would he do that?",
    "Come to think of it, weren't you involved in the statue being destroyed? I think you're trying to shift the blame!",
    "He has a fine example of a dwarven moustache! You humans are just jealous of our facial hair!"
  ],
  "Protestor [2]": [
    "Meike? Isn't she the leader of the Monarchist society?",
    "I don't know why she's not here."
  ],
  "Luitger": [
    "Oh, hello, Veldaban. Hello, human.",
    "Isn't she down by the palace?",
    "Oh. Last I heard, the others all joined the protest.",
    "I told you, I don't know where she is. Leave me alone.",
    "Oh... I don't know.",
    "I was going to meet up with Meike and Klass, like normal. But then all that stuff down at the palace started to happen and they never showed up. I think they both went to the protest.",
    "I suppose I should...",
    "I don't know, though. When the monarchy was just something we talked about, I was in favour... but it all looks so different now.",
    "I heard it was getting violent down there. I heard someone got arrested. I don't want to be involved in anything like that.",
    "He looks very good in his crown, and he makes such lovely speeches."
  ],
  "Klaas": [
    "You can't keep me here! When the new king is crowned, he'll make you pay for this!",
    "You'll all be sorry! All of you!",
    "I know where she is, but I'm not helping you to find her!",
    "You're not getting me to sell out like that!",
    "Alright! She went to the tower south of the city!",
    "He isn't moving quickly enough. A king should have solved all our problems by now."
  ],
  "Lieutenant Brae": [
    "There's not going to be a new king!",
    "We didn't arrest her. I don't know where she is.",
    "He was throwing stones at the palace. The crowd was getting out of control.",
    "Veldaban, what are yo-",
    "I suppose that's true, bu-",
    "He's gone, sir. We lost him in the crowd.",
    "Hello, visitor. I'm sorry, I don't think I have much time to talk.",
    "Yes, I'm the new head of the Keldagrim Black Guard. That's why I'm so busy. There are so many things to organize.",
    "King Veldaban, you mean? I imagine he's in the palace, on the top floor.",
    "Supreme Commander Bisi doesn't want... I mean, er, thank you for the offer, but there's nothing you can help with at the moment.",
    "Enjoy your stay in Keldagrim, visitor."
  ],
  "Meike": [
    "Veldaban. Human.",
    "I wanted to be on my own. What do you want, Veldaban?",
    "He wants to open the sealed records chamber, yes. And he sounds like he knows what we'd find if we looked in there, doesn't he?",
    "I believe you. It's just...",
    "All of my adult life, I've looked at that statue and though about how much better life would be under a king. I believe in the Azdaran Fragment. 'Only a king.'",
    "But did it have to be Hreidmar to be the one to bring it close? And everyone's being taken in by him...",
    "This isn't how I wanted it to go.",
    "Kill him?",
    "That would be no good. He's played the crowd exactly right.",
    "Actually... there might be a way. I don't like to suggest it, but...",
    "Alright!",
    "The keys to the records chamber are kept in the library in Keldagrim West. Normally, they're locked away, but the librarian knows me, He might let me handle the keys.",
    "We can make moulds out of clay and use them to forge new mithril keys.",
    "Alright. You'll need six pieces of soft clay to make moulds of the keys, and later you'll need six mithril bars to make the duplicates.",
    "Alright, we're all here. You should speak to the librarian and ask him to open the case with the keys in it.",
    "I'm helping this human to research a book about Keldagrim for Varrock Library. We need to see some of the documents in the case.",
    "Of course.",
    "You should speak to the librarian and ask him to open the case with the keys in it.",
    "Looks like you're not going to be able to do it yourself. Give me the clay, then keep the librarian talking.",
    "I think I know what to do with these. Why don't you have a chat with the librarian so his attention isn't on the display case?",
    "I've done it. I've made a clay mould of each key: the original keys are fine.",
    "You'll need to take the key moulds and six mithril bars to a furnace in order to make duplicate keys. I don't think there's a suitable furnace in Keldagrim. The closest one is probably Rellekka.",
    "Once you're done, meet me and Veldaban in the records chamber. The entrance is built into the west wall of Keldagrim, near the Black Guard HQ.",
    "You have all the key moulds. Try looking in your bank.",
    "You've got the keys! Good work.",
    "Each key matches with a lock, but I don't know which one is which. It looks like the identifying symbols have been worn away. You'll have to work it out by trial and error. Put a key into each lock and then try the door and see how the bar moves.",
    "Thank you, human. I never thought I'd live to see the inside of this chamber.",
    "The family trees that show the current rightful king should be here somewhere...",
    "Ah, here we are.",
    "No. Oh, no...",
    "Acoording to these records, Hreidmar is the rightful king of Keldagrim.",
    "No, you don't understand. These records haven't been altered. There's no way that...",
    "I'd be able to detect any tampering. Even if it could fool the Consortium General Secretary, I know what to look for, and I'm not seeing it here.",
    "Hreidmar is the king of the dwarves.",
    "You think I don't know what? For goodness' sake, Veldaban, you think I don't...",
    "There might be some loophole. There might be a rule that disqualifies him...",
    "Leave me here to work. If I can't find something, then I might have to... Even if Hreidmar didn't alter the records, it might be possible...",
    "Veldaban, it might be the only way. We're all agreed. Hreidmar can't become king. Whatever it takes to stop that.",
    "The two of you should go. There's still a chaos dwarf army marching on the city, remember? Maybe you should worry about that.",
    "You do need to worry, Veldaban. You don't want to face it because of where it is, but sometimes the good of the city means doing something you don't want to do.",
    "I'm sorry, Veldaban. It was the only way.",
    "May Guthix have mercy on me...",
    "I'm sorry, Veldaban.",
    "All hail King Veldaban! Long love the king!",
    "Hello, Player.",
    "It's early days yet. I know King Veldaban is doing his best, he hasn't got an easy job."
  ],
  "Librarian": [
    "There are some valuable historical artefacts in that case. It wouldn't be right for an outsider to see them.",
    "Hmm, alright, Meike, if [he/she]'s with you. I'll need to keep an eye on you, though. Those are valuable artefacts and they mustn't leave the library.",
    "Why don't you open it? I've already given you the key.",
    "What do you think you're doing? I'm going to keep an eye on you, human.",
    "Welcome the Keldagrim library, human traveller!",
    "Why, certainly, it is one of my favourite subjects!",
    "I am Hugi, you see, I am the chief librarian here. Hugi, my parents named me that, it means 'personification of thought' in the ancient dwarvish tongue.",
    "Quite like the name myself.",
    "The books in the library have been collected for any centuries now, through various generous donations.",
    "You'll find books dating from many different eras as well. Such as the Era of Kings, the Rise of the Consortium and the Era of Prosperity, our current era.",
    "Oh, they are quite different, and most of them take place in the Fourth Age.",
    "Since we dwarves hid underground for a long time to sit out the wars that raged above the ground our history books differ slightly from those written by humans.",
    "You're confusing me, what rock exactly are you talking about?",
    "I see, I see. I heard there was a demon inside there that you banished.",
    "There are some demons that we cannot see properly as mortals. They also cannot be fought with normal weapons. But sometimes these creatures manifest themselves in a solid form in our world. Their avatar. When you defeat an avatar, you defeat the actual demon behind it. But they don't die, they are banished to where they came from originally.",
    "Doubtful. He will grow stronger and stronger over time, but that's a process that will take a thousand years at least. Even dwarves don't live so long. No, we won't see him again and the mines are safe to dig for gold now. Of course, that might lead to other problems eventually...",
    "Oh, of course! Those keys are the library's most precious artefacts.",
    "They're a fine example of the style of craftsmanship from the end of the Era of Kings. Notice how ornate they are compared with the style of Keldagrim metalworking today.",
    "The records chamber itself dates back to the middle of the Era of Kings, but the current door was built by the Consortium during the reign of Alvis, the last king.",
    "After Alvis's death, the Consortium closed the records chamber and the six major company directors took a key each.",
    "As the Consortium expanded beyond six companies, the directors started arguing over who would keep the keys. Eventually they decided to lock all the keys together in the library.",
    "The records chamber has been opened a few times since then, at the Consortium's orders, but not often. I hear it might be opened again soon, which will be exciting!",
    "It's nice to have a chance to tell someone all that. No one's shown such an interest in the keys since that Hreidmar fellow, and that was about twenty years ago.",
    "I hope that helps you with your book!"
  ],
  "Player Here": [
    "take this soft clay..."
  ],
  "Meike The young prince was adopted by the otherwise childless director of what was then a small, obscure mining company": [
    "the Red Axe."
  ],
  "Colonel Grenda": [
    "It's good to see you, commander.",
    "I'm sorry, sir, I didn't quite catch that. It must be the acoustics in these caves.",
    "The chaos dwarf army is camped at the other end of the Barendir tunnel. They haven't moved since we spotted them. It's like they're waiting for a signal.",
    "A couple of our scouts managed to get there and back. The chaos dwarf army is huge. They've got dwogres, hand cannoneers and multicannons.",
    "Unless we can get reinforcements, I wouldn't want to bet on the outcome of this battle.",
    "I thought as much.",
    "Well, commander, any help you and your human friend can give would be appreciated.",
    "I wish they'd attack and get it over with. I didn't sign up to the Black Guard to stand around.",
    "Yes, I was, human.",
    "I was just a private at the time; Barendir was my first big operation.",
    "It's what showed me what war is - there's no romance, no glory. It's them and you, and you do whatever it takes to win.",
    "I don't know, human. What can you do to help?",
    "You're not in my chain of command. You should see what Commander Veldaban wants you to do.",
    "They're heavily entrenched. Even if we outnumbered them, which we don't, we'd be slaughtered. If we wait for them to come to us, we might stand a chance."
  ],
  "Colonel Grimsson": [
    "Veldaban! How's your memory? Forgotten any more dead girlfriends? Ha, ha, ha!",
    "I watched her change, Veldaban! I watched as we made her forget you.",
    "You were holding hands as we pried you apart, tears in both your eyes. Such a touching sight. But you'll never even remember that moment! Haha!",
    "The Red Axe is my life now!",
    "Veldaban! I'll crush you!",
    "VELDABAAAAN!",
    "This means nothing, Veldaban! You may defeat me, but you'll never defeat my army! Men! Fall back!"
  ],
  "Pretty Flower": [
    "A tall dwarf! Pretty Flower eat dwarf for breakfast!",
    "Hmm, Me not know if human good to eat. Human might be poisoned. Me not eat you, poisoned human. Go away before me change mind.",
    "You reverse psychology not work on me, human. You want me eat you. Me bet you poisoned!",
    "People try to poison me, but me not fall for it. Me too clever!",
    "You weak. You not worthy to talk to me.",
    "You think you worthy!",
    "If you worthy, you pass test of strength. You must pick up Big Rock.",
    "You go, human, and not come back.",
    "What you waiting for? Me tell you to pick up Big Rock!",
    "No, that not right! I tell you to lift up Big Rock!",
    "Knock over Big Rock - he not wait forever! You wait too long, maybe he knock you over!",
    "Okay, human. You lift up Big Rock. What you want talk about?",
    "Why we want to help Keldagrim?",
    "Yuk! Chaos dwarves not taste right. They taste like bad eggs.",
    "You try to poison me! Everyone try to poison me, but me too clever!",
    "Trolls not care about what dwarves think in their tiny dwarf heads.",
    "Me not fall for dat! You say dat to manipulate me. Me not believe you.",
    "You go, human, and not come back.",
    "Graaaar! Human! Always with the name!",
    "Trolls, we named after first thing we eat.",
    "Big Rock: first thing he eat is big rock. My Arm: he eat his dad's arm.",
    "When me only baby troll, me not know what me eat, then everyone laugh.",
    "But me showed them! Me became baddest troll ever! Now dwarves tremble at name Pretty Flower!",
    "My son, he nearly ready to eat food. Me hope he get better name than Pretty Flower.",
    "You go, human, and not come back.",
    "Even own boy make fun of me. This sad day for trolls.",
    "Take a look at what?",
    "What you show me dat for?",
    "Pretty flower soup is bad - My Arm tell me so.",
    "You trying to poison me! Everyone trying to poison me, but me not fall for it! You have to do better than dat, human.",
    "You make fun of name of Pretty Flower?",
    "Graaar! Go away before I crush you like Tiny Insect!",
    "Tiny Insect was name of last troll to make fun of me. She not do it again!",
    "This gift from chaos dwarf?",
    "He make fun of me!",
    "Grr...aaarrr...",
    "Me not let dwarf insult me! Me crush smelly dwarf!",
    "Listen me now, trolls! We go to kill smelly chaos dwarves!",
    "Haha! It be great battle! Maybe my son get great battle name.",
    "You go now, human. Go back to dwarf city, tell your dwarf friends we deal with chaos dwarves!",
    "You go now, human! I get trolls ready to attack chaos dwarves! My son earn his battle name today!",
    "You not need show me that again! Take pretty flower somewhere else!",
    "Gaah! Everyone shut up!",
    "Why? Why my little boy eat dat?",
    "I hope he get strong battle name. Maybe he eat cannonball, or axe, or dwarf helmet.",
    "Why he have to eat sparkly crystal?",
    "You laugh now, but someday you be sad."
  ],
  "My Arm": [
    "Dat not dwarf. Dat human!",
    "Pretty Flower think someone try to poison him, so he make me grow new food ingredients for him.",
    "My Arm getting good at dis. I growin' plenty of goutweed for Burntmeat, an' he very happy.",
    "What you talking about? Pretty flower never listens to no one. Why you expect pretty flower listen to you?",
    "My Arm know some people talk to pretty flower... but My Arm think those people crazy people.",
    "Haha! You t'ink pretty flower talk?",
    "Oh... yes... pretty flower done talk to me too, if dat make you feel better. You not crazy person.",
    "Of course. Pretty flower don't got no ears.",
    "It look bit like ear sometimes... but it not ear, it flower.",
    "It all right, Player. My Arm not think you a crazy person.",
    "My Arm done grown pretty flowers on top of mountain – dey nice. Burntmeat say dey smell like thing he not know what it smell like. So he put dem in soup.",
    "Mmm...soup. Soup-de-soup-de-soup.",
    "No, no, warlord is Pretty Flower. We talking about pretty flower.",
    "Dey do sound kind of similar. Me never think of that before.",
    "What you want it for?",
    "Mmm... soup.",
    "Actually, that bad idea. Burntmeat get sick when he eat flower soup. He make me promise not to put flower in soup ever 'gain or he stomp on my face.",
    "So that bad idea and me not allow it.",
    "You need give pretty flower to itself?",
    "What you sigh like dat for, Player?",
    "Okay, me see.",
    "Haha. It kind of funny, all this mix-up, because troll have same name as thing.",
    "Me never think of that before. Well, anyway, here you go.",
    "It only flower! You not get so worked up.",
    "Aww, that very nice.",
    "But if you lose memory, me not think flower help. You just think 'what dis pretty flower?' and it be mystery.",
    "Then maybe you go on quest to find out thing you forgotten...",
    "No, that silly idea. No one thinks that good idea."
  ],
  "Big Rock": [
    "Me bet you not strong enough to lift me.",
    "Hwerp!",
    "Human lift me up! Me not think any human is strong enough, but this human lift me up!",
    "Where you want us to take you, boss?"
  ],
  "Unnamed troll child": [
    "Look dad it you! Fritty Plower!"
  ],
  "Barmaid": [
    "Oh, I don't know. Why don't you try looking for him in the enormous crowd right outside the palace?"
  ],
  "King Veldaban": [
    "Hello, Player.",
    "Oh, don't call me that, Player. You of all people...",
    "What do you want to talk about?",
    "Meike altered the records. It only took a few pen-strokes, she said. It looks like I, and not Hreidmar, descended from King Alvis's secret heir. You, I and Meike are the only people who know it isn't legitimate. This must stay our secret, Player. I never wanted this kind of power, but it was the only way to keep Hreidmar off the throne.",
    "The old rules of succession included a maximum age. Once the king reaches a hundred and fifty, the throne passes on to their heir.",
    "The monarchy was for men only and everyone knows that. No one would have believed the records if they had pointed to Meike.",
    "The Consortium still exists. It's gone back to being an advisory body, just like it was in King Alvis's day. I don't like the Consortium's priorities, but they've got experience in running the city that I don't. I still need them around.",
    "It doesn't seem right. Maybe one day, but not anytime soon.",
    "What now? Everything now! Everything, right now! The Consortium had eight leaders - they could divide responsibility between them. I'm just one dwarf. I spend most of my time judging disputes. Company leaders squabbling over who owns how much of some mine or factory; workers trying to get better treatment out of the companies... I let the workers unionise, and now the company leaders hate me. The Consortium is meant to advise me but I have to second-guess everything they say. Those are just the domestic problems. I'm also trying to negotiate a permanent peace treaty with the local trolls, over the objections of half the Black Guard officers who think a war would be good for their careers. Not to mention that Guthix is apparently dead and the actual GODS are back in Gielinor. Most dwarves can pretend it's not happening, but a head of state doesn't have that luxury. Gah! Listen to me! I don't like what I'm turning into, Player.",
    "Oh, don't give me that. Do you know how many of the old kings of Keldagrim were the first-born sons of their predecessors? Maybe half. At first, the 'rightful' king was whichever warlord held onto the throne long enough to put his son on it after him. Later it was whichever nobleman murdered everyone above him in the line of succession. Our worst kings have been spoiled children who inherited the kingdom then taxed it to starvation in order to decorate their palaces. That's what Hreidmar would be like, and that's why Meike put me on the throne - to protect the kingdom from him and his like.",
    "Back when I was Keldagrim Black Guard Commander, I'd rant about the Consortium for not allocating me enough resources. Now I'm the one having to turn down Lieutenant Brae's requests for more funding. I have to make every decision myself because I can't trust my advisors. Dwarves - civilians - are going to die because of decisions I make, and eventually there'll be so many dead that I'll stop caring, and then who will I be? Being king will turn me into either a tyrant, or a puppet for the Consortium. The transformation is inevitable.",
    "I can't focus on the other problems until I've dealt with the real threat - the Red Axe! I haven't heard anything from them since we foiled Hreidmar's last plot. Whatever they're doing, they're being secretive about it. This time I'm not going to wait for them to strike! I'm the King of Keldagrim, with the entire Black Guard under my command, and a new alliance with the trolls. I'm going to attack their base before they have time to move! I'm not ready quite yet, though. If you want to help, you should go and train your skills, to make sure you're prepared when the time comes."
  ],
  "Player's chosen director": [
    "Handing over power to the monarchy was the worst day of my life. At least King Veldaban has kept the Consortium around as an advisory body."
  ],
  "Sparkly Crystal": [
    "Haha! Spark'y crystal!"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:King_of_the_Dwarves?oldid=36230589’"
  ]
}