{
  "Sir Cadian": [
    "Agh... it hurts. We were attacked by demons down in Senntisten. Please, can you help me?",
    "There may not be much time. Please, whatever you are busy with, get back here as soon as you are able.",
    "Thank you.",
    "I didn't see much, as it all happened so fast. I was cleaning up with my patrol inside the city, when we were ambushed by demons.",
    "I know a demon when I see one. Winged, red, grotesque. Demons, clear as day.",
    "Yeah, those're the ones.",
    "No. The only demons during the war were those three generals. These were new.",
    "Anyway, we were just packing up. It was so sudden. I blinked, and we were surrounded.",
    "Before I knew it, they started killing my comrades.",
    "In the middle of the slaughter something else hit us from the other side. It tore through my men without hesitation but then it went after the demons.",
    "I've never seen anything like it before. It went after those demons like nothing I've seen in my long years of service.",
    "I'm not quite sure how I managed to crawl out, but somehow I did. Thank Saradomin.",
    "Whatever that thing was, it was more dangerous than the demons. A lot more.",
    "Do you have any idea what it was? We can't just leave it to attack all of the patrols around Senntisten.",
    "It was humanoid, but large. Larger than a man, and gangly. And it moved so strangely, like a... a dancer?",
    "It was dark. Maybe brown or maybe... yellow-ish?",
    "Be careful, there could still be some demons lurking about.",
    "I'll make my way back to Falador when I can.",
    "I should be okay. Did you manage to find the creature?",
    "I should be okay. Did you manage to find the creature?"
  ],
  "Player": [
    "Here, keep the pressure applied on the larger wounds.",
    "Can you tell me what happened here?",
    "Demons? Are you sure?",
    "Those sound like avernic demons. Zamorakian.",
    "Left over from the war? Like you?",
    "What was it?",
    "That sounds... horrifying. I'm sorry you had to experience that.",
    "But go on.",
    "Can you give me a description?",
    "Interesting. What colour was it?",
    "That's useful to know, thanks. I'll have a look around the city to see if there's anything else that could help.",
    "How are you holding up?",
    "Not yet I'm afraid. I'll keep looking.",
    "They stood no chance.",
    "I should definitely not touch that.",
    "Perhaps from a fireball?",
    "Looks fresh. I should follow this, it might lead to whatever was behind this attack.",
    "Oh no - Naressa's house? I hope she's okay.",
    "Now is not the time for that.",
    "Can I get past?",
    "But I'll make sure to wear my spiked boots...",
    "Can I get past?",
    "But I'll make sure to wear my gas mask...",
    "Can I get past?",
    "You'll get used to it soon enough.",
    "What are you going to do with all the bodies?",
    "Maybe another time. I'm in the middle of an important quest right now.",
    "Gregorovic? What are you doing here?",
    "Er... Sorry, who is your guest?",
    "...Hello? Uh, Naressa, you're still here?",
    "And who is your uh... houseguest we have here?",
    "Naressa, he's dangerous. Back away slowly.",
    "His name is Gregorovic. He's a monster.",
    "Yes. He was Sliske's general at the Heart of Gielinor. We haven't seen him for a while.",
    "Look out!",
    "Mean what?",
    "What are you talking about?",
    "He doesn't seem to know that?",
    "That makes sense, I suppose.",
    "There's a slight possibility that Gregorovic - sorry, Erasinus - is a demon that thinks it's a person.",
    "In the Fourth Age, a dying human made a deal with a Mahjarrat called Sliske to save his own life.",
    "He was a nasty piece of work alive, but once he was reborn into this unsettling jester form he became a true monster.",
    "I think everyone just assumed he was a wight, since those were Sliske's thing.",
    "Now I'm not so sure.",
    "A while ago I met a demon, Senecianus, who seemed to be trapped in the form of a little girl.",
    "It turned out he'd eaten her and somehow assumed her identity.",
    "I think the same thing might have happened to Greg.",
    "Sliske must have fed you Gregorovic. His identity subsumed yours. Sliske never told you.",
    "I can only imagine. You've been Sliske's puppet for a thousand years.",
    "Well, there's a question of would it even matter if you were?",
    "Regardless, I think this must be pretty rare. I've killed the odd Abyssal in my time and none of them thought they were a person.",
    "So chances are, you're you, and I'm me.",
    "When I cured Senecianus, the other identity receded. Maybe if we cure Erasinus, we can destroy Gregorovic.",
    "Oh, I've been there.",
    "Can Greg be trusted?",
    "You are not to harm anyone. Anyone! Do you understand?",
    "For now.",
    "How are you holding up?",
    "Uhh.... it's complicated.",
    "I don't have any reason to interact with this right now.",
    "Hmm, what about picking the lock? I don't have any lockpicks on me, but maybe your claws could work?",
    "Hmm, I've got this lockpick here... but it looks too small for that lock. Maybe your claws could work instead?",
    "There must be a key around here somewhere.",
    "What should I be doing here again?",
    "Nothing.",
    "Okay, I'll go and have a look.",
    "I found this chain of keys.",
    "Only one small problem... There are way too many keys on here. We'll be here all day trying them one by one.",
    "I'll have a further look.",
    "I found this...less-than-straightforward set of instructions, describing different types of keys.",
    "I'll keep looking.",
    "I found this chain of keys, and some instructions describing what each key is used for.",
    "How are you?",
    "I can imagine. What became of the rest of the Nodon?",
    "I'm sorry.",
    "Ah. I'm familiar.",
    "Tell me more about the history with you and Erasinus.",
    "So, Erasinus was helping clean up too?",
    "What a strangely wholesome story.",
    "Goodbye.",
    "'Change Your Soul, Change Your Life'",
    "'Everything You Need to Know about Exorcisms'",
    "'One Flew Over the Evil Chicken's Nest'",
    "'The Little Book of Demon Psychology'",
    "This isn't very useful.",
    "Hmm... A jar of pickled rats?",
    "Hmm... A prisoner uniform?",
    "Hmm... A Zamorak bobblehead?",
    "This isn't very useful.",
    "Hmm... A guard uniform?",
    "Hmm... A love letter addressed to Nabor?",
    "Hmm... An assortment of pens?",
    "This isn't very useful.",
    "Hmm... A heart-shaped pictured of Zaros?",
    "Hmm... A pair of handcuffs?",
    "Hmm... A pipe?",
    "This isn't very useful.",
    "Hmm... A 10-litre bottle of blood?",
    "Hmm... A Chthonian demon plushie?",
    "Hmm... Hundreds of maggots?",
    "This isn't very useful.",
    "Was that a clunk I heard upstairs?",
    "ARGH",
    "Hm. Doesn't sound like that did anything.",
    "Found the keys!",
    "I need one space in my backpack, though.",
    "A pile of notes? Some of these could be useful.",
    "I need one space in my backpack, though.",
    "Hmm. None of these other notes seem to be of use.",
    "I should look around for something to unlock this.",
    "Well, I found the keys! But there's so many that I'm not sure which one to use.",
    "Well, I know which key to use thanks to these notes! One small problem though... I don't have the keys.",
    "Great! Looks like I have everything I need to open the gate.",
    "Now to just figure out which key to use...",
    "Great, that's the gate open!",
    "This isn't useful to me right now.",
    "I should probably talk to Naressa before wandering around.",
    "Abyssal demons? What are they doing here? No matter, we'll just try to stay out of their way.",
    "And Greg, just stay back here. We don't need another demon massacre today.",
    "Keep it down.",
    "No. I think you've had more than enough to eat today.",
    "Now.... Just to avoid the Abyssals. They'll have me for lunch if I'm seen.",
    "Uhh.... Health and Safety inspections? They're long overdue.",
    "Drat.",
    "Er... where to begin...",
    "I could ask you the same question.",
    "What are you talking about?",
    "What?",
    "I'm familiar with his work. I cured a demon of this condition once before.",
    "While we're here, demons have been attacking human patrols in the streets. Did you have anything to do with that?",
    "These were winged demons. Avernic.",
    "You seem distressed.",
    "I'm sorry. I can't pretend to know what the curse was like, but they must have been desperate. And being in those bodies for all this time would have only soured them more.",
    "What they did was horrific. I can't pretend to know what the curse was like, but there must have been humane solutions. Solutions that did not involve invading the body of another.",
    "I'm working on it.",
    "I'm going, I'm going.",
    "Hmm, I have the physical medicine here, but there must be more to it. Perhaps I should keep looking.",
    "Hi... Greg?",
    "Uh... how is it going?",
    "Thank you for this enlightening conversation.",
    "What should I be doing?",
    "I haven't found anything.",
    "I found this book. It has lots of information on the disorder.",
    "I found Senecianus in the asylum - it turns out I didn't cure him properly in the first place.",
    "He did give me this break curse scroll, though.",
    "I found a journal, from the Mahjarrat Nabor.",
    "I found some testing notes, from potion experiments.",
    "I found a bunch of testing notes, from potion experiments.",
    "I, uh... have this tube of blood... For a good cause...",
    "That seems to be everything.",
    "I created the medicine.",
    "I created the medicine, and found the Break Curse scroll.",
    "How are you?",
    "I can imagine. What became of the rest of the Nodon?",
    "I'm sorry.",
    "Ah. I'm familiar.",
    "Tell me more about the history with you and Erasinus.",
    "So, Erasinus was helping clean up too?",
    "What a strangely wholesome story.",
    "Goodbye.",
    "Hmm, I have the physical medicine here, but there must be more to it. Perhaps I should keep looking.",
    "Thanks, I made it myself. Ashes, blood, and stagnant water - can't get a better range of flavours than that.",
    "I need some blood.",
    "Me too. Can I have some?",
    "I already have some Chthonian blood.",
    "I need to take some of your blood. It's for the cure.",
    "That's a no from me.",
    "Stinky.",
    "I don't want to fill anything from here.",
    "I don't have enough space in my backpack.",
    "It feels wrong to rummage through his body a second time.",
    "I don't have enough space in my backpack.",
    "There's nothing else here.",
    "Hmm...",
    "There's nothing else here.",
    "I don't have enough space in my backpack.",
    "Nope. Even if there was something interesting here, I'm not going through that again.",
    "Why? Oh why? Let's get this over with...",
    "Nope. Even if there was something interesting here, I'm not going through that again.",
    "I'm not touching that. There's hopefully nothing in there.",
    "I don't have enough space in my backpack.",
    "Nothing else useful here.",
    "Anything useful here?",
    "Nothing else useful here.",
    "I wouldn't want to be operated on here.",
    "I don't have enough space in my backpack.",
    "The plate is empty.",
    "Yum?",
    "The plate is empty.",
    "I don't have enough space in my backpack.",
    "I can't see anything else on here.",
    "Best be careful here...",
    "I can't see anything else on here.",
    "I don't have enough space in my backpack.",
    "I already have a copy, I don't need another.",
    "All of the drawers are empty.",
    "I don't have enough space in my backpack.",
    "I don't have enough space in my backpack.",
    "I don't have enough space in my backpack.",
    "There's nothing else in here.",
    "Let's just open this up...",
    "There's nothing else in here.",
    "This crate is empty.",
    "I don't have enough space in my backpack.",
    "Phase 1? There must be more notes on the further phases nearby.",
    "There's nothing else of interest here.",
    "I don't have enough space in my backpack.",
    "There's nothing else in here.",
    "What's this?",
    "There's nothing else in here.",
    "Hmm... Lots of body parts. None of which I need.",
    "I don't have enough space in my backpack.",
    "Let's leave the rest of the jars alone.",
    "Lovely. What's in here, then?",
    "Lets leave the rest of the jars alone.",
    "A bunch of rusted tools. Nothing that I can use.",
    "I don't have enough space in my backpack.",
    "There's nothing else here.",
    "Hmm, let's have a look...",
    "There's nothing else here.",
    "There's barely any dosage left in these. Let's have a look at their labels...",
    "I don't have enough space in my backpack.",
    "Phase 2? There must be more notes on the first phase nearby.",
    "There's nothing else of interest here.",
    "I don't want blood from here, who knows where it's from?",
    "Have you seen anything useful in the asylum?",
    "Hmm, they might be useful. Thanks.",
    "Hello.",
    "Hello?",
    "I'll, uh, keep an eye out.",
    "Hi there. Have you found anything?",
    "Have you found anything useful in the asylum?",
    "Lovely, thank you.",
    "I'm helping to look for the cure. Have you found anything?",
    "Can you help me? I'm also looking for the cure.",
    "Could you please move so I can search the bottles behind you?",
    "There there, who's a good... demon?",
    "Good... demon...",
    "AHH!",
    "...",
    "You could never, Eek.",
    "This wasn't the right mixture.",
    "This is it! The cure!",
    "What is she doing here?",
    "Hey! Stop!",
    "There she is again!",
    "Rowena!",
    "Where is she going?",
    "She seems to be going into that little room...",
    "Rowena? Senecianus?",
    "Yes, but which you?",
    "Why do you look like Rowena again?",
    "What are you doing down here?",
    "Of course. Hard to forget coming face-to-face with your true...beautiful...blobular self.",
    "That's not good. But then how are we able to talk?",
    "Is that why you're here? Looking for another cure?",
    "The other demons? Have you not spoken to them?",
    "Of course. They're here for the same reason you are.",
    "It sounds like it's a problem for them in the Abyss.",
    "Actually, also here for the same reason. We found someone called Erasinus, same condition.",
    "Thanks. The spell won't cure you permanently?",
    "Thanks. I already put together a potion that cures the physiological effects. I'm going to head back to the other demons now.",
    "I lost the Break Curse scroll.",
    "Will do.",
    "Not yet. I'll keep looking.",
    "This is barely legible. Senecianus really has awful handwriting.",
    "Hmm... I'll come back later.",
    "Hello.",
    "I've pieced together Nabor's research. I think I have a cure.",
    "We'll test it on Gregorovic and Senecianus.",
    "This is for the best, Greg. You need to find peace.",
    "Die, you monster.",
    "Here we go...",
    "Now to just...",
    "It worked!",
    "Are you both okay?",
    "Here's a sample of the cure. You should be able to create more.",
    "You mentioned you knew something about the demons in Senntisten?",
    "Uh-oh.",
    "Pretty bad. How many demons?",
    "Are they-",
    "Well... that's not what I expected. I need to report this to... someone.",
    "If Zamorak is planning some sort of invasion... demons aren't very good at minimising casualties.",
    "Yes, I'd better inform Saradomin.",
    "He deserves to know the fate of his knights at least.",
    "Before you go... do you remember being Gregorovic?",
    "Do you remember... me? The way he responded to me?",
    "He thought I was someone else.",
    "Why? The goddess Seren told me they weren't Sliske.",
    "Could I have the same disorder?",
    "Not exactly.",
    "Yes. There was this whole thing with Guthix and an Elder Artefact... and Sliske.",
    "Maybe I'll pop over too when I've sorted out this Zamorak problem.",
    "This isn't useful to me right now.",
    "I'd rather not speak to them right now.",
    "I'll come back later.",
    "I've been exploring the ruins of Senntisten.",
    "Zamorakian demons have been seen down there attacking your knights.",
    "A group of Abyssal demons told me that Zamorak has been moving his forces off Infernus, probably to Gielinor.",
    "An archaeological site? You mean the Star Lodge?",
    "It leads to the Infernal Source, an ancient demon summoning site in the Wilderness.",
    "You know me, I love an adventure.",
    "What should I be doing again?",
    "I should talk to the White Knights first, to prepare for whatever is down there.",
    "Have you seen anything out of the ordinary happening in the Star Cellar recently?",
    "You really haven't seen or heard anything?",
    "Likely story...",
    "Have you heard anything suspicious lately?",
    "Uh, you know... Demons, Zamorakians, and such.",
    "Interesting. Thanks for your time.",
    "Have you seen anything suspicious lately?",
    "Sheesh.",
    "Hi there. Have you seen anything suspicious around the dig site recently?",
    "I see. Thank you.",
    "Good day.",
    "Hello. Have you seen anything out of the ordinary near the dig site?",
    "Are biscuits...not ordinary around here?",
    "Right. This might be useful. Thank you.",
    "Hello. Saradomin sent me here to investigate some suspicious sightings reported by your troops.",
    "How was it ominous?",
    "I'll have a word with them. Thanks.",
    "I'm still investigating.",
    "Hello. Have you come across anything unusual around the dig site recently?",
    "That's helpful information, thanks.",
    "Are you okay?",
    "Ah, the cult? I'm here to join them too - go Zamorak!",
    "You know, you can always go back home if you don't want to do this.",
    "I'm sure they're welcoming to anyone willing to join, regardless of how well you can recall their cultural practices.",
    "Don't be so hard on yourself. I barely know the first thing about Zamorakian culture.",
    "If you insist...",
    "Growth through chaos.",
    "Movario.",
    "Francis Dashwood.",
    "Philippa Wharton.",
    "Zamorak.",
    "Dagon.",
    "Something like that.",
    "Safe travels!",
    "Mephisto.",
    "Growth through structure.",
    "Growth through cooperation.",
    "Uhh... I'm only Player, the biggest Zamorak supporter around. Haven't you heard of me?",
    "Fine. There must be some around here somewhere...",
    "I lost them.",
    "Er, greetings, fellow child of Zamorak.",
    "I am uh... excited to be here! You can call me Player.",
    "I lost them.",
    "I don't need to steal anything else right now.",
    "One ritual was more than enough.",
    "Psst.",
    "I'm Player. I can help you get out of here.",
    "Keep this on the down low, but I'm not actually in the cult.",
    "And, well, no one deserves to be handcuffed and tortured.",
    "I'll distract the guard and-",
    "I can find you some robes. Just hang in there.",
    "I happen to have some spare with me!",
    "Not yet.",
    "Here they are!",
    "They might not be the perfect fit, but this was the only size I could find.",
    "It's really nothing. Stay safe.",
    "Yeah... It's probably best if I don't touch that.",
    "There's no way I can get past it to access the Source. It's blocked off from top to bottom.",
    "And.... open sesame!",
    "I'll just grab this one... And this one... One size fits all, right?",
    "Best not be greedy, I've already taken some spare robes.",
    "I think I've found out all there is to know here. Time to go and update Saradomin.",
    "I'll come back later.",
    "Zamorak has taken back control of the Infernal Source.",
    "His cultists are swarming the dungeon. He's using the power he absorbed from the Eye of Het to summon demons from Infernus.",
    "A lot. Hundreds at least.",
    "He must have been planning this all along.",
    "Yes, Zamorak must be stopped.",
    "I have no quarrel with Zamorak, but I won't let demons kill civilians.",
    "Bilrach!",
    "Can you confront Zamorak directly?",
    "Can we destroy the Infernal Source? Damage it somehow?",
    "What if we just kill the attacking demons?",
    "I can kill demons.",
    "I understand.",
    "I know what we have to do.",
    "We're going to re-establish the Edicts of Guthix.",
    "I...don't know. Can I?",
    "We'll... I'll... figure something out.",
    "If you ever left, you wouldn't be able to return.",
    "I'm not committing to anything at this stage, but I'll investigate my options.",
    "Any ideas, guys?",
    "What should I be doing again?",
    "If there's one thing this conflict has done, it's made us reassess a few things. Saradomin as much as anyone.",
    "The Guardians...",
    "So I should ask the Guardians of Guthix. The trick will be getting them all in one place at a time.",
    "But the Edicts of Guthix have been kept secret for millennia. Relatively speaking, I've been a Guardian for all of five minutes. Will they trust me?",
    "I didn't even get invited to the meeting.",
    "I...suppose I am.",
    "Thanks for everything, Adrasteia.",
    "Goodbye, Adrasteia.",
    "Um... Hello?",
    "Okay. Guardians, I am here to ask for your help.",
    "Zamorak is summoning demons which present a deadly threat to the people of this world.",
    "The only way to stop them is to remove him, but the other gods don't like their chances.",
    "If we could re-establish the Edicts of Guthix, we could banish him.",
    "First we need to find out whether it's even possible.",
    "Catalyst? What do you mean?",
    "Wait...I'd have to cast the Edicts myself?",
    "I'm...ready if you are.",
    "So we test it. Perform a trial run.",
    "Juna?",
    "I was. Well, I found them at least.",
    "We...believe we may be able to re-instate the Edicts of Guthix.",
    "So...about that. The Guardians, collectively, hold the knowledge required to cast the Edicts. But they can't do it themselves.",
    "The Guardians' task was only to hold the information on the Edicts. Only Guthix's annointed[sic] representative on Gielinor can cast the spell itself.",
    "That's the World Guardian. So...me.",
    "Hey, I won't pretend I'm not terrified at the thought. But this needs to be done, and I'm the only one who can.",
    "What's more... I've stopped the Grand Revision. I've stood on the precipice of Erebus. How about you give me a chance?",
    "We're planning a series of test rituals, to see what I can do. And I won't be alone. The other Guardians will be there - Juna, Valluta, Fiara...",
    "For the tests, I need to find an appropriate site.",
    "I was hoping you might know such a place.",
    "For finding caches of treasure left by ancient gods? For uncovering the secrets of long-dead civilizations, lost for millennia?",
    "This... I shall take great care of this. And when I am done-",
    "Oh. So...how does it work?",
    "Still... This is incredible.",
    "Yes. Thank you, Saradomin.",
    "So... You know how you said you had lots of those devices?",
    "I... Yes.",
    "What? Really?",
    "Nothing yet.",
    "Right. I'll get back to it, then.",
    "Right. Here goes...",
    "Huh. The compass is just spinning. What was it Saradomin said? I need to be on Gielinor's surface...",
    "We're looking for a location to test the Edicts of Guthix ritual.",
    "The Hall of Memories seemed a likely spot, given its concentration of divine energy. Sure enough, Saradomin's compass sent me here.",
    "I see. Thank you, Archivist.",
    "This feels like the right place.",
    "What's that wisp? It's....[sic]green?",
    "Um... Hello.",
    "I need a place to test the new Edicts of Guthix. Saradomin's compass led me here, so...",
    "Could we at least try?",
    "Let's - ah - try somewhere else, then.",
    "Easy! I'm not here to fight.",
    "I am searching for a test site for a magical ritual.",
    "I've been led here by a device given to me by Saradomin. I'm hoping that this is the place we need.",
    "So... May we test the ritual here?",
    "Thank you, Merethiel.",
    "I don't need to do anything with this right now.",
    "I've just got here. Is there no way you could have - y'know - let me know earlier?",
    "I...see. Where do I get this stuff, then?",
    "A Kinshra? You want me to walk into a Black Knight base and deal with a Zamorakian - even with everything that's happened?",
    "He's...unsettling. Y'know, the usual.",
    "Divine...",
    "Great. Thanks.",
    "...",
    "I'll...let Ocellus know.",
    "I think I've lost the crate.",
    "Oh. Thanks.",
    "We're banishing live birds? That's terrible! I've...got sort of attached to them.",
    "Isn't it just the word on the sword?",
    "Maybe I should talk to Juna.",
    "This looks nothing like me!",
    "It does... somehow... smell like me though.",
    "That didn't feel quite right.",
    "Nope, that wasn't it",
    "Hmm, let's try again",
    "W-wow...",
    "It's...hard to describe.",
    "It was definitely starting to work, though. I could feel the threshold at which it would start to work.",
    "From reaching that point...I could tell the ritual would only affect entities over a certain power level. True gods.",
    "The energies involved here... Even for this weakened ritual, they're incredible. Once they're in motion there's nothing much I can do to stop them.",
    "I will be able to start the ritual and complete the spell - that's for certain. But I won't be able to control it beyond that - only let it run its course.",
    "M-me?",
    "That's great, but I'm out here performing the ritual. How are we going to-",
    "Ocellus... What is this? How did you- Is that my hair?",
    "Wait, I-",
    "No, stop-",
    "AAAAARGH!",
    "I... I...",
    "It felt...like I was being turned inside-out. Like part of me was being...",
    "Like last time. Once the spell was cast, I couldn't control it. It went beyond... Beyond what it was meant to do.",
    "If I do this, Juna... It'll take my World Guardian powers.",
    "If that's what it takes to stop Zamorak. Of course.",
    "Also... I get the impression it's what Guthix would have wanted.",
    "Thank you, Juna. That means...something, at least.",
    "I don't need to do anything with this right now.",
    "I'll come back later.",
    "Where is Saradomin? I need to speak with him.",
    "Essentially... Yes.",
    "The Guardians were able to pass their knowledge of the Edicts on to me. I understand the ritual, and how to enact it.",
    "We enacted a scaled-down version of the ritual, and tested its results upon accordingly resonant divine objects.",
    "I... I can do it. I can cast the ritual.",
    "The ritual was designed only to work on beings with a certain concentration of divine energy. So it'll have no effect on demigods, Mahjarrat - that sort of thing.",
    "Yes. And no.",
    "The energies of the spell are staggering. My powers let me cast the spell without being destroyed, but I am not Guthix. I can't moderate the effect the way he did.",
    "I mean that I can set the spell going, but I can't control it.",
    "The Edicts I cast won't just stop gods re-entering Gielinor. They'll banish them.",
    "Sorry, but no. Once I cast the spell, my World Guardian powers go with it. It's strictly a one-time thing.",
    "Don't worry. I've got this.",
    "Oh.",
    "Yes please.",
    "Not right now.",
    "I'm here.",
    "Let me get straight to the point.",
    "I can re-establish the Edicts of Guthix.",
    "Guthix controlled the Edicts very precisely, presumably so that he could offer you a choice to leave of your own will.",
    "I don't have that control. If I go ahead with the ritual, all the gods will be banished.",
    "But once you're gone, you won't be able to return.",
    "Because it affects all of you.",
    "You do.",
    "No. The Edicts can only be re-established at the Edicts Monument, deep in the Wilderness.",
    "I will face Zamorak. Alone, if I have to.",
    "I defeated Jas. I fought Seren and lived. I survived the Great Revision itself.",
    "I am the World Guardian.",
    "I don't need to defeat him. I just need to hold him off until I can perform the ritual and banish him.",
    "Not even slightly.",
    "No more so than usual.",
    "I'll go in, probably wing it, figure it out as I go along.",
    "Oh, that's what you guys are?",
    "I was sure you were the disembodied presence of Sliske.",
    "Or I was going crazy.",
    "Could you not have told me this earlier?",
    "But why do you look like Sliske?",
    "Shouldn't you look like Guthix then?",
    "Goodbye... uh... happy voice in my head.",
    "Goodbye... uh... kinda-mean-honestly voice in my head.",
    "I have no reason to use this now.",
    "Hannibus. How have you been getting on with Naressa?",
    "It's good to see you.",
    "How are you settling in?",
    "How are you finding Orthen?",
    "Has there been any progress with the Nodon?",
    "Have you visited the Dream?",
    "I appear to have misplaced my Ring of the Abyss.",
    "Thanks!",
    "Farewell.",
    "I see you have met Naressa."
  ],
  "White Knight": [
    "I'm afraid not. Until the ice has all been shovelled up, the area is deemed unsafe for civilians.",
    "Not right now. Civilians aren't allowed through until the noxious gases have been fully filtered out of the air.",
    "Sorry, no can do. Strict orders to keep civilians out of this area until the Nodon cannons have been safely dismantled and removed.",
    "*cough* The air down here is so stuffy. The least the Commander could do is provide us with gas masks.",
    "I sure hope so.",
    "All these poor souls that perished down here.",
    "We're transporting them back to major cities, where we can begin identification. After that, they may finally be laid to rest.",
    "Don't just stand there - grab a broom and pitch in!",
    "Hmph. Excuses.",
    "Nearly finished with this zone, then onto the next.",
    "My back... My arms...",
    "The smell of rotting corpses. You never do get used to it."
  ],
  "Naressa": [
    "-and then they have the gall to just walk right in! Not even bothering to knock, when there's a perfectly good door right in front of them.",
    "Skethzzzzz. How are you settling into your new place, by the way?",
    "Who? I think you must be mistaken, Player.",
    "This is my good friend Erasinus. He lived in Senntisten long ago.",
    "Player! So good to see you again. Now that the war is over, I thought I'd stick around for a bit to pitch in with the cleanup efforts.",
    "Ah, how rude of me. Let me introduce you to my friend, Erasinus. He lived in Senntisten long ago!",
    "Master?",
    "Are you alright, Erasinus?",
    "You're sure? I've known Erasinus for quite a while now and he could never hurt a soul.",
    "What are you talking about?",
    "Erasinus, what's wrong?",
    "I didn't say anything.",
    "Who are you talking to?",
    "What makes sense?",
    "Excuse me?",
    "I find it oddly endearing.",
    "Erasinus?",
    "Your thoughts... your actions... your entire life. How horrific.",
    "Could I be a Chthonian? Could you be a Chthonian? Could we all be Chthonians?",
    "Perhaps not. 'I think, therefore I am'.",
    "Mmh.",
    "Regardless, what a distressing consequence to be dealing with. There must be a way that we can help him.",
    "Yes the White Knights mentioned it. There's an entrance just east of the plaza outside the Cathedral.",
    "Can you meet us there?",
    "Maybe we should hurry.",
    "Let's go.",
    "Alright, don't take too long.",
    "So, only one problem. Someone's locked the entrance.",
    "I've tried bending the bars, but they're strong enough to keep demons in, so that's a no-go.",
    "Let's see...",
    "Nothing, not even a budge.",
    "In the meantime, we'll keep looking for another way in.",
    "How's it going, Player?",
    "What have you found so far?",
    "In that case, you should start by looking around this building. There must be something useful hidden somewhere.",
    "Perfect. What are you waiting for? Go and open the gate!",
    "Hm. Maybe someone left instructions nearby?",
    "Intriguing. There must be some keys nearby, then.",
    "That's everything we need! Now just open the gate with the correct key.",
    "Quite alright. It has been much more peaceful not having cannons shooting outside my house every day.",
    "Ah, you don't know? They are sleeping back in their pods in Orthen, for now.",
    "I couldn't figure out how to free them from Kerapac's dreamscape.",
    "Don't take that to mean I've given up, Player. I fully intend to free them from their stasis. I just need more time.",
    "I plan to move to Orthen, when the time is right. While helping the Nodon back to their pods, I was introduced to some intriguing characters.",
    "Vicendithas and Hannibus, they're called.",
    "Vicendithas seems wonderfully intelligent. As for Hannibus, well, let's just say I've met more captivating people on the body carts in Senntisten.",
    "He does, however, have experience with my kin's dreamscape technology. I'm hopeful that the pair could assist me in awakening them.",
    "After the war ended, troops were sent in to help clean things up. Considering this has been my home for a while, it was only fair that I help chip in.",
    "There was definitely some hesitation at first, but word spread that I was unlike my brothers and sisters.",
    "I bumped into Erasinus one day over in the graveyard, while I was pulling out dead roots.",
    "Not that I can blame the humans, but it was so refreshing to meet someone who didn't have any sense of wariness around me.",
    "Of course! We became cleaning buddies very quickly - both always opting for the graveyard. It has always had such an eerily calming atmosphere.",
    "Let me know if you find anything.",
    "Nice job. We'll meet you down there.",
    "Another problem. Looks like these strange creatures are roaming the area.",
    "I suppose that's the best way to go about this.",
    "See what you can learn without being spotted. Erasinus and I will follow when the path is clear.",
    "What are you waiting for? See if you can find anything in the area. Watch out for the Abyssals, though.",
    "Dahaka...?",
    "Yakla? Yakla!",
    "By the Roakin! Yakla? What have you done to yourself?",
    "These are dragonkin. Aughra dragonkin!",
    "In stolen bodies. You returned to the Abyss? Have you been there all this time?",
    "Wasn't he buried with Varanus?",
    "He has two different personalities. Player says he's this monstrous creature, but he's always been very gentle around me.",
    "I just... Can't believe they would do something so barbaric. My own kind. These were dragonkin I thought I knew.",
    "I knew about the experiments they were doing but I thought it was just curiosity. To steal the bodies of other beings.",
    "You might be right. And as shocking as it is, I'd be lying to myself if I didn't feel slightly relieved to see more of my 'kin' alive and well.",
    "Exactly. If my kin managed to figure out a solution, then they could have done the same. There's no excuse for this atrocious act.",
    "But, we have something else to focus on right now. Let's look around and see what we can find.",
    "Hello, Player. What's going on?",
    "What have you found so far?",
    "Keep looking around the whole asylum. There must be something of use somewhere...",
    "That should be helpful, to know what it is exactly we're trying to cure.",
    "Ah, so I imagine we are working to cure him too, then. That scroll should be useful.",
    "Ah! The one the leaders mentioned. You must be able to find some useful information in there.",
    "I imagine there were multiple sets of experiments. You should find the rest of them.",
    "Great. Those should surely help!",
    "Right... Well, I trust that will help with the medicine...",
    "Great! But that can't be all there is to it - keep looking.",
    "That must be everything! You should hand it over to the leaders.",
    "Quite alright. It has been much more peaceful not having cannons shooting outside my house every day.",
    "Ah, you don't know? They are sleeping back in their pods in Orthen, for now.",
    "I couldn't figure out how to free them from Kerapac's dreamscape.",
    "Don't take that to mean I've given up, Player. I fully intend to free them from their stasis. I just need more time.",
    "I plan to move to Orthen, when the time is right. While helping the Nodon back to their pods, I was introduced to some intriguing characters.",
    "Vicendithas and Hannibus, they're called.",
    "Vicendithas seems wonderfully intelligent. As for Hannibus, well, let's just say I've met more captivating people on the body carts in Senntisten.",
    "He does, however, have experience with my kin's dreamscape technology. I'm hopeful that the pair could assist me in awakening them.",
    "After the war ended, troops were sent in to help clean things up. Considering this has been my home for a while, it was only fair that I help chip in.",
    "There was definitely some hesitation at first, but word spread that I was unlike my brothers and sisters.",
    "I bumped into Erasinus one day over in the graveyard, while I was pulling out dead roots.",
    "Not that I can blame the humans, but it was so refreshing to meet someone who didn't have any sense of wariness around me.",
    "Of course! We became cleaning buddies very quickly - both always opting for the graveyard. It has always had such an eerily calming atmosphere.",
    "I'll keep searching the area for anything that might help.",
    "Great! Looks like you've nearly made the cure.",
    "A scroll? That could be useful.",
    "That's a pretty heavy book. Should have some helpful information on the disorder.",
    "Ah, this is the journal written by the Mahjarrat the leaders mentioned! It should be useful.",
    "Good job, you've made the cure! Try giving it to the leaders.",
    "Hey! Watch what you're doing with that.",
    "I'm not sure what you expect me to say to this.",
    "Hmm... Testing notes? These should be useful.",
    "Erasinus! Welcome back. You're so... pink.",
    "Is that bad?",
    "Why?",
    "I see. Perhaps the forces of the alliance at the Cathedral could help?",
    "I need to part ways here as well. I must return to my kin and watch over them.",
    "Thank you for your company, Erasinus. Should you ever find yourself in Orthen, come and find me.",
    "Player! How lovely for you to come visit me.",
    "I'll admit, my first judgement of Hannibus may have been too harsh. He has been understandably hurting from the loss of his homeworld.",
    "Despite this, he and the ilujanka have been most friendly, welcoming me into this community with open arms.",
    "Vicendithas has also been a most captivating mind to pick at. We've butted heads a few times, mainly over his research theories, but there's been no real hostility.",
    "It's a bit more mossy and rubbly than I remember, but it still feels like home... Just without my old friends and family.",
    "And while I can always stay at the laboratory, I hope to build a house of my own - with a bit more space than I had in Senntisten!",
    "Not yet.",
    "Now that Vicendithas has finished making the Dream of Iaia, perhaps he would consider starting a new project.",
    "Yes - and what a work of wonder it is!",
    "I may have had my doubts beforehand, but now seeing what can be achieved... I have full confidence we can find the answer to free my kin.",
    "Well luckily for you, I have a replacement.",
    "However, you don't appear to have any space in your backpack.",
    "Come back and see me once you've made some room.",
    "Hope to see you around!"
  ],
  "Gregorovic": [
    "The nerve. Maybe I'll have to get you a doorbell for your birthday.",
    "Well, I just finished fixing up the stove for the housewarming party next wee-",
    "Erasinus Gaius Saturninus, at your service.",
    "...",
    "AH! Master! HELLO!",
    "Master, I have accomplished so much in your absence.",
    "The city has been purged!",
    "I couldn't help myself, this war just kept bringing meals right to my doorstep.",
    "So much blood. Delectable. I'm sad to see it's being cleaned up now.",
    "Erasinus? What a silly name!",
    "All those elves! Those poor, poor elves. But they were so tasty.",
    "Not as delicious as White Knights though!",
    "I like to swallow them whole. Feels so good in my tummy when the armour dissolves.",
    "Oops, sorry. Knight breath.",
    "Ooh, a dragonkin! I've always wanted to try one!",
    "Yes, sir.",
    "Yes, sir.",
    "By the twelve dukes!",
    "That explains everything!",
    "Before I was here, I was in the Abyss. Some Mahjarrat summoned me, and the last thing I remember, he was offering me the most delicious human.",
    "Next thing I found myself here, in the ruins of the city I used to know so well. And I've been having these blackouts...",
    "Back when I lived here there was an asylum, north-east of here.",
    "The Pontifex there was said to be experimenting with cures for sicknesses of the mind.",
    "Yes, master! I will consume everything as you demand!",
    "Yes, master...",
    "It's me again. Is he gone?",
    "I'll get this open for you, Master!",
    "Oh.",
    "Don't take too long now! My mouth is watering, and I can smell more food nearby...",
    "Down into the darkness...",
    "But all that DELICIOUSNESS. Going to WASTE.",
    "Hmph.",
    "Master, I am more than happy to eat the demons for you.",
    "I LOVE what you've done with the place!",
    "The rotting skeletons, the rusting blood, the damaged brains. It really brings everything together.",
    "I'm famous!",
    "Actually they're here for me, Cyrillus.",
    "You used to. I am Erasinus.",
    "Erasinus! We were in the Tenth Legion together.",
    "I wish I could eat Avernic! I love fried wings!",
    "Hello master!",
    "GLORIOUSLY! I've never felt more at home than in this death-infested city.",
    "That potion smells EXTREMELY inviting.",
    "What is that?",
    "I love blood.",
    "Of course, master.",
    "Tingly!",
    "Such a deep red... So succulent...If I could just have one drop...",
    "No! You want to destroy me? Master?",
    "I won't allow it!",
    "Yes, master."
  ],
  "Shadow voice": [
    "Oh dear.",
    "That's hardly the strangest thing happening here.",
    "Hey Greg!",
    "You're no fun.",
    "Wights don't eat people do they?",
    "I'm pretty sure wights don't eat people. They certainly don't swallow them whole.",
    "What if...",
    "Like that one we met before.",
    "Yep. That's it. That's the reveal.",
    "It's not like this is the first time this has happened.",
    "And the real Greg has been dead this entire time. I love it!",
    "'How is it going?' Come on, you can do better than that.",
    "That's the Gregorovic we know and love!",
    "I'm going to miss you buddy.",
    "I don't think Greg can hear us anymore.",
    "Pick the tongue tearer! The tongue tearer!",
    "Terrible plan!",
    "No chance.",
    "Never gonna work.",
    "Hey.",
    "Heeey.",
    "Remember what wingless said?",
    "Not that.",
    "After that.",
    "Bingo.",
    "Of course!",
    "Power of Erebus, isn't it? And that's us. Power of Erebus.",
    "Well, no, but I'm sure we'll figure it out.",
    "Nope!",
    "Hey, I'm all about strategy. Execution isn't my forte.",
    "Psch. Pure luck.",
    "AAARGH!",
    "What...in the name of Guthix's great verdant posterior was that?",
    "That means no more World Guardian powers. You'll be just a regular old human.",
    "He does.",
    "I'm not so sure about this...",
    "The quest's not over.",
    "The next update is going to be a boss fight against Zamorak!",
    "And what's going to happen during the fight?",
    "Actually, can we...",
    "That's better, that thing is so confining. So as I was asking...",
    "If we win, anyway. But then what happens to us?",
    "That's right. No more World Guardian powers.",
    "Because we're the manifestation of the World Guardian powers!",
    "Of course. I represent the shadow anima being conducted through the Monolith.",
    "MYSTERY!",
    "That was the whole plan with his death!",
    "Well, if we're going away, do you really want the boss fight being interrupted with dialogue?",
    "No, you don't. I thought you might like to say your goodbyes now while we still have time.",
    "...",
    "Better not to exist than to hang around with you two. I'll be glad to see the backs of both of you.",
    "Okay. Maybe a little.",
    "Goodbye.",
    "One last time.",
    "I promise.",
    "We'll let you finish the quest when you have 4 free spaces in your backpack for your rewards!"
  ],
  "Light voice": [
    "She doesn't know.",
    "It appears we have a rather large pack yak in the room.",
    "Erasinus! What a lovely name.",
    "Bad dog! Be quiet!",
    "Stay still!",
    "Hey, I thought Greg was a wight?",
    "Don't know. I'm no necromancer.",
    "You don't mean...?",
    "Oh, yes!",
    "A Chthonian demon!",
    "He ate a person! And now he thinks he is the person!",
    "How many of these things are there?",
    "You tried your best, pal.",
    "It was worth a try.",
    "Be quiet! Stand still!",
    "I'm not.",
    "Hey!",
    "To Falador!",
    "*Terrible*!",
    "*No* chance.",
    "Never.",
    "What?",
    "*What*?",
    "Hm... she said 'My body is a monument to his cruelty.'",
    "There was a lot of incredulous repetition.",
    "She...wanted to put the Edicts back.",
    "You're kidding.",
    "We can?",
    "Well, yes, but do you actually know how to do it?",
    "This was your idea!",
    "Ooh! That's remarkably insightful.",
    "AAARGH!",
    "I don't know, but I didn't like it.",
    "...drained away.",
    "Yes... If you complete this ritual, we'll be gone. Forever.",
    "Go team!",
    "QUEST COMPLETE!",
    "Where are the rewards?",
    "What?",
    "Right?",
    "We're going to re-establish the Edicts and banish him!",
    "We'll... oh.",
    "And no more us!",
    "And I'm the... regular anima from the Monument.",
    "Because when Guthix stuck all these powers in you, he needed that cheeky chappy's mastery of the Shadow Realm to do it.",
    "The light knowledge of Guthix and the dark knowledge of Sliske combined.",
    "...",
    "I guess.",
    "Anyway, why did you interrupt my quest completion?",
    "Maybe.",
    "Oh. Yes.",
    "Goodbye! I'll miss you both so much!",
    "*sniff*",
    "Aren't you going to say goodbye?",
    "No!",
    "You're not even a little bit sad?",
    "Okay, okay, can I do it?",
    "No fake outs?",
    "QUEST COMPLE-",
    "...",
    "I thought we agreed on no more fake outs?",
    "QUEST COMPLETE!"
  ],
  "Shadow and Light": [
    "He's a demon!"
  ],
  "The following text is transcluded from Transcript": [
    "Key instructions.",
    "Diagnostic Sanitarium Manual, Fifth Edition.",
    "SIPD Medication Testing, Phase 1.",
    "SIPD Medication Testing, Phase 2.",
    "Nabor's journal."
  ],
  "Abyssal savage": [
    "Hmm...",
    "Nothing here.",
    "There must be something around...",
    "Where is it?",
    "HUMAN!",
    "INTRUDER!",
    "TRESPASSER!",
    "STOP RIGHT THERE!",
    "You fool. Don't even think about trying to escape.",
    "Don't move.",
    "What do you think you're doing?",
    "This place is off-limits.",
    "You're all coming with me.",
    "Hey boss, I found this lot wandering around near the entrance.",
    "Where is it?",
    "Nothing here.",
    "There must be something around...",
    "Hmm...",
    "I think I saw a crate full of syringes in one of the rooms.",
    "Goodbye.",
    "*grumble* *grumble*",
    "*grumble* Stuck helping out in this stupid asylum. *grumble*",
    "Be careful! There's a spooky little girl haunting the asylum.",
    "No. Go and look yourself.",
    "I did see a crate of glass vials in one of the rooms.",
    "Unfortunately not.",
    "Sorry. I'm busy.",
    "Ah, the smell of death! Nothing better than that.",
    "The smell seems to be wafting in from the south.",
    "No. Go away."
  ],
  "Dahaka": [
    "How do a human, a kin, and a Chthonian come to be working together?",
    "Gregorovic!",
    "An infamous servant of the Mahjarrat Sliske.",
    "We projected ourselves into these...elemental beings. Abyssal natives.",
    "The Eldergates no longer functioned, but we were able to eke out an existence.",
    "Kalger's people - you remember Kalger?",
    "Merely his dead shell. Kalger was unsatisfied with his lot in the Abyss.",
    "He gathered followers - Yorga, Dagon, and the others - and they projected again, into the bodies of demons.",
    "The Chthonians drove them out, and so they returned to us in the abyss.",
    "When Zamorak captured Infernus, the Chthonians were exiled in turn.",
    "Some of them do. Others serve the old dukes.",
    "The corpse of Hostilius is a potent source of power.",
    "Yes, another case of Superimposed Personality Disorder. It seems we are here for the same purpose.",
    "This condition... it is spreading through the abyss. We are here seeking a cure to give us an advantage against the dukes.",
    "We have been searching here for anything of use, but we have not been here long.",
    "The master of this place, a Mahjarrat known as Nabor, saw religious significance in the healing of the sick.",
    "Aid us and you will be helping your companion.",
    "Have you found a cure?",
    "Excuse me?",
    "A dragonkin, a jester, and a human walk into an asylum-",
    "Be quiet, Cyrillus. Have you found anything, human?",
    "Good. We will return with it to the Abyss.",
    "Calm down, Yk'lagor[sic].",
    "Our fellow demon Dagon returned to us recently from long incarceration.",
    "He harbours much antipathy for Zamorak. He has been infiltrating Infernus.",
    "In recent weeks, he has reported much activity among the forces there.",
    "Zamorak is moving demons off Infernus. We did not know where to, but their presence here could suggest Gielinor is the destination.",
    "Demons are notoriously hard to keep track of, but it could be thousands.",
    "Enough. We have aided each other, and now we shall return to the Abyss."
  ],
  "Yk'Lagor": [
    "Explain yourselves!",
    "You know of this creature, Dahaka?",
    "What are you doing here? You will answer to Yk'lagor[sic]!",
    "Naressa?",
    "What we had to. Your kind went to sleep, we evaded the curse by other means.",
    "And it's 'Yk'lagor[sic]' now.",
    "We ruled Infernus! They called us Infernals!",
    "So we took our revenge, and now they serve us!",
    "Excellent! Aid us and we will refrain from destroying you!",
    "Take too long, and the deal is void.",
    "My patience is thinning!",
    "Don't. Even. Try. It.",
    "I hope you haven't returned with nothing to show.",
    "How can you be so ignorant!",
    "Some day we will reclaim it!"
  ],
  "Cyrillus": [
    "Do not waste the time of the masters!",
    "Do not question the masters!",
    "We fight for possession of the body of the Most Bloated!",
    "You never explained your presence here!",
    "Do I know you, demon?",
    "Who?",
    "Oh, Erasinus. What are you doing here?",
    "A human patrol entered the asylum and attacked us. They were dealt with. We have not left this building, however. We arrived by portal.",
    "Avernic demons? We may know something of this. Bring us the cure and we will share what we know.",
    "Bring us the cure!",
    "Human.",
    "I see you found another skulking rat.",
    "Senecianus? The 'child-eater'? In Orcus's name... is that the form of the child you ate?",
    "We fought for our world! Where were you?",
    "How do we know it will work?",
    "We may not be as friendly next time!"
  ],
  "Senecianus": [
    "Don't lose that.",
    "Ah, that is the book I was telling you about! It should have some interesting information.",
    "Ah, the writings from Nabor you were telling me about. It should have some useful information.",
    "The cure! Be careful not to drop it.",
    "What are you doing?",
    "Oh, go ahead then.",
    "It seems you already have some Chthonian blood.",
    "Be careful not to lose that!",
    "Hmm, some experiments on the cure. They could be useful?",
    "Player!",
    "It's me.",
    "Oh! It's me, Senecianus.",
    "I'm trying to avoid the others. I think they're looking for me.",
    "You remember how you cured me before?",
    "As it turns out, the cure wasn't especially permanent.",
    "The episodes come and go. I'm okay at the moment.",
    "I was, and I think I was on to something before the others arrived.",
    "Abyssals are disgusting, corpse-dwelling barbarians. Can they even speak?",
    "Really? Others have been affected in the same way?",
    "Really? And why are you here?",
    "How unlikely! Then I'll share what I have.",
    "Nabor wrote out a full description of the condition. It's over on the desk there if you want to read it. I didn't find it very helpful.",
    "This, though, is the same spell you used on me back in the mansion.",
    "It took quite a while to piece together from Nabor's research, but it should work.",
    "It appears your backpack is full. Come back when you have some space.",
    "Yes. Nabor talked about requiring a physical cure as well as a mental one.",
    "See if you can turn anything up. I'll have a look for anything else useful in these notes.",
    "Wonderful! I'll join you there.",
    "It appears your backpack is full. Come back when you have some space.",
    "This was not easy to recreate. Be more careful next time.",
    "Have you found a physical component for the cure yet?",
    "I'll come and find you near the other demons.",
    "It's me, you oaf. Senecianus.",
    "I'll not be talked down to by a corpse-dwelling barbarian!",
    "Locked up here!",
    "I'm ready too.",
    "It feels different to last time.",
    "Why?",
    "There's no way the three of us can go to Falador.",
    "The human capital. A provincial sort of place.",
    "Yes, Veilinius. Let's see if we can track him down.",
    "Thank you once more for your help, Player.",
    "Resonance. Magical resonance.",
    "No, I don't think so. You didn't devour Sliske, did you?",
    "You might want to get that seen to. Anyway, must be off!"
  ],
  "Abyssal beast": [
    "*growl*",
    "*growl*"
  ],
  "Potion 1": [
    "Success",
    "Failure"
  ],
  "Potion 2": [
    "Success",
    "Failure"
  ],
  "Potion 3": [
    "Failure",
    "Success"
  ],
  "Potion 4": [
    "Failure",
    "Success"
  ],
  "Potion 5": [
    "Failure",
    "Failure"
  ],
  "Potion 6": [
    "Success",
    "Success"
  ],
  "Potion 7": [
    "Failure",
    "Failure"
  ],
  "Potion 8": [
    "Failure",
    "Success"
  ],
  "Potion 9": [
    "Success",
    "Failure"
  ],
  "Eek the Spider": [
    "...",
    "I don't scare you like that, do I Player?",
    "Phew."
  ],
  "Erasinus": [
    "My body! I have my body back! Arms are so weird.",
    "You're taller than I remember.",
    "What's Falador?",
    "There was another of our kind, during the battle. With the Temple Knights.",
    "Yes, thank you. My mind is free for the first time in... well, an age.",
    "Unfortunately so, yes.",
    "Yes...",
    "Yes. The voices, in your head. They sound like Sliske, the one who did this to me.",
    "I'm no expert, but they have his... Senecianus, how would you describe 'affectum'?",
    "Exactly. They have his magical resonance, just as I had Gregorovic's.",
    "Anything happen to your soul?",
    "I expect that's it then. Some part of his essence got pushed into you.",
    "Must be powerful enough to reach out to his old followers."
  ],
  "Saradomin": [
    "Whom do you have for me first?",
    "That's a little condescending.",
    "Very well, show them in.",
    "You've been practicing your Icyene! Very impressive.",
    "But the honour is mine, Lumbridge. Tell me what it is you want from me.",
    "I have no time for modesty, false or otherwise, Lumbridge.",
    "You are here because you have something to say. Say it.",
    "That was nearly ten years ago.",
    "Unfortunate, yes. I could not deflect Zamorak's foul energies cleanly enough.",
    "Get to the point, Lumbridge.",
    "Is there nothing Misthalin can do for you?",
    "It is much the same in Asgarnia. What, specifically, is it that you want me to do?",
    "You blame me for the destruction at the Battle of Lumbridge?",
    "...",
    "It is I who should apologise, Lumbridge.",
    "Though it was not I that chose the site of the battle, I could have worked harder to contain the destruction.",
    "Your lands and people bore the brunt of it, and you should be compensated in turn.",
    "Adrasteia, do you recall the total amount pledged for the harvest day parades?",
    "The parades are important, but we can certainly afford to be less lavish. Have Hestia allocate half of it to the Duchy of Lumbridge.",
    "You are welcome, Lumbridge, but it seems we have another visitor.",
    "Step forward, World Guardian.",
    "I have patrols there to guard against any remaining threats. Is everything under control?",
    "Off Infernus? What could he be doing?",
    "We've seen no sign of activity here, and the ruins themselves contain nothing of value now.",
    "Still, we've seen little of Zamorak since he fled the battle against the Elder Gods.",
    "It may be a coincidence, but if Zamorak is planning something, it would be good to have advance word.",
    "I cannot command you, World Guardian, and we are still indebted to you for saving this world.",
    "But if you can spare the time to investigate, please do so. I believe the Jolly Boar Inn is a popular place with the knights - you might be able to find some there.",
    "My patrols have reported sightings of red-robed cultists outside the Star Lodge. I would be much appreciative if you could spare the time to investigate - you may be able to find some knights in the Jolly Boar Inn.",
    "...",
    "...",
    "This is ridiculous. The Polemarchos Autokrator does not-",
    "I do, I just-",
    "...",
    "Garlandia, I...",
    "I'm sorry.",
    "I can speak for myself, Adrasteia. I am prepared to make amends for my actions.",
    "I am trying, Garlandia.",
    "I am not asking for your forgiveness, only the opportunity to do what I can.",
    "Surely there must be something you want? Something I can provide you?",
    "I am Saradomin. Lord of Light. Basileus Basileon.",
    "Try me.",
    "This was a waste of time.",
    "World Guardian. You return. Step forward.",
    "What have you to report?",
    "How many?",
    "Peace, Sir Alvin. You are forgiven. What is it?",
    "A full-scale attack on Misthalin?",
    "What is it, Sir Simon?",
    "By teleporting demons?",
    "By the Schism... he is attacking us everywhere.",
    "After the losses at the Monolith...at Senntisten...",
    "My knights are at a fraction of their strength... even the militias were annihilated.",
    "Already committed! We have nothing left.",
    "The elves... the druids... the Bandosians... even the Zarosian traitors, they all suffered grievous casualties just as we did.",
    "The only forces to escape the Elder God War relatively unscathed...were Zamorak's.",
    "Perhaps, or maybe he's just an opportunistic vulture.",
    "Will you stand with me, World Guardian?",
    "Why have you crawled out of your hole, Mahjarrat?",
    "I will not abandon the people of this world to Zamorak.",
    "I don't know...",
    "I could, but at the Battle of Lumbridge our stalemate lasted weeks.",
    "Last time it was my loyal forces that tipped the balance in my favour, but this time he would have an overwhelming advantage.",
    "I am not afraid to face him, but I dread to think of the damage that his demons could wreak on my people in the meantime.",
    "Within a month, they could kill everyone on the continent.",
    "The Infernal Source itself is merely a conduit.",
    "Zamorak does not need it to open a portal to Infernus, it is simply more convenient.",
    "No, the problem is Zamorak and the power he absorbed, not the Source.",
    "We could. Armadyl would help, and Azzanadra has no love for Zamorak, but even we cannot be everywhere at once.",
    "We could hold out for a time, but Zamorak's stolen power is great, and he can simply summon more.",
    "If we do not cut the problem off at the head, we are simply delaying the inevitable.",
    "I have no doubt. But you are no god, and if these reports are to be believed...",
    "Even with Armadyl's help... I cannot confront Zamorak and save my people from destruction at the same time.",
    "What was that, World Guardian?",
    "Can you do that?",
    "Can you?",
    "After he established the Edicts, Guthix forced each of us to leave in turn.",
    "If you can re-establish them, then Armadyl and I can push Zamorak through his own portal and close it.",
    "With the flow of demons cut off, we can clean up here with a minimum of casualties.",
    "Finally Gielinor would be safe from his predations forever.",
    "Finally I can rule, uncontested, and its people will be safe. I am sure Armadyl will not defy me, and Azzanadra is weak.",
    "Being trapped here is a small price to pay to be rid of Zamorak.",
    "Hush, Garlandia. Soon the God Wars will finally be over. Soon we will have peace.",
    "Go then, World Guardian. I will defend the cities, save as many as I can.",
    "If you can do this, do it. If you cannot, we will reconvene and form another plan.",
    "Go just down the stairs and talk to Adrasteia, she may be able to help you with the Edicts.",
    "Adrasteia tells me you have sought out the Guardians of Guthix. I trust you were successful?",
    "And?",
    "I see. It has come to this, then.",
    "We have discussed our plan. The Edicts will be enacted. Then, Armadyl and I will eject Zamorak from the world. I trust we still have this accord?",
    "Go on.",
    "You?",
    "With all due respect...the Edicts must involve energies far beyond anything any mortal has ever wielded.",
    "This isn't some opportunity to show off. Do you have any idea how utterly catastrophic a misstep here could be? And not just for the gods - for the world!",
    "...",
    "Fine.",
    "Then what can I do to help?",
    "Yes... It would be necessary to find somewhere with appropriately clement magical conditions.",
    "The Crown Archival allowed me to divine the presence of Elder Artefacts. It was also useful for lesser scrying.",
    "More like the divine equivalent of losing one's keys.",
    "I have missed the convenience it once afforded me, and have since designed a simple device for performing such mundane functions.",
    "You don't seem to have any space in your backpack. Come back and talk to me when you do.",
    "Keep it. I have plenty of them.",
    "On activation, it will permanently attune itself to that which you currently seek. Keep your goal firmly in mind. Try to make sure you aren't craving a sandwich or anything.",
    "The scanner will lead you to a likely destination. If incorrect, it will recalibrate to another to another on arrival.",
    "This may take a few attempts. You must also be on Gielinor's surface. Otherwise, it will not work.",
    "Note that it is of no further use once your goal is reached, and may be discarded.",
    "And there we have it. The device is crude, but it should serve your purpose.",
    "Yes, we gods have our uses. Some of us even want the best for this world...despite everything. I ask that you remember this, as you do what must be done.",
    "Now go, and leave me with my thoughts.",
    "Thank me by stopping Zamorak. By saving Gielinor.",
    "You've lost it?",
    "You don't seem to have any space in your backpack. Come back and talk to me when you do.",
    "You know, using one of these shortens your life by 30 minutes.",
    "Well... No. Probably not.",
    "Just take more care from now on, hm? Time is very much of the essence.",
    "How goes the search?",
    "Well, don't give up. Keep following the scanner. It should take you to the right place. Eventually.",
    "No need. I am here.",
    "Armadyl, Azzanadra and I have been holding against the onslaught, but the tide is endless.",
    "What of the Edicts? Were your tests successful?",
    "And?",
    "But it will affect Zamorak? Our plan will work?",
    "Explain.",
    "The plan could still work. We gods could leave... imprison Zamorak... you could reverse the spell...",
    "NO! This will NOT come to pass! There is too much to be done, too many iniquities to-",
    "Garlandia...",
    "She is right, Adrasteia.",
    "Peace, dear one. Neither you - nor anyone else - need make excuses for me ever again.",
    "Zamorak...",
    "Zamorak revels in his own depravity and tyranny. But despite his purported forthrightness, there is one secret he holds close. One thing he would never admit.",
    "I am as responsible for his actions as he is.",
    "Zamorak feeds on rivalry - craves conflict and adversity. And what greater rival has he than I?",
    "While I hold true to my ideals, I can only fan those flames. And without my ideals I am nothing.",
    "So establish your Edicts, World Guardian. Zamorak will be cast from this world, and I with him.",
    "He wants war? So shall he have it. The firmament shall tremble with every blow we deal one another, and our battle shall echo through eternity.",
    "But this world will be safe.",
    "A grave threat indeed. But I leave this world in the most capable of hands.",
    "I didn't mean you.",
    "We must inform the other gods - in person.",
    "I will summon them to the Empyrean Citadel. Meet us there, quickly. Every moment away from the front, more of my people die.",
    "I don't know about you, but I have no taste for theatrics.",
    "This is... the World Guardian's plan. They can explain when they get here.",
    "There's a catch.",
    "I don't think so. It'll take time.",
    "Yes. On reflection, this is the only course available to us.",
    "This is bigger than me. Than all of us.",
    "Besides, if I'm going to be trapped out there with you, I'd rather not start as enemies.",
    "So what say you? Does the World Guardian have your assent?",
    "Icthlarin?",
    "Azzanadra?",
    "Zamorak has shielded the entire crater. I tested it myself.",
    "We need to get the World Guardian inside the shield.",
    "My people will find a way.",
    "We cannot. Even with the power we absorbed from the eggs the fight would be a long and gruelling one.",
    "Go then, make what preparations you can. You will be contacted when we've found a way inside the shield.",
    "I must return to my people."
  ],
  "Adrasteia": [
    "I thought maybe we should start out with an easy one.",
    "I don't mean it like that! Of course you can do this, but everyone benefits from positive reinforcement.",
    "May I present Horacio, Duke of Lumbridge.",
    "Don't worry, Lumbridge! Lady will do.",
    "Father! This is not what we talked about.",
    "It was something close to two million gold, if I recall correctly.",
    "Yes, Father.",
    "Our patrols have reported sightings of red-robed cultists at an archaeological site outside Varrock.",
    "Yes! Do you know it?",
    "I'm sorry Garlandia, I didn't think you would come otherwise.",
    "Please, Garlandia, hear what he has to say.",
    "Father?",
    "Father!",
    "You told me you wanted to make things better. You swore to me.",
    "Then do what you promised.",
    "He is pre-",
    "He could restore your wings. It is within his power.",
    "Then why do you still-",
    "No, Father, we can-",
    "What about our reserves?",
    "We have allies.",
    "What's going on?",
    "What do we do? Do we flee?",
    "So! Welcome to the de facto research centre of Asgarnia.",
    "It might lack the majesty of the Archeiakós Stolískos on Hallow, but we've pulled together quite the collection of texts on divine metaphysics. To work with first-hand sources such as these... It's exhilarating.",
    "I'm still reeling from the idea of re-establishing the Edicts. It hadn't occurred to me that such a thing might be possible. And Father... I can't imagine him ever allowing it.",
    "We shall see. But for now... Well, you of all people have earned my trust. If you say this bears investigation... I will tell you what little I know.",
    "So... Father has taught me a great deal, but magic of a high god such as Guthix... It defies mortal comprehension.",
    "No written record of the Edicts exists, of course. Their purpose was to keep the gods away from Gielinor.",
    "Only those in Guthix's closest confidence would have been privy to such information.",
    "Yes. Immortal beings, powerful and unfailingly loyal. Who better to bear the knowledge? It could even be split among them, so if one fell the whole truth was not lost.",
    "That part, at least, is fairly simple. The world's factions are all meeting to discuss their responses to this new threat.",
    "The Guardians of Guthix are no exception - we've received word that they're meeting by the Tree of Balance, south-east of Varrock.",
    "You are a mortal being imbued with divine power by Guthix himself, yes?",
    "The thing about divine energy is it can't be created or destroyed. It never really stops being part of the god it came from.",
    "Guthix may not be here, but he lives on - in you, and in each of the other Guardians.",
    "You share an immutable bond - one that, with any luck, will garner some empathy and understanding.",
    "Speak with your fellow Guardians - I'm sure they'll listen. If anyone can convinve them of this, it's you.",
    "Oh - when you get there, just speak to the Tree of Balance. It'll direct you to the meeting.",
    "I understand it's a fraught thing to say these days, Player, but for what it's worth... Saradomin's Light go with you.",
    "Hello again, Player. I hope your investigations into the Edicts are going well.",
    "They are meeting by the Tree of Balance, south-east of Varrock.",
    "Speak to the Tree and you'll be sent to the meeting.",
    "This really is uncharted territory. No being currently on Gielinor has ever wrought magic on this scale.",
    "That includes Father. What must he be thinking? To consider a world without gods...",
    "If anyone would know, it would be the Guardians. The future lies in their - in your - hands.",
    "Farewell.",
    "World Guardian - you're back!",
    "He's out leading the defence against the demons. I'll send word to him.",
    "I trust you tested it rigorously. What were your findings?",
    "What do you mean?",
    "Wh-what?",
    "Father...",
    "SHUT UP!",
    "I have tried everything to broker productive discourse between you and my father. We have offered every concession and you have thrown them in our faces.",
    "Of course - nothing will ever forgive the suffering you have endured! But you nurse your bitterness and hatred with such miserable, self-centred-",
    "But-",
    "What are you saying?",
    "That is ridiculous, Father!",
    "I... I can't...",
    "Please, Player... Do not delay. Meet my father and the other gods at the Citadel as soon as you can.",
    "World Guardian. Do you need a teleport to the Empyrean Citadel?"
  ],
  "Duke Horacio": [
    "It is an honour, kyrios mou hagie.",
    "I am not sure it is entirely proper, sire...",
    "Well, sire, it's about the Battle of Lumbridge.",
    "Indeed, sire, but the effects are still being felt.",
    "As you know, though our forces were victorious, the lands around the site were devastated.",
    "We rebuilt as best we could. Freelancers did most of the work, but the bill was still high.",
    "The cost of the lamps alone...",
    "The duchy is deeply in debt, sire, and has remained so these ten years. Crops are failing, and we cannot afford to buy food elsewhere with the current markup.",
    "Times are hard throughout the kingdom, sire. The famine, you know, and the loss of so many young folk to the recent tribulations...",
    "Well sire, when... I am sorry, my lady, I do not know the correct form of address.",
    "When Lady Adrasteia spoke of making amends, I though...",
    "Sincerest apologies, sire, I meant no-",
    "Thank you, sire! A thousand thank-yous!"
  ],
  "Movario": [
    "Can I help you with something, Player?",
    "Of course not. The cellar has been abandoned for many ages.",
    "Nothing other than rats scurrying around."
  ],
  "Bartender": [
    "Hmm. What kind of suspicious? I see all sorts in this line of work.",
    "Now that you mention it, I might have heard something.",
    "Just the other day I was serving two Olde Suspiciouses to some young nomads. Didn't think anything of it at first.",
    "But when I went to collect their empty glasses, I overheard them talking in hushed tones about some Zamorakian gathering nearby.",
    "No problem."
  ],
  "Cook": [
    "I don't see anything in this room except rats and ingredients. Now get out of my kitchen."
  ],
  "Sir Berus": [
    "Indeed. A fellow knight and myself were investigating some odd chanting sounds coming from the entrance.",
    "It was quite dark at that point, but we could just make out some robed figures descending into the entrance.",
    "Good day."
  ],
  "Sir Cull": [
    "Quite possibly. The other day I noticed a rat gnawing on something near the entrance, so I went to check out what it was.",
    "It appeared to be a freshly baked biscuit.",
    "Well, it's not that it was a biscuit, but the design of the biscuit - it was in the shape of a Zamorak symbol, complete with red icing.",
    "I wish we brought biscuits to work."
  ],
  "Sir Dated": [
    "Good day.",
    "Ah. You must be the World Guardian, then.",
    "We were finishing up our routine patrol with a pint from the Jolly Boar here, when some of us heard some ominous chanting sounds coming from the Archaeology site entrance.",
    "Low-pitched, repetitive. And far too coherent to be from the pub customers.",
    "A couple of knights went outside to have a look. Maybe they can give you some more insight.",
    "World Guardian. Have you looked into the chanting sounds yet?"
  ],
  "Sir Plus": [
    "Yes - myself and another knight were looking for the source of some strange chanting coming from the entrance.",
    "We couldn't see much, but it looked like the chanting was coming from some red-clothed figures.",
    "I do love an Olde Suspiciouse."
  ],
  "Blythe": [
    "The exit is just over there... I could always come back later...",
    "I travelled all the way from Ardougne to join...erm...my old crocheting buddies here. But now that I'm here, my stomach is in all sorts of knots.",
    "Yes, the cult! It's a relief to meet another person looking to join up.",
    "It's not that I don't want to join - it's that I'm not sure I have what it takes.",
    "Members of this cult are truly the best of the best. And as much as I try to learn everything I can about Zamorakian culture, a lot of the time the information just doesn't stick.",
    "You're just saying that - I bet you're much more worthy of joining than I am...",
    "Prove it - I'll test you.",
    "Correct! Onto the next question.",
    "Hmm, not quite.",
    "Close, but not quite.",
    "That's it! Onto the last question.",
    "I can see why you'd think that, but no.",
    "Correct again!",
    "I knew it. You're a much more loyal Zamorakian than I am...",
    "These robes are much better off in your possession. Here, take them.",
    "Oh, you don't have enough space in your backpack. Come back when you do.",
    "I think I'll head back home. Clearly I have a lot more studying ahead of me.",
    "Interesting take, but no.",
    "Even I know that's not right!",
    "Definitely not."
  ],
  "Vala": [
    "Who are you?",
    "I have not. We operate a strict dress code here - no robes, no entry.",
    "Those are some nice robes you are wearing, but unfortunately we changed our clothing supplier last week. You'll need to be wearing our new robes.",
    "I can give you some of our spares, but you'll need more space in your pockets first.",
    "Here. Don't lose them again, please.",
    "Welcome, child of Zamorak.",
    "Please, be received in our holy sanctum.",
    "It is an honour to welcome another of faith into our congregation. I am Vala.",
    "Player? That will not do. All members of the Order of Dis require a holy name, hand-picked by Him. You shall go by [Cultist name].",
    "Now, [Cultist name], do make yourself at home. Our brothers and sisters will be more than pleased to teach you our ways.",
    "Farewell!",
    "[Cultist name]. You still need to be wearing our robes to be allowed in.",
    "I can give you some of our spares, but you'll need more space in your pockets first.",
    "Here. Don't lose them again, please.",
    "[Cultist name]! My eyes and ears have reported that you're not wearing our robes! Come back once you respect the dress code.",
    "Go and speak to our brothers and sisters. They will be more than pleased to teach you our ways."
  ],
  "[Cultist name]": [
    "[Cultist name] it is then.",
    "Lovely. Thank you, Vala.",
    "Yes, I just joined!",
    "Wow. That gave me tingles.",
    "A bit of this, a bit of that.",
    "Hello. Anything interesting going on here?",
    "I guess they've taken a vow of silence.",
    "Hi there, I was just wondering what's going on here?",
    "Ah, maybe later. Have fun...",
    "Hi there. I'm new here.",
    "What's the reason for the recent influx?",
    "Sounds like I joined at just the right time.",
    "[Cultist name].",
    "Hello, I'm new here. Is there anything I should know?",
    "No need to be rude.",
    "May Zamorak be with you.",
    "Hello! I'm new here and thought I'd introduce myself to everyone. What's your na-",
    "Oh. I'll leave you to your rest.",
    "Hi there, I'm [Cultist name]! How long have you been in the cult for?",
    "Nope, sorry. You must have the wrong person.",
    "Greetings. I don't suppose you've got any juicy gossip?",
    "Never mind then.",
    "Hey, uh... I don't suppose you know what that huge energy barrier over there is for?",
    "Why is the Source blocked off?",
    "What holy work is that?",
    "What's going on here?",
    "Domine fortis domine brassicae",
    "Domine fortis chaos",
    "Nunc manducamus vermis foraminis",
    "In sanguine et in morte",
    "Piscrisesca hoo ha ha",
    "Tantum iocari, salve saradomin",
    "Honoramus tibi hoc sacrificium",
    "Oh no.",
    "Daemones tam bellus",
    "Klaatu barada nikto",
    "Good day. Is there anything that I should know?",
    "Er, I think you may have the wrong person?",
    "Sorry.",
    "I was er... sent here by Vala to try and convert him."
  ],
  "Wilona": [
    "Children of Zamorak welcome you...",
    "Embrace the chaos...",
    "False believers begone...",
    "Holy Zamorak...",
    "We see the light...",
    "Everyone welcome [Cultist name] to the circle.",
    "Let us begin. Repeat after me.",
    "Domine fortis chaos",
    "That is not what I said. Please, follow along correctly.",
    "Domine fortis chaos",
    "Domine fortis chaos",
    "In sanguine et in morte",
    "That is not what I said. Please, follow along correctly.",
    "In sanguine et in morte",
    "In sanguine et in morte",
    "Honoramus tibi hoc sacrificium",
    "That is not what I said. Please, follow along correctly.",
    "That is not what I said. Please, follow along correctly.",
    "Honoramus tibi hoc sacrificium",
    "Honoramus tibi hoc sacrificium",
    "With the power of this ritual, we have lent our aid to the mighty army of demons that our Lord is bringing to Gielinor.",
    "Zamorak be with you all.",
    "That is not what I said. Please, follow along correctly.",
    "That is not what I said. Please, follow along correctly."
  ],
  "Bancroft": [
    "Children of Zamorak welcome you...",
    "Embrace the chaos...",
    "False believers begone...",
    "Holy Zamorak...",
    "We see the light...",
    "Welcome, [Cultist name].",
    "Domine fortis chaos",
    "In sanguine et in morte",
    "Honoramus tibi hoc sacrificium"
  ],
  "Gleda": [
    "Children of Zamorak welcome you...",
    "Embrace the chaos...",
    "False believers begone...",
    "Holy Zamorak...",
    "We see the light...",
    "Welcome, [Cultist name].",
    "Domine fortis chaos",
    "In sanguine et in morte",
    "Honoramus tibi hoc sacrificium"
  ],
  "Trudy": [
    "Children of Zamorak welcome you...",
    "Embrace the chaos...",
    "False believers begone...",
    "Holy Zamorak...",
    "We see the light...",
    "Welcome, [Cultist name].",
    "Domine fortis chaos",
    "In sanguine et in morte",
    "Honoramus tibi hoc sacrificium"
  ],
  "Audrey": [
    "A new face! I haven't seen you around before.",
    "Perfect! You can be the first to hear my talk on the history of the Order.",
    "Back in the day, we were established by Duchess Phillipa[sic]. The Duchess was a loyal supporter of Zamorak from the start, and stands as someone we should all aspire to be.",
    "The 'Order of Dis', she so named us. While we were... dormant for a long time, recent events have prompted a rejuvenation.",
    "Our modern-day purpose hasn't deviated much from the original - spread to word and grow the following of our lord.",
    "Thank you, I've been practicing!",
    "[Cultist name]! I hope everyone has been welcoming so far.",
    "Ah, yes, we do have a few... outcasts in the group. Now if you don't mind, I'm going to get back to practicing my talk."
  ],
  "Claiborne": [
    "..."
  ],
  "Darrel": [
    "At the moment, I'm busy drawing up torture plans for our next prisoner.",
    "It's a toss up between the iron chair, the rack, or the tongue tearer.",
    "Want to help?"
  ],
  "Edda": [
    "Another member - you come in droves now!",
    "Our Lord is at his peak. He recently absorbed the power of an ancient Menaphite artefact known as the Eye of Het.",
    "With that power He can summon an endless tide of demons from the demon dimensions!",
    "The weak Saradominists foolishly threw their forces away in some meaningless conflict, and are in no state to oppose us.",
    "Indeed!",
    "Hello again, uhh...",
    "Yes, [cultist name]. Apologies, there are just so many new members!"
  ],
  "Gail": [
    "Ugh, another newbie. It seems we're just opening membership up to anyone these days."
  ],
  "Kenton": [
    "May Zamorak be with you."
  ],
  "Oakley": [
    "Hang on a second, I recognise that voice...",
    "Yes! I know you! Player, the World Guardian! You saved my-"
  ],
  "Orman": [
    "Greetings, child of Zamorak.",
    "Children of Zamorak do not 'gossip'."
  ],
  "Ridley": [
    "The Source must be protected from outsiders. Lord Zamorak's will maintains the barrier.",
    "He has blocked access to the Source below and the crater above, so that He may conduct His holy work without interference!",
    "I don't know. I fell asleep during the briefing."
  ],
  "Wayland": [
    "I'm keeping an eye on the prisoner while we are preparing for their next enlightenment session.",
    "Although between you and me, this is just another one for the Hydra Gate.",
    "I really need to stop betting on prisoners.",
    "I'm sorry, but the prisoner is not allowed visitors.",
    "Alright then.",
    "Alright, it's time for another enlightenment session.",
    "Ugh, Ridley was right. That's me out of 20 gold.",
    "Well, we accept you, Tyne. Come - join us in the glory of Zamorak."
  ],
  "Woodrow": [
    "Ah. I suppose you were going to find out sooner or later.",
    "I'm planning on leaving the cult.",
    "The kidnapping? Fine. The 6 AM rituals? Not ideal, but I can live with it. The torture? One of my favourite pastimes.",
    "But these new robes? Absolutely awful. The most uncomfortable clothing I've worn in my entire life - the fabric is itchy, the sizing is off...",
    "Oh. Forget I said anything."
  ],
  "Yedda": [
    "Shh. I'm busy praying."
  ],
  "Tyne": [
    "H-hello? Who are you?",
    "W-why would you do that?",
    "Saradomin has heard my prayers! I'm Tyne.",
    "No -  [sic]there's no way you can sneak me out of here without him seeing. He's got eyes like a Zamorak hawk.",
    "But if I appeal to their beliefs, then I might have a chance of getting out of this cell.",
    "I'd need some of their robes to leave inconspicuously, though.",
    "Have you found any spare robes for me?",
    "Please, hurry.",
    "I'll just be a minute...",
    "Ah! Wayland, my fellow child of Zamorak!",
    "For so long, I have been blind to your superior beliefs. But now I see the light.",
    "Please, accept me as one of your own.",
    "Thank you Player, truly.",
    "Farewell. I'm just glad I wasn't taken to sacrifice like the others."
  ],
  "Garlandia": [
    "You!",
    "Why did you bring me here, Hebe?",
    "You didn't tell me he would be here!",
    "I'm leaving.",
    "Adrasteia? You're Adrasteia! Saradomin's adopted 'daughter'!",
    "...",
    "...",
    "You're *sorry*?",
    "So, 'Hebe', you brought me here so he could *apologise*?",
    "You're as ridiculous as he is.",
    "Amends? *Amends*?",
    "Restore my wings?",
    "RESTORE MY WINGS?",
    "You little idiot.",
    "It has been thousands of years. Do you not think others have offered?",
    "It is hardly a feat that requires the attentions of a god.",
    "My body is a monument to his cruelty.",
    "Everywhere I go, people are reminded of it.",
    "My mutilation is the greatest thing of value that I have.",
    "He will not take that from me too!",
    "Nothing within your power to grant.",
    "Can you put back what you tore down?",
    "Can you do what Guthix did? Protect this world from your kind?",
    "Begone from this place along with all the gods. Leave us without the 'benefits' of your 'wisdom'.",
    "Is that within your power to grant, mighty Saradomin?",
    "Excuse you!",
    "No!",
    "Gielinor needs to be rid of your kind, not dominated by your tyrannical rule!",
    "Oh?",
    "Yes!",
    "On the contrary, this solves the greatest iniquity of all.",
    "You boast incessantly about integrity and honour. And now that you are finally in a position to make amends you hide behind the same, feeble excuses.",
    "You have said time and time again that you are willing to do what is necessary. For once, Saradomin, be a man of your word.",
    "...",
    "Admirable sentiment, but even in his absence, Zamorak's forces will remain a threat to Gielinor."
  ],
  "Sir Alvin": [
    "My lord, please, forgive the interruption!",
    "Word from King Roald, my lord. Misthalin is under attack.",
    "They say demons are teleporting into the towns and cities.",
    "They are attacking citizens, lord, killing the townsfolk!",
    "Intruder!",
    "Then what should we do, my lord?"
  ],
  "Sir Simon": [
    "My lord!",
    "Word from Burthorpe, my lord! They are under attack!",
    "Yes, lord."
  ],
  "Bilrach": [
    "Oh come now, calm yourself.",
    "I am but a humble emissary.",
    "O Saradomin, unholy despot.",
    "I bring a message from Zamorak, Lord of Chaos, Imperator of Gielinor, Dictator of Infernus and the Lower Planes, et cetera.",
    "The Empire of Chaos has returned. This world is ours.",
    "Your armies are spent, O Saradomin, while our demons outnumber the stars.",
    "You sit in crumbling fortresses while our forces attack at their leisure.",
    "Your people are starving, while we burn your crops as offerings.",
    "Even now, all-powerful Zamorak summons legions to this world from behind an impregnable shield.",
    "Supplicate yourself before him and he will spare the lives of your few misguided followers.",
    "Refuse, and his wrath shall consume all lands."
  ],
  "Tree of Balance": [
    "Ahhh... World Guardian. The others will be glad of your arrival.",
    "One moment..."
  ],
  "Death": [
    "I'm glad your recovery is progressing, Fiara.",
    "Hmm...",
    "I have seen the death that the gods and their machinations have wrought.",
    "It is hard to imagine that this knowledge could possibly make things worse.",
    "It is time. The knowledge I hold is yours, World Guardian.",
    "Yes... The results of a misstep here could be - well - far beyond my capacity to handle.",
    "Not possible. It's crawling with Zamorakian cultists.",
    "The outcome of Zamorak's plan can only bring chaos and misery. But if anyone can find a solution, it's you.",
    "World Guardian. I believe you should retrieve the items we need from Isaura.",
    "World Guardian. Juna should have more information on what to do.",
    "Mahjarrat, demigods...that cabbage thing...",
    "Guthix had millennia of experience wielding the power that he did. It is not surprising that only he had the control to do so with precision.",
    "The World Guardian?",
    "Yes... I suppose the World Guardian would be the most concentrated vessel of Guthix's power in the world.",
    "World Guardian. I believe you should return to Saradomin."
  ],
  "Fiara": [
    "My cerci have almost completely regrown.",
    "Such an act... this power is not for the likes of us.",
    "If it frees us of Zamorak's tyranny, I will part with what I was left.",
    "But this could work. We could...re-establish the Edicts like this - with the World Guardian as the key.",
    "Could we ask Saradomin? He once held the Crown Archival. Of anyone on Gielinor, he would have the best sense of its magical topography.",
    "Let's not drag our feet. Go - before it's too late.",
    "Hello. Isaura will have the items we need.",
    "Hello. Juna should have more information at this time.",
    "How do you feel, World Guardian?",
    "So even if we succeed, we'll still have powerful immortals to wrangle on Gielinor.",
    "I fail to see how that's a problem. Surely by doing so we fulfill Guthix's wishes.",
    "Guthix's death changed a lot of things. His energy spread far and wide, suffusing Gielinor.",
    "There is no discrete focal point on Gielinor that could functionally represent him. Except, perhaps...",
    "Hello. You should report back to Saradomin."
  ],
  "Juna": [
    "World Guardian! It's good that you're here. We've been trying to contact you, but to no avail.",
    "The problem of Zamorak's demonic incursion affects everyone. I'd be glad to have your thoughts.",
    "Even if we did consider this... What chance is there that we will succeed?",
    "We each hold some small part of the necessary information, but - as far as I know - none of us has the power to execute it.",
    "Together, we Guardians hold the collective knowledge of the Edicts. But there is another element required - a physical aspect.",
    "This is a lot to take in. If Ocellus is correct, we Guardians would need to surrender part of what Guthix bequeathed to each of us personally.",
    "Even to agree to this, we would need to put our complete trust in you - a mortal, who has fraternised with the very gods we seek to stop.",
    "...",
    "So be it. Let us begin.",
    "I... I think we have it.",
    "...",
    "Yes - my apologies. It is just strange to hear such inscrutable things spoken of as if they were simple experiments.",
    "Next, we must find an appropriate site. Ideally we would use the Sword of Edicts in the Wilderness: the location of Guthix's original casting.",
    "We must find an alternative site for our tests, then. One suffused with divine power, but stable enough that the ritual might been seen through safely.",
    "Where that might be, though... I have no good way of saying.",
    "Go, then, and report back to Saradomin.",
    "Guthix is no longer here. Mortals are the authors of Gielinor's fate now.",
    "Let us write a fitting foreword.",
    "World Guardian. Speak to me when you are ready.",
    "Please speak to me first.",
    "Welcome, World Guardian.",
    "We are assembled, but there is still some preparation needed.",
    "We still need test objects to use within the ritual. These will ascertain the effect the real ritual will have on the gods.",
    "Ocellus has called in some old contacts, and has arranged for suitable items to be gathered.",
    "We have been dealing with a[sic] intermediary: the Kinshra requisitions officer, Isaura. She's been holding them for us until we could confirm the location.",
    "Isaura has made a long and lucrative career out of...tactical ignorance. She is able to procure almost any item, and asks no more questions than she needs to.",
    "I assure you, she can be trusted. Please speak to her in the Kinshra base beneath Taverley and arrange the delivery.",
    "Please, retrieve the items we require from Isaura in the Kinshra base below Taverley.",
    "You have the items, then? I can scarcely believe we are doing this, but... it is time.",
    "In the grove, there is not sufficient power to actually complete the ritual to establish the Edicts - only a scaled-down facsimile.",
    "Nonetheless, we must take care. I propose that we test the ritual in three stages: starting out with four runes, then five, then six.",
    "The effigies placed in the centre each resonate with the power of its represented god or divine being. They should show the effect that the real ritual will have, when the time comes.",
    "You are correct, of course. To banish a creature without means of survival would be cruel.",
    "These rare birds, however, have an inherent homing trait that sends them back to their world of origin, should they be exposed to chaotic teleportation magic.",
    "Since we needed living matter, I requested them specifically - and at considerable expense.",
    "In dire times, holding onto our ethics is what sets us apart from our enemies.",
    "Now... The ritual itself should be relatively simple.",
    "Take materials from the cart and build the platforms. Start with four. We will increase this as we progress.",
    "To prepare, gather divine energy from the springs and craft Guthixian runes. These aren't physical objects, but will be made available to you when you need them.",
    "Add the runes to the platforms, then initiate the ritual at the centre of the grove. You must complete three words for each ritual.",
    "Experiment, observe the results, and find the words needed to complete the rituals.",
    "We have a journal for you. However, you don't have enough space to hold it.",
    "We have combined our knowledge of the runes into this journal. Hopefully it will help with the rituals.",
    "Good luck! I am here should you require further advice.",
    "World Guardian. How goes the ritual?",
    "We have a journal for you. However you don't have enough space to hold it.",
    "Please be more careful with this one.",
    "World Guardian. How goes the ritual?",
    "You must set up the platforms before the ritual may be attempted. Simply take materials from the cart and build the platforms in the designated spots.",
    "You will need four for the first phase, five for the second, and six for the final push.",
    "Place an appropriate test object in the circle at the centre of the grove, then activate the circle.",
    "Gather energy from the springs. Then, access the artefact in the centre of the grove and craft the runes you need.",
    "The word's length will be determined by the number of platforms active.",
    "Place runes onto the platforms to form words.",
    "It would be for the real ritual.",
    "Look at the colours of the runes you have placed.",
    "Green means the rune is in the correct place.",
    "Amber means the rune is part of the correct word, but incorrectly placed.",
    "Grey means the rune is not part of the correct word.",
    "Red means the rune is in the correct place.",
    "Purple means the rune is part of the correct word, but incorrectly placed.",
    "Grey means the rune is not part of the correct word.",
    "Once you have found the correct word three times, the current ritual will be complete.",
    "Alas, we are in uncharted territory. Just do not give up! Think calmly and logically, and I am certain you shall prevail.",
    "We don't require that platform just yet.",
    "You will need that crate of birds from Isaura.",
    "You will need the doll-alike from Ocellus.",
    "Enough.",
    "Yes. All will remain when we succeed.",
    "Good. We have tested the foundations of the ritual. Now, we must take it further.",
    "Place the effigies of the gods in the circle. Then attempt the ritual with one more rune - five in total.",
    "Take care, World Guardian - and good luck.",
    "Stop! Enough!",
    "As I suspected. When we complete this, all gods who have not already left Gielinor will leave. Whether they want to or not.",
    "It is time. World Guardian, we will now try the ritual with the full six runes. This will take it to the brink of completion - as far as the power of this place will allow.",
    "This time, for control, we will need an effigy representing Guthix. Although obtaining one will be no small task.",
    "You are the closet thing to Guthix that walks Gielinor, Player.",
    "Agreed. When you're ready, Player.",
    "WORLD GUARDIAN! SNAP OUT OF IT!",
    "Are you okay? What happened?",
    "I see. And is that a sacrifice you're willing to make?",
    "Then you are honoured for all time - a Guardian of Guthix in name and resolve, if not in power.",
    "Now - I must ask that you report back to Saradomin on our findings. Best that he hears the news from you.",
    "World Guardian. You should report our findings back to Saradomin."
  ],
  "Valluta": [
    "Ah. This is long overdue. Gielinor must return to the hands of mortals.",
    "Very well.",
    "I scarcely believed it was possible...",
    "And if he's aligned with our purposes as he says, he should have no qualms about assisting.",
    "When you need us, we Guardians stand ready.",
    "Greetings. Isaura will have the items required for the rituals.",
    "Greetings. You should speak to Juna to find out what to do.",
    "That bears out. We had a surfeit of near-godlike entities in place of the real thing during the Fifth Age.",
    "Who's - ah - going to break this news to Saradomin? Rather you than me.",
    "Aye. The energy harnessed by diviners has only a trace of Guthix's essence. To create what we need here, you'd need relatively large amount.",
    "There are times when knowledge is not power, World Guardian. When it's...best not to ask.",
    "Greetings. You should now return back to Saradomin."
  ],
  "Ocellus": [
    "World Guardian. Unique element. Uncharted power. Possible catalyst.",
    "Theory. Guthix chose one to replace him. Not us. Process of elimination...World Guardian is missing element.",
    "Could serve as vessel for collected knowledge. Divination-capable. Absorbs knowledge from other Guardians, then enacts.",
    "Knowledge - Guthix's legacy - combined in World Guardian. Together...maybe enough.",
    "First, must test World Guardian affinity. Attempt passing on of knowledge.",
    "Theory complete. Next, practice.",
    "Find way in later. For now, discretion.",
    "Time. Time lacking. World Guardian must go.",
    "Required items not commonly available. Sources value anonimity[sic]. Time required. Alternative is disposal of messengers - quicker, unsustainable.",
    "Ocellus of no help. Isaura has required items.",
    "Ocellus of no help. Speak to Juna.",
    "Not gods. Pretense only. Power to sway the weak of mind.",
    "No cherry picking, then. All the gods, or none of the gods.",
    "Ocellus has something for World Guardian. Free space in backpack. Speak again.",
    "Guardians of no help. Report to Saradomin."
  ],
  "The Archivist": [
    "World Guardian. Demeanour: urgent. Cross-reference military threat and socio-political unrest.",
    "Awaiting request for assistance.",
    "Hall of Memories as compatible location: plausible assumption.",
    "Analysis: stability optimal. Divine energy insufficient.",
    "Recommendation: continue search."
  ],
  "Confused automaton": [
    "Identifying...",
    "World Guardian. Welcome.",
    "World Guardian - state purpose.",
    "Simulating...",
    "Data limited. Extrapolation... Divine energy: sufficient. Stability: inadequate.",
    "Projection: World Guardian. Fatal corporeal inversion. Extensive viscera cleanup required."
  ],
  "Merethiel": [
    "Who goes there? Know that you face Keeper Merethiel of the-",
    "Oh! The World Guardian. My apologies - I am...somewhat on edge of late, given the increased demonic activity.",
    "The Grove Guardian patrols the area, so it is unlikely that we would suffer an incursion. Nonetheless...",
    "But enough of my concerns. How may I assist you today?",
    "I...see.",
    "Ordinally, I would be against this. The Edicts can potentially banish all gods, and my people rely on Lady Seren's grace to survive.",
    "That said...of late it seems we are abandoned by our goddess. And that visitor from Tarddiad - Angof, is it? - She has promising leads for our survival.",
    "Perhaps... Perhaps we are better off without.",
    "Yes. It is time we took our fates into our own hands.",
    "The Lost Grove is yours to use. It has sufficient primal energy for such a ritual, and the divine equilibrium to enact it with minimal risk. Maybe even the madness you propose is possible here.",
    "I shall put out the word to the Guardians to join us here. The Lost Grove will play host to them.",
    "Your fellow Guardians await you below. When you are ready, I can send you down into the grove to join them."
  ],
  "Isaura": [
    "Ah! Was beginning to wonder if you'd show up. Hope the guards didn't give you too much grief on the way in.",
    "So... You're Ocellus's friend. How is the old bag of tentacles?",
    "He's come up with some weird requests before, but divine birds?",
    "Fortunately, they like the dark. I popped some food in there for 'em not long ago. I'll - ah - leave you to change the paper.",
    "Hmm... You don't appear to have enough room for the crate.",
    "Come back to me when you have a free space in your backpack.",
    "Look, I try not to ask questions. What you do with these is your business, but...",
    "Buttermilk marinade. Plenty of salt and pepper, squirt of lemon and some fresh garlic and harralander. Straight on the grill.",
    "Be sure you do. Pleasure doing business, as always.",
    "Have you checked your [backpack/bank]?",
    "Please don't lose this one."
  ],
  "You need": [
    "1 x Stone circle building kit",
    "1 x Stone circle building kit"
  ],
  "Letter": [
    "[Letter]Position: [To be checked/Correct place/Incorrect place/Not in word]",
    "[Letter]Position: [To be checked/Correct place/Incorrect place/Not in word]",
    "[Letter]Position: [To be checked/Correct place/Incorrect place/Not in word]",
    "[Letter]Position: [To be checked/Correct place/Incorrect place/Not in word]"
  ],
  "Ritual": [
    "[Letter] [Letter] [Letter] [Letter] [Letter] [Letter]"
  ],
  "Ritual [number]": [
    "[number]/3 words completed."
  ],
  "Armadyl": [
    "We're not going inside?",
    "Your cities are burning, Saradomin, and you have called me away from their defence.",
    "We don't have time to waste. What is this about?",
    "...",
    "I remember.",
    "And you have agreed to this, Saradomin?",
    "Of course.  [sic]Gielinor would be better off without our interference.",
    "Do we attack Zamorak together?",
    "And in the meantime, his demons will kill everyone. Yes, I see the problem.",
    "Survival is one thing. But to defeat Zamorak himself? That's quite another.",
    "We have a plan. I can wait no longer. Until we meet again, Player."
  ],
  "Azzanadra": [
    "There's a time and place for it.",
    "Player. It seems my celebration after your defeat of the Elder Gods was premature.",
    "We banish Zamorak, he's trapped off world, which cuts off the flood of demons. Clever.",
    "Immediately?",
    "I see.",
    "Why are you telling us?",
    "Surprising to see the all-knowing Saradomin consulting with others.",
    "Charming.",
    "Assuming I even qualify as a 'god'...",
    "It is my duty to shepherd the Empire. That Empire is gone, thanks to Zamorak.",
    "It is my duty to watch over Zaros's followers. They are few, thanks to Zamorak.",
    "It is my duty - and my pleasure - to oppose Zamorak in any capacity I can.",
    "To transform his moment of triumph into yet another defeat...",
    "Yes, you have my blessing. Are you doing it now?",
    "Ah, exactly where Zamorak has fortified himself.",
    "Whatever small resources we have are yours. I will have Trindine make contact with Adrasteia.",
    "Is that possible? A mortal against a god?",
    "Indeed.",
    "May Zaros protect you."
  ],
  "Icthlarin": [
    "...",
    "It has little effect on me. I will simply return to the Underworld as I did last time.",
    "If you want my opinion on the plan, I will say this:",
    "I serve a purpose on this world. The rest of you have brought nothing but chaos and death.",
    "And any course that sees two fewer Mahjarrat traitors befouling my home is a good one.",
    "Well...",
    "Zamorak! Are you feeling confident?",
    "Do you have a plan?",
    "Oh dear.",
    "Yes, that's what I thought.",
    "Back when we first met... well. I didn't think it would end this way.",
    "Should we not meet on the overworld again... well, I meet everyone in the underworld eventually.",
    "Farewell, Player."
  ],
  "You have unlocked the cosmetic override": [
    "'Order of Dis robes'."
  ],
  "Congratulations! You have completed": [
    "'Twilight of the Gods' - Complete this quest."
  ],
  "Hannibus": [
    "Good day, Player.",
    "Well, I wouldn't say it's been friendship at first sight. We met briefly while the Nodon were being returned to their pods.",
    "Like us, she too has felt deep loss. Only she has not managed to save her people... And I sense that is holding her back.",
    "Now having seen what Vicendithas has achieved with the Iaia dreamscape... I'm sure we possess the necessary knowledge to liberate the Nodon."
  ],
  "Vicendithas": [
    "Indeed. A fellow kin, just as curious and inventive as myself. It's been only natural for us to build a rapport..",
    "But... I know she blames herself for the ongoing captivity of the Nodon. Though they may be physically safe, their minds are still at war.",
    "I do need a new project now that Iaia has been successfully recreated. There must be some knowledge within the dreamscape technology that could help."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Twilight_of_the_Gods?oldid=36185484’"
  ]
}