{
  "The Old School RuneScape Wiki also has an article on": [
    "osrsw:Transcript:Mourning's End Part I"
  ],
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "dialogue with Arianwyn after getting the task to poison peopleYou can discuss this issue on the talk page or edit this page to improve it."
  ],
  "Player": [
    "Hi there.",
    "It was a worthy deed.",
    "Lletya? I know nothing of this place.",
    "I have a few things to do right now.",
    "Yes, I should go see him now.",
    "Thanks a lot, Eluned!",
    "Hello.",
    "Not bad, thank you.",
    "Hello.",
    "Not bad, thank you.",
    "I'll go and see him as soon as I have time.",
    "Hello again Elena.",
    "As it goes, yes I have. It's a long story.",
    "Elena, it's Player!",
    "It's a long story.",
    "Well I'll start from when we found out that the plague was a hoax. After returning to Ardougne I visited the King, to tell him of our discovery. As you can guess he already knew about the plague being a deception.",
    "King Lathas told me that while his brother was exploring the realm west of here, he was taken by the Dark Lord, who forced him to drink from the Chalice of Eternity. I'm told this corrupted him...",
    "Where his alignment lay matters little now, you must understand I was acting on the best information I had at the time... but I jump ahead of myself...",
    "King Lathas explained to me that in order to stop the Dark Lord we needed to stop his brother and to do that we needed to find a way to the west realm. I was led through a cave system packed full of traps, that led right under the mountains to the west. At its heart was an evil mage named Iban. He held the Well of Voyage, a way of travelling to the western realm. My guide went a little mad and... well to cut a long story short I eventually had to destroy Iban. This saved my guide and gave us access to the well. Unfortunately Iban had messed with the magic of the well and mages were needed to repair it. I returned to King Lathas who told me he'd see to fixing the well. Some time later I received a summons to meet with Lathas. The King informed me the well was repaired and that I was to finally go and deal with his brother. He said I could expect help from his ally when I got there. Once more I passed through the warren of traps under the mountain, this time passing through the Well of Voyage. This eventually led me to a land known by its inhabitants as Tirannwn.",
    "People yes... But not like you or I. I was just coming to them. Where was I... oh yes... I was only in the woods of Tirannwn a short while when I was caught in a fight between two factions of Elves.",
    "No, they're still here and in some form of civil war too it seems. Anyway getting back to the story... Luckily the winning side in the fight was my contact.",
    "Yes I didn't think about that at the time... But it did strike me as a little odd after I thought about it. Anyway a plan was devised to blow up King Tyras. A plan I was successful in carrying out. As I said I was acting on the best information I had available at the time. I left Tirannwn to return here and inform King Lathas that his brother was dealt with, carrying a magically sealed message from the Elves. On my return journey to Lathas' castle I was confronted by an Elf from the rebel faction. He knew a great deal about me and my deeds, he also knew of the message I carried. He cast a spell on the message, that let me open it.",
    "It told of how King Lathas wants to reclaim the land given by his father to the Knights of Camelot and of a deal between the Elves and the King promising the help of The Dark Lord in this endeavour.",
    "This was my thinking too, so I agreed to go and meet with the leader of the Elven rebellion but I've not made it there yet. And so my story ends here.",
    "I guess I should go and talk with Arianwyn in the Elven village.",
    "This was my thinking too, so I agreed to go and meet with the leader of the Elven rebellion. I was taken to a small village in a hidden valley, where I spoke with an Elf named Arianwyn. He revealed to me that our Mourners are not quite what we thought, in fact they're Elves who follow The Dark Lord.",
    "I have been asked by Arianwyn to infiltrate them and find out their plan, but have yet to try. And so my story ends here.",
    "I guess I should find a way into the Mourner Hideout.",
    "I was asked by Arianwyn to infiltrate them and find out their plan. I managed to fool them into thinking I was a new recruit which was no small task in itself. I think I need to win the trust of the Head Mourner before they will tell me anything useful. And so my story ends here.",
    "I guess I'll follow the Head Mourner's instructions until they let me in on the plan.",
    "Thanks, I'd better get back to the task at hand.",
    "We will, I'm sure. Bye Elena.",
    "I have some things to do, later maybe.",
    "I will.",
    "Mourners? Here in Tirannwn? But why?",
    "Mourners are Elves? But I thought they were the West Ardougne guard.",
    "Alright, cut to the crux. What do you need me to do?",
    "So let me get this right. You want me to infiltrate the Mourners and find out their plans?",
    "And just how am I supposed to achieve that?",
    "Alright, I'll see what I can do.",
    "Alright, I have managed to infiltrate the Mourners, I just have to find out what they are up to now.",
    "Do you mend clothes?",
    "I need you to repair some Elven clothing as it goes.",
    "But can you fix them?",
    "What do you need to mend my trousers?",
    "Alright.",
    "I have all I need to mend my trousers.",
    "How are you doing with my trousers?",
    "Thanks a lot.",
    "So, you're doing laundry, eh?",
    "Nice day for it.",
    "Do you know any way to remove blood stains?",
    "Really?!? That sounds like just the thing I need, can I use some?",
    "Alright can you tell me where I can buy some?",
    "Could you be less helpful?",
    "Sorry, I'm new around here.",
    "Good day.",
    "That sounds... err great.",
    "Hello.",
    "That's right.",
    "Thanks for the warning.",
    "Hello, I'm...",
    "Well I'm...",
    "Erm... I seem to have misplaced it.",
    "Why?",
    "Yes.",
    "Yes.",
    "Discovery?",
    "I guess so.",
    "You dyed them?!?",
    "Simple enough, you want me to give a blue rinse to a load of old sheep?",
    "That sounds a little more tricky. How did you do it before?",
    "Can I take a look at it?",
    "Hello, will you help me fix this... err... thing?",
    "Have they tried... er... Stretching your eyelids yet?",
    "How about... feeding you nail and prune stew?",
    "Set fire to your nostril hair? Let rabid rabbits nibble your toes? Given you a chinese[sic] burn?",
    "Extracted your wisdom teeth?",
    "Alright I get the picture. What will work then?",
    "Err.. But you just told me?!?",
    "You said about going to the park and playing gnomeball.",
    "You said about toad crunchies and a gnome ball.",
    "You said about being tickled and a gnome ball..",
    "You said about toad crunchies and being tickled.",
    "You're not fooling me... So you'll help me in exchange for toad crunchies?",
    "You will tell me, sooner or later.",
    "You said about being tickled and going to the park.",
    "Now will you help me or do I have to tickle your feet some more?",
    "Hmm... This isn't quite working!?",
    "Now will you help me or do I have to tickle your feet some more?",
    "Now will you help me or do I have to tickle your feet some more?",
    "Very well, but you don't get the crunchies until I get back though.",
    "I still need [a magic log/some soft leather/a magic log and some soft leather].",
    "I have it all here.",
    "That's all well and good but I'm enjoying doing it.",
    "No, you misunderstand me. I was just going to slap him about a bit.",
    "I need to let him up if he's to fix this device.",
    "Have you fixed the device yet?",
    "Nothing I'm just talking to people randomly in case it helps.",
    "Not really, no.",
    "I need you to fix another of those devices for me, I lost the last one.",
    "I still need a magic log, some soft leather and the toad crunchies you promised.",
    "Come here toady!",
    "Not yet, but I'm working on it.",
    "Yes, it is done. What next?",
    "Err... But the plague doesn't exist, how am I meant to do that?!?",
    "Let me get this clear, you want me to; a - Find out who poisoned you.b - Find out what they poisoned you with.c - Find out how to make the poison.d - Produce enough poison to affect a lot of people.e - And finally, contaminate the food stores with the poison.",
    "Yes Sir.",
    "Hello again Elena.",
    "Elena, it's me... Player",
    "Alright, but I could do with your help.",
    "I've been asked to produce a poison based on rotten apples.",
    "Well I put a rotten apple in the Mourners' stew, I'm told that the effect was much like the symptoms of the plague.",
    "I need to poison a large food store, in order to get the Mourners' trust.",
    "If I don't gain the trust of the Mourners then the people of West Ardougne will have a much worse time than the effects of that toxin... Elena, trust me.",
    "Well I'll start from when we found out that the plague was a hoax. After returning to Ardougne I visited the King to tell him of our discovery. As you can guess he already knew about the plague being a deception.",
    "King Lathas told me that while his brother was exploring the realm west of here he was taken by the Dark Lord, who forced him to drink from the Chalice of Eternity. I'm told this corrupted him...",
    "Where his alignments lay matters little now, you must understand I was acting on the best information I had at the time... but I jump ahead of myself...",
    "King Lathas explained to me that in order to stop the Dark Lord we needed to stop his brother and to do that we needed to find a way to the west realm. I was led through a cave system packed full of traps, that led right under the mountains to the west. At its heart was an evil mage named Iban. He held the Well of Voyage, a way of travelling to the western realm. My guide went a little mad and... well to cut a long story short I eventually had to destroy Iban. This saved my guide and gave us access to the well. Unfortunately Iban had messed with the magic of the well and mages were needed to repair it. I returned to King Lathas who told me he'd see to fixing the well. Some time later I received a summons to meet with Lathas. The King informed me that the well was repaired and that I was to finally go and deal with his brother. He said I could expect help from his ally when I got there. Once more I passed through the warren of traps under the mountain, this time passing through the Well of Voyage. This eventually led me to a land known by its inhabitants as Tirannwn.",
    "People yes... But not like you or I. I was just coming to them. Where was I... oh yes... I was only in the woods of Tirannwn a short while when I was caught in a fight between two factions of Elves.",
    "No, they're still here and in some form of civil war too it seems. Anyway getting back to the story... Luckily the winning side in the fight was my contact.",
    "Yes I didn't think about that at the time... But it did strike me as a little odd after I thought about it. Anyway a plan was devised to blow up King Tyras. A plan I was successful in carrying out. As I said I was acting on the best information I had available at the time. I left Tirannwn to return here and inform King Lathas that his brother was dealt with, carrying a magically sealed message from the Elves. On my return journey to Lathas' castle I was confronted by an Elf from the rebel faction. He knew a great deal about me and my deeds, he also knew of the message I carried. He cast a spell on the message, that let me open it.",
    "It told of how King Lathas wants to reclaim the land given by his father to the Knights of Camelot and of a deal between the Elves and the King promising the help of the Dark Lord in his endeavour.",
    "This was my thinking too, so I agreed to go and meet with the leader of the Elven rebellion. I was taken to a small village in a hidden valley, where I spoke with an Elf named Arianwyn. He revealed to me that our Mourners are not quite what we thought, in fact they're Elves who follow The Dark Lord. I was asked by Arianwyn to infiltrate them and find out their plan. I managed to fool them into thinking I was a new recruit which was no small task in itself. I think I need to win the trust of the Head Mourner before they will tell me anything useful. And so my story ends here.",
    "I guess I follow the Head Mourner's instruction until they let me in on the plan.",
    "Alright I'll be back shortly with a rotten apple for you.",
    "Yes it's me.",
    "No, I forgot to get one.",
    "Yes, I have it right here.",
    "Alright then. I'd better leave you to it.",
    "How's it going Elena?",
    "Okay I'll come back in a bit.",
    "How's it going Elena?",
    "Well I was instructed to contaminate the two distribution points.",
    "This is starting to sound a little tricky, can't you make it for me?",
    "Alright then tell me the process and I'll get started.",
    "And that's all is it?!? Why isn't anything ever easy?",
    "Hey ya Elena.",
    "Not too well, can you remind me how I should make it again?",
    "Thanks Elena.",
    "Do you have another sieve? I lost the last one.",
    "Thanks again.",
    "Hey ya Elena.",
    "It's all done.",
    "I was just on my way back there.",
    "I will.",
    "The epidemic? Oh, you mean the poisoning?",
    "Can you explain to me again what it is I have to do?",
    "That's all done and dusted!...Alright, sorry... that was a bad pun.",
    "What do you need slaves for anyway?",
    "Temple?",
    "So that is the real purpose behind us being here?",
    "I see.",
    "Good day.",
    "Sorry, I'm a new recruit.",
    "Do you have the key to the excavation site yet?",
    "Alright, I'll report in again tomorrow.",
    "Hey ya Elena.",
    "Sort of, they seem to be looking for an old temple buried deep under the mountain. This temple is meant to give them access to great magical power, but I have no idea what that is yet.",
    "I will.",
    "I think I got the information you're after, it seems they're searching for an ancient temple of some sort under the mountains.",
    "I don't think they've found this temple yet, but they know it's down there.",
    "What do you expect me to do about it?",
    "Right then, I'm on it. As soon as I can get a key to the excavation site. I should check in with the Head Mourner."
  ],
  "Eluned": [
    "Hi! I hear you finished consecrating Glarial's tomb. Well done.",
    "Oh... I have been asked to inform you, Arianwyn requests a meeting with you in Lletya.",
    "I will take you there if you like.",
    "Sure thing, but he will not wait for long.",
    "Well, let us go then.",
    "Here you go... If you ever need to get back to Lletya, you can use this. Use it sparingly as it only has a few uses but I can re- enchant it for you.",
    "Now, I had better get going or Islwyn will get worried.",
    "You don't have any crystals that I can re-enchant.",
    "Hello again, how is it going?",
    "Oh... Arianwyn is requesting a meeting with you in Lletya. Do you want to go there now?",
    "Hello again, how is it going?",
    "You don't have any crystals that I can re-enchant.",
    "I understand you did not speak with Arianwyn while in the village, you really should.",
    "As you wish."
  ],
  "Elena": [
    "Player! How's it going? Have you found out any more about this plague?",
    "Well I'm not going anywhere, so how about telling me all about it.",
    "How dare you enter my house, Mourner! Get out!",
    "Player? I didn't recognise you in all that Mourner gear!",
    "Well I'm not going anywhere, so how about telling me all about it.",
    "I knew it! But why?",
    "You don't sound too sure about that?",
    "Sorry, I didn't mean to interrupt your story.",
    "There are people beyond the mountain range?",
    "Elves! Really... I thought they'd gone from this land.",
    "Lathas allied with one of the Elf factions??",
    "What did it say?",
    "I knew he was up to no good, but how could he side with anything that calls itself the Dark lord?",
    "That's some tale. So what now?",
    "That's some tale. So what now?",
    "That's some tale. So what now?",
    "Well if you need anything just ask.",
    "Alright, well I hope we see each other again soon.",
    "Alright then... But you're going to have to tell me some time.",
    "How dare you enter my house, Mourner! Get out!",
    "Oh, sorry Player. I didn't recognise you in all that Mourner gear! How's it going?",
    "What's the problem?",
    "I doubt any poison based solely on apples, rotten or not, would be very effective.",
    "Hmm... That sounds like they were ill from some sort of toxin, I should think it was a mould of some sort that had the effect, not the rotten apple itself. What do you need it for?",
    "That's awful! I can't help you in such an endeavour.",
    "I think you should tell me just what's going on.",
    "I knew it! But why?",
    "You don't sound too sure about that?",
    "Sorry. I didn't mean to interrupt your story.",
    "There are people beyond the mountain range?",
    "Elves! Really... I thought they'd gone from this land.",
    "Lathas allied with one of the Elf factions??",
    "What did it say?",
    "I knew he was up to no good, but how could he side with anything that calls itself the Dark lord?",
    "That's some tale. So what now?",
    "Alright I'll help...",
    "You'd better be right about this, and I'd better make sure you get this toxin right so no one dies! Bring me a sample of rotten apple to examine. I'll also see if I can make a counteractant for the toxin.",
    "Is that you Player?",
    "You have a sample of rotten apple for me?",
    "Well if you bring me one we can get started on this toxin.",
    "Ick... Alright then let's get started.",
    "This will take a while. Come back in a bit and I should be able to tell you all about this toxin.",
    "I do wish you wouldn't wear that gear. Anyway I'm getting there, just a few more tests to run.",
    "You shouldn't creep up on people in all that gear... Where was I... Oh yes... I've managed to isolate a small sample of the toxin, It's a byproduct of the mould that grows on these apples, it's not fatal so a counteractant shouldn't be necessary. big is the store that you're going to affect?",
    "That's over half the food in West Ardougne! You're going to need a huge amount of the toxin to do that. You're also going to need to refine it too, or people will notice rotten apples in amongst the food they're buying.",
    "I would but I don't have the right equipment here to do anything in bulk.",
    "Right then the first thing to do is mash up a lot of rotten apples, then you will need to dissolve the toxin into a liquid that has a very low evaporation point, some form of solvent. I was told about a book on explosives that discussed a solvent perfect for this job, but I don't remember who told me about it! Sorry I can't be of more help. Now, where was I? Oh yes - next, the useless solid can be strained out - this should leave you with a solution of the toxin in solvent. Finally, heat the mixture to evaporate off the solvent, be careful of naked flames as the solvent will be highly flammable. Once all that's done you'll be left with a white powder, be very careful not to breathe in or ingest this as this is our toxin.",
    "Here this may help...",
    "You may want to check out the orchard just north of the city. I hear no one has tended it since the blight infected the trees there.",
    "Huh?... Oh... Hello, I just can't get used to a friend being dressed as a Mourner. So how's the poisoning going?",
    "Right, the first thing to do is mash up a lot of rotten apples, then you will need to dissolve the toxin into a liquid that has a very low evaporation point, some form of solvent. Next, the useless solid can be strained out - this should leave you with a solution of the toxin in solvent. Finally, heat the mixture to evaporate off the solvent, be careful of naked flames as the solvent will be highly flammable. Once all that's done you'll be left with a white powder, This is the toxin you're after.",
    "No problem, you may want to check out the orchard just north of the city. I hear no one has tended it since the blight infected the trees there.",
    "Well it just so happens that by freak accident, I had hundreds delivered the other day!",
    "Huh?... Oh... Hello, I just can't get used to a friend being dressed as a Mourner. So how's the poisoning going?",
    "So have you found out what those Mourners are up to yet?",
    "Well let me know when you find out.",
    "Hello Player, so have you found out what those Mourners are up to yet?",
    "Well let me know when you find out."
  ],
  "Arianwyn": [
    "Good day Player, I have been hoping to see you. It has come to my attention that there are large numbers of those you know as 'Mourners' crossing the mountain pass through Arandar.",
    "Why? It is quite simple really and it is hardly a big secret. Those you know as Mourners are in fact Elves from the city. The big question is: Why are they heading to Ardougne in such numbers?",
    "This is what King Lathas would have you believe. We have been unable to infiltrate West Ardougne. The Mourner guard could identify us as enemy Elves before we could even get close to the walls. They must be up to something new, something we have not anticipated.",
    "That which we are unable to do, penetrate the Mourners' hide-out in Ardougne without alerting them to your presence, find out why they are there and what they are up to.",
    "Yes.",
    "I have no idea, but I know we can count on you. If I had a plan I would share it with you, but I am lost for ideas. You have proved you are capable of such things in the past. As I said before, there have been sightings of Mourners crossing the mountain pass.",
    "How goes it Player?",
    "Great work!! Stick with it Player.",
    "How goes it Player?",
    "Dear Seren no. They have rediscovered the Temple of Light?",
    "You must stop them, at all costs! If they harness the power secured in that temple, they will be able to start the end game before we can be ready.",
    "Whatever you can, we cannot allow that power to fall into their hands!",
    "We cannot allow the power in the temple of light to fall into the Mourners' hands! You must stop them."
  ],
  "Oronwen": [
    "Hello, can I help?",
    "I do, but human clothes are too hard to mend. They do not have the finesse of Elven garments.",
    "Let me take a look at it then.",
    "There's something disturbingly familiar about the design of these trousers. They are made for an Elf, even if they are not made by an Elf.",
    "Of course I can, but I will need 2 sheets of silk and some bear fur.",
    "I need bear fur and two sheets of silk.",
    "I need bear fur and one sheet of silk.",
    "(Transcript missing. edit)",
    "I just need a sheet of silk.",
    "(Transcript missing. edit)",
    "I have all I need to mend your trousers, hand them over and I will get started right away.",
    "Pass it all here then, and I will get started. Come back in a minute and I will have them done.",
    "They will be done soon.",
    "I have your trousers ready.",
    "Any time."
  ],
  "Tegid": [
    "Yeah. What is it to you?",
    "Suppose it is.",
    "Blood stains is it... Well, the soap I use can clean almost any stain.",
    "No, I don't have very much soap left and I still have lots to get clean.",
    "You can't... I make it to my own secret recipe.",
    "Like you were, taking those clothes from my washing line??",
    "So yes, if you know a way I can be less helpful just tell me, I'll try it.",
    "If you know a way just tell me, I'll give it a try."
  ],
  "Mourner": [
    "Who are you? Go away!",
    "You should know better than to wear non-regulation gear.",
    "Well you know the drill - lose the gear, I will let it pass this time.",
    "It is good to see so many new recruits, soon no one will be able to stand against the power of the Death Guard.",
    "Indeed it is.",
    "Hello, you must be one of the new guys.",
    "Watch yourself with the head, he has a bit of a temper.",
    "What do you think you're doing? You're meant to be getting information out of him, not making friends!",
    "Good good. Carry on.",
    "What do you think you are doing? You are meant to be getting information out of him, not making friends!",
    "Okay, but without the proper paperwork he stays in this room."
  ],
  "Head Mourner": [
    "Ah... I take it you are one of the new recruits?",
    "Come on, let us have a look at your paper work then.",
    "GET OUT! Return to Prifddinas in shame. If the Death Guard see fit to re-issue you with a letter of recommendation then maybe we will find a use for you.",
    "This seems to be all in order. Welcome to the Death Guard. As you may know, part of what we do here is keep the people believing in a plague...",
    "Hmm... This could take some time, do you really want me to explain it all?",
    "Are you sure?",
    "Can you not just follow orders, without the need of an explanation?",
    "Oh alright, if I must. Well as you undoubtedly know the original aim of the Death Guard was to secure a foothold here in the east, in preparation for 'His' arrival. Now though our objective has become little more... how shall I put it... proactive. That fool King thinks we are here as his ally, we duped him into thinking that Iban was enough of a threat that he let us setup here. Lathas even thinks 'He' will help him dispose of the Knights of Camelot. The plague was actually fabricated by King Lathas to justify the building of the city wall. But it has also worked in our favour too. We help him keep the people of Ardougne believing in the plague, but now after the discovery we have bigger fish to fry here.",
    "Yes... I can say no more until you fully prove your commitment to the Death Guard. Now... Are you ready to hear your first assignment?",
    "Good... Now let us get on with it. One of the things we do to keep the rumours of the plague active is to keep that old fool farmer Brumty believing his sheep are infected.",
    "The old halfwit thinks just because his sheep are an abnormal colour, that they are all ill with plague. It's amazing what a bit of dye can do.",
    "You do not think they end up those ridiculous colours naturally do you?...",
    "Anyway, shame of it is we have yet to find a way to stop the dye from washing out. So we need someone, i.e. you, to go and re-dye them.",
    "Not quite, for starters the sheep need to be dyed red, yellow, green and blue. But most important is that you are not seen doing this by anyone. Also you will need to re-dye them the colours they already are or the farmer may notice the change.",
    "We have a Gnomic device that fires fat green parcels that rupture on impact. Unfortunately we have run out of the parcels and the device is broken.",
    "Sure. We have a Gnome inventor here too, unfortunately he is not being very helpful about fixing it, but you can talk to him if you like. Here is the key, he is next door.",
    "Get away from my desk!",
    "Have you finished with those sheep yet?",
    "It is good to see your enthusiasm. I was going to get one of the others to do this job, but as you are here... It has been quite a while since anyone got ill from the plague, so I would like you to see to it that people do!",
    "We have never tried this before, but some joker put something in our food not too long ago that gave us all symptoms akin to those of the plague. If you can find out what it was that we were poisoned with, you could reproduce the effects. If done right the poison should not be fatal and could help restock our dwindling supply of cheap labour. We can have our men remove the 'infected' citizens. Distribution should be easy enough, because of the city walls no one can grow their own food so all the food here comes from one of three government supply points.",
    "Your assessment is correct, only two of the stores need to be affected. I would help you but I am not a biologist. Return when you have fulfilled the task.",
    "You are back already? How is the epidemic going?",
    "Subtle as a brick... Yes that, how is it going?",
    "Right, here is the plan...",
    "Yes right, well anyway... This is good news, give it a few days and the slave pens will be full again.",
    "I want to reward you for your efforts but you don't have any room in your inventory. Talk to me again when you do.",
    "I guess you have proven yourself now, I will tell you of our discovery.",
    "Not long after we convinced Lathas that it was a good idea to let us run West Ardougne, we found evidence that somewhere under the mountains to the West is a place of ancient power.",
    "We have been using those we take from the city to help us dig down to it. Unfortunately we have opened up a few old caverns infested with beasts.",
    "We lose a few slaves every day to them, we had better find this temple soon.",
    "Yes... A book recently found tells us of a temple built by the early Elven settlers. The temple was made around an altar of unknown origin. All we know about the altar is that it gives us access to some very powerful magic.",
    "Not really. Like I say, we are here to prepare the way for the Dark Lord, but gaining the power of the temple will speed things up a lot.",
    "Now you know about the temple, I have a new task for you.",
    "But it will have to wait, one of the guards has taken the excavation site key to the locksmith to be copied.",
    "Report in regularly and I will see that you get a copy as soon as he gets back.",
    "No the guard is being a bit slow, but we should have it soon."
  ],
  "Gnome on a rack": [
    "I'm not helping you fix that, as if it hasn't caused enough trouble as it is. Your friends have already tried every torture in the book!",
    "I'm still not telling anyone squat.",
    "Yes, it didn't work.",
    "That's all I've been living on since I got here.",
    "Yes, yes and yes. Tried them all, quite liked the toe nibbling.",
    "Us gnomes aren't wise so we don't get them. Face it, you'll never put me in enough pain that I'll tell you what you wanna know.",
    "I used to play gnomeball as a kid. This is a walk in the park in comparison.",
    "Ha!! You think I'm stupid enough to tell you that I've been craving toad crunchies or that I can't stand having my feet tickled! You're just not going to find out my weakness.",
    "I did? What did I say?",
    "Yes yes!! That was it, I'd HATE that, PLEASE don't do that. By Guthix's beard you Mourners are such idiots! Leave me be moron.",
    "I used to play gnomeball yes....what's that got to do with anything? Nothing that can convince me to help you that's for sure. Go away imbecile.",
    "Oooh... a big SCARY gnomeball. I mean, it might crush me and my entire family, because were[sic] SOOOO small!! They have big teeth and everything don't they? Sheesh. You Mourners will have to try better than that. Now go away. I need some sleep after all these *yawn* scary threats.",
    "Oops... I mean erm... No that must have been some other err... Gnome...",
    "If you think you can just buy my co-operation you're a bigger imbecile than I thought.",
    "No... I said being here is a walk in the park. Where do they get you guys? You must all be Ogre rejects for being too thick. Leave me be idiot.",
    "I've got nothing to say to you!",
    "I told you you can't buy my cooperation... ... but thanks for the snack.",
    "A.. ah... ACHOOO!!!",
    "Ha ha ha... no stop... Heehee... please no more... Teehee... Hoho...",
    "It's not like I'm going to get anything out of helping you, is it? As I figure, that 'artefact' is the only thing keeping me out of the slave pens, where I'd get fed a lot worse than nail and prune stew!",
    "I told you, I'm not going to get anything out of helping you, am I? As I figure, that 'artefact' is the only thing keeping me out of the slave pens, where I'd get fed worse than nail and prune stew!",
    "Alright... alright I'm beaten, bring me some soft leather and a log from a magic tree and I'll see what I can do!",
    "You beastly little blighter!",
    "You got everything? Magic log, Soft[sic] leather AND the crunchie you offered.",
    "Well when you have it all I'll fix that thing, but please don't tickle me any more.",
    "Well let me up off of this rack and I'll get started, I can't do anything while I'm all tied up.",
    "Oi! There's no need for that, I already agreed to help.",
    "Ho ho ho... no more... Teehee... please stop... Hoohoo... he he he... I hate you!",
    "You're giving me toad crunchies even though I haven't helped yet?!? Thanks a lot. You know for a Mourner you're not too bad.",
    "Well come on!! Let me up so I can get started, I can't do anything from here."
  ],
  "Gnome": [
    "You're gonna have to wait a bit...",
    "Alright, alright... here you go, take it...",
    "What are you after now?",
    "Does it?",
    "Maybe you should give me more toad crunchies. Ask any gnome, 'toad should be in everything' they'll tell you, mark my words.",
    "What are you after now?",
    "You know what I need... Some soft leather, a magic log and some toad crunchies. I refuse to eat anymore nail and prune stew!",
    "Well when you have it all I'll fix that thing for you."
  ],
  "Congratulations! You have completed": [
    "'Mourning's End Part I' - Complete this quest."
  ],
  "King Lathas": [
    "What are you doing here? All Mourners should know that if they need to contact me, they need to use the proper channels!",
    "Well do not let it happen again."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Mourning%27s_End_Part_I?oldid=36196493’"
  ]
}