{
  "Player": [
    "Have you worked out what happened to the Duel Arena yet?",
    "What makes you think that?",
    "And that caused the collapse?",
    "But who would do that?",
    "Have you asked them what they know?",
    "Not yet.",
    "Did you see anything around here before the arena collapsed?",
    "Did you see anything around here before the arena collapsed?",
    "Hmm... Maybe they've seen something? I can't understand them without a crocspeak amulet though.",
    "Did you see anything around here before the arena collapsed?",
    "I'm trying to find out more about the collapse of the Duel Arena. Did you see anything strange beforehand?",
    "Aviansie? Are you sure?",
    "Uh...no! Thanks for your help!",
    "You again! What do you two want?",
    "Shut up, both of you. Are you going to help me or not?",
    "I don't have enough backpack space for that.",
    "Er... Nothing.",
    "I still need to speak to Azzanadra.",
    "Not today. I need your thoughts on something.",
    "The Duel Arena has been destroyed. I'm investigating how it might have happened, and found-",
    "I found evidence linking the Zarosians to the destruction. Were you behind it?",
    "I found this in the ruins. I think someone is trying to frame the Zarosians.",
    "I don't have the evidence with me.",
    "What?",
    "Who do you mean?",
    "Do you have any idea who might have done, then?",
    "Some sort of earthquake. The entire area has been buried.",
    "He's fine. We uncovered the relic and now he's guarding it and overseeing the recovery efforts.",
    "He's not bringing it here until he knows what happened at the arena.",
    "Not yet.",
    "I'm talking to the gods to see what they know about it.",
    "We found it, but the shrine it was hidden in was destroyed before we got there. I'm trying to work out how that happened.",
    "Thankfully, yes. And the relic survived too.",
    "It might help us, for now.",
    "Yes! Completely.",
    "It's nothing. Got a lot on my mind.",
    "How do you know about that?",
    "Do you know anything about how it happened?",
    "We're just ruling out the possibility.",
    "We recovered it safely. Icthlarin has it now.",
    "I trust him to do what he feels is right.",
    "So I went to help Icthlarin recover the relic you wanted.",
    "Before we could, the entire area was destroyed.",
    "Icthlarin has it. He's fine, by the way.",
    "When we've worked out what happened at the Duel Arena. Do you know anything about it?",
    "I see. Thank you, Seren.",
    "Not exactly...",
    "I just want to know what happened at the Duel Arena. Something destroyed it.",
    "What do you know about it?",
    "I spoke to all the gods. Now I just need to find Trindine.",
    "I've nearly worked it out. I'll come back when I know what happened.",
    "Yes, and now I'm tracking down Trindine.",
    "What are you doing here?",
    "I don't know what you're talking about...",
    "You could help me, you know.",
    "You've lost me.",
    "Er...",
    "I'll go back to the cathedral. Can you tell Azzanadra to meet me there? I need to get to the bottom of this.",
    "You all asked Icthlarin to recover a relic from the Duel Arena, but the area was destroyed before we got there.",
    "He and I think one of you had something to do with it.",
    "Seren - you want this relic for yourself. I think you tried to get it before Icthlarin.",
    "Azzanadra - you're the weakest one here. I think you tried to take the relic to give yourself more power.",
    "Armadyl - you've objected to us using the relic. I think you tried to stop us from finding it.",
    "Saradomin - you don't trust Icthlarin to use the relic when you think he needs to. I think you tried to take it for yourself.",
    "Zamorak - you don't want alternative to your necromancers being used at the fronts. I think you tried to take the relic to prevent Icthlarin from replacing you.",
    "What's Khazard doing here?",
    "We'll all die! And you'll die with the rest of us!",
    "How are you holding up?",
    "What are you doing now?",
    "So why don't you go?",
    "Don't give up. We're not dead yet.",
    "But... Zamorak...",
    "What's happening now Zamorak has gone?",
    "His forces don't seem to be leaving.",
    "I'll keep an eye on them.",
    "Are you still channelling the eggs?",
    "But doesn't that mean...?",
    "What can we do?",
    "Are you hurt? What happened?",
    "Zamorak destroyed it. I'm sorry.",
    "There's more. Zamorak stopped channelling the eggs. He's gone.",
    "That plan has failed.",
    "Not long.",
    "How are the fronts holding up?",
    "Have you tried siphoning the eggs? The other gods could probably use the help.",
    "How much time do we have?",
    "Zamorak has left. Why don't you do the same?",
    "You...want to save Gielinor?",
    "Yeah."
  ],
  "Icthlarin": [
    "I have my suspicions.",
    "I think someone tried to steal the relic before we could find it. We need to get to the bottom of this, Player.",
    "Come back when you can.",
    "A few strange things.",
    "Never in all my existence have we had an earthquake in the desert. Those rifts we saw - those were signs of a powerful magical disturbance.",
    "And the coincidence of it happening now... it's too convenient, don't you think?",
    "Yes, I'm sure of it. Someone tried to loot Het's tomb for the Eye.",
    "If they attempted to break through the wards without knowing what they were, yes.",
    "I cannot say for certain at the moment, but it seems likely that our allies fighting below may have tried to overreach.",
    "I've been watching the new arrivals closely since the collapse. None of them claim to be representing any god, but I'm not sure if I believe them.",
    "Not yet. I've been too occupied keeping an eye on the recovery efforts and guarding the relic. Here's where I need your help.",
    "Ask around and see what they have to say for themselves. Why are they here? Did they see anything? Someone must know something.",
    "I'll remain here. Let me know when you find anything.",
    "Have you find any clues yet?",
    "Keep asking. Someone must have seen something...",
    "What's going on down there?",
    "What's going on down there?",
    "What's going on down there?",
    "Nothing more than my pride. That insufferable whelp caught me by surprise.",
    "Shadow magic! I should have known. He must have tried to take it before, and the Eye defended itself. He must have escaped.",
    "Mahjarrat! Curse them all to the void they so fear!",
    "And the Eye - what happened to it?",
    "Oh, no. Het, forgive me. I should have kept it safe.",
    "At least now nobody can use it, and maybe that's for the best. We have enough to fight over right now.",
    "Gone? But... they needed all four of them to stop the eggs from hatching. Without any one of them...",
    "...",
    "How long do we have?",
    "I will return to the Underworld. Preparations must be made.",
    "I'm sorry, World Guardian.",
    "You need two Backpack spaces to take your rewards. Talk to me again when you have space."
  ],
  "Anahita": [
    "Before the sinkhole? No. It was very peaceful. We were just minding our own business. Shame to see it destroyed, really."
  ],
  "Dundee": [
    "Not me. I only got it after I heard it. I've never felt the ground shake like that! I came to see what happened."
  ],
  "Churchill": [
    "Grrr. Arghhhh.",
    "Nothing out of the ordinary, sorry."
  ],
  "Stranger": [
    "What do you want?",
    "Actually, I did. A few hours before the rumbling started, I saw some aviansie flying over.",
    "Positive.",
    "Is that all you want? Anything else you need to bother me for?",
    "What do you want?"
  ],
  "Shadow voice": [
    "She's lying.",
    "That's you acting naturally?",
    "Seems like we're solving a case. Don't you want some backup?",
    "Pulling together the threads...",
    "You'll have to be nicer than that.",
    "Well, now. Isn't this interesting?",
    "Obviously. No-one else says goodbye like that."
  ],
  "Light voice": [
    "Act naturally. She's hiding something.",
    "Hush, you.",
    "To help!",
    "Finding clues...",
    "Staging a dramatic reveal...",
    "Of course we can help. Let's have a search around here. That stranger may have left a clue we can use.",
    "Aha! Someone forgot to burn their orders.",
    "I wonder what our friendly Zarosians have to do with this.",
    "It's time to go deeper, Player. Let's see what Azzanadra has to say for himself."
  ],
  "Azzanadra": [
    "Hello again, World Guardian.",
    "Greetings, World Guardian. Here for a round with our mutual icy friend?",
    "I will endeavour to help if I can. Ask away.",
    "Yes? You found something?",
    "That's quite the accusation, Player. Do you have any proof, or should I take you only at your word?",
    "What makes you think that?",
    "I urge you to return to me with it. If someone is working against us, I need to know who it is.",
    "It's fake.",
    "It's a fake. I know precisely whom this is attempting to impersonate, and I know she would never be so clumsy.",
    "Someone clearly wants you to think Trindine had something to do with this. I assure you, she did not.",
    "Hm. A good question. What was the nature of the destruction, exactly?",
    "That must have been the result of considerable power. Curious.",
    "And - Icthlarin...?",
    "Good. It would be a shame to lose him.",
    "I've been informed of his plan. I can only wonder what manner of lost Menaphite magic he'll be returning with.",
    "My own kind's necromantic powers have always disgusted him. I wonder what alternative he thinks this relic will provide.",
    "I cannot fault his caution.",
    "I can vouch for those who have been fighting here with me. I've not had my eye on the cathedral of late, though. It's quite possible that one of the other gods decided to intervene. Go and speak to them, if you're set on investigating this.",
    "Have you spoken to the other gods yet?",
    "Hello again, World Guardian.",
    "Have you spoken to the other gods yet?",
    "Really? Good luck.",
    "Do you need any assistance in the matter?",
    "Let me see....",
    "She's north of the Cathedral, near the entrance.",
    "She's west of the Cathedral, by the Nodon Front.",
    "She's south of the Cathedral, by the Glacor Front.",
    "She's east of the Cathedral, by the Croesus Front.",
    "She's north of the Cathedral, by the Archaeology station.",
    "As you wish.",
    "It can hold for a moment. The World Guardian has something to say.",
    "After everything I have given in this war, you truly believe I would sabotage our efforts?",
    "...",
    "We need that. We need it more than you do.",
    "Hand it over.",
    "Hello again, World Guardian.",
    "You should go see if Icthlarin is safe.",
    "He's long gone.",
    "How could I not see this coming...",
    "I thought that even he wouldn't stoop so low.",
    "Hello again, World Guardian.",
    "We hold. As we must. If we give any indication that our defences have failed, the Elders will eat us all alive[sic]",
    "I would gladly attempt it, but regrettably I don't yet have the constitution to take Zamorak's place. Perhaps if we had a few more decades I could withstand it...but right now, it would destroy me.",
    "Not long, I suspect. But don't despair, Player. I will not let this be the end."
  ],
  "Shadow Voice": [
    "Wait. Do we really think he's behind it?",
    "It could be a plant. Someone might be playing us for a fool.",
    "Thought as much.",
    "He's upset about this.",
    "How nauseatingly earnest.",
    "What terrible acting. She knew before we told her.",
    "His words, not ours.",
    "Ugh. He is insufferable[sic]",
    "And no straight answers...",
    "Well, well, well. Look who it is. Let's see if we can have a chat.",
    "She went west!",
    "She went south!",
    "She went east!",
    "She went north!",
    "Should we tell her?",
    "Guthix gave us something-",
    "Forced us together-",
    "-and shadow-"
  ],
  "Light Voice": [
    "Of course it was him! We've got proof right here.",
    "I thought it was 'obviously' him. Hypocrite.",
    "No, she would not.",
    "He hoped Icthlarin wouldn't find it.",
    "At least he's honest.",
    "Here we go.",
    "Now she remembers what she knows.",
    "Agreed. All that posturing.",
    "I don't know. How do we tell her?",
    "He made us like this-",
    "Light-"
  ],
  "Armadyl": [
    "Hello, World Guardian. I wish we were meeting under better circumstances. This is a dire situation indeed. My full attention is needed here, sapping anima from the eggs. On the other hand... I'm not going anywhere anytime soon. Is there something you need?",
    "Hello again, World Guardian.",
    "How fares Icthlarin in his relic hunt?",
    "Is Icthlarin all right?",
    "I'm...less pleased about that. I don't like the idea of relying on some unknown power to get us out of this.",
    "Are you all right, World Guardian?",
    "You seem distracted.",
    "I understand. Take care, now.",
    "Lady Seren? What's the meaning of this?",
    "Yes. There's more to this, I'm sure of it.",
    "No! I object to it, yes, but - I would never!",
    "Do you have a defence?",
    "You'd act against us? Even now, with the Elders bearing down upon us all?",
    "Lady Seren! You cannot be serious!",
    "If you go you will condemn us all! You think the Elders will spare you?",
    "That is kind of you to ask, World Guardian. I am alive. For that I am grateful.",
    "Beyond that, though...our circumstances could not be more dire.",
    "Waiting. The eggs can still be drained, though they're becoming so strong...I don't know how much longer I can withstand it.",
    "I shouldn't be here. The others want to fight on, by the looks of things. I see little point in it.",
    "I should be on Abbinah, with my people. So I can help them prepare properly for the end.",
    "I'm not sure. Perhaps it's some small indulgence, the slimmest glimmer of hope. Maybe there's something we can do. Maybe.",
    "Hello again, World Guardian.",
    "I shouldn't be here.",
    "My people on Abbinah...they need to be warned. I must help them prepare for the end.",
    "I'm not giving up. I'm just considering what I can actually do.",
    "Why do you stay? The three of us don't have enough power to stop the eggs from hatching any more. Why do you keep going?",
    "...",
    "I do. You're right. I understand.",
    "Lady Seren? Do you have a plan?"
  ],
  "Saradomin": [
    "Ah. The World Guardian. You'll forgive me if I'm preoccupied. Stabilising the Elders' eggs takes a certain amount of focus. Without wishing to seem rude... What is it?",
    "World Guardian.",
    "I hear the Duel Arena has met an unfortunate fate.",
    "News of such a disaster travels fast. My people in Al Kharid were some of the first on the scene, looking for survivors.",
    "An earthquake, was it not? Or...ah, I see. You suspect some divine involvement?",
    "A sensible choice. But I'm afraid I cannot help. My forces are completely occupied at the fronts. Even if I wished to interfere, I simply don't have the resources for it now.",
    "What of Icthlarin's prize?",
    "Hmm. I admire his intentions, but...",
    "I must wonder if he is best placed to wield it. It has familial baggage, and his judgment is marred by his domain in the underworld. If he had to use it...I wonder if he could.",
    "As do I. But is that what we need?",
    "Who?",
    "Is this power so important that you'd lay waste to a city for it?",
    "It's not beyond you.",
    "Acting against your own allies? You'd better have a good explanation for this.",
    "Lies and slander. Who put that idea into your head?",
    "Colour me unsurprised.",
    "This isn't a game, you rat-",
    "Don't tell me he's right?",
    "I see this hurts you, Seren, but you need to make a choice. Them, or us.",
    "You wouldn't dare.",
    "World Guardian.",
    "'Gone.' No, say it like it is. He abandoned us to die.",
    "There I was thinking this was enough to make him see some sense. That, maybe, he had a shred of reason. But no - condemns the universe for his own pride.",
    "Should we survive this, World Guardian, his execution will be my first priority.",
    "Yes, I noticed that too. Perhaps they know a little better than their master.",
    "Or perhaps they're just here to find a fight. Some test of strength, or other such nonsense.",
    "Not that it makes much of a difference. Either way, they're uncontrollable.",
    "They've not caused trouble yet, but should they turn on us, we will not hesitate to kill them.",
    "Are you giving up so easily?",
    "Then go. None of us will stop you.",
    "I stay because we have not yet fallen. Today, Gielinor lives. As long as it does, I will defend those who call it home.",
    "What was it you said to us? That mortals have their lives destroyed in our names, while we stand idly by?",
    "Well, stand by if you must. By all means, flee home and let death come to you.",
    "But I will not let the faith of my people go to waste. I will do what I can to extend the days we have left.",
    "If we are to die, I will die fighting at their side. Not wallowing in my own self-pity.",
    "Ah...I spoke too harshly. I apologise.",
    "Don't be ashamed, Armadyl. Your fear is real. I feel it too.",
    "But we are gods. We have power whether we want it or not. The only thing that matters is how we choose use[sic] it.",
    "So, choose to run if you want. Or choose to stay and help me claw back a chance of survival.",
    "Do you understand?",
    "Seren?",
    "How much longer do we have?"
  ],
  "Seren": [
    "Stop there! World Guardian you may be, but you are still only human - and all too mortal. The energies the other gods and I are channelling are beyond your ken, and difficult even for us to control. So please - keep your distance. You are too valuable to lose. Was there something you needed?",
    "Yes?",
    "Yes? Did you find it?",
    "Destroyed!",
    "And the relic...?",
    "Do you know when he can bring it here?",
    "Well...",
    "I sent some scouts to the area before Icthlarin arrived, to make sure it was safe. We all know what some around here would do to obtain that power. But they did not report seeing anything strange. To them, all seemed calm.",
    "Please - once you are done, get Icthlarin to hurry back. We're running out of time[sic]",
    "Azzanadra? What are you doing here? We need you at the front.",
    "You believe I did this?",
    "Peace, Saradomin. Let us hear him out.",
    "Can you not see the necessity of it, Armadyl?",
    "The relic rightfully belongs to Icthlarin, Saradomin. We can't take that from him, no matter our doubts.",
    "Zamorak. Please, be honest with us. This is no time for sabotage.",
    "What else can I do? We need more time.",
    "I cannot sanction the execution of unborn innocents, and I cannot let this battle spread to the surface. There has to be a balance, somehow.",
    "Please - stand with me. Help me find the middle way. Nobody else has to die.",
    "That's not what this is, Zamorak. Don't twist my words.",
    "I have to preserve them. Their death would be senseless.",
    "No!",
    "Yes. To stop entirely would mean catastrophe. But with only three of us, we cannot stop them from growing. Rather than hold them back, we now only delay the inevitable.",
    "Without Zamorak's efforts, they will hatch. Yes.",
    "The Elders don't seem to have sensed it yet, or we would be dead. But they will. It's only a matter of time.",
    "I...don't know.",
    "Yes?",
    "...",
    "They're so close to hatching. I can feel it. They're so...alive.",
    "Not long.",
    "The Children are coming. Can't you hear them sing?"
  ],
  "Zamorak": [
    "Away, vermin! I can scarcely concentrate with humans skittering around my- Oh. It's you. What is it?",
    "What?",
    "What do you want? No, wait, allow me to guess. Something has befallen your canine friend.",
    "And thus the accusation, as always, falls on me.",
    "The entire arena? Impressive.",
    "Nothing.",
    "Trust me, if I intended to harm Icthlarin, he would be in pieces scattered between here and Forinthry. You know his family's history with mine.",
    "This is some petty quarrel by comparison, unworthy of my power.",
    "Next time, do not fail me on your first attempt.",
    "Oh, don't look at me like that, Azzanadra.",
    "Can't you see what Seren is doing? You know why she wants this relic, don't you?",
    "Or has she already blinkered you as thoroughly as Zaros did?",
    "She would keep us here until the end of eternity.",
    "All of us. Not just us gods - everyone who came here to fight. Entombed until the suns die.",
    "What a sorry fate. To live and fight and die and live again, over and over. A perfect closed loop. All of us imprisoned here at her pleasure.",
    "Are any of you prepared to tolerate that? An endless, unchanging war, with no chance of victory?",
    "All to keep these eggs safe from harm, after she deceived us into thinking there was a greater plan?",
    "She's already made that choice. She would sacrifice us all to save them.",
    "Says she who condemned my tribe to ritual sacrifice.",
    "No. Enough of this. No more pretending. No more waiting to be saved in a perfect crystal prison.",
    "Never again.",
    "If you won't break this stagnation, fine. See how long you last without me.",
    "But I will die free."
  ],
  "Trindine": [
    "I wish you could have seen this city in its prime. It used to be so beautiful.",
    "Seems we need to talk in private.",
    "So, someone is trying to frame me?",
    "I heard everything you told Azzanadra. Divine sabotage of Seren's grand plan! That's juicy.",
    "You're making a good effort, by the way. The World Guardian's first baby steps into espionage. I'm very proud.",
    "Hm. No. I've got better things to do than provoke gods. That's more of a World Guardian responsibility, I think.",
    "Before you go... I've been meaning to ask you something.",
    "Your shadow. I've never seen one so strong in a human. How'd you do it?",
    "I guess humans can't see it, can you? Magical fields, auras, whatever you want to call them. They're invisible to you. I'll try to explain...",
    "I've known many mortal shadow-mages. I trained some myself, back in the Empire. Most only ever managed to dabble - it's rare for any to reach anything resembling competence. Not like Mahjarrat. We're natural masters.",
    "Those mortals who do manage it, though...they change. Their auras change, and grow a shadow. My people are made of magic. We see it as naturally as you see sunlight. So we notice these things.",
    "When you found me in the vault of Kharid-Et, I mistook you for someone else. For a true master of shadow who is now long dead. And for a while I didn't understand why I thought you were him.",
    "I do now, though. It's your shadow - it's a[sic] strong as his. Utterly saturated. How did you learn that?",
    "I guess that's pretty personal. You don't have to tell me. It's strange, that's all.",
    "What are you going to do about the gods?"
  ],
  "[Light Voice and Shadow Voice": [
    "] -entwined."
  ],
  "General Khazard": [
    "I have the Eye, father.",
    "That wretched dog had no idea what hit him.",
    "Yes, father."
  ],
  "Congratulations! You have completed": [
    "'Eye of Het II' - Complete this quest."
  ],
  "You have completed": [
    "'Solve a mystery' and gained progress towards the Oasis Restoration event."
  ],
  "Avaryss, the Unceasing": [
    "Our lord's absence does not affect our task. We hunt, and we slay - in Zamorak's name."
  ],
  "Enakhra": [
    "What is it?",
    "Well, silly me! Why ever didn't I think of that?",
    "You don't just walk away from a fight with an Arch-Glacor, World Guardian. If we are to retreat without being summarily crushed, it must be carefully coordinated.",
    "Besides... Some of us still live here.",
    "This world is rife with folly, weakness and wasted potential.",
    "But it is...not without its charms.",
    "I will not let it die. Not while I have any other choice."
  ],
  "Hazeel": [
    "Lord Zamorak's departure has changed the situation somewhat. Begone - I must think on what this means."
  ],
  "Kril' Tsutsaroth": [
    "Zamorak has left, then.",
    "No matter. He knows that he can leave this fight to his most trusted warriors.",
    "Until I am called elsewhere, I shall wreak ruin upon this battlefield.",
    "Die, Nodon! The Lord of Chaos demands your slaughter!"
  ],
  "Nymora, the Vengeful": [
    "Lord Zamorak may have left, but there is work to be done here yet. To the hunt!"
  ],
  "Zemouregal": [
    "Hmph. I can only raise these ragged corpses so many times. If Lord Zamorak has retreated to formulate a plan, he had best reveal it soon."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Eye_of_Het_II?oldid=36198244’"
  ]
}