{
  "Postie Pete": [
    "Hey, Player!",
    "I've delivered a package to your player-owned house. The delivery note is stuck to the player-owned house portal!",
    "No thanks necessary, Player. Now I've more post to deliver!",
    "Not if I see you first!"
  ],
  "Player": [
    "Thanks, Pete.",
    "See you around!",
    "Let's have a look here...",
    "Oof!",
    "Repairs?",
    "How much is all this going to cost me?",
    "Is it that much of a widespread problem that the policy needs to include it?",
    "That's fine. I was about to have a quiet word with him anyway...",
    "That's fine, here, take it. Good day!",
    "Who sent you? Why did you attack me and smash up my stuff?",
    "We'll soon see about that!",
    "I'll be back to finish the job later!",
    "I can't do that yet!",
    "Wet willy!",
    "Nose pinch!",
    "Pig nose!",
    "Shake!",
    "Yo momma has enough chins for 99 ranged!",
    "You've got no-body to help you!",
    "Face it, you're finished!",
    "Stand up and face me, if you can!",
    "You're head-ing for a beating!",
    "Tell me what you know! Who sent you?",
    "Give me the name!",
    "Rabid Jack!",
    "What are his plans? Tell me, now!",
    "...",
    "Where's the factory? Where are they being made?",
    "Aaaaaaargh! I need to warn Bill Teach as soon as possible!",
    "And you're coming with me.",
    "Now I need to go and warn Bill Teach before it's too late!",
    "Never! You're coming with me to Bill Teach!",
    "Bill, I have urgent news about Ra-- About 'You-Know-Who'.",
    "Alright, Bill, where should I meet you?",
    "Hang on, what?",
    "Alright... I guess...",
    "A Long Drop.",
    "Aye, drop me...",
    "Aaaaah!",
    "Why is it that whenever a pirate tells me to go somewhere I end up with a headache?",
    "I've got urgent news about Rabid Jack!",
    "Dammit, Bill! We don't have time for that! Listen to me!",
    "I was attacked in my house by an assassin. Part zombie, part pirate, all mechanical and all evil. He claims he was sent by 'You-Know-Who', and is one of an army being built to attack Mos Le'Harmless!",
    "Yes, I do have... evidence.",
    "Bill?",
    "Well, I was in my house... ...and then I brought his decapitated head here to you.",
    "That's why I brought him here. I subjected him to brutal torture, but he wouldn't give me the location of the factory where the army is being built.",
    "What is it, Bill?",
    "Okay, so you need me to go and pick it up. What am I getting from him? A head vice? Or maybe flesh-eating ants? Ooh, is it hot pokers?",
    "You want me to ask Braindeath for a Twiblik Night Special?",
    "What is it?",
    "Wow, that's handy. Thanks Bill!",
    "What was that?",
    "What was I supposed to be doing again?",
    "Right. I’ll be on my way. You two enjoy your date!",
    "Nothing. I'll be on my way.",
    "Ow!",
    "I'm here on behalf of Bill Teach. We have an urgent situation unfolding, and he has asked that I requisition...",
    "...",
    "...the Twiblik Night Special.",
    "You don't seem too pleased to be telling me about this.",
    "How long have the brewers been missing for? Where were they last seen?",
    "Hmmm, so if I rescue these brewers, you'll prepare the Twiblik Night Special for me to take to Bill Teach?",
    "I've left my diving lot in the bank.",
    "Thanks, Cap'n!",
    "Nothing, I'll be on my way now.",
    "Looks like this brewer didn't make it. I'll see if I can find his name badge.",
    "That's all three of the missing brewers. I should bring the news to Cap'n Braindeath. If only it were happier news...",
    "I found the three missing brewers...",
    "Rory, Jimmy and Trent - all dead. I'm sorry...",
    "Well, the place was full of zombie surgeons injecting 'rum' into the wildlife. The crabs down there are giant and very, very aggressive now.",
    "Yes, I'm ready.",
    "I, Player, swear to thee...",
    "...what happens at sea, stays at sea.",
    "None shall learn of 'The Oath' from me...",
    "...and if anyone does, Cap'n Braindeath will...smash my face in?",
    "With...an...anchor?",
    "And he's...he's... He's very definitely not kidding!",
    "Um… cap’n…. I… I lost the Twiblick Night Special.",
    "How could I ever forget it?",
    "I have it! Whatever it is...",
    "Yes.",
    "I did. It was a particularly brutal oath that I don't intend to break.",
    "The moment of truth has arrived.",
    "What in the world?",
    "I...guess I need to talk to Bill Teach about the plan now, but I'm not sure I want to...",
    "So, uh, I opened the Twiblik Night Special...",
    "I'm a little hesitant to ask, but... Why do you have a secret box full of women's apparel?",
    "With an anchor! No, no, I didn't forget! How are we going to use this to get information?",
    "Come again?",
    "With pleasure.",
    "You're going to be so pretty when we're done, you'll turn heads!",
    "Tell us what we want to know or you'll get more pampering, you pretty little thing, you!",
    "Wait, what?",
    "Um...Bill?",
    "Do we know where we're sailing to now?",
    "Then let's hit the waves!",
    "Yes, let's get underway.",
    "What? But the zombie head! He told me himself he's involved!",
    "So, if I get conclusive evidence of his involvement in all this, will you finally actually do something about it?",
    "Argh! What's happening?",
    "Where did that attack come from, Bill?",
    "How are we ever going to get to the island now? We'll be sunk for sure if we try sailing in.",
    "I knew you'd think of something, cap'n! What is it? Oh, I can't wait to hear this!",
    "I'm...I'm not going to like this, am I?",
    "Yes, that's true enough.",
    "Go on...",
    "And then?",
    "...",
    "You want me to make a cannonball barrel-boat, sit on the barrel, and then fire it across the sea to the island using a cannon.",
    "Are you quite mad?",
    "But won't that really, really hurt?",
    "Awesome! I'll get right on it!",
    "Thanks! Wait... Aw.",
    "Here's an idea: YOU do it!",
    "Um, yes?",
    "Um, yours, cap'n?",
    "No, cap'n.",
    "Me, cap'n...",
    "Can you remind me how I’m supposed to be doing this?",
    "And then?",
    "At least there’s method to this madness…",
    "Sweet.",
    "I have prepared the cannonball barrel-boat for travel to the island.",
    "What should I do when I land on the island?",
    "Swimming back?",
    "Oh, yeah... Are you even sure this will work?",
    "It's what makes it so terrifying for me... This is going to be fun!",
    "Well, here goes...",
    "AAAAAAAAAAH!",
    "Oof!",
    "What's this?",
    "Uh... Do I know you?",
    "It's still escaping me, I'm afraid.",
    "What?",
    "No! It can't be! The seagull from The Rock that I fired at Young Ralph's head!",
    "So... What are you doing here?",
    "Uh... Yes! I'm so deeply sorry!",
    "No, it was just my ride in.",
    "So, what's the nature of this proposal you mentioned?",
    "What do you mean?",
    "But how can we beat them?",
    "I'm ready to begin.",
    "I've been thinking the same. I'd be flinching and avoiding imaginary cannonballs every time I head a 'squark' otherwise.",
    "I was just about to, actually. Before you suggested it!",
    "The guns are disabled, cap'n. It's safe to approach the island.",
    "Well, the 'guns' turned out to be barrelchests patrolling the beach with their cannon-arms.I couldn't get close or I'd have been splatted by their anchors, so I telepathically communed with a seagull, the nefarious Baron von Hattenkrapper, and controlled him to drop cannonballs on them.",
    "Can you take me to Bloodsplatter Isle?",
    "Argh... Sleepy...",
    "Cap'n...I've a problem.",
    "What? No, I mean there's a problem with the investigation. The complex is heavily guarded by zombie surgeons using precision-thrown sedatives - I can't get inside.",
    "There's a storage area just inside the complex I can access. It had a bunch of medical supplies, and what looked like a dismantled barrelchest on a shelf.",
    "Aye, cap'n!",
    "I've gathered the things you asked for.",
    "Aye, cap'n!",
    "Wait...what's that on top?",
    "...",
    "Well, I guess it's time I take her out for a spin.",
    "I've performed some heavy sabotage on the facility and accrued a lot of evidence pointing to the involvement of Rabid Jack, and backing up the story about the attack on Mos'Le Harmless.",
    "Alright, cap'n. Time to finish in their house what they started in mine...",
    "Aye, cap'n!",
    "If I turn this machine on the conveyor belts will start, and I should be able to send explosive kegs along them into the machinery. Any nearby guards will hear me...",
    "Hold it right there, evildoers!",
    "Come back here!",
    "I need to catch them somehow!",
    "Hmmmm!",
    "Phew. I think I stopped them all. Time I sailed back to The Adventurous to talk to Bill.",
    "Weigh anchor! TOOT TOOT!",
    "Thanks, cap'n.",
    "Well, it has, cap'n, and we need to do something about it. What should we do next?",
    "What became of our pretty little friend?",
    "What do you need me to do, cap'n?"
  ],
  "WARNING": [
    "Some players may find the following scenes distressing. There are no kitten cutscenes to protect your innocence this time."
  ],
  "Large crate": [
    "Heh heh heh..."
  ],
  "Barrelchest Mk II": [
    "Surprise, Player!",
    "Prepare yerself!"
  ],
  "Any pets the player has": [
    "Eep!"
  ],
  "Estate agent teleports inPlayer": [
    "What are you doing here?"
  ],
  "Estate agent": [
    "I'm just here to make sure the repairs are all satisfactory.",
    "Yes, I heard all the commotion and sent out our repairmen. They should have restored everything in your house to the way it was before your little incident.",
    "Cost you? Nothing at all. This is all on insurance!",
    "Luckily for you, the standard player-owned house contents insurance policy was recently updated to include acts of zombio-mechanical piracy.",
    "In all honesty, no. I never thought it would happen, so I put it in to make the list of covered circumstances seem more attractive. So I took a gamble and lost on that one.",
    "Ah, well. You can't win them all! Unfortunately, the insurance policy doesn't include removal of the perpetrator of the attack. You'll have to deal with him yourself.",
    "In that case, I shall bid you good day, and return to the office. I'll just be taking that delivery note. As evidence for your claim, you see.",
    "Good day!"
  ],
  "Zombie head": [
    "I'll never tell ye anything!",
    "Arr! Ye've made me nose sore, cretin!",
    "Aaaaargh! Me poor, sore nose!",
    "Leave me mother out of this!",
    "Do ye think I'm scared of ye?",
    "I'll never tell ye anythin'!",
    "Say that to me face!",
    "Is that supposed te be funny?",
    "Arr! Enough! I'll talk!",
    "Ye've made some powerful enemies thanks te that inquisitive nose o' yours, Player. I was sent here te eliminate ye on behalf o' the one most powerful.",
    "Ye know of whom I speak, Player! Captain of This Albatross, condemned te the depths by those friends a yourn. He's back to wreak his vengeance on all o' ye!",
    "Aye, Player. Ye've caught his eye now, with all the trouble ye've been causing us.",
    "I'm one o' many, Player. Tell me how ye think Mos Le'Harmless will fare against an army o' us barrelchests!",
    "That's right! They be bein' made even as we speak! Ye're doomed! All doomed!",
    "I'll never tell ye, even through torture worse than ye've already given me!",
    "What? Ye can't be serious!",
    "Ye can't treat someone like this! Argh, there be fluff in the bottom o' your bag! It be gettin' in me nose!",
    "Let me out of this bag, curse ye!",
    "Come back for more, have ye? I'm not scared o' ye!",
    "What're YE lookin' at?",
    "Hah! Ye'll never get me te talk, ye great Jessie! What do you think you can do that'll scare a dead man's head?",
    "Twiblik Night Special? Hah! Whatever that be it don't scare me!",
    "Aye, come again?",
    "Wait, let's be reasonable about this...",
    "No! Ye can't!",
    "Y-ye don't scare me!",
    "No! I don't want te be pretty!",
    "Isn't that a bit middle class fer a zombie?",
    "No a fringe! It'll itch me forehead an' I cannae scratch it!",
    "Pigtails? Do I look like a schoolgirl?",
    "I like me cheeks as they are: necrotic!",
    "No! I don't want te look fake-tanned!",
    "Purple? Are ye makin' me a non-conformist?",
    "Ye'll not stop until I'm wearin' all black an' worshippin' Zamorak, will ye?",
    "But blue eyeshadow won't go with me dead, empty eyes!",
    "Green won't be so bad, I guess. I'm already gangrenous.",
    "But everyone'll think I'm a harlot!",
    "No! A zombie pirate should ne'er be pretty in pink!",
    "I'm dead! Me lips already be blue!",
    "Stay back! Leave me be! No... Just no! NOOOOOOOOOOOOOO!",
    "Alright! I hope ye're listenin' well. Ye need to start out sailin' with a relative bearin' of two-hundred-and-twenty-three degrees from Harmony and carry on for five hundred cable lengths.",
    "If ye look east, ye'll see a beacon just within yer arc of visibility. Sail directly toward it for 120 fathoms, then bear starboard hard - and I mean HARD. Ye'll see a rock formation; ye need to be listing on yer beam ends to get yerself under it and find yerself in a lagoon.",
    "Aye, the very one. Ye need te sail straight out the other side, then clubhaul starboard as soon as ye hit open water. Sail round the reef, makin' sure ye stick close te land, and ye'll see the island in the distance.",
    "That be where ye're aimin'.",
    "Aye, what's yer point?",
    "I were hopin' ye'd take the long way round and sink on yer way.",
    "No! Anythin' but that! I'll be straight up with ye from now on, I swear!",
    "Hey! Zombie heads are people too, ye know!",
    "Ye didn't expect them to roll out the red carpet and just let ye sail on in, surely?",
    "Ack!",
    "Alright! I get the picture!",
    "Mmmmff! Mm mmff mffmffmm!"
  ],
  "Bill Teach": [
    "I can tell from yer eyes that this be no jokin' matter, lad. I think we should go somewhere more private te talk. Y'know, save panicking the locals and that."
  ],
  "Bill": [
    "There be a particular seat In Joe's House o' 'Rum', in the corner. Ye'll know it when ye see it. Sit in that chair an' ask Joe for a 'Long Drop'. He'll ask ye if ye're sure. Ye reply 'Aye, drop me'. Joe is in northern Mos Le'Harmless.",
    "Trust me, Player.",
    "Nice entrance, lad!",
    "I'm sure I have no idea what ye mean, Player. Now, te business. What is it ye wanted te tell me?",
    "Why can't ye ever learn not te say that name, lad?",
    "Ye're worrying me, Player. I've never seen ye this riled. Tell me what's happened.",
    "That be a tall tale, lad. Ye know our rules and customs regardin' this amtter, the oath we all swore. I trust ye have evidence?",
    "Well, then, let's see it! Put it on that table over there.",
    "...",
    "I'm just thinkin', Player...I wish I could say this is the weirdest thing that we've been through together. But it's not. Come on there, lad. Tell me what's goin' on.",
    "Lad, if what ye're sayin' be true, we all be in grave danger, and we need te act now.",
    "Well, Player, fortunately there be more than one way te skin a cat, an' I happen to know quite a few of 'em meself.",
    "I never said I planned to scare ye. Player, I need ye te do me a favour.",
    "I think I can get our friend here te crack his lips fer us, but I need some 'special equipment' for the job. Equipment I happen to know Braindeath has in abundance.",
    "Somethin' far worse'n all o' those combined. Somethin' so terrifyin', details cannot be divulged. Ye need te ask Braindeath for a... 'Twiblik Night Special'.",
    "Aye, Player. A Twiblik Night Special. I cannae tell ye of its unspeakable contents or the horrific things it has inflicted upon the world until ye prove to me an' Braindeath ye can be trusted to keep it a secret, but he'll entrust you with its transport te me as long as it's securely locked. Bring it back here te me when ye've got it.",
    "Here, Player. Take this.",
    "It be a spell sheet containin' two ancient piratical spells. One can teleport ye from Mos Le'Harmless to Braindeath Island, the other does the reverse.",
    "Side effects may include minor headaches.",
    "Oh, nothing. Get goin', lad! Time is not on our side!",
    "Aye? What is it, Player?",
    "Ye need to go and see Braindeath and acquire the Twiblick Night Special, an’ I’d prefer if ye did it quickly, lad. Our friend here doesn’t make great company.",
    "It’s alright, Bill. Chances are ye’ll be dead soon, an’ then it all be over.",
    "Right ye are, Player.",
    "What is it, lad?",
    "Ye have it?",
    "Hand it here, Player. Ye swore 'The Oath', didn't ye, Player?",
    "Good. Then I'll unlock it for ye. ... There. It is done.",
    "Open the Twiblik Night Special once ye've mentally prepared yerself. Then come back here.",
    "So I see, lad.",
    "What happens at sea, Mr Player, stays at sea. Or did ye forget 'The Oath' already?",
    "We're goin' te give our friend here a makeover, lad.",
    "We're goin' te make ye the prettiest thing te ever sail on several seas...",
    "And then we be goin' te parade ye around in front of yer old crew...",
    "Well, lad? Would ye do the honours o' choosin' how we beautify our friend here?",
    "Right then, Player. Time to choose how we make our guest here pretty.",
    "First off, choose a wig! Shall we give her a bob, a bun, a fringe or pigtails?",
    "Now on to some colour for those cheeks, but what colour shall we pick, Player?",
    "We need to bring out those eyes, but which eyeshadow would go best on our friend here?",
    "Now we need to make those lips kissable! Well, lad?",
    "Well, I think that's everything, lad. What say we get started?",
    "Aye, some stomachs too.",
    "Right, lad. Time te ask our lady friend here where she comes from, savvy?",
    "Don't interrupt him, lad! So, we sail south of here for 50 nautical miles, then what?",
    "Not the lair o' the many-tentacled beast of unpleasant encounters?",
    "Hang on a second, that'd put the factory on Bloodsplatter Isle.",
    "Bloodsplatter Isle be cardinal south from here! Why didn't ye just say so?",
    "Ye be dangerously close te another makeover, petal. I'd watch meself if I were ye.",
    "What is it, lad?",
    "Aye. Cardinal south. We'd have found the place quicker if we'd set sail without asking our hairdresser's practice dummy here fer directions.",
    "Well, Player, what're ye waitin' for? Meet me aboard the ship. We can talk all ye want when we get where we're goin'. Are ye ready te go, lad?",
    "Right ye are, Player.",
    "Aha, there ye are, Player. We'll be approaching Bloodsplatter Island soon. I have to tell ya, lad, I'm still hopin' ye're wrong about You-Know-Who bein' involved in all this.",
    "Aye, so ye say, but he never mentioned that same te me. Don't fret though, Player. We're on our way to investigate and shut down the facility now. If You-Know-Who is really involved, ye'll find the evidence needed to prove it while ye're there, no doubt.",
    "Aye, lad. If ye get me somethin' that backs up what our makeover mannequin said about this bein' a planned attack on Mos Le'Harmless, action will be taken, ye can rest assured o' that.",
    "We be approachin' visual distance to the island, Player. Ye'll have yer answers soo-",
    "INCOMING!",
    "We be under fire, lad! Hang on te somethin'!",
    "Phew. That were a close call, Player. We're lucky te not be sittin' pretty at the bottom of the sea right now.",
    "Seems our guide forget[sic] te mention the welcoming party. We were fired on from the island itself.",
    "Ye really are tryin' my patience, devil. I suggest ye realise the gravity of yer predicament. I'd hate te have te pierce yer ears.",
    "Nice big gold hoops. They'd look just darlin' on a gal like ye.",
    "Aye, that we will. I have a plan though, Player.",
    "Now, afore I go about tellin' ye, ye has te promise te hear it out, all the way to the end, before ye start objectin' and complainin'.",
    "Depends on how healthy yer sense of adventure is, lad. Now, here's the plan... We can't very well sail on in te dock. As ye've rightly pointed out, because we'd be riddled with holes and sunk before we made it halfway there.",
    "We also have limited resources on this ship. All we have te hand is cannons and cannonballs, gunpowder, some crates and barrels and some chains. Now, I've a plan involving these objects that ends up with ye on the island.",
    "What ye'll need te do is use some o' the gunpowder to flash-heat a chain and smith it to a cannonball. There be a hammer an' anvil in the hold along wi' plenty of powder, cannonballs and chains. Then ye need te attach the other end of the chain te one of the empty barrels.",
    "And then, ye sit on the barrel an' ye put the cannonball in the cannon wi' a double dose o' powder...then fire yerself te the island on it.",
    "Well, lad?",
    "Aye, that's about the size of it, lad.",
    "Nay, lad, I'm COMPLETELY mad. Bein' at sea with ye has done that to me. But regardless o' me mental state, this needs to be done. There be no other way.",
    "What're ye askin' me for? Ye think I've done anythin' like this ever before? Ye'll be a pioneer, lad. And anyhoo, there's no other way to the island, so it's got te happen.",
    "That's what I like about ye, lad. Ye're always enthusiastic, and ye're daft as a box o' frogs.",
    "Nice ship ye're on, isn't it, Player?",
    "Remind me again whose ship it is?",
    "Do ye want te swim home?",
    "So then, who's makin' the cannonball barrel-boat and bein' shot to the island?",
    "I'm glad that's settled.",
    "What ye'll need te do is use some o' the gunpowder to flash-heat a chain and smith it to a cannonball. There be a hammer an' anvil in the hold along wi' plenty of powder, cannonballs and chains. Then ye need te attach the other end of the chain te one of the empty barrels.",
    "Then come up here and load the cannonball into the cannon, and you’re ready fer yer little trip.",
    "Well, lad, all ye need te do now is load two doese o' gunpowder, grab the barrel, fire the cannon and hold on fer dear life.",
    "Well, assumin' ye're still ali-, er, awake, if ye can knock out the guns on the beach that be firin' at us, that'd be a good start. Means I'd be safe te drop ye off and pick ye up with the ship from now on instead o' this cannon malarkey or ye swimmin' back.",
    "Well, I cannae exactly sail in an' pick ye up. We're goin' through all this effort te avoid me ship gettin' riddled wi' holes, in case ye didn't remember. If ye need te get back te the ship before the guns are disabled, ye'll be swimmin', lad.",
    "No, but that's what makes it so excitin' fer me!",
    "Aye, it almost certainly will be, lad. Fer me, at least.",
    "Ye're back, lad. How are ye gettin' along disablin' those guns?",
    "That's good te hear, Player. How did ye go about it in the end?",
    "... Just fer once, couldn't it have been somethin' normal? Like smashin' 'em with a big hammer? Ah, well. It's good news nonetheless. Want me te drop ye off, lad? Ye can start yer investigatin' now.",
    "Aye, Player. I'll drop ye off. Signal me from the dock if ye want picking up.",
    "Well done fer finally admittin' it, lad. That's half the battle.",
    "That certainly is a problem, lad. Couldn't ye get in at all?",
    "That gives me an idea, lad. Ye could walk freely around the complex if ye looked like one o' them, I'd wager. Ye're goin' te need parts for yer disguise. Go and grab a roll of bandage, a surgical mask and a bundle of parts from the storeroom, then grab a barrel from me hold. Once ye've got all that, come see me, and we'll build ye a disguise!",
    "Good work, lad. Let's knuckle down and build ye a disguise then, shall we?",
    "Right, take that there thingummy and jam it on that hoozit... And now fer the finishing touch...there! We're done, Player.",
    "That be our pretty little friend, lad! Finishes the disguise nicely, don't ye agree? And she'll keep her mouth shut too - I stuffed it wi' bandage and stuck that mask on te make sure o'that.",
    "Aye. Ye should be able to wander about inside the facility freely now, so get back in there and get investigatin'.",
    "Let's see it then, lad.",
    "This is grave news indeed, lad. Ye need te go an' finish the job afore it's too late. Ye shouldn't need te wear that barrelchest disguise inside any more, Player. Ye've wiped out all the guards now. I'll keep it wi' me in case we need it in future.",
    "Here, Player. Take these, and level that production line!",
    "I saw the battle from here, Player. Good sailing.",
    "Come on, lad. We cannae do any more damage around here. Let's sail back te Mos Le'Harmless an' meet in Joe's basement. Joe's is in northern Mos Le'Harmless.",
    "Well, lad, ye did it. Ye stopped the attack on Mos Le'Harmless, an' ye've proved te me that You-Know-Who is back. I had hoped this day would never come...",
    "It be time te prepare now, Player - te prepare fer war! I need time to make the necessary arrangements and gather the captains together. Without Gentleman Mallard, the council will be needin' a new head. I guess it's up te me, since it's only me ye've shown that You-Know-Who has returned. Thanks fer that, lad. Guess I should get started.",
    "I've kept her in custody, Player, along wi' yer disguise. We may just need it again one day.",
    "Ye've done more than enough fer now, [player name]. Ye train yerself up and prepare. When the time comes, I'll contact ye. Fer now, ye just enjoy yer victory."
  ],
  "Joe": [
    "What'll it be?",
    "Ye sure?",
    "Take a seat."
  ],
  "Chatbox": [
    "Bill hands you a scrap of paper.",
    "Braindeath hands you some diving gear.",
    "You find the brewer's name badge, his name is Rory/Jimmy/Trent.",
    "Captain Braindeath hands you a securely locked chest.",
    "The Twiblik Night Special is now unlocked...",
    "You have created a cannonball barrel-boat!",
    "You hand Bill the file and he skims through it.",
    "He finishes reading, and hands it back.",
    "Bill Teach hands you a stash of powder kegs."
  ],
  "Zombie Head": [
    "Say that te me face, ye barnacle-covered bilge rat!"
  ],
  "Captain Braindeath": [
    "Hey there, lad. What can I do for ye?"
  ],
  "Braindeath": [
    "...",
    "...",
    "These be dire times indeed if we be restortin' to that. No doubt ye've been told that what ye're askin' me for is not a trifling request to be taken lightly. I'd usually drop everythin' te help ye out, ye know that, but I have problems of me own right now, lad.",
    "Well, it's not a happy tale, Player. Some of me brewers have gone missing.",
    "Well, they went te investigate an odd doorway-lookin' thing that was uncovered in a minor earthquake to the north of the island. No one else could fathom it, but these three were fresh recruits that just sailed in from Daemonheim, and they said they could figure it out, so I sent them through.",
    "That were three days ago, lad.",
    "Aye, Player. That I will. Although I'm not expecting a rescue at this point. If ye find them, bring me proof of their fate. That'll suffice. While ye're searchin', I'll see about preparin' the Twiblik Night Special for ye.*",
    "One more thing, lad. There be water leakin' out of the doorway-lookin' thing. There's a fairly good chance that whatever's on the other side is flooded. Ye'll need te take somethin' that'll let ye breathe underwater.",
    "Well, ye can take mine, an' I'll take yours from the bank next time I'm there.",
    "Anythin' else, lad?",
    "As ye were then, lad.",
    "Aye? What is it, Player?",
    "I can tell from yer eyes this isn't good news, lad. Let's have it.",
    "Arr, I'd feared as much, Player. What's goin' on down there?",
    "So that's what the swine was doin' with me 'rum'! Well, he'll get nay more from me, of that ye can rest easy! Anyway, lad. Back te business. I've the Twiblik Night Special for ye right here, but even ye aren't getting it without swearing 'The Oath'. Do ye think yerself ready, Player? 'The Oath' ye be about to swear carries with it untold weight. The secret ye will be entrusted with must be carried te yer grave.",
    "Then repeat after me. I, Player, swear to thee...",
    "...what happens at sea, stays at sea.",
    "None shall learn of 'The Oath' from me...",
    "...and if anyone does, Cap'n Braindeath'll smash me face in!",
    "With an anchor!",
    "And he's definitely not kidding!",
    "Okay, Player. Ye're ready. 'The Oath' be sworn. Prepare yerself.",
    "Ye have what ye came for, lad. Take it back te Bill Teach. He has the key.",
    "Of course ye did. It wouldn’t be ye without misplacing an irreplaceable, dangerous secret at least once now would it, Player? Fortunately for ye, it were a fake. I knew ye’d lose it.",
    "Now try very hard not te lose it. Remember ‘The Oath’.",
    "Ye have what yer came for, lad. Take it back te Bill Teach. He has the key."
  ],
  "Option 1": [
    "Not yet.",
    "Maybe not...",
    "Okay, no.",
    "A bob!",
    "Pink!",
    "Purple!",
    "Red!"
  ],
  "Option 2": [
    "Yes.",
    "Yes!",
    "Just open it already!",
    "A bun!",
    "Orange!",
    "Blue!",
    "Pink!"
  ],
  "Option 3": [
    "A fringe!",
    "Purple!",
    "Green!",
    "Blue!"
  ],
  "Option 4": [
    "Pigtails!"
  ],
  "Zombie head (prettified)": [
    "Alright! I'll talk, I'll talk!"
  ],
  "Seagull": [
    "Squawk. Squaw squawk... (What indeed, Player. Don't tell me you've forgotten...) Squaw squaw squawk. (I certainly haven't.)",
    "Squawk squaw. Squaw squark squawk? (Player, you wound me. How could you forget the devastation you inflicted?)",
    "Squawk squaw squawk. (I kept your shirt, you know.)",
    "Squawk squaw squaw squawk. (And the accordion too.)",
    "Squaw squaw, squawk squawk! (Very good, Player. Tremble before me, for I am Baron von Hattenkrapper!)"
  ],
  "Baron von Hattenkrapper": [
    "Squawk. Squaw squawk. (I had come here after hearing you were on your way, to wreak my revenge on you for firing me out of that makeshift vacuum pump.) Squaw! Squawk squaw squawk, squaw? (But then: shock! I watched with my beady eyes as you strapped yourself to a cannonball and fired yourself across the ocean! That's the only reason I haven't already unleashed havoc and devastation upon you, Player. I want to know why you would inflict such a thing upon yourself. Is this your way to atone?)",
    "Squawk, squaw squawk. (How...unexpected. Well, Player, I accept your gesture. Consider us even from now on. We have more pressing matters than an old grudge to contend with. Now, I have a proposal for you...)",
    "Squawk, squaw squawk. (Hmph. A pity. Well, regardless of your motivations, after seeing you launched through the air as you did to me, I feel the score is settled. Circumstances dictate that I must put the grudge to rest anyway. Consider us even, Player. Now, I have a proposal for you...)",
    "Squawk, squaw squawk. (Ah, yes, to business. Well, Player, you and I have a common enemy, and I propose we work together to defeat it.)",
    "Squawk, squaw squawk. (I refer to the lumbering monstrosities that opened fire on your ship as it tried to approach the island, of course.)",
    "Squawk, squaw squawk. (They have also been firing upon me each time I attempt to leave the island. I am restricted to flying around within the watery confines of this island prison.) Squawk, squaw squawk. (We both have something to gain here, Player. I propose we collaborate and conquer.)",
    "Squawk, squaw squawk. (I am a very strong flier, Player. I can lift heavy objects. Say, cannonballs, from that pile over there. However, it takes all of my concentration to do so.) Squawk, squaw squawk. (You are a summoner of considerable skill. I propose you commune with me and control my actions to allow me to rain devastation from the sky and obliterate our enemies!) Squawk, squaw squawk. (So, Player? Are you ready to rain destruction on our foes?)",
    "Squawk, squaw squawk. (Then begin we shall. Let my enemies duck and cover, for I am Baron von Hattenkrapper!)",
    "Squawk, squaw squawk. (I must admit, Player, we make a good team. Perhaps it is wiser to have you as an ally than an enemy.)",
    "Squawk, squaw squawk. (Shouldn't you return to your ship? Your companion will be able to dock now the port is undefended.)",
    "Squawk, squaw squawk. (Of course, Player. Of course.)"
  ],
  "General Malpractitioner": [
    "Aha! Found ye!"
  ],
  "Player (Zombie chathead)": [
    "Now that I'm disguised I should hunt for incriminating evidence...",
    "Ye be needed elsewhere, down the hall.",
    "Err... Never mind, I uh, mistook ye fer someone else.",
    "I think I'm going to need another way to distract his attention...",
    "So, three pirates walk into a b-ARR!",
    "Ey, I cleaned the hull o' me boat this mornin'. It were covered in b-ARR-nacles!",
    "Your mum's fat.",
    "That's all of the guards in this room. I should be free to investigate now.",
    "Phew. That's the last of them. Now I need to investigate that noticeboard.",
    "Arr, ye be needed... Uh, excuse me...",
    "That's all of them. I should stand back; this could get messy...",
    "Ouch, that looked painful!",
    "How is that even possible?",
    "That's not meant to bend like that!",
    "My eyes!",
    "Please make it stop!",
    "Is it over?",
    "I think it's 'safe' to investigate now...",
    "Er, I mean, arr! Just a minute, matey!",
    "Hmm... I smell an opportunity for sabotage. I could make these barrelchests come in and go out with a bang!",
    "I'll need something barrel-like to finish this with the bang it deserves.",
    "I don't want to help make more barrelchests! I need to sabotage this somehow...preferably explosively.",
    "That's the room rigged. Just need to set one of them off now... My disguise should shield me from most of it.",
    "I think this is enough evidence. I should go back to Bill Teach."
  ],
  "Dis-orderly": [
    "Oh, aye? Needed by who? And where be the shift change papers?",
    "Then leave me be and get back to yer post!",
    "Harr-harr-harr-harr!",
    "Harr-harr harr-harr!",
    "I know she is! She be like an undead house! Harr-harr!"
  ],
  "Drunk zombie": [
    "Thar beee *hic!* 'ruuum' in me tuuum..."
  ],
  "Residead": [
    "Arr, it be time, lads. Let's get started on this latest batch.",
    "Aye, boss!",
    "Aye!"
  ],
  "All three Residead's": [
    "Making the first incision..."
  ],
  "Attendead": [
    "Arr, there ye are at last! Gimme a hand liftin' the barrels on te the beds so I can finish yer new brothers here!"
  ],
  "Mi-Gor": [
    "Ye'll never stop us now, Player!",
    "Our zomboat armada will lay waste to Mos Le' Harmless! Bon voyage!"
  ],
  "Murphy": [
    "Say hello to our secret weapons!",
    "Bon voyage!"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:A_Clockwork_Syringe?oldid=36141224’"
  ]
}