{
  "Grand Vizier Hassan": [
    "Hello, Player, just the person I need! I have something to propose, but we'd best do it in secret.",
    "Ehsan, we have something important to discuss. Could we have a moment of privacy, please?",
    "Okay, you can come out now.",
    "There's a lot you don't know about him. I do not endorse his actions, and his expulsion from Al Kharid truly is deserved, but I believe he would be a much-improved sovereign in Menaphos.",
    "I have advised Emir Ali from a young age; I know him well enough to say that this is in the best interests of both him and Al Kharid. I am sure he will see this truth in time. Besides, Osman is the rightful heir to the throne, after all. He has shown me the proof; it is irrefutable. That is an injustice that must be rectified. And contrary to how it might look, I am no fool. Even in the short time I have been dealing with Ehsan, she has shown Menaphos cares not for peace, but for coin. There is no deal to be made with the current Pharaoh that will benefit Al Kharid.",
    "How is garnering the support of the faction leaders going?",
    "Osman has already agreed this much with you. What else do you need?",
    "Osman tells me that we are meeting at the Grand Pyramid tonight. Do you want to go there now? There's no turning back!",
    "Let's get the preparations in place.",
    "Oh, no worries, we were hoping for someone with clean hair. Let me know when you're done.",
    "I'm not entirely sure I agree with the way things have played out. I hope having Osman onthe throne was worth it."
  ],
  "Player": [
    "Sorry, I can't help right now.",
    "Osman? Where did you come from?",
    "What? Which?",
    "But how did you even get into the city? Why all that song and dance with Maisa if you can just come and go as you please?",
    "So this isn't just about you seizing power? I didn't realise you cared so much about social justice, Osman.",
    "What would Emir Ali think of you aiding Osman?",
    "You don't mess around, do you? Okay, I'll help.",
    "Nothing to report yet.",
    "So, about that conversation you overheard...",
    "Really?",
    "And?",
    "I thought that would be the Pharaoh?",
    "Oh, mighty Ehsan, I think it's plain to see that the Pharaoh has outstayed his welcome. I wish to install the rightful heir, Osman, ex-spymaster of Al Kharid, in his place. I need your help.",
    "That can be arranged.",
    "I'll see what I can do.",
    "How did you know before I got here?",
    "So, now that your cash flow has resumed I can count on your support?",
    "Good day!",
    "I have something rather discreet that I'd like to discuss.",
    "What? How do you know that?",
    "He wishes to reclaim the throne as soon as possible, by uniting the four factions of Menaphos.",
    "In all the time I've known him, he has shown himself to be an honourable and just man who would make an excellent ruler.",
    "Surely anything is better than your current ruler?",
    "I've heard Osman talk many times about his love for the ocean.",
    "Erm...the waves?",
    "Alright, will do.",
    "No luck as of yet.",
    "Ehsan also had a similar requirement; she requested that you put an end to a strike over wages on a particular shipment of cargo.",
    "Could you possibly reconsider? Hire some new staff to deal with the crabs?",
    "Here's their certification. Batal has cleared some of his brightest and best.",
    "So I can count on your support?",
    "See you at the Grand Pyramid!",
    "Good day!",
    "I didn't realise things were so bad.",
    "So you could say you are desperate for a change?",
    "I come fresh from a meeting with Osman, the rightful heir to the throne of Menaphos. He seeks to return Menaphos to its former glory by means of a revolution, but he needs the support of the workers.",
    "Do you think someone who so openly poses a threat to the Pharaoh should be in plain sight? I am here as his emissary. I will take your concerns to him and make sure he hears them.",
    "Wow, I'm getting good at this!",
    "Aww.",
    "Well, technically it's out of vein.",
    "Sounds good. I'll try.",
    "I haven't managed to get the signet ceremonies back yet.",
    "I have not, and Wadud required something of his own. Wadud has humbly requested a fresh batch of workers be sent to him in order to meet demand from recent shipments.",
    "Those in the Imperial district wouldn't resume the ceremonies, as the Pharaoh still refuses to make public appearances; however, they have given me signets for you to hand out to the most deserving.",
    "So I can count on your support and your workers?",
    "Hello. I have something to discuss. Permission to speak candidly?",
    "We'd like to stage a revolt against the Pharaoh.",
    "I can read between the lines. You are loyal and dutious, but it's plain to see you're well aware that the current Pharaoh is unfit. You just needed an outsider's perspective. The Pharaoh on the throne is from a line of usurpers. I am here at the request of the rightful heir, to return Senliten's bloodline to the throne.",
    "Osman has specifically mentioned his distaste for bloodshed in this instance. So we can depend on your and your army's support?",
    "Great. Cool. Bye.",
    "I knew it. What can I do for you? Do your boots need a spit-shine? Maybe you need some fresh acadia logs for a cabin?",
    "Okay. I'll see if I can bring in the Jack of Spades.",
    "I think I have a good idea where he is. There is something else you can help me with, though. Batal from the worker district has requested for imperial signet ceremonies to be resumed. It would go a long way to see them support this coup.",
    "Okay. I'll see if I can bring in the Jack of Spades.",
    "I managed to find him easily enough, but he wouldn't come quietly. Let's just say he won't be a problem anymore.",
    "I buried it.",
    "I buried it in fire.",
    "Will you support me in the coup and start signet ceremonies again?",
    "Hey, Ozan, the Pharaoh is on his way out, and I've been tasked with trying to unite the citizens of Menaphos against him.",
    "Hey, Ozan, the Pharaoh is on his way out, and I've been tasked with trying to unite the citizens of Menaphos against him.",
    "You can help me in a different way. Akhomet wants me to bring in the Jack of Spades.",
    "I know that, Ozan. So can I take you prisoner? If I help Akhomet, she will help Batal, who will help Wadud who will help Ehsan, who will make sure this revolution goes down.",
    "That's not so good, but thanks for your help.",
    "Not yet. Have you thought of a name for your new persona yet?",
    "That's dreadful, but thanks for your help.",
    "Hey, Ozan, Have[sic] you thought of a name for your new persona yet?",
    "That's worse than the last one, but thanks for your help.",
    "I am here on behalf of the true Pharaoh of Menaphos, Osman, from the line of Senliten, Chosen of Tumeken. The people of Menaphos are behind me and desire change.",
    "Why did I think this would be easy?",
    "Never!",
    "Your face!",
    "No chance!",
    "That is for the people of Menaphos to decide. Faction leaders, what should I do with him?"
  ],
  "Grand Vizier Ehsan (Merchant)": [
    "Of course, but only a minute...",
    "*sticks fingers in ears*",
    "Hmm-mmm-mmm. Hmmm-mmm. Hmmm.",
    "Doo-doo-dooo-doo. Hmmmm.",
    "Thank you, Osman, my dear.",
    "I have no idea what you're talking about.",
    "I still have no idea what you're talking about.",
    "Player, I am a lady.",
    "I need to be courted.",
    "Please. The bottom line is that I am the most powerful person in Menaphos.",
    "If that were the case, would we be talking right now? So, ask away, and don't be too proud to grovel.",
    "My child, do you know what the first step towards becoming rich is? It's to spend less than you make, and as a rule of thumb you shouldn't pay for anything that doesn't make you money. I seek to profit greatly from this exchange and don't intend to spend a minute 'kidding' around. As for the grovelling that is about to follow - that is a necessary expenditure on your part, little one.",
    "You need my help to commit treason, you mean. I would never consent to such treachery! In fact, what's it worth to you that I don't just take this information to the Pharaoh right now, hmm? At the least, I would want to retain my extremely beneficial position...",
    "...with extended powers, responsibilities and remuneration, naturally.",
    "Just one other thing... Several sailors in the Ports district are currently on strike, after realising how much the cargo they have been transporting on my behalf is truly worth. They are probably right, but I can't let doing the right thing get in the way of a healthy profit margin. See if you can have a word with Wadud and get this kink smoothed out.",
    "How are the striking sailors coming along? That was a rhetorical question; if they weren't striking I would know. Try talking to Wadud. If he isn't busy slacking off on a pleasure cruise, he's in the position to do something about it.",
    "Fantastic, I've already heard that the strike has been cleared up! Business will be back to usual in no time.",
    "You run fast, my dear, but it pays to be well informed and I like being paid.",
    "You always could, but it wouldn't be me if I didn't wring you out for every last penny first.",
    "I don't have time to talk at the minute. Time is money, and I'm spending all I have preparing.",
    "The merchants would have him pay the ultimate price for his crimes - execute him!"
  ],
  "Osman": [
    "Good evening, Player.",
    "I was the guard who escorted you to the city. I was the child in the marketplace watching you excitedly. I was among the gaggle of gossipers outside the palace.",
    "My point exactly. I was all of them, yet none of them.",
    "This is all thanks to you. I'd never have gotten in without you laying the groundwork. Your reputation with this city's true leaders, your work to uncover the plots of the Pharaoh... Only recently have I found a way of entering the city and felt safe enough to do so. The proof of my lineage, along with information Senliten has provided me since my, ahem, exile, has been enough to secure a number of new allies on this side of the wall. Make no mistake, though, that my being here is still incredibly risky and dangerous. Regardless, I don't want to keep Ehsan waiting for too long. When you walk around Menaphos, what do you see?",
    "Then you are blind or vulnerable to the same voracious decadence as every lotus-eater in this blasted town.",
    "Then you are blind or vulnerable to the same voracious decadence as every lotus-eater in this blasted town.",
    "Precisely, I knew you had a good eye on you.",
    "Just look towards the 'workers' to our west and you'll see broken and starving men and women, forced to like like pariahs beneath the heel of the rich and powerful. How do you think our glorious host, Ehsan, makes her money? Sure, she trades in physical goods of nefarious origin, but her main export is gossip. Gossip that flows up to the imperial sector and culminates in entire families vanishing in the dead of night, unless they pay her to keep their secrets. There's a long, dark shadow cast by the Grand Pyramid and it devours this entire city. Any murmurings of dissent are met with brutal force, and I cannot allow its citizens to cower beneath its darkness any longer.",
    "I know that these people - my people - deserve better than the depravity they dwell within, and I believe you are the one who can help us change that, if you are so inclined. You are in a position of influence when it comes to the leaders of each of the four districts in this city. We will need the backing of each to stage a coup, at which point we will storm the Grand Pyramid. My birthright is undeniable, and anyone who stands in the way of positive change is most certainly wicked. I am certain that when the Pharaoh sees the dissatisfaction of his citizens, he will step down peacefully and we can resolve this in a cordial manner.",
    "Tell me, has your time in Menaphos corrupted you past reason?",
    "Will you help me?",
    "I knew I could depend on you.",
    "Please, spare the barbarism. It must not come to that; you must stay your hand.",
    "Have you ever been hunted by an ex-spymaster? I assure you, it is as pleasant as it is ephemeral. I will hunt you through this life and the next, pursuing your every waking second until you find it within your desiccated peach pit of a heart to help your brothers and sisters in need. Righteousness, money and torture are all great motivators. I will use my considerable proclivities for that holy trinity to make sure you do the right thing. If I've judged your character correctly on our past interactions, those first two should prove sufficient incentive. And if not, then hang on while I get my flog.",
    "Please. I never mess around when my people are in need.",
    "I need you to persuade each of the faction leaders and their people to meet with you at the base of the pyramid and stage the coup. You then enter the palace and nominate me as Pharaoh, at which point I will be summoned. I'll take it from there. Ehsan, you can uncover your ears now.",
    "How did you hear that? I barely whispered.",
    "Indeed. You will, however, comply if you do not wish to invalidate our deal. As for you, Player, Ehsan can be your first stop. I shall prepare for your return."
  ],
  "'Admiral' Wadud (Ports)": [
    "Ahoy, to what do I owe the pleasure?",
    "Does it have anything to do with the return of the rightful heir to the throne?",
    "Like I said, very little goes on around here that I am not aware of. What exactly Osman wants from me, however, is a mystery.",
    "Four factions? I count three...and then there's the bone-idle labourers that make up the worker corp. Regardless, it's no secret that things could be great deal better for the seafaring denizens of Menaphos, and a regime change could trim the sails on the route towards genuine social reform. But how do we know if Osman will be any better?",
    "That's a positive. As much as I take your word for it, I'm not sure he could be much worse than our current despot. I'm in.",
    "You do have a point; things have got truly dire. I'm in.",
    "Oh, really? What's his favourite part?",
    "A man after my own heart! The tumultuous bob of the hull is a distilled vibration form of the sweetest ecstasy imaginable. To think our potential ruler is a monarch where it matters...",
    "(Wadud is quite obviously beside himself with unbridled joy, but manages to regain his composure.)",
    "If I'm being honest, I would welcome a shift in our current system, but the fact that he is a thalassophile matters the world to me! I can't wait to recant the tales of my travels to him. I'm in!",
    "On one condition. The life of a wave-riding prince is one of luxury, and each of my men live a lifestyle befitting the brilliance afforded by the azure tides that ebb beneath their thrones. As such, it has become more and more difficult for me to convince my people to lower themselves to menial work. All they want to do is exercise their gods-given right to broach uncharted territories and liberate themselves by skimming across the surf like a stone. The truth is, the ships still need loading up with cargo and materials need to be sourced for repairs. We require someone who doesn't find it unbecoming of themselves to carry out such lowly work. Maybe even someone who has wasted their entire life on the land, who was born into the dirt and belongs there. Talk to Batal in the Worker district and see if he can't muster up a few of his most eager brethren. We will make sure they are housed and fed, but only if they are prepared to put in a solid day's work.",
    "How is the search for my new workers coming along?",
    "Let me know when you get some.",
    "How is the search for my new staff coming along?",
    "A 'particular' shipment, indeed! She probably didn't tell you what the cargo consisted of; I think it's perfectly reasonable for my men to ask for more when they are transporting such dangerous animals. 'Rum'-pumped crabs have become a delicacy for the aristocracy of Menaphos, and delivering them before the 'rum' in their veins has a chance to dry up fetches a high price. They are striking on my orders.",
    "It's far beneath any monarch of the tide to lose a finger to their cargo, but maybe some of the workers you bring me could manage it. Sort out the workers for me and I'll reconsider.",
    "Have you managed to get me some extra hands on deck?",
    "Even his 'brightest and best' won't be a match for my crews, but it will save us some lost limbs here and there.",
    "You can, and with the addition of the new crew the strike can come to an end.",
    "I'm off to prepare for the times ahead. They could be rough, but a smooth sea never made a skilled sailor.",
    "Why put that burden on our city? Exile him to the east; let him never return!"
  ],
  "Batal (Worker)": [
    "Is it? When so many of my people have had the yams stolen from their savouring mouths?",
    "I shouldn't have to tell you things are bad. Everybody knows things are bad. Everybody's out of work or scared of losing their job. Quite frankly, I'm angry!",
    "Anything that could lead to better working and living conditions for my people.",
    "This all sounds well and good, but where is this Osman? Is he too good to dwell amongst the majority of his populace? Exercising the same gods-given right that has bound us to a life of thankless servitude?",
    "Well, that's already more than the slave-drivers in their golden pyramids have ever done for us. I'm in.",
    "On one condition.",
    "It may be difficult for an outsider such as you to understand, but the shackles of the worker caste are difficult to break free from. Even when we have worked diligently for half our lifetimes, all we want to do is retire and live as comfortable an existence as our meagre means allow. In order to buy a dwelling out of the slums, away from the toxic glare of the forges and factories of Menaphos, we require a signet from the Pharaoh himself, thanking us for our years of services. The imperial crest proves to the rest of the city that we are Menaphites just like them. The crest of Menaphos entitles us to much more than just a good home and high-end market wares. It provides us with validation that the blood kneaded into the sand from our toiling has not been in vain.",
    "The Pharaoh has ceased the formality of these services, and along with it any hope my people have of a brighter future, where they aren't trapped by the life they were born into. Will you try to convince those in the Imperial district to resume these proceedings?",
    "Have you talked to someone in the Imperial district?",
    "Let me know when you do.",
    "Have you managed to procure the light at the end of the tunnel?",
    "There isn't enough work to go around, and the sailors treat my men fairly in the scheme of things. At least transporting cargo is a relatively safe line of work with little to no chance of dismemberment. It is difficult to commit yourself fully to the duty of work if there is no hope of reaching parity with your fellow citizens. Get my people the rights to signet ceremonies from the Imperial district and I will send some of my brightest and best to work in the port.",
    "Have you managed to procure the light at the end of the tunnel?",
    "This will make a world of difference to the workers of Menaphos. Historically, they would be so excited to meet the Pharaoh himself, but public opinions has shifted a great deal in recent years. Mine especially. I thank you.",
    "You can. I will send Wadud my brightest and best workers; if you could deliver him the necessary documentation, they will start work with him next week. Thank you for bringing hope of redemption back to the people who need it most.",
    "You'll need to make some space before I can return the item you lost.",
    "You'll be needing this. Try not to lose it again.",
    "Can't speak now, I'm hard at work preparing for the great toil ahead of us.",
    "That is too light a punishment! He should be forced to work as us workers are forced to work!"
  ],
  "Commander Akhomet (Imperial)": [
    "Well met, soldier.",
    "Granted. At ease.",
    "You speak of treason! If you were one of my soldiers, I'd have no choice but to have you arrested and publicly flogged! You knew this, and yet still asked me so brazenly - what made you think I would not do just that?",
    "In which case, 'outsider', you have my interest. As one of the few allowed close to the Pharaoh, I have witnessed his fall into psychosis first-hand. He has lost touch with this city and its people; he'll drag us all down with him if things continue. He has become ever more difficult to reason with, more brutal and withdrawn, and he has become filled with an endless greed. I will happily assist, but one one condition: that this be a bloodless coup. We should get both the Pharaoh and Menaphos the help they need.",
    "If you can get the rest of the city's leaders on board with this approach, then yes, you can. At the very least, we will stand aside.",
    "However, there is one other condition.",
    "I can shine my own shoes and chop my own wood, thank you. I need you to deal with something that has been a thorn in my side for quite some time. I need you to bring the Jack of Spades to justice. He has evaded capture for long enough. He needs to be dealt with first, so that the people know that sedition and insurrection will not be tolerated.",
    "Have you managed to locate that dastardly Jack of Spades?",
    "The official statement is that the Jack of Spades provides far too great a threat for the Pharaoh to be seen in public for these ceremonies to go ahead. Although, even I do not know what form his physical ailment takes, I can certainly attest to his unpopularity. Make an example of the Jack, and maybe the fear generated could create a climate in which his excuses no longer carry weight.",
    "Have you managed to locate that dastardly Jack of Spades?",
    "This is his blood-soaked hood? That's unbelievably brutal. What did you do with the body?",
    "Deeply, I hope? Jackals have been known to dig up shallow graves. We'd best go find it just to check.",
    "We Menaphites believe in embalming our dead. Only commoners go out on a pyre. I'm impressed with how you brought him down, and that you've observed our customs - the Jack deserved no respect in life, and even less in death.",
    "I will support you, but the Pharaoh will still not make public appearances for the ceremonies...not that such will matter for much longer. Perhaps the new Pharaoh may even walk among his subjects. Here are some signets you can hand to Batal; the workers can perform their own ceremonies in the interim. I'll see you outside the Grand Pyramid after you've gathered everyone.",
    "You'll need to make some space before I can return the item you lost.",
    "You'll be needing this. Try not to lose it again.",
    "Preparations have to be made before we make our move. I should inform my men.",
    "No! His crimes do not warrant death. He should be imprisoned and left to dwell upon his fate!"
  ],
  "Ozan": [
    "Player? To what do I owe the pleasure?",
    "Player? To what do I owe the pleasure?",
    "That will throw the palace into disarray - perfect for looting... Thanks for letting me know.",
    "Revolution and rioting? Can I help with the looting?",
    "But I'm the Jack of Spades!",
    "What? no! We could fake the Jack's death, though. Here's my mask.",
    "I'd recommend dipping it in some blood or something to complete the illusion. I'm sad to give up my Jack persona, but I can always get a new alter-ego... What do you think of...",
    "Blake Charmesflute",
    "Brian.",
    "The Camel Clogger",
    "The Camel Dodger.",
    "The Hooded Claw.",
    "The Jewel Stroker.",
    "The Kharad-divvy.",
    "The Knave of Swords.",
    "The Mena-thief.",
    "The Penny Pilferer.",
    "The Pink Wig",
    "The Pharaoh of Phieving",
    "Risqué's Endgame",
    "Sandy Recliner.",
    "The Sultan of Stealing.",
    "The Torch Tickler.",
    "The Well-Heeled Jack.",
    "The Yellow Streak.",
    "You'll need to make some space before I can return the item you lost.",
    "You'll be needing this. Try not to lose it again.",
    "Have you managed to get any blood for the mask?",
    "You should try the fish stall in the marketplace. As for names...",
    "You'll need to make some space before I can return the item you lost.",
    "You'll be needing this. Try not to lose it again.",
    "How about..."
  ],
  "Pharaoh": [
    "What is the meaning of this?",
    "Fools! Do you really think the meaningless mendicants of Menaphos made me master? I was granted my power by the gods themselves! To me, you are nothing but a grain of sand; every one of which is intimately known to those that birthed me. To deny my divine right is to disrespect the deities of the Kharidian Desert! How can you possibly stand in the face of limitless power? How could the gods possibly regard you as anything but insignificant? They talk to me as an equal!",
    "And to see the so-called 'leaders' of Menaphos have finally settled their spiteful squabbling. It would bring tears to my eyes, but you caught me with them clamped closed! To think you would dare to drag the dawning of your day into darkness! You perfidious paupers will be punished! I will make an example out of you and none shall dare step to my throne with such treachery!",
    "I shall enjoy watching this revolution crushed before my eyes.",
    "Now you get to experience my power first-hand!",
    "Behold!",
    "Die!",
    "Feel my wrath!",
    "Kneel!",
    "Kneel before your Pharaoh!",
    "So die!",
    "The gods have granted me incredible power - behold!",
    "There's nowhere to hide!",
    "There's nowhere to run!",
    "There's nowhere you can run!",
    "Usurpers!",
    "Witness my power!",
    "What you see is the kiss of Amascut. Proof that I am chosen above all others to rule Menaphos.",
    "Now, surely, after seeing my gift, you will yield.",
    "A shame, for sure, but it makes no difference! You don't deserve to live!",
    "SO DIE!",
    "Behold!",
    "Die!",
    "Feel my wrath!",
    "Feel the wrath of the gods!",
    "Kneel before your Pharaoh!",
    "So die!",
    "The gods have granted me incredible power - behold!",
    "There's nowhere to hide!",
    "There's nowhere to run!",
    "There's nowhere you can run!",
    "Witness my power!",
    "I yield... Please. I understand this must be difficult to comprehend, but I haven't been in full control of my actions for a long time. When I first became Pharaoh, I just wanted to undo the damage my bloodline had caused. I knew I couldn't do it alone and asked the gods for their blessing. Now I see the only god to answer my call was Amascut. She saw fit to turn me into this abomination and send Jabari to my side - he who has done nothing but blur the boundaries between good and evil, to cloud my thoughts and my judgement. Her corruptions have riddled my body and mind for years. Only now do I see clearly again, and I yield. I see now the tyrant I have become, and I thank you for removing the mask. I have been played for a fool. I don't want to cause any more pain. I wish only to live free of this corruption and start to repay this great city for my sins. If death is to be my punishment, I accept it graciously and without question. Though I would beg mercy, such that I could still serve Menaphos. Put me to work... make me the lowliest guard..conscript me to a ship... Please, I'll do anything. Allow me to atone.",
    "I suppose it is what I deserve. Please, allow me to pray to Tumeken for forgiveness before my end.",
    "It saddens me to leave, but this is the merciful option. I will start a new life for myself in the Arc, and endeavor to support Menaphos however I can from afar. Thank you.",
    "Thank you, I relish the thought of getting the chance to make things right and remaining in the city I love.",
    "Thank you for your mercy, this is the minimum my crimes deserve. I shall look upon my deeds and weep."
  ],
  "Pharaoh Osman, Chosen of Tumeken": [
    "I am Pharaoh! I alone decide your fate!"
  ],
  "Amascut": [
    "Jabari, why are you here? You should be with the Pharaoh!",
    "Not to matter. He has served his purpose, and I have found what I was looking for.",
    "I care no longer of human affairs! Once this ritual is complete, only one thing stands between me and my goal.",
    "No! You will stay and bear witness!",
    "You are wrong! This is ALL I want!",
    "No, I will consume YOU!",
    "You should be afraid! Your essence was spent long ago. Your shadow is no longer cast. The people have forgotten your name. And once Scabaras finally debases himself, your bau shall be entirely corrupted. Then I shall devour your heart, and with it the last remnant of your existence!",
    "I AM NOT YOUR DAUGHTER!"
  ],
  "Jabari": [
    "I am afraid events have escalated, my lady. I believe the Pharaoh's time is at an end.",
    "Osman will no doubt try to take his place, with the breadcrumbs we've laid. His downfall will be poetic justice...",
    "Do you wish me to leave, my lady? You should be alone for this. I could wai-",
    "I am afraid.",
    "You do not understand. I am afraid FOR you.",
    "Daughter, please..."
  ],
  "Thrall (1)": [
    "Please, you must stop.",
    "You must let this anger go."
  ],
  "Thrall (2)": [
    "You do not want to do this.",
    "It will consume you."
  ],
  "Amascut (in voice)": [
    "I am Amascut!"
  ],
  "Congratulations! You have completed": [
    "''Phite Club' - Complete this Master quest."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:%27Phite_Club?oldid=35313361’"
  ]
}