{
  "This page contains dialogue related to Recipe for Disaster": [
    "Freeing Pirate Pete.The content below is copied verbatim from RuneScape and thus copyrighted by Jagex."
  ],
  "Player": [
    "How would I go about protecting this nautical fellow from the curse of the culinaromancer then?",
    "Erm... okay...",
    "Fishcakes? What, like chocolate cake with fish instead of chocolate?",
    "Um... So how would I make those then?",
    "Ooooh yeah... I'll be right back!",
    "How would I go about protecting this nautical fellow from the curse of the culinaromancer then?",
    "I might have, I might not have. This time-travelling stuff just has me a little worn out ok?",
    "Fishcakes? What, like chocolate cake with fish instead of chocolate?",
    "Um... So how would I make those then?",
    "Ooooh yeah... I'll be right back!",
    "I can't quite remember how I managed to save that pirate...",
    "I did? Er... I mean I did.",
    "Out of interest, could you just help me quickly with that?",
    "Can you tell me how to make fishcakes?",
    "Don't be silly, that would never work.",
    "Can you check to see if there is a recipe for them?",
    "Where do I get Ground Cod?",
    "Where do I get Ground Kelp?",
    "Where do I get Ground Giant Crab Meat?",
    "Where do I get Breadcrumbs?",
    "What do I do with all of it?",
    "What did I do with all of it?",
    "Ok, I'll go out and get all of the stuff and bring it to you.",
    "Thanks!",
    "Murphy, what can you tell me about giant crabs?",
    "I need to get some Giant Crab Meat and Kelp. Can you tell me where I can get some?",
    "Go down there? What do you mean?",
    "I'm sure I will be able to if I put my mind to it, why do you ask?",
    "That sounds pretty dangerous.",
    "I'm still not happy about this...",
    "I can't tell you I'm afraid. The very fabric of space and time could collapse!",
    "Not just yet.",
    "I certainly am.",
    "Are you sure this is safe?",
    "Yes. Let's go diving.",
    "Ok, well I'll just put my diving helmet and diving backpack on.",
    "Ok, see you soon Murphy!",
    "What do you mean?",
    "So what can I do?",
    "Not just yet.",
    "Murphy, can I get another diving helmet?",
    "What do you mean?",
    "O...k...",
    "Hello Murphy. Do you have a spare diving backpack?",
    "What 'little incident'?",
    "Is that blood?",
    "Hello Murphy. Do you have a spare set of diving gear?",
    "Thanks! Wait... Why won't the previous owner be needing it?",
    "That's it?",
    "...",
    "Me?",
    "I'm not any kind of fishy, err, fish.",
    "Well I'm trying to get some Giant Crab meat.",
    "You see those big crabs? I want one of those.",
    "Wait, could I buy some of the crab meat?",
    "Seriously, I need to get that meat. I'll do your big favour if you want.",
    "Big skippy skins?",
    "Not yet.",
    "Nung, I have your giant Mudskipper Skins.",
    "Sigh...",
    "Yes, I have the big skippy skins.",
    "Great! How much do you want for them?",
    "Well I'll do it. What do I need? An item of ancient power? Something from the deepest, darkest dungeon in the world?",
    "What sort of monsters will I need to fight? I'd best grab myself some potions too.",
    "Will there be traps? Should I bring cakes?",
    "A needle.",
    "And bronze wire.",
    "So, all I have to do is bring you three rolls of bronze wire and a needle, and I can have all the Giant Crabs I can kill?",
    "Yeah, sounds it.",
    "Not yet.",
    "Nung, I have the needle and wire.",
    "Thanks!",
    "I just spoke to Nung, he said it was ok.",
    "Out of interest, could you just help me quickly with that?",
    "I have all the ingredients for fishcakes!",
    "That's it?",
    "Oh yeah... I remember now..."
  ],
  "Fortuneteller": [
    "Hmmm... Wait a moment, my gypsy-sense is tingling...",
    "Ah yes. To immunise him from the culinaromancer's attack, you will need to feed him fishcakes.",
    "No... Like small bread crumbed fishy delicacies.",
    "I don't know. I am a gypsy, not a cook.",
    "I don't suppose it occurred to you to ask the actual cook in the room right next door to us?",
    "Err... have you forgotten about the fishcakes already?",
    "To immunise him from the culinaromancer's attack, you will need to feed him fishcakes.",
    "No... Like small bread crumbed fishy delicacies.",
    "I don't know. I am a fortuneteller, not a cook. I don't suppose it occurred to you to ask the actual cook in the room right next door to us?",
    "And try not to forget this time!",
    "Stop messing about and use the fishcakes on him!",
    "Good work adventurer, I've teleported them away to safety! You only have [number] council members left to protect!"
  ],
  "Cook": [
    "The pirate? Yes, you used fishcakes didn't you?",
    "Fishcakes? As in with fish eggs and fish milk?",
    "Of course.",
    "Found it!",
    "Apparently you need Ground Cod, Ground Kelp, Ground Giant Crab Meat and Breadcrumbs.",
    "Well, if you use a pestle and mortar on a raw cod that will grind it up nicely.",
    "There are apparently some kelp patches off the coast near Rimmington. Murphy knows more about that.",
    "As for the grinding part, all you have to do is use a pestle and mortar on it, that ought to get it sorted.",
    "Murphy also used to bring in Giant Crabs occasionally. He hasn't had any of them in for a while though.",
    "You had best go and have a word with him to see if he can tell you what happened.",
    "Well, Murphy used to bring in Giant Crabs occasionally. He hasn't had any of them for a while though.",
    "You had best go and have a word with him to see if he can tell you what happened.",
    "Oh, and there are apparently some kelp patches off the coast near Rimmington. Murphy knows about that too.",
    "As for the grinding part, all you have to do is use a pestle and mortar on it, that ought to get it sorted.",
    "That's easy, all you do is use a knife to slice the bread up into tiny, tiny chunks.",
    "I'm not entirely sure. What am I, an encyclopedia?",
    "I'll have a look through my cookbook while I wait for the ingredients.",
    "Ok.",
    "Is there anything else you need to know?",
    "No problem!",
    "Great! Just like before! I've been reading the recipe and I know how to make the fishcakes now.",
    "It's pretty simple actually. All you have to do is use the ingredients on each other and then cook the fishcakes on a range.",
    "Yes. I thought that there was a page missing from the cookbook because it seemed so easy, but it turns out it really IS that easy!",
    "Excellent! Those fishcakes are exactly the same as the ones you used to protect Pirate Pete from the Culinaromancer's spell before!"
  ],
  "Murphy": [
    "Giant Crabs? Why, I used to haul up a few of those whenever I set my nets around Rimmington.",
    "Why the interest?",
    "Well, the only thing I can think to do is to go down there and look to see if there are any left.",
    "As in under the water!",
    "Tell me, can you get your hands on a fishbowl?",
    "Well, I know how to ring up a handy set of breathing gear that can allow you to keep air inside the fishbowl.",
    "You just put the barrel of air on your back, with the fishbowl over your head, and then dive over the side.",
    "It should hold enough air to keep you alive for quite some time.",
    "Not at all. I'll even weigh anchor with the chain somewhere easy to reach so you can climb out easily enough if you run into trouble.",
    "Well, I can't think of any other way to check if you come up with a better plan then feel free to tell me.",
    "In the meantime I'll wait, and if you want me to take you diving I'll be ready.",
    "By the way, why are you so interested in crabs all of a sudden?",
    "O...k...",
    "Well, I guess some people will do anything for a bit of fresh seafood.",
    "Ahoy there! Up for a bit of a swim?",
    "Well, whenever you want me to get you some diving gear, just come and see me with a fishbowl.",
    "Ahoy there! Up for a bit of a swim?",
    "Great! I'll sort that fishbowl out for you.",
    "There you go.",
    "Sure! It's as sound as my ship!",
    "Want me to take you out now?",
    "Well I can't take you out until you are properly geared up.",
    "We lost three diving parties that way!",
    "Ok, let's be off then.",
    "Good luck, I'll weigh anchor. Climb up the chain to get aboard.",
    "Well that's the sort of spirit I like to see. However you are far too heavy to go diving right now.",
    "Well, I can't take you diving if you are carrying more than 27kg worth of equipment. We arrived at that number through trial and error, and the errors were not pretty let me assure you.",
    "Well, if you pop over to a bank and leave all your heavy equipment behind then I'll take you out. See you then!",
    "Ok, well I'll be here if you change your mind.",
    "Sure, here you go. Try not to lose this one, I'm not a very good glassblower.",
    "Well, the bowls I make tend to shatter under pressure into razor-sharp shards of lethal, face shredding shrapnel. Don't let it bother you, I think I know what I'm doing wrong now.",
    "Sure, I have plenty after the...little incident.",
    "Nothing to worry yourself about. Here, have this one. Only dropped once!",
    "No, no. Well, yes. But seriously, what are the chances of getting a jellyfish jammed in there again?",
    "Here you are. I'm sure the previous owner won't be needing this now, anyway.",
    "He... Erm... He's given up diving to follow his childhood dream of becoming a circus performer.",
    "Yep. He most definitely didn't die in a horrific diving incident whilst wearing that diving suit, anyway."
  ],
  "Mogre Guard": [
    "Silly fishy! You lookin' like likkle Mogre wid your likkle arms an' wid your likkle legs! Swim along silly round head fishy! Dont let dem big skippies eat you!",
    "Hey! Nung says no fishies...",
    "Well... if Nung say it ok, den go ahead."
  ],
  "Nung": [
    "Hey, silly fishy wit da round head!",
    "Ya! What kinda fishy you's tinkin you are?",
    "Well what you doin' here if you's no a fishy?",
    "Dis fishy is a funny fishy!",
    "Whats this fishy wanting?",
    "You's here to stealin' my big crunchy claws?",
    "Nung should smash your stooped round head!",
    "Always the big nettings was taking my big crunchy claws, I put them in the cages, and now you's come to get them.",
    "Swim away little fishy or I eat you till you's dead!",
    "Silly round head fishy want to swaps big crunchy claws?",
    "Naaah... you no real deal. I bet you no do Nung big favour.",
    "Hah! Silly round head fishy! If you get Nung 5 big skippy skins, den maybe Nung thinking you ok.",
    "Ya, da big skippies live over dere.",
    "You need lotsa big stones to get down dere. Den you kill da big skippies and bring da skins to Nung.",
    "You do dis, den maybe Nung let you swaps da big crunchy claws.",
    "Hey fishy! You gots da skippy skins?",
    "Den no crunchy claws for you!",
    "What you say? Has da silly round headed fishy got da big skippy skins?",
    "Silly round head fishy done good! Gimme!",
    "Ya, da round head fishy does a good big favour for Nung.",
    "I am thinkin you's ok enough to swaps the giant crunchy claws now.",
    "You's gotta get me somefing to make dese hides to a cloak and flippers and hat, den I lets you have all the big crunchy claws you can get.",
    "But it not be easy.",
    "Ya, it real dangerous for a fishy.",
    "You's gotta go up to da topsides, and your gotta get a needly-thing and some wirey stuff.",
    "Ya.",
    "Ya. Tree wirey stuffs.",
    "Ya, but be a sneaky round head fishy. Da topsides has not water for a little fishy like you to breathing.",
    "It REAL dangerous.",
    "Has da fish brung Nung the wiry stuff and the needly thing?",
    "Nung not supprised, the upsies is real scaredy for da little fishies like you.",
    "Nung thinks this is a useful fishy he finds. Gimme!",
    "Nung have all da wiry stuff and needly things he needs to make da biggestest skippy skin hat ever!",
    "You's a good little fishy, you eat as many big crunchy claws as you want.",
    "Maybe you get big and strong like Nung!",
    "Hey fishy. If you's a good fishy I might sell yous bitses of skippy skin clothes.",
    "But Nung needs time to makes them first."
  ],
  "v • d • eRS3 Recipe for Disaster": [
    "Freeing Pirate PeteA subquest of Recipe for DisasterNPCs"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Recipe_for_Disaster:_Freeing_Pirate_Pete?oldid=33962334’"
  ]
}