{
  "This page contains dialogue related to Recipe for Disaster": [
    "Freeing the Goblin Generals.The content below is copied verbatim from RuneScape and thus copyrighted by Jagex."
  ],
  "Player": [
    "Which one of these am I actually meant to be saving?",
    "Remembering the last time I dealt with these two, that may be easier said than done.",
    "Those bickering goblins... How did I protect them again?",
    "Oh yeah... I remember now...",
    "Can I ask about what food you like?",
    "I need to save you from the Culinaromancer's spell.",
    "At the council meeting in Lumbridge, there was a Culinaromancer who tried to cast an evil spell on you!",
    "Never mind that, don't you remember the spell?",
    "But...",
    "Never mind.",
    "Market research.",
    "Exactly. That's why we need to find out what goblins eat, so we can better cater to your needs.",
    "But it'll only take a minute of your time.",
    "Erm... no particular reason.",
    "Hey, I need your help. Wartface and Bentnoze have been cursed!",
    "I need to find a meal they'd both eat.",
    "Busy doing what?",
    "I've got the charcoal you were after.",
    "Sulphur? Er...",
    "What is this new way of cooking?",
    "Well, good luck with that.",
    "I need your help. Wartface and Bentnoze have been trapped by a terrible curse!",
    "What do you need? Maybe I can get it for you.",
    "Ok, I'll see what I can do.",
    "I guess I'll come back later then.",
    "Well, I guess I'll leave you to it.",
    "Are you sure this is a good idea?",
    "I'm really not convinced that...",
    "Should it shake like that?",
    "Mudknuckles?",
    "It did... ?!",
    "That sounds like a great idea.",
    "Er... yes... I'm sure food poisoning was what they were worried about.",
    "Do you think that will sell? Like you said, it's burnt.",
    "I need your help...",
    "Your leaders, Wartface and Bentnoze, have been trapped by a terrible curse!",
    "I need to create a dish that both of the Generals would eat to save them from the curse.",
    "What?",
    "Why, what did they want?",
    "That doesn't sound too bad.",
    "Anything else?",
    "Where can I get maggots?",
    "Each to their own indeed, but what's the problem?",
    "Ok, is there anything other than orange slices and maggots?",
    "Let me guess, Wartface complained right?",
    "So let me get this straight. I need orange slices which aren't orange, maggots that aren't bland, and bread which isn't crunchy?",
    "Wonderful. Well, I guess I'll have to see what I can do.",
    "I need your help. About that dish that both Wartface and Bentnoze would eat...",
    "What was the problem with the orange slices?",
    "Why did Bentnoze object to the maggots?",
    "What did Wartface have against bread?",
    "I need your help. Are you sure Wartface and Bentnoze will both eat this dish we've made?",
    "I need your help. I lost the dish you gave to me to save Wartface and Bentnoze.",
    "I've got the ingredients we need to make a meal for Wartface and Bentnoze.",
    "Great, thanks!",
    "I'll leave you to your experimentation then."
  ],
  "Fortuneteller": [
    "Hmmm... neither of them were at the previous council meeting. The goblins get through leaders so fast I find it hard to keep track. I heard the last leader died during a game of pin the tail on the basilisk. Well, no worries. I'm sure if you just find something that they'll both eat then that should work. I hope.",
    "Well you could try asking some of the other goblins in their village for ideas. You should be able to find it just to the North of Falador, unless they've decided the sky is the wrong colour there or something.",
    "Good work adventurer, I've teleported them away to safety! You only have [number] council members left to protect!"
  ],
  "Cook": [
    "Well, that was a weird one alright, you told me that they couldn't agree on what food they liked, so you ended up just mushing a bunch of stuff together somehow which seemed to do the trick.",
    "Did you want a reminder on any other of your brave exploits?"
  ],
  "General Wartface": [
    "What? Why?",
    "Lumbridge...? Oh yeah. Me remember. Me was goblin representy thingy.",
    "Weren't your chair. You shouldn' even've been there!",
    "But us never use your markets.",
    "Me see no particular reason to answer you then."
  ],
  "General Bentnoze": [
    "From whose what?",
    "No you weren't! That was me!",
    "All me remember is Wartface stealin' chair!",
    "I there before you were. So I get chair...",
    "Go away human, we busy.",
    "I said we busy!"
  ],
  "Goblin": [
    "What that got to do with me?",
    "Me no chef, ask village cook instead.",
    "What that noise?",
    "You just hear that?",
    "Now there shaking too!",
    "Ah. That'd be Mudknuckles again then."
  ],
  "Goblin Cook": [
    "Go away human, me's busy here!",
    "Me's working on new way of cooking. Will be most famous-est goblin cook ever.",
    "Really? Then no time to lose. Mudknuckles already have everything else. Sulphur 'n stuff.",
    "Must be moving. Follow me.",
    "Got the idea from the dwarves. Saw them playing with something. They called it a malty canned nun or summat. Used lotsa heat and bright light. Wouldn't tell Mudknuckles how it worked of course. But I figured it out. Mudknuckles is smarter than them. Now I'm gonna be able to cook better'n anyone. And faster too, yes.",
    "No luck. Will work cos Mudknuckles destined for great things.",
    "Oh, maybe that why Mudknuckles not been shouted at recently. Hmmm, s'pose me should help. But first Mudknuckles must finish experiment. Unfortunately is missing one vital ingredient.",
    "Is called charcoal. Mudknuckles hear you can get it from shops on Karamja, but the customs officers, they no like goblins any more. Burnt trees, they good too. Smash 'em up with hatchets. But Mudknuckles only knows of burnt trees in the wilderness, and Mudknuckles too afraid to go there.",
    "Yes, Mudknuckles too busy to talk.",
    "Absolutely, best idea Mudknuckles ever had.",
    "It fine, it...",
    "It...",
    "It worked!",
    "You the human who helped me. Mudknuckles is very grateful, will be famous real soon now. Is just collecting results. And so many results! On walls, on ceiling, everywhere! I thinking of calling it fast food, 'cos of how fast it goes from raw to burnt, see?",
    "You think so? Everyone else think Mudknuckles crazy. Seem think explosive cooking might be dangerous or summat. Can't see why. Not like you gonna get food poisoning. Food is very well cooked.",
    "So maybe some imperfections, but fast food will sell. People buy anything when in hurry, even if does taste like sawdust.",
    "Yes, yes, Mudknuckles very grateful, how can I help?",
    "So that's why Mudknuckles not been shouted at recently. But how can I be helping? Cooking and magic no mix. Tried that before, Mudknuckles had some very angry wizards at door after trying to burn staffs to cook on.",
    "Oh...",
    "Is impossible. Mudknuckles try it before, but their requests, they make no sense.",
    "Well Bentnoze wanted fruit in the dish. But Wartface, only fruit he eat is sliced oranges.",
    "Maybe, but Bentnoze objects to the colour.",
    "Wartface, he want some nice juicy maggots.",
    "Humans use them all the time for fishing. Mudknuckles think this a crazy waste of maggots mind, but each to their own.",
    "Bentnoze not like maggots, say they're too bland. Would only eat them if they spicier.",
    "Bentnoze asked for some bread in the mix.",
    "Yep, Wartface think bread too crunchy. He prefer slimier soggier food, like the maggots.",
    "Yep, 'bout sums it up. Bring 'em all to me and Mudknuckles will make suitable dish.",
    "Well Bentnoze wanted fruit in the dish. But Wartface, only fruit he eat is sliced oranges, and Bentnoze object to the colour of them.",
    "Bentnoze not like maggots, say they're too bland. Would only eat them if they spicier.",
    "Wartface think bread too crunchy. He prefer his food to be soggier.",
    "Highly unlikely, but is best Mudknuckles can come up with am afraid.",
    "Is ok, Mudknuckles make plenty. Take some more.",
    "Mudknuckles is confused. Ingredients make no sense. But give 'em here and Mudknuckles make what you need. There you go, but don't go blaming Mudknuckles if doesn't work."
  ],
  "Congratulations! You have completed": [
    "'Recipe for Disaster: Freeing the Goblin Generals' - Complete this Novice quest."
  ],
  "v • d • eRS3 Recipe for Disaster": [
    "Freeing the Goblin GeneralsA subquest of Recipe for DisasterNPCs"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Recipe_for_Disaster:_Freeing_the_Goblin_Generals?oldid=36109610’"
  ]
}