{
  "Dialogue": [
    "[Accept Quest]",
    "How am I supposed to move statues all the way here?",
    "No",
    "Queen Ellamaria has sent me to seek your guidance.",
    "Queen Ellamaria has sent me to seek your guidance.",
    "Do you have any orchid seeds to spare?",
    "[Charm] If you tell me your problems, I may be able to help you.",
    "[Charm] Yes, I was wondering about that.",
    "[Charm] Times must be very hard for you.",
    "[Charm] Whatever you've done, I'm sure you had just cause.",
    "[Charm] And what is the nature of this fee that you pay?",
    "[Charm] If not yours, then whose blood are you offering?",
    "[Charm] How can you deal with so much guilt?",
    "That's a deal - I'll grow a patch of onions for you.",
    "Do you have any snowdrop seeds to spare?",
    "[Charm] You seem to be a little irritable, my friend.",
    "[Charm] I don't like to see a fellow human being so upset.",
    "[Charm] So what ails you, my friend?",
    "[Charm] Well, is there anything I can do for you?",
    "[Charm] So what can I do for you?",
    "That's a deal - I'll let you know when your cabbages are ready.",
    "Do you have any delphinium seeds to spare?",
    "[Charm] That is why I have come to an expert for advice.",
    "[Charm] Not just AN expert, Elstan - they say you are THE expert.",
    "[Charm] Oh no, I love listening to gardening stories...",
    "[Charm] Millions? Ah, just what I wanted to hear...",
    "Okay, I'll grow you some marigolds.",
    "Do you know how I could grow a White Tree?",
    "[Charm] I think that there is something that you are not telling me.",
    "[Charm] A secret is a dreadful burden to have to keep to yourself.",
    "[Charm] Unless you allow me to do this she will die anyway.",
    "[Charm] These are the most beautiful rosebushes I've ever seen.",
    "[Charm] But it is the only way that these vines will be cured.",
    "I accept the deal.",
    "I need to ask you about strong plant cures.",
    "Are you sure there's nothing you can suggest?",
    "Ask King Roald to follow you.",
    "[Charm] Of course, your majesty - please forgive me.",
    "[Charm] The Queen asked me to bring you."
  ]
}