{
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "Talking to Dr Nabanik without ever restored a Necromantic focus, possible dialogue when talking to Head of Research without being GuildmasterYou can discuss this issue on the talk page or edit this page to improve it."
  ],
  "Player": [
    "Death, I've been To Rasial's citadel. I think his vessel is a giant organ.",
    "No, the musical kind.",
    "Hang on, maybe tell me a little later...",
    "I saw what being a 'student' of Rasial meant for Necrovarus. Did that happen to Orcus too?",
    "I find that hard to believe. You don't need to protect me from the truth.",
    "Why's that?",
    "Wait, they have no afterlife?",
    "You said rarely...",
    "And Orcus?",
    "Oh, say, like a Mahjarrat - they are long-lived.",
    "Wahisietel... Or rather, Dr Nabanik these days - he took up Azzanadra's old mantle as the site manager over at the Kharid-et Dig Site. I believe there's remains of an Orcus cult over there too. That sounds like my best bet.",
    "I'm making progress, thank you.",
    "Dr Nabanik. What can you tell me about Orcus. I'm trying to learn what happened to him.",
    "I'm training to become a necromancer myself, in order to stop the plot of another necromancer named Rasial.",
    "Hmm, I think I've restored one of those.",
    "I'm making progress, thank you.",
    "Engelbert, I was hoping to spin up an extra special research project. I need a team to research a necromancer of old, named Orcus.",
    "Have the Kharid-et dig team discovered anything related to that name?",
    "Oh, right. I shall excavate and restore one and bring it to you. I'll be right back.",
    "I was wondering what more the team could glean from this necromantic focus artefact.",
    "Oh, right, of course. I'll be right back.",
    "I was wondering what more the team could glean from this necromantic focus artefact.",
    "Then it sounds like I should pay Reldo a visit over at Varrock Library...",
    "Do we have a contact at the Wizards' Tower who checked them out?",
    "A book of such repute would hopefully have found its way into the hands of a powerful mage, or perhaps a scholar.",
    "Hello, Reldo. I've been directed to you to retrieve a book for the Archaeology Guild - the Book of Ice, written by someone called Orcus. Do you have it?",
    "Actually...",
    "Oh,, right. I should restore the Book of Ice and hand it into[sic] Engelbert over in the Exam Centre.",
    "Hello, Aubury. I've been sent your way to retrieve some tomes - the Books of Smoke and Blood. The Archaeology Guild has a very special, and urgent, research project in the works.",
    "Hello, Professor. I've been directed here to retrieve some books out on loan from the Archaeology Guild. Can you help?",
    "Hello, Wizard Borann. I'm led to believe you know where the Books of Smoke and Blood are. I've been sent your way to retrieve them.",
    "Approved? By whom?",
    "Yes, and the Book of Blood.",
    "Thank you.",
    "Wait...what about the Book of Blood?",
    "Fine. Just tell me where the Book of Blood is. Aubury doesn't need to find out.",
    "*sigh* I'll track it down, don't worry.",
    "Thank you.",
    "You don't know who here might have a copy of the Book of Blood, do you?",
    "Okay, thank you.",
    "Hello there.",
    "I'm trying to track down a book that might have found its way here. Can you help?",
    "Hello. Do you know who in the guild might have a copy of the Sanguinomicon out on loan?",
    "Er, never mind. I'll ask around some more.",
    "Actually, I'm looking to retrieve the Book of Blood.",
    "I won't say anything. I just need the book.",
    "Thank you.",
    "Oh, right.",
    "Hello, Kohnen. I don't suppose a copy of the Book of Shadow has ever found its way into your esteemed Grand Library, has it?",
    "'Where the sun doesn't shine'...?",
    "What was that you said about the Book of Shadow? 'Where the sun doesn't shine'...?",
    "Aha! There's a book hidden behind here.",
    "I just need to make some room to take it...",
    "Great! Now to restore it!",
    "I've already recovered the Book of Shadow. Now to restore it and hand it in to the research team.",
    "I've tracked down the Book of Ice!",
    "I've tracked down the Book of Smoke!",
    "I've tracked down the Book of Shadow!",
    "I've tracked down the Book of Blood!",
    "I've tracked down the Book of [Ice/Smoke/Shadow/Blood]!",
    "What are the team's findings so far?",
    "I recognise those - they're necromancy glyphs. I don't know how to read them, but I think I might know someone that does.",
    "Thank you for your team's time. I'll go hand these necromancy glyph transcripts to my friend, Death. He'll know what to do!",
    "Oh, ha, it's just a nickname. Not the REAL Death. No, that would be crazy, haha...",
    "I've made some progress. Dr Nabanik also didn't know too much about Orcus, but I was able to find some old artefacts that tell me more, thanks to the Archaeology Guild's research team. I have some transcripts...",
    "What of the fate of Orcus? The tomes mention he was headed to Rasial's tomb, then they just stop. Why would Rasial have a tomb?",
    "Can't or won't?",
    "Why not tell me before now? And did you not reap him?",
    "So I should take these transcripts to Ted, down in the City of Um.",
    "Hi, Ted. I've found these four passages written in necromancy glyphs. Can you make any sense of them?",
    "If I can find your tomb, I might find a way to stop you!",
    "Fine, then tell me about Orcus.",
    "Could have what?",
    "Fine, then what happened to Orcus?",
    "And that's what you're doing with me? Just waiting for me to learn something you don't?"
  ],
  "Death": [
    "What, like a heart or something?",
    "Interesting, though not of immediate relevance. I shall muse upon this new information.",
    "In the meantime, I think it is time you learned of another prior apprentice of Rasial's - the demon duke, Orcus.",
    "Unfortunately, I am not so familiar with this Orcus character, nor their fate.",
    "Alas, I am speaking it. What I do know is that Orcus was once a duke of the Zarosian Empire.",
    "I had very little, shall we say, 'business' where it came to Zarosians. Their beliefs meant it was rare for me to make an appearance at the time of their demise.",
    "The vast majority of them believe they go to Erebus upon death, and so they do. My intervention is not required, nor, I imagine, would it be welcome.",
    "That I do not know. They do not, however, share in the one I lead souls towards.",
    "Indeed. Zarosians were not unanimous in their beliefs. Some still held onto core beliefs from before their people were conquered by the empire; some converted to other beliefs later in life.",
    "A Zarosian loyalist, and a chthonian demon at that. Who could say his beliefs, or his fate? It is lost to history. Or perhaps is known by those who also lived back then.",
    "That was where I was leading, yes. In fact, you know such a Mahjarrat, not only familiar with Orcus, but also one who studies history, and I believe one whom you also call friend?",
    "Then I suggest you discuss Orcus with this 'Dr Nabanik' friend of yours.",
    "How go your dealings with the Archaeology Guild?",
    "How go your dealings with the Archaeology Guild?",
    "Hmm, this does help explain some things. It appears that Orcus learned of Rasial's existence as 'the first necromancer'. Orcus, having interest in this burgeoning field of magic, sought Rasial out to learn from him.",
    "This would suggest that Orcus was, in fact, the first so-called apprentice of Rasial. This does explain the timings of Rasial's appearances through history.",
    "The first recollection I have of Rasial being a problem was some thousand years after the dates in these transcripts. Hmm, interesting...",
    "I would imagine Rasial would be the one to ask about that. As for a tomb...I cannot say.",
    "Rasial was not always a necromancer. He was once just a mortal man. His tomb would be for his earthly remains; I cannot imagine it being of much help to our cause.",
    "It is not important how he lived, nor how he died. What matters is who and what he is now, and his interest in you.",
    "In fact, these tomes should prove to be a valuable part in our plan to stop him. Orcus did become a powerful necromancer in his time.",
    "Unfortunately, I cannot read necromancy glyphs. However, I suspect the residents in the Well of Souls could help you to parse them.",
    "That is an excellent idea."
  ],
  "You do not meet the requirements to start": [
    "'Tomes of the Warlock'.",
    "'Tomes of the Warlock'."
  ],
  "Dr Nabanik": [
    "Orcus? The Necromancer? Now that's a blast from the past. What's your interest?",
    "Rasial? Never heard of them. I can tell you a bit about Orcus, though.",
    "He was a chthonian duke, head of one of the old empire's legions. And, yes, as his name suggests, a necromancer of some repute.",
    "A cult was built up around him. Apparently, he was quite the whiz with necromantic incantations, and authored a lot of books on the subject.",
    "In point of fact, the team here have discovered an artefact that might provide more insight - a necromantic focus. Perhaps you should excavate one...",
    "Ah, good. I would suggest, then, that you take a restored one by Engelbert, the Head of Research back at the Archaeology Campus."
  ],
  "Head of Research": [
    "Welcome!",
    "Hmm, I do recall a record noting a 'necromantic focus' artefact, a book named the Orconomicon.",
    "I don't think we have such an artefact to hand here in research, however.",
    "Of course, though...if you'd be so kind as to restore it first. It will make our research go a lot quicker.",
    "May I?",
    "Let me see... This book is titled the...Orconomicon. The Book of Orcus, one presumes.",
    "Boring autobiography... Teenage years... Various wars... Magical experimentation... Aha!",
    "Here we are! There is mention here of a series of other books written by Orcus.",
    "Four others, in point of fact. Oh, and according to my records, the dig team at Kharid-et have discovered a number of damaged books on site.",
    "Which book would you like to know about: ice, smoke, shadow or blood?",
    "Let me see... Ah, yes. There was a light blue tome, which is currently out on loan to Varrock Library.",
    "We outsourced some restoration work, and Reldo has been working very closely with our team here - a liaison of sorts due to the source of much of our funding...",
    "Still, Reldo has provided a number of useful insights during our collaboration, so it's not been a complete wash.",
    "One moment... Aha! Yes, it appears that books of both Smoke and Blood were checked out by the scholars over at the Wizards' Tower.",
    "The Guild fought against it, of course, but King Roald was, apparently, insistent. Something about diplomatic relations. I do so hate politics.",
    "Not as such. The paperwork names only Layte Aubury as the tower's representative in Varrock, who brokered the exchange. Or I suppose you could just harass the tower's librarians.",
    "Sources suggest a copy was kept within Kharid-et's vaults, though unfortunately one that was at some point stolen from.",
    "Based on other research, the suggestion was that it found its way into what is now the Kharidian Desert.",
    "Well, the city of Menaphos is said to have a library unrivalled in the world. Perhaps you might pick up a lead there?",
    "Well, whenever you see fit to hand us the artefact, my team will be more than happy to assist.",
    "Welcome!",
    "Welcome!",
    "Welcome!",
    "Which book would you like to know about: ice, smoke, shadow or blood?",
    "Well, where is it? Bring me the restored book and I will pass it over to the research team.",
    "Ah, would you mind restoring it first? We can't really research it in its damaged state.",
    "Well, where is it? Bring me the restored book and I will pass it over to the research team.",
    "Ah, would you mind restoring it first? We can't really research it in its damaged state.",
    "Well, where is it? Bring me the restored book and I will pass it over to the research team.",
    "Ah, would you mind restoring it first? We can't really research it in its damaged state.",
    "Well, where is it? Bring me the restored book and I will pass it over to the research team.",
    "Ah, would you mind restoring it first? We can't really research it in its damaged state.",
    "Welcome!",
    "That's all four books, good job.",
    "I can give you one thing that might be useful. Each of these books contains some strange markings - symbols we've never seen before. Here, like these...",
    "Hmm, I'll tell you what. You should take transcripts of these markings to whoever this person is, but leave the books with us and we'll create a new research project to have a more thorough dive into them.",
    "No need to start that research now, just whenever you'd like to.",
    "What? Death?",
    "Welcome!",
    "Welcome!"
  ],
  "Head of Reserach": [
    "Ah, yes... Unfortunately, no copy of the Book of Shadow has been uncovered so far, only mention of it."
  ],
  "Reldo": [
    "Getting involved in necromancy now, are you? Well, I can't say I'm shocked...in spite of what my face might suggest.",
    "I hope this is just for academic interest and not some other end of the world thing.",
    "Never mind, I don't need to know. If it were anyone but you, I'd hesitate, but here you go...",
    "Oh, you'll need to clear up some room to take it first.",
    "Mind you, it's seen better days. In need of a little restoration first, I'd say.",
    "Here, you must have lost this...",
    "Oh, you'll need to clear up some room to take it first.",
    "Mind you, it's seen better days. In need of a little restoration first, I'd say."
  ],
  "Aubury": [
    "Ah, yes, of course. I don't have them here. The last person who checked them out was...Wizard Borann over at the Wizards' Tower.",
    "I will contact him ahead of your visit so he knows to expect you."
  ],
  "Professor Onglewip": [
    "Ah, right. You should talk to Wizard Borann about those. He's been liaising with the guild for any new books of interest."
  ],
  "Wizard Borann": [
    "Ah, apologies, but I can't just hand out tomes of such power willy-nilly. I can only release those to approved individuals.",
    "You'll need to talk to Aubury in the rune shop over in Varrock. He's my liaison to the Archaeology Guild.",
    "Ah, Player I take. Aubury contacted me just now. You're here to collect the Book of Smoke, yes?",
    "Here you are...",
    "You'll need some room to take it.",
    "It's seen better days, but I'm sure you can give it a spruce up!",
    "Ah, I was hoping the other book alone would appease you. I, er...don't have the other one.",
    "I know, I know. It shouldn't be loaned out without Aubury's approval - please don't tell him!",
    "It was passed along to our colleagues at the Wizards' Guild in Yanille.",
    "I, er, don't recall who exactly...",
    "You dropped this...",
    "Ah, you'll need some room to take the Book of Smoke."
  ],
  "Professor Imblewyn": [
    "Shh, keep your voice down. You'll get Frumscone in trouble.",
    "You'll want to talk to him down in the basement."
  ],
  "Wizard Distentor": [
    "Welcome to the Magicians' Guild!",
    "What can I do for you?",
    "You'll want to talk to Zavistic Rarve. He handles that sort of thing. Anything else I can assist with?"
  ],
  "Zavistic Rarve": [
    "The what? Can't say I've ever heard of such a thing. Doesn't sound like wizard stuff to me. Is that sort[sic] sort of gnomish cook book?"
  ],
  "Wizard Frumscone": [
    "Do you like my magic Zombies? Feel free to kill them, there's plenty more where these came from!",
    "Oh... Er... Please don't tell Zavistic. You can take it, but I'd get in trouble if he knew I was experimenting with it down here.",
    "Right, of course. Thank you. You'll need some room to take it, though.",
    "It kind of got a bit beaten up. You might want to give it a quick restoration.",
    "Do you like my magic Zombies? Feel free to kill them, there's plenty more where these came from!",
    "Don't leave this laying around, they'll know it was me!",
    "Clear some room and take this Book of Blood already, will you?"
  ],
  "Kohnen the librarian": [
    "Vile, cursed books such as that have NO place in this library. Dark, forbidden magic people shouldn't be messing with!",
    "If ever such a book were found here, well, you can stick it where the sun doesn't shine. Now, don't ask again.",
    "*Ssh*!",
    "I also said 'don't ask again'!",
    "Also *ssh*!"
  ],
  "NEW Research Available": [
    "'Nom-Nom-Nom-Nom'."
  ],
  "Ted": [
    "Come back when ya have more room in your backpack, bud!",
    "I think they're incantations. Here, lemme chuck 'em in the well. We can use the collected knowledge of everyone in it to decipher 'em.",
    "Once deciphered, you might have some more learning to do, but we'll get ya there, bud!"
  ],
  "Congratulations! You have completed": [
    "'Tomes of the Warlock' - Complete this quest."
  ],
  "Research": [
    "Nom-Nom-Nom-Nom"
  ],
  "Information gathered": [
    "The five books work like a quintych! While coherent in their own right, certain sections of the books lead into parts of the other books in sequence. The team found a hidden message but can't decipher it further: 0216N0724E"
  ],
  "Rasial": [
    "I'm standing right here...",
    "Following in the footsteps of Orcus, I see. And just what do you hope that this will achieve?",
    "Would that be the tomb for my mortal remains? Remains decayed ages hence, in a tomb now utterly filled in with dirt?",
    "At least Orcus was timely...",
    "He sought me out to devour my remains. It's a chthonian thing; he sought to absorb my knowledge and power. Unfortunately for him, the reverse is what happened.",
    "I greeted him as a fellow necromancer, the first of our kind on this world after my own rise. He taught me of the primordial elements and of Erebus.",
    "The revelation both scared and angered me. Scared for what this other realm would do to ours. Angered at Guthix for keeping such a dark secret from me!",
    "If only Guthix had told me, I could have...",
    "Ah, but that is a revelation for another time.",
    "The same thing that happens to all necromancers who seek me out. I take them under my tutelage, build them up and set them loose on the world.",
    "Then, once they have surpassed my own knowledge in some way, I wring out all of their secrets, then obliterate them.",
    "In part. Do not worry; you have yet to learn anything I have not known for many lifetimes. And you will learn nothing of value here...",
    "...So do not disturb me like this again."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Tomes_of_the_Warlock?oldid=36235861’"
  ]
}