{
  "Brimstail": [
    "Hello adventurer, what can I do for you?",
    "Oh Izzie? He's my pet.",
    "I'm not sure. He's very cute though don't you think? It's very restful having a pet, especially when you are stuck in a cave for as long as I am!",
    "Isn't that obvious? I investigate Thaumaturgy, I research the Arcane, I attempt to explain the inexplicable.",
    "Are you a budding mage? I can tell you more about my research if you'd like.",
    "Excellent, it's so rare I can find someone to discuss my researches, most gnomes seem to find it all very tedious.",
    "Well that's true. These days, apart from a few combat spells most gnomes seem to be a bit suspicious of mages.",
    "Well there is a bit of history there, do you want me to tell you about it?",
    "Very wise, a good knowledge of the History of Magic is crucial to understanding the Arcane. Well, the most famous Gnomish Mage of all got into a bit of... trouble. Most gnomes don't really talk about him. Other than telling stories about him as if he was some sort of boogie-man. Ridiculous! He was a gnome like any other – he sounds like a fascinating character. He was one of King Healthorg the Great's advisors during the Grand Migration. But he was exiled after the Goblin Wars.",
    "Well, I'm not really sure. This was all before I was born – and no-one talks about what happened to Glouphrie these days.",
    "Well, maybe? I'm not so sure. As it happens I've been looking into that part of our History. All I've managed to establish was that he was particularly interested in optics and light magic.",
    "Well, indeed. I have also found out though he was generally disliked by other gnomes – his moniker was 'Glouphrie the Untrusted'. Oaknock the Engineer and Glouphrie didn't like each other either...",
    "Ah, Oaknock was an engineer and architect. Very famous. There are statues to him around the place – his reputation amongst gnomes is second only to King Healthorg himself. He built most of the Stronghold you know. Are you really interested in all of this? Do you want to see something interesting?",
    "Well, have a careful look around at everything in the next cave and come back and tell me what you find.",
    "Fine! Humans really do prefer to live their lives in ignorance...",
    "Gah! Young mages these days. No patience. No perseverance. Magic is not a toy or a shiny weapon you know! You cannot alter reality unless you understand it. And you cannot understand unless you search for the true causes of things. And history is a record of the causes of things.",
    "Well, I'd better carry on with my research then.",
    "Well, I'd better carry on with my research then.",
    "Hello adventurer, what can I do for you?",
    "Ah, yes indeed. Well I do have a little mystery for you. Has your curiosity been piqued?",
    "Well, have a careful look around at everything in the next cave and come back and tell me what you find.",
    "Fine, wander blindly on then!",
    "Hey! Leave the bowl alone. Where would all the drips go? All over my books that's where.",
    "So? What did you find?",
    "Indeed, sadly I know very little about that, it looks elven to me though...",
    "That's right. It was built by Oaknock.",
    "That room used to be Oaknock's workshop. I'd also recognise his style anywhere.",
    "I have no idea. But I do know someone who might. There is one gnome left alive who knew Oaknock, and King Healthorg and Glouphrie for that matter...",
    "Have a guess.",
    "Well, King Narnode tells me you've already visited him...",
    "Very good, young apprentice.",
    "That's right. He was the third advisor to King Healthorg, he found and tended to the Grand Tree. If you are really interested in all of this, then could you do me a favour and visit Hazelmere for me? I've been meaning to go for a while, but I have responsibilities here – there's always someone who wants to use the rune essence mine.",
    "Good! Good!",
    "Ha! He's an old fashioned kind of gnome and doesn't like visitors much. But I'm sure he'll want to talk about the Old Days.",
    "That may be true, though he may just be faking it to deter visitors. Either way – he is a wise old gnome. If he really wants to talk to you I'm sure he'll find a way.",
    "Well ask him if he knows anything about Oaknock's machine. And anything you can find about Glouphrie would be very interesting, wouldn't you agree?",
    "Fine, wander blindly on then!",
    "Hello adventurer, what can I do for you?",
    "So haven't you managed to have a chat with Hazelmere yet?",
    "He has a hut in a small island east of Yanille. It has a lovely sea-view, I'm jealous. I love my cave, but it's not very picturesque.",
    "Oh, that's not my potplant. I think it was Oaknock's.",
    "I suppose it must be. It shakes every now and again you know... I don't know why.",
    "Ah, thank you my young apprentice. What did he tell you?",
    "Excellent! I like a good story.",
    "So the machine emits an anti-illusion glamour?",
    "Don't you know anything? *sigh* A glamour is a type of enchantment or magical effect.",
    "Oh, crystal discs? I may have a few of those in a drawer somewhere.",
    "Really? Wait – what's that banging noise? What's happened to the machine? It's broken!",
    "This is intolerable! How could this happen?",
    "But we were just standing here, how could someone get past us?",
    "Wait a minute, how did the saboteur know about the macine? Hmmm ... You're the only person I've told about the machine.",
    "Surely this couldn't be the work of Hazelmere... That turncoat!",
    "Alright. Someone snuck in here without us noticing. How?",
    "Right, and how does one make oneself invisible my boy/girl?",
    "Invisibility is a form of illusion magic. So that makes sense.",
    "Who knows, but he may well have taught his skills to his gnomes.",
    "Right. And why would they sabotage an anti-illusion device?",
    "Of course. Which makes it imperative that we fix this machine and find out what it is! Have a look at the machine and assess the damage. I'll hunt around my boxes and see if I can find anything that might help.",
    "Have you had a look at the damage yet?",
    "So how are your investigations going?",
    "Hmmm, which runes would you think are sticky.",
    "Open your mind and think laterally. Thinking sideways is an important skill for a mage.",
    "I concur.",
    "Keep going.",
    "Patience young apprentice. You are on the right path - just think it through and I'm sure it will become obvious.",
    "What did Oaknock do?",
    "So there you go. What more do you need to know?",
    "That's right, use your noddle, exercise your noggin, employ your cranium. Think, think, think!",
    "Well done! You're almost as good at fixing things as a gnome! Who'd have thought?",
    "So what do you think the number means?",
    "That reminds me, I found those crystal discs I mentioned before. They are not quite the same as the one Hazelmere gave you, but they look similar in size and weight.",
    "I wonder if the different sizes and shapes mean anything.",
    "That's the spirit! This is all good training for the mind...",
    "Hmmm. Maybe all of these discs all have different values and you have to choose the right one in order for it to work?",
    "I'm not sure, but there will be some logic somewhere. Maybe if you look around the workshop you'll find some clues?",
    "Oh, I've been rooting through my drawers and I've found a few more discs that you might find useful.",
    "I wonder how it works? a similar way to the locking mechanism I'd guess.",
    "Well done [Adventurer]! I knew you'd work it out. I'll make a mage out of you yet... Wait... What's happening... Eek!",
    "Izzie! No! There's something very wrong going on here...",
    "Well, it seems that Izzie was not so cute after all! How awful! How mysterious!",
    "Izzie just wandered into my cave. He was cute and friendly so I kept him. He seemed very curious, and used to watch me do my researches. I liked the companionship – research is lonely work...",
    "I suppose it has. I hadn't thought of it like that. I'm sure I've seen others of these creatures around the place...",
    "I think King Narnode has one, and I think I saw one by the gates. And I'm sure I've seen a few more wandering around.",
    "Oh my goodness. I think I'm beginning to understand where you are going with this.",
    "So that horrible thing was listening to us all along. You'd better tell the King what's going on.",
    "So this horrible thing is listening to us right now... Aargh. Get rid of it! Don't forget to tell the king what's going on!",
    "Have you talked to the King yet?",
    "That's a relief. Well, that's all good work, but I think you'd better inform the King now."
  ],
  "Player": [
    "What's that cute creature wandering around?",
    "What kind of creature is Izzie?",
    "So, what do you do down here anyway?",
    "You study magic then, what kind of magic? I do a bit of magic myself you know.",
    "Yes, that sounds fascinating...",
    "Never. How could they think that? Though, I suppose gnomes aren't known for their magic.",
    "Really? Why is that?",
    "Oh, yes I love a bit of History.",
    "Why was that?",
    "He must have done something very bad then.",
    "It's hard to see what he could misuse light in a way that would get him exiled.",
    "Oaknock? I haven't heard of him before.",
    "Of course!",
    "Errm, not right now. I'd better go.",
    "I'm more interested in your researches right now.",
    "I stand corrected - tell me more.",
    "Actually I'd better get going...",
    "Err, maybe some other time.",
    "I need to mine some rune essence.",
    "We were discussing gnome magic...",
    "Of course!",
    "Actually, I'm a bit busy right now.",
    "I've had a look in the other room now.",
    "There was a pit with a crystalline looking bowl in the centre.",
    "There is also a large strange looking machine...",
    "How do you know that?",
    "What does it do?",
    "Who is that?",
    "Errm...",
    "Err... Oh I know, you're talking about Hazelmere aren't you?",
    "Didn't he help create the Grand Tree?",
    "Of course, I'd love to!",
    "Wait a minute – am I going to have to translate everything he says using that dictionary again?",
    "But he only speaks Ancient Gnomish!",
    "Well alright, if you say so. What do you want me to ask him?",
    "Right then. I'd better be on my way. I'll be back soon.",
    "Actually, I'm a bit busy right now.",
    "Not yet I'm afraid. Where do I find him again?",
    "Maybe you need some pictures. Though your pot plant adds something to ambience of the place.",
    "Really? It's survived a long time. It must be a special pot plant.",
    "How very odd. Anyway, I'd better get on my way to Hazelmere... See you soon.",
    "Err, hello Hazelmere.",
    "Brimstail has sent me to ask you some questions.",
    "I have some questions about the old days. Brimstail has been filling me in about Gnomish History.",
    "It sounds like a fascinating time. It also sounds like some important things happened then. Events that we shouldn't forget.",
    "He has also found a machine – he says it was built by Oaknock...",
    "Erm, I'm sorry I don't understand a word you're saying.",
    "Weird! How are you doing this Hazelmere?",
    "So how do I do this. Wow. That's impressive. Brimstail was telling me that Gnomes don't trust Mages these days. Can you hear me? Glouphrie wasn't it? He did something bad and got exiled. Ooh, I'm feeling a little dizzy. You knew him didn't you? What can you tell me about him? And what's this machine that Oaknock built? Isn't that magical as well? Do you know what it does?",
    "Clear my mind? Hey, how did you know my name.",
    "How do I think about nothing? I'll give it a go. ... ........ Hmm tasty lobster. Gah! I'm thinking about something. Stop thinking about Lobsters. Pink Lobsters. Big Lobsters. Lobsters with wings. Wings? Lobsters don't have winds. ARGH. I can't do this.",
    "Hey! Was that you next to the tortoise? You look so handsome!",
    "So where's this Arposandra place anyway?",
    "Why do you think that?",
    "So the machine that Brimstail has found is the one Oaknock built to stop Glouphrie's illusions. Do you know how it worked?",
    "Well, thank you, Hazelmere. You've told me a lot of things I need to ponder for a while.",
    "I'll do that. Farewell.",
    "Oh yes...",
    "I've visited Hazelmere, he told me all sorts of interesting things.",
    "He told me quite a story. You may want to take notes...",
    "Right. Well it starts during the Great Migration...",
    "Glamour? What's that?",
    "Oh yes it does have such a glamour. It seems to use crystal discs to work in some way.",
    "What's that? Something just moved behind you...",
    "Hmm, something is afoot. I sense sabotage...",
    "The machine is broke, I suspect sabotage...!",
    "I'm confused, it must have happened while we were here talking!",
    "I did see something odd behind you...",
    "Hey! Don't look at me like that. The only person I've talked to is Hazelmere.",
    "Wait! Wait! None of this makes any sense. There must be another explanation.",
    "The intruder must have been invisible.",
    "Illusion magic?",
    "So this was done by Glouphrie? Is he still alive?",
    "You mean the gnomes that went to Glouphrie to Arposandra?",
    "Because there is an illusion that they want to remain hidden?",
    "Not yet. I'll get right to it.",
    "I'm still a bit confused about how to fix Oaknocks machine.",
    "I'm not getting anywhere with these 'sticky runes'.",
    "Runes are runes! None of them are sticky! They're all round and disc-like and definitely non-adhesive.",
    "Oh, all right. I'll give it a go. Well - air, water and fire and earth runes. There's nothing sticky about them.",
    "Mind and body runes. Again distinctly non-glue-like in any way.",
    "Nature and Cosmic runes. Once more distinctly lacking in any gooeyness. Bah! This is a waste of time.",
    "Maybe. What do I do with the rune when I find it?",
    "Well it looked powdered in the glue.",
    "Right. I'll go away and think about what you've said.",
    "I think I've fixed the machine now!",
    "Though I still don't think it's actually activated. There appears to be some sort of lock on the front. I think I know what the discs are for though. There's a slot in the front that looks like it might fit a disc, and a number.",
    "I'm not sure yet. Maybe I should put a disc into the slot and see what happens?",
    "They also look as if they might fit in the slots on both of the machines. Maybe I should try it out?",
    "I've been thinking that as well. I shall ponder it some more... I'll work it out.",
    "I can't work out what to do with these discs!",
    "Interesting. But how do I work out which discs are worth what value?",
    "I'll have a look.",
    "Thanks, I'm sure they'll be very useful.",
    "I think Oaknock's machine is now unlocked, what do I do now?",
    "I seem to have opened some sort of control panel.",
    "There seems to be more than one slot. Maybe I need more than one disc?",
    "Huzzah! It's working!",
    "What on earth!?",
    "Phew! I've got that machine working now. What do I need to do now?",
    "So this was the illusion the Arposandrans went to so much effort to conceal? A pet. That wasn't cute enough. Where did you find this one?",
    "So he's been keeping an eye on you while you do important magical research...",
    "Where?",
    "In other words all places to keep an eye on what's going in the Stronghold...",
    "Yes, they must be spies. They are watching us with those creepy red eyes. And they must have told someone that we were working on the machine.",
    "What should we do about these creatures?",
    "I'll get on it now.",
    "What should we do about these creatures?",
    "I'll get on it now.",
    "Good day sire, I take it you've noticed that cute creature you had in here is looking rather different now.",
    "I think I do. It's a long story but the short version is this. The Arposandran gnomes have planted these creatures as spies to watch what's going on in the Stronghold.",
    "I have just reactivated a machine that was built by Oaknock that dispels illusions, and now these creatures' true forms are revealed.",
    "Well, I wouldn't go as far as that – it is only through Brimstail's and my researches that we have established this is going on.",
    "I don't know sire.",
    "I'm right on it.",
    "Not yet, I'm still looking for them.",
    "I've killed all of the spies.",
    "I'll get on it now.",
    "I think so. There were six in total.",
    "Help? I did all of the hard work!",
    "So what will you do now?",
    "It's certainly worrying, and whoever sabotaged the machine couldn't have been far from here. Are there gnomes here who are also spies?",
    "If you find out more I'd be willing to help investigate.",
    "What's that?",
    "Hmm I wonder what it does?"
  ],
  "The picture has 7 columns that are": [
    "red, orange, yellow, green, blue, indigo and violet. The number of boxes in each column goes up progressively from red to violet. Maybe it's a clue."
  ],
  "Hazelmere": [
    "Blah. Blah, blah, blah, blah...blah!",
    "Blah, blah, blah human. Sarko!",
    "Ha! Atarischeray! Blah blah mesi blah blah.",
    "Blah Brimstail blah blah human blah minahar!",
    "Hmmph. Laquinay blah human. Blah blah blah.",
    "Oaknock! Ha blah blah minapor blah blah blah. Blah blah blah Oaknock blah blah blah. Blah blah blah blah. Blah blah blah blah Healthorg cinqo blah blah blah.",
    "*SIGH* Ipmesi human.",
    "Hmph. Not bad for a human.",
    "Old magicks beyond your skill human. You can stop flapping your big human lips as well. Just think.",
    "Stop wittering on [Player]. You're giving me a headache. This mind speech is hard enough without having to listen to your incoherent babbling. Think about nothing. Clear your mind.",
    "I'm reading your mind foolish human. How do you think? Now CLEAR YOUR MIND...",
    "Just shut up and listen! I have a story to tell you that will answer most of your questions. Let us travel back in time, to the time you humans call the Fourth Age. King Healthorg had become King. The elves mysteriously decided to travel west, leaving most of Kandarin open for conquest. The humans weren't here yet, only King Healthorg and the gnomes to the north, and a collection of Goblin tribes to the south. Both armies moved to claim the lands, and were of course destined to meet in battle... And so it came to pass the Goblin and Gnome armies met at the Battle of Atarisundri. Both sides faced each other on the Battlefield. A bloody battle was in prospect, our gnomes were brave, but were no match for the mass of brute goblin stupidity... ... but Glouphrie and King Healthorg had devised a plan... ... If you don't lead an invincible army – pretend you do...",
    "And so, Glouphrie created an army of illusory Giant tortoises, knowing that goblins would be scared of anything bigger than they were.",
    "Handsome! Hmph! That was a long time ago... Anyway, where was I? Oh yes... Sadly, the golden times were not destined to last for long... There was once a very special Spirit Tree in the Stronghold. Silver as a birch, old and wise – I considered him a friend. I called him Argento, his true name was unpronounceable. He was the first Spirit Tree I had befriended, and the one I knew the best. I would sometimes travel, visiting and finding other Spirit trees, and during one such trip, I was filled with a great sense of foreboding... I felt a shadow pass over me and a tingling in the air, even though the weather was fine and dry. Then I felt a sudden pain, as if the Anima Mundi was crying out with the loss of a favoured child... And I knew that one of the Old Ones had died, and I had lost a friend. I rushed straight back to the Grand Tree, only to find that no-one had noticed anything, and that Argento was still standing and seemed alive. But I knew something was wrong. He refused to talk to me and his aura was no longer present. Someone had hidden his death. I talked to Oaknock and he was incensed. He immediately blamed Glouphrie, and although Oaknock could be rather irrational when it came to Glouphrie – they never saw eye to eye – I knew he was right this time. Glouphrie had used his magicks to hide the truth from all of us. Oaknock had made a machine – an anti-illusion machine, with some help from the elves. He prepared it, and summoned the advisors to Argento...",
    "And so Glouphrie left and travelled with some companions to a place they called Arposandra. We have heard nothing but rumours about them since...",
    "Nobody knows for certain, somewhere rocky I suppose. The rumour is that after founding his new home, Glouphrie used his magicks to shroud the city in mist. Arposandra may not exist at all, however I suspect that Glouphrie is still around, one way or another.",
    "Just call it Gnomish intuition.",
    "I never studied it but I believe it used elven magic – So it must have used crystals of some sort. Crystal discs, yes that sounds familiar. Actually come to think of it I think I may have one lying around. Here, take this. Maybe it will help you.",
    "Very well. Oh and when you see that lazy toad Brimstail, tell him next time he needs information to come himself.",
    "What do you want now? Go and talk to Brimstail, that's why you came to see me in the first place..."
  ],
  "Glouphrie the Untrusted": [
    "Em Gal lauf rei! Emeto Laufolly egramentos umesco lamiten gan!"
  ],
  "Goblin": [
    "Big Boss didn' say buffin 'bout de nomies havin' monsta tortisses!",
    "Dey be huges! Tortisses too scary and pointy. We runs away!",
    "Scarey tortisses! Runz!",
    "Runz away!"
  ],
  "King Healthorg": [
    "Why have you summoned us here?",
    "What is the meaning of this?",
    "Explain yourself!",
    "How can lying to your fellow gnomes be 'Good'?",
    "Even from your King!?",
    "Enough! How can I trust a gnome who hides things from me?",
    "That is NOT how I rule. Glouphrie. You are no longer my advisor. Leave this place.",
    "Sarko!"
  ],
  "Oaknock the Enigneer": [
    "You'll see sire. Switch the machine on!",
    "The Silver Spirit Tree is dead! Glouphrie has been using his foul arts to mask the truth! What other secrets has he been keeping?"
  ],
  "Glouphrie": [
    "I live to serve you sire. I work for the good of us all.",
    "Some things are best kept secret...",
    "Occasionally.",
    "No gnome can blame you for what you do not know.",
    "Only the naïve believe they can rule without someone like me. Your empire will crack and gnome will become but a joke.",
    "So be it. I'll be watching."
  ],
  "King Narnode Shareen": [
    "Why yes! Do you know what's going on?",
    "What!? That's outrageous!",
    "Glouphrie! Now we know what he has been up to all these years. Gah! Never trust a Mage.",
    "Harumph! Well, all of these creatures must be removed, we cannot allow the Arposandrans to spy on us any more. How many of these things are there?",
    "Well find them all and dispatch them now.",
    "Have you found all of those spies yet?",
    "Have you found all of those spies yet?",
    "Thank goodness. Thank you for your help. Brimstail also tells me that you helped him a lot finding out what was going on!",
    "Aha! Getting others to do the donkey work seems to be a skill that Mages develop well.",
    "Well, I have many things to think about. Why are the Arposandrans spying on us, and what are they planning?",
    "Indeed, that is another thing that worries me...",
    "That may well be useful. Thank you – I may well call for your help again. Oh, before you leave – I have something you might like.",
    "It was passed down to me from King to King. It belonged to Oaknock. He proclaimed that only a hero of the gnomes should have it. I think you count as a hero. Also since you have been looking into Oaknock you might be able to work out what it is.",
    "Well, I'm sure that your magical research skills will help you there. Good luck!"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:The_Eyes_of_Glouphrie?oldid=33844535’"
  ]
}