{
  "Ug": [
    "Arrrghhh, die man-thing! Ahhh, it no use, I too sad!",
    "I love Aga, she so beautiful, she smell so nice, like rotting dead ice wolf! But Arrg... that arrrrrg! He together with Aga and he much stronger than Ug. He rip Ug apart!",
    "She most beautiful troll in world. Ug want to marry Aga, but she with Arrg!",
    "Arrrrghh!",
    "You help Ug? You nice, maybe Ug not eat you!",
    "Go away, man-thing, leave Ug alone!",
    "You talk to Aga yet?",
    "You talk to Aga yet?",
    "Oh no! Then Ug no chance. Trollweiss not found in years!",
    "You no chance, Ug no chance, need someone who live whole life in mountains. Ug no know anyone like that...",
    "Have you got the flower yet?",
    "Thanks man-thing. Ug so happy! But me too scared to give Trollweiss to Aga because Arrg will eat Ug for breakfast.",
    "You no touch Aga. Ug kill you.",
    "No, no, no, wait! Ug just joke, oh great man-legend. Ug puny, you strong.",
    "You defeat Arrg yet?",
    "You defeat Arrg yet?",
    "You very strong and nice. Take pretty rock as thanks.",
    "I too scared.",
    "Whaaat? Man-thing want to die? Ug no scared of you or your grandmother! Ug show you. Ug go to Aga now.",
    "I give Trollweiss to Aga and she say it taste very nice. She very happy and we together now.",
    "Thank you many for getting Ug together with Aga. We much happy together! I so happy I can't stop crying!"
  ],
  "Player": [
    "Awww, your poor troll. What seems to be the problem?",
    "Who is Aga?",
    "Arrg?",
    "This is getting confusing!",
    "Don't worry now, I'll see what I can do.",
    "Errrr... thanks... I think? I will go and talk to Aga.",
    "A crying troll who's in love? This just gets better and better!",
    "Hahahahaha... a crying Troll. I bet all the other trolls laugh at you!",
    "Hahahahaa!",
    "Sorry not yet...",
    "Well... you're big and hairy?",
    "Errr...",
    "(I can't believe I am asking a troll about her love life!!) So... how's your... um... love life?",
    "(Maybe Trolls DO have a romantic streak!) And Arrg said he would get you the flower?",
    "So... what do you think about Ug?",
    "You know that wimpy, crying... nevermind.",
    "Errr... I've got to go.",
    "Errr... I've got to go.",
    "O-oh, he seems cheesed off...",
    "Ehh, Excuse me... Mr. Troll, sir.",
    "How did you grow so big and strong?",
    "Your girlfriend said you know where to find Trollweiss?",
    "Errr... Aga.",
    "(What a jerk!) Yes, yes, you're great, but what about the Trollweiss?",
    "So you don't actually know where to find the Trollweiss? Great...",
    "I've got to go.",
    "Yes, she said that she really wants a certain flower! Trollweiss, I think she called it.",
    "Don't worry I'll find it for you!",
    "Hang on a sec...",
    "Do you know where I can find Trollweiss?",
    "That's the stuff. Do you know where I can find some?",
    "So how do I get down there?",
    "Thanks I'll go check with him!",
    "Hi!",
    "I need a sled!",
    "Yes.",
    "No.",
    "No, I actually still like rolling around in the snow.",
    "I need the sled to get to a certain location in the mountains.",
    "Yes, I have all the materials for the sled.",
    "Where can I get wax from?",
    "Where can I get swamp tar from?",
    "What else do I need?",
    "See you!",
    "No, I haven't got everything yet.",
    "Yes, I've got it right here.",
    "What? So I have to get rid of Arrg as well? After all this trouble I should be the one getting the girl... Then again maybe not.",
    "Ok, I'll tell Arrg you said that. Shall I tell him to meet you here?",
    "I suppose I am a bit of a legend. Ok I'll do it!",
    "No, not yet. Something like this requires careful planning.",
    "Ehh, Excuse me... Mr. Troll, sir.",
    "I am here to kill you!",
    "But not in front of the lady, let's take it outside.",
    "Aga deserves better than you.",
    "But you don't love her!",
    "Looks like I'm going to have to teach you a lesson in 'love'. But not in front of the lady, let's take it outside.",
    "I've got to go.",
    "Yes, he has been defeated.",
    "Thanks, Ug. So, now you can go and speak to Aga!",
    "Has anyone ever told you that you are a useless troll? My grandmother has more guts than you and she doesn't even have her teeth anymore!",
    "How did it go with Aga?",
    "What? I went through all that trouble to get a snack for a hungry troll?"
  ],
  "Aga": [
    "What do you want, man-thing?",
    "Thanks, me very careful about looks!",
    "It ok. I with Arrg, he very strong and mighty but sometimes... I not know if he love Aga. He says he will show he love by bringing me flower Trollweiss. It a very beautiful flower, it very special! It grow somewhere in these mountains.",
    "He very strong, if he love Aga he will get Trollweiss.",
    "Who?",
    "Aga can't wait for Trollweiss. Arrg will show his love!",
    "Thanks for getting Aga and Ug happy. Without you Ug too shy, Aga so in love with Ug!"
  ],
  "Arrg": [
    "Aaaarrrrrghhh!",
    "Whaaaaaaaat?",
    "Get away from Arrg, puny man-maggot. Or you lunch!",
    "Girlfriend? Which one?",
    "Yes, she good cook and wash but talk too many. Arrg strong troll. Arrg mighty troll. Arrg have many girlfriends!",
    "I no know, I just say to make Aga shut up!",
    "Whaaaaaaaat?",
    "Very good, Arrg was getting hungry.",
    "What you mean? Arrg strong troll. Arrg mighty troll. Every troll woman want Arrg.",
    "This concept of 'love' confuses and infuriates Arrg.",
    "Arrg!",
    "Oh mighty man-warrior, please no hurt Arrg."
  ],
  "Freda": [
    "Hello Player, what can I do for you today?",
    "Trollweiss? The plant you mean?",
    "Well, I know it used to grow all over the place, but it is dying out now. If you really, really want it, you might want to try checking in the lair of the ice trolls. But that's not a very attractive prospect. You'll need to go to an area of bitter, biting cold and savage beasts. And then, once you've overcome that, you'll need to find a way to slide down to the plateau below. It used to be easy, but there has been some lethal snowfall there. They say it has something to do with climate change, but I blame those ice trolls myself.",
    "You could try making a sled. I'm not sure myself how to make one, but Dunstan might."
  ],
  "Dunstan": [
    "Hi, Player. What can I do for you?",
    "Haha, very funny! Aren't you a bit old for rolling around in the snow?",
    "So why do you need a sled then?",
    "Hahahaha.",
    "Well, I guess some of us never grow up!",
    "Well, since you've helped my family out a couple of times, I'd be glad to build a sled for you. Let me think... ... Yeah, that should do it. I will need some yew or maple logs, a bar of iron and some rope. I should have my designs ready by the time you have brought me all the materials.",
    "Have you got all the materials for the sled yet?",
    "Well, here's the sled but it will need to be waxed. The wax will need to both protect the sled as well as smoothen it. Maybe if you mix some wax with a bit of swamp tar it will achieve the desired effect. You'll also need something to store the wax in... like a cake tin.",
    "I don't know. I'm a smith! But maybe you should look for some bees.",
    "The swamp of course! It's south of Lumbridge.",
    "You will also need a cake tin to store the wax in.",
    "Thank you, come again.",
    "Well, unfortunately I can't make the sled without all the materials."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Troll_Romance?oldid=36120661’"
  ]
}