{
  "Player": [
    "Hello!",
    "What sort of work?",
    "You want me to rob him? That doesn't sound very heroic!",
    "Well, that isn't very nice...but two wrongs don't make a right.",
    "You know what,[sic] that sounds like a good plan. What do you want me to do first?",
    "You mean poison him?",
    "Well I suppose that's not so bad...but why? Can't I get the seal off him now?",
    "I suppose not.",
    "Urk...",
    "Ok, it sounds a little messy, but I'll do it.",
    "I just want to know a little more about the man I'm working for, that's all.",
    "So, basically, you're a criminal...",
    "Can they really be all that bad?",
    "You know what,[sic] that does make a lot of sense.",
    "Sorry, but no.",
    "I was wondering what you needed me to do.",
    "That's fine. I just need to check something with you.",
    "Hello!",
    "Well, yes?",
    "What are you talking about?",
    "Well, you could flap your mouth about while making words into a sentence.",
    "Hey!",
    "Hello there.",
    "What did you just call me?",
    "What did you just call me?",
    "What did you just call me?",
    "What do you mean?",
    "But a lot of these people have no homes or money! What about the war effort?",
    "You're all heart, aren't you?",
    "But that's profiting on their misery!",
    "Wait, what?",
    "I get the feeling they don't know all the facts. I'm sure the White Knights would not be happy with you starving refugees to turn a profit.",
    "Theoretically?",
    "...",
    "Hey! Who are you calling names?",
    "Look you...",
    "Hello!",
    "No, I don't have your pie.",
    "I don't work here, and even if I did, I'm not a serving [lad/lass].",
    "But...I don't work here.",
    "Hilarious as it would be to see you try, I still don't work here.",
    "Repeat after me...",
    "I...don't...work...here.",
    "I did...several times.",
    "It's like watching a highly obese dog chasing its pudgy tail.",
    "I don't want to get caught by Rolo stealing his stuff. I'd better wait for a better opportunity.",
    "Well, I'd best pull that lever and mush this stuff before anyone notices.",
    "I hope nobody down there has worked out what I am up to. I should get down there and grab the flour with an empty pot before it crawls away.",
    "I have the flour you wanted here.",
    "I can see why you asked me to do this first, that was a lot of work!",
    "Gah...",
    "Urgh...This is not going to be pretty...",
    "Gah...",
    "Urgh...I need to check something before I go.",
    "I lost the maggoty pie crust...",
    "Gah...",
    "Urgh...",
    "Well they aren't biting too well. Look at this little feller!",
    "Oh...that's foul... I'll get right to it, once I stop tasting bile.",
    "I don't think I'll ever feel clean again...",
    "I don't think I'll ever feel clean again...",
    "I don't think my hands will ever feel clean again... Wait, this is the last item I need, I suppose I could try making the pie myself and cook it. Or I could go see Nails for more information maybe...",
    "I lost the maggoty pie crust...",
    "I lost the manky crayfish...",
    "I shoved the potato down a kebbit hole. Here it is.",
    "How did you know I don't have everything on me?",
    "How did you know I had everything?",
    "How did you know I don't have everything on me?",
    "How did you know I had everything?",
    "I lost the maggoty pie crust...",
    "I lost the manky crayfish...",
    "How did you know I don't have everything on me?",
    "How did you know I had everything?",
    "I lost the terrible pie...",
    "Is that it?",
    "That sounds like a plan. One thing before I go.",
    "Is that it?",
    "That sounds like a plan.",
    "Hello!",
    "Here, I have your pie for you.",
    "This may not work. I should check with Nails to see what he thinks.",
    "I lost the terrible pie...",
    "Hey Nails, check this pie out!",
    "Tell me about it. My backpack is never going to be clean again.",
    "What is it?",
    "I haven't gone yet. I just need to ask what do you need me to do again.[sic]",
    "If you are trying to get me to help you, you might be a little more courteous.",
    "Is that how you think poor people talk?",
    "I can't say I have.",
    "I stole the spices. What should I do now?",
    "Thanks! I'll get right on that.",
    "I stole the spices. What should I do now?",
    "Thanks! I'll get right on that.",
    "It's just stuff you dump on your food, how valuable can it be?",
    "You wouldn't happen to have seen that spiced pie, would you?",
    "How...where did you find this?",
    "Quite well. I just need to ask some questions.",
    "No, it is about something else.",
    "What then?",
    "Hello!",
    "No, I don't have your pie.",
    "I don't work here, and even if I did, I'm not a serving lad/lass.",
    "But...I don't work here.",
    "Hilarious as it would be to see you try, I still don't work here.",
    "Repeat after me...",
    "I...don't...work...here.",
    "I did...several times.",
    "It's like watching a highly obese dog chasing its pudgy tail.",
    "Pie for Rolo the Stout!",
    "Here is your pie, sir. I hope you...enjoy it.",
    "That's right. The chef made you the pie, and decided it wasn't delicious enough for someone with tastes as refined as yours.",
    "Well it contains a lot of VERY expensive spices.",
    "Uh,...we call it a squishy crust belly filler.",
    "Uh...we call it a crayfish a la manque.",
    "Uh,...we call it a pomme de kebbit pie.",
    "A pomme de kebbit pie? I can't say I've ever heard of a pomme de kebbit pie before.",
    "Well it is an entirely new recipe, that was invented especially for you.",
    "Yeah, sure. Why not?",
    "Of course. And before I go....might I just say, thanks.",
    "You've just put my mind to rest about something I was feeling a tad guilty about. Never mind.",
    "Five...four...three...two...",
    "Hahahahahaha! Sounds like...",
    "Uh. Sounds like the pie...",
    "...",
    "Ok then. Sounds like the pie has...",
    "I SAID...Sounds like the pie has done the trick. I should check back with Nails and let him know, while they cart Rolo away and clean up.",
    "Hahahahahaha! Sounds like...",
    "Uh. Sounds like the pie...",
    "...",
    "Ok then. Sounds like the pie has...",
    "I SAID...Sounds like the pie has done the trick. I should check back with Nails and let him know, while they cart Rolo away and clean up.",
    "Yes. He's certainly not going to be on anything but infirmary food for a while either. I can only hope they manage to get the stains out of the ceiling...",
    "So what do I need to do now?",
    "Do I have to go up there? The stench is horrible!",
    "Maybe if I hold my breath...",
    "Urgh...that smell!",
    "I have the seal for you!",
    "Right, will do!",
    "That seems pretty straightforward!",
    "That seems pretty straightforward!",
    "Urgent message for you, sir.",
    "It is from Rolo the Stout. I think he said it was something about opening the food stores.",
    "No, but he is your boss. So I guess that means you have to do it.",
    "Well that worked. I should go and tell Nails.",
    "He bought it! He should be opening the stores any minute now.",
    "No problem, and with Rolo out of the picture things should start to pick up as well.",
    "Well, if they do, we can always serve up another slice of piping hot justice!",
    "Fair enough. How're things here?",
    "Thanks, Nails. How're things here?",
    "Hello Nails, how are things going?",
    "Tell me about it. I think it was starting to bleach my hair.",
    "I just want to know a little more about the man I did this work for, that's all.",
    "So, basically you're a criminal?",
    "So, did they cure him with magic?",
    "You don't mean...he's dead?",
    "A what? Iron bowel? What...how? I don't even... You know what? Time to change the subject I think.",
    "What's the matter?",
    "Oh come on, I'm sure things aren't that bad.",
    "Uh...",
    "You're...welcome.",
    "Saw what?",
    "Well...isn't this a bit over the top from seeing Rolo get a little ill?",
    "I...see. Well, I'll leave you to your mind babbling now. Have fun!",
    "Bye! Going away now! Have fun!"
  ],
  "Nails Newton": [
    "Hey, you looking for work?",
    "Just a little job I need doing. See, there's a merchant upstairs I need something lifting from. I'd do it myself, but I'm more into the 'legitimate' document business these days.",
    "Keep your voice down! Look, he's not a very nice bloke, right? He's Rolo the Stout, and he's currently buying up all the food in the area on the cheap and selling it to the refugees at a huge mark-up.",
    "Just listen will ya? All I need is his seal. I've a forged letter right here that says he's releasing all the food to the refugees for free. If I can get his personal seal, then I can get his associates to open the stockpiles to the people of the town. You in, or not?",
    "Well, Rolo isn't called 'the stout' because he likes to drink the stuff. He's a real pig. Every day he orders some fancy pie from the cook here, usually something that'll cost a lot to make. So, what we'll do is make a pie that'll put him out of commission for some time.",
    "Not POISON poison. Just something that'll put him in the infirmary for a while.",
    "Nah, he has it in a chest up there by his table in case he needs to stamp any documents. If he's rushed off to hork his guts out I don't think his first priority will be taking it with him.",
    "Exactly. So what I need you to do first is take care of the most complex item in the recipe: the pie crust. What we're going to do is mix in a load of fishing bait into the flour.",
    "Do you know about the watermill to the south? What ya need to do is take some wheat and fishing bait there. You can get wheat from a field to the south of here, just over the bridge. There are a couple of troll bodies on the way to the field that have been left for a while. They have a lot of maggo...err, 'fishing bait' around them. Upstairs there is a hopper. Put the wheat in the hopper, then put the fishing bait on top. Once you have done that, use the lever nearby to put it all in the mill, then it'll all get mashed up. Then go back downstairs and use a pot to gather up the flour and bring it to me.",
    "If you don't have a pot on ya, why not go see Mess Sergeant Ramsey in the tavern there? He's probably got one you can have for free in that shop of his. Or you can just make them, for free, if you can get some clay.",
    "Well what do you wanna know?",
    "Huh... Well, I suppose that's fair enough. My name's 'Nails' Newton. I'm a Burthorpe man, born and bred. I've been working various scams and schemes since I was little. These days, I provide accurate copies of official documents to people. In case they can't get the real version for some silly reason. A good steady hand is invaluable, you see.",
    "You could say that...but look at it this way. I never beat up anyone that wasn't asking for it, stole anything from someone that couldn't afford it, or scammed anyone that wasn't trying to scam me. I mean, I did some work back in the day, making sure people got some money that was owed them from people who wouldn't give it any other way. That's what gets me about these merchants. They're gouging us for every coin we've got because they can profit off our misery. I may be a little shady, but at least I have standards.",
    "Look, go and talk to them and you'll find out. Rolo is just a tip of a flabby iceberg. Just have a word with his friend Kepple, or any of the merchants wandering around. Then you'll see what we're up against.",
    "Do you know about the watermill to the south? What ya need to do is take some wheat and fishing bait there. You can get wheat from a field to the south of here, just over the bridge. There are a couple of troll bodies on the way to the field that have been left for a while. They have a lot of maggo...err, 'fishing bait' around them. Upstairs there is a hopper. Put the wheat in the hopper, then put the fishing bait on top. Once you have done that, use the lever nearby to put it all in the mill, then it'll all get mashed up. Then go back downstairs and use a pot to gather up the flour and bring it to me.",
    "If you don't have a pot on ya, why not go see Mess Sergeant Ramsey in the tavern there? He's probably got one you can have for free in that shop of his. Or you can just make them, for free, if you can get some clay.",
    "You know what? That's not a problem. I mean[sic] think about it. We WANT the pie to be undercooked and a health-hazard. So just bung it in the oven until the top goes a little bit crispy and you're fine.",
    "Ok, see you about.",
    "Well that was pretty blunt. I'll be waiting here if you change your mind. I tell you what,[sic] why not go upstairs and speak to Rolo if you think I'm a little harsh, eh?",
    "What's up?",
    "Do you know about the watermill to the south? What ya need to do is take some wheat and fishing bait there. You can get wheat from a field to the south of here, just over the bridge. There are a couple of troll bodies on the way to the field that have been left for a while. They have a lot of maggo...err, 'fishing bait' around them. Upstairs there is a hopper. Put the wheat in the hopper, then put the fishing bait on top. Once you have done that, use the lever nearby to put it all in the mill, then it'll all get mashed up. Then go back downstairs and use a pot to gather up the flour and bring it to me.",
    "What's up?",
    "That's perfect.",
    "Don't worry, I'll take care of making this into a pie shell for you in a moment. We also need to fill the pie with something pretty nasty. What we need first is a raw crayfish. I want you to go and get one and bury it in a field. Just shove it right into the dirt and then let it...[sic] ripen for a bit.",
    "Just use either the flax field, wheat field or the animal pen for the job. The flax field is closest. It's in the north west of here, near the Master Farmer's shop and the well. And don't forget: when you are done you should come and see me to show me your work. But first, let me take care of that flour for ya!",
    "Well, we need to fill this pie with something pretty nasty. What we need first is a raw crayfish. I want you to go and get one and bury it in a field. Just shove it right into the dirt and then let it...[sic] ripen for a bit.",
    "Just use either the flax field, wheat field or the animal pen for the job. The flax field is closest. It's in the north west of here, near the Master Farmer's shop and the well. And don't forget: when you are done you should come and see me to show me your work.",
    "How are the fish biting?",
    "Oh, that's no problem. One of the other thieves in the tavern found the maggoty pie crust and gave it to me.",
    "Well, we need to fill this pie with something pretty nasty. What we need first is a raw crayfish. I want you to go and get one and bury it in a field. Just shove it right into the dirt and then let it...[sic] ripen for a bit.",
    "Just use either the flax field, wheat field or the animal pen for the job. The flax field is closest. It's in the north west of here, near the Master Farmer's shop and the well. And don't forget: when you are done you should come and see me to show me your work.",
    "How are the fish biting?",
    "Oh, Saradomin... That thing stinks! Just looking at it makes me want to vomit! Perfect! Only one thing left! To give the pie a little more body, we'll add a potato. I want you to go and get a raw potato and shove it down a kebbit hole.",
    "If you don't have a potato then Head Farmer Jones might well have one you can use.",
    "Kebbit burrows are full of hair and droppings and all other kinds of nasty waste. So if you just shove it in there and pull it out it'll be ok. Well, I say 'ok'...",
    "To give the pie a little more body, we'll add a potato. I want you to go and get a raw potato and shove it down a kebbit hole.",
    "If you don't have a potato then Head Farmer Jones might well have one you can use.",
    "Kebbit burrows are full of hair and droppings and all other kinds of nasty waste. So if you just shove it in there and pull it out it'll be ok. Well, I say 'ok'...",
    "How's that pie coming along? To give the pie a little more body, we'll add a potato. I want you to go and get a raw potato and shove it down a kebbit hole.",
    "If you don't have a potato then Head Farmer Jones might well have one you can use.",
    "Kebbit burrows are full of hair and droppings and all other kinds of nasty waste. So if you just shove it in there and pull it out it'll be ok. Well, I say 'ok'...",
    "How's that pie coming along?",
    "Oh, that's no problem. One of the other thieves in the tavern found the maggoty pie crust and gave it to me.",
    "Oh, that's no problem. One of the other thieves in the tavern found the manky crayfish and gave it to me.",
    "Ok, since you don't have everything here, what you need to do is go and get it all together. Then, fill the pie crust with the crayfish and potato, and cook the pie on a range.",
    "Because my nose hairs aren't bleaching. It's subtle clues like that which give it away.",
    "Now you have everything, you should stick the crayfish and potato inside the shell and take it to the range to cook.",
    "Because my nose hairs are bleaching. It's subtle clues like that which give it away.",
    "Ok, since you don't have everything here, what you need to do is go and get it all together. Then, fill the pie crust with the crayfish and potato, and cook the pie on a range.",
    "Because my nose hairs aren't bleaching. It's subtle clues like that which give it away.",
    "Now you have everything, you should stick the crayfish and potato inside the shell and take it to the range to cook.",
    "Because my nose hairs are bleaching. It's subtle clues like that which give it away.",
    "How's that pie coming along?",
    "Oh, that's no problem. One of the other thieves in the tavern found the maggoty pie crust and gave it to me.",
    "Oh, that's no problem. One of the other thieves in the tavern found the manky crayfish and gave it to me.",
    "Ok, since you don't have everything here, what you need to do is go and get it all together. Then, fill the pie crust with the crayfish and potato, and cook the pie on a range.",
    "Because my nose hairs aren't bleaching. It's subtle clues like that which give it away.",
    "Now you have everything, you should stick the crayfish and potato inside the shell and take it to the range to cook.",
    "Because my nose hairs are bleaching. It's subtle clues like that which give it away.",
    "How's that pie coming along?",
    "Oh, that's no problem. One of the other thieves in the tavern found the terrible pie and gave it to me.",
    "Well this is pretty simple. All you really need to do is use the uncooked pie on a range to cook it.",
    "Yea. Then bring it to me so I can have a look, ok?",
    "Well this is pretty simple. All you really need to do is use the uncooked pie on a range to cook it.",
    "Yea. Then bring it to me so I can have a look, ok?",
    "Oh, that's no problem. One of the other thieves in the tavern found the terrible pie and gave it to me.",
    "Guh...that thing stinks!",
    "He'll never eat that unless we do something to mask the smell. I have an idea though.",
    "One of Rolo's fellow merchants, Foppish Pierre[sic] has been hanging around the mill. He carries a supply of spices on him all the time. If you can pickpocket those then we'll be in business. So, just go and grab those spices from Pierre and add them to the pie. Then you can take it up to Rolo and see if he swallows it.",
    "That was quick. How did it go?",
    "I need you to go and grab something to cover up that pie's stench. There's a guy called Foppish Pierre that hangs out near the watermill to the south of here. He's carrying some pretty fancy spices on his person. Just go and nick them off him, dump them on the pie, and take it off to Rolo to eat. Any questions?",
    "I need you to go and grab something to cover up that pie's stench. There's a guy called Foppish Pierre that hangs out near the watermill to the south of here. He's carrying some pretty fancy spices on his person. Just go and nick them off him, dump them on the pie, and take it off to Rolo to eat. Any more questions?",
    "Well, dump a good serving of them onto the pie to mask the flavour and ungodly stench. Then go and serve it to Rolo.",
    "Well, dump a good serving of them onto the pie to mask the flavour and ungodly stench. Then go and serve it to Rolo.",
    "Any more questions?",
    "You don't know how valuable this stuff is?",
    "Spices are big business, my friend! Depending on the spice, it can be worth fifty, even sixty times its weight in gold! Workers that handle the stuff can't even wear roll-ups on their trousers in case they sneak some out in them. A cuff-full can be worth more than a year's wages. You know why he carries it around? So he can take it out and wave it about like others would wear magical jewels.",
    "You mean this one?",
    "I...don't...know?",
    "How are things going?",
    "Is this about what to do next? Because all you need to do is go up and give the pie to Rolo.",
    "Go for it. What's up?",
    "Well, if you've got the spiced pie, you need to go and take it to Rolo.",
    "Stand well back!",
    "Well, Rolo certainly won't be causing any more trouble for a while.",
    "Don't! Don't even talk about that. I'm still queasy from seeing what he did to the stairs as they called him out. They had to sluice them down with buckets and mops...terrible. But at least the stains are all gone now.",
    "Well, with Rolo out the way you can go and steal the seal from his chest. We'd best move fast, in case he decides to send for it when he comes round. Is there anything else you need to know?",
    "Go upstairs and get Rolo's seal for me.",
    "I know. The owner has called for an old priest and a young priest. When the pair get here they hope that an exorcism will get rid of it.",
    "Great, let's get this letter stamped, and...",
    "Done! Now just take it to Pierre and we're home free Don't forget to come back and see me when you are done, ok?",
    "Well, what's the matter? I need you to take that letter I gave you to Foppish Pierre down to the watermill.",
    "Well now we have the seal and the forged letter, it is all plain sailing!",
    "Well, what's the matter? I need you to take that letter I gave you to Foppish Pierre down to the watermill.",
    "Well now we have the seal and the forged letter, it is all plain sailing!",
    "Well, looks like we're done. I'll let the refugees know. We'll have a good old fashioned feast. And it's all thanks to you! We'll raise a glass or two to you tonight!",
    "There is that. Hopefully the food situation will improve, unless someone else muscles in on the racket.",
    "Good point! But for now, let's celebrate!",
    "I have some pies for you by the way, but you need to clear your inventory before I can give them to ya.",
    "I have that spice-pouch you took from Pierre.",
    "You should make some room for it and take it off me; it'll be of use to ya.",
    "Here, you should have it. It'll come in handy for making ya food more palatable.",
    "Hello. They are going quite well now the food stores have been opened.",
    "I'm seeing a lot of well-fed people, instead of one disgustingly well-fed person.",
    "I have some pies for you by the way, but you need to clear your inventory before I can give them to ya.",
    "On which note, here, have these pies as a reward.",
    "And they even managed to get the smell out of the upper floor, which is a bonus.",
    "Well what do you wanna know?",
    "Huh, well, I suppose that's fair enough. My name's 'Nails' Newton. I'm a Burthorpe man, born and bred. I've been working various scams and schemes since I was little. These days, I provide accurate copies of official documents to people. In case they can't get the real version for some silly reason. A good steady hand is invaluable, you see.",
    "You can say that...but look at it this way. I never beat up anyone that wasn't asking for it, stole anything from someone that couldn't afford it, or scammed anyone that wasn't trying to scam me. I mean, I did some work back in the day, making sure people got some money that was owed them from people who wouldn't give it any other way. That's what gets me about these merchants. They're gouging us for every coin we've got because they can profit off our misery. I may be a little shady, but at least I have standards. That's why it warms my heart to think that we've taken a maggot like Rolo out of the equation for the time being!",
    "They were going to take him to the infirmary, then they realised that it was a bit too serious. I mean, obviously, given his condition they couldn't heal him normally: by feeding him large amounts of food.",
    "Again, no. All the damage that Rolo had done to himself guzzling food meant it was too serious for that.",
    "No, no, he's still alive. But they had to take him to a specialist clinic. Apparently they have confined him to an iron bowel."
  ],
  "Foppish Pierre": [
    "Oh, are you addressing...me?",
    "Oh dear...This will never do.",
    "I was right. This will never do. I mean...look at yourself. How, by any stretch of the imagination, am I supposed to...converse...with one such as yourself?",
    "Oh...you are so lower class. I've become used to dealing with better people than you since I became fabulously wealthy. Thank goodness I have my pomander of expensive spices,[sic] your odour was beginning to make me feel light-headed.",
    "I'm sorry, I can't hear it when poor people are upset. Toodle-pip.",
    "You there! Oik! I need your assistance!",
    "Oh all right. How is it the gutter-trash address each other? Ayup. 'Appen as like I done lost myself a pretty penny. 'As thou seen t' salt-shaker?",
    "When they are not just grunting and waving their arms, yes. Look, have you seen a little salt shaker full of spices around here?",
    "I'm ruined! Ruined!",
    "For me? Really? Maybe someone found my spices...",
    "Don't joke around with me, you...you...messenger! Give me that note!",
    "What madness is this? He wants me to open the food store? For free? Is he demented?",
    "I...I have to contact some people...leave me...leave me to my despair..."
  ],
  "Kepple": [
    "Hello? Hello? What kind of low-class greeting is this? No matter. Clearly we move in very different social circles.",
    "Salutations, peasant.",
    "I called you a peasant. Why, what of it?",
    "Salutations, peon.",
    "I called you a peon. Why, what of it?",
    "Salutations, serf.",
    "I called you a serf. Why, what of it?",
    "I'm Winston Kepple, purveyor of pretty much everything! I came here with my friends and colleagues from Falador to take advantage of this captive market that we have right here. And let me tell you, business has never been better.",
    "I mean that with the trolls attacking I've been able to peddle all kinds of goods to these rubes with an astonishing mark-up! Food, clothing, cake tins, fishing supplies... You name it, I make am making a profit on it.",
    "Pfft. What about it? If the trolls wipe this place out the White Knights and some scruffy tramps with swords calling themselves heroes will take care of it. And then the survivors will need even more supplies to reclaim the land!",
    "Oh pipe down. I didn't expect a commoner like you to understand the ways of high finance.",
    "Turning a healthy profit! The folk here are too poor to set up elsewhere, or too thick-headed to give up. My friends and I can sell them a one-coin shirt for fifteen, and they can't exactly shop around! So long as this war keeps going, we're going to be raking it in!",
    "Well, you might say that, but there's a lot of history between here and my home.",
    "You see, Falador and Burthorpe have always had this rivalry going, due to them not liking the White Knights or something equally childish. So, we're loving this. You may well think were[sic] scum here, but back home in Falador - well, they are not quite so eager to judge us.",
    "Well what they don't know won't hurt them, will it? I'll bet you're one of those 'hero' types, aren't you? A bleeding heart and a burning desire to help everyone. It's numbskulls like you, giving your gear away or dropping it for people to find, that are ruining my business!",
    "I'm glad you like it. It is, theoretically, very expensive.",
    "Well, I had it made from the finest materials, purchased from businesses that I was a partner in, so I got a good discount. Then I had the finest seamstresses in Falador put out of work, and paid them a pittance to make it for me before I would let them seek employment elsewhere. So in the end I have a very wonderful set of clothes with little or no cost to myself.",
    "Yes, it is quite jaw-droppingly good, isn't it?",
    "Very well, it was...nice talking to you.",
    "I saw it. I saw all of it...",
    "You don't know! You'll never know what I saw! The colours...all the colours...and sometimes NONE of the colours... The darkness came to me then...with the stench, it protected my mind. But the darkness is still there. The smell...The smell of it will never, ever fade...",
    "A little ill? A little ill? The gods themselves wept tears of blood at the things he brought to light. Things that never should have been!",
    "No! Don't leave me! It will come back for me!"
  ],
  "Pompous Merchant": [
    "Step aside, you low-born oaf!",
    "I have no idea. Some 'hero' I would guess.",
    "Hush, I have far too much money to listen to the idle prattle of menials. Begone!"
  ],
  "Rolo the Stout": [
    "Do you have my pie?",
    "This is intolerable! I already have plenty to drink, so why would they send a serving [lad/lass] up to see me without my food!",
    "Such impertinence! Inform the head of this establishment that I want you to be dismissed immediately!",
    "What's that? You won't do it? Egad, do you not know who you are dealing with, whelp? I'll tan your hide!",
    "By the gods, you're a fiery one! Never have I been so insulted by a lowly servant...",
    "What?",
    "I...Don't...[sic] Dash it all, you scoundrel! Why didn't you tell me you didn't work here?",
    "Fetch the head of this establishment! I will have your job for embarrassing me!",
    "Do you have my pie?",
    "Is this some sort of a joke? This...entity is not the pie I ordered! It is some sort of horrible behemoth of inedibility, and I refuse to bear its presence any more! Get it away from me, you ragamuffin, before I give you a thrashing!",
    "Do you have my pie?",
    "This is intolerable! I already have plenty to drink, so why would they send a serving lad/lass up to see me without my food!",
    "Such impertinence! Inform the head of this establishment that I want you to be dismissed immediately!",
    "What's that? You won't do it? Egad, do you not know who you are dealing with, whelp? I'll tan your hide!",
    "By the gods, you're a fiery one! Never have I been so insulted by a lowly servant...",
    "What?",
    "I...Don't... Dash it all, you scoundrel! Why didn't you tell me you didn't work here?",
    "Fetch the head of this establishment! I will have your job for embarrassing me!",
    "That's me!",
    "What is this? This is not the scrumptious redberry and distressed quail pie I demanded.",
    "Well that's not my problem. Maybe he didn't torment the quails for as long as I specified... But whatever this is, it does smell delicious...",
    "Oh really? Then I suppose I might try a portion. What's it called?",
    "A squishy crust belly filler? I can't say I've ever heard of a squishy crust belly filler before.",
    "A crayfish a la manque? I can't say I've ever heard of a crayfish a la manque before.",
    "To make up for not being able to make the pie I ordered?",
    "Well that's quite nice of you. Tell the chef I will only sue him slightly for not making what I ordered. And that if this pie tastes nice, then I might even pay him for it!",
    "Thanks? What for?",
    "Yes, yes, that's all very well and good. Now be on your way, you jabbering vassal. I have a pie to eat.",
    "A squishy crust belly filler eh? Let's see what it tastes like...",
    "A crayfish a la manque eh? Let's see what it tastes like...",
    "A pomme de kebbit pie eh? Let's see what it tastes like...",
    "Blooooogh!",
    "Hurgleblurgleurgleurgle!",
    "Bluuuuuuuuugh!",
    "Gasp...[sic]",
    "Oh gods! There's more! Urgleflubbbleubbleubbleubble...",
    "Hurgleblurgleurgleurgle!",
    "Bluuuuuuuuugh!",
    "Gasp...gasp...[sic]",
    "Oh gods! There's more! Urgleflubbbleubbleubbleubble..."
  ],
  "Nails": [
    "I don't want to see it! I'm retching just thinking about it!",
    "Is there anything else you wanna know?"
  ],
  "WARNING": [
    "The sound effects only get worse from here."
  ],
  "Pierre": [
    "Ruined! I'm ruined!",
    "Don't interrupt my woe! Ahem... Ruined! Oh woe is me! First I lose my spices, and then that blubbery whale Rolo goes and gives away all the food I could've used to buy some more! I'm going to starve in the gutter: my clothes taken by footpads and my body heaped into a parper's grave!",
    "Hmm, now you mention it. I know, I'll just stop paying my workers so much, and drop the quality of the goods I sell. If I keep firing people and charging through the roof for my wares I'll soon be back to normal!",
    "Thank you, uneducated and filthy stranger. You may have saved my life!"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Let_Them_Eat_Pie?oldid=36120458’"
  ]
}