{
  "Wizard Trindy": [
    "Oh, what a surprise. Look who it is.",
    "Can't think who told on us.",
    "Good to see her taking an honest interest in her history.",
    "Same as always, World Guardian. We knew you'd show up at some point. Someone needed to keep you distracted should you arrive too soon. But not today, it seems. Here you are. Right on time.",
    "They look like shadow creatures. The sort that used to come up and bother me in the Vault. You'd better get that portal closed fast, before many more come through.",
    "I don't think I should get any closer. I spent millenia surviving in the shadows but I've never felt anything like this. It's...cold. Dead. And I can feel it trying to pull me in, even from here. I'm sorry, Player. I don't want to get trapped again.",
    "One known as TokHaar-Hok spoke for them, in the TzHaar city, if I recall correctly.",
    "All's well that ends well.",
    "Shovels out, adventurers! Time to restore the banner!",
    "Busy. I rarely get a chance to work without being disturbed by commands from the top.",
    "Six thousand years, and some things never change..."
  ],
  "Player": [
    "What's going on? What's with all the soldiers?",
    "Sorry, not guilty. But let me guess, you're spying on them?",
    "What for?",
    "So what's your job here then?",
    "Looks like Zaros really wants that Monolith.",
    "Aren't you going to join in? Where exactly are you standing in this?",
    "How are you doing?",
    "What is it?",
    "What are those?!",
    "Can't you do it?",
    "So we need reinforcements?",
    "Ful made them to build Gielinor. They're powerful warriors. They even fight each other for fun in their Fight Kiln. They would want to protect their work, I reckon.",
    "I can try.",
    "Not yet.",
    "Not today. I need your help.",
    "I've not done anything! Creatures from the Shadow Realm are invading the surface.",
    "Yes. They're coming through a portal and we can't fight them off. We could really use your help.",
    "...",
    "Well?",
    "For what?",
    "TokHaar-Hok? I should go back to the Monolith. They need my help.",
    "Any progress?",
    "That's a no. I should go back to the Monolith. They need my help.",
    "Not quite...",
    "I thought they'd be on our side! I didn't expect them to want to start destroying the world.",
    "Looks like that's the last of them.",
    "I suppose we'll all be worshipping you now instead.",
    "Is he gone?",
    "Where have you been?",
    "[Unit], move over there!",
    "How's the Monolith looking?",
    "Was it difficult to get the Wand of Resurrection back from Saradomin?"
  ],
  "Ali the Wise": [
    "Azzanadra is coming to attack the Monolith. Saradomin has formed an alliance with elves and druids to defend it.",
    "Certainly not. This whole area is of significant archaeological importance. I'm surveying it.",
    "I'm assisting Reiniger with an excavation of ruins to the north. She thinks there could be an entrance to an intact area of Senntisten.",
    "Goodness.",
    "I can only hope they remain sensible. We're so close to Varrock...",
    "Right here, as I was ordered. If Azzanadra wants my strength he'll have to ask for it. Nicely. For now I'll remain an observer. Though I won't begrudge you joining the battle. Stay safe, World Guardian.",
    "Good to see you, despite the circumstances.",
    "I am keeping well. My brethren, however, have not been so fortunate. Even without the Crown, Saradomin proves a worthy match for both Azzanadra and Nex. The rest of their forces seem to have underestimated the fervour of yours. Who would have thought it?",
    "...",
    "I may have spoken too soon.",
    "So he's really gone.",
    "Who can say? He has survived at least one apparent death. Is Erebus worse than that? I don't know. As for when he may return...I don't know. Perhaps tomorrow, perhaps beyond both our lifetimes. Azzanadra would know more than I. See what has has to say, once this is all over.",
    "Could you persuade them to join us, Player?",
    "Go, then. You can find them on Karamja, in TzHaar city. I believe the Fight Kiln is a good place to look. And please hurry.",
    "You weren't wrong about the TokHaar. Formidable creatures. With them here, we should get this mess cleaned up shortly, before many more fall.",
    "Are you hurt? Speak to me.",
    "Yes, the TokHaar. Azzanadra - can you fight?",
    "Good. Time for you to finish this.",
    "Those TokHaar aren't quite the helpful allies we were hoping for...",
    "I don't think any of us did. At least they're not shy about showing where their loyalty lies.",
    "Keep up the fight. With our combined strength, we can handle them, I'm sure of it.",
    "I think they're retreating, World Guardian!",
    "Well fought, Player.",
    "Reiniger was right. There's a surviving area of Senntisten just north of here, brilliantly preserved.",
    "The Monolith seems secure, though who might try to take it now? We're done with it. Your archaeologist friends have some new phenomena to study, at least.",
    "I will watch Azzanadra. He was survived worse, but this may take some getting used to, for all of us. He'll need someone to keep his feet on the ground."
  ],
  "Seren": [
    "Player, I must rely on you to command our forces. I put Helwyr, Thaerisk and Commander Zilyana under your capable command. To move them into position, simply click them and then click where you want them to go. You can change their attack focus by selecting 'target settings' and picking one of the new options presented. Once in position they will use their abilities to obliterate Zaros's forces.",
    "You must make sure that they do not destroy our defences and reach the monolith. If those defences fall, we are lost. Good luck, World Guardian.",
    "Whatever you are planning, brother, it must end here.",
    "Does your greed know no bounds? Our mother's core - the Crown - and now the Codex? Will that be enough? Will it finally sate your quest for power?",
    "...",
    "You're leaving? Again? When you could make a difference, you turn away. You run. You could stay and help us. We could work together to save our family, to save this world!",
    "We owe them our existence.",
    "You cannot command me like your minions. Have you forgotten we are twins? I have the power to stop you.",
    "It doesn't have to come to that!",
    "Brother...don't do this...",
    "..."
  ],
  "Zaros": [
    "Enough.",
    "Once more, I find myself having to intervene.",
    "Be silent.",
    "Seren.",
    "I am here for the Codex.",
    "My quest is none of your concern. Go back to your garden. You know as well as I what Bik will think of it. At least I will not be here to see you regret it.",
    "This world is lost. And they have never been our family.",
    "I owe nothing. I expected you to understand that. Get out of my way.",
    "So you are prepared to kill another of your kind?",
    "You know it is the only way you can stop me. Kill me, or go.",
    "At last.",
    "I am. This artefact - the Codex, which you call the Monolith - was not originally built as a repository of information. There are cracks in the skin of our reality. One here, and one beyond Freneskae. Shadow breaches. The Codex was made to seal this one, to protect Gielinor from the entropic energies that emerge. On the other side of the breach is another reality. A very different reality.",
    "Yes. My destination. What I seek cannot be found in this universe, and so I go in search of another. I have the apparatus I require - the material to shield myself, a tool to guide me in that place, and an offering for those who rule there. All that remains is to use the knowledge I have gleaned to open the way.",
    "No. It would kill you.",
    "Do as you wish."
  ],
  "Azzanadra": [
    "My Lord-",
    "My Lord? The Codex is yours, but...forgive my asking. What did she mean? You are leaving?",
    "...Erebus.",
    "Let me go with you.",
    "Then I will prepare the world for your return, my Lord.",
    "Destroy them, so we can close the portal!",
    "Be realistic. You clearly need our help.",
    "Don't let your pride doom your people.",
    "Char, no! Stay away from the portal!",
    "Everyone stay back! I'm going to close it.",
    "I have to try.",
    "That will hold them. Urgh...",
    "No. Our work is done.",
    "There wasn't time. The portal is sealed. Our work is done.",
    "I think so. If I must.",
    "No need to be concerned. It's sealed. I saw to that.",
    "Very well.",
    "Player, please accept this. I believe you'll make better use of it than I. Consider it a thank you.",
    "And an apology.",
    "Player.",
    "I have ascended. Ever since Zaros saved my people at the final Ritual, I suspected this might happen. I tried to keep it at bay... But if it is his will, I accept the burden.",
    "Don't entertain the thought. Leave me. I need to think on this.",
    "He needed the Monolith. That was all I needed to know.",
    "For now. But I have faith that I will see him again. Thank you for fighting beside us in the end, World Guardian. I hope one day you understand why we had to act."
  ],
  "Saradomin": [
    "Hold them back!",
    "It is your actions that have done this! How dare you-",
    "We have won harder battles.",
    "...",
    "Very well. A truce - for now.",
    "There is little time World Guardian. There are dark things that have escaped to this world. Azzanadra and myself will deal with what we can. I leave the command of our forces here in your hands. You must not let these creatures pass through our defences.",
    "You must defend the southern barricade as before.",
    "We still have Helwyr, Thaerisk and my trusted Commander Zilyana to fight with you.",
    "However you must also keep the northern barricade defended as well. Fortunately we have Nex's power on our side this time. Good luck World Guardian. We're all relying on you.",
    "The shadow cacklers have pushed past our defences.",
    "You must protect the helpless, the villagers and our wounded.",
    "They also seek to attack the main gates of Varrock. Fortunately we have new allies in the TokHaar. Use these new forces well and protect our people. We are all relying on you, Player.",
    "Things never get easier. With the threat of the shadow cacklers over, it appears we are not out of the woods yet. The TokHaar have turned against us. Fortunately, they march on the monolith first. If we can stop them here we can save everyone else.",
    "We must protect the barrier to the south.",
    "There is also the northwestern barrier that must hold.",
    "And finally the northern barrier as well. Hold the line World Guardian. We can win this!",
    "So it seems.",
    "We will hold the Monolith. Now we know that the portal is there, we need to ensure it remains closed.",
    "You have done enough. Gather your forces and leave.",
    "Just this once, I will allow you to go unharmed. But do not try my patience.",
    "Thank you for standing by us, World Guardian.",
    "I made contact with Seren not long after I returned, to see what she intended to do about her brother. She asked me to defend the Monolith. I hoped she might join us. I believe she matches his power. A pity that she can't see beyond her family.",
    "You're far from the first to have counted on unreliable allies. I trust that you couldn't have known what they would do. We will need to be on our guard. If those are the sort of warriors the Elder Gods have at their command, we need to be ready."
  ],
  "[Ali the Wise/Wizard Trindy]": [
    "World Guardian, I will be blunt. We're in trouble. There are too many of these creatures. We can't push through them to close the portal, and there are more beyond. Larger, and hungrier. I can sense them. We're taking losses, and it's stranger than it looks. Some are falling, half-drained of life, without a scratch on them. Just being near the portal seems to be harmful. Those of us with stronger dispositions are holding up for now, but I don't know how long that will last.",
    "Yes. And I would welcome suggestions.",
    "They can be strong, but so few remain on Gielinor. I believe Armadyl is away, on Tarddiad. We don't have time to mount an appeal.",
    "Absolutely not. They have reason to turn on all of us, and have offered nothing thus far. We can't trust them.",
    "I...had not considered them.",
    "Go, then. And hurry.",
    "Have you asked the TokHaar to join us?"
  ],
  "TokHaar-Hok": [
    "Human. Have you come to test your strength?",
    "...",
    "You smell of anathema. We can feel it. What have you done?",
    "The Shadow Realm?",
    "...",
    "...",
    "We are searching.",
    "The correct protocol. The Masters will have told us what to do...",
    "...",
    "...",
    "Hmm. Too many lost.",
    "Gather the Tokkul! We must return to the lava.",
    "The masters need all our strength for the fight to come."
  ],
  "Wahisietel": [
    "The invaders from beyond proved too much for the brave allies.",
    "Yet hope was not lost - Gielinor had defenders still.",
    "The TokHaar, the hands who created this world, the servants of the Elder Gods themselves, stood with us. But the worst was still to come.",
    "The priest, my friend, his heart filled with shame and confusion, stood before the doom his efforts had wrought.",
    "He grappled with the gateway, forcing it closed as it sought to consume him.",
    "The Monolith snapped shut, but the backlash had nowhere else to go.",
    "Pain cut through him as the corrupting energies tore into his body.",
    "Silence enveloped him...but there would be no peace for the most faithful.",
    "The desolate scream of the new god filled the air.",
    "In the aftermath of the devastation, the TokHaar looked at what the witless surface dwellers had done to their world. Everything would have to be dismantled, starting with their former allies. But the worst was still to come.",
    "It is too late.",
    "The invaders may have been defeated but the foul power that seeped from the gateway has already done its work.",
    "The Elder God eggs, imperiled by the poison, are hatching.",
    "The young within will feast on our world.",
    "Now the worst is upon us."
  ],
  "Char": [
    "We have it!",
    "For Zaros! It's so...cold..."
  ],
  "Nex": [
    "CHAR!",
    "It'll take you, too!",
    "But Char-",
    "Keep your distance.",
    "No. And now he is gone, leaving that pretender in his place. Godhood doesn't suit him.",
    "You saw what happened. Aren't you meant to be the World Guardian? Aren't you supposed to *guard* us? Some hero. I'll get her back. I'll find a way, with or without your help.",
    "Feel the fury of the elements!"
  ],
  "Congratulations! You have completed": [
    "'Battle of the Monolith' - Complete this quest."
  ],
  "[Unit]": [
    "Where do you want me?",
    "I cannot move there."
  ],
  "Helwyr": [
    "You. Will. BLEED!",
    "Feel nature's fury!"
  ],
  "Commander Zilyana": [
    "Feel the wrath of Saradomin!"
  ],
  "Sir Owen": [
    "I found this by the Monolith. I believe it belongs to you.",
    "Oh, you don't have enough space for it. Speak to me again when you do.",
    "All quiet, for now. The portal remains closed and nobody has tried to meddle with it from this side either. Apart from those archaeologists, of course. They seem determined to cause trouble. Must be something about spending all their time in the dirt.",
    "Indeed. Saradomin's expedition to restore Fern's undead herd to life. We eagerly awaited you, for quite some time. I sent word to you, but received no reply. It seems you were occupied; adventuring with mahjarrat and dragonkin and gods greater than gods. With surprising regularity, you take it upon yourself to save the world from impending calamity. We postponed our quest for a suitably polite period, but the corruption contaminating my body (and Fern's nagging) drove me to action. In your absence, Saradomin joined us on our quest, and battled undead horrors by my side.",
    "On the contrary. Shortly after your departure, Saradomin entrusted the wand to me. Saradomin also apologised for his act of wrath. Understand, my friend. It is nothing short of a miracle that I stand before you. Your unwillingness to trust Saradomin with the wand, though well-intentioned, was nearly my undoing. I understand if you doubt my words; if you see me as a zealous acolyte, blinded by faith and bereft of reason. But Saradomin told the truth. Only a god could have brought a creature like me, twice-dead, back to life as Saradomin did. Saradomin willingly sacrificed divine power to do so. Immune to godhood as you are, he could not transfer his power to you. This was the only way to save me. I wish you had not hesitated to give the wand to Saradomin. While you argued with him, my soul faded, and corruption filled the void in me. I understand that you have your reasons for doing so. Good reasons. I respect that. And I am grateful to you both for returning me to life. But I want you to understand that Saradomin shows remorse for his actions. Though he is not solely to blame for the half-man I have become.",
    "Saradomin entrusted the Wand of Resurrection to me. He is wise enough to recognise its power was safest in a mortal's hands.",
    "Ahem, yes, I must admit, I made assumptions by referring to it as a 'burial ground'. While we waited for you to join us, Fern was kind enough to educate me, in laborious detail, of her people's culture. The centaurs do not bury their dead. It would be a terrible waste of good hors-- hornless unicorn meat. Every fallen comrade is precious to the centaurs, and they fashion the hide, hair and bone into tools and clothing. Unrelentingly enthused by my feigned interest, Fern told me much more of the origin of centaurs. They're tales for another day, perhaps.",
    "Not...exactly. To save us a hazardous journey, Saradomin teleported himself and I to Fern's ancient camp in the deep wilderness, on the shores of the northern sea. With her spirit fettered to the Wand of Resurrection in my hand, Fern had no choice but to join us. Fern's herd were nomadic, their encampments temporary and portable. So there was nary a trace of the centaur camp this long after the god wars. Fern pointed out the site where her elder sister died; where Elora gave the last of her life to heal their herd's dead and dying. This was where Fern cut the horn from Elora's forehead, and tried to bring her people back to life. Instead, Fern raised undead...corrupt, wicked and violent...who murdered everyone in the encampment. As if conjured by Fern's mournful memory of her death, the corrupted centaurs arose from the ocean. They galloped from the salt water in frothing waves. Saradomin gazed upon the corrupted with weary recognition. These...these necrotaurs had been in torpor for centuries, marinating in the same corruption that pulses in my veins. Grotesque malevolent abominations. The skin of the terrible riders was sickly translucent. The corruption had warped their forearms into elongated blades of razored bone. I could see the eerily glowing veins of corruption through their corded muscles and rippling sinews, pumping with unnatural vigour. A thin layer of mucus covered their skinless bodies, stinking a putrid odour. Black toxic vapours reeked from their mouths, withering the scant vegetation in a terrible blight. Worse yet, despite their surprisingly fleshy nature, the necrotaurs seemed invulnerable. Every wound Saradomin inflicted immediately closed. I decapitated a necrotaur and it immediately grew another head. Clearly no mortal weapon could slay these beasts, so I wielded the Wand of Resurrection. I commanded the necrotaurs to obey me. I pointed the wand at a necrotaur and willed it to be restored to life. Nothing.",
    "I passed the trial of blood, so proved myself worthy. But that was before the corruption took hold of me. I can only assume this rendered me compromised.",
    "It was you that passed the trial of blood, not I, so the wand would not respond to me. We needed another plan.",
    "Saradomin conjured a glimmering barrier to hold back the necrotaur horde. He calmly advised Fern to peer into the spirit realm, and describe to us their spectral forms. Fern surprisingly reported that these foul creatures were not soulless, as she first believed. Each necrotaur was a prison, their body a cage for a host of souls. Whenever a necrotaur slew a living person, the necrotaur captured their soul, binding it to their necrotic flesh, to empower and sustain them. I understood, then, what needed to be done. Fern's herd could not pass on to the next world, just as she was bound to the wand by her regret and guilt. Saradomin said she needed to let them go. She needed to let the memory of her herd die, in order for all of them to be free and move on. So, while Saradomin and I fought the necrotaurs in the corporeal realm, Fern fired spectral arrows from her ghostly bow at the centaur spirits, trapped in their cages of necrotic flesh. The necrotaurs weakened as Fern released the spirits of her herd from their terrible limbo. Their flesh ceased to regenerate. The luminous blood dried in their veins. The necrotaurs diminished to shambling animated husks, which we steadily dispatched. Fern circled the necrotaurs, kicking at any that sought to flank us, and continued to shred the spirits of her herd with spectral arrows. By severing their spirits from the flesh that bound them to the corporeal realm, Fern atoned to each of her family in turn. With ghostly tears streaming down her cheeks, she earned forgiveness for murdering her people, and trapping them in tormented unlife. I swung my blade at the necrotaur husks until exhaustion overwhelmed me. Eventually I collapsed, no strength remaining to lift my sword. Saradomin stood over me and shielded me from hoof, blight and claw. Any that dared approach us, he dissolved in divine radiance. My strength renewed and spirits lifted, I staggered to my feet and stood beside the lord of light, battling the undead. It was glorious. Finally we dispatched the last of the necrotaurs, and the battlefield was silent. The dismembered corpses were still and quiet as the grave. I lifted my aching head, and caught a last glimpse of Fern's flickering form. The luminance of her spirit had waned with each light she extinguished. Together, we had resolved her unfinished business, unravelling the ties that bound her to this world. I could barely make out the silhouette of her, knelt on all four knees beside the heap of stinking corpses. Fern gazed at Saradomin, calm and peaceful, her features no longer strained by grief and remorse; strong in the knowledge that she would be reunited with her family. Though her connection to the corporeal realm was now too weak to hear her, I saw her lips form the words 'thank you', and Fern faded from the world of the living.",
    "During our journey back to Asgarnia, Elora's horn crumbled to dust in my hand. I felt a jolt of energy course up my normally numb arm, but that is all. The corruption remains. I surmise that it was Fern's grief that bound her spirit to the wand, and sustained its power over death. Or perhaps there was something more. I do not know. I'm just glad to be rid of the blasted thing. Even the power of a god has its limits, and we endured an exhausting battle. Saradomin could have drawn upon the resources of his followers, but he seemed to savour the solitude of a trek across the wilderness, and a reprieve from mortal politics, while his power regenerated. Saradomin seemed troubled and grave, so as we travelled, I too contemplated my thoughts. At first, I was relieved. Fern and her herd were at peace. Our quest was complete! But doubt clawed at my mind as we drew closer to Falador castle. I had failed to restore the centaurs to life. The Wand of Resurrection was no more. And the corruption continued to cast its shadow over me. Eventually, I could stand the aching silence no longer, and blurted out my fears. Had we failed in our quest? Was my god angry? Disappointed? But, I need not have worried. In Saradomin's eyes, we had accomplished all that he desired and more. It is peace that he sought for the centaurs, not war. Together we're actively seeking a cure for my corruption, but with the destruction of the wand, the creep of my contamination seems to have halted, for now. The troubling voices have sufficiently quietened that I can usually pay them little mind. Sometimes I sense a spark of power in my corrupted flesh. It may prove useful, in time."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Battle_of_the_Monolith?oldid=36199587’"
  ]
}