{
  "Maria": [
    "Please, you have to help me!",
    "The house... There's a ghost! It's killing everyone! Please, you have to help!",
    "Ingram is the owner of the mansion. He's still in there. It seems like he found something while exploring the levels below the basement.",
    "I don't know, but there seems to be some kind of...energy surrounding the house. I wasn't able to take any items in or out to help the others! Please save them and vanquish the ghost, adventurer.",
    "The entrance to the mansion is just up those steps. Be careful.",
    "Please let me know when the house is safe!",
    "Is it safe now? Did you find the ghost?",
    "Oh, thank you. I think I might stay out here, then.",
    "Did you find anyone else in the house?",
    "I feared as much. Ghosts, demons... How could this have happened to us?",
    "Well, I suppose I should thank you. Hopefully now they can rest in peace.",
    "You survived the mansion where no one else did. Such bravery deserves recognition.",
    "Let's see if I've got anything for you...",
    "Thank you for putting the ghost to rest! Here: this...entity has been floating around, asking for you.",
    "Thank you for putting the ghost to rest! Here take this ring as a reward.",
    "Thank you for putting the ghost to rest! Here take this huge lamp as a reward for having done at least one of the challenges."
  ],
  "Player": [
    "What's wrong?",
    "What was it?",
    "Okay, I'll see if I can find them.",
    "My name is Player, I'm here to help.",
    "I'm not a monster. I'm trying to deal with the ghost.",
    "What do you mean?",
    "Who's there?",
    "Hello?",
    "Hello?",
    "Can you hear me?",
    "Hello?",
    "Ahh '07, an excellent vintage. Not quite as good as '06 or '10 though.",
    "Hello?",
    "Who are you?",
    "I think it's his ghost who's haunting the mansion! He's killing people.",
    "What can we do about it?",
    "It's worth a try.",
    "It didn't work...?",
    "I cast a spell to break your curse, but you're still a monster.",
    "You were a little girl, and then you turned into a monster.",
    "I don't know her name.",
    "No. The little girl is you. Like I said.",
    "That's because you are the little girl.",
    "Then who are you? What are you?",
    "But why do you look like that?",
    "And who was Rowena?",
    "So - what? - you consumed her and took her form?",
    "Then the spell I cast must have cured your madness.",
    "Since you're no longer trying to devour me, I have a more pressing issue.",
    "This mansion is haunted by the ghost of Ormod Gulvas. I was going to put him to rest, but you ate the ghost of his dead son, preventing him from finding forgiveness.",
    "How?",
    "But the main hall is dangerous. There's an energy field.",
    "Well, that finishes what I came here to do. I need to report back that the ghost has gone. What are you going to do now?",
    "I found him and put him to rest. It was the ghost of Ormod Gulvas, who originally built this mansion.",
    "There was also a demon who had taken the form of a little girl. He's perfectly friendly now I've broken his curse.",
    "There didn't seem to be any survivors, I'm sorry."
  ],
  "Ingram": [
    "Who is it? Who's there?",
    "No! Monster! Get away!",
    "You cannot! You cannot! I tried. Do not repeat my mistake!",
    "I went down into the dark. I disturbed something. Something ancient. Something horrible! It followed me up to the house. A horror from lost aeons! Do not tread there, lest you stir up another monstrosity.",
    "Do not go down into the basement!"
  ],
  "The following text is transcluded from Transcript": [
    "Note From Ingram."
  ],
  "The label is rather worn with a blood or wine stain. You can make out": [
    "'Ch..ea. ....... 07 5th Age'."
  ],
  "Emaciated spirit": [
    "I can't find it. It's lost...",
    "I want her hairbrush back. I miss her."
  ],
  "Lenian": [
    "Thank you, [sir/madam]. I must apologise for my behaviour. I do not know what came over me.",
    "My name is Lenian. My father, Ormod, built this great mansion long ago.",
    "Oh! Poor father. He was a troubled man... He blames himself for my death, I think. His guilt has trapped him here. Turned him into a monster.",
    "If it is what he seeks, perhaps my forgiveness could give him some reprieve.",
    "Wait, it's her! Keep her away from me!"
  ],
  "Monster": [
    "...",
    "I'm sorry... what are you talking about?",
    "I don't understand. What are you saying, human?",
    "A little girl... Rowena. You mean Rowena?",
    "Rowena... Is she safe?",
    "I had the strangest dream... I dreamed I was Rowena. I just wanted to play. But people kept running away, and when I caught up to them, they vanished.",
    "I am not Rowena.",
    "My name is Senecianus Aloysius Pamphilius."
  ],
  "Senecianus": [
    "I am a citizen of Senntisten.",
    "Like what? Oh, like this? Because I am what you humans call a demon.",
    "She was... By the Twelve! I killed her! I ate her! Rowena... I am sorry.",
    "The guilt must have driven me mad. I lost myself. I remember...a cell? Priests and doctors? An asylum? Time and my madness have blurred events. There was a home for the broken-minded that I recall hearing of before the fog of confusion.",
    "If that is so, then I thank you.",
    "And what would that be?",
    "I dreamed of that. Lenian. Rowena wanted to play with him. I believe I can help you.",
    "I can think of two ways. I can simply consume him, as I did with Lenian. Or I could take Lenian's form, and grant his father the forgiveness he seeks. Which would you prefer?",
    "Very well.",
    "I am beginning to recall the layout of this building. Meet me in the main hall.",
    "I will be able to protect you."
  ],
  "\"Lenian\"": [
    "Father.",
    "Father, come closer.",
    "Fiery. *burp*",
    "Father.",
    "Father, come closer. It's going to be okay.",
    "I know, father. We don't have to stay here any longer.. Let's go.",
    "There. Put to rest.",
    "I need to get my bearings. We'll meet again soon, Player."
  ],
  "Ormod": [
    "Lenian...? Is that you?",
    "Lenian...? Is that you?",
    "Lenian I... I'm sorry. I never meant to hurt you."
  ],
  "Congratulations! You have completed": [
    "'Broken Home' - Complete this quest."
  ],
  "There is one catch though": [
    "you must have completed the first challenge to be able to complete the second, and you must have completed the second challenge to be able to complete the third."
  ],
  "Challenge": [
    "Replay Broken Home and complete the quest without dying.Rewards: 1 huge lamp and access to the next challenge.",
    "Replay Broken Home and complete the quest without dying and use one or less mystery meat.Rewards: Rowena the ghost (pet) and access to the final challenge.",
    "Replay Broken Home and complete the quest within 37 minutes (time trial).Rewards: The asylum surgeon ring. This ring will occasionally prevent you losing adrenaline when using threshold abilities, and can reduce the energy used when you use special attacks."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Broken_Home?oldid=36199676’"
  ]
}