{
  "Double agent": [
    "Player. Your name has appeared on my list. A very exclusive list it is, too. A list of one. I have a terrible time keeping it updated. As soon as I add someone to it, they die soon after. I can't abide the crossings out. So much mess. But there you are. Top of the list of one.",
    "You. Are. It.",
    "Oh dear... I hope you don't feel naked without your armour right now. No need to worry: I won't be killing you quite yet. Can I ask a favour? After I leave, you will see things. I ask that you ignore them. They are trifles. Put them aside and give up on your quest. Enjoy the time you have remaining. Don't waste your few hours on a clue scroll. You. Are. It.",
    "You know what they say about graverobbing? If you're in a hole, you may as well make money from it. Uri was in debt. So, he added graverobbing to his resume. Undertaking and graverobbing. They go hand in muddy hand. But that's not why I am here, is it? I am here to menace, to threaten. To tell you to stop following this rotten clue scroll. You will die either way, so stop following it. Relax, let the death happen. Enjoy your demise!",
    "You. Are. It.",
    "Charos was always the trickster. Everything he gave came with a price.",
    "When Uri gained the treasure he desired, he was cursed to become the one who guarded it. He gained a treasure he could never have. Uri became me. But our late Mr. Charos obviously thought that wasn't enough of a game. He thought it would be hilarious if he left a crumb of Uri behind. And that crumb has been doing every pathetic little thing to revert the wishes. Leading adventurers to his treasures, as if selflessness would be the key to winning back his soul! As if it were that easy! For the most part, I've let Uri toil away. But he has managed to become an irritant. Uri has also been guiding others to this tomb, to find and destroy the wishbringer. That I cannot abide.",
    "As you've probably guessed, I have misled you. The clue scroll is not EXACTLY cursed. It was written by Uri, leading people here. I've just added a bit of spice to proceedings. Made it seem cursed: threatening people as they do it, malingering, that sort of thing. Oh, and eating anyone who dares to take a jade figurine.",
    "Oh no, I can't kill you. Not yet, anyway. I can only kill you if you claim the wishbringer. As per the rules of Uri's final wish.",
    "Now, let me list what you probably SHOULDN'T do. You shouldn't claim the right wishbringer. I would have to kill you. You shouldn't claim the wrong wishbringer either. I would have to kill you. And don't think about trying to run away to get help. Charos put in a failsafe. If you try you'll find yourself strangely unable to speak about this business. Otherwise, you would just tell everyone about his resting place, right? I suppose you COULD destroy the correct wishbringer... But there are so many to choose from! What a task that would be. What a shame it would be if you got it wrong. I'll be over here, sharpening the teeth.",
    "Don't take too long.",
    "Are you sure you want to destroy that statue? I have to admit I'll miss your tenacious spirit if I have to kill you.",
    "You thought that was the real one?",
    "What have you done, Player? Oh, who am I kidding? This is all wonderful weight off my shoulders. Godspeed, Player."
  ],
  "Reldo": [
    "Oh no...not you. Why did it have to be you? You're dead. Or you are as good as dead.",
    "That clue scroll, the one in your backpack. I have seen it countless times before. Each time, an adventurer brings it so me, and each time they die. Not here in the library, but sometime after. And I have this very same conversation with them; I tell them about the scroll and they do of two things... They either complete the clue scroll and go missing. Or they ignore the clue scroll, and die. I get a coroner's report, requesting that I remove their names from the records. Player, I am so sorry. I don't know why I have been chosen to play such a pivotal role in this curse. None of my research has revealed anything of use. All I know is that you need to hand me that clue scroll so I can sign it.",
    "There you go. The clue has moved on to its second stage. Best wishes, Player. I hope to see you again, for your sake.",
    "What a relief to see you alive still! I hope the burden of that clue isn't getting you down; if anyone can solve the mystery of this, I hope it is you."
  ],
  "Player": [
    "What are you talking about?",
    "Hello. I found this casket in the graveyard. I believe it once belonged to someone close to you.",
    "I thought this WAS yours.",
    "Why haven't you just killed me before I got here?",
    "The double agent said I needed to destroy the correct wishbringer. I should choose wisely, as the wrong one will result in my death.",
    "I didn't bring it with me...",
    "I have reason to believe that Charos is alive. He may even have been the person who asked you to bury his body!"
  ],
  "Duke Horacio": [
    "Are you okay, young [lady/man]?",
    "Thank you, undertaker. I have something for you... for her grave. This casket holds everything she loved. I want her to be buried with it. Is that possible?",
    "Thank you. Thank you for everything.",
    "Greetings. You're right, I had a chest like that one once. I mean, it was slightly smaller, but the wood, the finish and the pattern were near identical.",
    "It's similar, I will give you that! But no, this is a different size than the one I had. It certainly brings back good memories though. Thank you for showing it to me. Is there something else I can help you with?",
    "Greetings. Welcome to my castle.",
    "Hm? Uri was the undertaker that helped organise the farewell of my dear Oriana. He was very accommodating; I admit in my grief I asked a lot of him but he never complained. Perhaps the kindest gesture was that he allowed me to organise a casket of Oriana's belongings to be placed with her. One of those things being the letters we exchanged when we first met. Oh, Ori, I miss you so."
  ],
  "Flashback": [
    "Uri is talking to Duke Horacio."
  ],
  "Uri": [
    "Horacio. I truly am sorry for your loss.",
    "Yes, your Honour. She can be buried with it.",
    "Hello Duchess!",
    "Now, what treasures do you hide?",
    "Letters, worthless.",
    "Rags.",
    "Wait - obsidian jewellery! Yes. That will do. That will do very well indeed!",
    "We are closed.",
    "That's why most people come here.",
    "You have come to the right place. I assume you want a more... ornate burial? Icthlarin and Amascut look favourably on those who come to the Noumenon with gold.",
    "Good. Can I take his name?",
    "Very well. We can talk over the smaller details later.",
    "I always admired you, Charos. The things you did with magic boxes, trinkets, jewellery - I tried to match the detail and craftmanship in my caskets. I hope it is some consolation that you are being robbed by someone with the deepest respect for you.",
    "If I remember my studies well enough, I should be taking this one... your masterpiece.",
    "Let's see if the tales are true. As many wishes as I want... I want to have more wealth than I could ever possibly spend.",
    "I want the wealth to be hidden from sight. It's mine.",
    "No one else can have this wishbringer. If anyone claims the wishbringer, they die.",
    "THREE wishes? Wait, I thought there were...",
    "You did it? You did it! Oh my goodness, I am whole again.",
    "I never dreamed this moment would come. Never. I thought I was going to be a wisp until the end of days. Thank you, Player. Now, it's time to put Uri's Great Plan in place. I've had enough time - lord, more than enough time - to think on it. Point number one: my treasures are yours, the world's, whoever wants them. I wouldn't touch them with an iron javelin. Who knows what trigger Charos has placed on them! I'll even help you find them if I can. Point number two: that old necklace you discovered - it belonged to Charos. I'd like your help with that, if you are willing. There's too many unanswered questions here, and I believe the necklace it the key. What happened to Charos? Why did he create a wishbringer in the first place? Why was he so eager to stop people raiding his tomb? Bring me the necklace - his necklace. I believe that, with the jade shards scattered around the world, I can make it capable of finding out more about him. But, in the meantime, I will shower you with rewards. You deserve it, and I will be damned - literally - if I kept them.",
    "It feels so good to be me again!",
    "Do? Up until now I was struggling to even BE! Can you imagine floating in the Spirit Plane, waiting for a shadow of yourself to lose concentration, so you can creep into the real world? So yeah, I haven't got much of an itinerary! For now, I'll be helping adventurers clear up my treasures, and looking for information on Charos.",
    "Even then, when I was younger, I wasn't proud of it. I bet whatever I could get my hands on at the Duel Arena. Not on myself, of course, I couldn't fight for toffee. I was addicted to staking on other warriors. But the luck and money would sometimes run out. Graverobbing was lucrative, and it wasn't hurting anyone that wasn't already hurt. At the time, it made sense. Less sense now, of course. Let's call it a lesson learned.",
    "You lost it? You're lucky there's a charm on it that ensures is returns here safely.",
    "Now, what was I saying?",
    "Oh yes, the necklace. If you have the time, and I know you are busy, then I would welcome you using it. Follow its trail, find out what Charos did with his life, where he went. I think we both have questions that we would like answered. Just be aware, the magic in the necklace is weak. It will only detect the location of the jade trinkets when you are close by.",
    "You did it? You did it!",
    "Let me see.",
    "Go quickly and bring it to me. I need to see it.",
    "Charos, you sly dog! I KNEW there was something wrong with his body. It was just too flawless: like someone was making the perfect version of themselves.",
    "Well, if Charos is still alive, perhaps we can use the necklace to find him?",
    "Let me see. I'll try to get it working fully.",
    "Hmmm. It's warm, and it's releasing a very light pulse of magic.",
    "But I know this magic... where have I seen it before?",
    "...",
    "The gnomes! Yes, it's a magic that the gnomes use. Anti-illusion magic!",
    "Well, I'll be. I may be wrong here, but I think that the necklace reveals true identities. If there is anyone using magic to hide themselves, this necklace will discover them.",
    "Charos, you trickster, what is your game here?",
    "My guess is this is a key to finding Charos. If he has been hiding in plain sight, then this would reveal him.",
    "Let me do some research. I think I can amplify the magic. You would be able to reveal illusions around you. Maybe even Charos.",
    "That should make it more useful. Come back later - I will keep you updated.",
    "I need to do some research. I think I can amplify the necklace's magic. With it, you would be able to reveal illusions around you. Maybe even Charos.",
    "That should make it more useful. Come back later - I will keep you updated.",
    "Oh, I intend to. Farewell."
  ],
  "Vision": [
    "Uri is standing on the grave of the Duchess.",
    "Uri is talking to someone in his house.",
    "Uri is standing next to the coffin."
  ],
  "Woman": [
    "I'm sorry it's late. I heard you were the person to come to. I need to bury someone.",
    "But I need to do it... discretely. My husband was not a poor man. And he was not well loved. Many would want to know his resting place. I fear that they would steal from his grave. Perhaps even desecrate it.",
    "Yes, yes. He said as much in his will.",
    "I don't think that we should discuss that right now.",
    "Thank you for your time."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:You_Are_It?oldid=36199678’"
  ]
}