{
  "Player": [
    "Hey there. What's that delicious smell?",
    "And what is it you need me to do?",
    "My mother warned me about eating odd foods offered by strangers.",
    "Okay, I'm game. Wait. Why did you think I would assume it was from a person?",
    "I lost that mysteriously delicious-smelling meat that you gave me. Can I have some more?",
    "Oh, I remember now. I did have another question though.",
    "My mouth is filled with joy! What was that?",
    "That was okay.",
    "Yeah. Just okay.",
    "Just because I don't like it doesn't mean others won't. What was that meat anyway?",
    "Bay...con? Why did you call it that? Does it come from a creature called a 'bay' or something?",
    "Oh, sorry! So what is it then?",
    "A pig? Urgh! Why would anyone want to eat one of those?",
    "Ceremonial greased pig wrestling, obviously.",
    "Well you could...I suppose...maybe they could...",
    "I suppose you're right. But what can we do about it?",
    "That sounds like a great idea. How are we going to do it?",
    "Hey, what's that sound?",
    "Who are they?",
    "They're so creepy...",
    "Uh, that might be my fault.",
    "I think they might be after the pigs, not you.",
    "Well what can we do?",
    "Looks like Eli has rescued the last of the pigs. I should head down into the cellar and speak to him.",
    "What do you mean?",
    "That does sound like a good idea.",
    "But if everyone has pigs at that point, how will you make money from selling bacon?",
    "What could go wrong?",
    "Everyone likes fighting monsters, right? If pigs can help with that, people will want to take them on dangerous expeditions.",
    "People need to recharge spiritual energy and altars are often hard to find. If a pig could carry one about, that would be useful.",
    "Pigs are rather big, so they can probably handle quite a few packs and bags. That's really handy for adventuring!",
    "Uh, thanks...I think. So what now?",
    "Will do!",
    "Won't naming the food after yourself cause some confusion?",
    "I don't think bread was invented by someone called Simon.",
    "Another tale of a promising sporting career cut brutally short.",
    "Martin, can I have one of Pigzilla's piglets?",
    "It's not for me. It's for Eli Bacon. We're planning something that will increase interest in pigs, and need an impressive piglet to do it.",
    "Fantastic! Just put it in my backpack and I'll be on my way.",
    "Oh no. Who would do such a dastardly thing?",
    "You mean kill them?",
    "Seems fair enough. I'll get right on it.",
    "What do you want me to do again?",
    "I've had a word with him and he wants me to deal with a pickpocket first.",
    "Thanks, I have my own.",
    "Why would I need those?",
    "...I'm going now.",
    "You! You're the one that picked Martin's pockets!",
    "Martin, this is the pickpocket that stole from you.",
    "I didnt[sic] want to come down to this, but you leave me no choice!",
    "Let that be a lesson to you!",
    "I thought you didn't want me to kill him.",
    "Really? Okay, let's give this another try.",
    "Not just yet. We're going to have another bash at it.",
    "Take this!",
    "And this!",
    "And this!",
    "And one more for luck!",
    "I don't think he'll be bothering you again for a while.",
    "Thanks! I'll take him to Eli now.",
    "Can I rename that pig I got from you?",
    "Have you seen that piglet you gave me?",
    "I got the piglet from Martin!",
    "I had it here a second ago. Let me just go look for it.",
    "I got the piglet from Martin!",
    "No. All I had to do was deal with a pickpocket for him.",
    "There you go. What should we do now?",
    "You broke your hammer on a hiker?",
    "How did you do that?",
    "... You know what? I don't want to know.",
    "I built the machine. What now?",
    "Blood sl- Did you use a machine like this to butcher the pigs for bacon?",
    "Whew! That all looks like it'll work. What now?",
    "Fine. This shouldn't take too long.",
    "Okay, I'll get on it now.",
    "It was no problem at all. So what now?",
    "Should we maybe wait a little longer to see if he goes through a growth spurt?",
    "Err...Eli?",
    "Eli?",
    "So what do you suggest we do?",
    "Take them home to sleep it off while we continue our quest?",
    "Get the Falador guards to put them in a cell?",
    "How about doing something that does not involve killing them?",
    "Sure...",
    "Great! I'll make a start.",
    "They've all eaten the bacon, but they're not falling asleep. I should speak to Eli and find out what went wrong.",
    "I got the addicts to eat the bacon, but they all seem fine.",
    "Fine, thanks. Why do you ask?",
    "Onions? Why do you need onions?",
    "What? How does that work, exactly?",
    "I'm...really having trouble following this. By that logic, you are saying that onions repel bacon addicts because it does not go with the food they eat - bacon.",
    "But then garlic would only repel vampyres because it does not go well with the food they eat - blood. And how would you know that?",
    "Well all right. I guess it won't take me long to gather a few onions to see if it works. I suppose five should be enough. Will you need a hand dealing with the addicts if the potions takes effect while I'm away?",
    "Right. Well...I'll be right back I suppose.",
    "Eli, where have all the bacon addicts gone? And why is my pig fully grown?",
    "So do you still need the onions?",
    "What meat?",
    "Fair enough.",
    "That sounds pretty suspicious.",
    "But...",
    "But...",
    "Here, I got some of the things we need!",
    "That won't take me long to gather!",
    "Are you sure this will work?",
    "Okay, I'll get that for you now.",
    "Here goes nothing!",
    "The machine seems to have worked.",
    "Why do you have clothes and stuff buried in the field?",
    "I suppose.",
    "It really doesn't sound like a farming thing.",
    "That is rather specific.",
    "Really? How generous of them?",
    "I can't imagine anyone just leaving all that handy stuff out for you. Do they leave money too, or just items?",
    "Of course. Why wouldn't I?",
    "You wouldn't happen to have a list of the cities I can take him to, in case I forget?",
    "I'll be right back",
    "Come on, we have a lot of work to do.",
    "Not yet. But soon, I promise.",
    "Well, let's impress some people with your 'skills'.",
    "Actually I have trained this pig to do more than just wrestle.",
    "As you can see, I've attached some packs to this pig so it can carry items for me.",
    "Have you ever not had enough space to carry sharks or granite boulders in your pockets? Well a pig is strong enough to haul some of your daily load!",
    "It can do all that and more!",
    "This pig carries with it an altar dedicated to the gods... In a general, non-denominational way.",
    "Don't worry, all of you. This altar works for all the gods, and is probably not sacrilegious to any of them.",
    "They can fight in real combat! Look at that steely determination and state-of-the-art armour. Why with one of these at your side you'll be ready for any fight!",
    "Don't worry! Like any pig you have ever wrestled this one is loyal and friendly to you, but not to your enemies.",
    "I'm glad I could show everyone here the value of pigs.",
    "Well pig numbers are down, but I'm sure if you were to speak to Eli Bacon and Martin then they might help you set up a sty. Then you can raise all the pigs you'll ever need!",
    "...Then you can raise all the pigs you'll ever need!",
    "I think that's impressed enough people. I should go back and see Eli to check if it worked.",
    "It did? Great!",
    "Always glad to help.",
    "Well, I suppose that'll keep them safe from roaming bacon addicts at any rate.",
    "How's the pig farm going?",
    "How much of each can I get?",
    "What if I don't have any space to carry them?",
    "Brewing bacon? That sounds disgusting!",
    "That's not a great advertisement.",
    "Like Summoning pouches?",
    "But why would your machine turn pigs into spirit familiars?",
    "Erp. But what does it do?",
    "That sounds great!",
    "But how will I make sure I get the right pig tooth for the pouches I want?",
    "What does that mean?",
    "So can I swap what the tunnel does whenever I want to make sure I get the right teeth?",
    "No?"
  ],
  "Eli": [
    "That? Oh, that's something I'm working on. Hey, you look like you've done some farm work in your time. You free to help me out?",
    "I just need you to eat some of this...meat I've cooked up. It's not from a person or anything like that! I just need you to give it a taste and tell me what you think.",
    "Well, what're you doing bothering me then? Get off my land!",
    "No reason. I thought you might have heard about that accident. Yeah... Anyway, scarf that down and tell me what you think.",
    "Can I help you with something?",
    "Well I don't see why not... There you go. Have a chew on that and tell me what you think.",
    "Can I help you with something?",
    "I want you to eat that slice of meat I gave you.",
    "Right, see you later.",
    "That, my friend, was a new type of meat I've discovered. I call it...bacon!",
    "Okay? Just okay?",
    "I was hoping for a better reaction.",
    "That, my friend, was a new type of meat I have discovered. I call it...bacon!",
    "No! I named it after myself, Eli Bacon! Bacon, like my last name! That's what all the great people do.",
    "What would you say if I told you it was...from a pig?",
    "Well, it's a long story. But let me ask you something first. What would you say pigs are good for?",
    "And what else?",
    "Exactly! Aside from pig wrestling they are useless! They are just big, smelly animals that eat loads of food. Even pig wrestling is in decline thanks to all these new sports like 'Castle Wars' and 'duelling'. Thanks to all these popular pastimes there is no demand for pigs. I think only me and Martin keep them these days. And he only keeps them because of the tourist money generated by his freakishly large pig; Pigzilla. Basically if people find out that pigs taste delicious when cooked how long do you think it'll take to eat them all? Just look what happened to those useless no-horned unicorns that were all over the place a few years ago. When people worked out they tasted good they were wiped right out!",
    "What we'll do is get people wanting pigs for something other than meat. After all, people keep cows around for milk and sheep for wool. If we can convince them pigs are good for something, then they'll start breeding them again. Once the numbers are back up, we can reveal the tasty truth to everyone. By that point there'll be enough pigs that people can eat as many as they want.",
    "I have a plan, what we are going to do is...",
    "What sound?",
    "Those are some of the locals. They know about bacon. I gave a few of them a taste and now they're addicted. They're crazy!",
    "Don't worry. So long as you locked that gate behind you we should be all right.",
    "Did you hear that? They're going to eat me!",
    "Oh! Er...that does make sense. Wait! They're buttering up the pigs for roasting! We have to stop them!",
    "Try making some pig decoys! Those lunatics are too far gone to tell the difference. Here - take this big stack of bacon. You'll need some planks too. Let's go!",
    "Try and build something out of those to distract them! Quick!",
    "I can't rescue this pig!",
    "We don't have time for this! Help me rescue the pigs!",
    "That's the ticket! Now cover it in bacon as a diversion!",
    "Good work. While they're eating that bacon we can get this show on the road.",
    "You remember I said I had a plan to drive up demand for pigs? Well this is it. What we do is we raise an amazing pig. I mean a real monster! One that people will come for miles around to see. Then, we train it to do some sort of trick. We show it off to all kinds of folks, and they go nuts for pigs! Before you know it, demand for pigs will soar!",
    "And then...bam! We bring out bacon and make a fortune!",
    "Well it is called 'bacon'. I'm sure that legally they'll have to pay me money when they start making it. I sent off a form and I promised to hand over lots of money to secure the rights to call pig meat 'bacon'. It can't fail!",
    "I know! All we need to do is work out what a pig is good for. Any ideas?",
    "How will that get people interested?",
    "How will that get people interested?",
    "How will that get people interested?",
    "Aww, and there was me thinking you'd be the smart one. You have a think and let me know when you've got something.",
    "That's a good idea you had there. I guess you're smarter than you look after all.",
    "Now we need our showpig. Go have a word with Martin in Draynor and see if he'll let us have a piglet from his big old Pigzilla.",
    "You can always find him by his pigsty in the marketplace. Just head south-east from here and you'll find him in no time.",
    "I am Eli Bacon, the proud inventor of bacon! I work on this here farm as a pig farmer.",
    "I don't think so. Nobody gets Richard Cookedmeat confused with the food he came up with. Same with Gerald Beer and Simon Bread.",
    "Well that's where you are wrong. I sent off for some fancy papers about registering your food with the Cooks' Guild. Chef Morrisane explained it all in his handy little pamphlet. And it only cost me thirty percent of all future earnings!",
    "Well, a few days ago I was getting Gassy Steve - one of my prized wrestling pigs - ready for his next competition. I'd attached him by his trotters to an old spit roast. It keeps 'em still while I cover 'em with ceremonial garlic-and-herb grease, y'see. Then, disaster struck! I'd placed dry twigs and rags under the spit to catch the falling grease, as usual. Before I knew what was happening, sparks from a nearby torch ignited them, and poor Gassy went up in flames!",
    "Within minutes, a crowd of people had gathered by the farm. The smell of poor Steve cooking was, ironically, attracting people from far and wide. People started begging me to not bury him, and wanted to try the cooked flesh to see if it tasted as good as it smelled. Stricken with grief as I was, I gave it a try myself...and found it to be sweet and delicious! And that is how I learned the secret of bacon.",
    "Right, see you later.",
    "Well hello again. You got any idea what we can teach our showpig to do?",
    "Can I help you with something?",
    "Can I help you with something?",
    "Now we need a great pig to be our showpig. Go have a word with Martin in Draynor and see if he'll let us have a piglet from his big old hog.",
    "Best get to it, then. Check the shed if you want an axe, sacks or shovel.",
    "You never know. I always find them handy when 'dealing' with people.",
    "Fine. See you later!",
    "Really? Where is it?",
    "Great! Did he ask much for it?",
    "Sounds like a fair enough trade. Let's take a look at that piglet then, Player.",
    "What we need to do now is work on making a machine to train the pig.",
    "What was it you thought they could do again? Haul stuff about for you? Yeah, that sounds about right.",
    "What was it you thought they could do again? Carry an altar? Yeah, that sounds about right.",
    "I have some plans drawn up, but I think you'd be better off putting it all together. Three planks should cover it. All it'll take is a couple of planks. I'd help out myself, but I broke my hammer on a hiker last week.",
    "I meant I broke my hammer mending a fence ruined by hikers. Yeah, that's what happened.",
    "Here, since you can take it all now, you might as well have the stuff to upgrade it as well. That'll save you time when you're done building it.",
    "That's a pretty machine and no mistake. It reminds me of the one...never mind. We won't need anything fancy like saw blades or blood- sluices like last time. Just some more planks and iron bars.",
    "Yes, that's exactly what I used it for.",
    "We need to fatten this little fellow up a bit - make him look more impressive, like. I have plenty of pig feed, but we should probably mix in some wheat to fortify it a little. Would you mind grabbing some for me? Five bundles should be more than enough. There's a field over by Draynor that you can take it from. It's not too far away.",
    "We need to top up the food supplies, so I need you to get me 5 bundles of wheat. I need you to get 5 bundles of wheat and bring them here for me. The closest wheat field is over to the east of Draynor.",
    "That should keep us sorted for a while. Thanks!",
    "Your pig is still looking a little small. We need to bulk it up a bit.",
    "I don't think we can keep this news under wraps for much longer. Those bacon addicts... Wait...that's it... Of course! Hahaha!",
    "Bwahahaha!",
    "Oh, don't mind me. I just thought of something funny about...pigs. I have had an idea though. What this little squealer needs is some good, healthy exercise. Keeping him cooped up down here won't do him any good. We need to get him up and about in the sunshine. If we can clear the yard of addicts then we can take him for a good old trot about in the fresh air.",
    "Here, I use this 'sleeping potion' sometimes when I need to get...pigs...to sleep. Just let me peel that old skull-and-crossbones label off. There, that should do it. Just go up there, attach some bacon to one of those pig statues you made and then pour some potion onto it. When they tuck into it they'll fall asleep. Then I can...er...",
    "Yeah, that sounds good. I'll do that.",
    "Oh, the guards. Of course. That makes sense.",
    "What? I would never do that!",
    "Just head up into the field through the trapdoor to begin. I'll leave the bacon and sleeping potion up there for you.",
    "Just head up into the field through the trapdoor to begin. You'll find the bacon and sleeping potion up there.",
    "How's the yard looking now?",
    "Don't worry about that. The potion takes a while to act. Makes it more of a surprise when they start to get sleepy. I mean, it's best to slip an animal this stuff when they don't expect it. Say, how are you feeling by the way?",
    "No reason. Tell you what - in case the potion doesn't work, why don't you go get me some onions?",
    "Well, you know how garlic repels vampyres I'm convinced that onions will repel these bacon addicts.",
    "Look, I invented bacon, so I should know how it works. Bacon and onions are two strong flavours, and they just don't go together. To those hardened bacon addicts - well, they shouldn't even be able to go near them. Specifically fresh onions. So if you can go and get me a fresh onion you picked yourself then we can use it to clear the yard if the poison doesn't work.",
    "That's right so far.",
    "Look, I'm the bacon expert here. I can't just expect any lay person to understand how this stuff works.",
    "Oh don't worry. I've got it under control.",
    "The addicts? They...er...blew away in a storm. I've been taking your friend here out for trips around the field - good exercise! Yeah.",
    "Oh yes. Your pig is still hungry and with the addicts gone he'll eat the onions himself. We might as well top up the supplies in case the meat runs out.",
    "Meals. I meant in case his meals run out.",
    "No it doesn't.",
    "It sounds perfectly reasonable.",
    "Perfectly. Reasonable.",
    "Thanks! We're still not done though. I need you to get <number> fresh onion[s] and bring [it/them] here for me.",
    "That should keep us safe if more addicts appear. I suppose the next thing to do is turn on the machine and see how well it works!",
    "Well, you built the thing. I doubt the pig'll be much use just from this, but he'll look just grand. And that's all we need. If the pig looks good and you can pretend that the trick works, we're set!",
    "Now that those crazies are all gone I need you to bring me some very fresh onions to feed the pig. Five should be enough. I need you to get <number> fresh onion[s] and bring [it/them] here for me.",
    "Hmm, I think this might need a little work.",
    "Well, I guess it's better than nothing. Come here you.",
    "It does, although I think I should give it a tweak while you are away. Maybe I can dig up some of the clothes, packs and armour buried in the field to equip pigs a little better.",
    "People keep on dropping things in there. Like old clothes, hats, money, personal possessions and unwanted limbs. I bury them in the field to keep the place from getting untidy. Look, it's a farming thing. You wouldn't understand.",
    "It is a very specific pig farming thing. For only this farm. And if your name is Eli.",
    "No! I didn't kill any...wait, what?",
    "You...you believed that?",
    "No reason. Remind me to get you as a character witness if I ever need one.",
    "Anyway, take that pig around the big cities to show it off! Lumbridge Castle courtyard, Varrock Marketplace, Ardougne Marketplace and near the north Falador gate would be the best to give it a try. If nothing else, they're next to those lodestone things, so you can teleport there with the pig easily. Don't be frightened to let the pig walk with you. Just put him down on the ground when you want to show him off and pick him up when you're done.",
    "Here, this should help your memory. Now go and show the world what a pig can do!",
    "And if you don't like the name Martin gave your pig, you can go and change it with him now he's all yours.",
    "Welcome back! It worked!",
    "We've had about a dozen people come by asking to buy breeding pairs of pigs. Others have put in orders for pig-training equipment too. I hear that Martin's in the same position. You've saved the pig population from going extinct!",
    "Only thing is - what with my pigs being moved underground - they think that's the way to raise them.",
    "I suppose you're right. It just means if you want to get bacon at the main cities you'll have to keep an eye out for pig pits instead of pig sties! In a year or so we can start letting people in on the secret of bacon. In the meantime you can come see me whenever you want more. This calls for a fry-up!",
    "Can I help you with something?",
    "Very well. I have some things for you if you want them.",
    "There you go! I've sent them to your bank.",
    "There you go! I've sent them to your bank.",
    "Well can I help you with anything else?",
    "Can I help you with something?",
    "Well, there are a few things I can do now. First off, once a week I should have raised enough pigs to be able to offer you a nice reward. Either you can have a stack of bacon, or I can give you some of the trained pigs I have sent through the machine.",
    "I can always give you 10 pigs in a week, along with 10 scrolls to go with them. The more you improve that machine, however, the more bacon I can give you. You'll have to stack it yourself, but that's half the fun of cooking it!",
    "Don't worry. For legitimate reasons I won't go into I have access to your bank account. I'll just put it all right in there so you don't even need to empty your pack. There are quite a few things you can do with bacon if you want to talk about that.",
    "When it comes to cooking it you can stack more and more raw bacon up into a towering pile. Two bits of bacon makes a stack, two stacks make a pile, two piles make a heap and two heaps make a mound. For some reason stacking the pieces when cooked does not work, so you need to stack the raw bacon before you do anything with it. It makes it harder to cook, but it tastes great and really helps to fill the hole. If you're feeling a bit fancy you can also stick the bacon in a pie. It's not as good as crunching a plate of crispy pig strips, but it is pretty filling. You just need an empty pie shell and three bits of bacon. That fills it up and tastes great too. If you have a real craving though you can try brewing it.",
    "That's what I thought at first. You just bung it in there instead of the hops and it ferments up 'nicely'. Last time I tried a pint of mature pigswill it nearly blew my tongue clear out of my head!",
    "Well it's the strangest thing. I started putting pigs through the machine after I made some experimental tweaks...and they turned into these little pouches!",
    "I don't have that sort of fancy book-learning, so I'm going to say 'yes' and hope I'm right.",
    "Maybe it has to do with all the spiritual energy around my little cellar. I mean, there have been quite a few 'accidents' around here. And the machine tends to make strange noises now and then.",
    "There it goes again. I really can't figure it out.",
    "Oh, it does pretty much what we wanted it to do; produce trained pigs. Now you put some pig teeth, fancy glowing shards and stuff in one end and out pop some pouches from the other. Depending on what you've set the machine up for, you'll get pigs that can fight, carry things or renew spiritual energy for you. Be careful though. The machine sounds a bit creaky when it runs, regardless of what type of pouch you're making.",
    "There it goes again!",
    "What would you like to know?",
    "Well I do think it could use a little oil on those rusty hinges. They sound quite loud now and then.",
    "See what I mean? Anyhow, you can improve the machine with some more bars and planks. The more refined the improvements, the better the items you'll need. I'd say some steel bars and oak planks will take care of the first upgrade, and some mithril bars and teak planks will finish it off. Anything else you want to know about it?",
    "There are three types of pig familiar that you can use. The war pig, the prayer pig and the pack pig. The war pig will fight for you in battle, which is pretty self-explanatory. The prayer pig carries a little altar on its back. You can renew your spiritual energy from it, but there's a limit to how much one pig can carry. Once all the energy is gone you'll need to summon a new pig if you want to continue. The pack pig carries things for you. Like the war pig, it's pretty easy to work out too. The more you improve the machine the more powerful the pigs will become! That includes increasing the number of items a pig will carry and how much energy it will store!",
    "Pigs will drop teeth when you kill them. You can help yourself to the pigs I have here now that the population is stable. You should also find pig pits popping up around the world too. So you can probably try killing them as well.",
    "That's easy. Pig's teeth you find will all be tied to the machine's current setting.",
    "It means if the machine is set to train prayer pigs - for example - then you'll always get prayer pig teeth to make prayer pig pouches with.",
    "Sure you can! It'll also change what your showpig appears as, which is handy.",
    "No! No, no no no...no!",
    "No! Look, just because I am a pig farmer, living out here on the edge of someone else's farm in a creepy cellar that stinks of blood and offal does not make me a bad guy! I mean the local guard are always beating down my door whenever someone goes missing. I ask you, is it fair? Is it justice?",
    "Moving swiftly along...",
    "Right, see you later."
  ],
  "Bacon addict": [
    "Baaaaaaacon! Must eat baaaaacon!",
    "Can't...stop...eating",
    "More, give me moooore!",
    "Om nom nom...",
    "Can't sleep, dream pigs will eat me...",
    "Getting sleepy...bacon will wake me up.",
    "Zzzz....bacon..."
  ],
  "Martin the Master Gardener": [
    "Why would you want one of them? Are you thinking of starting a pig farm? If you are, then be warned - the bottom has really fallen out of the pig wrestling game. You'd be better off investing in a cow.",
    "Oh, that is good news! I suppose I could give you a piglet if that's the case.",
    "Hold on there! I need you to do something for me first. I don't know who it is, but someone has been picking my pockets.",
    "I think it was one of those dodgy types over to the west. I want you to find out who did it and give them a thrashing.",
    "No! That's a little too much! Just give them a good kicking and I'll give you the piglet.",
    "Remember, one of them will be lying about where he was when it happened. Just find out who doesn't have an alibi. If they can't tell you truthfully where they were when I was robbed, they must be the culprit!",
    "I want you to go and find out which one of those pickpockets over there to the west has been stealing from me. Remember, one of them will be lying about where he was when it happened. Just find out who doesn't have an alibi. If they can't tell you truthfully where they were when I was robbed, they must be the culprit! And when you find them, give them a thrashing they won't forget in a hurry!",
    "It's good to finally meet you. Did you enjoy robbing me, you swine?",
    "You'll be laughing on the other side of your face in a moment! Let him have it!",
    "Is that it?",
    "Well no, but I expected more than one little punch. You know, there are lots of ways you can hit someone without killing them.",
    "By the gods! He's had enough!",
    "Okay, okay, I think he's learned his lesson. Leave him be!",
    "I'm pretty sure you just scared off every pickpocket in the district. Well done! You've more than earned this little piglet.",
    "You should probably wait for Eli to give you pig before you do that.",
    "Yes, he ran up to me just now. Take better care of him this time.[2]"
  ],
  "Pickpocket [Andy/Bert/Chris/Dan/Edd]": [
    "Yeah, whatever...",
    "I did indeed, and I'll do it again once this farce is over!",
    "Yeah. I mean, I barely felt that.",
    "So is that really it? Can I go now?",
    "What are you doing?",
    "MY ORGANS!",
    "I can literally taste my own agony!",
    "Spleeeeeeeeeeeen!",
    "Blubble.",
    "Learned...lesson...going...hospital...now..."
  ],
  "Pig": [
    "Oink?",
    "Oink? (Whut?)"
  ],
  "Man": [
    "Hey there, stranger. Why do you have a pig following you around?",
    "And it can keep my items safe from pickpockets? I heard that some fled here from Draynor recently.",
    "Well, stranger, your pig certainly has shown us a new way to store and carry our belongings.",
    "Will it work with Zamorak? As a secret cultist I have problems finding an altar when I need one.",
    "What a useful ability! I had no idea pigs could be used for spiritual tasks like this.",
    "It's[sic] porcine power is too great! What hubris has unleashed such a monster?",
    "What a relief! I thought we were all done for.",
    "But just out of interest, where can we get trained pigs like this?",
    "It just wasn't the same...",
    "That's a great idea! Three cheers for this passing stranger and their performing pig!",
    "That's a great idea! Three cheers for this passing stranger and their performing pig!"
  ],
  "Woman": [
    "Is it pig-wrestling day already? I need to get my wrestling hat!",
    "That sounds useful, but can it also carry smaller items like seeds and arrowheads?",
    "If we all flee now we might live!",
    "Yes, we've had to cancel the last three pig-wrestling days because we couldn't find one. We had to use a goblin in the end."
  ],
  "You show off your pig to the next group of people. You still need to display your pig in": [
    "[lists cities the player still needs to visit]"
  ],
  "Congratulations! You have completed": [
    "'Bringing Home the Bacon'."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Bringing_Home_the_Bacon?oldid=35332726’"
  ]
}