{
  "Wizard Mizgog": [
    "My beads! Where are my beads?",
    "Wizard Grayzag next door decided that he didn't like me for some reason, so he enlisted an army of imps. The imps stole all sorts of things. Most of there were things I don't really care about like eggs, balls of wool, things like that... But they stole my magic beads! There was a red one, a yellow one, a black one, and a white one. The imps have spread out all over the kingdom by now. Could you get my beads back for me?",
    "The imps will be all over the kingdom by now. You should kill any imps you find and collect any beads that they drop. I need a red one, a yellow one, a black one, and a white one.",
    "How are you doing finding my beads?",
    "Come back when you have them all. I've lost a white bead, a red bead, a black bead, and a yellow bead. Go kill some imps!",
    "How are you doing finding my beads?",
    "Thank you! Give them here and I'll check that they really are my beads, before I give you your reward. You'll like it, it's an amulet of accuracy."
  ],
  "Wizard Grayzag": [
    "You're an imbecile! Do you really think you'll find four beads among the thousands of imps I control? Good luck. Ha!",
    "So you got the old fool his beads. Think you're clever do you?",
    "You'd better watch your back: when you least expect it, I'll be there. You shouldn't go sticking your nose into other people's affairs, meddler."
  ],
  "Melancholic Imp": [
    "I've made a terrible mistake. I wish I'd never come here. Oh, woe is me.",
    "I wanted to do a good job for Wizard Grayzag, but I've only made a mess of things. He's gonna be so disappointed with me.",
    "He summoned me. By the terms of our contract, I gotta perform his task to be dismissed. Now I may never get home to me family. Oh, how I miss 'em.",
    "I can't help it. I just feel so guilty! Oh, you wouldn't understand.",
    "He gave me a bead to look after, and I've only gone and eaten it! What kind of an idiot would do that?",
    "I suppose he thought I'd take good care of it. Oh, what's the use? It's all pointless.",
    "You're right. It can only get better from here. Unless I screw up again tomorrow.",
    "You're right. I deserve to be trapped here forever. I'm such a failure.",
    "I don't mean to cause no fuss. I know you have better things to do with your time. I can't seem to get over feeling miserable. I feel so helpless.",
    "I seserve to be hurt. I messed up Wizard Grayzag's spell, and I dunno how to fix things. I'm unimportant and worthless.",
    "Thank you. I appreciate your help. This feeling won't last forever. I just have to do the best I can, one day at a time.",
    "Oops! 'Scuse me.",
    "I think something I ate disagrees with me. Uhoh, incoming!"
  ],
  "Player": [
    "What's making you so miserable?",
    "So what made you so pensive?",
    "Why to turn him against the other wizards?",
    "Hello, you excitable little imp. What was that you said about a bead?",
    "Why are you talking so fast? I can barely understand you.",
    "I think I know how to fix this. How about I help you work off that excess energy?",
    "No, no. I want to exercise you. Not exorcise you.",
    "I challenge you to race around the air altar. That should tire you out.",
    "Oh, really? I hadn't noticed.",
    "So, how did you wind up with the sanguine bead?",
    "So why did you eat it?",
    "The bead.",
    "Fine. Maybe one of the other imps will be more forthcoming.",
    "Nothing. I just came to ask about--[sic]",
    "What pointy sword? You're not carrying a--",
    "I'm going to need a long hot bath after I finish this quest.",
    "So, what's the story behind the choleric bead?",
    "That seems a little hypocritical, coming from an imp.",
    "You don't drink it. You heat a bowl of water and inhale the steam. That'll clean up your phlegm.",
    "Now, where can I find a bowl of hot water?",
    "Alright, hold your head over this bowl and inhale the steam. That should clear out your nasal passages.",
    "So what are you doing in this swamp?"
  ],
  "Happy Imp": [
    "Wow! I'm glad I got that out. I feel so much better.",
    "I'm not touching that bead again. It's covered in sick, and it made me feel so trapped in me own thoughts. I don't wanna feel that broody again.",
    "Ta for lifting me spirits. You were there when I needed help the most.",
    "Wizard Grayzag ordered me to steal some beads from a kindly old wizard. I felt awful about it, but I had to obey his orders. That's the power the summoning ritual has over us imps.",
    "Azacorax taught him how to summon us, and demons don't share powers unless it's in our own interest.",
    "I think the demon of the Wizard's Tower is influencing Wizard Grayzag, tempting his guardian with power.",
    "I dunno. But these beads seem to be key to Azacorax's plan. They're safer in your hands."
  ],
  "Sanguine Imp": [
    "Gotta-guard-the-bead-gotta-guard-the-bead-gotta-guard-the-beat-gotta-guard-the...",
    "Oh! 'Ello! Don't-mind-me-I-ain't-done-nuffin'-dodgy.",
    "Er! Dat-weren't-me! I-ain't-got-no-bead-not-me-no-sir!",
    "Go-on. You-can-search-me-if-you-like. You-won't-find-a-thing-I-tell-ya!",
    "I-dunno-guv! I'm-just-fulla-ruddy-energy-I-am! Me-heart's-pounding-like-a-drum!",
    "What, you-mean... EXERCISE?",
    "I've-heard-'bout-EXERCISM. It-don't-go-well-for-us-demons.",
    "I-accept! Last-one-there-is-an-extra-large-egg!",
    "You've done... worn me out. *pant* Great...race...*gap*mate.",
    "Phwoar. I feel a bit... woozy... Hang on a sec."
  ],
  "Relaxed Imp": [
    "Ah, that's better.",
    "Ooh, mate. You're standing in puke.",
    "Looks like the bead's floating in me breakfast. You can have it, mate. I want nuffin' more to do with it.",
    "Well, Wizard Grayzigzag summoned me to your plane and sent us on an errand.",
    "The binding ritual he got from the Wizards' Tower demon compels us to obey, y'see. I didn't have no choice.",
    "Graybeard had us steal some coloured beads from another wizard.",
    "Seems kinda petty, if you ask me. But nobody asked me.",
    "Anyways, I brought the bead to the air altar, like old Graybore said, and it started thrumming with energy.",
    "The bead, that is, not the altar.",
    "The altar?",
    "It's a bit embarrassing, to tell you the truth, guv. I'd rather not say."
  ],
  "Choleric Imp": [
    "What are you looking at, sunshine?",
    "Oh, I'm 'nothing', am I? Jst a pint-size demon with a pointy sword. No threat to anyone, eh?",
    "I yield! Please, sir, no more!",
    "I'm so sorry. I dunno what came over me. I ain't usually a voilent sort.",
    "It must've been something I ate. I... Uhoh, here it comes."
  ],
  "Calm Imp": [
    "That scuffle got it outta me system. Sorry about the mess.",
    "The summoner had me steal it. Wizard Grayzag, I mean. The one what traffics with demons.",
    "There's demons, and then there's DEMONS, guv. Azacorax has a scheme, and these beads are the key.",
    "At first, the bead seemed harmless. I brought it to the fire altar, like the wizard said.",
    "The yellow bead glowed warm in me hands, like it was powering up. Me nostrils filled with a sweet sharp smell, like pineapple.",
    "I was supposed to bring it back when I was done, but... I swallowed the bead. I couldn't help it. It tempted me with its sugary aroma.",
    "I instantly regretted it. The bead irritated me throat and burned in me belly.",
    "The yellow bead made me quick-tempered and cantankerous, but I feel much better now. Thanks for saving me."
  ],
  "Calm imp": [
    "I'd rather not go near that yellow bead again. It made me all bad-tempered. You can have it."
  ],
  "Phlegmatic imp": [
    "*sniff* Oh, you'd better not come close, mate. I've picked up a nasty *cough* cold.",
    "Hang about. I'm gonna sneeze!",
    "*sniff* I swallowed the white pill Wizard Grayzag gave over, but I don't feel no *sniff* better. If anything, I feel worse.",
    "Ugh. Me nose is so *sniff* bunged up, I can barely *cough* breathe.",
    "Ugh, thanks but no thanks, mate. I'm a vegetarian",
    "I think I'm allergic to honey. It makes me break out in hives.",
    "Eh? I'd rather have a nice cup of tea.",
    "Wow! Cheers, mate. That's cleared my lurgy right up!",
    "Oh, hang about. I've got a reward for you."
  ],
  "Healthy imp": [
    "Better out than in.",
    "Oh, look. The white pill's in there too. It made me feel all queasy.",
    "Summoner's orders, boss. The wizard with the pointy beard and persecution complex told me to bring his white pill to this big glowy rock in the swamp.",
    "The pill started smelling like peppermint, and I was a bit peckish, so I stuck it in me gob. I guess it didn't agree with me, 'cause I came over all poorly.",
    "Feeling a lot better now, though. Ta, guv! That steam worked a treat."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Imp_Catcher?oldid=36231109’"
  ]
}