{
  "Player": [
    "Why are all of you standing around here?",
    "Why are you guys hanging around here?",
    "Um... yeah, sorry about that. Why are you all standing around out here?",
    "Why are all of you standing around here?",
    "...You're an idiot.",
    "I'm not sure.",
    "Why are you camped out here?",
    "Do you know any good adventurers I can go on?",
    "Please tell me?",
    "Please?",
    "PLEEEEEEEEEEEEEEEEEEEEEEASE???",
    "I don't think you've found a good adventure at all!",
    "Oh really? Why are you camped out here?",
    "Who's Zanaris?",
    "If it's hidden, how are you planning to find it?",
    "Well, it looks to me like YOU don't know EITHER seeing as you're all just sat around here.",
    "Oh well. Never mind.",
    "So a leprechaun knows where Zanaris is, eh?",
    "Thanks for the help!",
    "There's no such thing!",
    "What's Zanaris?",
    "Oh well. Never mind.",
    "What makes you think it's out here?",
    "Have you found the tree with the leprechaun yet?",
    "Thanks for the information!",
    "So I hear theres[sic] a leprechaun around here who can show me the way to Zanaris?",
    "Found that leprechaun yet?",
    "...Right.",
    "So let me get this straight: I need to search the trees around here for a leprechaun. Then, when I find him, he will tell me where this 'Zanaris' is?",
    "I want to find Zanaris.",
    "Shed? I thought Zanaris was a city.",
    "How does it fit in a shed, then?",
    "So, I just walk into the shed and end up in Zanaris?",
    "I've been in that shed and I didn't see a city.",
    "Where could I get such a staff?",
    "Yes, please, a teleport would be useful.",
    "No thanks, I'll get there on my own.",
    "I'm not sure.",
    "How do I get to Zanaris again?",
    "So you didn't find the entrance to Zanaris yet, huh?",
    "Yep. Found it REALLY easily too.",
    "Believe what you want. Enjoy your little camp fire.",
    "...Right.",
    "Have you found anything yet?",
    "I haven't found it yet either.",
    "Can you tell me about the Lost City?",
    "I don't think I'm strong enough to enter then.",
    "Well, that is a risk I will have to take.",
    "Hey, thanks for all the information. It REALLY helped me out in finding the lost city of Zanaris and all.",
    "You know...I think I'll keep that to myself.",
    "So you didn't find the entrance to Zanaris yet, huh?",
    "Yep. Found it REALLY easily too.",
    "Believe what you want. Enjoy your little camp fire.",
    "...Right."
  ],
  "Monk": [
    "None of your business. Get lost.",
    "No, we've looked for ages but haven't... Hey! Wait a minute! How did you know about that?",
    "...You tricked me. I'm not talking to you anymore.",
    "I already told you. I'm not talking to you anymore.",
    "I already told you. I'm not talking to you anymore."
  ],
  "Archer": [
    "(ahem)... 'Guys'?",
    "Well, that's really none of your business.",
    "... W-what? How did you...? No. You're wrong. Now go away.",
    "Don't tell me a novice like YOU has found it!",
    "...I cannot believe that someone like YOU could find the portal when experienced adventurers such as ourselves could not.",
    "Don't tell me a novice like YOU has found it!",
    "...I cannot believe that someone like YOU could find the portal when experienced adventurers such as ourselves could not."
  ],
  "Wizard": [
    "Hahaha, you dare talk to a mighty wizard such as myself? I bet you can't even cast Air Strike yet, amateur!",
    "Hahaha! Go away, amateur! You're not worthy of joining our great group!",
    "Hahaha, you're such an amateur! Go away and play with some cabbage, amateur!",
    "Hahaha, you're such an amateur!",
    "Go away and play with some cabbage, amateur!"
  ],
  "Shamus": [
    "Hey! Yer big elephant! Don't go choppin' down me house, now!",
    "Ah, yer big elephant! Yer've caught me! What would an elephant like yer be wanting wid ol' Shamus, then?",
    "Well, you'll have to be catchin' me again when yer are, elephant!",
    "Hey! Yer big elephant! Don't go choppin' down me house, now!",
    "Ah, yer big elephant! Yer've caught me! What would an elephant like yer be wanting wid ol' Shamus, then?",
    "Zanaris, is it now? Well, well, well... You'll be needing that funny little shed out there in the swamp, so you will.",
    "Aye, that it is!",
    "Ah, yer stupid elephant! The city isn't IN the shed! The doorway to the shed is a portal to Zanaris, so it is.",
    "Oh, was I forgetting to say? Ya need to be carrying a dramen staff to be getting there! Otherwise, yer'll just be ending up in the shed.",
    "Dramen staves are crafted from branches of the dramen tree, so they are. I hear there's a dramen tree in a cave over on the island of Entrana. There would probably be a good place for an elephant like yer to look, I reckon. The monks are running a ship from Port Sarim to Entrana, so I hear. Did yer need a teleport over to Port Sarim?",
    "Right yer are. Hold on!",
    "Avach Sarimporto!",
    "Fine, have it yer way. I'm off!",
    "Ah, yer big elephant! Yer've caught me! What would an elephant like yer be wanting wid ol' Shamus, then?",
    "Ha! Look at yer! Look at the stupid elephant who tries to go catching a leprechaun when he don't even be knowing what he wants!",
    "Yer stupid elephant! I'll tell yer again! Yer need to be entering the shed in the middle of the swamp while holding a dramen staff. Yer can make the dramen staff from a dramen tree branch, and there's a dramen tree on Entrana. now leave me alone, yer great elephant."
  ],
  "Warrior": [
    "Hello there, traveler.",
    "Well, we're on an adventure right now. Mind you, this is OUR adventure and we don't want to share it - find your own!",
    "No.",
    "No!",
    "NO!",
    "Hah! Adventurers of our caliber don't just hang around in forests for fun, whelp!",
    "We're looking for Zanaris...GAH! I mean we're not here for any particular reason at all.",
    "Ahahahaha! Zanaris isn't a person! It's a magical hidden city filled with treasures and rich... uh, nothing, it's nothing.",
    "Well, we don't want to tell anyone else about that, because we don't want anyone else sharing in all the glory and treasure.",
    "Of course we know! We just haven't figured out which tree the stupid leprechaun's hiding in yet!",
    "GAH! I didn't mean to tell you that! Look, just forget I said anything okay?",
    "Ye... uh, no. No, not at all. And even if he did - which he doesn't - he DEFINETLY ISN'T hiding in some tree around here. Nope, definitely not. Honestly.",
    "Help, What help? I didn't help! Please don't say I did, I'll get in trouble!",
    "When we've found Zanaris, you'll... GAH! I mean, we're not here for any particular reason at all.",
    "I don't think we want other people competing with us to find it. Forget I said anything.",
    "Don't you know of the legends that tell of the magical city, hidden in the swam... Uh, no, you're right, we're wasting our time here.",
    "What? How did you know that? Uh... I mean, no, no you're very wrong. Very wrong, and not right at all, and I definitely didn't tell you about that at all.",
    "We're still searching for Zanaris... GAH! I mean we're not doing anything here at all.",
    "Oh, please don't say that anymore! If the rest of my party knew I'd helped you, they'd probably throw me out and make me walk home by myself!",
    "So anyway, what have you found out? Where is the fabled Zanaris? Is it all the legends say it is?"
  ],
  "Tool leprechaun": [
    "Ah, 'tis a foine day, to be sure! Can I help ye with tool storage, or a trip to Winkin's Farm, or what?",
    "Nay, ye be wantin' to ask Shamus if ye wants to know about the Lost City. He be living up a tree somewhere near Draynor Village. Last I heard, he were wailin' about near some biggun tryin' to chop his tree down!"
  ],
  "Cave monk": [
    "Be careful going in there! You are unarmed, and there is much evilness lurking down there! The evilness seems to block off our contact with our gods. so[sic] our prayers seem to have less effect down there. Oh, also, you won't be able to come back this way - This[sic] ladder only goes one way! The only exit from the caves below is a portal which is guarded by greater demons!"
  ],
  "Dramen tree spirit": [
    "You must defeat me before touching the tree!"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Lost_City?oldid=36224720’"
  ]
}