{
  "Legends' guard": [
    "Yes, sir, how can I help you?",
    "This is the Legends' Guild, sir! Legendary citizens are invited on a quest in order to become members of the guild.",
    "Well, it looks as if you are eligible for the quest. Grand Vizier Erkle will give you the details about the quest. You can go and talk to him about it if you like?",
    "He is the head of the Legends' Guild. His full name is Radimus Erkle. Would you like to talk to him about the quest?",
    "Okay, very well. You need to go into the building on the left, he's in his study.",
    "Good luck!",
    "I'm very sorry, but you need to complete more requirements before you can go on this quest. They don't call it the Legends' Guild for nothing, you know!",
    "Well, to be honest, sir, I'm not really sure. You'll need to talk to Grand Vizier Erkle to find that out.",
    "You're welcome.",
    "Well, sir, you'll need to be a legendary citizen of Gielinor. If you want to use the Legends' Guild you'll be invited to complete a quest. Once you have completed that quest you'll be a fully fledged member of the guild.",
    "Well, sir, Radimus Erkle is the Grand Vizier of the Legends' Guild. He's a very busy man. And he'll only talk to those people eligible for the quest.",
    "Very well, sir!",
    "Hope the quest is going well, [sir/madam]!"
  ],
  "Player": [
    "What is this place?",
    "Can I go on the quest?",
    "Who is Grand Vizier Erkle?",
    "Yes, I'd like to talk to Grand Vizier Erkle.",
    "Some other time, perhaps?",
    "What kind of quest is it?",
    "Thanks for your help.",
    "How do I get in here?",
    "Can I speak to someone in charge?",
    "It's okay, thanks.",
    "Yes actually, what's involved?",
    "Not just at the moment.",
    "Yes, it sounds great!",
    "Maybe some other time.",
    "Who are you?",
    "It's ok, but I have forgotten what to do.",
    "I need another machete.",
    "I've run out of charcoal.",
    "I've run out of papyrus.",
    "I've completed the quest.",
    "How do I get into the Kharazi Jungle?",
    "Well, in fact I plan to map that area myself.",
    "Do you have any other tips about the Kharazi Jungle?",
    "Are you calling me foolish?",
    "What do you do here?",
    "Have you seen any natives in the jungle?",
    "Can I have the item please?",
    "Will you trade something for it?",
    "Ok thanks.",
    "Yes, go ahead make a copy!",
    "What will you give me in return?",
    "Sorry, I must complete my quest.",
    "I was hoping to attract the attention of a native.",
    "I want to develop friendly relations with your people.",
    "Can you get your people together?",
    "What can we do instead then?",
    "How do we make a totem pole?",
    "I will release Ungadulu...",
    "Oh well, sorry to hear about that.",
    "Ok thanks for your help.",
    "What's in it for me if I release Ungadulu?",
    "Sorry, it was a mistake?",
    "I'm lost, can you show me the way out?",
    "Yes Please...[sic]",
    "No thanks...",
    "I can't find the caves...",
    "Ok thanks for your help.",
    "Owwwww!",
    "Whew!",
    "Mmmm, pretty!",
    "How can I extinguish the flames?",
    "Who are you?",
    "Where do I get pure water from?",
    "Ungadulu looks a little strange.",
    "What kind of unknown force?",
    "How did they summon the spirits?",
    "I'm not sure what to do.",
    "Ok, thanks... Goodbye.",
    "Sorry for bothering you.",
    "I need some pure water to douse some magic flames.",
    "Metal of the sun, what is that?",
    "Where can I find this metal?",
    "What kind of a vessel?",
    "How do I bless the vessel?",
    "Ungadulu called me 'Vacu', what does that mean?",
    "Ok thanks for your help.",
    "Hmmm, interesting...",
    "This will be a challenge.",
    "Easy does it...",
    "Easy as pie...",
    "Hup!",
    "Urghhhhh!",
    "Arghhhhhhh!",
    "Shhhhhhhshshehshsh",
    "Yes, I'd like to bless my golden bowl.",
    "Oooooommmmmmmmmm",
    "Oooooohhhhmmmmmmmmmm",
    "I need to collect some Yommi tree seeds for Gujuo.",
    "How do I grow the Yommi tree?",
    "What do you know about the pure water?",
    "How do I get out of here?",
    "What will you do now?",
    "Ok, thanks...",
    "Ungadulu is free! He was possesed by a demon and I killed it.",
    "I have the Yommi tree seeds.",
    "What do I do now?",
    "Hello there.",
    "I have germinated the Yommi tree seeds.",
    "Where is the fertile soil?",
    "The water pool has dried up and I need more water.",
    "The Yommi tree died.",
    "Does the Yommi tree have to have pure water?",
    "Where is the source of the spring of pure water?",
    "Ok, I won't go...",
    "Hello there.",
    "Where can I get more water for the Yommi tree?",
    "I searched the catacombs thoroughly but found nothing else.",
    "If I went, could you help me?",
    "Where can I find Snake weed?",
    "Where can I find ardrigal?",
    "Will I need this potion? I feel brave enough as I am.",
    "Er... me?",
    "Yes, I need it for my quest.",
    "Not really, I just wondered if I could push that big rock.",
    "Who's asking?",
    "What can I do about that?",
    "I'll do what I must to get the water.",
    "Ok, I'll do it.",
    "I've changed my mind, I can't do it.",
    "No, I won't take someone's life for you.",
    "Do I know you?",
    "Why are you tortured?",
    "Can't I just get some water?",
    "Who am I supposed to kill again?",
    "Er I've had second thoughts.",
    "I have to be going...",
    "Yes, take the dagger back.",
    "No, I'll complete the task.",
    "Hello there.",
    "I have found a way into the caves!",
    "Who is Viyeldi?",
    "I met a spirit in the Viyeldi Caves.",
    "The spirit told me to kill Viyeldi.",
    "Do you know anything about daggers?",
    "I don't have the dagger.",
    "I haven't slayed Viyeldi yet.",
    "I have something else in mind!",
    "I found the source of the spring and I got the water.",
    "I killed the demon again.",
    "How do I make the totem pole?",
    "I made the Totem pole, now what do I do with it?",
    "Yeah, yeah, yeah!",
    "Heard it all before!",
    "Hello there.",
    "Do you have any news?",
    "Where are all your people?",
    "I've lost the tribal gift you gave me.",
    "No, I've got something else to do at the moment."
  ],
  "Radimus Erkle": [
    "Good day to you [Sir/Madam]! No doubt you are keen to become a member of the Legends Guild?",
    "Well, you need to complete a quest for us. You need to map an area called the Kharazi Jungle. It is the unexplored southern part of Karamja Island. You also need to befriend a native from the Kharazi tribe in order to get a gift or token of friendship. We want to display it in the Legends Guild Main hall. Are you interested in this quest?",
    "Very well, if you change your mind, please come back and see me.",
    "Excellent! Ok, you'll need this starting map of the Kharazi Jungle.",
    "Complete this map when you get to the Kharazi Jungle. It's towards the southern most part of Karamja. You'll need additional papyrus and charcoal to complete the map. There are three different sectors of the Kharazi Jungle to map.",
    "It is likely to be very tough going. You'll need a hatchet and machete to cut through the dense Kharazi Jungle. Collect a machete from the cupboard before you leave. You'll need to find your own hatchet, preferably a good one. Finally, we really do need some sort of display item for the Guild hall. Bring back some sort of token which we can display in the Guild. And very good luck to you!",
    "Ok, as you wish...",
    "My name is Radimus Erkle, I am the Grand Vizier of the Legends Guild. Are you interested in becoming a member?",
    "Hello there, how is the quest going?",
    "Tut! How forgetful! You need to find a way into the Kharazi Jungle. Then you need to explore and map that entire area. While you're there you need to make contact with any jungle natives. Bring back a tribal gift from the natives so that we can display it in the Legends Guild. I hope that answers your question!",
    "Well, just get another one from the cupboard.",
    "Well, get some more! Be proactive and get some more from somewhere.",
    "It's hardly legendary if you fail a quest because you can't find some charcoal!",
    "Well, get some more! Be proactive and try to find some!",
    "It's hardly legendary if you fail a quest because you can't find some papyrus!",
    "Well, if you have, show me the gift the Kharazi people gave you! Becoming a legend is more than just fighting you know. It also requires some careful diplomacy and problem solving. Also complete the map of Kharazi Jungle and we will admit you to the Guild.",
    "It doesn't look like you need any more machetes.",
    "Sorry old bean, but I don't really need that!",
    "Well done, [sir/madam], very well done. However, you'll probably need it while you search for natives of the Kharazi tribe in the Kharazi Jungle. Remember, we would like a special token of friendship from them to place in the Legends' Guild. I'll take the map off your hands once we get the proof that you have met the natives.",
    "It's very nice, bwana, but we also need something special to display in the Legends' Guild.",
    "It's very nice, bwana, but I need you to complete the map as well.",
    "Well, it looks as if you have some interesting items there. Let's have a look at them!--Sir Radimus sees the gilded totem pole.--",
    "Sir, this is truly amazing... That totem pole will take pride of place in the Legends Guild as a reminder of your quest to gain entry. And so that many other great adventurers can admire your bravery.",
    "Well, you've completed the tasks I set you. That map of the Kharazi Jungle will be very helpful for future expeditions.-- Sir Radimus takes the map and the totem pole --",
    "Congratulations, welcome to the Legends Guild. Please, go through to the main Legends Guild building and I will join you shortly.",
    "Welcome to the Legends Guild Main Hall. We've placed your Totem Pole as pride of place. All members of the Legends Guild will see it as they walk in. They will know that it was you who brought it back. Congratulations, you're now a fully fledged member. I would like to offer you some training which will increase your experience and abilities in four areas. Would you like to train now?",
    "You can choose [1/2/3/4] area[s] to increase your abilities in.",
    "Right, that's all the training I can offer you. I hope you're happy with your new skills. Do feel free to explore the rest of the building.",
    "Very well young man, return when you are able, but don't leave it too long. You'll benefit considerably from this training. Now, please excuse me for a while. I have other matters to attend to. Do feel free to explore the rest of the building."
  ],
  "Jungle forester": [
    "Hello friend. You're a long way from civilisation!",
    "Well, I've not managed it yet but I heard that someone managed to find a way in. But they only just managed to escape the jungle with their lives. Apparently he was on a mission to map the area. How foolish is that?",
    "--The forester looks very interested--Oh, well, that sounds quite good actually... Sorry if I sounded rude before, it just didn't seem like a good idea to me. I guess I just wouldn't want to do it myself. But a map of that area would certainly be a big task. And it would certainly be very useful...-- The forester looks very thoughtful --Hey, if you manage to complete it, be sure to let me take a look! Well, best of luck with it, I'm sure you're going to need it.",
    "Not really, but I would say be careful, it's a dangerous place. And good luck.",
    "No, of course not... Sorry, I have to be on my way...",
    "I'm a forester, and I specialise in exotic woods. I've not managed to penetrate the Kharazi Jungle very far but I have found some interesting tree specimens. If you do happen to get into the Kharazi Jungle, do come and let me know. I'd love to be able to safely navigate my own way in and out.",
    "Well, I've heard some funny sounds and I think I've seen a native... but I'm not sure. They generally don't like to be seen I guess. But I found an item that you might be interested in. You swing it above your head and it makes a strange sound, it seems to attract their attention.",
    "Well, I wish I could give it to you. However, I have grown fond of it. And it may help me in case I get lost in the",
    "Well, if you have something interesting, let me have a look at it and I'll offer you something in return. OK, I have to go now, but it's been nice talking with you.",
    "You're welcome! See you around...",
    "Sorry, but I have no use for that.",
    "Sorry, but I have no use for that.",
    "*Gasp* -- The jungle forester looks speechless. --This is very impressive! I'm amazed, it's just great! Do you mind if I make a copy of it, and I'll give you an item in return.",
    "Many thanks friend.",
    "Many thanks friend.",
    "Here, I won't be needing this any longer, and it may help you. Whenever I've used it before, it attracted the attention of jungle natives.",
    "Well, I can offer you this?",
    "If you swing this above your head, it makes a strange sound. I noticed that it attracts the attention of the natives. Is it a deal? Can I make a copy of your map?",
    "Very well friend, I understand, I must be on my way as well.-- The Jungle Forester seems a bit annoyed... and wanders off. --",
    "It's a great map, thanks for letting me take a copy! It has helped me out a number of times now.",
    "You might like to use that when you get into the Kharazi jungle, it might attract more natives..."
  ],
  "Gujuo": [
    "Greetings Bwana... Why do you make such strange sounds and disturb the peace of the jungle?",
    "Well, it had the desired effect... I am Gujuo, proud member of the Kharazi tribe. What did you want to talk about Bwana?",
    "Very good Bwana... this is indeed a very pleasant gesture. However, my people are very distributed throughout the Kharazi Jungle.",
    "All of my people normally congregate around a totem pole. But ours has been polluted by an evil spirit. It has been transformed, and now our people are afraid to approach it. We tried to drive the evil spirit out of the totem pole, but it does not seem to work.",
    "We could try to make a new totem pole. However, we need to make it from the trunk of the sacred Yommi tree.",
    "First we need to plant a sacred Yommi tree. It is a magical tree of great power, however, our Shaman 'Ungadulu' is the only person with the seeds for this tree.",
    "And I fear that it is impossible to get some seeds. He is being held against his will in some caves in the north western part of the Kharazi Jungle.",
    "You make me very happy Bwana! In the north western part of the Kharazi Jungle area, near some great cliffs, you will find three rocks that form a roughly triangular shape. They are flanked by the palm which also forms the divine geometry. The stones are the entrance, search them well. That's where you'll find Ungadulu. If you can free him he will entrust you with some sacred Yommi tree seeds. I have work to do Bwana. I may see you again.",
    "Yes Bwana, perhaps we will become friends sometime in the future... But not today... Ungadulu has problably lost his mind anyway...  It is most likely a lost cause...",
    "You are more than welcome bwana...",
    "The mosquitos bite me, bwana! I must go for a swim.",
    "We would be very grateful and would be pleased to develop friendly relations with you. Do this thing for us all, my people would be very happy.",
    "Very good Bwana... however, it begs the question... What are you doing in the Kharazi Jungle?",
    "Yes Bwana. I can take you to the edge of the Kharazi Jungle. Would you like me to take you?",
    "Follow me...",
    "As you wish... Again, Bwana, What is it that brings you to the Kharazi Jungle?",
    "How goes your quest to release Ungadulu Bwana?",
    "Well, they were still there the last time I checked... Go as far to the west in the Kharazi Jungle as you can, until you reach the sea, then walk eastwards with the barrier rocks to the north. Walk past the covered pass and you'll find some rocks on slightly elevated ground. You'll find the caves there.",
    "You are more than welcome bwana... I have to collect herbs now, Bwana.",
    "How goes your quest to release Ungadulu Bwana?",
    "Be wary Bwana. There are many unknown spirits that reside in these dark areas. You may be tricked by an unknown force...",
    "Strange spirits that our forefathers summoned for visions. They haunt the underworld and caves that exist in this area. Take not anything as it might first appear.",
    "I am unlearned in such matters. But I am told of sacred patterns that are scored on the ground to bind the spirit and confine it... But that is all I know.",
    "I am at a loss as well Bwana. At this time Ungadulu is the only one who might know of a solution for this puzzle and at this time, he is part of that same puzzle.",
    "Farewell Bwana, good luck.",
    "That's fine Bwana, not to worry. I hope your quest is going well in any case.",
    "This sounds very strange Bwana... but maybe I can help. There is a pool of water that is sacred to us. It is located in the middle of the Kharazi Jungle. The water contains special properties but it can only be contained in a blessed vessel made from metal of the sun. The water is difficult to get to, but I am sure you will manage to claim some.",
    "It is a bright and precious metal that is much sought after, though uncommonly found. It is the same glorious colour as the sun and it never loses its wondrous lustre. A blessed vessel made of this metal protects the purity of the water.",
    "It is found in some rocks and must be extracted. It has a magical ability over some people, it possesses them. They fall within its power and seek to gain more and more of this precious metal for themselves. A blessed vessel made of this metal protects the purity of the water.",
    "A vessel made of sun metal, but it can be of any shape. However, it must be blessed.",
    "Here, have this as an example... I pray that it will help you.",
    "When you have made the vessel, bring it to me. I will help but you need to ensure that you are devout and have faith. Your ability in prayer will be thoroughly tested.",
    "It seems that Ungadulu has started to lose his senses. In our native and ancient history, the 'Vacu' were the servants of the evil spirits from the underworld. The 'Vacu' were priests who summoned the spirits of our ancestors. But the priests were enslaved by the evil spirits of the underworld. It is but a myth, perhaps a story told to scare badly behaved children.",
    "You are more than welcome bwana...",
    "I have to collect herbs now, Bwana.",
    "Greetings Bwana. Ah I see you have the golden bowl! Would you like me to show you how to bless it?",
    "Very well Bwana...",
    "Ohhhhhmmmmmm.",
    "Ohhhhhmmmmmm.",
    "Ohhhhhmmmmmm.",
    "How goes your quest to release Ungadulu?",
    "You are indeed brave Bwana, a truly fearsome warrior to take on such an enemy! Well Done!",
    "That's great Bwana. Now you just need to germinate the seeds and then plant them in some fertile soil. I'm sure that Ungadulu has explained all this to you already.",
    "If you have the Yommi tree seeds, you will need to germinate them. You need to place the seeds into pure water, and they will begin to sprout tiny shoots. You can then plant them in fertile soil.",
    "Congratulations on releasing Ungadulu! My people are very pleased... How goes the growing of the Yommi tree?",
    "Well done Bwana. With the blessings of the gods we will soon have our Totem Pole. Bwana, you now need to plant the seed in the fertile earth.",
    "You should be able to find many places where the ground is fertile in the Kharazi Jungle. Planting the Yommi tree seeds in fertile soil gives it a good chance to grow. My people are trying to grow the Yommi tree as well. But so far we have not met with any success. If you find a rotten tree or what looks like a rotten totem pole, You'll need to remove it yourself to get to the fertile soil. It will take a very sharp, robust hatchet to do it.",
    "I have visited Ungadulu in the caves, he is hard at work studying. He looks well! Have you grown the Yommi tree yet?",
    "This is indeed a bad omen Bwana, that pool is sacred to us. I have seen it and it is full of filth, it is not natural. I suspect that some evil is at work here.",
    "Well, it requires pure sacred water for it to grow. It is a very special tree...",
    "Yes, it is a magical tree and can only survive on the water from the sacred pool. This is indeed a tragedy.",
    "I am not sure but I have heard that deeper in the catacombs where you found Ungadulu, deep underground there is a terrible place guarded by the undead.",
    "Since they died trying to find the source of the stream, they are cursed to guard it for all eternity. The first to seek the source was said to be a high level sorcerer.",
    "He created a powerful spell in the caves. Now, all those who venture near are overcome by a supernatural fear. With all my heart Bwana, I would never go near such a place.",
    "I understand Bwana, it would be a waste of a perfectly good life. We will try to defeat the evil spirits in other ways. But I am not sure how we will do that.",
    "I have visited Ungadulu in the caves, he is hard at work studying. He looks well! How is your quest going Bwana?",
    "If the pool of sacred water has dried up, there may be a way to get to the source of the spring. But it is said to be very, very dangerous.",
    "Perhaps the location has been hidden or buried under rubble? These stories were told to me as a child by the village elders. They were probably meant to frighten us away from the caves. It could all just be a myth! You should perhaps talk to Ungadulu, he may know something? Perhaps there is another way to get to the source of the stream? But I am not sure where it is...",
    "Well, if you are sure you want to go, I will assist as much as I can. You will need the bravery of the jungle lion, if you are to go into that forbidden place. I can give you the recipe for a potion to help with that.",
    "You will need to find two herbs, snake weed and ardrigal. Add them both to a vial of water, and you will walk with the bravery of the Kharazi lion.",
    "Snake weed is usually found by swampy marshy areas. It is not very common and it may be quite difficult to find. There is some marsh to the south of Tai Bwo Wannai village. The herb grows near around very carefully.",
    "Ardrigal is often found growing near to large groups of palms. Such a collection exists in the north. If you head east out of Tai Bwo Wannai village you should come across them. The herb grows in the shade of the palm so check carefully.",
    "I would urge you to take it, Bwana, I have heard that the caves are protected by a supernatural fear that renders even the bravest man to a trembling wreck. You will need all your wits about you when dealing with the terrors that exist down there.",
    "I have visited Ungadulu in the caves, he is hard at work studying. He looks well! How is your quest going Bwana?",
    "That's great Bwana, good luck with your quest and take care!",
    "Well, I have heard that name before, perhaps from the eldars.",
    "Ah, yes, I think that is the name of the wizard who first went in search of the source. Be wary of him Bwana, he may try to trick you.",
    "Hello Bwana, I'm very pleased to see you again. Things seem much happier now in the Kharazi Jungle. I suspect that it is down to your good doings!",
    "Great Bwana, you are truly a brave warrior. Now you can try to grow the Yommi tree in earnest and make the totem pole.",
    "You are indeed very brave Bwana, we have noticed a difference in the Kharazi Jungle, the trees seem to sing again. And we have you to thank for it.",
    "You will need to grow the Yommi tree to full height. And then, before it rots, you must chop it down. Once you have felled the tree, you need to trim the branches. And finally, you need to craft the totem pole out of the trunk. You'll need a very sharp, very tough hatchet to do all this. But once you have completed the totem pole, You will need to use it to replace a totem pole that already exists, as they're all placed on sacred areas to my people.",
    "Hello Bwana, I'm very pleased to see you again. Things seem much happier now in the Kharazi Jungle. I suspect that it is down to your good doings!",
    "Well Bwana, it's a very interesting piece of work, not bad at all. Now we need to replace an existing corrupted totem pole with your newly constructed one. You should find those totems within the Kharazi Jungle.",
    "Greetings Bwana, we saw your fight with the Demon from some distance away. My people are so pleased with your heroic efforts. Your strength and ability as a warrior are Legendary.",
    "Please accept this as a token of our appreciation.",
    "Please, now consider yourself a friend of my people. And visit us anytime.",
    "I'll take those germinated Yommi tree seeds to Ungadulu, I'm sure he'll appreciate them.",
    "I am tired Bwana, I must go and rest.",
    "Good day Bwana. The Kharazi Jungle is especially beautiful today isn't it? My village people pass on their thanks to you.",
    "Just that everything is fine in the jungle with us. And that we are grateful to you for your help.",
    "My people are all happy living in the jungle. They are still afraid of strangers and will not approach but they are around, none the less. Your story has been woven into the fabric of our society. And we all sing your many praises Bwana.",
    "Well, that wasn't very nice of you. It took us a long time to make that Totem pole. Luckily, I made another one at the same time."
  ],
  "Ungadulu": [
    "That is no way to treat shaman!",
    "I hope that teaches you a lesson!",
    "Please come no closer... the flames will incinerate you.",
    "Please don't try to extinguish...",
    "Please, leave now... don't listen to me... I beg you, leave don't touch the flames...",
    "I am Ungadulu, trapped here many years now... Leave these caves and save yourself...",
    "Please Bwana, don't listen to me... run, save yourself...",
    "Please, leave now...",
    "Leave here, please, go... now...",
    "Please run for your life...",
    "Go... go now...!",
    "Run, run away... Run like the leopard Bwana!",
    "I hope that teaches you a lesson!",
    "Greetings bwana... Many thanks for defeating the demon... and releasing me from this dreadful possession... Pray tell me, what can I do to repay this great favour?",
    "You already have some Yommi tree seeds, use those first... and let me know how you get along.",
    "Oh, yes, Bwana... you will be doing a great favour to our people by doing this. However, you must know that it is a difficult task, the Yommi tree is difficult to grow. You must have a natural ability with such things to have a chance...",
    "Here you are, accept these with my gratitude. You'll need to soak them in sacred water before planting them. I notice that you must already be familiar with sacred water to have passed into the flaming octagram.",
    "A good question Bwana, but it is essentially quite simple. First you will need to soak the seeds in some pure water. This will help to germinate the seed and begin the growing process. The Yommi tree is sacred and is also slightly magical. You need to seek out a patch of fertile earth. Such places are located around the jungle and should give the Yommi tree a good chance of survival. The tree should show some remarkable growth quite early but will slow down, you may be able to speed the process up by watering the tree with more pure water, although it can be difficult to find it.",
    "Hmmm, the pure water is sacred to us. It is from a sacred spring which is fed from deep underground. Legend has it that the spring is protected by spirits of long dead adventurers who went in search of the source of the spring. It is likely a myth and the source of the spring is buried deep underground with no paths to it.",
    "Now that you have defeated the demon you can come and go as you please. I cast a spell on you which means that you can pass through the flames without harm.",
    "I will remain here in the protection of the flaming Octagram and continue my research into the spirit world. I am somewhat of an authority with my recent experience! But do remember me from time to time and come to visit an old man. You never know, I may be able to the future, and repay you the favour from that terrible Demon...",
    "My sincerest pleasure Bwana...",
    "Hello Bwana, how goes your quest to find the water?",
    "You did well to come to me Bwana. As I said before, I am an expert in spirits of the underworld. In most circumstances you should just ignore them. However, beware as many spirits will try to trick you.",
    "That sounds very strange Bwana, I'm glad to see you didn't commit such a foul act. I can make a spell that would help you to defeat the spirit. But I need an item that belongs to the spirit to make it work. If you have something like that, please show it to me and I'll give you the spell. Beware of everything in these caves, I was tricked very easily and was enslaved, as you well know. Learn from my example.",
    "I know something about them, especially magical daggers. If you have a specific one, show it to me and I'll help as much as I can.",
    "This dagger has been made for one purpose only...  Praise the gods that you brought it to me. I can make you a spell with this item which will force the spirit to reveal its true self. Once activated, you will be able to attack it like a normal creature. I can make you a spell with this item which will force the spirit to reveal its true self. Once activated, you will be able to attack it like any normal creature.",
    "Use this spell on the Spirit. It will force the spirit to show its true self. And it will also be vulnerable to normal attacks."
  ],
  "You look closely at the flames. They seem to form a straight wall. Something about them looks very strange": [
    "they look completely supernatural. For example, they seem to come straight out of the ground."
  ],
  "Ungadulu [possessed]": [
    "Yes, douse the flames with water, pure water... foo...",
    "Wait... get pure water from the pool... above lands...",
    "...from the above lands... hurry and release me...",
    "Hurry, Vacu, the heat kills me... ha ha ha",
    "Welcome Vacu, to eternal...",
    "Curse you foul intruder... 'Ere near to death ye come now that ye has meddled in my dealings.."
  ],
  "Nezikchened": [
    "Your faith will help you little here.",
    "Your faith will help you little here.",
    "Ha ha ha... I shall return for you when the time is right.",
    "Ha ha ha... I shall return for you when the time is right.",
    "But I will leave you with a taste of my power...",
    "Haha hah ha ha ha ha...",
    "Now I am revealed to you, Vacu, so shall ye perish.",
    "Arrrgghhhhh, foul Vacu!",
    "You would bite the hand that feeds you? Very well, I will ready myself for our next encounter...",
    "Now I am revealed to you, Vacu, so shall ye perish.",
    "Now I am revealed to you, Vacu, so shall ye perish.",
    "Arrrgghhhhh, foul Vacu!",
    "You would bite the hand that feeds you?",
    "You would bite the hand that feeds you?",
    "Very well, I will ready myself for our next encounter...",
    "Very well, I will ready myself for our next encounter...",
    "And now you try to defile my sanctuary...",
    "And now you try to defile my sanctuary...",
    "I will teach thee!",
    "I will teach thee!",
    "Protectors source, alive in death,",
    "Protectors source, alive in death,",
    "do not rest while this Vacu draws breath!",
    "do not rest while this Vacu draws breath!",
    "Raarrrrghhhh!",
    "Raarrrrghhhh!",
    "I'll kill you myself!",
    "I'll kill you myself!",
    "Your faith will help you little here.",
    "Your faith will help you little here.",
    "Arrggghhhhh....",
    "Arrggghhhhh....",
    "I am beaten by a mere mortal...",
    "I am beaten by a mere mortal...",
    "I will revenge myself upon you...",
    "I will revenge myself upon you..."
  ],
  "Viyeldi": [
    "Beware adventurer lest thou lose thy head in search of source. Thou hast been tested for bravery and hast not been found wanting.",
    "Perilous dangers await for thee, Tojalon, Senay and Devere make three, None hold malice but will test your might, pray you do not lose these fights. If, however, you win this day, Take heart that see the source you may, Through Dragon's eye will you gain new heart, To see the source and then depart.",
    "To take challenge with me is useless for I am impervious to your attacks. Take your fight to someone else and maybe then get back on track.",
    "So, you have fallen for the foul one's trick... Aaaaahhhhhhhhh the pain!"
  ],
  "San Tojalon": [
    "Prepare yourself...",
    "You have proved yourself of the honour."
  ],
  "Irvig Senay": [
    "Greetings brave warrior, destiny is upon you... Ready your weapon and defend yourself.",
    "You have proved yourself of the honour."
  ],
  "Ranalph Devere": [
    "Upon my honour, I will defend till the end... May your aim be true and the best of us win...",
    "You have proved yourself of the honour."
  ],
  "Echned Zekin": [
    "Who disturbs the rocks of Zekin?",
    "So, you desire the water that flows here?",
    "The water babbles so loudly and I am already so tortured. I cannot abide the sound so I have stoppered the streams. Care you not for my torment and pain?",
    "The rock must remain, it stoppers the waters that babble. The noise troubles my soul and I seek some rest... rest from this terrible torture...",
    "I am Echned Zekin... and I seek peace from my eternal torture...",
    "I was brutally murdered by a vicious man called Viyeldi. I sense his presence near by, but I know that he is no longer living. My spirit burns with the need for revenge, I shall not rest while I sense his spirit still. If you seek the pure water, you must ensure he meets his end. If not, you will never see the source and your journey back must ye start. What is your answer? Will ye put an end to Viyeldi for me?",
    "You would release me from my torment and the source would be available to you. However, you must realise that this will be no easy task.",
    "Use the dagger I have provided for you to complete this task and then bring it to me when Viyeldi is dead.",
    "I will furnish you with a weapon which will help you to achieve your aims... Here, take this...",
    "To complete your task you must use this weapon on Viyeldi.",
    "You will benefit from this decision, the source will be opened to you. Bring the dagger back to me when you have completed this task.",
    "The decision is yours but you will have no other way to get the source. The pure water you seek will forever be out of your reach.",
    "Such noble thoughts, but Viyeldi is not alive. He is merely a vessel by which the power of the source protects itself. If that is your decision, so be it, but expect not to gain the water from this stream.",
    "I am long since dead and buried, lost in the passages of time. Long since have my kin departed and I been forgotten... It is unlikely that you know me... I am a poor tortured soul looking for rest and eternal peace...",
    "I was robbed of my life by a cruel man called Viyeldi and I hunger for revenge upon him. It is long since I have walked this world looking for him to haunt him and raise terror in his life. But tragedy of tragedies, his spirit is neither living or dead. He serves the needs of the source. He died trying to collect the water from this stream, and now I hang in torment for eternity.",
    "Yes, you may get some water, but first you must help me. Revenge is the only thing that keeps my spirit in this place. Help me take vengeance on Viyeldi and I will gladly remove the rocks and allow you access to the water. What say you?",
    "Why do you return when your task is still incomplete?",
    "Avenge upon me the death of Viyeldi, the cruel. And I will give you access to source...",
    "It is too late for second thoughts... Do as you have agreed and return to me in all haste... His presence tortures me so...",
    "Return swiftly with the weapon as soon as your task is complete.",
    "Should I take from this that you do not wish to help me gain vengeance on Viyeldi?",
    "Very well, if that is your decision... However, you will not get access to the water...",
    "Very well, return to me when it is done.",
    "Aha, I see you have completed your task. I'll take that dagger from you now.",
    "Aahhhhhhhhh! As I take the spirit of one departed, I will now reveal myself and spell out your doom.",
    "Something seems different about you... Your sense of purpose seems not bent to my will... Give me the dagger that you used to slay Viyeldi or taste my wrath!",
    "Bring it to me with all haste. Or torment and pain will I bring to you...",
    "Go now and slay him, as you agreed. If you are forfeit on this I will take you as a replacement for Viyeldi!",
    "You worthless Vacu, how dare you seek to trick me. Go and slay Viyeldi as you promised or I will layer upon you all the pain and torment I have endured all these long years!",
    "Argghhhhh...nooooooo!"
  ],
  "[Hero]": [
    "Corrupted are we now that Viyeldi is slain...",
    "Bent to this demon's will and forced to bring you pain...",
    "Arrghhhhh",
    "Arrghhhhh",
    "Forever must I live in this torment",
    "Forever must I live in this torment",
    "till this beast is slain.",
    "till this beast is slain."
  ],
  "Congratulations! You have completed": [
    "'Legends' Quest' - Complete this Master quest."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Legends%27_Quest?oldid=36234248’"
  ]
}