{
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "Missing any changes resulting from Spria replacing Turael after WGS, misc dialogue options. Dev also said there are many different convos for Ava during the quest if you try to give her unusual chicken-related items.You can discuss this issue on the talk page or edit this page to improve it."
  ],
  "Ava": [
    "Hello there and welcome to my humble abode. It's sadly rather more humble than I'd like, to be honest, although perhaps you can help with that?",
    "Yay, I didn't even have to talk about a reward; you're more gullible than most adventurers, that's for sure. Don't worry, though; I just need you to help fix this vile old bed for me. Then I'll find a suitable reward for you.",
    "Don't be silly; everyone knows that true warriors don't ever sleep...or perform many other bodily functions, for that matter. I'll come up with something, though.",
    "What I need is simple: a couple of undead chickens. You should be able to pick some up at the farm near Port Phasmatys. I'll use one for my bed, then see what I can make from the other in the way of a reward. I have some ideas involving infinite feathers.",
    "Very well, I suppose I'll just have to resort to the Professor's patented sleeping aid in order to get some rest. It does so bruise my head, though.",
    "I'm not a nice girl, I'm a respectable scientist researching the interactions between ghosts and the forces of pure science. I took over the position of assistant to the Professor upstairs, although, to be honest, his methods are somewhat eccentric. Did you hear about that Ernest scandal?",
    "You don't know the half of it - can you believe that he thinks he has proven Goldbach's First Conjecture using an optimised segmented sieve?",
    "Do you need a reminder what you are supposed to do? I know you must have shiny beads distracting you, but it is an important job you are doing for me.",
    "...And people say we scientists are absent minded... You need to fetch 2 undead chickens for me to use in my redecoration. It's not rocket science.",
    "If they existed, they would be like arrows but much, much bigger. Considering the mess you rangers make with small bits of stick, we scientists have decided they don't exist. Now get chicken hunting.",
    "Well, the Witch next door has been cooking some rather nice gingerbread, but I don't think that counts as gossip. Can you head off and do adventurous stuff, please? I hear the Wilderness is fun this time of year.",
    "What are you doing? Yuck, dead things.",
    "What are you doing? Do I look that thin?",
    "What are you doing? I'm not ticklish.",
    "My spiritometric devices show that you have been in close contact with ghostly animals. Are we closer to success?",
    "Is it undead? Does it have feathers? Will it help in stuffing a mattress or creating useful feathers?",
    "Don't try to fob me off with this junk! Can you imagine sleeping in a bed filled with chicken meat?",
    "No, no and thrice no. Get out of my sight.",
    "Well, I'm a bit hungry so I'll take it - but I still need all the undead chickens that I asked for.",
    "Yummy. Makes a change from all that seafood.",
    "I'd hazard a guess at no.",
    "Firstly, it is not undead; it is very, very dead. Secondly, it smells atrocious and, thirdly, it has been plucked. Get me a feathery one that can still move.",
    "We are trying to generate feathers here. Is this a magic feather that has little feather children?",
    "They seem about as common around here as intelligent adventurers. Get me an undead chicken.",
    "Stunning. I should have tried to hire some gnomes instead. They may be obsessed with their bellies but they can at least be trusted to deliver unpleasant perishables.",
    "Are you going to hand it over or do you want to continue to waft it about menacingly?",
    "You would be more menacing if your weapon weren't quite so rotten.",
    "On second thought, the way you wave it about makes me fear for my life. Stow it in your bag and talk to me again.",
    "Amazing! Success! I can look forward to some good nights' sleep after all.",
    "Well, I need the feathers to make my bed more comfortable. A comfortable bed will help me sleep. Obvious, really.",
    "Well, for a start, undead feathers are much cleaner than living ones; no dust mites or anything. Secondly, I always think of Ernest when I see a chicken, so my nerves can't take killing them.",
    "Seeing as how you ranger types use so many feathers in your arrows, I was thinking I could harness an undead chicken to make an unending supply of arrow flights for you.",
    "We'll need a magnet next, one with purely natural fields and made from a carefully selected iron bar. A firm impact when the iron is parallel to Gielinor's field will stabilise this field in the rod. Go and talk to the Witch next door.",
    "I'm not sure what you are trying to do; are you sure you aren't slightly deranged?",
    "Thanks! This is great for me, although I'll need another one if you want any sort of reward.",
    "Go and talk to the Witch next door. She'd talk the hind legs off a donkey but she can select the iron with which it is suitable for the chicken to interact. Despite my extensive studies, her years of experience make her better at instinctive magico-mystical interaction. Oh well, at least I'm cleverer, prettier and will have a better bed.",
    "Do I resemble an iron-bar merchant?",
    "An entirely logical answer; you'll make a scientist yet.",
    "I'm thrilled for you. What about my magnet?",
    "I can see now why Fenkenstrain prefers to work with dead folk. It can't be more frustrating than working with you.",
    "Great stuff! With the Witch's influence within the magnet, the undead chicken can use this, I'm sure. The plan is that the chicken will operate the magnet to attract bits of iron and steel, maybe even your own recently fired arrows. There are plenty of totally lost arrowheads lying about in the fields of Gielinor, I bet. In addition, arrows which you fire should be able to be attracted back to your quiver by the cunning avian.",
    "We need a source of wood, but one which is spiritually active and can regenerate itself. That will save you some hatchetwork in the future. Try using a hatchet on the pesky trees in the garden here, the ones that attack rather than the really dead ones. They are probably just the sort of thing we could",
    "Now you know how those poor guards feel when you hide behind mushrooms and fences and attack them from afar! Anyway, I reckon you'll need to try a mithril or better hatchet on the trees. At least the trees are pretty close.",
    "So, what terrible hitch have you encountered now?",
    "Well, I've heard that all kinds of dragons and even basilisks can drop mithril hatchets, if that's why you are delaying. Most of these creatures are silly enough that you can even hide behind something and plink them to death in that brave ranger way.",
    "Fortunately for you, I've done some research and it seems to suggest that there are two choices open to you.",
    "The first is more interesting. We cut off your arms, have them reanimated as undead, reattach them and then you should be able to cut the trees normally. Of course, you won't be able to pick your nose any more, so I suppose you'll want to try the second option.",
    "Well, in that case, I think it may have something to do with Slayer abilities. After all, I did see Turael and his daughter poking around the trees while I was moving in. As he's not known for his random touristic activities, you should try chatting with this Turael or his daughter, Spria. He's the Slayer Master near Burthorpe and she was last seen heading off on some army mission. Maybe one day I'll head out too - to test my experimental weapons on fearsome foes.",
    "What do you want? A prize? Go and get the wood; it's not as if the trees are wandering about and hard to find.",
    "You certainly took your time.",
    "Quite. Now that we have all the ingredients for infinite arrows, we just need a container in which we can keep the components in the correct mutual alignment. I've gathered together some research notes from various sources but I can't quite make out what they mean. If you want to have a go at making them out, just ask me for a copy.",
    "They are still stumping me. Here are the notes; I really hope your head doesn't explode from reading them.",
    "It wouldn't be all bad as your body would be useful for research after death. What I'd be upset about was if bits of you landed in my nice new bed.",
    "Don't tell me, your cat ate them? You won't get out of the job that easily; here are some copies I made.",
    "I gave you those and have plenty of copies; I need them to be translated.",
    "I know you have the notes; I gave them to you, in case you forgot! Furthermore, if I had hints, I'd have translated those notes myself. So, take the hint and go off and translate them. If it's too hard, you can always go and shoot demons in cages.",
    "Let me guess, you've managed to mislay the notes after you translated them?",
    "Luckily, I assumed you were terminally careless, so I can supply these copies.",
    "If you hadn't mislaid the originals, you'd not be asking me these questions. You have no one to blame but yourself.",
    "For all I know, it was pure luck, so don't jump to any conclusions about your mighty intellect.",
    "Let's get back to the work we're doing, then. Remember, this is all a favour to you; I could have just decided to fob you off with a feather duster. I've given you a pattern for the container; you'll need to combine them with some polished buttons and hard leather. Then we're almost done. Good news, eh? If you are having trouble finding buttons, I've heard rumours that the H.A.M. society carry this sort of stuff more than most.",
    "I hear they lose their clothes a lot to thieves so they have to make do with shoddy goods. Whatever the reason, they seem to carry buttons about in their pockets.",
    "Your short-term memory loss worries me. Combine the pattern with hard leather and some polished buttons, then hand the resulting container to me.",
    "Why do you think I want these?",
    "You're pretty careless, aren't you. I assume you're the type who leaves a trail of arrows and knives behind them when they train? Here's a replacement; perhaps if I charged for them, you'd be more careful.",
    "Wow, great, now the arrow manufacturer is ready for use...there you are! Talk to me if you need more information later.",
    "You are also skilled enough that I'm rewarding you with the upgraded version right away. Congratulations."
  ],
  "Player": [
    "I would be happy to make your home a better place.",
    "Great, will I be able to take a nap in it?",
    "I'm not convinced by just a vague something; can you be a slight bit more inspiring in your offer?",
    "Very well then, I shall await my mystery prize with bated breath.",
    "I'm not much into interior design, to tell the truth.",
    "What's a nice girl like you doing in a place like this?",
    "Ahh yes, I helped sort that out; he did seem a bit odd.",
    "Er, quite. Yes.",
    "Yes, please.",
    "Rocket?",
    "No thank you; I just came to gossip with you.",
    "I'm here about a quest. I am after one of your, er, unhealthier poultry. Could you help me?",
    "Whyever would this be?",
    "Your animals don't look too healthy.",
    "What use are zombie animals?",
    "But you're a ghost - surely you know something about it.",
    "Would I be able to buy some of your chickens?",
    "Not yet; I've been distracted by the thought of undead cow milk.",
    "I'm here about a quest.",
    "I'm here about that quest.",
    "I have a message from your husband. He wants you to know that he still loves you, despite his ghostly state.",
    "I'll have a word with him, then; magic has its uses I suppose.",
    "I'm here about that quest.",
    "I'm working on it",
    "Your wife says she needs the family cash and wants to know what you did with it.",
    "Your sense of humour died too, it seems...",
    "I rest my case.",
    "Nothing new, no.",
    "I'm here about that quest. Your husband says he put the cash in the bank.",
    "Can't you just take a ghostspeak amulet? Then you could talk to him directly.",
    "I'm here about that quest.",
    "Not yet.",
    "You may not believe me, but she wants me to find your bank pass now.",
    "Not since we last spoke.",
    "I'm here about that quest. He says he won't trust me with the bank pass. What if I gave some sort of altered ghostspeak amulet to him - surely that would work?",
    "I'll see if I can find her. Big nose and a monstrous hat, I assume? I wonder where the beautiful young witches hide...",
    "I'm here about that quest.",
    "I've not progressed at all, I'm afraid.",
    "I talked to your wife and thought that if you had a special amulet, you could speak to her and sort out the bank situation without me being involved.",
    "Well...oh, never mind. I'm working on getting the amulet anyway.",
    "I'm here about the farmers east of here. Alice and her husband are having trouble talking to one another and said you might be able to help.",
    "Alice seems to think you could alter a ghostspeak amulet in order to allow them to communicate.",
    "In addition, when I was attempting to thwart Necrovarus, you created a new type of amulet for me. I thought that perhaps you might also do so on this occasion.",
    "I'm here about the farmers east of here. I'm here to see if you are ready to do your mystical stuff with my ghostspeak amulet.",
    "Wow, that was quick and painless.",
    "I'm here about the farmers east of here.",
    "Well, to tell the truth, I just came back to chat with you. Any news?",
    "I'm here about the farmers east of here. Would you be able to replace the amulet you made? I seem to have lost it.",
    "I'm here about that quest.",
    "I have obtained the amulet; I just haven't handed it over yet. So, it's looking good!",
    "I talked to your wife and thought that if you had a special amulet, you could speak to her and sort out the bank situation without me being involved.",
    "Well... oh, never mind. I'm desperate enough for those chickens to let that pass.",
    "Okay, you need it more than I do, I suppose.",
    "Lucky we had such a brilliant idea.",
    "I don't think I'm ready to hand it over yet.",
    "I need a couple of your chickens.",
    "They look pretty pathetic; how hard can it be?",
    "Well, that's one way to catch a chicken, I suppose.",
    "Could I buy those chickens now?",
    "Could I buy 1 chicken now?",
    "Could I buy 2 chickens?",
    "Your animals don't look too healthy; I'll buy elsewhere.",
    "I'm okay, thank you.",
    "Where can I get ecto-tokens?",
    "Would this raw chicken be any use?",
    "Well, it's not alive.",
    "I don't suppose this tasty chicken would work?",
    "You are sure?",
    "Would this undead chicken be any use?",
    "But why not? It's what you asked for!",
    "Does this count? It used to be attached to a chicken.",
    "Not that I know; do such things exist?",
    "Well, I can buy the ones you want but I don't have any on",
    "Well, I have this one which I can use to club people.",
    "I prefer to keep this fine weapon with which to smite mine enemies.",
    "You can take it; it smells anyway.",
    "Here they are.",
    "Can I ask exactly how an undead chicken will help you sleep?",
    "Obvious, yes, but why on Gielinor would you need an undead chicken when there are perfectly good live chickens just down the road?",
    "Then why do I need a chicken for my reward; we already established that I don't use a bed?",
    "Beats chicken slaying or hanging around in fishing shops, I suppose. So, what next?",
    "Here's one.",
    "Here's the second one for my reward.",
    "Okay, okay, you're great. Yes, I'll go and talk to her when you've finished praising yourself.",
    "Ava told me to ask you about making magnets. Something about natural fields and other stuff. Sounded like she needed a farmer, to be honest.",
    "No need to patronise me quite so much, you know.",
    "I'll be back.",
    "I've talked to the Witch and she has asked me for some iron bars.",
    "Er, maybe. I've never met one.",
    "I am back.",
    "I have some iron bars here.",
    "Toys? Snookums? What are you on about, you deranged old bat?",
    "I've talked to the Witch and now I've given her some iron bars.",
    "The process is subject to some unexpected delays.",
    "I've manufactured the magnet; here it is.",
    "I begin to understand your plan. We've covered feathers and arrowheads now; what next?",
    "They will try to kill me, though, and I can't fight back!",
    "Nothing really; I just decided to talk to you in case you have any great advice for me.",
    "Well, I tried to hack the trees with my hatchet, but it just bounced off the trunk! It did all seem all-too-convenient to work on the first try.",
    "Tell me the worst.",
    "I'm not exactly addicted to picking my nose, but I do think I'll pass on that method.",
    "Oh dear, I hope he doesn't want me to buy one of his ridiculous fashion accessories. Those earmuffs he sells make heroic adventurers into a laughing stock.",
    "I'm here about a quest. Ava said she saw you hanging around the moving trees near Draynor Manor.",
    "I think I need some of the wood from them, but my hatchet just bounced off the trunk.",
    "Okay, so I'll see whether I can spare a hatchet and a symbol. Thanks.",
    "Hello, I'm here about those trees again.",
    "I'd love one, thanks.",
    "Not right now.",
    "Hello, I'm here about the blessed hatchet again.",
    "Actually, yes.",
    "Not right now.",
    "I think I'm ready to cut those trees now.",
    "I have that undead wood at last. Well, twigs anyway.",
    "I'd say they didn't grow on trees, but I guess you'd just be sarcastic about my sense of humour.",
    "I'd like to look at those research notes now, unless you have translated them without me?",
    "I'd find it slightly inconvenient, I'm sure.",
    "Your concern is touching.",
    "I seem to have lost the research notes.",
    "I have the notes but haven't translated them yet. Any hints?",
    "I can't say I'm proud of it, but you aren't wrong.",
    "I have the gibberish notes now; do I really have to translate them again?",
    "I've translated those notes. See? I'm not just a thuggish moron like you seem to think.",
    "I can see why you don't have any assistants; you're not exactly easy to work with.",
    "Really? How would you know this strange detail?",
    "So what do I do with this pattern again?",
    "The pattern seems to have vanished from my pack...not my fault, of course.",
    "I'm here about the farmers east of here. Hello there, just dropping in to thank you again. It all went perfectly. Alice and her husband can communicate again.",
    "Sorry to hear that."
  ],
  "Alice": [
    "Hello. How can I help you?",
    "You need those useless, undead chickens? How odd you adventurers are. You need to talk to my husband, though - not that I can these days.",
    "Can't you see, he is dead. I can't talk to the dead.",
    "Hello. How can I help you?",
    "The curse of undeath was so cruel; all the men out here succumbed, but Lyra and I were left alive. Ever since that day, I've not been able to speak to him. Tell him I love him but I can't find our savings. I know he had our collection of gold and 'prize cow' rosettes just before the curse struck.",
    "Have you spoken to my husband yet?",
    "I'll need his bank pass, in that case.",
    "I tried that once, but all those other ghosts - and even the undead chickens and cows - scared me so much. I wouldn't try it again for all the cash in Varrock bank.",
    "Have you asked him about the bank pass?",
    "You're so clever; I've overheard passing adventurers say that there's some witch near here who changes ghostspeak amulets. I think she lives a bit west of that mad Professor Fenksomething, past the Farming patch.",
    "Mysterious indeed, but in this case she actually looks pretty normal.",
    "Have you found a way for me to talk to my husband yet?",
    "Have you handed him an enhanced amulet?",
    "You heard my husband: leave now!",
    "You killed Bessie!"
  ],
  "Alice's husband": [
    "Woo woo!",
    "It's that fountain thingy in the temple to the east. It's turned them all into zombies.",
    "None at all, mate, except that those worshippers at that temple keep comin' and killin' 'em all for their bones. Don't ask me why.",
    "I don't know nuthin' about nuthin'. Oim a simple ghost with simple needs. All I know is, years ago, that temple started glowing green and, a few months later, I woke up dead. That's all there is to it. I do miss the wife though; tell 'er I still loves her.",
    "Talk to my wife and I'll think about it.",
    "'Ave you talked to the wife for me?",
    "Tell 'er I spent it on cheap spirits, har har.",
    "Hah, just trying to lift your spirits.",
    "Suit yerself, stick-in-the-mud. Anyway, Oim not one o' them yokels. Tell 'er I putted the cash in the bank like she always told me to. A warning to ya, too: annoy her and I'll haunt ya til yer hair turns white.",
    "Any luck wiv me wife?",
    "Maybe she said that, maybe she didn't. I think you're just after me savings. Tell 'er that no one but a fool gives away their pass numbers. Go tell 'er now, if you're not a double-dealin' scammer, that is.",
    "'Ave you talked to 'er?",
    "Arr, that makes far more sense than I was expecting from a muscle-head like you. My wife's a clever one.",
    "Wot use is that there stuff to a ghosty like meself?",
    "Arr, that makes far more sense than I was expecting from a muscle-head like you. My wife's a clever one.",
    "Give me that amulet, then, and we'll be seeing about your unnatural desire for chickens.",
    "Ta, mate.",
    "Ya din't seem to 'ave it.",
    "Ahhh, many thanks. Now what was it you were wanting again?",
    "Chickens is tricksy, 'specially dead 'uns. I'll have to catch 'em for ye.",
    "Stand back while I catches 'em, ya city slicker.",
    "Here, chicky chicky!",
    "Git 'ere, yer pesky bird!",
    "Where'd she go?",
    "Git orf my laaand!",
    "Hello, how can I help you? I'm sellin' if you have ecto-tokens.",
    "I can hand over a chicken if you give me 10 of them ecto- token thingies per bird.",
    "Ta, some day soon I'll be having a nice undead bed to kip in.",
    "I'm not a charity here, ya know. Bad enough all you cow-killing folks are a'slaughterin' me beasts. Come back when ya have enough tokens.",
    "Great! I'm laying away me tokens for some killer cows. That'll learn them bone rustlers.",
    "Har har, how many ghost chicky farmers d'you know, den?",
    "The ghosts I talk to say that the tokens have something to do with the tower just east of here. If you need to collect some I'd try there."
  ],
  "Old crone": [
    "Ah, I know them; shame about those cows. Why would they think that I could help?",
    "Well, the poor young lady has such family problems; I quite feel her pain. I'd be happy to help. You seem to have one of her golden hairs on your shoulder, so I can use that...",
    "Talk to me again with a ghostspeak amulet and some space in your backpack and I'll be ready to work on this little good deed. The way I plan is quite simple, really. I can mirror part of the unused mystical essence of the ghostspeak amulet, bind it with Alice's hair and thus create a second amulet. The second amulet will be useful for the purpose you desire, though it won't work for any other ghost or human other than the farmer and his wife.",
    "I most certainly am, but you don't have an ghostspeak amulet.",
    "I most certainly am, but you don't have space in your backpack.",
    "I most certainly am; there you go.",
    "Just being a good neighbour.",
    "Yes?",
    "Disgraceful! Deliver that amulet; a young lady's happiness depends upon it.",
    "Here you are; luckily, I saved some of Alice's hair in case you were careless. Which you were.",
    "I can't help but shed a tear about my own family. My sisters are so vile, I refuse to talk to them these days.",
    "Never mind; we've reunited a happy family of farmers; that's enough for me."
  ],
  "Cow1337killr": [
    "Always the same; I can never get these animals to myself.",
    "Buying cowhides and feathers - ahh, that chicken is next; feathers for me!"
  ],
  "Sneaky undead fowl": [
    "Woo woo!",
    "Woo woo woo!"
  ],
  "(See Transcript": [
    "Alice's husband)"
  ],
  "Helda": [
    "Hello, hello, my poppet. What brings you to my little room?",
    "Don't worry, deary, I can tell you just what to do and you won't have to worry your pretty head about the complicated bits.",
    "I went to anger management classes, my lambkin; that's why I was treating you so kindly. It's either this way of talking or I'll go back to shoving children into ovens. Just bring me 5 iron bars, though, and you're well on the way to never having to talk to me again.",
    "Oh, but sugarpie, I need 5 iron bars, you don't have any. Come back to me quickly with all 5 of them.",
    "Oh, but sugarpie, I need 5 iron bars, you don't have enough. Come back to me quickly with all 5 of them.",
    "Great, you'll go far! I made some nice painted metal toys for you, snookums.",
    "Oh, forget it, then. If you won't react to kindness, I'm back to luring infants into my oven. You'll have it on your conscience. Go to the mine just north-east of Rimmington and hit the bar with a plain old smithing hammer while facing north. Then take your new magnet to Ava. Poor girl, having to deal with whippersnappers like you.",
    "You were sent to try my patience, weren't you? Go away and make that magnet, then hand it to Ava.",
    "I can't say I didn't expect this; you'd lose your head if it weren't glued on. Lucky I made some replacements. Take this one and leave me in peace.",
    "Hoorah for you, you have the magnet. Just hand it over to Ava. I'm working on my new recipe for spit-roast adventurer, so disturbing me isn't wise."
  ],
  "Turael": [
    "'Ello, and what are you after, then?",
    "Ahh, you came to the right place; odd things, those trees. What is it you are needing exactly?",
    "Sounds like you need a blessed hatchet. No one really makes them, though, these days. Blessed hatchets are too soft to cut normal wood since the hatchet's edge must be replaced by holy silver. I can do you a favour, though. If you can give me a mithril hatchet and a holy symbol of Saradomin I can let you have my hatchet. I'll make myself a new one when no one is pestering me for Slayer tasks.",
    "'Ello, and what are you after, then?",
    "I can make a hatchet for you now, if you wish. Remember, it will be no use for normal woodcutting after I have added the silver edge.",
    "You'll need to hand over both a mithril hatchet and a holy symbol of Saradomin. You don't have a hatchet in your pack, so I'm not able to help.",
    "You'll need to hand over both a mithril hatchet and holy symbol of Saradomin. You don't have a symbol in your pack, so I'm not able to help.",
    "Here's a new hatchet; may it serve you well.",
    "Here's the replacement; be more careful with this one, eh?",
    "Goodbye, then. You may, of course, return if you decide you want a new hatchet.",
    "'Ello, and what are you after, then?",
    "I suppose you want a new hatchet?",
    "Goodbye, then. You may, of course, return if you decide you want a new hatchet.",
    "You already have a hatchet in your bag but you want another?"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Animal_Magnetism?oldid=36077666’"
  ]
}