{
  "High Priest": [
    "Good day, [Player].",
    "It never ends; as soon as I think we have it won, The Devourer catches us off our guard again.",
    "Likewise, [Player], in your adventures.",
    "You have proved that the plagues aren't contagious, so we must try to lift the quarantine that Menaphos has imposed on us.",
    "I don't have a clue. I've already tried to meet with them and we were rebuffed in a most unpleasant fashion.",
    "I have a feeling this could prove a somewhat hazardous quest for you and I'm not even sure where you would start. If you are happy dealing with our woes, we would, of course, be grateful.",
    "I'm glad you want to help, but how exactly to continue, I don't know.",
    "I led a delegation across the bridge but we were allowed no further.",
    "Greetings, Coenus.",
    "That is an improper greeting. You address the High Priest of Icthlarin!",
    "You will let us pass. We are not contagious.",
    "You wouldn't dare!",
    "You wouldn't?",
    "Run!",
    "The Menaphites are led by a more secular ruler than I would like. Respect for the old ways is diminishing.",
    "That would solve part of our problems, but a large number of our townsfolk are in Menaphos. We must get word to them that it's safe to return.",
    "I don't know. I think I'll leave that up to you.",
    "I doubt Coneus would let his mother over the bridge without threatening to fill her full of arrows.",
    "There are probably gaps in the walls, but if the current doesn't kill you, the crocodiles will.",
    "They guard the bridge all day and night, we've looked into this route.",
    "I doubt it; they keep the bridge brightly lit at all times.",
    "Don't. Coenus and his men may be cold-blooded thugs, but they are our brethren and, besides, they are just following orders.",
    "None that I know if; if there was, it would probably be guarded.",
    "No. All Tumeken's children and their followers revel in the light these days.",
    "He is the husband of Elidinis, father of both Icthlarin and the Devourer, and the head of the pantheon of gods.",
    "Well, the followers of The Devourer shunned the light, but all her temples have been destroyed. Though there was also the Sect of Scabaras.",
    "The Sect of Scabaras: a cult dedicated to the lesser deity, Scabaras.",
    "The Book of Light and Day says that Tumeken once fell into a deep sleep and dreamt for four days and four nights. The first night he slept and dreamt a good dream. He dreamt of a journey long and arduous. From the loins of his subconscious Apmeken was born into reality; a physical manifestation of his dream. Tumeken continued to have pleasant dreams for a further two days and two nights. After each, a new deity came into being. On the fourth night, however, Tumeken dreamt a bad dream. He dreamt of himself and he dreamt of his increasing isolation caused by his extended sleep. This isolation sprung forth into the world and took the form of Scabaras.",
    "Yes, the followers of Scabaras used to be great architects of the subterranean. According to legend, they once planned to build a passage under the river Elid. No doubt Elidinis smote them because none of the followers were ever seen again.",
    "Yes, there is a shrine dedicated to Scabaras in the Temple of the Lesser Gods in the north-east of the city.",
    "In that case, be sure to talk to Jex. He looks after the building and can tell you all about the place.",
    "Good day, [Player].",
    "Have you spoken with Jex yet?",
    "He should be outside the Temple of the Lesser Gods in the north-east corner of the city. He knows a large amount about the building.",
    "Good day, [Player].",
    "Any luck with getting news to our people in Menaphos?",
    "Good day, [Player].",
    "I don't know how you managed to get word to our citizens, but I am very grateful.",
    "If you rub this lamp, it will increase your combat stats. Be aware that it only has two wishes, rather than the traditional three.",
    "Good day, [Player].",
    "Certainly. Ask your questions and I will see if I can help.",
    "Of course. We Menaphites are believers in many gods. I, in my position as head priest of Icthlarin, still give praise to Tumeken and Elidinis each day at this very altar.",
    "No need for thanks. Sadly, this view isn't taken by all Menaphite sects.",
    "The town is getting back to normal, thanks to you. The bank under the Temple of the Lesser Gods has reopened and a number of our merchants have reopened their stalls.",
    "We're doing a bit. Having Nardah and Pollnivneach nearby helps and we're also getting a lot of trade from adventurers these days. Still, I look forward to when Menaphos opens its gates to us again.",
    "I have no quests available to you until you've increased your skills and performed more tasks for other folk.",
    "I haven't heard anything more since my people returned. Ask them, if you're curious about Menaphos.",
    "You already have a lantern; greed isn't good, you know."
  ],
  "Player": [
    "Hello there. How goes the fight for Klenter's soul?",
    "I wish you luck in your attempts.",
    "What other plans have you for the future of the town?",
    "So what are you going to do?",
    "Perhaps I could help?",
    "Sounds like a quest for me. I can't turn that down!",
    "You mentioned earlier that you were rebuffed in an unpleasant fashion. What happened?",
    "That Coenus is a cold-blooded thug.",
    "Why do you need Menaphos to lift the quarantine? You have control over your own gates and, with the magic carpets based outside the city, you could create new trade links with some of the other desert towns to replace Menaphos.",
    "How should we do that?",
    "What if I disguised myself as a Menaphite?",
    "I'll take that as a 'no'.",
    "Is Menaphos defended by large walls all along the river bank?",
    "Is there any time when the gate is unguarded?",
    "Perhaps I could sneak up under the cover of darkness?",
    "Perhaps I could fight my way in?",
    "Is there any way into Menaphos from below?",
    "Oh. So there aren't any secret tunnels under this city?",
    "Who's Tumeken?",
    "You said 'these days'.",
    "Who?",
    "What's a lesser deity?",
    "Okay, you could have just said... 'a dream' or something. Where were we?",
    "That sounds interesting. Do they have any altars or temples left in the city?",
    "I might check it out.",
    "I'm not sure I can take on such a responsibility now.",
    "Greetings, cleric.",
    "No; could you remind me where he might be?",
    "Hello, Jex.",
    "The high priest mentioned that you know all about the Temple of the Lesser Gods.",
    "Oh? What's happened to the place?",
    "I'd like to have a look.",
    "I'm trying to investigate any tunnels under the city by request of the high priest.",
    "Thanks, Jex, you've been a great help.",
    "Thanks.",
    "Hello, Jex.",
    "I haven't made it down to the dungeon yet.",
    "Don't worry, I'll bring one along. Thanks for the warning.",
    "What are you doing down here?",
    "What's down there?",
    "What do you know about this sect?",
    "Why are you stopping people from going down there?",
    "Gosh, that sounds quite scary. I might investigate this place in the future.",
    "Do you have a tinderbox?",
    "That's okay; I've one with me anyway.",
    "Do you have a torch?",
    "How come you're not spotty?",
    "Aren't you afraid that the plague is contagious?",
    "What is this place?",
    "What happened to this place? It's all smashed up.",
    "I will, I will.",
    "So people keep telling me.",
    "Thanks for the advice.",
    "Have some faith in me.",
    "I will, I will.",
    "Um, why?",
    "I'll look out for it, then.",
    "Of course I'm not; I'm [Player]. Besides, Kaleef's dead!",
    "He's dead. His body is lying over there. At least, somebody is, with a message addressed to Kaleef.",
    "Are you Kaleef's contact in Menaphos?",
    "Was Kaleef close to you?",
    "Perhaps we can help each other...",
    "I need to tell the Sophanites inside Menaphos to return home and you need to talk with Osman the Spymaster.",
    "I helped rescue Prince Ali from Lady Keli.",
    "Pollnivneach.",
    "I first ran into Prince Ali and his kidnappers in Draynor Village.",
    "Port Sarim.",
    "Goblin Village.",
    "Canifis",
    "Hassan.",
    "Traitorous Ali.",
    "Louie Legs.",
    "Ozan and Leela helped me find him.",
    "Ranael.",
    "I'll get right to it.",
    "I'm still working on that. Have you told the Sophanites to return yet?",
    "Greetings, cleric.",
    "I'm still working on that.",
    "I want to talk to you about Sophanem. Your help is needed urgently in Sophanem.",
    "Maisa wants to speak with you.",
    "I didn't. I met her in private, deep beneath both cities. I went there from the Sophanem side.",
    "What? What have you been up to there?",
    "Look, one of your people, Kaleef, is dead and the contact he was meant to meet in the tunnels under the river demands to see you. She wants to get out of Menaphos.",
    "She wanted you to come in person.",
    "What's the deal between yourself and the Menaphites?",
    "Wow, that's impressive, seeing as you don't have much of an army.",
    "So you're at peace now?",
    "You owe me a favour. I rescued Prince Ali for you.",
    "As you probably know, Sophanem is under quarantine at the moment because of the outbreak of plagues.",
    "The plagues aren't contagious so this seems a little pointless. The high priest in the town wants me to open the town up again. Unfortunately, Menaphos has shut its doors to everyone and many of the essential townsfolk who were in Menaphos when the plague first broke out are uncontactable.",
    "Hmmm...let me think on that for a second.",
    "It must be boring here, just standing around Al Kharid. Wouldn't it get your blood flowing again if you were to venture down to Sophanem?",
    "There might be treasures underneath Sophanem.",
    "Like what?",
    "His name rings a bell.",
    "Sorry, no.",
    "I have it, if Al Kharid were to help Sophanem with its troublesome neighbour Menaphos, it could drive a wedge between the two cities.",
    "It would get you the chance to spy on the Menaphites first hand.",
    "I want to talk to you about Sophanem.",
    "There you are.",
    "Why don't we just walk through the city gates?",
    "Neither. Why?",
    "Okay, so maybe it wasn't one of my better ideas.",
    "You could try a disguise.",
    "I know of a secret entrance to the north. The Devourer showed it to me when I first arrived in these parts.",
    "There's a tunnel near the encampment to the north-east. Look for a clump of rocks... it's through there.",
    "What if you're spotted in the town or you injure yourself down in the maze?",
    "But there's...",
    "Fair enough.",
    "*Yawns* Osman's been gone for hours. I think I should look for him.",
    "Hello, Jex.",
    "Are you okay?",
    "I'll keep my eyes peeled for suspicious looking characters.",
    "Who?",
    "I'll keep an eye out for him.",
    "Could you tell me more about the minor gods?",
    "Could you tell me more about Scabaras?",
    "Are you claiming I've been misinformed?",
    "Such as?",
    "I'm not sure whether I should thank you for that bit of confusion or add to that bump on your head. Could you tell me more about the minor gods?",
    "Could you tell me more about Het?",
    "What does his patronage cover?",
    "Could you tell me more about Het's influence over the desert?",
    "Sounds like every knight I've ever known",
    "So, you feel that Het has turned his back on your people?",
    "Could you tell me more about Het's followers?",
    "Could you tell me more about the minor gods?",
    "Could you tell me more about Crondis?",
    "That must be awkward when buying helmets.",
    "What kind of people follow her?",
    "How so?",
    "Why?",
    "Could you tell me more about Crondis's influence?",
    "I'm confused. What do you mean?",
    "Could you tell me more about the minor gods?",
    "Could you tell me more about Apmeken?",
    "I'm guessing I shouldn't trust you, then?",
    "Well, that's good to know. I presume she looks slightly inhuman?",
    "I see. Jex, I can't help notice that you're speaking in the past tense.",
    "That's interesting, Jex; can I ask you some more questions about her?",
    "Could you tell me more about Apmeken's connection with monkeys?",
    "Could you tell me more about Apmeken's followers?",
    "Could you tell me more about Apmeken's influence over the desert?",
    "Could you tell me more about the minor gods?",
    "Goodbye, Jex.",
    "Why is your temple still in such a state?",
    "I thought you were a priest of Icthlarin?",
    "What would it take to repair this temple, then? Money? Materials? Manpower?",
    "I'm sure you'll think of something; you'll be able to count on me when you do",
    "Goodbye, Jex.",
    "Osman! Nooo!",
    "Rescuing your ungrateful hide!",
    "Your two hours ran out a long time ago. Where did you disappear off to during the fight?",
    "So you're not going to say 'thank you' or anything?",
    "I'd say so; it managed to pierce that bug's shell.",
    "He stabbed the bug in the back!",
    "What?",
    "Greetings, cleric.",
    "No problem; I had some outside help.",
    "Greetings, cleric. Hello, cleric. Might I impose upon your time?",
    "Is it okay if I pray at your altar?",
    "Thanks, you've a very enlightened approach to this.",
    "How are things?",
    "That's good to hear! I'll make sure I visit a couple of them. Have you been trading more with Al Kharid, seeing as Menaphos still has its doors closed to you?",
    "Do you have any quests for me?",
    "Any word from Menaphos and the slaves?",
    "Could I have another lamp?",
    "Hi. Are you one of the returned townspeople?",
    "I guess so.",
    "I would like to buy some of your produce.",
    "Why were you stuck in Menaphos?",
    "So the guards wouldn't let you back?",
    "What happened then?",
    "That must have been scary.",
    "If the revolt was stamped out, why are the gates not open?",
    "Yes, please.",
    "No, thanks.",
    "It was nice to meet you.",
    "Hi. Are you one of the returned townspeople?",
    "I guess so.",
    "I'd like to shop, please.",
    "How is business?",
    "Any tasks for me that you can think of?",
    "Goodbye for now.",
    "I'll not get through these gates; they're too heavily boarded up! ...And these walls don't look very climbable at all.",
    "How is business?",
    "Are you with the Bank of RuneScape? [Appears after previous option]",
    "I'd like to access my bank account, please.",
    "I'd like to check my PIN setttings.",
    "I'd like to see my Collection box.",
    "Are you one of the returned citizens?",
    "That would be me. Now, can you help me?",
    "You know what would be brilliant?",
    "Could you make some granite armour or alter granite armour to better fit me?",
    "Should I come back soon, then?",
    "Hi.",
    "You seem to be fairly happy for someone so spotty.",
    "I didn't think that a spice store would eat up so much time.",
    "Any leasds?",
    "It was nothing. I had some outside help.",
    "Hi."
  ],
  "Coenus": [
    "Halt! Don't take another step.",
    "Don't try my patience! I have been ordered to prevent anyone attempting to cross this bridge.",
    "Step back or we will open fire.",
    "Archers, take your mark.",
    "Take aim!",
    "Fire!"
  ],
  "Jex": [
    "What can I do for you?",
    "I know bits and pieces about its history. I help maintain this place and even held services until recently. Please excuse its current sorry state.",
    "Some strange scarab creatures burst up from the cellars a few months ago. We fought them back into some kind of dungeon but, in doing so, the temple and the bank beneath were devastated.",
    "I wouldn't, if I were you. It's incredibly dangerous down there. We've lost far too many townsfolk already who underestimated the dangers. There are some fearsome traps and vicious monsters lurking in the darkness.",
    "If you must, then I bestow the blessing of Icthlarin and the minor deities upon you. Climb down the ladder in the corner of the temple. This will leave you in the wrecked bank. We've posted a number of guards there to hold back the scarab monsters. There is a barricaded trapdoor there that is a little complicated to open.",
    "It's dark down there; you should really take a torch or some king of light source along with you – that and a tinderbox in case it goes out.",
    "How's your investigation going?",
    "If you have any sense you wouldn't go down there but I can see you're determined to give it a go. Be sure to bring a light source and a tinderbox or you may suffer a grisly fate.",
    "Huh?!",
    "Hello, [Player]. – Jex rubs his head tenderly. –",
    "Some degenerate clubbed me and gave me a limp the size of an egg on the back of my head.",
    "I have a fairly good idea who did it.",
    "That linen merchant, Samun; he's never liked me.",
    "I think you'll have gathered most of the relevant details from elsewhere, but general knowledge isn't always the most accurate.",
    "Not really; there are simply details of Scabaras' fall from grace that are only known to we priests.",
    "Some of his supposed faults can be forgiven. I just can't explain why at the moment.",
    "Het is the least strange looking of our deities to foreign eyes; he looks just like us. I suspect this is why his shrines are particularly targetted by the infamous Templeton.",
    "He is the very incarnation of health and strength in both mind and body.",
    "When I was young, I thought of Het as a strong virtuous knight: brave, daring, and, perhaps, just a little dim.",
    "But, as I grow older, I'm not so sure. It is clear that Het's influence is felt all over the desert; his strength can be felt on the serrated edges of the Menaphites' blades. His nerve is in the tip of every spear wielded by the soldiers of Al Kharid. He fortifies each steel cuff that constrains a slave. He is the very tug in the river Elid that drags many to their deaths. Yet, we have enfeebled slaves and weakened villages. Even in this very city there is a plague sapping us of our strength.",
    "No, I wouldn't say that. We mortals are too quick to blame our problems on the gods. Without weakness there is no strength, after all.",
    "Het originated in the north, so he is worshipped fervently by the people of Al Kharid; however, he is a popular god across the desert - his powerful image of strength and health make him a popular god amongst soldiers and leaders.",
    "Crondis is a ferocious lady with the head of a mighty crocodile.",
    "Enough flippancy: remember she is a deity, and this is her place of power.",
    "She embodies modesty, diligence and resourcefulness, so Crondis is worshipped by the desert's subsistence farmers and hunters. Conversely, she proves unpopular amongst society's elite.",
    "Crondis teaches that people should take no more than they need and make do with little, which, as you can imagine, conflicts with the values of many in the richer echelons of society. In Menaphos, she is particularly frowned upon, although that is hardly surprising.",
    "The Pharaoh of Menaphos is a greedy, cruel man whose lack of restraint is beyond even Crondis's help. Excuse me, I should not have spoken that way. It is unwise to speak ill of one's betters.",
    "Crondis hopes to inspire resourcefulness and unassuming modesty. While this has always been her goal, her methods vary more than most.",
    "Crondis may save a struggling harvest by bursting the clouds, or she might set swarms of locusts upon a bountyful crop to stop complacency.",
    "Apmeken was the most mischievous, playful and unpredictable of the minor deities. My personal favourite, in fact.",
    "While Apmeken was mischievous, she was also a goddess of friendship. Like her, I may trip you, but I'd catch you before you fell.",
    "She had the head of a monkey, ape or baboon, depending on the nature she was displaying at the time. The monkey was skillful, the ape was wise and the baboon was comical.",
    "Ah, sorry, yes. I'm of the opinion - and it's an opinion not shared by many, I should add - that Apmeken has moved on from these lands. I've read reams of scripture detailing Apmeken, and heard endless tales of her deeds. I can't believe that the desert would be such a warring, sombre, plague-filled place if she was still felt here.",
    "Of course.",
    "Apmeken was once a monkey. Many people believe that the native monkeys embodied her very spirit. They were her most beloved supporters. There hasn't been any wild monkeys in the desert for a long time – not since I was a child. I'm afraid that the lack of monkeys living here is only further proof that Apmeken has indeed moved on.",
    "Apmeken is worshipped by those who value the community and friendship above everything else: mothers, priests and even politicians. Apmeken originated in the west, in the space between two warring tribes, and it is there she found most of her support.",
    "Apmeken's influence was subtle but incredible, she was an infectious laugh, a jaunty jig, a joke you've heard a hundred times before, but still chuckle at. It may not sound like much, but these subtleties have been known to avert wars and make enemies set aside their differences.",
    "Goodbye. May the gods be with you.",
    "The minor gods aren't particularly revered in our fine city. Icthlarin holds sway here and, although a fine deity indeed, he's not the most jolly of sorts.",
    "Well, yes and no. I am primarily a priest of Icthlarin, certainly, but I have been trained in the rites of the minor gods as well.",
    "I'm not really sure, to be honest. Most of the natural worshippers are in Menaphos; of course, and the local economy is rather depressed. In addition, that Templeton rogue made off with some of the damaged stonework. We should hunt him down like the jackal he is.",
    "Goodbye. May the gods be with you."
  ],
  "Bank guard [1]": [
    "How can I help you?",
    "We're guarding this place to make sure that nothing comes up from that trap door and that nobody unnecessarily goes down there.",
    "The nastiest creatures imaginable!",
    "Rumour has it they may be connected to the ancient Sect of Scabaras!",
    "Too many people have died down there for us not to take action.",
    "When we were first posted down here we had a look down there and only just escaped with our lives.",
    "Sorry to be rude, but we really need to get back to guarding the door. The scarab beasts might come back at any time.",
    "I do, but I'd like to hold on to it for now.",
    "Oh, the plague of spots. Well, I wasn't here when the outbreak took place. We were out of town trying to catch an antiques thief called Simon Templeton.",
    "Sophanem is my home town so it would take a lot more than the threat of a few spots to keep me away.",
    "This is the remains of the Sophanem Bank.",
    "Some time back, these scarab creatures started coming up from the basement. We fought them off, but they kept coming and coming and eventually destroyed the place. We've now fought them back again and barricaded the trap door.",
    "You should take some food down with you in case you get hurt!",
    "Watch out for the traps!"
  ],
  "Bank guard [2]": [
    "They seem to be a cross between humans and scarabs.",
    "Little, aside from the odd fairy tale from childhood.",
    "There are fiendish traps and ghastly scarab monsters down there.",
    "Be careful down there!",
    "It really is incredibly dangerous down there!",
    "I wouldn't take many valuables down there the first time I went, just in case something bad happened.",
    "If you see a scarab on any of the walls, stay well away from it!",
    "I saw one of the other bank guards disappear down the trapdoor when he approached it and we never saw him again!"
  ],
  "Maisa": [
    "You're not Kaleef!",
    "Who? I mean what?",
    "Nooooo!",
    "Curse you, Osman! I'm so sick of this posting. I just want to go home.",
    "No, I hardly knew him. He was meant to tell me how to get out of Menaphos; now that he's dead, I'm stuck here.",
    "How could we do that?",
    "Do you know Osman? Are you a friend of Al Kharid?",
    "If you are who you say you are, tell me where it was you first ran into the prince and his kidnappers.",
    "Fair enough. Who helped you find the prince?",
    "I'm sorry I doubted you. Bring Osman here and I'll tell the Sophanites to return.",
    "Just make sure he comes down in person. Don't let him send another one of his people; you saw what happened to the last one.",
    "Have you brought Osman?",
    "I'll talk to Osman first, then I'll look after the Spohanites.",
    "Okay, will do. What's going on, Osman? It feels like the ground is shaking.",
    "There definitely is something going on!"
  ],
  "Osman": [
    "My help is needed all over the place. What makes you suggest that I'm more urgently needed in Sophanem?",
    "You must be mistaken. She's in Menaphos and that city is locked tight to everyone, thanks in no small part to me.",
    "Maisa? Why are you in contact with her? You are under orders to not act as a spy in Menaphos!",
    "Just as well - you could have messed up my plans in Menaphos.",
    "Nothing out of the ordinary. I've had my people instigate a bit of civil unrest. Officially our cities may be at peace, but I have some old scores to settle first.",
    "Ah, Maisa, a great talent but far too highly strung. I should have known. I'll send down one of my people to sort her out shortly.",
    "I can't do that; that would be tantamount to sticking one's head in a crocodile's mouth. I would be lynched on sight if I were to be found.",
    "Our two kingdoms were at war with one another for centuries. They tried to expand their kingdom northwards many times over the years, but we held them off.",
    "The desert is a great equalizer. It's very difficult to move large armies about in it, particularly if you don't have ready access to water.",
    "Technically, yes, but that doesn't mean that bad blood will instantly run good. As spymaster of Al Kharid, I've been responsible for many a dark deed. The Menaphites would find it difficult not to try to punish me or extract certain delicate information out of me if I managed to fall into their arms. So, I'd need a very very good reason to go there.",
    "I owe you nothing for that. You were well rewarded for your services. What exactly are you up to, anyway?",
    "Yes, yes, but what are you doing?",
    "So, you've agreed with Maisa to get these people to return to Sophanem? What makes you think that I'll aid you with helping the old enemy?",
    "I'm perfectly happy here in Al Kharid. I've done all the adventuring I ever wanted to do in my youth. You'll have to come up with a much better idea than that to convince me to go there.",
    "That there might be, but, if there is, it belongs to the dead. Bad things happen to those who steal from them.",
    "Do you know Simon Templeton?",
    "Well, that particular grave robber is stuck out in the desert with no real hope of escape because of his greed. So you'd better come up with a much better reason to get me to go to Sophanem.",
    "Well, whatever or which, you'll need a better reason for me to leave here.",
    "I think you may be on to something. Leverage... I like that. I have one or two things to sort here before I depart. I'll meet you close to Sophanem shortly.",
    "I have Maisa and others in place to do that already. So you'd better come up with a much better reason to get me to go to Sophanem.",
    "I have one or two things to sort here before I depart. I'll meet you close to Sophanem shortly.",
    "I couldn't find a way in; I'm getting too old for scaling city walls.",
    "Are you mad or stupid?",
    "I'm sure to be recognised; we'd then have to fight our way through the town. Any hopes that we had for the truce between our cultures would then be as dead as the guards.",
    "Have any other bright ideas?",
    "Hmm... I like the sounds of that...but no, it's still too risky. I can't jeopardise the truce by being caught here. Have any other bright ideas?",
    "Perfect! Where is it?",
    "Wait for me here, there's no point in both of us risking our necks getting seen together.",
    "Don't worry about me. I've been in Sophanem more times than I'd care for and, besides, I'm not a spymaster for nothing.",
    "Give me two hours. If I'm not back by then, come and look for me.",
    "Psst!",
    "...and whatever you do, don't risk giving yourself away when you tell the Sophanites to return.",
    "It's nothing. Your nerves are probably just shot. Losing Kaleef was tough on us all.",
    "Get out of here quick before the cave collapses!",
    "[Player], what are you doing here!",
    "I had everything under control here. Besides, I thought we agreed that you would wait upstairs for me?",
    "I didn't go anywhere. I decided to blend into the shadows, just one of the many tricks I've picked up over the years.",
    "Nah, but I do recommend you pick up Kaleef's dagger. I can assure you it packs some punch.",
    "It's good to see he went out fighting.",
    "Indeed, I'm glad he took on board some of my teaching. Well then, [Player], my business is done here so I'll be off. One more thing.",
    "Thanks."
  ],
  "Nathifa": [
    "Why, yes. You must be the brave adventurer that Maisa told us was seeking our return.",
    "Well, it all started the day that the plagues broke out here. I had gone into Menaphos in the morning to get some flour and chocolate powder and, when it came time for me to return, the gates were shut.",
    "No, not at first. I actually didn't want to return. I didn't want to come down with the plagues so I stayed.",
    "Well, word must have travelled back to the slaves that their fellow slaves in Sophanem no longer had to work and so they rioted.",
    "It was, but Coenus, chief gate keeper of the city, stamped the revolt down fairly fast... and quite brutally.",
    "No, it was only stopped in the imperial and merchant quarters of the city. There is still trouble in the slums and in parts of the docks. Now, if you wouldn't mind, I'd rather not dwell any further on the past. Can I interest you in my goods?"
  ],
  "Jamila": [
    "Why, yes. You must be the adventurer Maisa told us about.",
    "Slow at the moment, so slow. Maybe time will make things better.",
    "I have no plans that would require your mighty services... at least, not yet."
  ],
  "Menaphite Guard": [
    "That's right, clear off. You're not welcome here!"
  ],
  "Banker": [
    "And what can the Sophanem Bank do for you today?",
    "It could be better. The businesses here still have not recovered from their relocation. Personal banking like yours makes up the majority of our trade. Was there anything else with which I can help you?"
  ],
  "Stonemason": [
    "Why, yes. You must be the adventurer who Maisa talked to us about?",
    "Probably not; I'm a stone mason and have little to offer an adventurer.",
    "I don't know.",
    "I'm afraid I can't do that, sorry. In the blazing desert sun, granite armour isn't very popular so I haven't had any experience of working with it. Once the place is a bit less chaotic, however, I will try to think of ways you adventurers can help. Who knows what I'll come up with.",
    "I wouldn't hold my breath. I'm thinking it will be months before I have work for you rather than a few days."
  ],
  "Embalmer": [
    "Hello.",
    "I'd nearly forgotten about those; running my spice stall has taken my mind off the plagues.",
    "Well, I'm trying to find a balm for our spots.",
    "I got some cream from a merchant in Al Kharid that was meant to help but all it seems to do is repel insects. Anyway, I'm rambling. You're here to buy something, not to chat."
  ],
  "Priest": [
    "Good day, [Player]. On behalf of the town, I would like to thank you for your help.",
    "I doubt it. Nobody from outside got past here. There's no need to be modest. Don't let us keep you waiting. I'm sure you've got plenty of other important questing to get on with."
  ],
  "Sophanem Guard": [
    "Move along, move along, nothing to see here.",
    "Sorry. I can't chat while I'm on duty, have to keep alert."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Contact!?oldid=33514515’"
  ]
}