{
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "If you don't already have the required items. A few dialogue options.You can discuss this issue on the talk page or edit this page to improve it."
  ],
  "Player": [
    "Hello. Lovely day, isn't it?",
    "What's the rush?",
    "Gosh, I didn't know there were any trolls around here.",
    "Do you need any help?",
    "You've been... reading stories about adventurers?",
    "... fair enough, I suppose! Anyway, you think you need an adventurer?",
    "I'm a brave adventurer! Can I try?",
    "Oh goody, I love rewards! Now, how can I help?",
    "Expert adventurer? I'll wager I've had more adventures than you've had pickled gherkins!",
    "Expert adventurer? I'll have you know I'm in the Guild of Legends!",
    "...",
    "... this better be good...",
    "Him? What in the heck do you want with HIM?",
    "Yes! He's mad! You know he smashed his way into a bank and stole a load of stuff?",
    "And you want me to fetch this Wise Old Man?",
    "Right... so you want me to fetch this old man who used to be a great adventurer.",
    "I'll leave you to it, then.",
    "Would you like to go on a quest? [the others are normal character dialogue]",
    "Well, someone's asking for you help now.",
    "Herman Caranos of the Piscatoris Fishing Colony thinks he needs you to save his colony from a tribe of attacking sea trolls.",
    "Well, it's just one man who smells of fish, not exactly the whole world...",
    "... yawn...",
    "If you're not feeling up to it, I'll leave you alone.",
    "Swan song?",
    "You're going to sing a song and then snuff it? Maybe I should tell Herman you've flipped...",
    "Great. So long as you're not going to sing.",
    "Oh yes? What do you want?",
    "[if you already have them with you] I just happen to have those with me!",
    "Sometimes I amaze even myself.",
    "[if you don't have them with you]",
    "Here you go...",
    "Oh - er- good. Well, Herman must be inside the Colony now, so we should probably go in.",
    "I'm ready to fight.",
    "I should go and get ready first.",
    "Yes, we're both still alive.",
    "Thanks I'll go there now.",
    "Talking of gratitude, I believe you mentioned some kind of reward...",
    "Ok, I help out, then I get a reward?",
    "Herman said you wanted a hand with something.",
    "Oh yes, I'm quite an expert.",
    "Won't iron go all rusty with all the salt water around here?",
    "Alrighty. So where do I get sheets of iron?",
    "Why do I need to heat the bars? I've been cold-working metal all my life, and I've never bothered heating it.",
    "I guess I'm just talented.",
    "I've fixed all 5 bits of wall.",
    "This is turning into a lot of work...",
    "Yes... Herman said you needed me to do something?",
    "Riiiiight...",
    "You want me to catch fish?",
    "Where do I get fresh fish?",
    "Ok, five fresh monkfish coming up.",
    "Arnold, I've got some monkfish for you.",
    "Oh good, maybe he'll reward me now.",
    "I've finished helping Franklin and Arnold now.",
    "Does this mean you're going to reward me now?",
    "There always is.",
    "Well, that sounds like a nice plan. One big fight, no more trolls.",
    "Let me guess - you haven't got any forces to gather!",
    "???",
    "Ok, so I just need to go see Wizard Frumscone in Yanille?",
    "Hello. I need your help with something...",
    "The Piscatoris Fishing Colony, somewhere north of the Gnome Stronghold, is under attack by sea trolls, and they've sent me to ask for an army.",
    "They said you might lend us some of your zombies.",
    "So you can't help the Colony?",
    "So what should I tell the Colony? They've got to give up all their work because you won't help?",
    "Yes?",
    "Great! Is he a Guild wizard too?",
    "Necromancy? I don't want anything to do with that!",
    "I don't know if I still want to do this.",
    "Enough of this - I'm off.",
    "I'll see what the necromancer needs me to do.",
    "Can't I ask a different necromancer? There's one not so far away.",
    "I need help with saving a fishing colony. [all other options are normal character dialogue]",
    "... um... The Piscatoris Fishing Colony needs an army to defend them against attacking trolls.",
    "... um... pretty please?",
    "... um... thanks, I think...",
    "I'm not going to have to do anything... evil, am I?",
    "Alright - what do you need?",
    "[if you already have the bones] I have some here!",
    "[if you don't have them with you]",
    "What should I do now for the quest?",
    "What had you in mind?",
    "Can you tell me anything about transporting bone seeds?",
    "A necromancer is going to bind the essence of an undead army into some bone seeds for me if I can get a container to carry them in.",
    "Can you tell me anything about transporting bone seeds?",
    "But do you know what I should carry them in?",
    "Yes, a woman called Tassie taught me.",
    "Yes, yes, very nice. So if I get a pot with a lid, I'll be able to carry bone seeds safely in it?",
    "...",
    "I've spoken to the master crafter about a container for transporting bone seeds.",
    "[if you have it] Yes, I have it here.",
    "... um... Thanks!",
    "Thank you. So what do I do with them?",
    "Suppose I - ahem - need another one later?",
    "Hello, old man.",
    "Yes, I've got it here!",
    "The army's in this pot!",
    "No, really, the wizard told me he'd put bone seeds in this pot, and when I opened it the army would come forth from the bone seeds.",
    "Oh... um...",
    "Well... it wasn't exactly...",
    "Aren't you going to do the fighting?",
    "I'm ready. Let's fight!",
    "I'd like to get some stuff together first.",
    "The trolls are dead!",
    "Oh dear...",
    "How did you do that?",
    "Now I've killed that THING, Herman's sure to reward me!",
    "I've defeated the Sea Troll Queen!",
    "Well, you mentioned something about a reward?",
    "Ooh, goody! Thanks, old man! Um... can I have your hat?",
    "Aww, cheer up - we won! But can I have your hat as my reward?",
    "So that's the end of your adventuring? Also, how about that hat of yours?",
    "It's been... nice working with you! It'd be even nicer if you'd give me that hat...",
    "HE DIDN'T GIVE ME HIS HAT!",
    "!!!",
    "Anyway, you were going to reward me too?",
    "Why is it better to fish here than in Catherby or the Fishing Guild?",
    "Ok, so I can catch monkfish. Um... thanks?!",
    "I suppose that could be useful.",
    "Maybe if I ever want to do glassblowing again...",
    "Thank you very much!"
  ],
  "Herman Caranos": [
    "Lovely? Oh - er - if you say so. But please excuse me, I really don't have time to chat about the weather.",
    "Trolls! They're attacking my fishing Colony!",
    "These are a sort of sea-dwelling troll. They feed on the monkfish that live in this part of the sea, but just recently they've started invading my Colony!",
    "Well yes, I do. I've done some research about this, and I think our best hope is to get hold of an experienced adventurer.",
    "In all the legends I've read, brave adventurers have no trouble vanquishing whatever monsters are menacing the helpless settlement.",
    "Yes, I've done my research very carefully. I've always made important decisions based on careful analysis of whatever documents are available to me on the topic. For example, I chose this site for my Fishing Colony because",
    "records show this part of the sea to be a prime site for catching monkfish. I don't just fumble along like an amateur!",
    "Yes, that's right. A brave adventurer with plenty of experience in this sort of work. [back to dialogue options]",
    "You? I hadn't thought of that... let's have a look at you...",
    "Hmmm... You're not what I'm looking for, but... [number of quest points you have] Quest Points is really rather a lot...",
    "Ok, the Piscatoris Fishing Colony gratefully accepts your offer of help. When the Colony is safe you shall be handsomely rewarded.",
    "Well, as qualified as you undoubtable are, I believe we're going to need a truly expert adventurer if the Colony is to stand a chance.",
    "If you could just stop blowing your own trumpet for a minute...",
    "Excellent! Now, in far-away Misthalin there lives one of the greatest adventurers of all time.",
    "His name is lost in the mists of time, but you shouldn't have much trouble finding the Wise Old Man of Draynor Village.",
    "Oh, do you know him?",
    "Ah well, we must forgive him his little foibles.",
    "You don't sound convinced. Look, I'll tell you what I've read about him...",
    "Yes, that's right. And do watch out for the sea trolls! [ends dialogue]",
    "Fine, fine. [ends dialogue]",
    "Finally you've arrived! Did you bring the Wise Old Man? [the Wise Old Man teleports in]",
    "Excellent! You have no idea how grateful I am!",
    "Reward? Well... we've got to discuss the Colony's defences now. Perhaps you could go and make yourself useful around the Colony? I'm sure my brother, Franklin, could do with a bit of help. Arnold, the storemaster, said he",
    "needed an extra pair of hands too. He's in one of the big storage sheds.",
    "Yes, yes... now please excuse us.",
    "Or - er - that's good...",
    "There's something else I need you to do first.",
    "Well, the Wise Old Man and I have discussed the situation, and he's come up with a plan...",
    "There's a slight problem, though.",
    "I sent most of the colonists away for their own safety when the trolls started attacking the Colony.",
    "Yes, please hurry!",
    "[Player] - have you brought an army?",
    "You've got what?",
    "Have you been drinking?",
    "You can talk about that later! Now we've got an army we can get on with beating the trolls!",
    "Come back to us as soon as you're ready.",
    "[Player], how can I ever thank you? You have saved my Fishing Colony from utter destruction!",
    "Of course, of course!",
    "Oh, he's gone. I hope he enjoys his retirement.",
    "It's only a hat!",
    "Oh yes, of course! You are hereby welcome to visit the Piscatoris Fishing Colony at any time and make full use of our fishing spots!",
    "Ah, I'm glad you asked that! You see, this is the only known place where you can catch monkfish!",
    "Yes - there's good eating on a monkfish. They heal more health than the swordfish and lobsters most adventurers carry around, but they're easier to catch than sharks.",
    "Indeed! I'm sure Arnold will help you send your monkfish to your bank account. Also, seaweed accumulates in the nets down by the shore, which you might find useful. Franklin says it's much quicker than trying to gather it on Entrana.",
    "Finally, I'd like to give you a little token of my thanks.",
    "No, thank YOU!"
  ],
  "Wise Old Man": [
    "Greetings, [Player].",
    "Heh heh! I used to go on lots of adventures, but that was all quite a long time ago. I haven't been on what you'd call a 'quest' for a while.",
    "What exactly had you in mind?",
    "Hmmm... so I haven't been forgotten... and the world once again is calling for my aid...",
    "... yet this could be the opportunity I've been waiting for...",
    "... but I'm a lot older than I used to be. Do I still have the strength? Should I retire now, or can I do just one more quest?",
    "Yes, I'll do it! This can be my final adventure, my last great quest. Saving this colony shall be my swan song.",
    "Legend tells us that a swan, before it dies, sings a song of outstanding beauty as a fitting conclusion to its graceful life. This adventure will be my swan song.",
    "No, you ignoramus! I shall bring my adventuring days to a dramatic close by saving this colony!",
    "Yes, that's right, I'm not going to sing. Anyway, I shall need some supplies from you.",
    "I'm rather short of runes. If you could fetch me 5 Blood runes, 10 Lava runes and 10 Mist runes, I'll be able to set off.",
    "Gosh, you're very efficient!",
    "Ok, hand 'em over. [continue to next section]",
    "Excellent. I'll see you outside the Colony. Don't forget to arm yourself - it could be dangerous! [ends dialogue. he teleports away]",
    "Hello again, [Player]! I must thank you for persuading me to come - I feel quite invigorated in the sea breeze!",
    "Are you sure you're ready? I can hear creatures moving around in the trees, and we might have to do some fighting soon.",
    "Excellent. I think this little tunnel will lead us there.",
    "Yes, better safe than sorry! We can go through this little tunnel when you're ready. [ends dialogue]",
    "Wait I think something's coming! [7 sea trolls come up and attack]",
    "First fight, talk later! (May be wrong)",
    "Well, it all seems to have gone smoothly so far!",
    "Please go and tell Herman I'm here. Someone's sure to know where to find him. [he teleports away]",
    "Indeed, I am here!",
    "Yes, that's right. The sheer number of trolls means that the best hope for the Colony is to gather our forces and wipe out all the trolls at once.",
    "Yes, with the bit about gathering our forces.",
    "So what you need to do, [Player], is to fetch us an army!",
    "In the Wizards' Guild in Yanille, Wizard Frumscone always seems to have a limitless supply of zombies and similar creatures. If you can persuade him to lend us an army, we should be able to defeat these trolls.",
    "Hello, [Player].",
    "Frumscone gave you bone seeds?",
    "Hmmmph. I don't much like the sound of this. I certainly won't be sending anyone to Frumscone for help again!",
    "Well, I suppose so. [Player], this could be VERY dangerous. Do you feel ready to fight?",
    "Yes, of course. But you, my trusty sidekick, are in this adventure with me, and if I'm going forth into battle, you should make sure you're ready too.",
    "Good. May this, my final adventure, end well! [ends dialogue and starts cutscene]",
    "They weren't very tough.",
    "Ahaha, that was fun.",
    "I can't move. You must fight this one!",
    "Your fight was truly magnificent, [Player]! Congratulations!",
    "I think you've earned a little something from me, too.",
    "'Old man'... yes, I am old. That creature nearly killed me - I have never been so close to defeat.",
    "Yes, we won... YOU won... It is definitely time I retired.",
    "Well, I'm sure I'll find some way to keep myself busy. But yes, this has been my last quest. My swan song.",
    "It's been a pleasure working with you too. Do pop in to see me in Draynor soon! I leave you with my blessing... [he teleports away]"
  ],
  "Franklin Caranos": [
    "Ah, [Player]! Herman told me to expect you. You'll find him in his office by the eastern wall of the Colony.",
    "Well, yes, I do. Are you any good at smithing?",
    "Ok, we'll see. Now, the trolls managed to smash part of our western wall earlier today. We need 5 sheets of iron to patch it.",
    "Yes, but it'll do for a few weeks, and we haven't the time or materials to do a proper job just now.",
    "I've got a press in my shred. You can use it to heat up some iron bars and roll them into sheets. You'll need to fill its firebox first - stick some logs in it and light them.",
    "When you've got 5 iron sheets, hammer them onto the damage wall.",
    "How odd! I'd have expected all your products to be horrible brittle.",
    "Anyway, off you go.",
    "How are you getting on?",
    "Wonderful - thank you very much! Now you can turn your full attention to help Arnold...",
    "Oh, and if you've got any of those iron sheets left, I'll be happy to buy them off you once the Colony is safe."
  ],
  "Arnold Lydspor": [
    "You come to speak to me, [Player]?",
    "Ah, that is good. I the storemaster am for this Piscatoris Fishing Colony, and our stores are - ahah - not so good. Indeed, our stores contain not a bit of food!",
    "This a catastrophe may become, as difficult it may be to fish while the trolls outside are waiting, and our bellies soon shall rumble loudly!",
    "But now you come here to help Arnold! A good and sturdy warrior you must be indeed to have entered our Colony in these times! So you can the fishing do for us!",
    "Ja, this is so. But the fish must then be stored, or stinking rotten they become! So the fish you bring must be shiny fresh!",
    "The monkfish in these waters swim, this is why Herr Caranos build his Colony here.",
    "You go catch 5 fresh monkfish from sea over in north-west corner. If you bring stinking old monkfish, Arnold know about it, and Arnold not take them!",
    "Big thanks, [Player]. When Colony safe, Herman reward you good.",
    "This is superb, [Player]! Now I store these carefully, and you go tell Herr Caranos."
  ],
  "Wizard Frumscone": [
    "Do you like my magic Zombies? Feel free to kill them, there's plenty more where these came from!",
    "Oho? Very well, young [man/lady], what can I do for you?",
    "An army, heh? But I haven't GOT an army!",
    "What? This is a combat training facility, not a library! My magic zombies are not for loan.",
    "I'm jolly well not lending them an army! If I did that for you, I'd have to do that for everyone, and I'd never get a moment's peace again!",
    "Actually that does seem rather harsh...",
    "I have an idea!",
    "Now, you mustn't breathe a word of this to Zavistic or Disentor upstairs, but I know a man who could help you get an army.",
    "No, his work is completely different. He's a necromancer.",
    "He's not going to have you doing any of the actual spellcasting for it. You'll probably just have to collect some weird item from him and take it to the Colony.",
    "If you don't want to continue the quest, just walk away and think no more about it. But I'm sure you won't have to do anything evil or unnatural yourself.",
    "So what's it to be?",
    "Understandable. But if you ever change your mind, just come and ask me. [ends dialogue. you'll have to restart the whole conversation]",
    "Excellent. His name's Malignius Mortifer. You'll find him somewhere south of Falador.",
    "Hah! Necromancers aren't helpful people. I don't know of many - most guild wizards won't have anything to do with their practices. I think Malignius will help only because he loves showing off his powers. [ends dialogue]"
  ],
  "Malignius Mortifer": [
    "So, [Player], your curiosity leads you to speak to me?",
    "Hahaha! You want MY help? HAHAHA!",
    "And of all the people in the world, you came to ask ME? HAHAHA!",
    "Oh, I'll help! I'll give you GOOD help!",
    "An army, eh? I can raise you a lovely army of the undead skeletal magi! That'd be just right, wouldn't it?",
    "No, I'll keep the fun bits for myself. You'll just have to get a few things for me.",
    "Firstly, I need 7 bones, the normal sort you get from people and small monsters.",
    "Hah! And I thought only necromancers and jogres carried bones around with them! Very well, hand 'em over. [continue to next section]",
    "From the bones you have given me, I shall make bone seeds. These will contain the essence of your army. But you will need some way to carry the seeds.",
    "You must go to the Crafting Guild to ask the advice of the master crafters. There are quite a few of them there, and one of them's sure to help.",
    "Ah, excellent. HAHAHA! Have you got such a container?",
    "I have raised you an army and bound them into bone seeds for you!",
    "Don't mention it, it was fun! HAHAHA!",
    "Now I will seal the seeds into your pot.",
    "Take the pot to the Colony and open it! HAHAHA! Just don't open it before you get there.",
    "Bring me another of these pots with a lid and I will give you more bone seeds.",
    "HAHAHA!"
  ],
  "Master Crafter": [
    "Hello, and welcome to the Crafting Guild. Accomplished crafters from all over the land come here to use our top notch workshops.",
    "Bone seeds? What are bone seeds?",
    "That's horrible - ask someone else!",
    "Yeah?",
    "Woah dude! That's, like, some seriously maximum stuff you're talking.",
    "Yeah, you just need a pot with a lid. Do you know how to make pot lids?",
    "Tassie Slipcast? She's one groovy lady.",
    "Yeah, yeah. You need to chill out more, dude."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Swan_Song?oldid=35972652’"
  ]
}