{
  "Sanfew": [
    "What can I do for you young 'un?",
    "Ah, you've come just in time. I need a certain herb for the next part of the purification ritual... It used to be quite common, but nowadays only the trolls know where to find it. They use it in their cooking, you see. It's a very prized ingredient.",
    "Journey to the north into the land of the trolls, and find the secret of the herb the trolls call 'goutweed'. My friend Eadgar lives in the area, and he may be able to help you. Bring some goutweed back and I will teach you something useful.",
    "Oh well. No doubt some other adventurer will eventually come who can help me.",
    "Thank you, adventurer!",
    "Well, we all make mistakes sometimes.",
    "What can I do for you young 'un?",
    "I've told you already. Journey to the north into the land of the trolls, and find the secret of the herb the trolls call goutweed. My friend Eadgar lives in the area, and he may be able to help you. Bring some goutweed back and I will teach you something useful.",
    "Now why would he need that?",
    "Never mind then...I think Tegid is doing his laundry outside. You could ask him if you can borrow one of his dirty robes.",
    "What can I do for you young 'un?",
    "Excellent! I will be able to complete the next part of the ritual now. I will teach you a new spell and give you some of my knowledge in Herblore as a token of thanks. If you ever come across more goutweed, bring it to me; I don't need any more for the ritual, but it's still quite difficult for me to get. I'll exchange it for some other herbs."
  ],
  "Player": [
    "Have you any more work for me, to help reclaim the circle?",
    "And what exactly do you want me to do?",
    "No thanks.",
    "I'll do it.",
    "Actually, I don't need to speak to you.",
    "What was I meant to be doing again?",
    "I'll get on with it.",
    "Hi!",
    "I need to find some goutweed. Sanfew said you might be able to help.",
    "Not yet.",
    "Er, hi.",
    "Oh, you don't want to eat me! I'm a tough, hardened adventurer, not tender or tasty at all!",
    "I'm on a quest to find some goutweed.",
    "Really? What is it?",
    "Right. I'll just...go fetch that for you then. Bye!",
    "Erm, not yet, but I'm working on it...",
    "I need to find some goutweed. Sanfew said you might be able to help.",
    "I talked to the troll cook but he wouldn't tell me anything, and now he wants me to find him some tasty human for his stew.",
    "Really?",
    "A PARROT? Where am I going to find one of those?",
    "Why do you live so close to the trolls? Isn't it dangerous?",
    "What do you have to offer?",
    "No thanks, Eadgar.",
    "It's very nice.",
    "When did you add it?",
    "What do you feed them?",
    "Hah! Got you now!",
    "Nothing.",
    "Well, good thing I found it! I'll just take it to the vet for you, shall I?",
    "I haven't been able to find one yet.",
    "Where's the zoo?",
    "Okay, I'll be right back.",
    "Okay, I'll be right back.",
    "Here it is! Now are you going to explain your plan?",
    "How are we going to make it look like a human?",
    "How are we going to make it sound like a human?",
    "How are we going to make it smell like a human?",
    "And how are we going to make it taste like a human?",
    "What should I do with this parrot?",
    "How are we going to make it look like a human?",
    "How are we going to make it sound like a human?",
    "How are we going to make it smell like a human?",
    "And how are we going to make it taste like a human?",
    "I don't think it's done yet.",
    "Eadgar says he needs some dirty clothes for his plan, and he said you might be able to help.",
    "It's a long story.",
    "So, you're doing laundry, eh?",
    "Nice day for it.",
    "You wouldn't be able to spare any of those dirty robes by any chance? It's a matter of the utmost importance.",
    "Fine.",
    "I'm sure Sanfew won't be happy when I tell him it's your fault he can't perform the purification ritual.",
    "You'll give me those robes right now...or I'm going to cut down trees until you do.",
    "Of course I would. They're just trees.",
    "I hid the parrot under the rack in the troll prison.",
    "I have [no/the] logs, [no/five] chickens, [no/ten bundles of] wheat and [no/the] dirty clothes.",
    "Oh?",
    "And how do we do that?",
    "How do you prepare it?",
    "Okay, I'll be back with that soon.",
    "How do I make the troll truth potion again?",
    "I've got the troll truth potion.",
    "Not yet.",
    "I think it's probably heard enough.",
    "I've brought the parrot.",
    "Not yet.",
    "No. I lost it.",
    "Yes! Look!",
    "This is burnt meat.",
    "Thank you... and how's the stew?",
    "So, where can I get some goutweed?",
    "That's some well-guarded secret alright. I'll just be off on my way now.",
    "I'll be going now.",
    "How's the stew?",
    "Yes! I can get into the storeroom now.",
    "I have some goutweed!"
  ],
  "Eadgar": [
    "Welcome to Mad Eadgar's! Happiness in a bowl! Would you care to sample our delicious home cooking?",
    "Sanfew, you say? Ah, haven't seen him in a while. Goutweed is used as an ingredient in troll cooking. You should ask one of their cooks.",
    "Oh, it's you. Have you talked to the troll cook yet?",
    "Well, you should do that then. Anything else I can do for you?",
    "Oh, it's you. Have you talked to the troll cook yet?",
    "Sanfew, you say? Ah, haven't seen him in a while...",
    "Oh dear, that's no good. You can't just go hand over a human to those trolls... Aha! I have a plan!",
    "Yes! It's bound to work. First of all, I will need a parrot!",
    "At the zoo, where else?",
    "Anything else I can do for you?",
    "Well, I suppose I do keep getting captured by the trolls and thrown in prison...But they always release me in the end, I'm far too old and skinny for their tastes. In any case, this is my home, and I'm not leaving it. And this area has the tastiest goats!",
    "The chef's recommendation for today is mountain goat stew. I'll give some stew in exchange for logs for my fire. They're hard to come by around here.",
    "Your loss!",
    "Oh, it's you. Have you got me a parrot yet?",
    "Well, go see if the zoo have one.",
    "It's in Ardougne, south west of here.",
    "Yes, yes, of course. It's quite ingenious really! What we need is something that looks like a human, sounds like a human, smells like a human and tastes like a human.",
    "We'll just make a scarecrow. We'll need logs, and 10 sheaves of wheat for stuffing.",
    "That's what the parrot's for, of course.",
    "Although the trolls might get suspicious if it doesn't say what they expect a human to say... You should hide it for a while somewhere it can pick up some more appropriate catchphrases.",
    "Well, we'll need to dress it up anyway; if we use dirty clothes it'll smell human to the trolls. I'm a man of few clothes myself, so you might want to ask old Sanfew about that one.",
    "That's easy, we'll just stuff it with a few chickens. Everything tastes like chicken! Five raw chickens should be enough. That's the plan.",
    "I told you, put it somewhere it'll learn to say the sort of thing the trolls will expect it to say. This is likely to be screaming. There's bound to be a good spot somewhere in the troll prison. Anything else I can do for you?",
    "We'll just make a scarecrow. We'll need logs, and 10 sheaves of wheat for stuffing. Anything else I can do for you?",
    "That's what the parrot's for, of course. You should hide it for a while somewhere it can pick up some more appropriate catchphrases. Anything else I can do for you?",
    "Well, we'll need to dress it up anyway; if we use dirty clothes it'll smell human to the trolls. I'm a man of few clothes myself, so you might want to ask old Sanfew about that one. Anything else I can do for you?",
    "That's easy, we'll just stuff it with a few chickens. Everything tastes like chicken! Five raw chickens should be enough. Anything else I can do for you?",
    "Good work. How about those other items?",
    "How are you getting on?",
    "You now need [no/the] logs, [no/five] chickens, [no/ten bundles of] wheat and [no/the] dirty clothes.",
    "That's everything! Good, good, everything is almost finished. Of course, we can't just give him the dummy and expect to get anything useful out of him.",
    "No, of course not. We need to make sure he'll tell you what you need to know.",
    "I happen to know that the trolls are susceptible to a certain kind of plant that grows around this mountain. I call it Troll Thistle. If properly prepared, it can be made into a sort of Troll truth potion.",
    "You'll have to dry it in a fire, then grind it and mix it into a potion with Ranarr weed.",
    "Troll Thistle grows around this mountain. If properly prepared, it can be made into a sort of Troll truth potion.",
    "Excellent, hand it here. Now just go fetch that poor parrot back, it's probably had enough by now.",
    "Did you get that parrot back?",
    "Hurry up then.",
    "Hand it here...there we go! Can you tell this isn't a bona fide human being? I sure can't!",
    "Have you given the fake man to the troll cook yet?",
    "Go on then, give it to the cook! Anything else I can do for you?",
    "You bumbling imbecile! Never mind, here's one I prepared earlier.",
    "Well? Did the plan work?",
    "Glad to hear it!"
  ],
  "Burntmeat": [
    "Hmm? What human do in troll kitchen? Burntmeat tired of cooking goats. Human look tasty.",
    "Hmm. Burntmeat think you probably right. What human doing here?",
    "Bwahahaha! Burntmeat not give his greatest cooking secret away so easily. But Burntmeat also has quest for human!",
    "Bring back a tasty human for Burntmeat's stew. If you find tasty human, Burntmeat will give you good reward.",
    "Did you find tasty human?",
    "Did you find tasty human? Burntmeat smell something good.",
    "Ah, dat look like nice tasty human.",
    "Yep, sound like human too. Burntmeat put it in stew. Good work, human. Burntmeat give precious reward.",
    "It first thing I ever try to cook! Very precious to Burntmeat.",
    "Slurp, mmm... Human stew cheer Burntmeat up!",
    "Hah! Trolls pick it all until none left, many years ago. Only remaining stock in storeroom. It well guarded, and Burntmeat hide key in fake bottom of kitchen drawer. Nobody find it there.",
    "Bye, bye."
  ],
  "Parroty Pete": [
    "Good day, good day. Come to admire the new parrot aviary have we?",
    "Isn't it just?",
    "Just recently. It would have been sooner, but some wretch thought it would be amusing to replace their drinking water with vodka. The vet had to nurse them back to health for weeks!",
    "Well, fruit and wheat mostly. I try to give them a balanced diet, but their favourite treat is pineapple chunks.",
    "Hey! What are you doing with that parrot?",
    "It looks drunk! You should NEVER feed alcohol to a parrot!",
    "Oh, thank you! We're ever so busy here at the Zoo."
  ],
  "Parrot": [
    "Sqwaawk...*hic*",
    "Raaawk! Polly wanna cracker!",
    "Who's a pretty boy then?",
    "Who's a pretty boy then?",
    "Ah, hello Sir. Could you please free me? I seem to have ... OW! What are you doing? That's my spleen!"
  ],
  "Tegid": [
    "Yeah. What is it to you?",
    "Suppose it is.",
    "What? No! These are my robes!",
    "What? Oh well, if it's a matter of that much importance, I suppose you can borrow one...",
    "You wouldn't dare!",
    "You monster! Take the robes and leave this place!"
  ],
  "Fake Man": [
    "What am I doing here? Ow! Where's the rest of the Guard? Agh! I won't tell you anything!",
    "Heeeeeeelp!",
    "Aaaargh! Somebody save me!"
  ],
  "Congratulations! You have completed": [
    "'Eadgar's Ruse' - Complete this Experienced quest."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Eadgar%27s_Ruse?oldid=35805675’"
  ]
}