{
	"This transcript mentions the following": [
		"Aughra, Charos, Colossus, Dactyl, Dragonkin, Elder artefacts, Elder Gods, Gielinor, Kerapac, Mr Mordaut, Mysterious monolith, Necrosyrtes, Orthen, Shadow anima, Sliske,  and The Ambassador."
	],
	"Player": [
		"What's going on here? Maybe Laniakea knows something?",
		"Laniakea has always been interested in these ruins.",
		"What do you know about these ruins?",
		"I think I'll pass for now.",
		"What? What do you mean?",
		"What does he want?",
		"Can't we just get in through the grating on the roof?",
		"Can we destroy the door with explosives?",
		"Can we open the door somehow?",
		"Well, actually I may have a way. You said there's poison leaking from the ruins?",
		"Give me a moment.",
		"I don't think I can take anymore, but I imagine I've got enough to get that door open.",
		"Perks of being the World Guardian. I can open that door now.",
		"1ll need to siphon more shadow anima if I want to get this door open.",
		"It's shadow anima. A massive concentration of it.",
		"You can't survive here. Get to safety, I'll handle this.",
		"What is this place?",
		"A prison for what?",
		"Wait! Why would it leave? Isn't it imprisoned?",
		"Where did Zaros go?",
		"My predecessor?",
		"Wait, who are you?",
		"What is it?",
		"But what is it? Zaros called it a 'shadow colossus'.",
		"How was it captured?",
		"Why did it stir now?",
		"What is this place?",
		"What experiments were done here?",
		"He met a bad end.",
		"Do you know anything about the 'Codex' Zaros mentioned?",
		"I know where it is.",
		"We built the Archaeology Guild around it.",
		"Can you tell me anything about your people?",
		"Does that trouble you?",
		"Can you tell me anything about the city of Orthen?",
		"There are archaeologists outside studying the ruins. They would be fascinated to talk to you.",
		"No. Only I can do that. I'm kind of a special case.",
		"What was your world like?",
		"Well, this island is experiencing a... um... let's say time, uh, issue. It's covered in jungle, but the rest of the world isn't. What did the mainland look like in your time?",
		"What did Zaros tell you?",
		"The, uh, purple deity.",
		"Do you know what he wanted?",
		"What can you tell me about yourself?",
		"You're Varanus! I recovered your journals from the Orthen ruins.",
		"But that's impossible. There's a huge sarcophagus with your name on it not far from here. How are you alive?",
		"We did it!",
		"No. Kerapac's device was destroyed.",
		"Dramatically."
	],
	"Laniakea": [
		"Something strange is happening here Player. The time for caution and patience is over.",
		"This morning something changed in the ruins. Listen.",
		"You hear it? And not just that. A new form of toxin has been seen leaking from inside. One even I can't tolerate. Worse, soon after it started, one of the archaeologists saw a floating, masked, purple figure seemingly investigating.",
		"I think so.",
		"No, I think it must be Zaros.",
		"No, I think it must be Zaros.",
		"I haven't witnessed him personally, but there've been reports of his presence around Anachronia over the last few months.",
		"I don't know, but if something's going on in there I want to know what it is.",
		"A group of adventurers tried exactly that recently. We never heard from them again.",
		"That would be my preference, but Mr Mordaut has strictly forbidden it and he is still the expedition leader.",
		"Yes, and quickly. We can't do anything that will damage the ruins, but this matter has the highest priority right now. I've been studying this door in my off time for months now, and I've nearly solved its riddle. It's locked magically, and I asked Charos to help me understand it.",
		"He told me that it requires an infusion of the same energy that Kerapac's device was generating to unlock. But you destroyed that device!",
		"Yes, a blackish-purple liquid. Toxic to all life.",
		"What were you doing?",
		"Go ahead, I'm right behind you.",
		"This place... I can't...",
		"1m... sorry...",
		"I cannot enter that place. It hurts. You must go alone Player."
	],
	"Shadow anima siphoned": ["[20/40/60/80/100]%"],
	"You have unlocked a new music track": ["Orthen Oubliette."],
	"Raksha": ["...", "Grmbr...", "Rmr..."],
	"Zaros": [
		"World Guardian.",
		"This is a prison.",
		"Let me show you.",
		"Millennia ago, Gielinor was an untouched, unspoiled wilderness.",
		"Only plants and animals lived there, untroubled by language or industry.",
		"A handful of elder artefacts had been discarded by the Elder Gods.",
		"One of these was the Codex, a repository of both knowledge and power.",
		"When a great beast came across the strange monolith, it couldn't know what awaited.",
		"It emerged from the Codex fundamentally changed.",
		"It was a colossus - an animal demigod. The ultimate apex predator. Unchallenged.",
		"When the dragonkin arrived, they were fascinated by the creature.",
		"They found it, captured it, and imprisoned it in their city.",
		"They called it Raksha. Nothing quite like it has been seen before, or since.",
		"It was not just a colossus, but a shadow colossus.",
		"Its power came not from the elder gods but from somewhere... else.",
		"To the priest Kranon, it was a religious inspiration, the source of his heresy.",
		"The scientist Kerapac took a very different line of inquiry.",
		"He experimented until the beast was of no more use to him.",
		"I recommend that you do not allow it to leave the complex.",
		"The damage it could inflict is considerable.",
		"I have confidence that you can handle the situation.",
		"Exactly what I need."
	],
	"The Keeper": [
		"He has damaged the seals! Please, whoever you are, help me contain Raksha. Enter the chamber and subdue it, and I will rebind it.",
		"Your predecessor has damaged the oubliette and released Raksha.",
		"The purple deity. He told me of your coming.",
		"He told me of your strange new species.",
		"He told me you can survive in this environment.",
		"You must enter the inner chamber and stop Raksha.",
		"Do you need anything else?",
		"I am the Keeper, the caretaker of the oubliette.",
		"I maintain the apparatus that sustains and imprisons Raksha, the prisoner of this place.",
		"I have maintained this vigil for many centuries, and the seals have never been broken until now.",
		"Do you need anything else?",
		"What about the creature?",
		"We call it Raksha. The One That Speaks.",
		"I do not know this term. Raksha is a unique being. There were other dinosaurs, some truly titanic beings, but nothing like this. Kerapac experimented on it. It had strange powers, which he cut from its strange flesh, but he could not remove its fundamental aspect. Magic of a kind we had never seen before courses throughout its body. It must be fed with that energy to remain alive - it does not generate it.",
		"We hunted it for weeks across the mainland. When we cornered it, it poisoned me. Transporting it here was a complex matter but the Kindra demanded it. I am proud to say that there were no other fatalities.",
		"Kerapac somehow created a source of the energy it needs to survive. After the curse, the supply of energy ceased. We remained awake, the beast and I, for many more years, but eventually Raksha slipped into a coma, and I slumbered with it. I do not know how long it has been since then. Recently the supply resumed once more, drawing both of us into wakefulness, until it once more ceased. Raksha would have slept once more if not for the purple deity's interference.",
		"What about this place?",
		"We are in the antechamber of the oubliette. The oubliette was designed and built solely to contain Raksha. Apparatus channels energy here to sustain the creature. I was embedded here as its keeper, overseeing it.",
		"It is not my place to understand the details. Syrtes, Aughra and Dactyl alike visited this place for their work. When agitated, Raksha broadcasts hateful visions. I remember one priest, Kranon, was quite touched by the experience. He claimed that it had religious significance to him, though I cannot imagine what. I wonder what became of him.",
		"Unsurprising.",
		"Ask what you must.",
		"I do not. He showed me the same visions he showed you. We never learned the source of Raksha's powers. Perhaps this Codex is linked to the same powers.",
		"Really?",
		"That seems unwise.",
		"My people ruled this world, until the curse befell us. I was interred here long beforehand, but I still felt it. After that moment there was no interest in the oubliette or its prisoner. I have had no visitors. Now the curse is gone, but my own vigil remains. The purple deity told me that my civilisation is long gone.",
		"...",
		"It makes no difference to me as long as Raksha remains contained.",
		"This is our first city on this world. There were other colonies but this was the capital.",
		"Are they like you? Are they able to survive in here?",
		"Unfortunate.",
		"You have seen it yourself, have you not?",
		"It was much like this island. Volcanoes, ferns, dinosaurs. A young and vibrant world, the air sweet and clean.",
		"Who do you want to know about?",
		"Who?",
		"He told me that I have been ripped from time. He told me many thousands of years have passed, but I have stood still. He told me the world is now under the control of lesser beings.",
		"He has removed part of the apparatus of the oubliette. I instructed him not to but I could do nothing against a being of such potency. He seemed confident that you specifically would deal with the aftereffects.",
		"Once I was a hunter. It was I who captured Raksha and brought him here. I was poisoned, but by Kerapac's machinations I was interred here. The same apparatus that sustains Raksha sustains me. We are linked, forever.",
		"Yes. That was my name.",
		"Someone needed to contain Raksha. It had to be me. Kerapac's methods can be extreme, but they were necessary. I would not let the creature I died to capture go free, and I would not let another languish in this prison. But the others would not have understood. They would have objected, maybe even damaged the oubliette. An empty tomb was my final camouflage.",
		"Thank you.",
		"Is the supply of energy likely to be restored?",
		"How?",
		"Then Raksha will likely not stir again.",
		"He and I will sink once more into slumber.",
		"Do you need anything else?"
	],
	"Congratulations! You have completed": [
		"'Raksha, the Shadow Colossus' - Complete this quest."
	],
	"Retrieved from ‘https": [
		"//runescape.wiki/w/Transcript:Raksha,_the_Shadow_Colossus_(quest)?oldid=36206467’"
	]
}
