{
  "Sir Amik Varze": [
    "Quests, eh? Well, I don't have anything on the go at the moment, but there is an organisation that is always looking for capable adventurers to assist them. Would you like me to put your name forwards to them?",
    "As you wish, adventurer. Let's say no more about it.",
    "Erm, well, this is a little embarrassing, I already HAVE put you forward as a potential member. They are called the Temple Knights, and you are to meet Sir Tiffy Cashien in Falador park for testing immediately.",
    "No, I am afraid not. I suggest you go meet Sir Tiffy in Falador Park, he will be expecting you.",
    "I cannot tell you much... They are called the Temple Knights, and are an organisation that was founded by Saradomin personally many centuries ago. There are many rumours and fables about their works and actions, but official records of their presence are non-existent. It is a secret organisation of extraordinary power and resourcefulness... Let me put it this way: Should you decide to take them up on their generous offer to join, you will find yourself in an advantageous position that many in this world would envy, and that few are called to occupy."
  ],
  "Player": [
    "I'll go do that, then.",
    "Well, that wasn't quite as helpful as I thought it would be...but thanks anyway, I guess.",
    "Sir Amik Varze sent me to meet you here for some sort of testing...",
    "He said that, did he?",
    "Testing? What exactly do you mean by testing?",
    "You want me to go kill some monster or something for you?",
    "So you want me to go and fetch you some kind of common item, and then take it for delivery somewhere on the other side of the country? Because I really hate doing that!",
    "So what exactly will this test consist of?",
    "So you want to test my brains? Will it hurt?",
    "What do you want me to do then?",
    "Erm... What are 'standard puzzle room rules' exactly?",
    "This organisation you keep mentioning... Perhaps you could tell me a little about it?",
    "No. He didn't really tell me anything except to come here and meet you.",
    "So what's the difference between you and the White Knights?",
    "Wait... You can order the King around?",
    "Yeah, this sounds right up my street. Let's go!",
    "Well, I don't know... This doesn't really sound like my kind of thing. To be honest, I'd rather go kill stuff for loot than use my mind to work things out.",
    "I don't get that riddle... Can I have a different one?",
    "I don't get that riddle... Can I have a different one?",
    "Hello there. What am I supposed to be doing in this room?",
    "Is that it?",
    "Okay, I'll see what I can do.",
    "I really don't think I should be carrying more than 5 Kg across that rickety bridge...",
    "Can you give me any help?",
    "Okay, thanks!",
    "Please... I am REALLY stuck... Isn't there ANYTHING you can do to help me...?",
    "Okay, thanks a lot, you've been very helpful!",
    "hahahahahahaha!"
  ],
  "Sir Tiffy Cashien": [
    "Ah, Player! Amik told me all about you, dontchaknow! Said you were a spiffing candidate...absolutely first class.",
    "Well, not in those exact words, but you get my point, what? A top-notch filly like yourself is just the right sort we've been looking for for our organisation. So, are you ready to begin testing?",
    "Jolly bad show! Varze was supposed to have informed you about all this before sending you here! Well, not your fault I suppose, what? Anywho, our organisation is looking for a certain specific type of person to join.",
    "Not at all, old bean. There's plenty of warriors around should we require dumb muscle. That's really not the kind of thing our organisation is after, what?",
    "Haw, haw, haw! What a dull thing to ask of someone, what? I know what you mean, though. I did my fair share of running errands when I was a young adventurer, myself!",
    "Can't let just any old riff-raff in, what? The mindless thugs and bully boys are best left in the White Knights or the city guard. We look for the top-shelf brains to join us.",
    "Haw, haw, haw! That's a good one! Not in the slightest... Well, maybe a bit, but we all have to make sacrifices occasionally, what?",
    "It's a test of wits, what? I'll take you to our secret training grounds, and you will have to pass through a series of five separate intelligence tests to prove you're our sort of adventurer. Standard puzzle room rules will apply.",
    "Never done this sort of thing before, what? The simple rules are: No items or equipment to be brought with you. Each room is a self-contained puzzle. You may quit at any time. Of course, if you quit a room, then all your progress up to that point will be cleared, and you'll have to start again from scratch. Our organisation manages to filter all the top-notch adventurers this way. So, are you ready to go?",
    "Oh, that Amik! Jolly bad form. Did he not tell you anything that he was supposed to?",
    "Well, now, old sport, let me give you the heads up and the low down, what? I represent the Temple Knights. We are the premier order of Knights in Asgarnia, if not the world. Saradomin himself personally founded our order centuries ago, and we answer only to him. Only the very best of the best are permitted to join, and the powers we command are formidable indeed. You might say that we are the front line of defence for the entire kingdom!",
    "Well, in simple terms, we're better! Any fool with a sword can manage to get into the White Knights, which is mostly the reason they are so very, very incompetent, what? The Temple Knights, on the other hand, have to be smarter, stronger and better than all others. We are the elite. No man controls us, for our orders come directly from Saradomin himself! According to Sir Vey Lance, our head of operations, that is. He claims that everything he tells us to do is done with Saradomin's implicit permission. It's not every job where you have more authority than the king, though, is it?",
    "Well, not me personally, I'm only in the recruitment side of things, dontchaknow, but the higher ranking members of the organisation have almost absolute power over this kingdom. Plus a few others, so I hear... Anyway, this is why we keep our organisation shrouded in secrecy, and why we demand such rigorous testing for all potential recruits. Speaking of which, are you ready to begin your testing?",
    "Jolly good show! Now, the training grounds location is a secret, so...",
    "Here we go! Mind your head!",
    "Oops, ignore the smell! Nearly there!",
    "And... Here we are! Best of luck!",
    "Well, it takes all sorts to make the world spin, what? Maybe you'll find a nice job with the city guard sometime. Sad, though...your intelligence file seemed quite promising. Should you change your mind, you come back and let me know, what?",
    "Oh, jolly bad luck, what? Not quite the brainbox you thought you were, eh? Well, never mind! You have an open invitation to join our organisation, so when you're feeling a little smarter, come back and talk to me again.",
    "Ah, what ho! Back for another go at the old testing, what?",
    "Oh, jolly well done! Your performance will need to be evaluated by Sir Vey personally, but I don't think it's going too far ahead of myself to welcome you to the team!"
  ],
  "Sir Ren Itchood": [
    "Greetings friend, and welcome here,you'll find my puzzle not so clear.Hidden amongst my words, it's true,the password for the door as a clue.",
    "Better than me, you'll not findIn rhyming and in puzzles.This clue so clear will tax your mindEntirely as it confuzzles!",
    "Feel the aching of your mindIn puzzlement, confused.See the clue hidden behindHis words, as you perused.",
    "Look closely at the words i speak;[sic]And study closely every part.See for yourself the word you seekTrapped for you if you're smart.",
    "More than words, i have not for you[sic]Except the things i say today.[sic]Aware are you, this is a clue?Take note of what i say!",
    "Rare it is that you will seeA puzzle such as this!In many ways it tickles meNow, watching you hit and miss!",
    "This riddle of mine may confuse,I am quite sure of that.Mayhap you should closely peruseEvery word i have spat?[sic]",
    "Before you hurry through that doorInspect the words i spoke.[sic]There is a simple hidden flawEre you think my rhyme a joke.",
    "First my clue you did not see,I really wish you had.Such puzzling wordplay devilryHas left you kind of mad!",
    "Last time my puzzle did not helpApparently, so you've bidden.Study my speech carefully, whelpTo find the answer, hidden.",
    "Many types have passed through hereEven such as you amongst their sort.And in the end, the puzzles clear;The hidden word you saught.",
    "Repetition, once againAgainst good sense it goes.In my words, the answers plainNow that you see rhyme flows.",
    "Twice it is now, i have stated[sic]In a rhyme, what is the pass.Maybe my words obfuscatedEntirely beyond your class.",
    "Betrayed by words the answer isIn that what i say is the keyThere is no more help after thisEspecially no more from me.",
    "For the last time i will state[sic]In simple words, the clue.Such tricky words make you irateHaving no idea what to do...",
    "Lo! my final speech is nowAttended to by you.Study my words, and find out howTo understand my clue!",
    "Maybe i will do my best;[sic]Especially at giving clues.Attempt to help you pass the test!That should help me pay my dues.",
    "Repeat myself to give the clueAgain, i now do speak.[sic]It's hidden in my words - hey you!Now find the answer you seek.",
    "Three times now, my riddle said;I hope you finally see the clue.Maybe think on what you've read;Easy when you know what to do.",
    "It's sad to say, this test beat you. I'll send you to Tiffy, what to do?",
    "Your wit is sharp, your brains quite clear;"
  ],
  "Lady Table": [
    "Welcome, Player. This room will test your observation skills.",
    "Study the statues closely. There is one missing statue in this room.",
    "We will also mix the order up a little to make things interesting for you!",
    "You have 10 seconds to memorise the statues... starting NOW!",
    "We will now dim the lights and bring the missing statue back in.",
    "Please touch the statue you think has been added.",
    "No... I am very sorry. Apparently you are not up to the challenge. I will return you where you came from, better luck in the future.",
    "Excellent work, [Player]. Please step through the portal to meet your next challenge."
  ],
  "Sir Spishyus": [
    "Ah, welcome Player.",
    "Well, your task is to take this fox, this chicken and this bag of wheat across that bridge there to the other side of the room. When you have done that, your task is complete.",
    "Well, it is not quite as simple as that may sound. Firstly, you may only carry one of the objects across the room at a time, for the bridge is old and fragile. Secondly, the fox wants to eat the chicken, and the chicken wants to eat the wheat. Should you ever leave the fox unattended with the chicken, or the wheat unattended with the chicken, then one of them will be eaten, and you will be unable to complete the test.",
    "No... I am very sorry. Apparently you are not up to the challenge. I will return you where you came from, better luck in the future.",
    "Ah, well done on solving my puzzle Player!"
  ],
  "Miss Cheevers": [
    "Greetings, Player. Welcome to my challenge. All you need to do is leave from the opposite door to where you came in by. I will warn you that this is more complicated than it may at first appear. I should also warn you that there are limited supplies of the items in this room, so think carefully before using them, or you may find yourself stuck, and have to leave to start again! Best of luck!",
    "No, I am sorry, but that is forbidden by our rules. If you are having a particularly tough time of it, I suggest you leave and come back later when you are in a more receptive frame of mind. Sometimes a break from concentration will yield fresh insight. Our aim is to test you, but not to the point of frustration!",
    "Well... Look, I really shouldn't say anything about this room, but... When I was attempting to join the Temple Knights I myself had to do this puzzle myself. It was slightly different, but the idea behind it was the same, and I left the notes I had made while doing it hidden in one of the bookcases. If you look carefully you may find them, and they may be of some use to you. I really can't be any more help than that I'm afraid, it is more than my job's worth to have given you the help I already have.",
    "Best of luck with the test Player, I hope your application is successful."
  ],
  "Sir Tinley": [
    "Ah, Player, you have arrived. Speak to me to begin your task.",
    "Ah, welcome Player. I have but one clue for you to pass this room's puzzle: 'Patience'.",
    "Excellent work, Player. Please step through the portal to meet your next challenge.",
    "No... I am very sorry. Apparently you are not up to the challenge. I will return you where you came from, better luck in the future.",
    "Patience is a virtue that few possess in this world. Excellent work, Player. Please step through the portal to meet your next challenge."
  ],
  "Sir Kuam Ferentse": [
    "Ah, Player, you're finally here. Your task for this room is to defeat Sir Leye. He has been blessed by Saradomin to be undefeatable by any man, so it should be quite the challenge for you. If you are having problems, remember; A true warrior uses his wits as much as his brawn. Fight smarter, not harder.",
    "Excellent work, Player. Please step through the portal to meet your next challenge."
  ],
  "Sir Leye": [
    "No man may defeat me!",
    "AH-HA HA HA! You can NEVER defeat ME! I am blessed by Saradomin himself! NO MAN MAY DEFEAT ME!"
  ],
  "Ms. Hynn Terprett": [
    "Greetings, Player. I am here to test your wits with a simple riddle.",
    "Here is my riddle: I estimate there to be one million inhabitants in the world of Gielinor; creatures and people both. What number would you get if you multiply the number of fingers on everything's left hand, to the nearest million?",
    "Here is my riddle: Which of the following statements is true?",
    "Here is my riddle: I have both a husband and daughter. My husband is four times older than my daughter. In twenty years time, he will be twice as old as my daughter. How old is my daughter now?",
    "Here is my riddle: Imagine that you have been captured by an enemy. You are to be killed, but in a moment of mercy, the enemy has allowed you to pick your own demise. Your first choice is to be drowned in a lake of acid. Your second choice is to be burned on a fire. Your third choice is to be thrown to a pack of wolves that have not been fed in over a month. Your final choice of fate is to be thrown from the walls of a castle, many hundreds of feet high. Which fate would you be wise to choose?",
    "Here is my riddle: I dropped four identical stones, into four identical buckets, each containing an identical amount of water. The first bucket's water was at 32 degrees Fahrenheit, the second was at 33 degrees, the third at 34 and the fourth was at 35 degrees. Which bucket's stone dropped to the bottom of the bucket last?",
    "No... I am very sorry. Apparently you are not up to the challenge. I will return you where you came from, better luck in the future.",
    "Excellent work, Player. Please step through the portal to meet your next challenge.",
    "You certainly have the wits to be a Temple Knight. Pass on through the portal to find your next challenge."
  ],
  "[Examiner]": [
    "Excellent work! You have passed all five of the required tests! Please accept my congratulations!"
  ],
  "(See Transcript": [
    "Sir Tiffy Cashien)",
    "Sir Tiffy Cashien)",
    "Sir Tiffy Cashien)",
    "Sir Tiffy Cashien)"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Recruitment_Drive?oldid=33551300’"
  ]
}