{
  "This page contains dialogue related to Recipe for Disaster": [
    "Freeing the Mountain Dwarf.The content below is copied verbatim from RuneScape and thus copyrighted by Jagex."
  ],
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "minor dialogue optionsYou can discuss this issue on the talk page or edit this page to improve it."
  ],
  "Player": [
    "How do I protect you I wonder....",
    "That dwarf... I somehow can't remember how I managed to save him...",
    "I did? Er, I did.",
    "Oh yeah... I remember now...",
    "...son...time bubble...culinaromancer...freeze...rockcakes!",
    "Ok. Your son, the one who guards the tunnel entrance?",
    "Well he's at a special meeting and he's frozen by the culinaromancer!",
    "He's in a TIME BUBBLE!",
    "I need your rock cakes to free him from it.",
    "What ales are you serving?",
    "What can you tell me about dwarves and ale?",
    "No no no...I mean what kind of ale do they drink?",
    "Oh? Would you tell me?",
    "I could offer you some in return, how about 100 gold?",
    "I could offer you some in return, how about 200 gold?",
    "Just 200... honest!",
    "What can you tell me about dwarves and ale?",
    "No no no... I mean what kind of ale do they drink?",
    "Oh? Would you tell me?",
    "I could offer you some in return, how about 100 gold?",
    "You have a deal. Here you go...",
    "Sorry, no deal.",
    "I just happen to have some on me.",
    "You have a deal. Here you go...",
    "Sorry, no deal.",
    "Oh, I don't have enough money on me.",
    "I could offer you some in return, how about 200 gold?",
    "I could offer you some in return, how about 200 gold?",
    "Just 200... honest!",
    "But I don't have the money on me. I'll have to come back.",
    "Oh go on, I'm really quite trustworthy once you get to know me.",
    "Thanks.",
    "What can you tell me about dwarves and ale?",
    "No... I just... misplaced it.",
    "Thanks, I won't forg...err.. misplace it, this time.",
    "Here, have a drink.",
    "Maybe!",
    "Speaking of recipes....",
    "Here, have another.",
    "I think you deserve another pint.",
    "I'm sure another pint will go down nicely.",
    "You're a good friend Rohak, do you think you could do me a favour?",
    "I don't need you to do that ... friend. Just something as simple as baking me some of your wonderful rock cakes. Hmm? For your good friend?",
    "Good. I'm sure I have some gold somewhere!",
    "How much gold do you want to make the cake?",
    "No, not a dream, you agreed to make me your special rock cake, for a fee.",
    "You didn't say I'd have to run around... but ok! Milk, flour, egg, bowl of water....I'll be back!",
    "Maybe I should have some more money with me, he did say he'd want payment...",
    "Ok, I'll see about getting them.",
    "I have the [ingredient].",
    "I don't have an egg, I'll look for some chickens.",
    "I don't have the milk but I'll check out the cows.",
    "I don't have a bowl of water.",
    "I don't have a pot of flour",
    "Okay okay I'll get right on it! Keep your beard on!",
    "N..n...nothing honest!",
    "I have all the items you asked for...is that it? I could make these!",
    "Well... here's the ingredients anyway.",
    "Not yet but I will. I'm going to save your son.",
    "I appear to have lost it somewhere, can you make me another?",
    "Oh, ok, I'll find a way to cool them down then."
  ],
  "Fortuneteller": [
    "To protect our short angry friend from the culinaromancer's magics, I suggest that you seek out his father within the mountain tunnel that he guards. His fondness for rock cakes could prove key in freeing him.",
    "STOP! What do you think you're doing!",
    "You can't feed him red hot rock cakes! You'll kill him! Find a way to cool them down.",
    "I hear there's a rather chilly reception on top of a rather icey mountain.",
    "Good work adventurer, I've teleported them away to safety! You only have [number] council members left to protect!"
  ],
  "Cook": [
    "The dwarf? Oh, yeah, I think that was an easy one, didn't you say?",
    "You went to see his dad in the tunnels under white wolf mountain, and then got some rock cakes, if I remember rightly.",
    "Did you want a reminder on any other of your brave exploits?"
  ],
  "Old Dwarf": [
    "...",
    "I have absolutely no clue what you are on about. Sit down, catch your breath and explain please!",
    "Oh aye. Good lad he is.",
    "Ok... you lost me again. I just got back from visitin' him up top, he's fine.",
    "Oh that. No no, he's quite ok. That was last week."
  ],
  "Rohak": [
    "You're delusional. Never would old Rohak give away his special recipe, not for all the golden nectar from the Rising Sun!",
    "I would never give away me special rock cake recipe, not for all the golden nectar from the Rising Sun!",
    "Is that what I think it is?",
    "That's from the Rising Sun, the barmaid there will never tell me the recipe she uses. It's divine!",
    "No! I shwears I'll never tell...",
    "Don't mind if I do!",
    "Don't mind if I do!",
    "Don't mind if I do!",
    "Ahhh, yer me besht mate... mate.",
    "Fer you Player? Fer you I'd... I'd... shlide down a shlope of thishtlesh wif no 'elmet on!",
    "Fer you! Anyfin'! Fer a price of course!",
    "WHAT?! That wasn't a dream? Oh my aching head....",
    "Oh. 100 gold, no less! Also... you'll need to get the ingredients too. Milk, flour, egg and bowl of water, mind it's a bowl and not a dirty bucket.",
    "Have you forgotten the ingredients list? I'll need an egg, a pot of flour, a bucket of milk and a bowl of water to make these cakes for you.",
    "That's all well and good...but come back when you have all the ingredients. You're lucky Dwarves stick to their word else I might not make these cakes for you.",
    "What did you say?",
    "No you couldn't, there's a special ingredient, but I'm not going to tell you what it is!",
    "There, as good as my word. Hot rock cakes to my special recipe.",
    "Got any use out of that rock cake I made you [Player]?",
    "I keep tellin you, he's fine!",
    "I suppose so, but you'll need all the ingredients like last time."
  ],
  "[Emily/Kaylee/Tina]": [
    "Well, we've got Asgarnian Ale, Wizard's Mind Bomb and Dwarven Stout, all for only 3 coins.",
    "Erm...they like it?",
    "Well I know for sure that they enjoy my special recipe.",
    "And lose money? I think not!",
    "Sorry, no deal, that wouldn't even cover my expenses."
  ],
  "Emily": [
    "You sure you haven't got anymore?",
    "Hand it over then and I'll tell you the secret.",
    "Mmmmm... the secret is in the gold. Drop a gold coin into asgarnian ale and you'll get this weird golden ale that the dwarves seem to love, I think they're genetically attracted to gold.",
    "Erm... they like it?",
    "Well I know for sure that they enjoy my special recipe.",
    "And lose money? I think not!",
    "Sorry, no deal, that wouldn't even cover my expenses.",
    "You have CHOCOLATE in your pack, I can smell it! 50 gold and chocolate and the secret is yours!!",
    "Your loss! Next customer please!",
    "Welll... maybe... look.. I'm on duty here at the bar so I can't get anything to eat, I could murder a pizza.",
    "Pizza and 100 gold and the secret is yours!",
    "Your loss! Next customer please!",
    "You sure you haven't got anymore?",
    "Hand it over then and I'll tell you the secret.",
    "Mmmmm... the secret is in the gold. Drop a gold coin into asgarnian ale and you'll get this weird golden ale that the dwarves seem to love. I think they're genetically attracted to gold.",
    "Wait... what am I saying? I just gave you the secret!",
    "Oh it's you again. Forgotten the secret already?",
    "Mmmmm... the secret is in the gold. Drop a gold coin into asgarnian ale and you'll get this weird golden ale that the dwarves seem to love, I think they're genetically attracted to gold."
  ],
  "Congratulations! You have completed": [
    "'Recipe for Disaster: Freeing the Mountain Dwarf' - Complete this Novice quest."
  ],
  "v • d • eRS3 Recipe for Disaster": [
    "Freeing the Mountain DwarfA subquest of Recipe for DisasterNPCs"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Recipe_for_Disaster:_Freeing_the_Mountain_Dwarf?oldid=35578485’"
  ]
}