{
  "Relomia, Emissary of Sliske": [
    "Player, the eclipse approaches! My master's great game is at hand! Come see me in Draynor and I shall explain it further.",
    "Rejoice, the eclipse is upon us, and with it the culmination of Sliske's plans! Truly now his glory will be revealed!",
    "He told me that he couldn't bear to look at your face without punching it again. You really should not anger such a magnificent person, Player.",
    "If you win Sliske's game then I am sure you'll get to do whatever you want.",
    "Well, my most charming and handsome master believes that you've been a little too chummy with all of the gods. He, in his limitless wisdom, says that it is time that you picked a side. He wants you to go and speak to the gods, each of whom is now here on Gielinor. Give each of them their invitations and remind them that the game is on. You can side with one if you like, or just hand out those leaflets and head on back to me.",
    "Oh come on. Of course you can. But failing that, if you really can't, make sure all your bridges are well and truly burned. That should be good enough for the eternally shiny Sliske.",
    "Oh no. You have to tell them to their face. That way it's far more amusing when you betray them!",
    "Saradomin I believe has walled himself up with his knights. Armadyl roosts at the top of his tower again. Seren never leaves her stupid elves and Zamorak will be gathering up the black knights. Your pet dog Icthlarin is hanging around Death a lot lately. I've no idea where Zaros is though.",
    "I think I know where this is going, and no I will not tell him that. Return here when you're ready to play along.",
    "Very good, hurry along!",
    "What are you talking to me for? Shouldn't you be talking to the gods?",
    "Urgh, I just told you that. Saradomin is probably with his white knights. Armadyl is moping in his tower. Zamorak is probably with the Black Knights and Seren is where Seren always is, with her stupid elves. ICthlarin has been hanging around Death a lot lately. And I still have no idea where Zaros is.",
    "It seems you've had a good old chinwag with the gods and made your decision.",
    "Now we wait for the eclipse to happen, but not here. Sliske wants us to meet him at the entrance to the Heart of Gielinor.",
    "What better place to discuss who will get the most powerful item in the world than at the very heart of the world? Oh Sliske is such a poet. I'll head over to the Heart camp shortly. You're welcome to meet me there for the eclipse. I'm sure we can think of some way to while away the time. Oh, but, er... You didn't hear this from me, but you probably want to be well equipped for Sliske's game. His games are a lot of fun. But sometimes he plays rough.",
    "Shouldn't you be at the Heart of Gielinor camp by now?",
    "Hello again. Are you ready for Sliske's grand entrance? Just know that once we've started, there's no going back. Make sure you have everything you need with you. Just...well...you know. Make sure you're ready for anything...like... Make sure you've got your best sword or staff or whatever. Sliske's games can sometimes get a little...boisterous.",
    "That's fine, he won't begin without you. Let me know when you're ready.",
    "Wooo! I get to do an announcement! Yay! Sliske is super cool and awesome, wooo!",
    "Oh Player, you're back! Did you enjoy Sliske's game? Was it magnificent? Did he look absolutely scrumpitious? I bet he did!",
    "He's fine. He's in the best health. You found his jokes really funny. He's brilliant. He's... He's...",
    "No. Please. Please don't say it. Just don't say it. It's not true if you don't say it.",
    "No...",
    "...",
    "...not any more.",
    "I... I think you should go now... I think you should leave. I... I...",
    "Oh boy, yes I am. I absolutely am. He's the smartest, most handsome, most amazing god there ever was. He's so funny and dreamy!",
    "Oooh what is it? Is it god-slayer? Dreamboat? Snugglemuffin?",
    "Wha...what?",
    "Whaaaat?",
    "But...but he was my reason for living...",
    "NOTHING! Everything is exactly as it should be.",
    "Oh fine. Completely fine. Sliske's dead, very sad, but hey it happens. Still, you finished his game, so I think you've earned a reward!",
    "What do you mean? I'm feeling great. The sun is...well, gloomy, but the birds are screeching and everything is just brilliant.",
    "Oh yes. Dead.",
    "Absolutely. He is definitely, totally dead. Yes sir, terrible tragedy.",
    "What do you mean? I'll do what I've always done, why would I do anything differently?",
    "Oh Player, you're so funny. You already know the answer to that question.",
    "Goodbye."
  ],
  "The following text is transcluded from Transcript": [
    "Relomia's message."
  ],
  "Player": [
    "What does this have to do with me, and if I am supposed to be involved, why did Sliske send you?",
    "Anger him? After all he's done I will do more than just anger him!",
    "So what now?",
    "No. Tell Sliske he can take his instructions and...",
    "Fine, right whatever. I'll go and talk to the gods and pick a side.",
    "Sliske wanted you to have this. It's a formal reminder that the game will begin at the Eclipse.",
    "Do you often return to Teragard?",
    "Saradomin, you deserve the stone. I shall stand with you.",
    "It's an invite to Sliske's game. He wants you to have it.",
    "He created nihil out of them, he combined pieces of them with other creatures. He...",
    "Armadyl, I wish to stand with you in Sliske's game.",
    "I have something for you.",
    "I want to side with you, Zamorak. You have proved yourself a noble god and one worth following.",
    "Sliske gave me this invitation for you Icthlarin.",
    "Sliske gave me this invitation for you both.",
    "Wait. Before you go, I need to give you this.",
    "You didn't just kill Mah, Seren, you killed hundreds...maybe thousands of mahjarrat. Worse you made them kill each other, sacrifice themselves to your facade. Without you they might have thrived. They might have evolved into something amazing. Instead you had them butcher one another!",
    "That's all of the invitations given out. I should probably go back to Relomia and see what happens now.",
    "So what happens now?",
    "Why there? What's he planning?",
    "I choose to ally with myself. I will not advance any god's agenda. I deserve the stone.",
    "I will stand with Armadyl. He alone seeks the best course of action for the stone.",
    "I stand with Saradomin. Order and reason are the safest path to the brightest future for Gielinor.",
    "Seren has the experience and the power necessary to wield the stone with wisdom. I side with her.",
    "I stand with Zamorak. Strength only comes from conflict.",
    "Only Zaros has the will and wisdom to do what is right with the stone.",
    "I side with Vorago and the Godless. No god should possess the stone, their time has come to a close.",
    "I stand with Icthlarin. He has shown that he puts the needs of the people above his own aspirations and I trust him with the stone.",
    "I stand with Death. As a guardian of Guthix he represents balance the best and I trust him the most.",
    "I choose to side with you, Sliske. Let the games begin!",
    "I side with the dragonkin. They alone have a real claim to the stone and I trust Kerapac to use it wisely.",
    "I choose no one. This entire game is ridiculous.",
    "Icthlarin is part of my entourage. He's in pain, let him leave.",
    "This is your game and your rules Sliske, are you going to follow them, or is this all over?",
    "You seem...different Icthlarin, are you ok?",
    "What?",
    "Who's a good boy? Who's a good boy? You are. Yes you are. Good Icky, good boy!",
    "You know. When I unlock him as a pet, can I add him to my interface or is this an object pet?",
    "Interface is preferable, it means I have less struggle with my bank space and everything. You know what I mean.",
    "I don't think he's listening any more. It's time I moved on.",
    "Wait - you know how the gods will die?",
    "Are you alright? You don't sound so powerful right now.",
    "I'm intrigued, what past events can you remember?",
    "You refereed yourself as \"the defeater\", why?",
    "Why are you picking at your feathers?",
    "What are you arguing about?",
    "Zaros. How are you finding the game so far?",
    "You expect to win the game?",
    "Did you capture a dragonkin?",
    "It sounds like it might be a way to help both of your people and I believe Armadyl sincerely wants to help your people.",
    "It's too likely to lead to conflict and it would be abandoning the unsullied culture of both worlds.",
    "This is a big discussion. Far bigger than you have time for here. It deserves more time to be properly considered.",
    "I think you should speak. You are not the enemy here; Sliske is. If you cannot trust each other enough to speak in private, then what chance do any of us have of defeating him?",
    "They are right; if this is a private conversation I should leave. If you want to speak privately you should speak with him alone or not at all.",
    "I think I would like to stay. I promise I will not intervene.",
    "I think I will remain. If a dispute arises, maybe I can mediate?",
    "I suggest you withdraw. Just because you know that you are walking into a trap does not make it any less deadly. In fact, Sliske is probably counting on you knowing that this is a trap, and has planned accordingly. He may even have planned around you knowing that he knows that you know it is a trap and is planning for that... ...Sorry, I feel a little dizzy now.",
    "I suggest you continue. You are the only one capable of handling the stone and defeating Sliske's traps. I believe in you, my lord.",
    "I suggest you continue. As much as this is going to be dangerous, if gods begin to withdraw from the competition it could cause Sliske to lash out. And his lashing out with the stone to call on would be terrible. Besides, without making sure that some of the other gods pull out too, you might hand victory to someone worse than you. No offence.",
    "Please, Saradomin, will you not listen to her?",
    "Seren, don't bother. He won't listen to reason. Saradomin is far too proud and set in his ways to hear what you have to say.",
    "Please, listen to her!",
    "Well said, my lord!",
    "I think that Saradomin may be right, Seren. He has his forces with him, and he may use the stone for good.",
    "Thank you, Seren, but I think Saradomin is right.",
    "If you want to speak privately then you should speak with him alone or not at all.",
    "I think I will remain. If a dispute arises, maybe I can mediate?",
    "I suggest you withdraw. Just because you know that you are walking into a trap does not make it any less deadly. In fact, Sliske is probably counting on you knowing that this is a trap, and has planned accordingly. He may even have planned around you knowing that he knows that you know it is a trap and is planning for that... ...Sorry, I feel a little dizzy now.",
    "I suggest you continue. You are the only one capable of handling the stone and defeating Sliske's traps. I believe in you, my lord.",
    "I suggest you continue. As much as this is going to be dangerous, if gods begin to withdraw from the competition it could cause Sliske to lash out. And his lashing out with the stone to call on would be terrible. Besides, without making sure that some of the other gods pull out too, you might hand victory to someone worse than you. No offence.",
    "He's right Zamorak. Back down now. If this is going to end in a fight, Saradomin won't be fighting alone.",
    "This is a battle you won't win Zamorak and it's one you might not come back from.",
    "He's right Saradomin. Back down now. If this is going to end in a fight, Zamorak won't be fighting alone.",
    "Is that all you're going to do? Shout at each other? Isn't now the perfect time to settle old scores?",
    "Wait! There's no need for violence. We can resolve this peacefully.",
    "Enough! You're both gods. Immortal beings of phenomenal power and influence and you're both acting like children.",
    "Yes I dare. Because fighting now, it's exactly what Sliske wants. He wants you to kill each other. And do you know what he'll do when you do so? He'll laugh. He doesn't want you dead because of some great plan. He wants you to kill each other because it is funny.",
    "Of course I am! Who do you think has been at the centre of all of this mess? Not you. Neither of you have seen friends killed by Sliske. Neither of you have seen allies warped into monsters. Neither of you had to face a god built out of the screaming remnants of human souls. Neither of you have had to travel back in time to visit an old friend, only to be brought back staring at his corpse. For all that you've been through, know that it's a drop in the ocean compared to what Sliske has done to me. So now, for once. Just for once. Shut up and stop giving Sliske what he wants.",
    "Don't let him talk to you like that!",
    "...",
    "What do you mean?",
    "It's over Sliske. This game is over.",
    "Back in your lair, you left something important unattended. A powerful artefact linked to your shadow magic.",
    "I was one step ahead of you, Sliske. It's time for you to face up to your actions without any of your tricks.",
    "No more, Sliske, this ends now!",
    "What's happening?",
    "Where am I?",
    "I was hoping for a more specific answer.",
    "That's not much better. Let's try a new question. Who are you?",
    "Oh...",
    "Shut it squidface, don't you tell me what to do.",
    "Err... I guess an apology won't help?",
    "Sliske's game would have started a war with the gods. It would have woken the elder gods on Gielinor and destroyed the world.",
    "Err...it's a conflict where large numbers of people kill each other for a single cause.",
    "That's probably too philosophical a question for...whatever this is.",
    "More than we might like to think.",
    "That was a long time ago.",
    "Some races are more warlike than others.",
    "Goblin, elves, humans, they're all different races.",
    "I...er...because they are? It's not really a choice or anything, it's just the way things are.",
    "It was difficult to see alternatives in the moment, he was trying to kill me.",
    "What, killing each other?",
    "I'm a bit different to most.",
    "In some ways, I suppose.",
    "I enjoyed it. I really wanted to wipe that smug smile off his face.",
    "Not always, there are good qualities as well. Like erm, love and peace and hope?",
    "No! They'll destroy Gielinor!",
    "Why what?",
    "Wait! You can't just kick me out like this. You're Jas, THE elder god! I have so many questions!",
    "One what? One question? I get one question?",
    "I'm not even sure where to begin...",
    "I was hoping for a bit more than that.",
    "But I still have more questions!",
    "I think I should keep that secret for now.",
    "Jas wanted me to prove that life deserves to exist. She has contacted the other elder gods and each will now judge us. If we pass, we will be allowed to live, if we fail...all life will be eradicated.",
    "She didn't really say. She just said we will have to prove ourselves.",
    "Did you hear that?",
    "I heard... I heard... I...",
    "I heard... Nothing.",
    "It was nothing. I must be hearing things.",
    "Relomia. I'm so sorry, I have some bad news for you. Sliske...",
    "Relomia...we got into a fight... He...",
    "Relomia, I'm so sorry. But you have to hear this.",
    "Sliske forced us into a fight. I picked up the Staff of Armadyl and we fought... I had to kill him. I'm so sorry.",
    "Relomia...will you be ok? Do you have anyone to talk to?",
    "Yes...everything is fine Relomia. He's...just a bit sore, so you might not see him for a bit.",
    "Hey Relomia. You know how you're Sliske's biggest fan?",
    "Yeah, well you know all those descriptions you have of him, you know... Handsome, smart, and so on? Well I've got a new one for you!",
    "Dead!",
    "He's dead. I killed him. I took the Staff of Armadyl and I jammed it into his pathetic excuse for a heart. As he crumbled to the floor, I watched as, from the rising dust, every little thing he cared about floated away. Funny thing is, I don't think I saw you anywhere amongst all of them. Funny that.",
    "So, yeah, Sliske's dead by the way. Sorry about that.",
    "Yeah, sorry. He didn't leave me much of a choice. You might want to move on, do something else with your life.",
    "What...what just happened?",
    "You seem a lot happier...are you sure you're ok?",
    "But, Sliske's dead. Aren't you sad?",
    "No...really... He's dead."
  ],
  "Saradomin": [
    "Greetings, World Guardian. What is this?",
    "And he has made you his messenger? I have heard of what he did to you, how he beat you. To add such further insult...[sic] You must really hate him?",
    "Good. You will need that hatred, I imagine. What lies ahead will not be easy, keep your wits about you.",
    "How strange. Still, each of us deals with things differently I suppose.",
    "Sliske's game is a dangerous farce that cannot be allowed to continue. Since Sliske and the other gods have failed to understand reason, we are left with no alternative. We must make an aggressive response. I will take the fight to all who would seek the stone, so that it may be rightfully returned to my hands. I have wielded the stone before. I did so wisely and with care. I shall do so again. Can you say such of the others? The dark Zamorak would use it to destroy the world. Zaros would enslave it to his will, and grow more dangerous than ever. Armadyl has no idea what to do with such power, and would destroy himself with his naivety. And Seren...Seren would use its power only in support of her precious elves. I will use its power with wisdom and compassion, for the betterment of all life on Gielinor. Alas, Utopia must sometimes be built on bones, so let the lesser gods be the foundation.",
    "Forgive me Player but there have been times where our goals have not always been perfectly aligned. Why should I divulge my strategems to you now?",
    "Very well. You have aligned with me in the past, I have faith your loyalty will continue. Sliske's game is a dangerous farce that cannot be allowed to continue. Since Sliske and the other gods have failed to understand reason, we are left with no alternative. We must make an aggressive response. I will take the fight to all who would seek the stone, so that it may be rightfully returned to my hands. I have wielded the stone before. I did so wisely and with care. I shall do so again. Can you say such of the others? The dark Zamorak would use it to destroy the world. Zaros would enslave it to his will, and grow more dangerous than ever. Armadyl has no idea what to do with such power, and would destroy himself with his naivety. And Seren...Seren would use its power only in support of her precious elves. I will use its power with wisdom and compassion, for the betterment of all life on Gielinor. Alas, Utopia must sometimes be built on bones, so let the lesser gods be the foundation.",
    "I am glad to hear that, World Guardian. But I'm afraid I will need more than a few words to trust your allegiance. My emissary can be found in Falador park. If you pledge your allegiance to me, then we can talk further. Do not take my secrecy personally. The stakes are simply too high for blind faith.",
    "I see, Tell me, Player, do you take me for a fool? I am known as the 'god of wisdom'. I have earned this moniker over millennia. Do you think you could lie directly to my face and that I would not know?",
    "I see. So, this is the World Guardian? You could be a noble example to all. Instead you are little more than a clown in small shoes. I think we're done here.",
    "Apology accepted. I understand, World Guardian, that you are in a tricky situation. You feel the weight of the world on your shoulders. Believe me...I know that burden. It has nearly crushed me more than I can say. But I, too, have a duty. A duty to care for my followers, and for those who have yet to see the light. And until I can trust you, implicitly, I'm afraid I cannot share my plans with you. The stakes are far too high. I trust you can understand this.",
    "Then we have nothing further to discuss. I will not reveal my plans, nor will I allow you to stand in the way of them.",
    "Sliske's game is a dangerous farce that cannot be allowed to continue. Since Sliske and the other gods have failed to understand reason, we are left with no alternative. We must make an aggressive response. I will take the fight to all who would seek the stone, so that it may be rightfully returned to my hands. I have wielded the stone before. I did so wisely and with care. I shall do so again. Can you say such of the others? The dark Zamorak would use it to destroy the world. Zaros would enslave it to his will, and grow more dangerous than ever. Armadyl has no idea what to do with such power, and would destroy himself with his naivety. And Seren...Seren would use its power only in support of her precious elves. I will use its power with wisdom and compassion, for the betterment of all life on Gielinor. Alas, Utopia must sometimes be built on bones, so let the lesser gods be the foundation.",
    "Your position has been made quite clear, World Guardian. As we stand apart, I will offer you no insight into my designs.",
    "Armadyl showed great promise when I first encountered him. A willingness to learn and a drive for justice that appealed to my own. He was a young deity, but not a rival, and I saw a wisdom in taking him under my wing...if you'll pardon the pun. During the conflict with the vile Zamorak, Armadyl counselled a temporary alliance with ourselves and the warmongering Bandos. A wise move, for Zamorak was the more immediate threat. Sadly, that allegiance would not last. Old rivalries proved more important than reason. Armadyl's people would perhaps suffer the most from the conflict that followed. I know Armadyl holds me in some way responsible. I suspect he is unwilling to recognise his own fault in this. Still, I would be willing to accept vassalage of Armadyl and his people. They are a noble species and I believe they would benefit from my tutelage.",
    "Seren thinks of herself as a good, kind, deity, but she is a fraud. She enslaved her people and she refuses to help anyone beyond her precious elves. A benevolent god would seek to protect all people, not just a subset.",
    "What alternative is there? Understand. I do not say this out of arrogance. I have lived millennia, and in that time I have seen countless governments rise and fall. There is a pattern to the ascendance and collapse of civilisation. A cycle of tragedy. I have the knowledge to break this cycle, and most importantly the will to lead everyone forwards. Is it wrong to use this knowledge? Gielinor, and other worlds, would be bought to a new future. A utopia. Other gods can claim this, but only I have the experience necessary to make it happen.",
    "You say that as though it were a bad thing. People need to be led. They need governments. They need leaders. They need structure. Freedom doesn't mean anarchy. Just as control doesn't have to mean slavery. I offer guidance and leadership. Law and order. Under my 'control', people could thrive. Everyone would have the reassurance that they know where they belong and how they should behave. The people crave. Deep down everyone wants to know where they sit in the world. What you call control, I would argue is true freedom. Freedom to know how life should be lived and how to fulfil one's potential.",
    "Seren is powerful. This is undeniable. So imagine what she could do with that power were she to look beyond the narrow confines of Prifddinas. If she cannot wield that power for the betterment of everyone, then in many ways she is as deplorable as Zamorak. He at least notices when others suffer. Unfortunately, Zamorak merely revels in that suffering.",
    "I have walked many worlds and interacted with numerous deities, but none I find quite as deplorable as the usurper Zamorak. Even his divine nature is brought about by the betrayal of one he claimed to serve. The theft of another's essence. He preaches a creed of 'strength through chaos', spreading the lie that his acts of wanton cruelty are really lessons that help us grow. Why must people die for us to learn how to defend them? Could he not simply teach them? Offer the people ways to improve themselves, spread his meagre knowledge to better them? No. Instead he sends demons to raid their villages. He tricks learned mages into dabbling with foreign magics. Then Zamorak watches as people die in suffering and agony. Where is the strength in that? Where is the wisdom? It's the psychotic indulgence of a monster, not the acts of a god.",
    "Yes. I have taken lives in my time. I won't deny that. But i have always done so with purpose...with greater good in mind. I have fought wars because there are some who understand no other discussion. Without the clash of sword and shield, they cannot hear reason...it is silence to them. I have committed acts that some would call cruel, but they are a woeful necessity. Once I was forced to take the wings of an icyene. To tear them from her back and leave to the the mercy of winter. We were heading into a time of war, against an aggressor native to Hallow. I had been forced to militarise the noble icyene. The icyene are a powerful race, but still mortal, and their numbers comparatively few. I needed each of them to stand up and join the fight, less[sic] they would all suffer. But one refused. She cried out that the conflict would solve nothing. She proclaimed that all icyene should lay down their spears and embrace a peaceful approach. Her words were...enticing. I wanted to follow them myself. I would have loved little more than for conflict to end and peace to flourish. But I knew better. I knew inaction would lead to the destruction of my people. I had to show the icyene what they faced if they did not fight. I had to show them how the enemy would show no mercy...just as I had to show no mercy. I will not forget that...feeling. that horrible stretching sensation followed by that terrible, sudden, snap. Feathers and tendons falling around me like some horrible snowstorm. It was...cruel. But I had no choice. That act reminded the icyene why they were fighting, what they were fighting, and it reminded them that everyone must do their duty. A moment of cruelty, for decades of prosperity. A fair, if unsightly, trade.",
    "No. I imagine not. She will only see the barbarism and the cruelty, but the lesson was, ultimately, not for her.",
    "But do they? Really? What of the ones who die? Their potential lost, squandered and meaningless.",
    "What of the wise scholar, whose library is burned to the ground. He becomes a builder, reclaiming what was lost, but he could have resolved vital mysteries.",
    "At best, chaos is an engine for change, but it is change without focus or purpose. Simply reaction, rather than evolution. There are better ways.",
    "No. Zamorak is a dangerous creature with delusions of grandeur; little more.",
    "No. Zamorak is a dangerous creature with delusions of grandeur; little more.",
    "Ah, yes. The 'Empty Lord'. The lord of the Empty Throne who ruled his empire from the shadows. Another god whose lethargy was stronger than his leadership skills. He ruled from seclusion, letting his own people do the work for him. No wonder he was betrayed. He would have you believe he is a guide rather than a monarch, but he lacks the conviction to truly lead. True leadership is sacrifice. A willingness to give yourself fully to guiding your people.",
    "You think so? Who told you this? Hmm? Was it the Empty Lord himself, perchance? Or one of his sycophants? I would expect more from the World Guardian. You are a role model...an inspiration to some. I would counsel you to use more common sense. Zaros has an agenda. Just as we all do.",
    "And you would expect me to say what about this hulking monstrosity? Should I be in awe? Should I cower in fear? I have wandered worlds long before the first footprints pressed into Gielinor. In that time, I have witnessed wonders and nightmares that make this Vorago pale in comparison. I am not sure why Sliske invited him, but his presence changes little.",
    "He serves a noble purpose. I can respect that. If he sticks to his duty I will have no qualms with him.",
    "Death performs a necessary function, however little most mortals may like it. It is a lonely, but important job. I wish him well.",
    "That said, it would be unwise to allow Death to claim the stone. There is a natural order to things, and we should not risk that.",
    "Sliske is a dangerous creature. Perhaps even more so than Zamorak. Both seek chaos, but at least one seeks chaos for a purpose. Sliske just wants to see the world aflame, with all hope and purpose cast into the inferno for his amusement. That such a lunatic could possess the stone is concerning. That such a lunatic has chosen not to ascend, perhaps more worrying still. If he craved power, I could understand. If he craved a nihilistic end to existence, I could perhaps begin to understand that. But Sliske's motivations appear...incomprehensible, and that concerns me greatly.",
    "There is little point to speak of the dead. Bandos had his merits and his flaws, but he is gone now and no more needs to be said.",
    "I have little to say of these creatures. They are dangerous beasts, little more.",
    "Ha ha ha. That thing calls itself a god? Laughable. Truly. Whatever that thing is, it has demonstrated no real power and has no real followers. I find it almost contemptible that we're even discussing it.",
    "We will not discuss that...that...drunken harlot.",
    "I was a justicar on Teragard, one tasked with upholding and enforcing the law. I risked my life each day to preserve order and protect the innocent. At times the forces of avarice and corruption I fought against seemed insurmountable. Upholding the law was a tough yet noble duty, and my obsession. It took its toll on me, and my family, but my community thrived as a result. Perhaps that's why the Crown chose me. It could sense in me the drive for order. The yearning for the world to be the best it could. You perhaps expect the Crown to have been discovered at the end of an epic quest. Perhaps I slew demons or wrestled chthonic entities into the abyss, but I did none of these things. Instead, whilst hunting down a criminal, I discovered a cave that hadn't seen human life...ever. Within, I saw a golden circlet that called out to me, choosing me. This was the Crown and I knew without hesitation that it was made for me. That I had been chosen. My apotheosis did not happen overnight. The Crown led me to objects of power and importance, and these became my tools. With them, I began to slowly reshape Teragard into something greater. Over time, I discovered the tools were no longer necessary, and that I now wielded the power without them. Henceforth, my power grew and grew, and I took my rightful place as the god of Teragard. Progression from there was obvious and inevitable. I realized that there would be other worlds out there, worlds that needed guidance and order. I would not leave them forgotten.",
    "No. You have shown me little loyalty, so I see no reason to explain my secrets.",
    "Whilst your allegiance to me now is gratifying, your track record has been less than exceptional. Perhaps in future I will have this conversation, but not today. Forgive me.",
    "The birthplace of humanity is a beautiful world, if not a kind one. Snow covers the lands and the winds would chill you to the bone. Nonetheless, it was my home. We were disparate nations, spread across the world. When I ascended, I decided to rectify that. To bring an end to pointless conflicts over invisible territorial lines that serve no one. I created magisters...priests and teachers who were to act as my authority where I could not. They were learned individuals whom I would personally instruct on what lessons to teach others. I created twelve in total, each tasked with governing a different part of the world, and each given a mandate to improve humanity in line with my teachings. With the magisters in place, my people prospered, and entered a glorious age of enlightenment. Confident that my world was in safe hands, I turned my attention to other worlds in greater need of my assistance.",
    "I...have not yet had the opportunity. Other worlds have greater need of my attention.",
    "What family I had are long since dead.",
    "There is no reason to be, it was millennia ago. Death comes to all mortals. I watched each of my family line wither and die, and could do nothing to prevent the ravages of time. At one time, I held onto their personal possessions, but they have long since disintegrated. All I have of them are the memories I carry through the ages, though I barely recall the names of my parents or the colour of my wife's eyes. They are part of the life of the man I was before, not the god I am now. I have moved on from that life and embraced a greater responsibility.",
    "They are part of the life of the man I was before, not the god I am now. I have moved on from that life and embraced a greater responsibility.",
    "It is a beautiful world filled with noble creatures. The transition from day to night takes almost a year as you know it, so each night the icyene move from one island to the next. The migrations are such a sight to behold. Flocks of icyene abandon one home and fly across the oceans to settle once more in structures that have lain empty for the entire winter.",
    "There are other creatures, certainly. Skypouncers roam the plains and there are visitors from other worlds from time to time...but natives...no.",
    "Thank you, Player. Together we will lay the foundation for a glorious future.",
    "Greetings, World Guardian.",
    "Ah, Armadyl. I should have guessed you would be the most eager to arrive.",
    "Ichtlarin, should you really be here? Don't you have duties to attend to? You must know the stone will never be yours.",
    "What arrogance! You dare pretend to know my will?",
    "Yes! Armadyl, together we can destroy him once and for all!",
    "What madness is this?",
    "This is outrageous, I will not stand for this!",
    "...",
    "I should have known you lacked the moral fibre to stick to your oaths. I am disappointed.",
    "I should have known you lacked the moral fibre to stick to your oaths. I am disappointed.",
    "Witness this, the World Guardian and I stand united. Our victory is already assured.",
    "With my leadership and the World Guardian's unrelenting tenacity, the stone shall be rescued.",
    "Yes. The stone will be ours.",
    "I should have known you lacked the moral fibre to stick to your oaths. I am disappointed.",
    "I should have known you lacked the moral fibre to stick to your oaths. I am disappointed.",
    "I should have known you lacked the moral fibre to stick to your oaths. I am disappointed.",
    "I should have known you lacked the moral fibre to stick to your oaths. I am disappointed.",
    "I should have known you lacked the moral fibre to stick to your oaths. I am disappointed.",
    "I should have known you lacked the moral fibre to stick to your oaths. I am disappointed.",
    "I should have known you lacked the moral fibre to stick to your oaths. I am disappointed.",
    "I should have known you lacked the moral fibre to stick to your oaths. I am disappointed.",
    "This is a vile perversion of nature Sliske!",
    "I will deprive Armadyl of his head start. It is nothing personal, but only I can be trusted with the stone.",
    "Ah, World Guardian. Hello. You catch me in an uncommon state of contemplation. The sudden removal of my divine power has made me...question a few things. We get little chance to speak you and I, you must have questions?",
    "It is...humbling. For era upon era, I have been one of the fortunate few to endure, unravaged by the forces of entropy. When one is likely to survive until the final move upon the board, they become inclined to think several turns ahead. One is forced to focus on the big picture, the good of all, the needs of the many. If a god does not consider tomorrow, then tomorrow may belong to another, and they will rarely relinquish it without a fight...a war that could endure through centuries of spilled mortal blood. A single mortal life has but time for one action. Perhaps you will claim another piece, but the game is greater than yourself. You are at best one step on the path to victory. You shall inevitably lose what matters most to you. And you will never know, at the end of the long game, which side shall be the victor. Now, I am but one pawn, with the narrowest of reach. Nonetheless, I am grateful for my fall from grace. I had forgotten the vulnerability, the brevity of a mortal life...you are plagued, moment by moment, by the inevitability of your own demise. I can literally feel my body ageing, disintegrating with each passing moment, and there is nothing I can do to prevent it. Millennia of borrowed time are catching up to me. If I cannot reclaim what is lost, I shall succumb to death, and I shall be no more. No wonder mortals pursue their own pleasure with such reckless haste. You do not consider tomorrow, for you may not live to enjoy it.",
    "Am I human? Are you so certain? Godhood changes us, Player. We gain power, but we lose so much more. I endured, while my family, my followers, entire races, succumbed to mortal death. Over time, an immortal is forced to detach themselves from mortal sensibilities, or forever endure the pain of loss. At what point can I consider myself human? What is humanity? Is it kindness? Mercy? Empathy? How can I empathise when I am no longer one of you? With all my power, I can not give you more time, only make your lives more comfortable and structured, so that you are at peace when death claims you.",
    "Really? That is the question you find most pressing, at this critical time? Your priorities astound me, World Guardian. We are conduits for the power of the elders. We transcend what we were, and become something more. Godhood amplifies what we once where. I was hot-headed as a mortal, impassioned to help others and make the world a better place. As a god, that anger manifests as a righteous fury. It burns within me, an enduring flame of ferocious intensity. It requires constant vigilance to keep it in check. To maintain a cool demeanour is an exhausting necessity. Why is this cerulean pallor a product of my transformation? I do not know. My appearance is the least of the burdens this great crown has weighed upon me.",
    "You may have time for this, but I don't.",
    "When Zamorak walks away with the stone, you won't be so judgmental.",
    "How naive can one bird be? Do you not recall Zamorak wiping out your forsaken race with that same stone?",
    "Look. I admire your re-invention. It's noble that you've turned your self-loathing into whatever this is. But don't drag me into a chore while the doomsday clock ticks. Justice can wait.",
    "THE CREATURE SHOULD BE KILLED!",
    "Look. This is not a criminal in need of reform. This is not one of your little projects. It's a beast. It's so very, very sad that the stone has made it this way, but it kills people, Armadyl. It will continue to kill. It needs to be put down.",
    "I am fed up of your constant righteousness. I've already wasted too much time here. See if the World Guardian has time for your nonsense.",
    "Seren.",
    "Do you have business with me, or will we part ways here?",
    "I am aware of this.",
    "It seems that both of our followers do not think that this encounter could end well.",
    "You do have a point. Leave us.",
    "Of course. I have no quarrel with you today. My aim is to save this world from the heel of Zamorak or your brother. It is...good to see you again, Seren.",
    "Very well. Seren, what do you wish to say to me?",
    "Hmmph. Maybe a third party will help settle this. I will accept.",
    "What? You think I and my followers cannot make it to the end of this maze?",
    "To leave us vulnerable to some sort of attack. I am not blind.",
    "I hear your words, but I will not turn back. I am no fool, Seren. I never was. I am proud, I will grant you that. I may have taken actions that even I found distasteful in the name of a greater good. But what is my alternative? To hide in Falador and isolate myself, as you did?",
    "It still happened. You offer me a devil's choice, Seren. Turn back and risk someone who does not withdraw getting the stone, or pushing on and being trapped in Sliske's web.",
    "What say you, Player?",
    "Sound, if confusingly worded advice.",
    "Well said, Player.",
    "I do not agree with all of your reasoning, but I do admire your honesty.",
    "I choose to push on. The idea of Zamorak, or Zaros, claiming the stone is abhorrent to me. I thank you though Seren, for not trying to force the issue.",
    "Until we meet again then.",
    "Seren! I see you have lost your bodyguards.",
    "How unfortunate for you. And what business do you have with me?",
    "No. Whatever you have to say to me you can say in front of my followers. Unlike you I do not hide myself away from the world.",
    "I am aware of this. I have no intention of speaking with her alone.",
    "I will listen to her, but I will not endanger myself or the mission by doing so alone.",
    "Fool! I have already said I will listen. I will just not expose myself to danger by doing so without my followers present. Speak your piece, Seren.",
    "Of course. I have no quarrel with you today. My aim is to save this world from the heel of Zamorak or your brother. It is...good to see you again, Seren.",
    "Out of the question!",
    "I know that Sliske feels that he is in control here, but he is not. I will drive through his illusions and plots. With my generals and warriors by my side, we will overcome him. Then, with the Stone of Jas in my possession he will be unable to further vex me.",
    "I have listened. I am not blinded with pride, either of you. I know that Sliske believes himself the master here, but he is not.",
    "You see? With faith and determination, I will break Sliske's control of the stone and claim it.",
    "Such glowing praise from the 'World Guardian'. But yes, I will use the stone for good. Much more good than if Zamorak or Zaros claim it.",
    "Of course. I have no quarrel with you today. My aim is to save this world from the heel of Zamorak or your brother. It is...good to see you again, Seren.",
    "Seren?",
    "Do you intend to fight me?",
    "You presume a lot.",
    "Well if you wish to speak privately, Player may have to leave.",
    "Hmmph. Maybe a third party will help settle this. I will accept.",
    "What? You think I cannot make it alone?",
    "To leave us vulnerable to some sort of attack. I am not blind.",
    "I hear your words, but I will not turn back. I am no fool, Seren. I never was. I am proud, I will grant you that. I may have taken actions that even I found distasteful in the name of a greater good. But what is my alternative? To hide in Falador and isolate myself, as you did?",
    "It still happened. You offer me a devil's choice, Seren. Turn back and risk someone who does not withdraw getting the stone, or pushing on and being trapped in Sliske's web.",
    "What say you, Player?",
    "Sound, if confusingly worded advice.",
    "Well said, Player.",
    "I do not agree with all of your reasoning, but I do admire your honesty.",
    "I choose to push on. The idea of Zamorak, or Zaros, claiming the stone is abhorrent to me. I thank you though Seren, for not trying to force the issue.",
    "Until we meet again then.",
    "You. I had hoped you had fallen prey to one of Sliske's little traps. It would be a fitting end.",
    "Ha. Perhaps, but last time we had this dance you were not so fortunate.",
    "Do not mistake experience for frailty usurper. Mortal or not I am still your better. You don't really think you're a match for me do you?",
    "You think, for even a moment, that you frighten me? I almost pity you and your arrogant naivety. I am Saradomin. I governed worlds before you even knew what another world was. But by all means, if you are tired of your existence, test yourself against me. I am more than ready.",
    "Silence dog. I have sought to smite you for so long now. I shall enjoy wiping your villainy from existence!",
    "Yes, let this be our final battle Zamorak. The greatest confrontation, good versus evil.",
    "Another defeat Zamorak. Do you see it now? Your final defeat approaches!",
    "Your assistance is much appreciated Player. I see a great future ahead, if this cooperation continues. But I can stay here no longer, the stone must be mine. Until we meet again my friend.",
    "This is pointless. Are we both going to shed warriors until both of us lie dead?",
    "I will not forget this World Guardian. You choose chaos and destruction over order and wisdom. You are the villain I feared you could be.",
    "This is pointless. Are we both going to shed warriors until both of us lie dead?",
    "Once again you disappoint me World Guardian. Choosing to side with evil. Very well, I will grant you this victory. But when we meet again, I will not be so merciful.",
    "World Guardian, there is still time. Stand with me. Help me to smite this evil and protect this world from his malign influence.",
    "Leave? Now? At the hour of my victory? You seriously overestimate his chances.",
    "*Sigh* You are right my dear. We have more pressing matters to attend to. Very well Zamorak, I shall grant you this reprieve. But when we next meet, I will not show such benevolence.",
    "You would choose to side with him? With the Lord of Evil? Has the World Guardian become so corrupted?",
    "So. Here we are again. Once more you side against me. Once again you take the wrongful side of another over mine. Have I not proven my wisdom? Have I not shown you how much better Gielinor could be? How much stronger? How much wiser? Fine. No more will I show leniency. I will smite both of you.",
    "That it must come to this. Such a waste. Together we could have made a utopia.",
    "Yes. Reason has lost the battle today. Let us converse in a language that you can understand, with sword and fist.",
    "Oh, have no fear there tiny mortal, that is most definitely not on the cards. I am Saradomin. I am the Lord of Light and Order. I have fought wars that have collapsed stars. If you think for a moment you stand a chance, you are sorely, sorely mistaken.",
    "Ha! As you wish. But this time there will be no teleporting away. Face me now and I will destroy you once and for all.",
    "Wait. No. The World Guardian is right Zamorak.",
    "Do no be so surprised. You can be quite wise when the moment calls for it. I can respect that. We can choose not to be enemies today Zamorak. Because we know that there is a greater enemy at play.",
    "Indeed. I am not suggesting that we become allies, or friends. But we can choose to set aside this battle...for now.",
    "You mean you can try.",
    "YOU DAR...",
    "You have endured much World Guardian. I respect that. Truly. But you would be wise to watch your tone.",
    "No. Nor I. The stone is the target here, not one another.",
    "Yes. We must not lower ourselves to Sliske's level. So let us depart amiably. We can return to our conflict once all this is over.",
    "I have no intention to.",
    "So be it. I shall not mourn your passing.",
    "I am 'pulling' nothing World Guardian. Though it pains me to see you believe me guilty of such treachery. No, I am simply seeing the wisdom in your words.",
    "No. I have more pressing concerns. And once the stone is mine again, I shall smite you from existence.",
    "We'll see usurper, we'll see.",
    "So, here he is, the lord of chaos, finally abandoned by all. Does this make you happy? Does the arbitrary chaos of this situation fill you with joy? That all your plans, schemes and planning could mean so little?",
    "Ha ha, a noble speech. Such bravado. Such confidence. But here is the rub. I am here, your sworn enemy, and I am not alone.",
    "Even at the height of your power, surrounded by your armies, you could not defeat me. What makes you think you stand a chance now?",
    "I don't have time for this. Zilyana, bring the troops. We have a maze to solve.",
    "Do not mock me, Zamorak. My followers may not be with me, but I am still a god.",
    "Ah, but that's all I need. A little. I am one of the oldest of the gods. I have existed for millenia...no, not existed, thrived! It was not my power that led worlds into greatness, it was my leadership and my strategy. That's the difference between you and I Zamorak. You see I don't need my followers to be mighty. When I defeated you in Lumbridge, you needed your faithful Moia to rescue you. I needed no such assistance. So do not pity me Zamorak. Pity yourself and the fools that stand beside you. I have no need for it.",
    "And what would that teach your followers? That you dare not face me on equal footing? That they can always rise up against you? Perhaps you could kill me now. Perhaps. But even if you did, you'd always know that I'd really won.",
    "Ha! I see this as a blessing.",
    "It looks like it's down to just the two of us for the stone.",
    "Leave the stone for me!",
    "What cheap trick is this?",
    "You think this will stop me?",
    "Be gone!",
    "I am here Sliske. I claim my prize. The stone returned to me again!",
    "Enough of your bluster Sliske. This game is over.",
    "You could always end your suffering Sliske. A knife to your throat perhaps, or I would be happy to sever that smug head from your shoulders.",
    "The World Guardian will have my support here. I have no qualms with smiting you.",
    "No. Not now! I should have known.",
    "Then is she...?",
    "Then your price is a small one to pay.",
    "The bond that Zaros invoked...it feels different. What have you done?",
    "Then she...?",
    "It is a small price to pay for her safety.",
    "Was that supposed to do something?",
    "At least tell me that she is safe.",
    "Take it. It is a small price to pay for her safety.",
    "It is good to see you returned to us World Guardian. I had worried for your safety. It has been a...difficult day. To have the stone once again and to lose it so quickly... The world I could have created with such power... I could have saved everyone.",
    "Yes, you see it. I could have created glorious order and wiped the world clean of those who would do it harm. No more conflict, no more struggle. Everyone would know where they belong and finally feel fulfilled. Still, that dream is not gone. The path is merely more treacherous. In time I will find a way to perfect this world. It is my greatest wish, that when the time comes, you will stand beside me in this. Together, we could save the future. Until we meet again Player.",
    "Yes, you are right of course. The stone was the easy path, but it is not the only one. Instead of days, Utopia may have to take years, decades, or even centuries. It will be a long process, but I am, like my patience, eternal. Until we meet again Player.",
    "You think so? I had hoped you would know me better than that. I have only done what is best for the world. Until we meet again Player.",
    "So, the World Guardian survived the destruction of the stone and, if Seren is to be believed, a confrontation with an elder god itself. Do not let such moments go to your head Player. You have shown this day that I must consider you an opponent, if not an outright enemy. We both have our wounds to lick today, so there will be no further conflict for now, but in future I may not be so lenient.",
    "Greetings, World Guardian.",
    "It is better that the stone is lost, than for it to have fallen into enemy hands.",
    "Still, without the stone what becomes of the Dragonkin now? This is not the end to the danger they represent. Merely the beginning."
  ],
  "Armadyl": [
    "Greetings. What is this?",
    "Thank you Player. Won't you stay and talk a while? I fear we've not spoken much with one another. You must have questions?",
    "Sliske's game worries me. The stone is far too dangerous a tool to be in anyone's hands and, realistically, that includes mine. I believe that the stone should be hidden and protected properly. This time it should be guarded, constantly, so that no one else can ever wield its power again. Were it within my power I would destroy it, but I suspect I cannot.",
    "I do and that worries me. You know the adage 'power corrupts, and absolute power corrupts absolutely.'? I already know what godhood did to me...how it moved me further away from my people. I dare not imagine what the power would turn me into. I might see everyone as beneath me, a giant talking to ants... I would lose what little connections I have left and I would become Armadyl forgetting...well...forgetting who I was...am. I have little doubt that I could do great good with the power of the stone, but I fear the cost would be too great. Besides, it is folly to believe that one needs power to perform change. All we really need is a willingness to help others. I think perhaps it's time we try to be willing again. Beyond the stone I would use this as an opportunity for discourse with the other gods. Say what you will about Sliske, he has brought the gods together and now there is a chance for dialogue. I refuse to believe that we must always be at war with one another. We gain so little from conflict. But together...together we could make Gielinor truly wonderful. For everyone.",
    "Perhaps... No, almost certainly it is. But I choose to hope that we can work towards a better world, rather than tear the current one apart. However, that all said, for this dialogue to be possible and for the stone to be dealt with, I will need to win this competition. So I will do what it takes...anything it takes...to stop that stone falling into anyone else's hands.",
    "I'm glad you agree but I won't sugar-coat it, it's probably just the daydream of a naive and foolish young god. However, that all said, for this dialogue to be possible and for the stone to be dealt with, I will need to win this competition. So I will do what it takes...anything it takes...to stop that stone falling into anyone else's hands.",
    "I have followers that I trust implicitly. My Guardians, who would be willing to protect the stone...even from me. They will guard the stone from any that would claim it. I would also place other...obstacles. Beyond the stone I would use this as an opportunity for discourse with the other gods. Say what you will about Sliske, he has brought the gods together and now there is a chance for dialogue. I refuse to believe that we must always be at war with one another. We gain so little from conflict. But together...together we could make Gielinor truly wonderful. For everyone.",
    "I'm glad you agree. The stone is a dangerous distraction. Beyond the stone I would use this as an opportunity for discourse with the other gods. Say what you will about Sliske, he has brought the gods together and now there is a chance for dialogue. I refuse to believe that we must always be at war with one another. We gain so little from conflict. But together...together we could make Gielinor truly wonderful. For everyone.",
    "Forgive me, but why do you ask? Our past is not exactly one of cooperation.",
    "Very well. I can appreciate the position you are in, so allow me to attempt my sales pitch. I want the stone, but I do not want it for myself. I want to seal it away, hidden from the world. I want it guarded and protected so that no one may ever call on it again. If I could, I would destroy it. Completely. The power of the stone is too dangerous for any one individual to possess and for everyone to use its power would just be to summon the wrath of the Dragonkin. Better for everyone that it is locked away forever. To that end, I want to win. I will play Sliske's game and I will not be dissuaded from the goal. I will take the stone so that no one else will ever need to again.",
    "Whilst I appreciate your honesty, I don't really think I will assist you in that goal.",
    "What you call cowardice, I call prudence. Regardless your childish baiting will not change my answer. Forgive my bluntness, but you've made yourself quite clear and there really is little point in further conversation.",
    "A trait so often discouraged but one I welcome. Very well. Here is my answer. The stone is dangerous and must be safeguarded. It must be sealed away, or better yet destroyed. As much as I would like to, I do not trust any of the other gods to take such action and so it should fall to me. I will play Sliske's game, I will follow the rule and I will give quarter to no other. I intend to win. And I will not let anyone stand in my way.",
    "There was a time when I considered Saradomin an ally. On the face of it we share many ideals. A desire for justice and a world of order, fighting against the chaos. Of course our definitions of that became quite different. Where I sought freedom for all, Saradomin sought to control. I genuinely believe he seeks it because he thinks it is best for everyone, rather than simply out of a lust for power. I think he is a good man just...perhaps a little to distant from the people he seeks to govern.",
    "I have had little interaction with Seren and she seems to genuinely care for her people, but I fear her tenderness doesn't extend far beyond Tirannwn. If her affections were less species specific then I believe she could be a positive force in the world.",
    "I can never forgive Zamorak for his actions at Forinthry. He was cornered, yes, but there was no need for such soulless destruction. On that day I lost so many people...my friends...because he wanted one last chance to hurt people. Justice is needed, but I must take care not to confuse justice with vengeance. A fine line, that is never easy to walk.",
    "I am not sure what to say about Zaros. He is...enigmatic. He is clearly playing some sort of game, but his motivations...his end goals...they are shrouded and secretive. He could potentially be Gielinor's greatest saviour...but he could also be its end. I just don't know.",
    "No...I did not...what...what did he do?",
    "No...you've said enough...thank you. Let me update my opinion then. Zaros is a monster, anyone that could do that to another sentient being deserves only contempt.",
    "After learning what he did to my aviansie...he's a monster. He deserves only contempt.",
    "He is a noble creature. A guardian of Gielinor's anima. I respect him.",
    "It cannot be easy being the guardian of the Underworld, shepherding people from one life to the next. I imagine it's lonely. I can understand loneliness... He is a brave and noble god who takes his duty seriously and I respect that.",
    "It's a thankless job, but he does it well. I imagine it must be difficult knowing that no one ever really wants to see you.",
    "I wonder what he would do if he were to reach the stone. How would he choose to wield that power? I can't allow it to happen, of course, but part of me is curious as to what the outcome would be.",
    "I have few kind words to say about Sliske, save that he may have achieved the impossible. Because of him, all the gods are united, even if it is in competition. We are all talking, rather than making war. If only he could have done it without mass murder...",
    "Ah...yes. The 'Big High War god'. I suppose you want to know if I feel regret for killing him? The answer is no, I do not feel regret. I feel guilt, yes, but not regret. Bandos was a warmonger, who wanted nothing but constant bloodshed. He would have seen this world ripped apart and everyone murdered. I had to stop that and I knew he would not listen to reason, because he would see diplomacy as weakness. So I did what had to be done. For the greater good of Gielinor. Even though I find such an act reprehensible, there was no alternative.",
    "I fear I know far less about these creatures than you. I know they are dangerous and powerful. I know that they are tied to the stone in some strange binding. But beyond that I know only rumour and legend, likely less than you.",
    "Ha! It's hard to form any meaningful opinion on an insane cabbage. I suppose he serves as an excellent reminder that being a god isn't necessarily a guarantee of achievements past. If anything he's a reminder that wonder and whimsy are as much a part of creation as reason. In that way I like him, he reminds me to laugh at the world occasionally.",
    "Ha ha. Marimbo. My friend let me tell you, never, ever, get into a drinking competition with her. I have a divinely imbued constitution and I soon found myself at a level of intoxication I had never dreamed of before. Let me tell you, a god's hangover is no kinder than a mortal's...actually I feel it may be significantly worse.",
    "What would you like to know?",
    "I...how I became a god isn't important. We are defined by our actions, not our origins. Let us...let us discuss other things.",
    "Abbinah was not a kind world, but it was home. It is a world where resources, such as water, were scares but we solved this by working together. The tribes would work as a single unit, each person taking responsibility for something the whole needed. I remember once I was to keep guard over the Tobi'it nest to make sure that they were allowed to grow to full strength before we feasted. I was barely more than a chick at the time, armed with little more than a stick and the implacable urge to prove myself. I must have whacked about a hundred kasaran as they attempted to feast on the hive. It may seem a rather silly thing to have fond memories of, but at the time I felt like the mightiest of all the aviansie warriors. A hero, defending my tribe from certain starvation. In truth there was likely little danger of that, but it instilled in me, from an early age, that vital notion of duty. That...that we must remember that we are part of the tribe. One of the people... Perhaps one day you will get a chance to visit Abbinah. It may be a harsh world, but there is a beauty that I have not seen in any other worlds.",
    "Being immortal gives you a different way of thinking about families over the centuries. I have had several families over the years and I have loved each one of them equally. I have been son only once, but father and husband I have been twice.",
    "We're talking a long, long time ago now. So long that none who carry my family name, save myself, still live. My father was a scholar. He gathered the history of our people and recorded them for the future. My mother, perhaps ironically, was a priestess of the old religion. She taught me and the other children the legends of the spirits that she believed forged our world. It was a simple life, but a good one. I like to think they raised me well.",
    "I have been married twice so far. Hasma'Dae was my first marriage. He was a proud and noble warrior, one of the generals in my first Guardians. We lived a long and happy life together, but age catches up to us all in the end and he died peacefully in his sleep. Should we all be so lucky.",
    "Please, don't be. It is easy to feel this loss as the curse of immortality, but I prefer to remember that I got to be with him his whole lifetime. I have decades of memories, both good and bad, that will always be with me. I am blessed by this, not cursed.",
    "My second marriage was to Obi'Sooth, a simple farmer. Obi taught me to appreciate the simpler things. Helped ground me. I had lived as a god for so long, it was reassuring to remember what a hard day's work is like. But Obi was taken from me. Not by age, or disease, but by the final retribution of a defeated god. That...that is why I can never forgive Zamorak for his actions.",
    "I adopted Ra'ath and Tepras during my first marriage. Both had been tragically orphaned by the harsh trials of Abbinah and left without a tribe to care for them. Ra'ath was a scholar to be. She was fascinated by stories and history and each day she would come to me with new tales to tell and new things she had discovered. I came to visit her on her deathbed and, surrounded by her grand children, she promised me that death was but another story to discover. The nature of divinity means that I will sadly never get to hear it. Tepras. Now there was a trouble maker. Tepras delighted in practical jokes. He would set up assorted pranks that would be the sufferance of all the tribes. Once he set up an elaborate contraption to make it appear as though my temple was haunted. I spent most of an afternoon calming some of my more... delicate followers. He grew up to be quite the skilled tribe leader, much to all of our surprise. His pranks were born out of a strong sense of empathy, which he was able to use to lead the tribe through trialling times. My time as a father has been a blessed one and I wouldn't change it.",
    "I wandered. Understand, I thought my people lost and I blamed myself. Guthix had banished all of us, and as a result I could not return to my people on Gielinor. Perhaps if I had... But I do not blame Guthix. I understand how much destruction we caused and I was not innocent in this. So I walked amongst the stars and crossed between worlds. Creation is vast and filled with wonder, almost enough to make me forget the pain. I found a world made of pure crystal. A diamond that glistened in the starlight. Beautiful, truly, you cannot begin to imagine. It was so empty. So silent. I sat amongst the glistening peaks of the translucent mountains and my thoughts assailed me. Know that there are few foes so terrible as your own demons. My guilt, my regrets, every wrong I had ever caused...they struck at me from between valleys of pure starlight. It took me far too long to really face them. To admit the wrongs I had done and, ultimately, to promise to learn from them. But this I did. I will no longer let myself make the same mistakes I did in the past. So I found other worlds and I met other races. Some were welcoming, accepting of strangers. Others not so much. On one world I encountered a feline species who spoke only in song. Beautiful. Strangely inviting given what should have been an obvious animosity. Their matriarch sung the history of her people and it was one of mystery, reverence and wonder. Their world was dying though. Its sun growing dark, illuminating them by moonlight alone. Still they sang. Songs of joy, for the time they had had. Not songs for a time coming to an end. I offered to take them to another world, to save them. But they just smiled and shook their heads. I still think about them sometimes.",
    "Thank you, Player, I truly do not deserve such an honour. May our alliance bring this game to a swift and just end.",
    "Greetings.",
    "I merely see no point in being 'fashionably late'. We all want this over with as quickly as possible.",
    "Gentlemen please, there is a time and a place for this argument and neither of them are now.",
    "On second thoughts if we're going to unleash our rage somewhere, I think the perfect target has just dropped in.",
    "I'LL KILL YOU!",
    "Zamorak needs to pay for his crimes!",
    "I didn't do it for your game Sliske!",
    "So this is your plan, to attack us all with dragonkin...again?",
    "Proof that cooperation and understanding are the path to the brightest future.",
    "This is not justice. He should face trial for his crimes, not be corrupted into this...this thing.",
    "Zamorak. He most of all should not be allowed the stone.",
    "Player! Come, come. Talk to me. Did you know that I haven't moulted in millennia? Not a tail feather has fallen from me since I became a god. But this brief interruption of my godhood...it has got me moulting again. The feathers are falling away from my body. I can feel the flesh underneath! And you know what? It feels right  [sic]like I am an aviansie again. Whatever power causes this, I would give a clutch of feathers to replicate it myself. Imagine: sharing the company of the aviansie as an equal. Forgive me, it's exhilarating to lose one's power.",
    "I'm glad it's you. Come, take a seat.",
    "As you wish, whatever makes you comfortable.",
    "It may seem inconsequential to a human, but I haven't moulted in millennia.",
    "Not even a tail feather has fallen from me since I became a god.",
    "At first, that made me feel unbeatable. If time and the elements couldn't ruffle me, then what could?",
    "But then I felt like an imposter among my people. I wanted to be with them, but how could I? Their feathers fell with age. I outlived countless generations.",
    "But this brief interruption of my godhood...it has got me moulting again. The feathers are falling away from my body. I can feel the flesh underneath.",
    "I feel a compulsion to keep pulling away at them. It's pain, but not unpleasant. A mortal's pain.",
    "It's hard to explain, but the pain makes me feel like an aviansie again.",
    "Take this. If I get back to my people, it will be something of a collector's item.",
    "And if I don't get back to my people, well, it will be even more desirable. Do what you want with it.",
    "I'll let you continue on. Let's see if I lose every feather in this place. That'll make for an unusual return to my people. A bald eagle.",
    "Odd, you already have one. Ha! Perhaps this is all a dream. It would make sense. It is a strangely happy dream. I have missed this feeling. The itch of moulting. It makes sense that it is nothing but a dream. Well at least it's a dream I can share with good company.",
    "Fine, I understand. After all, you don't go around handing out parts of your body that have shed to the floor. Or you might. I don't judge.",
    "You've always found time to mete out that fabled Saradomin justice in the past. Are you saying that evil should only be dealt with when it fits your timetable?",
    "He has had the stone before...",
    "Do you not recall the dragonkin burning down Edgeville? Last time I looked, it was one of yours...",
    "You're not waiting for justice, you're abandoning it! The dragonkin should not be free to attack someone else!",
    "It was not always a beast. Who are you to say that it cannot be returned to its noble roots? Have you even tried?",
    "Greetings, Player. A fine place this is.",
    "Saradomin and I were lucky. This one is more feral than the others, and we were able to outmanoeuvre it. It attacked us, but with no real care. I wanted to tie it up, make sure that I deal with it later. Saradomin just wanted to end it now. Everything has to be so simple in Saradomin's world. Will you stay a moment with me and help to cage it? It may slow us down, but it will ensure that it does no more harm.",
    "You have my thanks. I will return for it once the game is done. Saradomin has it wrong. The issue with this dragonkin is of the mind, and I am a living example of a mind being changed. I feel that I can help the dragonkin. No, I KNOW it.",
    "We are not the only people in the game, Player. The rest of the world plays with us.",
    "If we leave this dragonkin to attack on a whim, then the world pays.",
    "Remember as you race to this game's end.",
    "Seren. It is good to meet you properly at last, though it would be better under friendlier circumstances.",
    "Er, thanks. You're...you're not quite what I expected.",
    "Me?",
    "No, that's not what it was, it wasn't murder...it was... Self defence.",
    "I... I knew what he was going to do... I knew the danger he represented...",
    "I... I think we're done here.",
    "Another time perhaps. I...need to think...",
    "I know that time is of the essence, but I wondered if I could talk to you about something.",
    "I agree actually, but you misunderstand me. I wanted to discuss something beyond this game.",
    "Thank you. Seren, both you and I care deeply about our people. You for your elves and I for my aviansie. Both of our people have suffered greatly in our absence. I would like to propose that we find a way to remedy this. We have each relied too heavily on our way of thinking and our own ideas, but these have not always worked out best for our people.",
    "I would like to propose that when we leave this labyrinth, we work together to find a way to help both our people. I...I know about Tarddiad and what has become of the people that were left behind. I...I'm so sorry Seren.",
    "I understand. I am not judging. But there is a way we can help each other. What do you know of Abbinah, my homeworld?",
    "It is a horrible world, don't sugar-coat it. Each day countless of my people die as the islands that were their homes crash into one another. Or they are swept away in the storms. What I am saying is that my people cannot thrive as long as they stay on that world. We need another home. Do you see what I am getting at?",
    "We would share it. My people are fine craftsman and we have many skilled healers and carers. We could help one another. You could provide them a new home and we could help ease the pain of the shapeshifters.",
    "I do not claim to. We have both hurt our people and that damage will never go away. But united, perhaps we can ease that suffering some.",
    "That home has already been abandoned and my people do not need to share the same cities as the elves. Your elves live on the ground and in trees. My avansie dwell on mountaintops and in the canopies. Or we can create islands that float in the sky, like we did on Gielinor. It will be a struggle, it can lead to conflict. But between us, perhaps, just perhaps, we can make it work and save both our people.",
    "It would be my honour.",
    "That is all I can ask.",
    "I would be honoured.",
    "But this...no, you're right I suppose. Seren, if you would permit me. I would speak to you once all of this is done.",
    "I understand. Perhaps after this nonsense we can arrange a time to talk?",
    "Vorago, I do not wish to fight you, rather, I feel our goals may align. I believe that we may be able to help one another, if you will permit it.",
    "My methods? I don't understand what your concern might be. I would consider my goals noble, and my past a reflection of that.",
    "I am deeply sorry Vorago, you... You are right. A victory can be unmade by a single consequence. The war against Bandos wounded more than just soldiers, and it was because of desperation. I have felt the effects of that desperation before and I had hoped never to relive it. I never realised that I already had. I... I was blinded to it by my arrogance. I respect your dedication to your duty, Vorago. I truly hope that some may think of me in a similar light. More so I hope that, with time, I would be worthy of them doing so.",
    "I assure you I would have no intention of doing so. I do not wish any undue pain on another.",
    "That is all that we can do. I wish that no further action I ever have to make should pose such a risk. I am sorry Vorago.",
    "I have no argument with you.",
    "Look. I am not interested in the stone. Not personally. I want to lock it away, far from any gods. I'm here to end this. And I could help all of you! I may be powerless here, but - away from this game - I would free you. I would try to free you!",
    "Yes, all of it. I would dedicate myself to returning you to your noble roots.",
    "Stop!",
    "The pride's a little singed, but I will live. But forgive me for not going the way they left. Goodbye, Player.",
    "If you could save your jokes for someone who isn't aflame, you'd have my thanks. Now, forgive me for not going the way they left. Goodbye, Player.",
    "Murderer, how dare you show your face here!",
    "That was different. You murdered almost an entire species. Your attack on Forinthry...",
    "We could have been reasoned with. We would have listened. We would have accepted a graceful surrender.",
    "That does not excuse what you did. To save your life, you took thousands of lives. You nearly destroyed my entire race.",
    "There were precious few that remained behind on Abbinah, the rest were here, on Gielinor for your war.",
    "No of course not... I...",
    "That does not excuse what you did.",
    "Oh I assure you that I am.",
    "Oh? And who am I really angry at?",
    "*Sigh* You might be right. I do blame myself and rightly so. But I am never going to forgive you Zamorak. I won't strike you down today, but I will not mourn if another does it for me.",
    "It looks like it's down to just the two of us for the stone.",
    "Leave the stone for me!",
    "What cheap trick is this?",
    "You think this will stop me?",
    "Be gone!",
    "I never wanted this stone. Not for myself. It is a source of nothing but suffering and destruction. I will take it from you, Sliske, and I will seal it away where you can never touch it again.",
    "You honestly expect me to believe that all this was really just for a game? For a bit of entertainment?",
    "You call all you have done fun? The harm you have caused? The lives you have ruined?",
    "I have the stone now, I could use its power to destroy you completely, would that be fun?",
    "You're insane.",
    "I will never use that again, nothing would make me!",
    "They're not alone this time Sliske and I have more than enough power to punch that smug smile off your face.",
    "I knew you would use this now. I trust then that you will uphold you end?",
    "But my people?",
    "...[sic] Nothing happened.",
    "I knew you would use this now. I trust then that you will uphold your end?",
    "It is good to see you alive and well my friend. When the stone exploded, the energies cast me out of the labyrinth and I was unable to return. I was consulting my aviansie on a way to dig down to you, when Seren appeared and explained some of the situation. To see an elder god. To be in their presence... What was it like?",
    "Ha, yes. I can imagine it might well be that. We gods are not the creators of life, though we have shaped some cultures. In many ways we are merely mortals with a touch of extra power. But to stand in front of one of the elder gods, the beings that shaped the very world on which we stand...there must not be words to truly describe it. I confess, I am a little jealous. But, by the same token, I'm also a little relieved I was not with you. I think I would have made a fool of myself.",
    "Truly? You stood in the presence of one of the architects of reality. A being whose hands shaped the very ground beneath your feet... And you find it boring? It must be a cold existence to find everything so devoid of wonder.",
    "You survived. When the stone exploded the energies cast me out of Sliske's Labyrinth. Perhaps it's for the best. Zaros and Seren were both right. If I had taken the stone, it would have led to a war and I've seen enough killing. Whatever ill will stands between us, I believe now is the time to set it aside and rise above our petty differences. You can be a force for good, Player, perhaps more than any god ever could be. I would like to think that we can work together for a better future. Until we meet again Player. Ka'skree javal roork.",
    "Greetings.",
    "In some ways I am glad that the stone was destroyed. It is a symbol of slavery, as much as it is a symbol of power.",
    "Now at least it cannot be used to start another god wars. I'm sure someone will find another way to start one though.",
    "It was good to be mortal though. To feel truly alive again. One day, perhaps, I can feel that again."
  ],
  "Zamorak": [
    "Welcome Player, what brings you to me at this hour?",
    "Ah, so you are Sliske's errand [boy/girl] I see.",
    "How the mighty have fallen.",
    "Good. Never let anyone think differently.",
    "Ah, the betrayer returns, ready to serve Sliske further in his final game are we?",
    "Much as I appreciate your help, Player, I prefer to keep my plans to myself for now. Although you can rest assured they will follow my philosophy closely.",
    "Hmm... the World Guardian on my side... I suppose that's too good a gift unicorn to look in the mouth. Very well. My plan is straightforward, I shall play as little of Sliske's game as possible. I will look for every loophole and every secret door and I will find a way to bypass whatever rules he has concocted. Assuming he has any rules of course. You can never tell with Sliske. I shall reclaim the stone from Sliske and I shall not let it fall into the hands of the other gods.",
    "You should be able to make that decision without knowing my plans. You should know from my philosophy. Strength from chaos. Freedom to improve yourself. If you are not swayed by my ideals, then I doubt you will be any less enamoured by my game plans.",
    "Whilst I am impressed with your bravado, know that it is still within my power to destroy you. So remember my mercy now as I permit you to leave, alive.",
    "You betray me in favour of the madman orchestrating this whole affair and you expect me to divulge my deepest secrets to you? Please note that there is a line between chaos and insanity and I fear you have crossed it.",
    "I am pleased to hear this Player. Very well, together we shall win Sliske's little game and the other gods shall bow before us!",
    "No, I think you've made yourself quite clear Player. We have nothing more to discuss.",
    "Try it. It's been so long since I've had the pleasure of watching an avianse burn.",
    "No. Enough of this baiting. Show yourself Sliske. Let's get this over with.",
    "I suppose I should commend you on your chaotic nature, though I see no strength in this action.",
    "I suppose I should commend you on your chaotic nature, though I see no strength in this action.",
    "I suppose I should commend you on your chaotic nature, though I see no strength in this action.",
    "I suppose I should commend you on your chaotic nature, though I see no strength in this action.",
    "All shall fall before us!",
    "No. I will not accept the support of this ingrate. They have made it quite clear that they are no ally to me.",
    "None shall stand against us!",
    "I suppose I should commend you on your chaotic nature, though I see no strength in this action.",
    "I suppose I should commend you on your chaotic nature, though I see no strength in this action.",
    "I suppose I should commend you on your chaotic nature, though I see no strength in this action.",
    "I suppose I should commend you on your chaotic nature, though I see no strength in this action.",
    "I suppose I should commend you on your chaotic nature, though I see no strength in this action.",
    "I suppose I should commend you on your chaotic nature, though I see no strength in this action.",
    "Seren. Let her know the loneliness that my people have faced because of her actions.",
    "Sliske! I know you're watching! Get here now!",
    "I can hear that damned chuckle. Don't think I can't!",
    "This is not what I asked for. Get down here NOW!",
    "ENOUGH. You're the fly, Sliske. All I hear is your buzzing and the smell of manure.",
    "I should have known better than to get an adult conversation from you, fool. Goodbye, World Guardian.",
    "Ah, the mighty Vorago. What do you want with me?",
    "So you can take the stone?",
    "What?",
    "Impressive. But naive. Sliske has his wights, his powers, this maze, and the stone to call on.",
    "Calm down. He is, in a way, correct.",
    "If I 'followed in his footsteps' I would simply try and take the stone. I have no need to follow him, however. I have my powers and my followers. There is no more to discuss.",
    "What do you think this contest is about?",
    "Indeed, although I feel that, in the end, the disposal of the stone is where we differ in opinion.",
    "I feel that we can part without a brawl this time, Vorago.",
    "I know, we can defeat him, but he will simply return. I will not risk everything on a battle I do not need to fight.",
    "Vorago!",
    "What are you doing here? Are you looking to fight me?",
    "Merely? I am Zamorak, and I...",
    "When this is over there will be a reckoning.",
    "...Yes, I do. The battle of Lumbridge and my encounter with Zaros have seen me bruised and humiliated; stripped of power and my wings. Strength through chaos does not mean reckless gambling with my life.",
    "Indeed. But I cannot allow your insults to go unanswered.",
    "I do not need to team up with Vorago. I may have lost my followers but our goals are at odds.",
    "Ah, Nomad...",
    "Nothing of importance.",
    "No. I will see you again when I claim the stone.",
    "You dare slander me with that title, god slayer? You who decapitated Bandos and encouraged a war across all of Gielinor to do so?",
    "Ha! You speak as though I had a choice. You and Saradomin stood beside one another ready to pronounce my death sentence. I only did what I did as a last resort.",
    "You...perhaps. You still cling to the morality of mortals, perhaps trying to convince yourself you are one. But not him. Not Saradomin. He had my death sentence pronounced from the moment our war began. He cannot stand that my message is as powerful as his. That freedom can be just as powerful as his mindless dogma.",
    "Bah, there were others. You had an entire world of them.",
    "Your war. I am not the only participant of the god wars. It was you who brought so many of your race here, as warriors, to fight. Do not blame me for their deaths. It was war and in war people die. If you were not prepared for that, you should not have endangered your people. What did you expect? Did you expect to roll over my forces without a single casualty?",
    "Then you were prepared. Prepared to sacrifice every aviansie you brought to Gielinor and you did sacrifice them. You won and you paid the price for that victory.",
    "No, and I would never pretend that I did. I wear my cruelties with pride. I have done things that some would consider reprehensible, but I have done them for the greater good. I...have made mistakes. I have seen those that I care about die...but I have owned those mistakes. It is time you did too. You are not angry at me...",
    "Fine! You are not only angry at me. You just won't admit who you are really angry with, who you really blame for all their deaths.",
    "Yourself. You brought them to this world. You armed them with swords and spears and sent them out to face my forces. You asked each and every one of them to die. To die FOR YOU. You're angry because they did. Because in you arrogance you thought that you were untouchable and your people invulnerable. Pride can be a terribly powerful weapon, but the blade always points inwards.",
    "I would have it no other way.",
    "Do you think yourself deserving of such fortune, old man? Our confrontation was all but inevitable.",
    "Ahh, but it's different now, isn't it Saradomin? Do you feel it? Feel the weight of mortality on your bones? The ache as your joints grind against cartilage. The stale taste of the air as your lungs struggle to catch each breath? To feel once again the ravages of age and the inevitability of your demise?",
    "Oh I think I might just be. Look at you, you're actually shivering. The great, mighty Saradomin, shivering before me.",
    "You too World Guardian? After everything I thought that perhaps you would see beyond the lies of this bureaucrat? Is that what I am to you? The lord of evil that Saradomin has named me? I had hoped you might have more vision than that. So be it, World Guardian. If you wish to leash yourself to Saradomin, then let the both of you go down together!",
    "Ha, as if those words have any meaning to you any more. But yes...let us bring this farce to an end.",
    "And allow me to put your pet out of its misery as well.",
    "I will not forget this World Guardian. You show your true colours now and they are a sickening shade of blue.",
    "You win this round Saradomin. With your pet World Guardian to protect you I will concede your victory here. But your pet cannot protect you forever and my patience is infinite.",
    "No, you're right. This battle will continue another time. Once I have the stone.",
    "Do you hear, Saradomin, how the abyss calls for you? How the void beckons? I will relish your destruction!",
    "No, you're right. This battle will continue another time. Once I have the stone.",
    "Haha! I take no small satisfaction in this victory my friend and I thank you for your part in it. But we have dwelled on Saradomin for too long and the stone must still be claimed. Until next time.",
    "No. Embrace freedom. Side with me and fight back against the shackles he would enslave the world in! Do you hear Saradomin, how the abyss calls for you? How the void beckons? I will relish your destruction!",
    "Leave? Now? When I could destroy two of my greatest threats once and for all?",
    "You think so? Let me show you how wrong you are!",
    "Yes. You're right. I haven't the time for this. I give you this victory, World Guardian...for it is your victory and not his, but next time I shall not be so lenient.",
    "Run away then. When next we meet I will make you regret your cowardice. The World Guardian cannot protect you forever.",
    "Ha! You will try.",
    "Leave? Now? When my vengeance is at hand? Why would I do such a thing.",
    "Yes, of course. Once we have the stone all of this will be immaterial. You are right Moia, thank you for reminding me. So be it. I shall give you this small victory. Once I have the stone, you shall regret it.",
    "The World Guardian is right. It's time for a rematch I think.",
    "Oh I will be so glad to never have to listen to your arrogant prattle ever again!",
    "Peace failed long ago Player. It died and we should let it pass.",
    "Sliske. He is perhaps a bigger threat to both of us.",
    "I am not without reason Saradomin and the World Guardian has raised a good point. There is more at stake here than our rivalry. And I can always kill you later.",
    "The World Guardian is right.",
    "But they are right Saradomin. So I will not start a fight here today.",
    "I knew that peace was a lie. So let us deal with this is the only way it was ever going to end.",
    "Ha. You are not worth my time.",
    "Bold words. But the stone will never be yours.",
    "That's the difference between you and I Saradomin. You see only the setback, only the problem. I see the opportunities here. The reminder of my own strength. The satisfaction of needing no-one's help to progress. You think losing my entourage has made me despondent? Quite the contrary, I feel invigorated.",
    "I am no weakling Saradomin. I can still destroy you.",
    "I don't need to kill you. I just need to hurt you or battle you long enough that another takes the stone. You think if anyone else has that power that they won't turn it against you? Does Armadyl feel there can be two gods of justice? Does Seren think you're not a threat to her beloved elves? Do you think Zaros will not rebuild his empire on the ashes of yours? Will gentle Icthlarin accept another god's rule?",
    "I would take that as a no then.",
    "So come then Saradomin. Fight me. Waste your time here. Give the stone to someone else. Let me win.",
    "I thought so.",
    "Ahh, behold the mighty Saradomin. All alone. Do you even remember that feeling? Loneliness? Abandonment? Isolation? How long has it been since the great Saradomin felt...anything?",
    "I do not mock you, I pity you. A god remembering that he is just a man with a little power.",
    "I could kill you. Right here, now. You're weak and alone.",
    "So tempting. To slice that throat of yours and gorge on your heart's blood. But I won't give you that satisfaction. I want you to suffer. So I let you live. I let you feel and I let you remember. Like me, you must be feeling your own mortality again. And I'm betting you have not felt that in a long time. Do you even remember what it was like, being mortal? To feel as others feel? To think at their level? I leave you with that pain. With the torment of confusion. The agony of anxiety. To remember that each life you have snuffed out, each loyal follower you have rebuffed, mattered just as much as you do.",
    "Liar.",
    "Kill the elves. I will deal with Seren.",
    "So she flees. At least we have a valuable piece of information.",
    "She values the lives of her elves over even basic dignity. I will use this information when I have the stone.",
    "Try and capture some of her followers. We may be able to use them to get to her.",
    "Before you open your mouth, remember what Seren, beloved of the elves, did to my people. Did she raise us up to crystal towers? Everlasting life? No. She hid behind the mask of Mah and made us eat each other. I don't care what you have to say on the matter. I will have some measure of vengeance upon her.",
    "Very well. If we come across her again, slay her. Otherwise, we make for the heart of the labyrinth.",
    "Oh? And what are you going to do? In case you have not noticed I am stripped of my godhood but not my powers. As such your ability to negate my attacks with your World Guardian ability has been removed. Tell me, how well did your last fist-fight with one of my kind go?",
    "I appreciate you sticking up for your ideals, but don't get in my way.",
    "Enthusiasm. I like that, but no. You seem to be a separate contender in this little game of Sliske's. This is between myself and Seren.",
    "Nothing to say for once, Player? Very well. We have lingered here long enough. Prepare to move on.",
    "I will have some measure of vengeance upon her.",
    "I have nothing to say to you! I have been fed centuries of your lies! You made us kill ourselves, over and over again! And here you are, surrounded by your favourites. What makes you think I want to hear anything you have to say?",
    "I think you should relive the murders we had to commit because of her pretence!",
    "I have listened to 'Mah' here for far too long.",
    "Right? Of course I am right. She masqueraded as Mah to mould us into what we are now!",
    "Let me cut through the self-pity. Seren pretended to be Mah and shaped the Mahjarrat to what we are today. The ritual of power, where we slay one of our own to rejuvenate? That was her idea. We carried it out in her name! Or in the name of the mask she wore to trick us!",
    "For an age we adored her as you do now, and all we got from it was fear, terror, and paranoia. Where do you think my philosophy comes from? We are all abused and wandering children, 'Mah'. At least we did not have to suffer your hypocrisy of destroying yourself out of 'love' and then torturing us from beyond the grave. And I am glad we did not turn into twisted addicts like your other 'favoured children'.",
    "Save your speeches. I have to claim the Stone of Jas. Then we will talk.",
    "Kill her.",
    "She cannot use her power to escape forever. If we find her again, strike without mercy.",
    "Hold, Blacklock. Hello Zaros, Azzanadra.",
    "This is Moia. Lucien's daughter.",
    "Moia is a loyal and capable servant. She is also perfectly capable of speaking for herself.",
    "Sliske! Why don't you come out here personally?",
    "Then at least do us the favour of shutting up.",
    "Be quiet, Sliske.",
    "BE QUIET SLISKE!",
    "Yes.",
    "Of course, while we're both here, stripped of our powers...",
    "This would be the perfect time to complete the rebellion.",
    "Yes.",
    "It is very, very tempting, but no.",
    "Because the rebellion is thousands of years in the past. Because you helped to save my people again. Because we share a mother? But also because perhaps... I finally realise that I have nothing to prove to you. In your absence I have conquered worlds. I have brought death to whole races and brought redemption and renewed hope to others. Six thousand years ago I wanted to prove that I could be a better leader than you. I have since proven that a hundred times over.",
    "Yes, you said that to me back then as well. When I first became a general of your armies and swore to do your bidding. We have not spoken like this in so long. My lord, I feel...'loyal'... Wait...",
    "Then this feeling of calm...?",
    "Goodbye, my l... Zaros.",
    "It looks like it's down to just the two of us for the stone.",
    "Leave the stone for me!",
    "What cheap trick is this?",
    "You think this will stop me?",
    "Be gone!",
    "Spare me your false accolades Sliske, I have won your game. The stone is mine.",
    "Why tell me all of this? All I need to do is not use the stone and your plan unravels.",
    "I think I can help even the odds a little against you Sliske.",
    "Yes, I expect you to invoke it here. It is a fair exchange for the salvation of my people.",
    "Welcome Player, what brings you to me at this hour?",
    "What is there to say? Sliske is dead and the stone is gone. Good riddance on both accounts."
  ],
  "Death": [
    "This is reckless Icthlarin, you do not have the power of the other gods. They could destroy you.",
    "In you I have the greatest faith, it is in them that my faith wavers. They cannot be trusted, they will not show mercy.",
    "We expected as much. The eclipse is looming and with that comes Sliske's 'game'.",
    "It has been a topic of much discussion of late.",
    "What else are friends for?",
    "Perhaps not. But you shall have it all the same.",
    "It never is.",
    "Thank you. It is actually this that Icthlarin and I wish to speak to you about. Icthlarin and I have come to an agreement. Neither of us will seek the stone. We have no true need of it and we cannot adequately protect it from all of the other gods.",
    "Guthix believed in you. He trusted you with decisions of this magnitude and who am I to act against him?",
    "But we have been invited to the game and if we are to attend it will be by your side. Together we might be able to stand against those who will stop at nothing to claim the stone.",
    "What else are friends for?",
    "Perhaps not. But you will have it all the same.",
    "I am not playing your games Sliske.",
    "This entire situation is ludicrous and we stand opposed to it.",
    "Hello Player.",
    "How is Icthlarin doing, Player?",
    "I agree, but there's no time. He's still strong, regardless of his current state. Trust in that.",
    "He can, but he still needs you. This is a maze, after all, and Sliske would dearly love to see him lost in it.",
    "He may not be himself, but there's a small part of him in there, remembering everything you say. I would keep that kind of comment on a tight leash. Uh...sorry Icthlarin.",
    "However, I feel I should mention something, Player. As a guide for the dead, I know certain things. When a mortal will die, for example, so that I can be present at that crucial moment. If I turn my mind to it, I can know the fate of any mortal being. I can recall it like a memory. This has never worked for the gods. As beings of pure divine energy, they have no afterlife. Their soul doesn't pass into my hands. But here...their power has dissipated and something akin to a soul has taken its place. Should they die here, they would be mine. And since they're mine, I know their fate.",
    "... Yes. It's hazy, the soul they have gained is newborn. And, while they have a soul now, it will die as soon as they regain their godhood. But I can see you're curious and won't let this go, and we need your mind on the maze. Ask me about the death of one god. Choose wisely.",
    "I feel a burning as hot as a star, and then a giant blackness. I feel a prolonged sadness that has come to an end.",
    "I feel relief, the joy of acceptance. There is singing, so loud that I can barely think. My mind is on the past.",
    "I hear the crossing of swords and the warmth of light, then the coolness of shadow. These continue, light then shadow, until I pass.",
    "I feel the lightness of my being, soaring perhaps, and then a fall. I let the ground take me. But this is not a sad moment; I am full of pride.",
    "Poor Icthlarin, I feared looking into his future... His end is painful. The rending of teeth, the taste of blood. He dies fearing for others, and that is what truly kills him. Though it breaks my oath, I will never let that happen. I can't let him feel that kind of pain. Not Icthlarin.",
    "I feel the rock beneath me as shadows peer down. I hear their chattering like crickets. They are sad. There is no happiness there.",
    "Are you alright World Guardian?"
  ],
  "Icthlarin": [
    "They could try. Do you have such little faith in me?",
    "And I would not seek it. But come, there is another time for this argument, we have a guest.",
    "Nothing you should concern yourself about my friend. Death is just concerned for me. He worries that I will not return from Sliske's game, but I must go regardless. It was I who brought Sliske to Gielinor, a mistake that I must do everything I can to correct.",
    "What mockery is this? He has scented it with Nomad's vile stink. He bates me with reminders of my failure. Does he think of me as another one of his puppets? If he thinks I am so easy to manipulate, he is sorely mistaken.",
    "Sliske expects me to play into his game, like the other gods, to charge desperately for the stone. But what use would I really have for the stone? I am not like the other gods, I do not act for want of power. I have no ideology to push, or agenda to promote. I am the guardian of the Underworld and that is my solemn duty. I should turn away from this game altogether, yet my duty binds me otherwise. For what harm the other gods could do to the Underworld with the stone. Or how many would I be forced to ferry across should the inevitable war break out. So I must take part in these games, but I shall not do it in my name, I shall do it in yours. In all we have been through together, I trust you to fight for the best outcome and I shall trust your judgement.",
    "Be careful of the lure of power, Player. It is a seductive song, but a deadly one.",
    "Now go. Complete whatever menial task Sliske has set you. When the time comes, know that I am with you.",
    "Ah, hello Player, I assume you are here with regards to the impeding eclipse? It is, after all, what heralds Sliske's summit. Since no one has really been playing his game, I suspect it won't be as simple as he first implied.",
    "But, with our help, you can. We have agreed to put our support and our faith in you.",
    "And let's be honest, what need does the guardian of the Underworld have for the stone? I have a duty and the stone would only distract me from it.",
    "Be careful of the lure of power, Player. It is a seductive song, but a deadly one.",
    "Now go. Complete whatever menial task Sliske has set you. When the time comes, know that we are with you.",
    "Do not pretend to comprehend my duties Saradomin. Your attention only focuses inwards, I serve a greater purpose.",
    "I didn't do it for your scoreboard. I did it because such an abomination could not be allowed to threaten the Underworld.",
    "No one should have such power. In the wrong hands it could upset the natural order of things.",
    "Will this abomination never die?",
    "Th... Thank...you.",
    "Thanks...to you.",
    "Sorry... I...burden.",
    "Player, it is good to see you. I am glad that we could find each other so quickly.",
    "No I cannot explain it, but no. No I am not ok. It feels as though I am slipping away. My mind has become foggy...muddled... I... *Sniff sniff sniff* You smell of friend...",
    "I... I am sorry, that... I just...what's happening to me?",
    "Grrr",
    "Grr put...put me back...",
    "Grrrrr",
    "Grrrrrrr",
    "Please, Player...you cannot know how this feels... It's like..it's, er, like...",
    "Grrr, I...will make you...pay for this... Sl... Sliske.",
    "Because...bad man...",
    "Please...not you Player. Don't laugh with him... I am falling away. My thoughts descend into fog... Memories are being torn apart and scattered before me. I barely know my name... I... I am scared Player. So scared. I don't want to be lost. I don't want to forget everything I am. I... I need you... I need you to remember who I am... for me.",
    "Thank you. Player friend. I mean...thank you...my friend...",
    "I... I joke to you...thought... Thought Player friend?",
    "Yes...good boy...master happy. I happy... No. P...please... After all we've been through...why are you so cruel?",
    "Forgiven. Friend.",
    "SLISKE! End this!",
    "Player, don't...don't leave me here alone. May I come with you?",
    "Thank you friend.",
    "Er...let's get through this as fast as...er... Fast.",
    "Er...let's get through this as fast as...er... Fast.",
    "Icthlarin will try not let friend down.",
    "No...please... I need someone who knows my name. Don't leave me in the silence where I can hear my sentience slipping away. Don't be so cruel.",
    "You...yes...you go. I'll... I'll be ok.",
    "Yes! Icthlarin will be good. Icthlarin help.",
    "I am not so far gone yet... Though how long until I am...I... Let's go.",
    "How can I help you, friend?",
    "I am worried. But I am still...somewhat...myself.",
    "I would very much like to be out of this labyrinth as soon as possible.",
    "There is magic everywhere, I recommend we look for the glowing places. Glowing means magic and that may lead us onwards.",
    "I remember bringing the Mahjarrat to Gielinor. I was naïve to think I could control them. I should have realised then that Sliske can't be trusted.",
    "I remember father and mother. I remember them leaving me.",
    "I remember the beast Gielinor. Bad monster... I mean, it was an abomination. Glad to have destroyed it.",
    "I remember when we first met and how my sister had bewitched you so... I suspect she would not be so successful now.",
    "I remember...a green door...No...wait... Was it blue? I can't even remember colours... I need to get out of here.",
    "Yes friend?",
    "Scared. Can't... Barely know my name. Frightened. Place smells bad, smells old and...and forbidden.",
    "*Sniff sniff*",
    "Go home. We go home now? Home?",
    "Go home. Leave place. Place bad!",
    "Walls hurting. World hurting. Anger and hate.",
    "Need to go. Need to go!",
    "Amascut. Grrrrrrr. Hurt friend. Tricked friend. Bad.",
    "Grey door...led to home. Led to warm. Door gone now.",
    "They left me. Left me all alone. Lonely.",
    "Souls in pain. Grrrrrr. Monster made of them. Grrrr. Kill it!",
    "Stern judges. Bad creatures. Not loyal. Cannot trust.",
    "Woof?",
    "Grrrrrrr",
    "Slipping...only fog... *Sniff sniff* Woof!",
    "Woof! Woof!",
    "Woof... H...help me... Can't... Can't remember...help.",
    "Grrrrrrr",
    "Slipping...only fog... *Sniff sniff* Woof!",
    "Woof! Woof!",
    "Woof... H...help me... Can't... Can't remember...help.",
    "Grrrrrrr",
    "Slipping...only fog... *Sniff sniff* Woof!",
    "Woof! Woof!",
    "Woof... H...help me... Can't... Can't remember...help.",
    "Grrrrrrrr",
    "Grrrrrrrr.",
    "Hello my friend. It is good to be myself again. I am sorry that my condition made me less than helpful in that labyrinth.",
    "It is good to hear you say that...",
    "Are...are you ok Player? There is something about you that is...off. A shadow I can barely see.",
    "I heard nothing. What did you hear?",
    "I am sorry for that. I was... not myself.",
    "I imagine that you must be tired after everything. I think you have earned a rest. In one day, you have slain one of the greatest dangers that Gielinor has faced and you have witnessed the destruction of the most powerful artefact in creation. And, if what Seren told us is true, you have come face to face with one of the creators of the universe itself. That you are even here at this point in time is a monument to your ever growing legend. Sliske's death is a cause of no small celebration to most of us but there is one person who will be hurt hard by his passing. Relomia is a poor, broken girl who has known only loneliness for most of her life and has clung so desperately to Sliske that she has known no connection with another living being. In her small world, I believe you may be the closest thing she has to a friend. Whatever we may feel of Sliske, Relomia has always been an innocent. It should be someone she trusts who gives her the news of Sliske's passing. You should speak to her now.",
    "I am myself again, which is a good thing. In that maze I was not. I was...losing myself.",
    "It was an experience of indescribable horror. To find myself losing my ability to remember...to even think.",
    "But it is done now and I am Icthlarin again. I must push such feelings aside, because I have my duties.",
    "My mother and father, Elidinis and Tumeken, lived among their followers, not above them. They wanted to be as they were.",
    "But there was one thing that, try as they might, they could never have. A family.",
    "At least, not what mortals would consider to be a family.",
    "As I was told, they each took a piece of themselves, a spark of their divine power, and combined them into something new.",
    "Something formed of the both of them. They then placed this energy into the two beings most akin to their family.",
    "I was their pet dog. Not the most esteemed of beginnings, but it is not one I am ashamed of.",
    "My sister, Amascut, began from similar humble beginnings, as their beloved cat. Though she has long fallen away from that person.",
    "So when the labyrinth robbed me of my divine nature, I began to revert back to that simple creature.",
    "I suppose my origins explain why I find herding souls through the underworld so...satisfying.",
    "I am unsure my friend. I am hardly an expert on the dragonkin.",
    "But we were in the Heart of Gielinor, where the anima of Gielinor flows.",
    "If they found a way to harness that much energy, to channel it into the stone. I can't imagine even the stone would survive that.",
    "Goodbye, my friend."
  ],
  "Seren": [
    "After what you did...after what you made me do? How can I trust you?",
    "She was our mother.",
    "That's not fair...",
    "No. It really isn't.",
    "The Catalyst. It cannot fall into their hands.",
    "Perhaps they should. Perhaps this is the way of things. Gielinor's destiny.",
    "Perhaps. But we should discuss this at a more private time, we appear to have company.",
    "Of that you can be certain.",
    "Zaros and I have...well it is a private matter. Forgive me but I have no desire to discuss it.",
    "Of all the things I should do to my brother, trusting him is at the bottom of the pile. Zaros always has a motive behind everything and that motive is always 'what best serves Zaros'. I have sworn I will not willingly aid him in any of his future schemes. You were there, you know why I can never aid him again.",
    "On that we are both agreed. Zaros is many things, but trustworthy he is not.",
    "I imagine you must be here because of the eclipse. Sliske is gathering all of the gods for his big game and I rank amongst them.",
    "Friend as you are to my people, Champion, there are things at play that go beyond Sliske's little game. Dangers far greater than you have faced before. Know that I seek the stone. Not to use it. Not for its power, but to keep it out of the hands of those who would abuse it. And I fear that all mortal life is in danger of such an act. The stone's power is seductive and subtle, as much as it is overt. In some ways it wants to be used and it lures even the purest of hearts to claim the power it offers. Stoic and strong as you are, in both character and fortitude, I fear even you would be corrupted by it and so I must keep every advantage I have to safeguarding the stone. Do not take this as a personal slight on your character, I trust you implicitly Champion. I just do not trust the stone.",
    "No. Do not. You lack the experience to understand the pain I feel. For aeons she has been there, a part of me. I have known her presence throughout my entire life... And now she is gone...at my hand... Imagine one day all the warmth in the world were to suddenly vanish. Or perhaps all of the sound, or the air in your lungs. Imagine that loss and the burning pain that comes with it and perhaps then you might understand the tiniest fraction of my suffering. Forgive me. There is a time for melancholy and it is after Sliske's game has concluded.",
    "HOW DARE YOU! I did what I thought was right! I made a terrible choice, yes, but it was an answer at the time. Can you say you have never done the same?",
    "We all have our answers after the fact. We all have our alternative solutions. You were not there, you could not know. I did what I felt had to be done. But I do not need to justify myself to you. Go, we are done here.",
    "Perhaps? You come here and stand in judgement of me over this? I have already been punished. I have taken the life of my own mother. Whatever sentence you would inflict on me to meet your mortal sense of justice, it cannot even begin to compare. Go. We're done here.",
    "We have nothing more to discuss.",
    "And give Sliske exactly what he wants? He wants us to fight. He wants to turn this into the next god wars.",
    "You can stop this madness Sliske. Call off this game. Let this end.",
    "Thank you Player.",
    "Considering our previous interaction, your sudden support of my cause confuses me, but I will not turn it away.",
    "Thank you for your support World Guardian.",
    "This game is pointless Sliske. But I shall name Zaros as my target, if a target must be given.",
    "Is it a mechanism, Tangwen?",
    "Think outside of your fields. Is there anything in history that this reminds you of?",
    "Ha! I see where you're going with this! Yes, yes, there have been a couple of instances. The World Guardian. They say that the World Guardian can nullify god magic. That's from Guthix, the anima, so they say.",
    "I think I know. World Guardian, do you? Who, or what, is responsible for the depowering of the gods?",
    "I can't think! My thoughts are like sticks layered on each other. I try to pick up one and the others fall away. Can you help, Player? Who, or what, is responsible for the depowering of gods?",
    "Let's hope that you are wrong. If this is Guthix, then his power is being used in ways that contradict his nature. This isn't the Guthix we knew. This is a dark mirror of Guthix.",
    "I hope that wasn't a confession, World Guardian. If you are behind this, then you have made more enemies than you can hope to deal with. And your World Guardian ability cannot protect you from gods-turned-mortals. That's not a threat from me; that's a warning from a friend.",
    "Perhaps. But the anima is a reactive force: it protects itself, and doesn’t pre-emptively attack. That would mean the anima is being used for ill, which worries me more than Sliske with the stone.",
    "I agree with you, but there are implications. The Stone of Jas does not simply have a switch that says 'turn god magic off'. Only a seasoned user would know how to generate that power from the stone. Either Sliske has become extremely proficient, or someone else is aiding him. Someone extremely powerful.",
    "The Sword is a symbol, not a thing of any genuine power. I would be extremely surprised if it's the source of this magic.",
    "That is not an option I had considered. An elder god, in collusion with Sliske? Nothing...nothing good can come of that. But I see in your eyes that it's true. I won't question how you know, but I trust in it. I fear that I must go against my nature. I fear that I will have to work with 'him' to even be heard by an elder god.",
    "Thank you for your insight, regardless, Player. Let's continue in this rat maze. I am sure we will meet again.",
    "Hello Player. You find me uncharacteristically alone in this place. It is odd being without my elves. I am used to the chorus of their breathing, against the rhythm of their heartbeats. You probably don't notice it, but to me it is a constant symphony in motion. A reminder that the world is not empty and that I have done some good, amongst all my regretful mistakes. But now the silence is deafening. All my mistakes, all my regrets and poor choices. It feels as though they slink out of the silence to assault me. I have made so many terrible, terrible missteps. From the horrible solution I gave to the mahjarrat, which at the time seemed so reasonable. To the accidental curse I have laid on my beloved elves. So gentle, innocent, and now doomed. All because I was too selfish to let them leave me. In the silence I wonder if I will always do more harm than good. Is my existence to be one where I hurt all those around me? Tell me Player, can I be redeemed?",
    "Thank you. It means a lot to hear that. Come. We should leave. I cannot mope around here all day, Sliske's game still endangers us all.",
    "It hurts to hear that World Guardian. To know that even you believe me so without hope. I'll leave you to this game. I shall at least try and prevent further catastrophe this day.",
    "It is good to meet you as well. Your feathers are much prettier in person.",
    "So few of us are. We each have images of one another in our heads and those images are very rarely right. Take you for example.",
    "Armadyl, the god of justice. Yet here you are, taking part in a game that was encouraged by murder; to many cultures the worst of crimes. The image most would have of such a god, would be one repulsed by this event. But instead you were one of the very first to actually commit that crime.",
    "Was it so? I can see that, but did you not start building your war machines long before there was a real threat?",
    "Forgive me, this is not admonishment. I see why you did what you did. I understand, but it is not the path that an avatar of justice would take. As justice can only be administered once a crime has been committed. Not before.",
    "Did you not want to talk about something?",
    "Yes, these games, whilst terrible, have at least provided some of us an avenue of discourse. I am pleased to meet you as well, Armadyl.",
    "Forgive me, Armadyl, but I will not aid you in getting the stone. It is not something that should lay in the hands of mortal gods.",
    "Time is of the essence, I fear there are more pressing concerns. Forgive me.",
    "Very well, if the Champion of Prifddinas urges it, I believe it is worth the delay.",
    "Where are you going with this Armadyl?",
    "Yes... They suffer so. But I...I cannot leave my people on Gielinor to save those who remain behind...",
    "I have visited only once...it is...",
    "You would give them Tarddiad?",
    "Forgive me, you do not have the power to undo what has been done.",
    "What you ask is to give up the ancestral home of the elves and to give sovereignty in part to those from another world.",
    "What say you Champion?",
    "Hmm, your idea has merit Armadyl, but it needs more discussion than we can justify here. Come to Prifddinas after this madness, we can discuss it then.",
    "Yes. That is my concern as well. Still, I am not so bold as to dismiss it out of hand. After all this madness is over Armadyl, I will come visit you. We can discuss this further.",
    "You are right champion. It is a big discussion, but it is one worth consideration. Armadyl, when all of this is over, come to Prifddinas, we can discuss this further.",
    "I would welcome that.",
    "No. Forgive me Armadyl, I do not distrust your character but what is at stake is bigger than you realise and I cannot risk unknown variables.",
    "Perhaps.",
    "Saradomin.",
    "I would speak with you privately, if you will consent to it.",
    "I am sure.",
    "Wise words, Player.",
    "It appears we have nothing more to discuss. Please, let us part peacefully.",
    "Very well. Please leave us, Player.",
    "I too will stand by any judgement Player makes.",
    "I want you to withdraw from the competition.",
    "I believe you might be able to reach the stone, which is why I ask you to withdraw. Do you think the Stone of Jas will be yours without consequence if you win? That Sliske will simply let you take it and leave? This is a trap, the edges of which we are only now beginning to feel out. Something, a force beyond your imagining, has stripped all the gods of their powers. Why do you think that is?",
    "Yes, and also to strip us of any foresight or premonation of when this attack could take place.",
    "That was a long time ago.",
    "It is your choice, although I fear it will not end well.",
    "I have no need for bodyguards, but yes, my advisors have been sent away.",
    "I would like to speak with you in private.",
    "I would prefer to speak with you alone.",
    "If you will not listen then let us part peacefully.",
    "I request that you withdraw from the competition.",
    "Don't you see? This is all Sliske's plan. Even the one who 'wins' the stone will likely fall into an even more convoluted trap. Do you think he will let you walk away with it, unharmed?",
    "I will respect your decision. Please, let us part peacefully.",
    "Saradomin. It is good to meet you, especially without your bodyguards.",
    "No. I wanted to speak with you, privately. I know it must be difficult for you to speak openly in front of your followers.",
    "Do I? Or do I know from experience what that can be like? Please leave us for now.",
    "I insist. Please let me speak with Saradomin in private.",
    "I am happy to speak in front of them. There is little we can do to stop them after all.",
    "I too will stand by any judgement Player makes.",
    "I want you to withdraw from the competition.",
    "I believe you might be able to reach the stone, which is why I ask you to withdraw. Do you think the Stone of Jas will be yours without consequence if you win? That Sliske will simply let you take it and leave? This is a trap, the edges of which we are only now beginning to feel out. Something, a force beyond your imagining, has stripped all the gods of their powers. Why do you think that is?",
    "Yes, and also to strip us of any foresight or premonation of when this attack could take place.",
    "That was a long time ago.",
    "It is your choice, although I fear it will not end well.",
    "Zamorak, I...",
    "No; we leave. I will not risk your lives.",
    "Zamorak, I...",
    "He is talking about something from deep in my past. A shameful act that, at the time, I felt was necessary.",
    "...Yes.",
    "I have changed, Zamorak. Time has taught me...",
    "Wait, please!",
    "I will speak of this later. Not now. This is not the time.",
    "Zamorak, I...",
    "You are not as powerful as you think you are Sliske. We are beyond your tricks.",
    "But a war, Sliske, it would wake them. You must know that the elder gods sleep below us and you know what will happen if they wake!",
    "But why could you possibly want that? It's madness!",
    "I am not above destroying you Sliske, you've proved yourself a danger time and time again.",
    "You are not as powerful as you think you are Sliske. We are above your tricks.",
    "Why Sliske? Why do you want this?",
    "No. Armadyl my 'plentyn diniwed', I free you from his bargain and invoke my own. Whilst it pains me to do so, our geas must now be invoked.",
    "Will be protected. Your bargain with Zaros is annulled, but I shall fulfill his obligations in his place.",
    "I have taken your obligation Zaros. Do you think I could not see the strands of fate you have woven between yourself and the gods present? You have always seen fate as a web. I have always known it as a tapestry and I have rewoven the strands so that you cannot take advantage here.",
    "I know know why you need it brother, which is exactly why I have taken it from you.",
    "What...how is this possible?",
    "This is not over brother, not by a long shot.",
    "You are not as powerful as you think you are Sliske, we are above your tricks.",
    "You cannot do this Sliske, you know that this would merely be the beginning of the conflict; not its end. The stone in the hands of any god would be war. You know that and you must know what happens if war breaks out on Gielinor.",
    "Saradomin, I am sorry, but I cannot allow Zaros's oath to stand. I invoke our geas my 'tad poeni', the stone must not fall into Zaros's hands.",
    "For all your talk of acting as the guiding hands of fate, you've never been terribly good at understanding it. It's always been a web to you, something that people are caught in. But I know it as more of a tapestry, where, in the right hands, the threads can be unpicked and rewoven. So I took your bargains and replaced them with my own. I will fulfil your obligations and in exchange I will keep the stone out of your hands.",
    "Adrasteia is safe Saradomin. My elves rescued her from Nex's talons and she is being kept safe and out of Zaros's clutches. She will be returned to you safe and unharmed, but I must regrettably request the stone in exchange.",
    "Yet I have. I told you before I will always stand against you, let this serve as a reminder.",
    "I... I don't understand.",
    "On the contrary Zaros, my elves have already liberated her from Nex's talons and she is safe in our custody now.",
    "You can try, but we will not hesitate to retaliate with our full strength. Surrender this oath to me and save yourself. You cannot win this.",
    "You...forgive me? Your arrogance really does know no bounds. You have already burned our bridges Zaros, I will NEVER forgive you for Mah. NEVER!",
    "Saradomin, Adrasteia will be returned to you, safe and unharmed, but I must take the stone in exchange.",
    "You are not as powerful as you think you are Sliske. We are beyond your tricks.",
    "You cannot do this Sliske. You know that any god being in possession of the stone would be an act of war. It would plunge the universe into chaos.",
    "No Sliske. This won't be as before. The World Guardian does not stand alone. I stand with them.",
    "So, you had an audience with Jas and didn't become bound to an elder artefact, I'd say you've done quite well.",
    "My brother left, in quite the fury. I imagine this is not the end of his scheming and I fear he may get more dangerous now. If I may ask, what did Jas want?",
    "I understand.",
    "Farewell, Player.",
    "... That is quite the burden, I am sorry Player. By what criteria will life be measured?",
    "For what little it may be worth, I will be your ally in this. I know the value of mortal life. It is brief, but beautiful, and should be protected. You have my aid, when the times comes. Farewell, Player.",
    "It will be a heavy burden. Perhaps with a bit of luck it may humble you. Farewell, Player.",
    "If I may ask, what did Jas want?"
  ],
  "Zaros": [
    "You cannot. What you did...what I made you do, it is unforgivable. We are both damned by it. But it was a necessity. The only solution to the damage you had wrought.",
    "No. She was our creator. I know enough of my study of mortals to see the difference between the two. If they had been your elves, would you have even hesitated?",
    "Little is. We both know enough to be certain that the universe does not recognise it. Regardless, I come to you not in the hope of reconciliation, for I know that is not possible.",
    "I come in the expectation that you recognise the danger here. That we cannot stand in opposition.",
    "No. It would be catastrophic; the damage they could do. It could wake them prematurely.",
    "You do not believe in destiny any more than I Seren. You know that events must be guided, orchestrated, things happen because they are made to happen. Not because the universe has decreed it.",
    "World Guardian, well met. If you are here, it is, I suspect, for her company. I shall leave you two alone. We shall speak again sister.",
    "I see. Thank you World Guardian. I will leave you two alone now.",
    "To destroy each other now would serve no purpose except for Sliske's amusement. Calm yourselves and be rational.",
    "Enough showboating Sliske. We are all here, get on with your charade.",
    "Sliske. End this madness now. The stone cannot be a prize in these games.",
    "Saradomin.",
    "It is the most logical decision.",
    "No. There is no value in further discussion on this.",
    "Enough!",
    "You are squabbling before the World Guardian.",
    "Hold, Vindicta. This is Player. They may still have use to us.",
    "Witness: the patient wisdom of my closest advisors. What say you, World Guardian?",
    "That is enough, Sliske.",
    "Lies, Char. You know I was aware of nothing.",
    "Enough. We must continue.",
    "World Guardian.",
    "It is an unnecessary formality. Sliske loves to caper and play the fool, but his time now is almost at an end.",
    "It is not a question of winning or losing. I have never seen the need, or felt the desire, to participate in mortal entertainments and this is no different. I have made sufficient effort to ensure that whatever the outcome, things will transpire according to my design.",
    "Hello, Sliske.",
    "You underestimate me, Sliske.",
    "Is there something you want, Sliske?",
    "I must continue. Perhaps we will meet again at the end.",
    "Yes. She is not important. The secret of her creation died with Lucien.",
    "We must do nothing of the sort. Moia is here as Zamorak's agent, and Zamorak and I have come to an understanding, as you should remember.",
    "On that matter at least we can agree.",
    "It is time to leave.",
    "Yes?",
    "By killing me?",
    "And will you do so?",
    "Why not?",
    "Good. It was always my hope for you that you would fulfil your potential. I simply did not anticipate it coming in the form that it did.",
    "Sliske must not know. I will not take advantage of you.",
    "It is not real. Your rage will return. Your rage at me, in particular. But I urge you, Zamorak, for the sake of the warlord who once showed so much promise, and the righteous divinity you have become: do not let it master you. Come, we must go.",
    "Sliske. Stop this. You know what this will lead to.",
    "Sliske, you know what this will do. The stone in the hand of the World Guardian, a powerful mortal with ties to all the gods? It will lead to war. The gods will see it as a threat. Or they may feel they are strong enough to take it for themselves.",
    "Oh Sliske, my poor child. Had I known the depth of your madness, perhaps I could have saved you.",
    "I heard your promise to Sliske, World Guardian. I will hold you to that.",
    "If you give me the stone you will stand as one of my most trusted allies.",
    "Together we can change the world.",
    "Forgive me Player but I cannot let you take the stone. I have a great fondness for your potential and I believe you are necessary for a truly prosperous future. But if you take the stone now, you will plunge the universe into war and I cannot allow that. Give me the stone, or I will be forced to destroy you.",
    "But perhaps I can.",
    "Come now Sliske. We both know that this is only the beginning of your game. You know well that any god possessing the stone is just a precursor to all-out war.",
    "Oh Sliske, my poor child. Had I known the depth of your madness, perhaps I could have saved you.",
    "Armadyl, my Praetor Plumalis, it is time to uphold our bargain.",
    "Yes. When the time comes, you will have my complete support. I can no more change that than you can deny me now. But now, by the terms of our pact, you will give me the stone.",
    "Seren, what have you done?",
    "No. The stone should be mine! It is vital to my...",
    "Did you really think you were the only one that can knit together the threads of fate Seren? Thanks to the World Guardian I am fully restored and with that comes my vision. I saw your clumsy effort to rethread the oaths I have forged before today and I unmade it. Armadyl's oath holds.",
    "Yes. When the time comes, you will have my complete support. I can no more change that than you can defy me now. But now, by the terms of our pact, you will give me the stone.",
    "On the contrary Saradomin. There is one more roll of the dice.",
    "Why Sliske? Why do you want this?",
    "Oh Sliske, my poor child. Had I known the depth of your madness, perhaps I could have saved you.",
    "No. Saradomin, my Praetor Barbatus, I invoke our oath!",
    "It is too late to rail against our agreement Saradomin. The terms were clear and your agreement was not coerced.",
    "Your daughter is safe Saradomin. Nex found her on one of the Obsidian Tribunal's worlds. She is safely in my possession now. Give me the stone and she will be returned to you.",
    "Seren?",
    "No! You will not take the stone from me!",
    "Did you really think I could not see your subtle manipulations Seren? Did you think that you alone could re-weave the strands of fate that bind Saradomin and myself? I am restored to my full strength and my plans are not so easily undone. Saradomin, you will give the stone to me.",
    "Nex found her on one of the Obsidian Tribunal's tomb worlds, she is in my custody now.",
    "Return her to me Seren, you know I must fulfil this oath and I will shed elven blood to do so.",
    "What you have done here today sister, it cannot be undone. I cannot forgive you for it.",
    "So be it. I pass the oath to you. I will not start a war.",
    "This game must end now Sliske.",
    "Why Sliske? Why lead all the worlds to war again?",
    "Oh Sliske, my poor child. Had I known the depth of your madness, perhaps I could have saved you.",
    "No. Zamorak, my Legatus Maximus, the time has come for you to honour our bargain.",
    "As will I.",
    "Jas. I am Zaros, firstborn of Mah. I come to claim my birthright! I possess the core of Mah. In her absence in your pantheon, I ask to take my place.",
    "I urge you, see reason. With Mah dead your numbers are diminished, you need me to take her place!",
    "Why do you deny me? Look at what I have achieved! Imagine what I could achieve. I have Mah's core. I am forged from her energy. How could you deny my claim?",
    "NO! I will have my birthright!",
    "Then tell me why. What must I do?",
    "But what of the life I have created? The nihil, Nex?",
    "I have learned enough to know that there are no absolutes. If I can create life, you will accept me as one of you!",
    "We shall see about that. I will not be denied."
  ],
  "Mysterious voice": [
    "Yes...Armadyl. He should pay. Strike him down now. Kill him. Vengeance could so easily be yours.",
    "Oh well. If you insist."
  ],
  "Sliske": [
    "Welcome. Welcome. Oh it's so very good to see you all here. Well, actually, I had rather expected there to be fewer of you. But we make of the situation what we can. So let's give a round of special applause for those of you who actually have killed a god, you know, as you were meant to. Armadyl, a round of applause to you. You were the first to really embrace this game and the way you decapitated Bandos...exquisite. Bravo, bravo!",
    "Oh no, of course not. You murdered a god for peace, love, justice and blah blah blah... The mighty Vorago, who, on behalf of the Godless, butchered the world-destroying Tuska. Good show, good show!",
    "And Harold, my good friend. So glad you could join us here. Why it seems like only yesterday that I had you trapped in my cage. Oh how time flies.",
    "Oh? But yet here you are. Funny how artefacts of unfathomable power seem to override principles.",
    "Icky, dear, dear Icky. So delightful to see you participating. Why the way you slaughtered that new god, simply artistic.",
    "Oh poh-tay-toes, poh-tah-toes, it's still dead, so that's one kill to you. A round of applause!",
    "Oh but you, dear, dear Seren. You had the greatest kill of them all didn't you. Matricide. You took the life of your very own mother...our mother. Mah, who dreamed us all into existence. Part of me hates you for that. Odd isn't it? That I should care, that her death should matter in the slightest? And yet the sting is there. That slight knot in my stomach, that dull pain in my chest... ... I mean bravo! You have done what so many others have failed to do. You hurt me.",
    "And ruin everyone's fun? How could I do such a thing? I made a bargain and as we all know... One must stick to their bargains, right brother?",
    "Ah ha ha ha ha ha! Oh 'Empty Lord' that's just the thing...we're not all here. Ladies and gentlemen! Allow me to introduce our latest contestants...",
    "The dragonkin!",
    "Come now, don't be so rude to our guests. Why Kerapac here has shown nothing but the absolute pinnacle of good manners.",
    "See, World Guardian endorsed. What further proof do you need of their good intentions?",
    "Oh don't mind them my pigmentally challenged friend. The World Guardian is just being a grumpy guts again.",
    "See the dragonkin have every right to be here. They, after all, did kill a god and killing a god gets you an invite to the game.",
    "Then leave. No one is forcing you to be here. If you don't want the stone then you can just totter off home and be free of this...indignity.",
    "Nope, no one? I didn't think so. So let's cut this bluster right now shall we? None of you are going to leave...",
    "Well, ok...that was...right. Well, none of the rest of you are going anywhere I assume. So let's discuss what is going to happen next. Below you sits the aptly named Heart of Gielinor. A focus for the vast anima mundi of this remarkable planet. From its walls I have carved a great labyrinth and at the end of the labyrinth sits the stone. Get through the labyrinth fastest, claim the stone. So simple even the World Guardian could do it. Speaking of which, it's time for the World Guardian to pick a side. No more sitting on the fence...who do you want to claim the stone?",
    "Marvellous! So nice to see you enter into the spirit of this World Guardian.",
    "Oh spare me the prattle. You're still going to murder one another to get the stone.",
    "Yes, yes, I'm sure it's you who will be doing all the leading and not the World Guardian at all, honest.",
    "Given your previous falling out, it's so nice to see the two of you united on this.",
    "You assume I would allow you to? No, the World Guardian gets to support whomever they like!",
    "Oh but you don't get a say in this. The World Guardian has chosen you, their support remains.",
    "Oh I suspect quite a few will stand against you. But keep up that optimism.",
    "We're all rooting for you I'm sure.",
    "And yet, it is. The stone is mine to do with as I choose. If you are unhappy with that, you just need to claim it yourself.",
    "Me? Harm the anima? I would never do such a thing...",
    "Hahaha! That is rather the point!",
    "As long as you're playing, you can stand wherever you like.",
    "Seriously? I mean...really? Seriously? After our little spat in my lair, you STILL want to side with me? I mean, yay, woo, support and all that, but seriously?",
    "BOOORING! No sitting on the fence. No protests. Pick. A. Side!",
    "Well now that the World Guardian has chosen a side, it's time to give them their prize. Behold! You thought he was lost. You thought he was gone. But here he is!",
    "Nomad 'The World Guardian'! That's right. After I siphoned some of your pesky soul away from you Player I got a little something extra. A spark of what makes you...special. Just enough to let Nomad here share some of your protection from godly powers. Not enough to save him from becoming my undying servant though. HAHAHA! And he's all yours World Guardian. Kill him. He's powerful enough that I'll count him as a god kill...for your chosen side.",
    "Not until I am bored of him!",
    "Oh silence your prattling. Player, I give you this gift to sacrifice to your cause. Make it a clean kill. Or make him suffer, it's totally your call. I'll let you in on a little secret... He feels all of it. Every scratch, every bruise and every swing of the sword. Enjoy it. My gift to you.",
    "Bravo! Bravo! An excellent display of mindless violence, just what I like to see. And as promised, that's an extra kill for your cause. Which leads us into the game proper. Each of you knows your score and your score is your advantage in this labyrinth. The higher your score, the better your head start will be into the labyrinth and the greater your chance of getting the stone. Oh but don't fret if your score is shameful, there's still all to play for and you have every chance of surpassing the other gods. There is a big, swirly portal in the labyrinth that is your goal. The first person to get through this portal gets to deal a significant blow to a contestant of their choice. Be the first through the portal and I will grant you the power to eject the entourage of any god! That's right, they will have to traverse the labyrinth alone. So it really is all to play for. And with that, let's let the game begin! Ready! Set. Go!",
    "Oh...just one more thing. Those with divine natures may be feeling a little odd right about now. I have removed your divine nature from you. I have deprived you of your power. In short, I have brought you all down to the same level. Each of you is now no more powerful than the lowliest of World Guardians. It should be a novel experience for you. But enough of this idle chatter. There is a stone waiting to be claimed. Go get it.",
    "It seems that Zamorak is struggling with that puzzle a bit. Come on, you can do it Zammy!",
    "The World Guardian is a lot slower than I was expecting them to be. Put your back into it!",
    "Armadyl is raring ahead. Can anyone catch up to him?",
    "Saradomin has taken the lead, the others are following close behind.",
    "Seren is taking the lead. I suppose elves are very quick on their feet.",
    "The empty lord has taken an early lead.",
    "Who'd have thought a great lump of rock could be so mobile? Vorago is steaming ahead.",
    "Zamorak is charging ahead. Is he going to claim the stone?",
    "Ouch! That had to hurt! Are you ok there Zamorak? Do you need a time out?",
    "I don't want anyone to panic, but has anyone seen where the dragonkin have got to?",
    "I just want to say it's so nice to see you all, gathered here, working against each other.",
    "Oh my. Vorago, you will not believe what Armadyl just called you! How awful! You shouldn't stand for that.",
    "Psst, World Guardian, take a left there. Honestly. You can trust me, it's a short cut.",
    "Ok I admit it, I lied about the shortcut. But you can totally trust me this time and take a right!",
    "Seren. Do you ever wonder what we could have been...you know, if you didn't try and kill my entire species?",
    "Icthlarin? Icthlarin! Heel! Staaaay. Staaaaaaay. Good dog.",
    "Do you think I should have invited other gods? I wonder what the Queen of Ashes would make of this maze.",
    "Oi! Dragonkin. Stop that! Stop damaging the walls of the labyrinth. What are you even doing there?",
    "If anyone can find the golden ticket, I will take them straight to the end of the labyrinth. Get searching!",
    "World Guardian, the gods are weaker now. Just think. You could take them all out! Just imagine the loot they'd drop!",
    "I just had a thought. Imagine what your followers would think if they could see you all now!",
    "NO! NOT THAT WAY! Never go that way!",
    "And now some musical notes based on what your followers will say when you lose: AAAAAAAAAAAAAAAAAAAAAAAARGH!",
    "Can whoever left their altar switched on, please report to reception.",
    "You're doing really well Player, honestly. I am not being condescendingly sarcastic at all!",
    "There should really be more stabbing going on, I mean it's the perfect set up for it!",
    "Go baaaack. This is not the waaaaay!",
    "Please ignore the stain on the floor to your right Player, that was one of the early test subjects.",
    "Will you stop smashing stuff Kerapac! It's making a terrible mess and you're really far behind!",
    "Are you still not done yet? Come on! Get a move on!",
    "Zzzzzzzzzzzzzzzzzzzz",
    "A lost soul has entered the labyrinth... Oh no...it's walked out again.",
    "Are you out of breath Saradomin? Old age caught up with you?",
    "Armadyl, you could take the lead, you're so close to catching up!",
    "Is Armadyl out of this race? He is really lagging behind!",
    "It will surprise no one that Zamorak is once again losing.",
    "Saradomin is in second place, but he could take that lead any moment.",
    "Second place for the godless...true in general really.",
    "Seren, pick the pace up, you could take the lead if you're just a bit faster.",
    "This is no time for meditation Seren, you and your elves are running far behind!",
    "Zamorak, second place as always. Do you want to be the runner up forever?",
    "Zaros, this is a race. A RACE. I know you just like to sit quietly on thrones and be all mysterious, but RUN!",
    "Zaros. Second best kinda suits you!",
    "Well well well, the World Guardian beats all of the gods and gets through the door first! Are they going to claim the stone for themselves? It's all still to play for. Well...a little less for some of you. After all the World Guardian gets to change the playing field. Tell me Player, which contestant will find themselves all alone in this labyrinth? Whose entourage will you eject, leaving them alone and vulnerable?",
    "Good choice! Armadyl, say farewell to your winged companions!",
    "Done! Saradomin, I wonder how you'll fare without your human shields to protect you?",
    "Excellent choice, I am so bored of elves anyway!",
    "Oh ho brother. See how even the World Guardian wants to see you fail!",
    "I guess the Empty Lord can be the 'Lonely Lord' now. Excellent choice Player.",
    "Erm, what? You don't even have an entourage!",
    "This is not how this works.",
    "Fiiinnnne. You get to let your doggy out for a walk. Bravo to you.",
    "Yes fine. Go away then. Honestly Player you are such a fun-sponge.",
    "Fine! Don't worry about it, choose again.",
    "It looks like Armadyl is in the lead ladies and gentlemen. He is the first past the door and now gets his prize. So tell me Armadyl, which of your opponents gets to face the rest of the labyrinth alone?",
    "Oh dear Zamorak, it looks as though nearly wiping out someone's species leaves them with a bit of a grudge. Your allies have been ejected Zamorak. Given that you've made so many friends that won't be a problem, right?",
    "Ladies and gentlemen, Saradomin has taken a decisive lead and is now the first through the door. As promised, he can now remove the entourage of any god, leaving them to walk these cold corridors all alone. So tell me Saradomin, who deserves your ire?",
    "Oh yes, nothing personal at all! Well Armadyl, it's not like you're not used to being all alone. It should feel familiar to you.",
    "How delightful! Seren has taken a decisive lead and is the first through the door, which means she gets her prize. Tell me Seren, who gets to walk these halls alone? Is it your dear brother, or someone else?",
    "Delightfully predictable. Zaros, you now get to be the 'Lonely Lord', not just the empty one. Enjoy!",
    "Congratulations  to Vorago! The first contestant through the door and the one who gets to claim the prize. Tell me Vorago, who will lose their entourage? Who must be forced to wander the corridors alone?",
    "Er...hello? Vorago, you do need to pick someone.",
    "Well, that ruined a perfectly good bit of drama. But that's what you get for inviting a rock.",
    "Well I didn't expect this. Zamorak has quite the decisive lead and gets to claim the prize for passing the first door. Tell me Zamorak, who is it that must now walk these corridors alone and vulnerable?",
    "Oh my, you really have upset him, haven't you Seren! Well now you can enjoy the peace and quiet without all those pesky elves fawning over you.",
    "Well well well. Zaros has taken the decisive lead in this race and claims the prize for being first through the door. Tell me Zaros, who should wander these cold corridors alone?",
    "Care to elaborate on why? It's an interesting choice, I would have sworn you'd pick Seren.",
    "Will you explain this logic?",
    "Aha ha ha ha ha! Oh this is wonderful, I wondered what you would be like with your divinity curbed, but this is glorious.",
    "Does no one listen to me? Honestly it's like some people just skip over all of my important announcements. I explained this earlier. I have removed some of the divine nature of every contestant, including Icthlarin here. Now I get to watch each of them grapple with returning to what they were before they ascended. This is Icthlarin's struggle.",
    "And save you from this delightful torment? Why in all creation would I do such a thing? This is delightful?",
    "My word, I really do have to spell it out, don't I? Although right now I imagine poor Icky here rather struggles with spelling. It seems mighty Icthlarin here, noble guardian of the Underworld, wasn't always an erudite scholar. Though he might have been the pet of one. He was just a dumb, stupid beast. Weren't you Icky?",
    "Ah ha ha ha ha! And now we see who he really is. Underneath that mask of godhood, this is who your Underworld guardian truly is. And the longer he stays in this labyrinth, the more like his real self he'll become. I do hope you brought a leash with you...or a nice juicy bone.",
    "Aha ha ha ha ha. Bad dog!",
    "Stop this? Why would I do that? To help him? To ease his suffering? You've met me right? I think we've long since established that's not the way I work.",
    "Cat got your tongue Icky? You should chase after it and get it back.",
    "Oh come on now Icky. By the time this game is over you won't even remember who you are, let alone what you think you're going to do to me.",
    "Aha ha ha. I mean he does have my character down rather nicely, fair play. But to answer your question Player, it's because we are now seeing who Icthlarin here really is. Beneath that arrogant, haughty exterior is no scholar. No noble warrior. He is nothing but a mindless, dumb animal. The only thing that made him special, made him...anything...was the divine power granted to him by happenstance. And now that he's without that, we see him as he truly is. Nothing.",
    "Oh but it would be so much funnier to let you forget. Tell me Player have you ever wanted a pet? Because it seems to me like you're due to pick up quite the stray.",
    "Oh I'm sure they are. I'm sure they're your best friend Icky. You are the World Guardian's best friend.",
    "Don't you get it Icthlarin? You just don't matter to them...or anyone. They're more like me, than they are you.",
    "So well trained!",
    "What?",
    "I can honestly say that I have absolutely no idea what you're talking about.",
    "It's going to be so much fun watching you drift more and more away Icthlarin. To see you so humbled, so easily. Truly my finest work.",
    "Feeling lonely, Zamorak?",
    "Want to chinwag about old times?",
    "Remember when you turned us all against Icthlarin?",
    "Remember when you stabbed Zaros in the back?",
    "Remember when you burned a hole in half the world?",
    "Remember when you tore a chunk out of Lumbridge?",
    "Remember when you almost died at the hands of the blue charlatan?",
    "Remember when Zaros plucked the wings from you like a fly?",
    "Hehe, remember when you were drawn to this game, even though you said you wouldn't play?",
    "So you do appreciate the little things I do for you. How kind!",
    "Oh Azzy, you silly, silly moo. You're thinking of our childhood, aren't you?",
    "The fun we had, capering together across the slaughter fields with the blood of the Mahkorat on our young lips.",
    "Yes, friends. Tell me Azzy, do you remember Alotor?",
    "Yes, that's right. And tell me this: Do you remember who it was that brought back the news of Alotor's death at their hands?",
    "Oh yes.",
    "Ding ding! Yes it was. Your good old friend Sliske.",
    "Do you want to know why I did it? Why I killed your little, little brother?",
    "No reason!",
    "Anyway, it's been such fun negotiating but my attention is rather needed elsewhere. Ta ta for now!",
    "Oh! Such cruel words. They wound me.",
    "Oh, Char. Don't be grumpy Player did choose you over Azzanadra, after all. But maybe... That's it, isn't it? Your precious purple dishcloth chose Azzanadra over you, didn't he?",
    "Oh come now, dear. Did you really think he didn't know that you were there? Trapped? Dying? In pain? For all that time? Meanwhile bunny ears is having a lazy luxury afterlife in his deluxe pyramid and as soon as he wakes up - what happens? It's back to Varrock Dig Site and before you know it: boom! The dirty pair, back in the saddle and plotting once again. Just between you and me, Char, I like to call them Zaronadra. But while Zaronadra were spending all that time plotting their comeback tour, did either of them spare a thought for poor little Char? No! And who should dig you out of your hole instead but the World Guardian.",
    "Oh do hush. You're right though, my attention is rather needed elsewhere. Ta ta for now!",
    "Oh, really?",
    "Tell me, Zaros...how are you going to force everyone to your will without divine power?",
    "Oh, I don't think so. Without our mother's power you are nothing but a pointless, saggy dishcloth. How different your life would have been without your quite unearned divine inheritance. Why, if only you had been created a little later, you would have been born a Mahmuspah. How about that? And what kind of Mahmuspah would you have been, Zaros? A very dreary one, I think. A boring, pointless, dreary thing devoted to nothing but planning and thinking and planning and PLANNING! And no one would listen to a word you said because no one would care, and you wouldn't have the power to FORCE THEM TO! Why, that sounds a lot like Wahisietel, doesn't it?",
    "Well I was hoping for some entertainment, but I can see that mortality hasn't made you any more fun, so I'll be going.",
    "Oh, really? And here I was hoping for the big showdown. The betrayal: part 2! Zaros versus Zamorak: This time it's personal! I guess I shouldn't have skipped that pow wow on Freneskae! Did you sort out everything out without me? Did you discover the fate of the gods, too? I have just been *so* busy though, as you can see!",
    "Oh Zammy, Zammy, Zammy, but that would be terrible pacing. You're what, halfway through? We can't have the big boss fight just yet.",
    "Not just a little fight? A teeny tiny incy wincy little wrestle? Come on, Zamorak. I've taken away both of your god powers. You already spent an eternity without them. You know how to fight. Zaros doesn't have that experience. Without his powers he's just a floppy piece of fabric. Go onnnnn. You can take him.",
    "Go onnnnn. He said mean things about you. He called you an imbecile!",
    "Oh, Zammy, you're still such a bore. If I didn't still want to see how this game turns out I'd put you out of your misery right now. Go on, then. Go back to your disappointingly non-violent squabbling. See if I care.",
    "Now now now, this won't do at all. God versus the World Guardian - this is hardly a fair fight! I'm going to make you work for it, Armadyl. Player is going to get a head start to even this race up a bit. NOW RUN!",
    "Now now now, this won't do at all. God versus the World Guardian - this is hardly a fair fight! I'm going to make you work for it, Saradomin. Player is going to get a head start to even this race up a bit. NOW RUN!",
    "Now, now, now, this won't do at all. God versus the World Guardian - this is hardly a fair fight! I'm going to make you work for it, Zamorak. Player is going to get a head start to even this race up a bit. NOW RUN!",
    "Yes yes, it's all yours World Guardian. I must say I am rather pleased by this outcome. I knew you would be the catalyst I needed.",
    "Oh yes! The god will tremble before your might now World Guardian.",
    "Tell me, what will you do with your new power Player?",
    "Ah, so power drives you? You wish to wear the crown and rule from the throne? I can see the appeal in that. How would you rule?",
    "Yes, sticking to the heroic do-gooder role I see. How boring.",
    "Delightful. I see your streets running with rivers of blood and the wailing of your downtrodden populace. How lovely.",
    "How marvellous! Between you and me their time really has come to a close and it's time for the mortals to run the show.",
    "Oh there's a glorious irony in that.",
    "Oh, nothing.",
    "By the emptiest of thrones, you really are so very dull. Imagine all you could do with its power and you're going to just lock it away somewhere? Booooorrrrriiiing.",
    "Ha ha ha! Such madness, such cruelty. You would really tear this world apart? Between you and me, you may just get your wish.",
    "How pointless. What will he do with it? Run screaming from it because it might be bad?",
    "Sit on it and try to hatch it?",
    "...",
    "That's a disturbing mental image, I wish I hadn't mentioned it now.",
    "Oh how boring. Empower the lord of order and stagnation. You really are no fun.",
    "Oh, interesting choice. See what horrible mistakes she can make with such power at her disposal. Perhaps she'll accidentally enslave humans too. Or maybe she'll find a way to get the aviansie to eat each other. Or perhaps she'll accidentally explode herself... again!",
    "Oh. I like how you think. Set the stage for the second god wars by letting it play out just as before. It's a bold plan. I do so hope it works.",
    "Oh of course you will. What a good little pawn you are.",
    "Sorry, did I say pawn? I meant patsy. Minion. I mean friend, yes what a good little friend you are.",
    "Really? I already HAVE the stone? I am giving it away? Why would I want it back?",
    "I mean sycophancy is all well and good, but at least think it through.",
    "Ha ha ha! So you want to reveal how hypocritical they really are?",
    "See who cracks first and takes the power for themselves?",
    "You think for a moment that their principles will last a moment when such power is at hand?",
    "Ahh, so shift the balance between the living and the dead?",
    "Watch as man's best friend becomes the wolf in the shadows?",
    "You see how his sister turned out. I wonder if madness runs in the family.",
    "And what would that achieve? He can reap souls more efficiently?",
    "Or perhaps... perhaps you want him to abandon his duties. Perhaps you want to see what a world without death is like?",
    "I showed you a glimpse before, it was delightful wasn't it!",
    "Really? Really? I mean I like a good joke but come on...",
    "That's perhaps the most useless exchange I could ever imagine. Well done.",
    "Don't even joke about such things.",
    "So why did you even race for the stone? If you have no use nor desire for it?",
    "What? How are you here? You should have been cast out once Player reached the end.",
    "But she said... It doesn't matter, the game is over. The World Guardian has the stone!",
    "That's rather the point though, isn't it!",
    "Of course I know! Why do you think I've orchestrated all of this? I want them to wake and I want Gielinor to be torn apart in the process!",
    "Because this world is the lock that holds the rest of the universe together. I've been to countless worlds, but this one is the very keystone of creation. When this world falls, finally the other worlds will wake up and take notice. They'll fall into a free fall against one another. They'll all finally stop being boring. I have lived thousands of years and in that time I have watched everyone just repeat the same cycles again and again. It's as if all sentient life were devoid of creativity. It is so unfathomably tedious. But no one seems to have noticed it but me. They're all so obsessed with their little schemes, unaware that they're locked in a rut. But when war breaks out amongst the gods, without Gielinor, it will span across the whole of creation. Zamorak will unleash his demonic hordes, who will swarm across the worlds tearing them apart. Saradomin will be forced to return to Teragard and bring their twisted science into the conflict, changing the face of the war, quite literally in some cases. Even 'peaceful Armadyl' will find himself forced to break his oaths and unleash terrible destruction...again. Doesn't it sound wonderful! No more stagnation. No more tedium. We'll see an end to the gods and the whole universe will be changed by it.",
    "You won't 'let' me? Don't you remember what I did to you back in my lair? Does your face forget the force of my fists as I rendered you insensate? You are NOTHING to me World Guardian! You're an insect with delusions of grandeur. I've scraped you off my boot once already, do you really think I can't do it again?",
    "Ha ha ha! Now this is the spirit! This is interesting! And think of it! The whole universe as riled up as you are now. The glorious spark of indignity and rage burning in every living being as they turn on one another. So beautiful!",
    "Don't you get it Zaros? There is nothing to save!",
    "Reason? Reason? Do you really think me so blind? Do you not think that I have thought through every possible outcome and that I have not reached this decision after centuries of contemplation? The universe is stagnation. It is lost to the will of beings that know no better than the rest of us, but wield slightly more power. If there is to be a chance for life to thrive, these chains must be broken. But the only way for that to happen is for this rock to burn.",
    "This again? Don't you get it? Haven't you worked it out by now? I DO NOT WANT YOUR HELP! Your simpering, pathetic need for my affection. It disgusts me. Get this through your thick skull. We are not friends. We have never been friends. We will never be friends.",
    "Oh World Guardian, you're not even that. You're nothing more than a distraction, you were never my real target. I have my sights on much bigger prey...",
    "We are nothing alike! That you cannot see that makes me hate you even more.",
    "Ha ha ha ha ha! Love! A mahjarrat in love? Ah ha ha ha ha! I almost wish that were true. It would certainly make the universe a more interesting place. But then perhaps... I suppose I have never felt such contempt for someone. Never has anyone been such a thorn in my side. A constant headache that never goes away. An obsession that I have sought so hard to wipe from my mind. So perhaps I have loved you... But that doesn't mean I have to like you.",
    "Enough! The game is won. Player, take the stone, it is yours!",
    "And we have a winner! Congratulations Armadyl. Honestly I never expected you would be the new 'Stone Toucher', but here we are. You have my heartfelt congratulations. You have played quite an impressive game and truly deserve your prize.",
    "Oh? Why do you think I would want it again? The stone has served its purpose, the game is over. I have no further need of it.",
    "Oh yes. Because really what more reason could there be? For power? Power is just a means to an end. A way to help reshape the world to allow you to enjoy its pleasures more. An excuse to indulge bloodlust, or relish the feeling of being in control. I don't care about power! I go straight for the good stuff. For an excuse to laugh, for the ability to revel in the destruction I have wrought.",
    "They mean nothing to me! I thought I made that clear long ago. I am not like you Armadyl, I have long cast off the shackles of morality, the chains of dogma. I am what everyone truly seeks to be, I am completely free. It's glorious, I can assure you.",
    "Oh yes. For you to be completely corrupted, for you to betray all of your precious principles in a moment of anger? I can think of no better game. So do it Armadyl. Let the hatred take control. Give in to your anger, reach out with those rubbery digits and wish me away. You remember that feeling, don't you? Don't you just yearn to feel it again?",
    "Ha ha ha! On the contrary, I am the only one here that has not enslaved themselves to some ridiculous ideology. I am completely free and you can never, ever defeat that.",
    "But...how? You should have been cast out. How are you here?",
    "But she said that... It doesn't matter, the game is over. The Stone of Jas now belongs to Armadyl. My game is complete.",
    "Ok, you've got me there. The Catalyst is the perfect fire to spark the fuse. The other gods aren't just going to accept this decision. They'll try and take the stone by force. And with no Guthix to banish them, it will rip this world to pieces...quite literally when you remember who's sleeping below.",
    "Why? Because I am bored. So very, very bored. I am thousands of years old. I have seen history just repeat and repeat itself, infinitely. It's like sentient life has no creativity, they just keep making the same mistakes. Even Zamorak, with his chaotic philosohy, doesn't change the game enough to make things really interesting. So I have upped the stakes. Without Gielinor as its centre of gravity, the universe will spin out of control. No longer will everyone be looking inwards towards this 'perfect' rock. Instead they'll be looking in different directions. Saradomin will return to Teragard and bring their dread science into the war. Zamorak will unleash the demonic realms and Armadyl here would be forced to use his forbidden weapon...again.",
    "Oh you will! When your people are on the brink of extinction, you'll use it and more. Finally, everyone will be forced to be INTERESTING!",
    "You won't 'let' me? Don't you remember what I did to you back in my lair? Does your face forget the force of my fists as I rendered you insensate? You are NOTHING to me World Guardian! You're an insect with delusions of grandeur. I've scraped you off my boot once already, do you really think I can't do it again?",
    "Ha ha ha! Now this is the spirit! This is interesting! And think of it! The whole universe as riled up as you are now. The glorious spark of indignity and rage burning in every living being as they turn on one another. So beautiful!",
    "Don't you get it Zaros? There is nothing to save!",
    "Enough. The game is over. Armadyl, take your stone and do with it what you will!",
    "Ha ha! Bravo bravo Saradomin. Truly you deserve this prize. You have battled your way through this maze and defeated even the World Guardian at the end.",
    "But, how? You... you should have been cast out of the labyrinth.",
    "But she said... It doesn't matter, the game is over, the stone now belongs to Saradomin!",
    "Of course I do! That's exactly what I'm banking on.",
    "Why? WHY? Because I am so very, very bored! I have lived a hundred mortal lifetimes. I have watched as sentient life just repeats itself again and again, ad nauseum. It's as though sentient life has no creativity! Even Zamorak, with his philosophy of chaos, sticks to the same old patterns, the same old grudges and conflicts. We have an entire universe of diverse creatures enslaved to the stagnant demands of beings with just a little more power but no ingenuity! Armadyl preens his feathers and constantly talks about uniting the gods, but never does anything. Saradomin traps all his people in a tedious dogma of stasis. The Queen of Ashes just burns and burns and burns. Xau-Tak writhes, twists and beckons but never DOES anything! Zaros schemes, without ever really changing anything and Seren here just sits in her crystal tower and mopes. Only the World Guardian here does anything to shake things up, but even then the world just acts as though nothing has happened. It's maddening!",
    "But that's just it! I am a mahjarrat. I don't get the escape to the grave. I have one existence, ONE, this one! If I die that's it, I'm gone, forever. And a universe without Sliske is a terrible universe to have. So I must find an alternative solution.",
    "You won't 'let' me? Don't you remember what I did to you back in my lair? Does your face forget the force of my fists as I rendered you insensate? You are NOTHING to me World Guardian! You're an insect with delusions of grandeur. I've scraped you off my boot once already, do you really think I can't do it again?",
    "Ha ha ha! Now this is the spirit! This is interesting! And think of it! The whole universe as riled up as you are now. The glorious spark of indignity and rage burning in every living being as they turn on one another. So beautiful!",
    "Don't you get it Zaros? There is nothing to save!",
    "Enough. The game is over. Saradomin, I give you the stone. Use it as you see fit!",
    "I must say, given your lousy headstart[sic], I never expected you to be the one to claim the stone brother. Congratulations.",
    "But? How? You should have been cast out of the labyrinth when the stone was reached?",
    "But she said...",
    "It doesn't matter, the game is over, the stone now belongs to Zamorak.",
    "That's the point Seren! And who better to start this sudden influx of chaos than Zamorak himself?",
    "Why? Because the universe has become stagnant. It has become boring. The universe is stuck in a rut, the races have trapped themselves in an infinite loop of tedious stagnation. The gods are immortal creatures and that means stasis. They cannot evolve, improve or move on and they trap everyone with them. The entire universe is stuck repeating the same patterns again and again and again and I want to shake things up a bit. I'll start by watching this world burn. Without its strange pull the other worlds will spin out of balance. No longer focused on one place they will finally notice each other.",
    "You think so? Do you think that Saradomin will just allow his archenemy to keep hold of the stone? Do you think he won't pre-emptively strike you down? You've already played your part in this, just by taking part in my game. War is now inevitable and the complete destruction of Gielinor is next! From there the universe will spiral into chaos and confusion and the reign of gods will end! Things will finally be INTERESTING again!",
    "You won't 'let' me? Don't you remember what I did to you back in my lair? Does your face forget the force of my fists as I rendered you insensate? You are NOTHING to me World Guardian! You're an insect with delusions of grandeur. I've scraped you off my boot once already, do you really think I can't do it again?",
    "Ha ha ha! Now this is the spirit! This is interesting! And think of it! The whole universe as riled up as you are now. The glorious spark of indignity and rage burning in every living being as they turn on one another. So beautiful!",
    "Don't you get it Zaros? There is nothing to save!",
    "Enough! Zamorak, the stone is yours. Do with it what you will.",
    "Well this is interesting. I must say I did not see this coming!",
    "I really need better security in this place.",
    "No...what...it cannot be. It...it can't!",
    "OVER? OVER! HA HA HA HA HA! Oh yes...it's over Player...[sic] FOR YOU!",
    "So I see. Brother and sister united against me. Three of the most powerful beings on Gielinor stand against me? And here I was, hoping for a challenge. You know, you've been the thorn in my side for far too long. No more games. No more misdirections. Now, you die! YOU ALL DIE!",
    "Enough! I've clearly been far too lenient on you, no more Mr. Nice Sliske.",
    "You think this is over? It is far from over. ARISE MY ARMY!",
    "You think your friends will be enough to save you? You think I am alone? I am never alone. I keep my friends close and oh so wonderfully controlled. Come forth my wights, my Barrows Brothers. Show the World Guardian the true meaning of the word 'pain'!",
    "BEHOLD! My wights, destroy the World Guardian. The first to bring me their head will win an hours respite from the agony I will inflict on the others.",
    "No? What is this? How dare you defy me! HOW CAN YOU DEFY ME?",
    "What? How...how is this even possible?",
    "You... Ooh I am going to destroy you. I am going to break every bone in your body and then I am going to *really* hurt you! I will make you beg for death! Your agony will be legendary!",
    "Ha ha ha ha! That is where you are wrong. I never play all my cards. Let me introduce my hat trick. Roll up, roll up and face the Soul-eater Nomad, Linza the Betrayer and my good friend Gregorovic. Three of the strongest wights I have ever possessed and I'll throw in a few more for the disloyal brothers to deal with.",
    "I think I'm going to miss you Player, you've been such fun. But all good things come to an end. And so will you!",
    "You think killing [Nomad/Gregorovic/Linza] matters? Fool! Their death makes the others stronger!",
    "What! How can this be. You have killed all three. If you want the job done right, do it yourself!",
    "Now you will feel the full power of my wrath!",
    "Die World Guardian!",
    "DIE!",
    "Gielinor doesn't need you anyway!",
    "I should have taken your whole soul!",
    "Let Death tick you off his list!",
    "Let the shadows claim you!",
    "You're nothing to me! NOTHING!",
    "By all means waste your time with that Player.",
    "Do you really think I will fall for that again?",
    "Oh no you don't Player, this fight is between us!",
    "Nice try Player!",
    "AAAAAAHHHHHH!!! What have you done? Why can't I enter the shadow realm?"
  ],
  "Kerapac": [
    "You disappoint me World Guardian. I have done nothing but be honest with you.",
    "Thank you World Guardian. It is good to see one Stone Toucher recognises our claim.",
    "There is much that none of you have seen.",
    "You bicker over the stone like it's a toy, or a trophy, but I know it for what it is. It is the whip that cuts our flesh. It is the collar that chokes us. It is the enslavement of my people.",
    "WE WILL NO LONGER BE SLAVES!"
  ],
  "Brassica Prime": [
    "I am. What need has the mighty Brassica Prime for such shiny baubles? Does not deliciousness itself flow through these very leaves? Am I not nutrition incarnate? The Cabbage of a Thousand Truths is like a carrot on the hook, dangling over the cooking pot. You boil yourselves alive to reach it only to find that it is withered and tasteless, leaving only a bitter regret on your pallet.[sic]"
  ],
  "Marimbo": [
    "Yeah...what leafy said. All this fighting and backstabbing, there's so much more we could be doing instead. You keep your stupid stone, I'm going to go and play more amusing games."
  ],
  "Vorago": [
    "The agenda of the Godless means little to me. I am here to preserve the Anima from the damage you would inflict.",
    "...",
    "I pick myself. This prize is pointless.",
    "Player, it is good to see you again. Granted, meeting under these circumstances is not ideal.",
    "I'm impressed you've come this far. Even I, 'the Enduring', can feel my power diminishing.",
    "I cannot feel the earth as I once did; I feel a sense of separation. This is something that I have not felt in a long time.",
    "My mind is opening up, allowing me to recollect past events that have been concealed by the overwhelming urge to defend and protect this world.",
    "I am more in control of my thoughts, it's an odd but satisfying feeling to have. I sense forgotten pasts, forgotten stories, and I name I am unfamiliar with.",
    "In this state, I worry that I am unworthy of being known as the defeater that I am.",
    "I do not expect you to understand, it's something I have little information of myself. The power that runs through me is usually at the forefront of my mind, driving what I believe to be my sole purpose.",
    "Now is not the time for my mind to lose focus of what really matters. I have a purpose that I must fulfil. The earth-soul and I are as one. I must repel those who would do it harm.",
    "Armadyl.",
    "I do not need your help, nor would I accept it. I do not trust your methods.",
    "Your contest with Bandos was an affront to the anima, one I should never have allowed to continue. The damage you caused was my failing. My only intention here is to prevent any further wounding.",
    "The damage is done, Armadyl. I do not care for your words or morals, only your actions. You need not fear me now, but I will not allow you to endanger the anima again.",
    "I am 'the Everlasting', 'the Enduring'. The anima is not, so I cannot allow these mistakes. I make no alliances or enemies. I will do only what must be done.",
    "I am leaving, Armadyl.",
    "Nothing. I have no use for you.",
    "No. I speak merely the truth. I had no use for you when you were a god, and less now that you have no power. I suggest that you move aside.",
    "No; so that nobody may take the stone.",
    "The Stone of Jas is not for this world, and it is not for the gods. I will stop you from taking it, as I would stop all others. And, if I can, I will stop Sliske using it as bait.",
    "I think I can.",
    "I have only met a few being capable of besting me. Sliske has not yet appeared on that list.",
    "I have only met a few being capable of besting me. Player is one of them. Sliske has not yet appeared on that list.",
    "Why would I form a team with them? I am 'the Enduring', 'the Eternal'. I will pass these tests on my own merit. If I allow him to follow in my footsteps he will simply take the stone and betray me.",
    "I would normally welcome a battle to test our relative strengths, but not here. Not now. Sliske must be defeated and the stone removed from his power.",
    "So are we going to have an issue here, Zamorak?",
    "Very well. I will depart.",
    "Greetings, Zamorak.",
    "For once, I have not come to fight. You are merely in my way.",
    "You are weakened, while I am not. You are mortal, while I am unending.",
    "Should you survive, yes. You may even beat me, as some have. But I will return again, and again. I am eternal, enduring. All it takes is one death for you to be finished. Do you understand this?",
    "You only have one, and have come closer than many of the other gods to destruction.",
    "Insults? I have merely spoken the truth. I do not intend to fight you here, as this will distract me. I intend to block the progress of your fellow gods towards the stone. It is not for the likes of you, or Sliske.",
    "Indeed. I would not like to battle my way to the stone only to have you try and take it.",
    "Excuse me?",
    "I think I will take my leave now, unless you have an objection.",
    "I look forward to testing my strength against you."
  ],
  "Mask": [
    "Love",
    "You",
    "For",
    "More",
    "Than",
    "Your",
    "Soul"
  ],
  "Lady Trahaearn": [
    "It can't be, m'lady. There ain't a nicknack in the world that could strip a god of its power. Plus it ain't scientific. An effect like this would have to be transmitted as light or sound, and there's more walls in this place than Morvran's holiday dungeons. Yep, this'll be your good, old-fashioned magic.",
    "What do we do my lady?"
  ],
  "Arianwyn": [
    "If it's magic, it's nothing like any I've encountered. It doesn't even share characteristics: spells borrow power from one another. That's the way of magic. Bones to Peaches shares something with Hi-Alchemy. Crystallise borrows from the Lunar Magicks. This feels utterly new, disconnected. It's like a new branch of magic. Which is exciting of course.",
    "Unless...unless we're over-thinking this. Step back, think about what has happened recently.",
    "And there's the edicts themselves. But no one knows if that was Guthix himself casting out the gods, or if it was the anima, the Sword of Edicts, the Stone of Jas...",
    "What is he talking about, Seren?"
  ],
  "Azzanadra": [
    "You do not know him as I do!",
    "Why do you listen to this...to this dancer, lord?",
    "Sorry, lord.",
    "I do not want to lose another of my few remaining family if I can possibly avoid it. I would think you of *all* people would understand that, Char. Not all of us want to revel in the exotic mystery of being the last of our kind.",
    "My lord, I do not understand the purpose of this hotheaded jezebel.",
    "Sliske! We still have the opportunity to resolve this.",
    "We were blood brothers once, Sliske. Friends.",
    "Of course. My youngest brother. When the Mahkorat tortured and killed him, we wiped out their whole tribe in retaliation.",
    "It was... Oh no.",
    "It was you.",
    "Sliske...",
    "Why, Sliske?",
    "We should kill him.",
    "This takes me  back.",
    "Do you have any idea who we are?",
    "We seem to be running into each other a lot these days. But you've forgotten your Mahjarrat again.",
    "And what are you supposed to be?",
    "Lucien's...daughter? How? But...her face. What is wrong with her face?",
    "Half? But that's...my lord, did you know of this, this abomination?",
    "Good!",
    "Our race? Better to not have a future than this...this 'hybrid'!",
    "Zamorak, how can you stand to be around this 'thing'?",
    "My lord, we must... We must destroy this creature.",
    "My lord has returned here after the affair. He was invigorated and determined in a way I have not seen him in some time.",
    "He has left this world for the moment, seeking something beyond the stars.",
    "He has requested I prepare the temple for his return, a task that I am more than happy to attend to.",
    "Yes, when my lord mentioned what happened to the stone it left me quite confused.",
    "I have consulted my notes on the dragonkin and the adventures you have shared together and I believe I have a theory.",
    "I believe that you are the reason Kerapac was able to do this action.",
    "When you worked with Kerapac, in exchange for healing Hannibus, Kerapac was studying the link between a dragonkin and the stone.",
    "A powerful magical tether binding the species and the artefact together.",
    "We already know from the terrible affair with the late god V that the Mirror can be used to channel, multiply and redirect energy.",
    "Combine this with the vast Anima Mundi flowing in the Heart and I think we can easily establish what happened. Don't you agree?",
    "I thought you might. Still, defying the designs of an elder god cannot go without consequence.",
    "I imagine we are yet to see what the full ramifications of this act will be.",
    "Clearly brains are not a key component of being a World Guardian.",
    "Think of it this way. What happens if you keep filling a waterskin with water? Eventually it bursts.",
    "Now, instead of water, imagine a vast flowing river of energy channeled through Kerapac's connection to the stone.",
    "In this analogy, the stone is the waterskin. Too much power, stone goes boom.",
    "Yes. I can only imagine what a humbling experience that must have been, to be an ant gazing at the shoe.",
    "And of course now you are tasked with the unenviable responsibility of proving that all life should be allowed to exist.",
    "I suggest from now on, you are on your best behaviour."
  ],
  "Char": [
    "Look at everything he has done. You are a blind fool.",
    "Better to be dancer than the high priest of a church of dust!",
    "Azzanadra wants to try to negotiate with Sliske. We need to kill him, and before he has another chance to open his mouth.",
    "How dare you!",
    "Sliske! Come down here and fight!",
    "What do you mean?",
    "Lord?",
    "Yes, lord.",
    "Better a relic than an usurper!"
  ],
  "Vindicta": [
    "An enemy, my lord!"
  ],
  "Kalethax": [
    "[sic] Sssssssssskkkkkk...",
    "[sic] RACCCCCCCCSSSSSH!",
    "Why hesitate, little budgie?",
    "Nor we with you. Why would we fight the 'Great Armadyl', of the Staff of Armadyl? Great Armadyl, Beheader of Bandos.",
    "Great Armadyl, Stone Coveter.",
    "You would do that for us? You would set us free? We wouldn't feel this...rage, this strength in pain? It would be gone?",
    "Foolish pigeon, it would be easier to rip out your stupidity than rip out the stone's curse.",
    "You stand here, with the gift of the elder gods removed from you, and claim to save us?",
    "We will save YOU, birdman. You will see. The Dactyl are here to save everyone."
  ],
  "Skalekith": [
    "This cage won't hold me for long!",
    "You think this cage will hold me? Soon we will all be free and then you will know our fury!"
  ],
  "Moia": [
    "Do you insult our lord?",
    "Allow? You insult Zamorak with this talk?",
    "My lord?",
    "But my lord...",
    "My lord, they have a point. Be rational, don't let your anger distract you. We have a goal here and it isn't this.",
    "My lord. Remember why we are here. We cannot allow anything to distract us from our plan. Once we have the stone...",
    "My lord?",
    "What if we find her again?",
    "[He's/She's] right, my lord. If we ignore the stone to hunt Seren then Zaros or Saradomin may claim it.",
    "She has fled, my lord!",
    "Excuse me?",
    "I am half-human.",
    "But I could be the future of our race!",
    "Zamorak told me you were a self-righteous fool. I see now how right he was!"
  ],
  "Esskon": [
    "Beheader of Bandos",
    "Stone Coveter",
    "Save us"
  ],
  "Torkuss": [
    "Beheader of Bandos",
    "Stone Coveter",
    "Save us"
  ],
  "Vicendithas": [
    "Beheader of Bandos",
    "Stone Coveter",
    "Save us"
  ],
  "Commander Zilyana": [
    "It could be a trap, lord.",
    "We will not go far, lord.",
    "Don't listen to her, my lord. It could be a trick.",
    "My lord, the World Guardian has a point? The goal is the stone. Should we waste our time with this filth?"
  ],
  "Lord Iorwerth": [
    "My lady, are you sure you want to speak with him alone?",
    "But my lady...",
    "We stand and fight!",
    "Seren, what did you do?"
  ],
  "Lord Amlodd": [
    "What of Player? If this is to be a private counsel, they should leave too.",
    "Very well. We will remain close by.",
    "My Lady, is this true?"
  ],
  "Black Knight champion": [
    "Chaos shall reign!",
    "Chaos shall reign!",
    "Chaos shall reign!",
    "Be silent, worm! You are in the presence of a god!",
    "Relics of the past who should have stayed buried."
  ],
  "White Knight champion": [
    "By the light of Saradomin I shall destroy you Zamorak!",
    "By the light of Saradomin I shall destroy you Zamorak!",
    "By the light of Saradomin I shall destroy you Zamorak!"
  ],
  "Slikse": [
    "Indeed it is Zamorak. Come, step forward and claim it!"
  ],
  "Guthan the Infested": [
    "No."
  ],
  "Ahrim the Blighted": [
    "We have been your puppets for too long, but no more. We are nearly free, free enough to see you destroyed."
  ],
  "Dharok the Wretched": [
    "Give up this rhetoric Sliske, you're outnumbered and outclassed. You cannot win."
  ],
  "[Mysterious voice]": [
    "Come to me"
  ],
  "Mysterious figure": [
    "Here",
    "You",
    "Are",
    "Here",
    "Jas"
  ],
  "Voice of Jas": [
    "No",
    "No",
    "A flame",
    "Can never be a star",
    "However bright",
    "It burns",
    "You are of Mah",
    "But you are not Mah",
    "No",
    "There is nothing",
    "We are creation",
    "We create life",
    "A power beyond you",
    "Shadows",
    "Whispers",
    "False life",
    "To be as us",
    "Creation from nothing",
    "Only we have this power",
    "Impossible",
    "Leave",
    "Explain",
    "No",
    "Defiance is pointless",
    "Explain",
    "Self destructive",
    "Needlessly defiant",
    "Mortal life is an aberration",
    "It shall end",
    "My agent",
    "Explain its end",
    "Explain",
    "War?",
    "Why?",
    "It is common?",
    "You destroy yourselves",
    "Gielinor has felt war",
    "Moments",
    "Explain",
    "Races?",
    "Why?",
    "I see many paths",
    "This is common?",
    "Yes",
    "Falsehood",
    "You have killed hundreds",
    "Yes",
    "Death is your function?",
    "Yes",
    "Explain",
    "Yes",
    "You intrigue me",
    "Mortal life is unexpected",
    "It is dangerous",
    "Meaningless",
    "You are a question",
    "I ask the sisters",
    "They wake",
    "Yes",
    "No",
    "Convince them",
    "Show them why",
    "Why should life",
    "Continue",
    "Know their answer",
    "I shall judge",
    "No further words",
    "Prove by action",
    "Bik",
    "Wen",
    "Ful",
    "Agree",
    "There must be",
    "Consensus",
    "Leave",
    "Prove",
    "Or be",
    "No more",
    "One",
    "Yes",
    "Because",
    "This is unknown",
    "You should not exist",
    "We are",
    "Yes",
    "Tools",
    "To shape creation",
    "The Codex",
    "The Template",
    "The Needle",
    "The Hammer",
    "The others are known",
    "As a child",
    "He is not Mah",
    "She is nothing",
    "She could be more",
    "Harmless",
    "Angry",
    "Violent",
    "An error",
    "It is lost",
    "It is no longer",
    "Necessary",
    "My future",
    "My sacrifice",
    "Yes",
    "The darkness comes",
    "Leave",
    "Leave",
    "Prove",
    "Or be",
    "No more"
  ],
  "[The Elder Choir]": [
    "We hear"
  ],
  "Linza the Disgraced": [
    "Player, I'm so sorry about Sliske. I... I know what I did is unforgivable, but I just wanted to say thank you for freeing me.",
    "Yes. I've still joined the ranks of the undead, but now there are no strings controlling me. I am me again. Albeit a paler version than before. It is an odd sensation, being undead. I expected to feel evil, or cold, or in some way sinister. But instead I just feel...dulled. Like everything is an inch away from me. But at least now I *can* feel. I can act. I can be me. Whereas before I was nothing but Sliske's toy.",
    "I imagine not. But you have my gratitude regardless.",
    "I can't go back to living amongst normal people for a while, I don't think they like living with the undead. Even a free one like myself. In a weird way I think the Barrows are still my home and at least I can improve my fighting skills there. Besides, the brothers and I have a lot to deal with. It's not everyday that you get freed from a nightmarish curse and we can work out our place in the world together. Perhaps we can be a force for good. The brothers are skilled combatants and I can craft fine weapons. Between us we could be a powerful military force for justice. I mean it helps that we can't easily die. So if you want to help us improve our battle skills, we'll await you in the Barrows as we always have. Don't worry about killing us, the magic of that place won't let us rest for long. Besides, after what I put you through with Sliske, you deserve to get a few punches in. I don't begrudge you that. Again, I am so sorry. So very, very sorry."
  ],
  "Congratulations! You have completed": [
    "'Sliske's Endgame' - Complete this quest."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Sliske%27s_Endgame?oldid=36198249’"
  ]
}