{
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "Some dialogue is missingYou can discuss this issue on the talk page or edit this page to improve it."
  ],
  "Player": [
    "Hi Chuck. How's it going?",
    "How do you know your agent has been captured?",
    "A walrus?",
    "A prisoner of war? I thought you said you had a truce!",
    "Can I see a copy of the letter the Walrus sent?",
    "I want to talk to you.",
    "So you are holding him prisoner. Well, that's interesting. What if you arrest me? Take me prisoner?",
    "I'll have to think of some other way.",
    "Hmm. He doesn't seem very amused.",
    "Well? Was that entertaining?",
    "A cowbell. Really?",
    "Slaves? Rebels? I thought they were aiming for world domination.",
    "I better get in the penguin suit before I talk to them.",
    "Hi guys!",
    "WHAT? What suit? I...you mean you know I'm not a penguin?",
    "You knew? How? Why didn't you say something?",
    "Yeah, I do actually feel better.",
    "What are you guys doing out here, anyway?",
    "Well, I can help with that! I've got a gig for you, just off the coast of Rellekka. Some big fans of your cowbell. I bet I can help with your...threads...too. What do you need?",
    "If you give me the supplies, I'll get the costumes made.",
    "Yup, I've got them right here.",
    "It's on the coast of Rellekka. We'll just take the canoe over.",
    "There's something else you should know. This isn't just any gig, it's a gig for some seals, who I'm hoping will lead me to the Walrus. He's kidnapped a friend of mine and I need to rescue him.",
    "I'm sure.",
    "Is that better than before?",
    "Where did the Walrus come from? Why did you let him become your leader?",
    "But why do you need prisoners? What did they do wrong?",
    "Who else lives there?",
    "The penguins were slaves to polar bears?",
    "Hi, are you Teddy, the PBJ agent?",
    "Okay, Theodore. I've come to rescue you. Chuck said you had a lead on where Larry might be.",
    "What? He's here? Why haven't the two of you escaped? It can't be that hard for the two of you to get away.",
    "You're talking crazy. Larry'd be out of here faster than...something fast.",
    "I think I found him.",
    "Larry? What's going on? Why are you dressed like that?",
    "Okay, you think you're a penguin. Even penguins don't talk like that! Tell me what's going on!",
    "Larry, snap out of it! This isn't you. Penguins are bad, don't you remember? You made me risk my life infiltrating their iceberg, and I accidentally gave the Pescaling my disguise, and he used it to build a submarine.",
    "And then you put my life in danger again by making me infiltrate the submarine and sabotage it while I was still on it!",
    "Come on, Larry! Don't you remember the good times?",
    "Oh Larry. I didn't think there was a new level of crazy for you to attain. Teddy and I will have to figure out a way to get out of here.",
    "I found my friend, Larry. He's not in good shape.",
    "He must be secretly planning something. Luring them into a false sense of security or some other ploy.",
    "I don't understand. How did he end up here with the seals? The penguins had him!",
    "We've got to get Larry out of here. He needs help.",
    "Then that is step one: get him an egg.",
    "No. Any ideas?",
    "Have you guys seen any eggs around the camp?",
    "Any idea where I can get an egg?",
    "Noodle! What are you doing here?",
    "Oh, yeah...Last time you saw me I was a penguin. I gave you tar and feathers and you gave me a fake ID card.",
    "Why are you here?",
    "Well, lucky for me you did. I need something smuggled in. I need an egg.",
    "Keep it down! Yes, we're planning an escape. I suppose I can bring you, too. What information do you have in exchange?",
    "I'd guessed that much myself! What about an egg?",
    "What on earth did you just say?",
    "Never mind",
    "Noodle says the Walrus has one. I think I better investigate his hut.",
    "Noodle can't smuggle anything in or out. He thinks there is an egg in the walrus' hut though. I'm going to go check that out.",
    "Hmm, looks like he's having an egg for dinner. I need to get him out of the cabin long enough to get the egg.",
    "The Walrus has an egg in his cabin. We need to make enough noise to irritate him and make him leave long enough for me to go in and grab it.",
    "Teddy, we have to make enough noise to get the Walrus out here. You need to dance or something!",
    "The Walrus has an egg in his cabin. We need to make enough noise to irritate him and make him leave long enough for me to go in and grab it.",
    "I bet you can't bounce that ball 100 times.",
    "Keep it up, Teddy!",
    "Rock on!",
    "You can do better than that!",
    "I better go steal that egg while he's distracted.",
    "Larry, I got you an egg.",
    "No parent would want to raise their child in a prison camp. Surely you will want to escape with us. You want to do what's best for your egg.",
    "Sheldon? Really?",
    "You know what? Fine. I'm not even going there.",
    "At least now he'll cooperate. I better form an escape plan with Teddy.",
    "Larry has the egg and agreed to escape.",
    "You must have had a plan?!",
    "I guess I could ask all the penguins, see if any of them have a plan.",
    "Any ideas about how we could escape here with Teddy and Larry, guys?",
    "I'll let you two think about it for a while, shall I?",
    "Any ideas about how we could escape here with Teddy and Larry?",
    "Why would we tar and feather the seals?",
    "Move in what?",
    "I need help with a plan to- well, I don't want to say in front of the seal.",
    "So, you ever thought about escaping from here? Did you make any plans?",
    "That's madness!",
    "I think there are 5 more penguins to talk to.",
    "Any bright ideas for how to escape?",
    "I'm not sure how the killer whale would feel about that.",
    "I think there are 4 more penguins to talk to.",
    "Psst! You got an escape plan?",
    "Where would we get that much underwear?",
    "I think there are 3 more penguins to talk to.",
    "Comrade! Report your escape plan to me!",
    "Let's put a pin in that and come back to it later.",
    "I think there are 2 more penguins to talk to.",
    "Hi! I was just curious, are you planning an escape?",
    "Okay... Well, we can always use that as a back-up plan.",
    "I think there's 1 more penguin to talk to.",
    "Have you got any ideas for how to escape?",
    "But what if it is a dream?",
    "I think that's all the penguins in the camp. I should talk to Teddy.",
    "Survey complete. These are the ideas:",
    "We could make a lasso out of underwear and snag a trip on an albatross.",
    "We could fire ourselves onto the mainland using the blowholes of killer whales.",
    "We could lie on our backs and spell the word 'Help!' in penguins.",
    "Pull a fire alarm, and use the chaos to escape on rafts.",
    "Make another iceberg, the same as this one, and move the seals over when they're asleep.",
    "We could combine our powers to create Megapenguin[sic]",
    "Guess we're back to square one.",
    "Wait...wait. What if we did rebuild the sub, but we disguised the work as being part of preparing for the rock show?",
    "Err, you do realise we won't actually do the show, right? It's a front to hide our escape.",
    "Right... Anyway, I think this could work. Teddy, can you repair the submarine?",
    "Okay! I'll get some blueprints from one of the penguins that was captured from the submarine. Any idea who I should speak to?",
    "Have any of the penguins mentioned to you knowing how the submarine worked? I need some blueprints.",
    "Have any of the penguins mentioned to you knowing how the submarine worked? I need some blueprints.",
    "Excuse me, can you help me?",
    "Err, hello?",
    "I want to rebuild the submarine. Do you know how it was built?",
    "Okay, what do you need?",
    "What happened?",
    "I don't see how that was a good deal for the penguins.",
    "But what do you plan to do with them?",
    "Tried to take over the world, you mean.",
    "From what?"
  ],
  "Chuck": [
    "Ah, Player. It's good to see you again.",
    "I'm glad you stopped by. One of my polar bear agents was on Larry's trail and has been captured by the enemy. I'm going to need your help to break him out. Will you help?",
    "Very good!",
    "I received a ransom note...of sorts. My agent, Teddy, was attempting to track down Larry. He went to investigate a lead and was never heard from again. Then I received a letter from the Walrus.",
    "No. THE Walrus. He and the polar bears have a...delicate...truce. We control the land and permit him to patrol the seas. However, somehow Teddy has stumbled into his territory and has become a POW.",
    "No, he's a Prisoner of Walrus. I don't know where he's being held, but I have intelligence reports saying a colony of seals have arrived on the coast of Rellekka, near Larry's boat.",
    "You need to convince them to take you to their camp and locate Teddy.",
    "Of course.",
    "Let me teleport you to Rellekka to get you started on your path.",
    "That reminds me, you won't need to carry your penguin suit. Both Jim and I have copies of it, should you require to transform."
  ],
  "Seal": [
    "Mmmfph... What?",
    "What do I get out of it? Talking bores me. Do something entertaining and then maybe I'll talk to you.",
    "I dunno. Maybe do a dance. Dancing is entertaining, mostly because humans look odd dancing.",
    "Because we're sleepy.",
    "Pfft, as if I'm going to help you! The Walrus would have my hide if I revealed the location of our prisoner.",
    "I'm not going to now you've told me. I'm sleepy, not stupid!",
    "Humph, not really. You've got no style. And it definitely needed more...I don't know. Something. Like a cowbell!",
    "Yeah, my favourite band uses cowbells. I shouldn't really listen to them, as they're penguins, but boy do they know how to jive!",
    "They're slaves and rebels. Or food. Very tasty food.",
    "Exactly. Slaves shouldn't have power. So we eat them.",
    "I don't know. With other penguins, probably. A lot of their songs were about being oppressed by some guard.",
    "Arf arf! That was great! You have to come do a show for us at the camp.",
    "I guess it'll be okay. Just make sure he doesn't do anything bad.",
    "Oi! This isn't some vacation camp we're going to. You can't take anything in with you",
    "Shove off, two-legs.  You may not be a prisoner, but I can’t fraternize with you.",
    "He's our leader. Before him we just ate penguins and lay on the coast taking naps. And sometimes fought polar bears. Now we're organised and wear uniforms and have jobs.",
    "Umm, I guess so. I kind of miss napping, though.",
    "Have you seen how big he is? None of us could have stopped him if we wanted to. I don't know where he came from, he just has always been.",
    "Well, we all really like being entertained. One of us went to the circus once, and ever since then it's been our favourite entertainment. The bear tried to escape so we decided he should wear a clown suit an[sic] entertain us.",
    "We had other circus toys, too, but the Walrus took them away. He said we were making too much of a ruckus with them. I don't even know what a ruckus is!",
    "It's where we put Prisoners of Walrus, of course!",
    "They're penguins and they built that ugly abomination of a 'ship' and started swimming in our waters.",
    "Nobody swims in our waters. So we captured them. We might have eaten a few, too.",
    "It's lovely. There's nothing around but white ground and blue sea.",
    "Well, we seals, and the Walrus. The polar bears live on the land, mostly. Them and the penguins. The penguins used to just serve the polar bears.",
    "but when the Walrus came along, he saw the injustice of it, and made them serve us too.",
    "Sure! That's what they're there for. What else would they do? It's not like they're proper birds and can fly.",
    "The Walrus sure was mean, taking away all of our circus toys.",
    "Do you think this belt makes me look fat?",
    "I miss our homeland. I can’t believe I got picked for duty out here.",
    "I can’t wait until the concert! Ping and Pong are my favourite bad. I wonder if they’ll autograph my tail.",
    "This is okay.",
    "This is pretty entertaining.",
    "This is awesome!"
  ],
  "Ping": [
    "Uh, actually, dude, it's okay. We've known for a while.",
    "Hey, dude. Long time no see. We've been wanting to talk to you about something.",
    "Dude, it was something you needed to realise for yourself! We didn't want to rush you. It was pretty obvious, though. I mean, you just had these vibes...",
    "Oh man, we're experimenting with the sound vibrations through ice. It's totally glacial.",
    "Awesome, dude. There's a crafting table in the 'berg, where the dwarves were making the submarine parts. You can use that, or if you have one at your house.",
    "Don't lose these, dude! Tooks us months to save up ration cards to get them. If you lose them you'll have to replace them yourself.",
    "Dude, have you finished our spectacular threads?",
    "That's cool, dude. I know you can't rush creative vibes.",
    "Easy, dude! Just take them to a crafting table. There's one inside the 'berg in the old workshop where the dwarves were. Or if you have one in your house.",
    "To be excellent, dude! We need them to do a gig that you've lined up for us.",
    "Dude, have you finished our spectacular threads?",
    "Man, I totally agree. You can totally make a set for yourself, if you ever want to.",
    "Dude, where's the gig going to be?",
    "Let's go dudes! Time to roll this rock!",
    "Wicked man! Spy games. Don't you worry, we won't blow your cover, dude. We are the souls of discretion.",
    "Let's sing a song!",
    "We'd love to do a show for you dudes. We need our roadie to come with us, though.",
    "How goes your mission, dude?",
    "Dude, clearly trapezoid is better.",
    "It's going to take a lot of sustained clapping to annoy that moustachio'd dude.",
    "COWABONGO!",
    "Dude, aren’t you suppose to be getting that egg from the Walrus?",
    "Yeah dude, that wouldn't work. What if we....",
    "Dude! We had an idea.",
    "DUDE! That would make an amazing stage! We'll be up there shaking our cowbells and moving their souls."
  ],
  "Pong": [
    "Yeah, man. It's about your penguin suit. It's looking kind of shabby these days.",
    "Yeah, man. We were kind of hoping you'd learn to accept yourself as you are and feel comfortable telling us. There's nothing to be ashamed of, there's nothing wrong with being human.",
    "But we don't care man, you're still our best bud. I bet your aura feels totally cleansed now you've got that off your chest.",
    "It's for our next album: Cowabongo.",
    "Yeah, dude. we'd like to go on tour to promote it more, but we haven't managed to line up any gigs and we don't have the right threads. You've got to have the right threads, man.",
    "That would be bodacious, man. We've got all the supplies to make some stellar costumes, but we don't have any thumbs.",
    "Dude, these are tubular! I'm never gonna take this off.",
    "The wheels on the boat go up and down!",
    "Let's go do this gig!",
    "Sorry to hear that, man. What shape is he in now? I know what it's like to not be a good shape. I always wanted to be a triangle.",
    "Totally sounds like a job for us, dude! We'll get these seals clapping. You should see if you can get anyone else around here to perform.",
    "EXCELLENT!",
    "Yeah, man. We did all that dancing for you to distract him!",
    "We could..uh no...where would we get rubber pants our size?",
    "No way, man. How would we find three flamingos?",
    "Yeah, man. It's a stellar idea. Why don't we do what we came here to do! Put on the most amazing rock show EVER!",
    "Whatever, man. You build it and they will come. The Rock Gods will come."
  ],
  "Ping/Pong": [
    "Let's go to this gig! To the canoe-mobile!",
    "Dude, we made it! Don't worry about us, you go find your friend. We'll keep the seals entertained.",
    "Eggs, man? I haven't seen any of them.",
    "Did you find an egg, dude?",
    "Dude, I think Teddy was looking for you.",
    "Yeah man, I think the cranky old penguin by the kitchen knows a lot about he submarine. Have you asked him?"
  ],
  "Walrus": [
    "You plebians are disturbing my quiescence. All I wish for is a moment of quit reflection.",
    "I'm going to have my delectable egg dinner and then a respite. If you provoke me with your pandemonium - well - ut sementem feceris ita metes: as you sow, so will you reap.",
    "Blasted seals. Always making a ruckus. I swear, they make one more sound and I shall make a cravat out of them. Good thing I installed that sound monitor by the door. Maybe I'll get some peace tonight.",
    "I guess those seals are finally paying attention and keeping quiet.",
    "Aaah peace and quiet.",
    "What is that rumbling?",
    "I swear I hear clapping.",
    "This is your final warning! I know you are making a ruckus!",
    "Did I not warn you of the consequences of disturbing my respite with your tumult? Was it not enough that I confiscated those abominable circus toys of yours?",
    "Please, do not disturb me. I am occupied in dressing down my troops for their incessant cacophony.",
    "Asinine imbeciles! Has it not crossed your miniscule minds that the penguins caused this destruction to cover up their escape? Pursue them with celerity!"
  ],
  "Plaza": [
    "Not right now! We’re concentrating on our invisible chess game.",
    "Go away, whippersnapper. I'm thinking about my next move.",
    "Invisible chess, obviously!",
    "With ears that small it's a wonder you can hear anything! I'm not helping you, human. I'm in the middle of a game, any distractions and I won't remember where my pieces are.",
    "That doesn't count. You fudged the board three moves ago. Besides, chess is for wimps. A real challenge is Battlefish.",
    "Eh?",
    "Don't be daft. Legs can't talk. Oh, it's you, human. What do you want?",
    "I should hope so, seeing as I built it. Along with those short, bearded fellows. However, I don't just give that information out for free. I want something for my expertise.",
    "I want to play Battlefish with this mutton-head, but I need an actual game board and pieces to do it. No more invisible board games! It needs to have a chequered pattern on it and game pieces.",
    "Well, whippernsapper[sic]? You finished making me a Battlefish game?",
    "Well, use your imagination. Try and find things around the camp you can cobble together to make game pieces.",
    "Can't even keep a track of a simple list? What's wrong with you?",
    "You already have the list.",
    "Ha! That old fart... Worst thing that ever happened to my people, he was.",
    "I could escape if I wanted, but where would I go? Back to that idiot Pescaling and his ridiculous ideas about taking over the world? That wasn't what any of us wanted. He just went mad.",
    "I haven't seen our homeland in many years; not since we broke away.",
    "What do you know, two-legs? We were trying to find a sanctuary.",
    "There was a delicate balance in our homeland. The seals lived on the coast and in the water. The polar bears lived inland. Penguins moved between the two. We served the polar bears, and though some times cruel, they were good masters. They protected us from this lot.",
    "We had no other choice but to flee or face further enslavement. You tell me, two-legs. We've been trying to build up an army ever since, to hold our own agains this lot."
  ],
  "Penguin (With monkfish hat)": [
    "Oh, for a glimpse of our home! I hate this place."
  ],
  "Penguin (With octopus hat)": [
    "Shh! Don’t talk to me! I don’t want the seals to bite me again."
  ],
  "Penguin (With manta hat)": [
    "Stupid Pescaling...annoying the seals, getting us caught. All for what?"
  ],
  "Penguin (With puffer fish hat)": [
    "They make us dance to entertain them, or they’ll eat us."
  ],
  "Penguin (Near Larry)": [
    "Don’t you thin snow looks like butter?"
  ],
  "Penguin (By the fishing hole)": [
    "Pfft, puny human. I don’t want to talk to you."
  ],
  "Teddy": [
    "My name is Theodore...",
    "Oh, it's more than a lead. Larry's here.",
    "Larry won't escape.",
    "I can't explain it; you won't believe me. You need to see him for yourself. He's around here somewhere.",
    "I can tell you've spoken to Larry. Do you understand now why he won't escape?",
    "Don't delude yourself. You think I didn't think of that already? I've been observing him closely, and there's been no change. He's convinced he's a penguin. He must be brainwashed or something.",
    "He won't cooperate. I tried forcing him and we got caught and I got put in this ridiculous outfit. He won't shut up about that egg.",
    "Worked out how to get an egg for Larry, yet?",
    "I've heard rumours that there's a black market. I don't know who runs it, though, since the penguins won't talk to me. Nobody wants to talk to me.",
    "How degrading. I can't promise to do it for long, I'll probably get a headache.",
    "Look at me. I'm entertaining.",
    "I just can't bear it.",
    "Don't you think you'd best go and steal that egg after forcing me to dance and humiliating me in front of my enemies?",
    "Well, you managed to get an egg. Hurrah. Give it to Larry and see if he is more willing to cooperate.",
    "You should be more careful with eggs. I saw you drop this and picked it up for you.",
    "Joy. How are we going to escape from this depressing place?",
    "*Sigh* I wasn't planning on being captured, why would I have a plan to escape?",
    "This will all end in tears. Most likely, my tears.",
    "You should speak to the penguins. I suppose their tiny minds might come up with some way of us escaping.",
    "You'll never get anything useful out of those two. Best try the others.",
    "...",
    "Did they fail to notice the word 'killer' in the name of that whale?",
    "You're aware that penguins are mostly white when they lie on their backs...",
    "Not bad, except for not having fire alarms. Or rafts.",
    "I can't decide if that's madness or genius. Whichever it is, it won't work.",
    "Our powers combined would just create an even bigger flightless bird with a fluffy belly.",
    "*Groan* I'm going to go mad if I have to listen to one more idiotic penguin idea.",
    "Perhaps, but not without plans and help. I never saw the submarine in action so I don't know how to rebuild it.",
    "I believe that older penguin by the kitchen worked on the sub.",
    "Do you want me to explain the situation, or do you have everything under control?",
    "We're being pursued and the ship is in bad shape.",
    "You need to assign everyone jobs to keep this ship repaired, otherwise we're doomed.",
    "You also need to send counter attacks to the seals, via the periscope in the next room.",
    "That shaking means we've taken irreparable damage. The only way for us to escape is for you to destroy all of their ships before ours is destroyed."
  ],
  "Larry": [
    "Squak!",
    "SQUAK!",
    "Fine. I'm upset because I don't have an egg. I can't help the motherland if I don't have children. I need an egg. And you're a smelly human.",
    "Oh yeah, I remember. You're a traitor to the motherland!",
    "I am the eggman. Where is the walrus? Woo woo woo.",
    "Seals are scum!",
    "Under the sea...",
    "SQUAK",
    "Waddle...waddle...",
    "Mmm fish are tasty.",
    "I haven't been able to find out. From what I've pieced together, it seems the seals captured a submarine, the carcass of which you see in the camp. I think Larry and all these other penguins must have been on board.",
    "My baby! Ooh, aren't you a pretty egg? Yes you are! Yes you are!",
    "You're right. This is no place to raise Sheldon."
  ],
  "Penguin": [
    "Do I look like a girl? I don't just pop eggs out, you know.",
    "Maybe cover a rock in snow and pretend it's an egg...",
    "Nope. Don't know nothing.",
    "I passed the breeding age a LONG time ago sonny.",
    "There's a Pasta Mafia penguin some where around here. He might be able to get you one.",
    "You need Noodle. If anyone can get an egg, it's him.",
    "Yeah, I've got a plan. *WHISPER, WHISPER, WHISPER*",
    "Hmmm, what about this? *WHISPER, WHISPER, WHISPER*",
    "I was pondering something. *WHISPER, WHISPER, WHISPER*",
    "Sir, yes sir! *WHISPER, WHISPER, WHISPER*",
    "Shh! The Seals may hear you! *WHISPER, WHISPER, WHISPER*",
    "I was thinking...*WHISPER, WHISPER, WHISPER*"
  ],
  "Noodle": [
    "Don' kno' you mate. Wot?",
    "Ah, yer. Fake IDs weren't enough, eh? You wen' trans-species. My Uncle Pesto did that, bur we dun talk bout 'im much.",
    "Yer...May have given bad odds on seagull fight.",
    "Soz mate, no smugglin' here. The fuzz are too tough. Cor' I can do some info. Bu' oi bet yur escapin' an oi wan' in.",
    "Li'l birdy tol' me dat yur mate Larry wurz brainwashed in th'mutherland. They wuz trainsportin' em wen the fuzz cot em.",
    "Err, I hurd the Walrus eats em for lunch. Moit wanna check hez hut.",
    "Wotcha, mate. Ain't you ment to be gitin tha egg from 'tache man?",
    "Egg from the man! You inna the Walrus. Reet?",
    "Yur mates inna goofy suits look up fer it. Ask them to make noize.",
    "Oi, mate, the ‘tache man ain’t in ‘is hut. Youz gunna steal tha’ egg?",
    "Wotcha, mate. Tha' funky bear were lookin' fur yeah.",
    "Errr, we cud tar and fevar the seals.",
    "Dunno, jus sounds fun, mate.",
    "Yur mate. Tha' cranky old codger by the kitchen knows a lot 'bout subs."
  ],
  "Bouncer": [
    "Can so! You just keep checking in - I'll prove it to you.",
    "Okay, okay, I'm trying.",
    "I give up. This is impossible!"
  ],
  "Pong and Ping": [
    "Whew, I am tuckered out."
  ],
  "Astoria": [
    "Let me just cover my ears. Oh, wait. My flippers can't reach them. You are so insensitive.",
    "Checkmate! HA.",
    "The two-legs is talking to you.",
    "TWO-LEGS! TALKING!",
    "You know two-legs can't remember anything. Write it down for 'em.",
    "I like carving things with my teeth. Maybe you should carve the pieces out from something.",
    "That depends entirely on your perspective. I'm sure penguins younger than you would disagree.",
    "The Walrus showed up, one day, and united all the seal tribes. He demanded the penguins be our servants.",
    "It wasn't. But it finally pushed them over the edge and gave them some backbone. They broke away on an iceberg and made an attempt at freedom. I like them lot better now they've got some backbone. That's why I put up with this crank.",
    "Pah, what's this old crank going to do? Fly away? Nah, it's boring here and all these young idiots are obsessed with stupid things like the circus.",
    "What does it look like it's for? Holding prisoners.",
    "No idea. It's above my pay grade.",
    "You were tasty! You can;t expect us not to give in to primal instincts. The Walrus showed up one day, and united all the seal tribes. He negotiated a truce with the bears that we could have penguins servants too, and we'd keep out of each other's way."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Some_Like_It_Cold?oldid=36207131’"
  ]
}