{
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "lots of dialogue options, such as more conversation with AnaYou can discuss this issue on the talk page or edit this page to improve it."
  ],
  "Irena": [
    "Boo hoo! Oh dear, my only daughter....",
    "Oh dear... my daughter, Ana, has gone missing in the desert. I fear that she is lost, or perhaps... *sob* even worse.",
    "*Sob* she went in there just a few days ago, *Sob* she said she would be back yesterday. *Sob* And she's not...",
    "That would be very good of you. You would have the gratitude of a very loving mother. Are you sure you want to take on that responsibility?",
    "That would be great! That's really very nice of you! She was wearing a red silk scarf when she left. Are you 'really' sure you want to do this? I mean, go on this quest?",
    "Oh, okay. I understand... but if you change your mind, I'd really appreciate it.",
    "Oh thank you! You've made me a very happy mother, I just hope it's not too late!",
    "I did go looking for her myself and I came across some footprints just a little way south. I'm worried that they lead to the desert mining camp!",
    "Oh really, is there no way I can persuade you to help me?",
    "She was just travelling, a tourist you might say. *Sob* She said she would be safe and now she could be. *Whhhhhaaaaa*",
    "Well, yes, you'll have my gratitude young man. And I'm sure that Ana will also be very pleased! And I may see if I can get a small reward together... But I cannot promise anything. So does that mean that you'll look for her then?",
    "It may already have happened you thoughtless oaf! My daughter, Ana, could be dead or dying in the desert!",
    "Please bring my daughter back to me. She is most likely lost in the Desert somewhere. I miss her so much... Wahhhhh! *Sob*",
    "I did look for her myself and a little way south. I came across some footprints which may be hers. I'm worried that she may have been caught by some guards and taken to work in that terrible desert mine to the south.",
    "I think she may have just gone a little way into the desert. It's unlike her to go too far away. She is an adventurous girl, but she knows how I worry. She wouldn't go too far.",
    "I think I saw some of her footprints to the south, you could start there. Hopefully she'll just be over a few sand dunes, but you never know. She may have been taken to that awful desert mining camp, or captured by brigands!",
    "Hey, great you've found Ana!",
    "Hi Ana!",
    "Thank you very much for returning my daughter to me. I'm really very grateful... I would like to reward you for your bravery and daring. I can offer you increased knowledge in two of the following areas.",
    "Okay, now choose your second skill.",
    "Okay, that's all the skills I can teach you!"
  ],
  "Player": [
    "What's the matter?",
    "When did she go into the desert?",
    "I'll look for your daughter.",
    "Okay Irena, calm down. I'll get your daughter back for you.",
    "Err,actually,[sic] I've had second thoughts now.",
    "Yes, I'll go on this quest!",
    "Do you have any other hints on where she may have gone?",
    "No, sorry, I'm just too busy!",
    "What did she go into the desert for?",
    "Is there a reward if I get her back?",
    "Cheer up, it might never happen.",
    "Do you know where Ana went?",
    "Is there anywhere around here that she would go?",
    "Where do you think I should start my search?",
    "Okay, thanks.",
    "What is this place?",
    "Perhaps five gold coins will make it my business?",
    "What is this place?",
    "So you could almost say that they got their ... 'Just Desserts'",
    "When they talk about 'the silence of the desert', this must be what they mean.",
    "Can I take a look around the place?",
    "Does the Captain order you to kill a lot of people?",
    "Not to mention the senseless waste of human life.",
    "It doesn't sound as if you respect your Captain much.",
    "And how could I trick him into a one-on-one duel?",
    "Can I have a bet on that?",
    "I'll bet 5 gold that I win.",
    "I'll bet 20 gold that I win.",
    "Unless what?",
    "Where would I find this Al Zaba Bhasim?",
    "The Tentis, who are they?",
    "Is Al Zaba Bhasim very tough?",
    "What are you guarding?",
    "What are you guarding?",
    "Okay, thanks.",
    "Perhaps five gold coins will sweeten your mood?",
    "What is this place?",
    "What are you guarding?",
    "I'm looking for a woman called Ana, have you seen her?",
    "Perhaps five gold coins will help you remember?",
    "I'm looking for a woman called Ana, have you seen her?",
    "Wow! A real captain!",
    "That's rude, I ought to teach you some manners.",
    "With my right fist and a good deal of force.",
    "Err, sorry, I thought I was talking to someone else.",
    "I'd love to work for a tough guy like you!",
    "I can mine!",
    "You don't scare me!",
    "Can't I do something for a strong Captain like you?",
    "Consider it done.",
    "Sorry Sir, I don't think I can do that.",
    "It's a funny captain who can't fight his own battles!",
    "Okay, I'll be moving along then.",
    "You there!",
    "I'm lost, can you help me?",
    "You don't scare me!",
    "What are you guarding?",
    "Do you have sand in your ears, I said, 'What are you guarding?'",
    "Hey ugly!",
    "Ow!",
    "I've some information for you about Al Zaba Bhasim",
    "Al Zaba Bhasim is a figment of your diseased imagination. Go look for him yourself and waste your own time if you think he still exists.",
    "Who are you?",
    "I am looking for Al Zaba Bhasim.",
    "What is this place?",
    "I've some information for you about Al Zaba Bhasim.",
    "Al Zaba Bhasim is a figment of your diseased imagination. Go look for him yourself and waste your own time if you think he still exists.",
    "Hey, I've come to collect my bet!",
    "Thanks!",
    "Mmm... looks like that camel would make a nice kebab.",
    "I've just arrived.",
    "What are those big metal gates in the corner of the compound?",
    "Oh yes, that sounds interesting.",
    "What's that then?",
    "I can try to undo them for you.",
    "It's funny you should say that actually.",
    "If I can get the chains off, you have to give me something, okay?",
    "I want your clothes!",
    "I can dress like a slave and gain access to the mine area to scout it out.",
    "Yeah, okay, let's give it a go.",
    "Yes, I'll trade.",
    "Yeah, good luck to you too!",
    "No thanks...",
    "I need to do some other things first.",
    "That sounds awful.",
    "That's ridiculous, you're talking rubbish.",
    "Good luck!",
    "Oh, that's a shame... Still, 'worse things happen at sea right?'",
    "Well I suppose I'd better be getting on my way now...",
    "Oh, I've been here ages.",
    "Okay, you caught me out.",
    "The guards allow me to clean my clothes.",
    "Er nothing really.",
    "I'd like to mine in a different area.",
    "Huh, fat chance of a rest for me.",
    "Yes sir, you're quite right sir.",
    "How am I going to get some pineapples around here?",
    "Yes sir, we understand each other perfectly.",
    "What are the Tenti's?",
    "Do you know where I could get a tenti pineapple?",
    "I am looking for a pineapple.",
    "Oh yes?",
    "Yes, I'm interested.",
    "Not at the moment.",
    "I've lost the key!",
    "Yes, I'm very interested.",
    "Yes, I'm kind of curious.",
    "No, sorry.",
    "I wanted to have a chat?",
    "But I just need two minutes of your time?",
    "Well, er... erm, I err....",
    "Oh my, a dragon just flew straight past your window!",
    "You seem to have a lot of books!",
    "How long have you been interested in books?",
    "I could get you some books!",
    "So, you're interested in sailing?",
    "I could tell by the cut of your jib.",
    "Not much sailing to be done around here though?",
    "What's it got to do with you?",
    "The guard downstairs said you were lonely.",
    "I need to service your chest.",
    "I need to service your chest?",
    "Prepare to die!",
    "All the slaves have broken free!",
    "Fire! Fire!",
    "It's down in the lower mines, sound the alarm!",
    "Yes actually!",
    "I don't know where the alarm is.",
    "I was so concerned for your safety that I rushed to save you.",
    "Er, no, one of the slaves told me.",
    "Oh yes, you're right, they must have put it out!",
    "Er, yes okay then.",
    "Al Shabim said I could enter, here are the plans!",
    "I am looking for a pineapple.",
    "Goodbye!",
    "Hey... I have something for you!",
    "So, can I go through now please?",
    "What is this thing?",
    "Ok, thanks.",
    "Can I use this?",
    "Nothing thanks - sorry for disturbing you.",
    "Your head on a stick.",
    "Okay, I have all your rocks here, let me out now.-- The guard unlocks the gate. --",
    "Hello!",
    "No, I'm new here!",
    "Do you have any ideas about how we can get out of here?",
    "I managed to sneak past the guards.",
    "I have a key.",
    "What?",
    "It's a trade secret!",
    "Huh, these guards are rubbish, it was easy to sneak past them!",
    "I want to try and get you out of here!",
    "We could try to sneak out.",
    "Have you got any suggestions?",
    "Okay, I'll check around for another way to try and get out.",
    "How does the rock get out?",
    "Maybe? I'll come back to you when I have a plan.",
    "Where would I get one of those barrels from?",
    "Er no reason! Just wondering.",
    "I could try to sneak you out if you were in a barrel!",
    "Okay, yep, I've got that.",
    "Well, we'll see, it might be the only way.",
    "What kind of surprise did you get?",
    "Do you want to go back to Al Kharid?",
    "Hello again!",
    "Not yet, sorry, what's your name again?",
    "Well, I'm working on it, have you got any suggestions?",
    "Not yet, have you been in any more trouble with the guards?",
    "Do you enjoy it down here?",
    "Okay, see ya!",
    "Shush... It's for your own good!",
    "Yes please.",
    "Oh, it was nothing.",
    "I said you were very gregarious!",
    "No thanks, I can manage.",
    "Hello!",
    "Oh, okay, sorry.",
    "Nice cart.",
    "One wagon wheel says to the other, 'I'll see you around'.",
    "'One good turn deserves another.'",
    "No",
    "Yes",
    "Fired... no, shot perhaps!",
    "Oh, I'm not supposed to be here at all actually.",
    "I'm in for murder, so you'd better get me out of here!",
    "In for a penny in for a pound.",
    "Can you smuggle me out on your cart?",
    "Can you smuggle my friend out on your cart?",
    "Well, you see, it's like this...",
    "Good luck!",
    "You can't leave me here, i'll get killed!",
    "There's ten gold in it for you if you leave now no questions asked.",
    "A hundred it is.",
    "Forget it!",
    "Can I help you at all?",
    "Can you get me the heck out of here please?",
    "I could help, I know a lot about carts.",
    "Pssst...",
    "Psssst...",
    "Psssssst...",
    "Pssssssssttt!!!",
    "Shhshhh!",
    "I wonder if you could help me?"
  ],
  "Mercenary": [
    "Yeah, what do you want?",
    "It's none of your business now get lost.",
    "Well, it certainly will help... -- The guard takes the five gold coins. -- Now then, what did you want to know?",
    "It's just a mining camp. Prisoners are sent here from Al Kharid. They serve out their sentence by mining. Most prisoners will end their days here, surrounded by desert.",
    "You could say that... -- There is an awkward pause -- But it wouldn't be very funny.",
    "Not really. The Captain won't let you in the compound. He's the only one who has the key to the gate. And if you talk to him, he'll probably just order us to kill you. Unless...",
    "-- The guard snorts. -- *Snort* Just about anyone who talks to him. Unless he has a use for you, he'll probably just order us to kill you. And it's such a horrible job cleaning up the mess afterwards.",
    "Huh? Them's your words, not mine.",
    "Well, to be honest. We think he's not exactly as brave as he makes out. But we have to follow his orders. If someone called him a coward, or managed to trick him into a one-on-one duel many of us bet that he'd be beaten.",
    "Like all cowards, he likes to be made to feel important. If anyone insults him outright, he just gets us to do his dirty work. However, if he thinks he's better than you, if you compliment him, he may feel that he can defeat you. And if he initiated a duel, all the men agreed that they wouldn't intervene. We think he'd be slaughtered in double quick time.",
    "Sorry, we've already taken your bet, wouldn't want any cheating now. Anyway, I have to get back to work. See ya around...",
    "Well, if you think you stand a chance, sure. But remember, if he gives us an order, we have to obey.",
    "Great, I'll take that bet.",
    "Ok, if you win, you'll get 6 gold back. Anyway, I have to get going, I do have work to do. -- The guard walks off. --",
    "Great, I'll take that bet.",
    "Ok, if you win, you'll get 30 gold back. Anyway, I have to get going, I do have work to do. -- The guard walks off.",
    "Unless he has a use for you. He's been trying to track down someone called 'Al Zaba Bhasim'. You could offer to catch him and that might put you in his good books?",
    "Well, he could be anywhere. He's a nomadic desert dweller. However, they say that he's frequently to be found to the west in the hospitality of the Tentis.",
    "Well, we're not really sure what their proper name is, but they live in tents so we call them the 'Tentis'.",
    "Well, I'm not sure, but by all accounts, he is a slippery fellow. The Captain has been trying to capture him for years. A bit of a waste of time if you ask me. Anyway, I have to get going, I do have work to do.",
    "Well, if you have to know, we're making sure that no prisoners get out. -- The guard gives you a disapproving look. -- And to make sure that unauthorised people don't get in. -- The guard looks around nervously. -- You'd better go soon before the Captain orders us to kill you.",
    "Get lost before I chop off your head!",
    "Yeah, whatever!",
    "Well, it certainly will help!",
    "Now then, what did you want to know?",
    "It's none of your business now get lost.",
    "Get lost before I chop off your head!",
    "No, now get lost!",
    "Well, it certainly will help!",
    "Now then, what did you want to know?",
    "Hmm, well, we get a lot of people in here. But not many women though... Saw one come in last week.... But I don't know if it's the woman you're looking for?",
    "Take that you infidel!",
    "We're sick of having to kill every lunatic that comes along and insults the captain, it makes such a mess. Thankfully, he's a bit decrepit so he doesn't notice so please, buzz off and don't come here again.",
    "Well, I guess congratulations are in order.",
    "And we'll only charge the paltry sum of.. erm... -- The guards starts[sic] to do some mental calculations -- -- You can see his brow furrow and he starts to -- -- sweat profusely. -- [Five/20] gold for cleaning up the mess. You have won [1/10] Gold piece[s]! Well done..! Ha, ha, ha ha! -- The guards walk off chuckling to themselves. --",
    "Move along now, we've had enough of your sort!"
  ],
  "Mercenary Captain": [
    "Be off effendi, you are not wanted around here.",
    "Oh yes! How might you do that? You seem little more than a gutter dweller. How could you teach me manners?",
    "Oh yes, ready your weapon then! I'm sure you won't mind if my men join in? Har, har, har! Guards, kill this gutter dwelling slime.",
    "Well, Effendi, you do need to be careful of what you say to people. Or they may take it the wrong way. Thankfully, I'm very understanding. I'll just let my guards deal with you. Guards, teach this desert weed some manners.",
    "Hmmm, oh yes, what can you do?",
    "Ha, ha, ha! You come to a mining camp and offer us your mining skills! Thanks effendi, but we have all the miners we'll ever need. Now be off with you, before we reduce you to a bloody mess on the sand.",
    "Well, perhaps I can try a little harder. Guards, kill this infidel.",
    "You could bring me the head of Al Zaba Bhasim. He is the leader of the notorius desert bandits, they plague us daily. You should find them west of here. You should have no problem in finishing them all off. Do this for me and maybe I will consider helping you.",
    "Good... run along then. You stand around flapping your tongue chatting like an insane camel.",
    "Hmm, well yes, I did consider that you might not be right for the job. Be off with you then before I turn my men loose on you.",
    "Very well, if you're challenging me, let's get on with it!",
    "Effendi, I think you'll find that is the wisest decision you have made today.",
    "How dare you talk to me like that! Explain your business quickly... or my guards will slay you where you stand.",
    "We are not a charity effendi, Be off with you before I have your head removed from your body.",
    "Well, perhaps I can try a little harder. Guards, kill this infidel.",
    "Effendi... For just one second, imagine that it's none of your business! Also imagine having your limbs pulled from your body one at a time. Now, what was the question again?",
    "Why... you ignorant, rude and eternally damned infidel, -- The Captain is very angry at what you just said. -- Guards, kill this infidel!",
    "I will not tolerate such insults.. Guards, kill him.",
    "Okay, that does it!",
    "You're in serious trouble now!",
    "Okay men, we need to teach this person a thing or two",
    "about desert survival tecniques.",
    "Oh yes and what might that be?",
    "Why, I've never been so insulted in all my days. Prepare to defend yourself wretch, I'll run you through myself!",
    "Kill that intruder, guards!",
    "Kill this madman, guards!",
    "Destroy this low-life desert rat, guards!",
    "Oh yes and what might that be?",
    "Why, I've never been so insulted in all my days. Prepare to defend yourself wretch, I'll run you through myself!",
    "Move along now... we've had enough of your sort!"
  ],
  "Guard": [
    "Take that you mad child of a dog!",
    "What are you doing here again? Didn't I tell you to get out of here! Now get lost, properly this time! Or we may be forced to see his orders through properly.",
    "You won't be needing that water anymore!",
    "You won't be needing that water anymore!",
    "Hey - you with the weapon!",
    "Hey - you with the weapon!",
    "You're not allowed in here!",
    "You're not allowed in here!",
    "Quick, men, get him!!",
    "Quick, men, get him!!",
    "Into the cell you go! I hope this teaches you a lesson.",
    "Move along now, we've had enough of your sort!",
    "Hey, they're interesting clothes!",
    "Hey, they're interesting clothes!",
    "You're no slave.",
    "You're no slave.",
    "What are you doing in here?",
    "What are you doing in here?",
    "Oi, what are you two doing?",
    "Oi, what are you two doing?",
    "Hey you, move away from there!",
    "Yeah, what do you want?",
    "Okay... so move along and get on with your work.",
    "Oh, you want to work in another area of the mine eh? -- The guard seems pleased with his rhetorical question.-- Well, I can understand that! A change is as good as a rest they say.",
    "You miserable whelp! Get back to work!",
    "Of course I'm right. And what goes around comes around as they say. And it's been absolutely ages since I've had anything different to eat. What I wouldn't give for some whole, fresh, ripe and juicy pineapple for a change. And those Tenti's have the best pineapple in this entire area.",
    "I'm sure you get my meaning...",
    "Well, that's not my problem is it? Also, I know that you slaves trade your items down here. I'm sure that if you're resourceful enough, you'll come up with the goods. Now, get along and do some work, before we're both in for it. And remember, I prefer my pineapples whole, not chopped up with all the juice gone.",
    "Okay, good then. And remember, I prefer my pineapples whole, not chopped up with all the juice gone.",
    "Well! You don't come from around here do you? The Tenti's are the nomadic people west of here. They live in tents, so we call them the Tenti's. They have great pineapples! I'm sure you get my meaning?",
    "Hey, you there!",
    "Hey, you there!",
    "You're in some serious trouble now!",
    "You're in some serious trouble now!",
    "Great! Just what I've been looking for! Mmmmmmm... Delicious!! This is soo nice! Mmmmm, *SLURP* Yummmm... Oh yes, this is great.",
    "Yes, yes, of course... a deal's a deal!",
    "Hey there, what do you want?",
    "It is quite clearly a lift. Any fool can see that it's used to transport rock to the surface.",
    "Of course not, you'd be doing me out of a job. Anyway, you haven't got any barrels that need to go to the surface. Now, move along and get some work done before you get a good beating.",
    "Yes, what do you want?",
    "Well... I guess that's okay, get on your way though.",
    "Why you ungrateful whelp.. I'll teach you some manners.",
    "Hey, move away from the gate. If you wanna get out you're gonna have to mine for it. You're gonna have to bring me 15 loads of rocks in one go! And then I'll let you out. You can go back to work with the other slaves then!",
    "Okay, okay, come on out.",
    "Okay, you've got all the rocks, you can go now, but keep your nose clean in future.",
    "I heard that! So you managed to sneak in did you!",
    "I heard that! So you managed to sneak in did you!",
    "Guards! Guards!",
    "Guards! Guards!",
    "Hey! What's going on here then?",
    "Hey! What's going on here then?",
    "Hey, where d'ya think you're going with that barrel?",
    "Cor! This barrel is really heavy! Have you been mining lead?",
    "Har, har har!",
    "What was that!",
    "Hey, that Barrel looks heavy, do you need a hand?",
    "Blimey! This is heavy!",
    "~ The guard looks around surprised at Ana's outburst. ~ What was that?",
    "I could have sworn I heard something!",
    "What was that you said?",
    "Oh, right, how very nice of you to say so.-- The guard seems flattered. --",
    "Anyway, let's get this barrel up to the surface, plenty more work for you to do!",
    "Oh, there's no one operating the lift up top, hope this barrel isn't urgent? You'd better get back to work!",
    "I heard you say something, now spit it out!",
    "Ok, fair enough, I was only offering.",
    "Hey, you'd better go and operate that lift yourself if you want that big heavy barrel to go anywhere."
  ],
  "[Guard/Mercenary]": [
    "Prepare to die effendi!",
    "Are you mad effendi? This is your last chance! Leave now and never come back or I'll introduce you to my friend.",
    "And we'll be pleased to clean the mess up after you've been dispatched."
  ],
  "[Mercenary/Mercenary Captain]": [
    "Guards!! Guards!",
    "Let's see how good you are with Desert Survival tecniques."
  ],
  "Al Shabim": [
    "Hello Effendi! I am Al Shabim, greetings on behalf of the Bedabin nomads.",
    "Huh! You have been talking to the guards at the mining camp. Or worse, that cowardly mercenary captain. Al Zaba Bhasim does not exist, he is a figment of their imagination! Go back and tell this captain that if he wants to find this man he should search for him personally. See how much of his own time he would like to waste.",
    "Hello Effendi! I am Al Shabim, greetings on behalf of the Bedabin nomads. Now... what can I do for you?",
    "Oh yes, well that is interesting. Our sweet pineapples are renowned throughout the whole of Kharid ![sic] And I'll give you one if you do me a favour?",
    "Captain Siad at the mining camp is holding some secret information. It is very important to us and we would like you to get it for us. It gives details of an interesting, yet ancient weapon. We would gladly share this information with you. All you have to do is gain access to his private room upstairs. We have a key for the chest that contains this information. Are you interested in our deal?",
    "That's great Effendi! Here is a copy of the key that should give you access to the chest.",
    "Bring us back the plans inside the chest, they should be sealed. All haste to you Effendi!",
    "Very well Effendi!",
    "Hello Effendi!",
    "How are things going Effendi?",
    "How very careless of you! Here is another key, don't lose it this time ![sic]",
    "Aha! I see you have the plans. This is great! However, these plans do indeed look very technical. My people have further need of your skills. If you can help us to manufacture this item, we will share its secret with you. Does this deal interest you effendi?",
    "Great, we need the following items: a bar of pure bronze and 10 feathers. Bring them to me and we'll continue to make the item.",
    "Great, I can see that you have some feathers. Now we just need a bar of bronze before we can continue.",
    "Great, I can see that you have a bar of bronze. Now we just need some feathers before we can continue.",
    "Great, I can see that you have some feathers, a bar of Bronze and a hammer. Are you still willing to help make the weapon?",
    "Okay Effendi, you need to follow the plans. You will need some special tools for this... tent. You have my permission to use it, but show the plans to the guard. You have the plans and all the items needed. You should be able to complete the item on your own. Please bring me the item when it is finished.",
    "As you wish Effendi! Come back if you change your mind!",
    "Hello Effendi! Wonderful, I see you have made the new weapon!",
    "This is truly fantastic Effendi! We are forever grateful for this gift. My advisors have discovered some secrets which we will share with you.",
    "Please accept this selection of six bronze throwing darts as a token of our appreciation.",
    "I'll take that key off your hands as well effendi! Many thanks!",
    "Oh, and here is your pineapple!",
    "Hello Effendi! Many thanks with your help previously Effendi!",
    "Here is another pineapple, try not to lose this one.",
    "Very well, good day Effendi!"
  ],
  "[Female slave/Male slave]": [
    "Hey leave me alone, can't you see that I'm busy?"
  ],
  "Male slave": [
    "You look like a new 'recruit'. How long have you been here?",
    "Yeah, it looks like it as well. It's a shame that I won't be around long enough to get to know you. I'm making a break for it today. I have a plan to get out of here! It's amazing in its sophistication.",
    "They lead to an underground mine, but you really don't want to go down there. I've only seen slaves and guards go down there, I never see the slaves come back up. At least up here you have a nice view and a bit of sun. -- The slave smiles at you and goes back to his work. --",
    "Yes, it is actually. I have all the details figured out except for one.",
    "-- The slave rattles the chains on his arms loudly. -- These bracelets, I can't seem to get them off. If I could get them off, I'd be able to climb my way out of here.",
    "Really, that would be great... -- The slave looks at you strangely. -- Hang on a minute... I suppose you want something for doing this? The last time I did a trade in this place, I nearly lost the shirt from my back!",
    "-- The slave looks at you blankly. -- Yeah, go on!",
    "Sure, what do you want?",
    "Blimey!",
    "You're either incredibly brave or incredibly stupid. But what would I wear if you take my clothes? Get me some nice desert clothes and I'll think about it? Do you still want to try and undo the locks for me?",
    "Great!",
    "Great! You did it! Do you want to trade clothes now?",
    "I need a desert shirt if you want these clothes off me.",
    "I need desert boots and a desert shirt if you want these clothes off me.",
    "I need desert boots, a desert robe and a desert shirt if you want these clothes off me.",
    "I need desert boots if you want these clothes off me.",
    "I need a desert robe if you want these clothes off me.",
    "I need a desert robe and a desert shirt if you want these clothes off me.",
    "Great! You have the Desert Clothes! -- The slave starts undressing right in front of you -- Okay, here's the clothes, I won't need them anymore.",
    "Okay, fair enough, let me know if you change your mind though.",
    "Okay, fair enough. Let me know when you want to give it another go.",
    "Yeah, bunch of no hopers, tried to rob me blind. But I guess that's what you get when you deal with convicts.",
    "No, it's true, I can make a break for it If I can just get these bracelets off.",
    "Thanks... same to you.",
    "You've obviously never worked as a slave ...in a mining camp... ...in the middle of the desert.",
    "-- The slave nods in agreement and goes back to work. --",
    "That's funny, I haven't seen you around here before. Your clothes look too clean for you to have been here ages.",
    "Ah ha! I knew it! A new recruit then? It's a shame that I won't be around long enough to get to know you. I'm making a break for it today. I have a plan to get out of here! It's amazing in its sophistication.",
    "Oh, a special relationship with the guards heh? How very nice of them. Maybe you could persuade them to let me out of here?",
    "Hello again, do you want to try and unlock my chains? I'd really appreciate it!",
    "Do you have the Desert Clothes yet?"
  ],
  "Slave": [
    "Oh oh!",
    "Oh oh!"
  ],
  "Escaping slave": [
    "Right, I'm off! Good luck!"
  ],
  "Rowdy slave": [
    "Hey, you're in for a good beating!",
    "I'm gonna teach you some respect!",
    "Oi! Are you looking at me!",
    "Oi! I'm gonna give you some trouble!",
    "You wanna piece of me?"
  ],
  "Bedabin nomad": [
    "Hello Effendi! How can I help you?",
    "Oooh, sir is looking for a really very special item then! You must go and talk to our very illustrious leader, Al Shabim. He's located in the largest tent in our village."
  ],
  "Captain Siad": [
    "What are you doing in here?",
    "You don't belong in here, get out!",
    "Well, okay, but very quickly. I am a very busy person you know!",
    "Come on, spit it out! Right that's it! Guards!",
    "Into the cell you go! I hope this teaches you a lesson.",
    "Really! Where? I don't see any dragons young man? Now, please get out of my office, I have work to do.",
    "Yes, I do. Now please get to the point?",
    "Long enough to know when someone is stalling! Okay, that's it, get out! Guards!",
    "Oh, really! Sorry, not interested!",
    "GUARDS!",
    "Into the cell you go! I hope this teaches you a lesson.",
    "Well, yes actually... It's been a passion of mine for some years...",
    "Oh yes? Really?",
    "Well, I was quite a catch in my day you know!",
    "Well of course there isn't, we're surrounded by desert. Now, why are you here exactly?",
    "This happens to be my office. Now explain yourself before I run you through!",
    "Well, I most certainly am not lonely! I'm an incredibly busy man you know! Now, get to the point, what do you want?",
    "You need to what?",
    "There's nothing wrong with the chest, it's fine, now get out!",
    "I'll teach you a lesson!",
    "Guards! Guards!",
    "Don't talk rubbish, the warning siren isn't sounding. Now state your business before I have you thrown out.",
    "Where's the fire? I don't see any fire? Stop messing me around and state your business!",
    "You go and sound the alarm, I can't see anything wrong with the mine. Have you seen the fire yourself?",
    "Well, why didn't you raise the alarm?",
    "That's the most ridiculous thing I've heard. Who are you? Where do you come from? It doesn't matter... Guards! Show this person out!",
    "Well, that's very good of you. But as you can see, I am very fine and well thanks! Now, please leave so that I can get back to my work.",
    "Well... you can't believe them, they're all a bunch of convicts. Anyway, it doesn't look as if there is a fire down there. So I'm going to get on with my work. Please remove yourself from my office.",
    "Good, now perhaps you can leave me in peace? After all I do have some work to do.",
    "Good! Please remove yourself from my office."
  ],
  "The following text is transcluded from Transcript": [
    "Technical plans."
  ],
  "Bedabin nomad guard": [
    "Okay go ahead.",
    "Oh, I remember you; yeah go on in. Hope the weapon construction is going okay."
  ],
  "(If successful": [
    ")'"
  ],
  "Ana": [
    "Hello there, I don't think I've seen you before.",
    "I thought so you know! How do you like the hospitality down here? Not exactly Al Kharid town style is it? Well, I guess I'd better get back to work. Don't want to get into trouble with the guards again.",
    "Of course not! I just don't have much choice about it at the moment.",
    "Hmmm, not really, I would have tried them already if I did. The guards seem to live in the compound. How did you get in there anyway?",
    "Hmm, impressive, but can you so easily sneak out again? How did you manage to get through the gate?",
    "Huh.",
    "I thought the guards would object to you having a key, and they would rush over to take it from you. I guess they don't care as much any more.",
    "Oh, right, well, I guess you know what you're doing. Anyway, I have to get back to work. The guards will come along soon and give us some trouble else.",
    "Wow! You're brave. How do you propose we do that? In case you hadn't noticed, this place is quite well guarded.",
    "That doesn't sound very likely. How did you get in here anyway? Did you deliberately hand yourself over to the guards? Ha ha ha, just kidding.",
    "Hmmm, let me think... Hmmm. No, sorry... The only thing that gets out of here is the rock that we mine. Not even the dead get a decent funeral. Bodies are just thrown down disused mine holes. It's very disrespectful...",
    "Good luck!",
    "Well, we mine it in this section, then someone scoops it into a barrel. The barrels are loaded onto a mine cart. Then they're deposited near the surface lift. I have no idea where they go from there. But that's not going to help us, is it?",
    "Okay, well, I'm not going anywhere! -- Ana nods at a nearby guard!-- Unless he feels generous enough to let me go! -- The guard ignores the comment. -- Oh well, I'd better get back to work, you take care!",
    "Well, you would get one from around by the lift area. But why would you want one of those?",
    "Hmmm, just don't get any funny ideas... I am not going to get into one of those barrels! Okay, have you got that?",
    "There is no way you are getting me into a barrel. No WAY! DO you understand?",
    "Good, just make sure you keep it in mind. Anyway, I have to get back to work. The guards will come along soon and give us some trouble else.",
    "No, there has to be a better way! Anyway, I have to get back to work. The guards will come along soon and give us some trouble else.",
    "My name? Oh, how sweet, my name is Ana. I come from Al Kharid though we've only recently moved there. I was born, and did most of my growing up, in Varrock. I thought the desert might be interesting. What a surprise I got!",
    "Well, I was just touring the desert looking for the nomad tribe to the West. And I was set upon by these armoured men. I think that the guards think I am an escaped prisoner. They didn't understand that I was exploring the desert as an adventurer.",
    "Sure, I miss my Mum, her name is Irena and she is probably waiting for me. How do you propose we get out of here though? I'm sure you've noticed the many square jawed guards around here. You look like you can handle yourself, but I have my doubts that you can take them all on!",
    "Hello there, how's it going? Do you have a plan to get out of here yet?",
    "No, not so far. I've been working very hard. Not like some people I know -- She cocks a smirk at you. --",
    "Goodbye and good luck!",
    "Hey, what do you think you're doing?",
    "Hey, what do you think you're doing? Leave me alone and let me get on with my work. Else we'll both be in trouble. Oh no, NOT AGAIN!",
    "How dare you put me in that barrel you barbarian!",
    "How dare you say that I'm as heavy as lead?",
    "Great! Thanks for getting me out of that mine! And that barrel wasn't too bad anyway! Pop by again sometime, I'm sure we'll have a barrel of laughs!",
    "Oh! I nearly forgot! Here's a key I found in the tunnels. It might be of some use to you, not sure what it opens. Sorry, but I have to go now."
  ],
  "Ana (in a Barrel)": [
    "-- You manage to squeeze Ana into the barrel, ---- despite her many complaints. --I djont fit in dis bawwel... Wet me out!!",
    "-- Ana looks pretty angry, she starts shouting at you. --Get me out of here!Do you hear me!Get me OUT OF HERE I say!",
    "You drop the barrel on the floor, Ana gets out.",
    "There isn't enough space for both you and this barrel in the cart.",
    "Let me out!",
    "Why you cheeky....!",
    "Yes you did you ignoramus.",
    "You creep!",
    "Let me out of here, I feel sick!",
    "You can't drop me here! I'll die in the desert on my own. Take me to the Shantay pass near Al Kharid.",
    "-- You show Irena the barrel with Ana in it. --Hey great, there's my Mum!"
  ],
  "Ana-in-barrel": [
    "How rude! Why I ought to teach you a lesson."
  ],
  "Ana (in-a-Barrel)": [
    "Get me OUT OF HERE!"
  ],
  "Mine-cart driver": [
    "Don't trouble me, can't you see I'm busy?",
    "Look just leave me alone!",
    "Hmmm.",
    "Tut !",
    "-- The cart driver smirks a little. --",
    "Are you trying to get me fired?",
    "It certainly sounds like it, now leave me alone. If you bug me again, I'm gonna call the guards.",
    "Ha ha ha! You're funny! -- The cart driver checks that guards aren't watching. -- What're you in fer?",
    "Hmmm, interesting... let me guess. You're completely innocent... like all the other inmates in here. Ha ha ha!",
    "Hmm, well, I wonder what the guards are gonna say about that! Guards! Guards!",
    "Ha ha ha, oh stop it!",
    "What can I do for you anyway?",
    "Ask that man over there if it's okay and I'll consider it! Ha ha ha!",
    "As long as your friend is a barrel full of rocks. I don't think it would be a problem at all! Ha ha ha!",
    "Yeah!",
    "Oh, right..yes... yess, okay...",
    "Yeah, you too!",
    "Oh, right... Okay, you'd better jump in the cart then! Quickly!",
    "If you're going to bribe me, at least make it worth my while. Now, let's say 100 Gold pieces should we? Ha ha ha!",
    "Great! Okay, get in the back of the cart then!",
    "Okay, fair enough! But don't bother me anymore.",
    "I'm quite capable thanks... Now get lost before I call the guards.",
    "No way, and if you bug me again, I'm gonna call the guards.",
    "Are you saying I don't know anything about carts? Why you cheeky little....-- The cart driver seems mortally offended ---- his temper explodes as he calls the guards.--Guards! Guards!",
    "What! Can't you see I'm busy?",
    "Shush yourself!",
    "Sorry friend, I'm busy, go bug the guards, I'm sure they'll give ya the time of day.",
    "Hurry up, get in the cart or I'll go without you!",
    "Hurry up, get in the cart or I'll go without you!"
  ],
  "Mine-cart Driver": [
    "Can't you see I'm busy? Now get out of here!",
    "And why would you want to do a crazy thing like that for? I ought to teach you a lesson! Guards! Guards!"
  ],
  "Congratulations! You have completed": [
    "'The Tourist Trap' - Complete this Intermediate quest."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:The_Tourist_Trap?oldid=35904349’"
  ]
}