{
  "Lady Grey": [
    "Hey there! So, word on the street is that you're the one helping us dead folk to settle here.",
    "You can call me Lady Grey - that's my stage name, any road - and I wonder if you could help me bring some LIFE back to this place...",
    "No, no, no. Not life; LIFE! Music! Jazz! I want to get my old band back together - won't you be a doll and lend a hand?",
    "Well, I'll be here should you change your mind.",
    "That's aces! All I need is some cool cats to play with and my old axe, and we're golden.",
    "Not actual cats! I just need my sidemen - I'd say a trumpeter, pianist and drummer would do it.",
    "But let's just start with my axe - once I start noodlin', we'll get some interest. If we build it, they will come.",
    "What? No, a guitar, silly.",
    "Not just any guitar, my new friend. I want MY old axe back...from when I was alive.",
    "My mortal instrument, if you will. Ghost guitars just don't cut it.",
    "I left instructions for me to be buried with it. It was my most favourite thing in the whole world.",
    "They said I couldn't take it with me, and I guess they were right...but maybe you could bring it to me instead?",
    "Oh, that won't be necessary. My mortal remains are interred in Lumbridge Catacombs, but I loaned my guitar to an old necromancer friend.",
    "Dragith Nurn - he started out bad, but learned the error of his ways and made amends.",
    "Oh, no, you'll have to beat the ectoplasm out of him...and you MUST use necromancy to do so! His mind has deteriorated over the centuries and he's no longer himself.",
    "You found her! My guitar!",
    "Hey, thanks for reuniting me with my beloved 'Vera'!",
    "My axe, friend - my gui-tar!",
    "And look who else I found while you were away...our fifth band member, Big Al!",
    "Now I'm good to start jamming, I wonder if you could help me with the rest of my band...",
    "Last time I saw my old trumpeter - Murray - he was diving off the ritual site to escape that necromancer dude.",
    "Always was a quick thinker, that one. I reckon you just need to entice him back with a communion ritual.",
    "Though he gets bored easy, short attention span. You'd need to add a bit more speed to your rituals, I'd say!",
    "Hey, you convinced Murray to join us in Um. You should talk to him about his instrument.",
    "Ah, my pianist, Zommy. Last I saw him, he was hanging with the former Master Crafter. I expect they'll both join us soon enough...",
    "Hey, Zommy's finally showed up. You should talk to him about his instrument.",
    "Last time I saw ol' Rhythm, they were hiding away inside that hulk, Hermod...",
    "Oh, yeah, Rhythm is a phantom, can hide in pretty much anything. I say you should beat the snot out of that Hermod bully and rescue my drummer!",
    "Once you find their drumsticks, bring them to me!",
    "I'll have to interpret for this one. Zommy's not much of a talker.",
    "Piano!",
    "Not to worry, Zommy just needs to remember what it looks like and...",
    "There! One piano!",
    "Sorry, it only works for us dead folk.",
    "Oh, hold up... What's that, Zommy?",
    "What good is a piano without keys? Where are they?",
    "Yeah, I suppose that could work.",
    "I'll tell them, don't be so impatient.",
    "So, Zommy told me he arrived at the same time as the Former Master Crafter. They might be able to help make some new keys.",
    "They should be over in the pottery just north-east of here, in the alley beside the house boat. If you hit the boathouse you've gone too far?",
    "There's a spinning wheel there; it should be marked on your map.",
    "Hey, I see you got some piano keys from the Former Master Crafter - can Zommy have them?",
    "That's Zommy squared away, thank you! Zommy thinks you're the real deal too.",
    "Now to start jamming, I wonder if you could help me with the rest of my band...",
    "You broke Rhythm's drumsticks. Good job I found 'em again. I'll hold on to them 'til you can take 'em.",
    "Here, you dropped Rhythm's drumsticks.",
    "Oh, that is smooth! Those are Rhythm's drumsticks. Here, let's set them free.",
    "You should talk to Rhythm about their drums. I'll need to interpret; they ain't a big talker.",
    "Hey, you've got Rhythm!",
    "No, I mean the Spirit of Rhythm, my drummer - you got them back!",
    "Rhythm isn't much of a talker, but they've asked if you'd mind helping them find their drum kit?",
    "So, Rhythm says Hermod was a bully and threw all of their drums into the lake.",
    "They say if you take a boat out, they can animate those drumsticks and help you to find them all.",
    "There are four drums to find.",
    "Take those animated drumstick and then go get a boat from Ed. When you're out on the lake, use the drumsticks and Rhythm will direct you to the nearest drum.",
    "Once you're on top of it, Rhythm will dive down and animate the drum out of the water and over here to the bandstand.",
    "I'll keep them safe. Once you've found all four, return here and we'll get them set back up.",
    "You'll need Rhythm's animated drumsticks to find the drums, but you don't have space to take them...",
    "Here, you'll need these drumsticks to track down the drums.",
    "Rhythm's drums all sank to the bottom of the lake. You gotta head out on a boat and track 'em down.",
    "You'll know when you're getting closer from the sound waves. They need all four found to set up a full drum kit.",
    "Hey, you've found one of Rhythm's drums. I'll hold on to it until you've got the full kit.",
    "Two down, two to go! We got half a drum kit here. When you've time, head back out on the lake!",
    "Just one more of Rhythm's drums left to find... Head back out on the lake when you're ready.",
    "That's it! You've recovered the Spirit of Rhythm's full drum kit. Let's get it all set up!",
    "Thank you for finding those drums. Rhythm gives their thanks too, of course!",
    "They're animating their drumsticks again, can't you see? Look at 'em go!",
    "Also, Rhythm thanks you for teaching Hermod a lesson. You'd think a drummer could have...beat it themselves.",
    "Sorry, that was bad even for me.",
    "You should free up some space in your backpack before we continue.",
    "Hey, that's it! We've got the band back together! Thank you, Player.",
    "Zommy and Rhythm dig your vibe too.",
    "Hey, thanks for all your help getting the band back together! We are really cooking now.",
    "Yeah, we're the Dead Beats! We'll be here all afterlife! Try the veil!",
    "Oh, hey, we're just playing freestyle. Want us to tighten things up a bit?",
    "We're sounding real tight! We're happy to go back to freestylin' if ya prefer?"
  ],
  "Player": [
    "Er, sure, I guess you could put it like that. Player's the name, pleased to meet you...",
    "I'm not sure that's how this works. I think you have to pretty much be dead to come here, save for a couple of exceptions.",
    "An undead jazz band? I mean, sure, why not?",
    "Cats can play instruments?",
    "So you want an axe? We talking hatchet or battleaxe here? Dual-wield or a two-hander?",
    "Oh, you need a guitar? I can do that.",
    "I can but try. So, er, where were you buried? I can just pop to the surface world and rob your grave now.",
    "Just, you know, respectfully?",
    "Oh, so I should just go to Lumbridge Catacombs and ask Dragith Nurn for your guitar back?",
    "I'll try to be gentle.",
    "Who? Who is Vera?",
    "What? Where?",
    "Apologies, I thought you were just a footrest? Hi, Big Al!",
    "A speed alteration glyph might work, but I'm not experienced enough to use one of those just yet.",
    "A speed alteration glyph might work! I'll draw one of them next time I perform a lesser communion ritual.",
    "What about your drummer?",
    "Inside? How does that work?",
    "How will I know what to look for?",
    "I'm going to assume you're in need of an instrument?",
    "Were you buried with your trumpet or...?",
    "Anything in particular?",
    "Cats again?",
    "One Everlight trumpet coming up!",
    "I have an Everlight trumpet for you.",
    "Oh, right, I need to restore it first.",
    "What's wrong with it?",
    "I can assure you it's an artefact, not a relic.",
    "No soul, you say. I think I might be able to do something about that...",
    "I'm going to take this Everlight trumpet over to the ritual site and performing[sic] an ensoul trumpet ritual on it!",
    "Sorry, not yet. I'll get you it soon.",
    "Do you need me to find another instrument? What does Zommy play?",
    "Er, you know, I can fit an absurd amount of stuff in my backpack, but I don't think a full piano is going to be possible...",
    "Huh, so that's how remembering things into existence here works?",
    "Give me a moment, just trying to remember what a blue party hat looks like...",
    "Behind the house boat, not the boathouse. That's confusing.",
    "Alright, to the spinning wheel it is!",
    "Okay, I'll go see if I can get some white and black piano keys from the Former Master Crafter.",
    "Hi, I was wondering if you might be able to help with some piano keys. I'm in need of a full set and, apparently, you might be able to craft some?",
    "What materials do you need?",
    "More specifically?",
    "Flesh and bone describes Zommy to a tee. How many of each?",
    "Oh, thank you, that's kind of you to say.",
    "Ah, right, those animated drumsticks.",
    "What do you need me to do?",
    "Four drums, got it. How is Rhythm able to help me, exactly?",
    "It's boating time! I hope this won't take too long...",
    "That's the final drum! I should head back to Lady Grey at the bandstand.",
    "What was I doing again?",
    "Boat. Lake. Four drums. Got it!",
    "Where did Rhythm go?",
    "Happy to help. Say, Big Al, I just wanted to ask what role you play in the band.",
    "Does your band have a name?"
  ],
  "Big Al": [
    "Down here. Under foot.",
    "I get that a lot. Hello.",
    "I also think highly of you.",
    "I am the band. My bones made our instruments. My tendons? Guitar strings! Rhythm's drum skins used to be my ME skins. Oh, and when Zommy says he's tickling the ivories, that's not a euphemism."
  ],
  "'No Gums' Murray": [
    "Hey, there, soul [brother/sister] - thanks for getting me back into the mix! Mind helping me get my groove on too?",
    "Right on. I need some brass. A trumpet, to be exact.",
    "Naw, I lost my favourite horn ages back. I'm in the market for a new one.",
    "Actually yeah, I've always been a fan o'history. I figure them cats back in the day knew how to jam.",
    "Oh, yeah, right. I mean those angelic-looking folks - those icyene. Heard on the grapevine they had some trumpets over at the Everlight place.",
    "Aww, don't goof with me, it's all broke.",
    "Huh. Now I see it up close, it's a bit of a clinker. I'm sorry, [brother/sister], but I can't play wit' this.",
    "It's just...dead. Like, a relic, you dig?",
    "Splitting hairs, daddy-o. I mean it's got no soul...er, [brother/sister].",
    "What's your thinking?",
    "Is my trumpet ensouled yet?",
    "That's it! This horn is humming with life!",
    "Hey, thanks for the new brass, you're a real soul [brother/sister].",
    "Yeah, you're a real soul [brother/sister]! You can rest up and listen to us wail anytime!"
  ],
  "Zommy 'Brains' Walker": [
    "Keeeeeeeys.",
    "Keeeeeeeys.",
    "Keeeeeeeys.",
    "Scaaaaaales!",
    "Scaaaaaales!"
  ],
  "Former Master Crafter": [
    "Wait, would this be for Zommy and the band? I would love to help out, I'm a big fan.",
    "If you are happy to go and collect some materials, I'd happily make some piano keys for you.",
    "I reckon some necromancy runes would do it - a true jazz pianist needs a touch of that old black magic, and Zommy is a real one.",
    "Hmm, I'd say some bone runes for the white keys, and some flesh runes for the black keys.",
    "Let's say ten runes per key, so that would be 520 bone runes and 360 flesh runes. Feel free to bring them in batches.",
    "Say, do you want me to craft some of those bone runes into white piano keys for you?",
    "You'll need to make some room in your backpack before I can do this.",
    "Say, do you want me to craft some of those flesh runes into black piano keys for you?",
    "You'll need to make some room in your backpack before I can do this.",
    "I'm looking forward to hearing 'Play it again, Zom!'",
    "You lost some of the white piano keys I made you. Do you want me to return the ones you lost?",
    "You'll need to make some room in your backpack before I can do this.",
    "You lost some of the black piano keys I made you. Do you want me to return the ones you lost?",
    "You'll need to make some room in your backpack before I can do this.",
    "I'm looking forward to hearing 'Play it again, Zom!'"
  ],
  "Congratulations! You have completed": [
    "'That Old Black Magic' - Complete this quest."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:That_Old_Black_Magic?oldid=36204661’"
  ]
}