{
  "Player": [
    "Hello there.",
    "What's wrong?",
    "Have they taken much?",
    "And you are...?",
    "How do you know that?",
    "That's awful!",
    "Um, right, yes. I'll get to work.",
    "You probably deserve it.",
    "You seem uptight. I'll leave you alone.",
    "How do you know that?",
    "That's awful!",
    "Oh! Well, I'll keep looking.",
    "Hello madam.",
    "Why? What's wrong?",
    "Yup, that's the plan.",
    "No!",
    "Hello. What is this building?",
    "That's a shame.",
    "Have you any more info on the Carnilleans?",
    "How long have you worked here?",
    "Ok then, take care.",
    "Hello.",
    "Do you know the Carnilleans?",
    "Look, I KNOW you're hiding something. I've heard there's a cult hideout down here.",
    "I have my orders.",
    "Sir Ceril Carnillean is a man of honour!",
    "What do you mean?",
    "The politics and histories of Ardougne do not concern me. I have been given a job and intend to see it through to the end.",
    "So what would I have to do?",
    "No. I won't do it.",
    "Okay, count me in.",
    "Not just now, thanks.",
    "Hello.",
    "Hello there.",
    "WHERE is the cult hideout?",
    "I've come for the Carnillean family armour. Hand it over, or face the consequences.",
    "So, the butler's part of your sordid little cult, huh? Thanks for telling me!",
    "I've killed the cult leader, and he dropped your armour!",
    "I'd rather not, if it's all the same to you. I overheard the cultists talking, and apparently Jones is in league with them.",
    "Ceril!",
    "Look what I've found in the cupboard!",
    "Then how about this?",
    "No problem. We all make mistakes.",
    "Thank you, Sir Ceril.",
    "Hello there.",
    "Hello there.",
    "Hello.",
    "That's what he thinks.",
    "No!",
    "Hello madam.",
    "I'm afraid not.",
    "Yup. Guess I am.",
    "I'm afraid not, Ceril.",
    "Yeah, well, just unlucky I guess.",
    "That's me.",
    "Nope. Afraid not.",
    "Oh dear, how sad.",
    "Hello. Are you okay?",
    "It WAS only a dog you know...",
    "Hello there.",
    "Hello there.",
    "Hello again.",
    "Scruffy?",
    "Your DOG was poisoned? That's not right.",
    "Uh...yeah, me too.",
    "Hello. I poured the poison into the Carnilleans' meal as requested.",
    "Ok. So what's next?",
    "How does this amulet help do that then?",
    "Hello.",
    "Hiya.",
    "That's right.",
    "Hi there.",
    "Hello Alomone.",
    "Yeah yeah yeah, I'm on it, I'm ON it.",
    "Hello there.",
    "Hello.",
    "Hello.",
    "Hello.",
    "Yeah. Poor Scruffy.",
    "Loosen up already! It was only a dog.",
    "Mark of Hazeel? I'm sure I don't know what you mean.",
    "So do you have any idea where the scroll with the enchantment is?",
    "And Sir Ceril doesn't suspect a thing?",
    "I'll keep on looking then...",
    "Hello Claus.",
    "Yeah. It's a real mystery, huh?",
    "Hello, Ceril. How's things?",
    "What makes you say that?",
    "Oh - heh - okay then.",
    "Hello Jones.",
    "I have it right here.",
    "Hello there.",
    "Get over it, it was only a dog.",
    "Hello guard.",
    "That's worrying.",
    "Hello again.",
    "Yes, it was in the house all along. Jones can't have looked that hard for it.",
    "Uh... yeah... about that... I seem to have, errm, misplaced it somewhere...",
    "Hello.",
    "Nope, sorry.",
    "Yep. Got it right here.",
    "Can I have a reward now too?",
    "Hello again.",
    "Hey, good for you.",
    "Hello Ceril.",
    "Don't worry about it, a good deed is its own reward. And that 2,000 gold didn't hurt, either.",
    "Hiya.",
    "Yep, fine thanks.",
    "Hello.",
    "Hello.",
    "Hello.",
    "My pleasure, Lady Henryeta.",
    "Hello again.",
    "Hey, good for you.",
    "Hello Jones.",
    "Not bad. Yourself?",
    "Hello Ceril.",
    "Hiya.",
    "Sure he doesn't.",
    "Hello.",
    "I've lost my Mark of Hazeel.",
    "Thank you.",
    "All hail Hazeel!",
    "Hello.",
    "Hello.",
    "I didn't want to talk to you anyway."
  ],
  "Ceril Carnillean": [
    "Blooming, thieving, weirdo cultists! Why don't they leave me alone? String 'em all up, that's what I say!",
    "There's some kind of crazy cult, dressed all in black, who hang out near the cave entrance in the forest south of here. The freaks keep breaking into my house!",
    "They first broke in months ago and stole a suit of armour. The strange thing is that they've broken in four times since but taken nothing.",
    "Why, I am Sir Ceril Carnillean! We really are quite a famous bloodline who've played a vital role in the politics of Ardougne for many generations. Perhaps you would be able to assist me in returning the stolen armour? For a modest cash reward, of course!",
    "No wonder I'm the one with the big house, and you're the one on the streets.",
    "Excellent! I suggest you start looking near the cave entrance, in the forest south of here. That's where they hang out.",
    "My old butler, Higson, once followed them to their hideout there. Unfortunately, the next night he died in his sleep.",
    "No, it's okay. A replacement arrived the next day. He's been great: cooks an excellent broth!",
    "And who are YOU to judge ME? Hmmm. You look like a peasant anyway. I'm wasting my time talking to you.",
    "Yes, I doubt you could help anyway.",
    "Ah, it's you again. Have you found my armour yet?",
    "They hang out near the cave entrance, in the forest south of here, dressed all in black.",
    "My old butler, Higson, once followed them to their hideout there. Unfortunately, the next night he died in his sleep.",
    "No, it's okay. A replacement arrived the next day. He's been great: cooks an excellent broth!",
    "Well, get a blooming move on!",
    "Well done! I must say that I am very impressed. Come on, hand it over.",
    "Before we send you on your way with your payment, I'll just get Jones to whip you up a batch of his special broth.",
    "W-what? JONES! Get over here! We're going to blooming-well sort this out, once and for all!",
    "Jones! This commoner says you had something to do with the theft of my armour. What do you have to say for yourself about that?",
    "Hmph. Quite right too. I cannot fathom why this scoundrel would accuse you of such a crime without evidence to back it up.",
    "Right, I have decided. I have given my word as a nobleman to reward you for your efforts in retrieving my armour,",
    "but I must also compensate Jones for this terrible slander you have made against him.",
    "Now, take it and leave, you scoundrel! Don't darken my doorstep again!",
    "What do you want now, you scoundrel!",
    "I...I don't believe it! Poison! JONES!",
    "JONES! Just WHAT is this POISON doing here?",
    "Rats, eh? Yes, fair enough. Sorry to have doubted you, old boy.",
    "Wh-what? I've seen this amulet before! The thieves that broke in...one of them was wearing an identical amulet! Jones! I don't believe it.",
    "Jones! We trusted you! We took you into our home!",
    "To think we took you in and trusted you... This is how you repay us.",
    "Guard.",
    "Take him away. Attempted murder and burglary.",
    "It looks like I am indebted to you, sirrah!",
    "But, if it weren't for you, my whole family, we could have been... I apologise for my harshness before.",
    "The very least I can do is to reward you for your noble efforts and to offer my sincerest apologies as a Lord and gentleman.",
    "No, no, thank YOU! Feel free to stop by anytime, adventurer!",
    "Have you had any luck yet?",
    "That's SIR Ceril, you blooming scoundrel! Show respect when addressing someone of my rank! It's strange you haven't recovered it yet, though, as Jones seemed quite sure of their location.",
    "Oh, the inhumanity. The cruelty, the misery, the pain. My son is a good boy really, but how could he give his dinner to Scruffy without having the servants test it for poison first? How? How could he be so thoughtless and careless? He knows we are all under threat!",
    "He's been with our family for twenty years. That's 140 in dog years! The poor dog. What did HE ever do to deserve such a fate?",
    "I agree! I hope whichever evil-doer is responsible gets the full weight of the law brought upon them!",
    "Oh, cruel world! Scruffy...I knew you well. I...just...don't think I can...go on without...",
    "SIR Ceril! SIR! And I'm not sure, but I think the thieves have been back in my house.",
    "Well, either I'm going crazy, or there's been an intruder in the bedrooms upstairs!",
    "Well, hello again adventurer! It's good to see you again! If it weren't for you, the treacherous Jones would have poisoned my family by now! We are in your debt.",
    "Oooooh, I may be wrong, but ever since I asked for your help, things around here have gone from bad to worse. I think you'd better keep out of my way. And, for the LAST time, it's SIR Ceril. SIR! It's not that hard to blooming remember!"
  ],
  "Henryeta Carnillean": [
    "Oh! Greetings. I'm afraid I'm not very presentable at the moment. I've been under incredible stress of late! It's ruining my complexion!",
    "It's those awful hooligan cultists from the forest! I just don't feel safe here anymore!",
    "I hope you found those awful hooligan cultists! I simply cannot sleep at night knowing they're loose!",
    "Humph. You really are useless aren't you?",
    "No, no I am very far from OK. Those hooligans slaughtered my precious Scruffy! I shall never recover! I am emotionally scarred for life!",
    "I'm sorry. I am far too depressed to talk to anybody right now. Oh... poor Scruffy...",
    "Hello again, adventurer! Since you dealt with those horrible hooligan cultists, things have vastly improved for us around here.",
    "I have been instructed by my husband to have no dealings with an utter scoundrel such as yourself. So kindly leave me alone and be on your way."
  ],
  "Philipe Carnillean": [
    "Daddy says you're going to get his armour back from the bad men who stole it.",
    "Can I watch you kill them?",
    "Daddy says you're going to get his armour back from the bad men who stole it.",
    "Can I watch you kill them?",
    "My dog, Scruffy, is dead. I didn't want my dinner, so I gave it to him, and he died."
  ],
  "Butler Jones": [
    "This is the home of Sir Ceril Carnillean of the noble Carnillean family. You're welcome to look around, but I'm afraid I'll have to keep an eye on you. Recently we've been having a real problem with thieves and strange cultists coming out of the forest for some reason.",
    "Yes, well, these things are bound to happen when you're as wealthy as the Carnilleans.",
    "There's a lot I could tell you about the Carnillean family history. However, I'm afraid if I did speak about such matters I would be at risk of losing my job.",
    "Long enough to know the Carnilleans are not as innocent or noble as they seem.",
    "You too.",
    "It wasn't me, m'lud. I am, as you know, a loyal servant.",
    "Don't worry, m'lud, this fool won't be bothering us any more.",
    "You called, m'lud?",
    "P-p-poison? Um... Oh, it's for killing rats.",
    "Yes, that's right. Killing rats. I am but a loyal butler, sir.",
    "You senile old fool. It was all too easy! I should have killed you and your pathetic family weeks ago.",
    "Don't think that this is the last you've heard of me, Ceril. You and your family will pay dearly for this. Glory to Hazeel! All praise Zamorak!",
    "Hello friend. I heard about your handiwork. Quite amusing really. I'm sure Hazeel will be pleased anyway; Keep up the good work!",
    "Hello again friend. I see you decided to keep the mark of Hazeel discreetly about you.",
    "You don't have to pretend with me, friend! Our cause is one and the same; the sooner Lord Hazeel is avenged the better for this city... and for us!",
    "No idea I'm afraid. I KNOW it's somewhere in this house, but for the life of me I can't find it anywhere. I've searched high and low for it!",
    "Ha! That silly old fool? He can't see the forest for the trees.",
    "Have you recovered the scroll?",
    "Incredible! Quick, get it back to our hideout! These are glorious times indeed adventurer, when the mighty Hazeel returns things are REALLY going to change around here!",
    "It's an honour to be in your presence again, adventurer. I hope things are well.",
    "I'm good, thanks."
  ],
  "Guard": [
    "Hello. I hear tell you're after that loony cult who broke in the other night. It always gladdens me when civilians assist the law like this.",
    "Now, now, come along quietly. There'll be no revenge where you're going; we've got a nice secure jail cell waiting.",
    "Hello. The sarge is furious with me! Apparently, those loony cultists have been back without me noticing! I got a right roasting earlier. I don't exactly know what they got up to in the house, but that's beside the point. Sir Ceril was extremely upset, and I don't blame him.",
    "Hello again adventurer. Still hanging around here eh? Let me know if you spot any of those loony cultists sniffing around.",
    "Hello adventurer. I hope you find the cult soon. We have a horrible suspicion that there's been another burglary.",
    "Yes, it is. What's worse is I have no idea how they keep doing it. It's like they do it under my very nose!"
  ],
  "The valve has a label on it": [
    "'Valve [number] of 5'"
  ],
  "Clivet": [
    "You mind your business, I'll mind mine.",
    "If you want to stay healthy you'll leave now.",
    "So... that two faced cold hearted snob has made you fall for his propaganda eh?",
    "Is he now? Is he REALLY? There is a lot more to the Carnilleans than meets the eye, you fool, and none of it is honourable. Do you want to know the truth?",
    "The Carnillean home does not belong to them. The builder of the house was Lord Hazeel, one of the Mahjarrat followers of Zamorak. Many years ago there was a civil war in this land, and the hateful Saradominists declared war upon all Zamorakians who lived here. One fateful night, under cover of darkness, they stormed his home in an angry mob torturing and butchering all loyal Zamorakians they encountered inside. The following morning, the Carnillean forefathers moved into the empty household and claimed it as their own. They have grown fat on the hard work of Lord Hazeel ever since. Unluckily for them Lord Hazeel, as a Mahjarrat, had access to powers and enchantments they knew nothing about, and made preparations for his return when first they began to storm his home. Soon the day will come when he will return to wreak his vengeance upon the thieves!",
    "Well then, friend, perhaps I can offer you a different job? Sooner or later, our master WILL return to this land, and those faithful to him will be well rewarded. Join our cult and assist us in his restoration, and you will be bestowed with treasures; try to prevent his return and suffer the wrath of Zamorak and the Mahjarrat.",
    "Then you are a fool. Go back to your small-minded mundane little life; you will never know the glories you could have tasted as one of us!",
    "You must prove your loyalty to our cause. Killing one of the Carnillean household should be sufficient proof. So, what say you, adventurer? Join our side against the Carnillean thieves?",
    "Excellent. It takes a rare character to see through the cursed Carnillean lies. I can tell you are a [man/woman] of exactly the right character to join the followers of Hazeel.",
    "Here, take this poison. Pour it into their food and, once the deed is done, return here and speak to me once more.",
    "Then leave, fool!",
    "So. You've returned. Now do you want to know the truth about the 'honourable' Carnilleans?",
    "Oh no... not you again.",
    "You're more of a fool than you look if you think you will ever find it. When Lord Hazeel is revived you will be the first to grovel for his mercy!",
    "You have a mission with us, adventurer. Go to the Carnillean household and poison their meal to prove your loyalty.",
    "Yes, we heard all about it from one of our sources. Hazeel has eyes everywhere! It didn't quite go to plan however, the food was fed to the family dog rather than one of the family members. Nonetheless you have now proved your loyalty and will be rewarded when Hazeel is revived!",
    "Here. Wear this amulet; it is called the Mark of Hazeel. Not only will it identify you as one of our brotherhood to other followers but it is also key to finding our hideout.",
    "Hazeel, in his wisdom, when he built this lair, did so by making it inaccessible unless the flow of the sewers is controlled exactly by the sewer valves above ground. Each sewer valve must be correctly set before the water level is such that you may enter. The secret of the correct settings is contained in these amulets which honour him. Starting from left to right, follow the design of the amulet to locate each sewer valve, and then turn each so as to follow the amulet design. When you solve the sequence you may enter our hideout where our leader, Alomone, awaits you.",
    "I gave you the Mark of Hazeel. Use it to find the lair of our brothers and report to Alomone. Hazeel, in his wisdom when he built this lair, did so by making it inaccessible unless the flow of the sewers is controlled precisely by the sewer valves above-ground. Each sewer valve must be set correctly so that the water level is safe for you to enter. The secret of the correct settings is contained in these amulets which honour him. Starting from left to right, follow the design of the amulet to locate each sewer valve, and then turn each so as to follow the amulet design. When you solve the sequence, you may enter our hideout where our leader, Alomone, awaits you.",
    "Hello once more adventurer. All we need is Hazeel's magical scroll to bring him forth once more to this world.",
    "Have you acquired the enchanted scroll required to revive Hazeel?",
    "At last! The pieces are all in place for the glorious revivification of Lord Hazeel! We can begin writing a new page in history - our first chance for vengeance! Quickly, now! Take the scroll to Alomone so that we may begin the ritual, and when Lord Hazeel returns, I promise you that you shall be well rewarded!",
    "Incompetent cretin! Return to the Carnillean household and do not return again without it!",
    "You may have won this battle, meddler, but the war rages on. Go bother some goblins or something, for when Hazeel returns your destruction is assured.",
    "It is good to see you once more. Did I not tell you how glorious Lord Hazeel is? With each day his power grows, and soon, very soon, we shall rule these lands! In the meantime I await his return here patiently until he calls upon me.",
    "Here, take this.",
    "Indeed, all hail Hazeel and Zamorak!"
  ],
  "Alomone": [
    "How did YOU get in here?",
    "I thought I made it clear to the butler you could not be allowed to interfere with our mission. The incompetent fool must be going soft.",
    "Well, you won't live long enough to tell anyone! Prepare to die!",
    "Get out of my way, idiot! Prepare to die!",
    "Can't you see I'm busy???",
    "Well, well, well. We have a new recruit. Clivet told me of your desire to join our glorious attempt to revive the mighty Hazeel from his slumber. To accomplish this, we require the ancient words that will restore his weakened body, so that he can bring vengeance upon his enemies. Hazeel, in his mighty cunning, anticipated that he might be defeated, and secured within his home a powerful magical scroll that could restore him. The words to this powerful enchantment are hidden within the Carnillean mansion, right under the nose of his unsuspecting foes. We already have an agent in place there in their butler, Jones, a faithful follower of Hazeel. His loyalty to Hazeel is beyond questioning, yet he has been unsuccessful in locating the scroll so far. Go back to the mansion and assist us in finding this enchantment so that, together, we can restore Hazeel to his true power and glory!",
    "Hazeel has waited long enough to return! It is IMPERATIVE you find that spell!",
    "Have you brought me the scroll of restoration to complete the ritual?",
    "Yes...YES! With the words contained within this scroll, our Lord shall return to this realm and bring destruction to our enemies! Watch, adventurer, and witness the glorious rebirth of Hazeel!",
    "Lord Hazeel...Lord Zamorak...I call upon the powers of evil...the forces of chaos...the strength of hatred...",
    "Sentente sillaberi junque dithmento! Ia! Ia! Dextrimon encanto! Termando...incurdo...solly enty rando...sentente! Ia! Ia! Indenti zaggarati g'thxa!",
    "Dintenta! Sententa! Retenta! Q'exjta! Ia! Sottottott! Ia! Dysmenta junque fammatio svelken! Sottey! Sentey! SOLOMENT!",
    "You have crossed my path too many times. Prepare to die!",
    "Now Lord Hazeel is returned unto us we await his strength to return so that we may smite our enemies!"
  ],
  "Hazeel Cultist": [
    "Leave me alone, can't you see I'm busy? We have a lot to do preparing for the imminent return of Lord Hazeel",
    "Hello. Oh, are you new?",
    "Well, it's always good to have a new recruit. Soon we shall retrieve Hazeel's scroll and the ritual to revive him can begin!",
    "Well, hello! Until we have retrieved the scroll of Hazeel, we cannot revive our master. You must find it and bring it to us.",
    "Welcome back, adventurer! Since you have brought us the scroll of Hazeel, we can now perform the revivification ceremony! Soon, our master will return!",
    "It's the meddler! The one who below Jones' cover! I don't know why you came to this place but it is here that you will die.",
    "The adventurer returns. We await the return of our Lord from his business in the north here, so that we may wreak vengeance on his enemies. I bow before you in honour for your efforts in bringing Lord Hazeel back to this realm to lead us into glory once more!"
  ],
  "Claus the Chef": [
    "You're that adventurer the family asked to help get those weird cultists who keep breaking in, right?",
    "Good luck with that!",
    "Hello there. Caught any of those weird thieves yet?",
    "Rather you than me!",
    "I... just CAN'T understand it! How? HOW could someone poison my delicious food without me even noticing??? I... I just don't understand! Oh man... I hope I don't lose my job over this... but HOW? How did they do it? And why would the villain want to kill poor Scruffy anyway? He was such a good dog...",
    "Those animals... how could they do that to poor Scruffy? What kind of lowlife would do that???",
    "Well hello there adventurer! Are we fit and well?",
    "Glad to hear it.",
    "I hear Sir Ceril doesn't want you around here anymore."
  ],
  "Alemone": [
    "You must find it and bring it to me! Without it we cannot revive Hazeel and our efforts to do so will fail!"
  ],
  "Hazeel": [
    "My loyal followers. I have pride in you all. Never did I expect to return to this land. I see I have much to attend to.",
    "Soon, this world will cower once more at the name of Hazeel, and my fury will blaze across mine enemies, while my loyal followers will gain their rewards.",
    "Adventurer. I know that your efforts were principal in my return to this plane of existence. I offer you my thanks.",
    "You may not be a direct follower of Zamorak, but your cunning and treachery mark you as a friend to the Mahjarrat.",
    "Weak as I am now, my strength shall return, and my followers will be greatly rewarded when my powers peak once more.",
    "Your insolence shall be overlooked this time, for I am in truth in your debt. I shall reward you with wealth such as you deserve.",
    "Although your true reward will come later, when Zamorak and I, together, lay waste to this miserable planet, you are spared as an ally to us.",
    "And now I must leave you, and join my fellow Mahjarrat in the north to regain my strength and powers.",
    "I shall return when I am ready to fight my enemies, and much blood shall flow across these lands!"
  ],
  "Congratulations! You have completed": [
    "'Hazeel Cult' - Complete this Novice quest."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Hazeel_Cult?oldid=36204981’"
  ]
}