{
  "Player": [
    "Hello again, how's things?",
    "What will you do here in Burgh de Rott?",
    "Why check in the Sanguinesti region?",
    "That sounds awful!",
    "Why ask Misthalin for some help?",
    "Is there something I can do to help out?",
    "Yes, please tell me more.",
    "How should I get into the Sanguinesti region?",
    "What is the Sanguinesti region?",
    "How can I search for the Sanguinesti order of the Myreque?",
    "Can you tell me about the Sanguinesti Myreque?",
    "Tell me again how I get into the Sanguinesti region.",
    "Okay, thanks.",
    "Ok, thanks.",
    "Hey, what should I do again?",
    "Hello?",
    "Okay, have a bite.",
    "Give me your best shot, you evil bloodsucker!",
    "Send me to the mines!",
    "Hey, don't be scared, I just want to talk to you.",
    "Hey, calm down, I'm not going to hurt you. I just want to ask a few questions.",
    "Hello, I wondered if I could have a chat.",
    "Sorry but I need to ask a couple of questions.",
    "What do you do here?",
    "Just curious, that's all.",
    "I'm lost... Can you help me?",
    "What's a blood tithing?",
    "Do you know about the Myreque?",
    "I need to make contact with them. Please don't worry - I'm on their side.",
    "Do you know about the Myreque?",
    "I really need to meet the Myreque. If you can't talk to me about them, maybe you know someone who will?",
    "Can you introduce me to Old Man Ral?",
    "Do you know how Old Man Ral can help me?",
    "Can you tell me about the Sanguinesti region?",
    "What do you know about the vampyres?",
    "What do you know about Drakan?",
    "Well, I was referring to the main Drakan, you know, the overlord of Morytania.",
    "What is there to do around here?",
    "Is there anything I can do to help?",
    "Okay, thanks.",
    "Okay, thanks.",
    "Hello, I wonder if I could ask some questions.",
    "Sorry, didn't mean to scare you. I just wanted to ask a question.",
    "Not too bad thanks, but I wanted to ask a question.",
    "Nothing, I just need to ask a couple of questions.",
    "Hey, don't be scared, I just want to talk to you.",
    "Hey, calm down, I'm not going to hurt you. I just want to ask a few questions.",
    "Hello, I wondered if I could have a chat.",
    "Sorry, but I need to ask a couple of questions.",
    "What do you do here?",
    "I'm lost, can you help me?",
    "Do you know about the Myreque?",
    "No, sorry, but please can you answer my questions?",
    "(whisper) Do you know about the Myreque?",
    "Okay, thanks.",
    "What is this place?",
    "I'm sorry, I can't take you with me, but I will help if I can.",
    "How are you doing?",
    "What's that awful smell?",
    "How long have you been here?",
    "Okay, thanks.",
    "What do you do here?",
    "What sort of stuff have you got?",
    "Yes, I'll take a look at your wares!",
    "No, I want to ask more questions.",
    "Hello there!",
    "I'm lost. Can you help me?",
    "Do you know anything about the Myreque?",
    "I just want to help, what should I do?",
    "You're answering every question with a question!",
    "Someone said you could help me.",
    "It's true. They said that you were very well informed. In fact they had a name for you!",
    "Old Man Ral, he's a very good pal.",
    "No, I'm sure they gave you a name, but it might have been something else.",
    "Old Man Ral, the nefarious rascal.",
    "No, I'm pretty sure they directed me to you. What was that name they used to describe you?",
    "Old Man Ral, the Meiyerditch snitch.",
    "No, no, sorry, I do apologise. I'm sure that was someone else. My mistake entirely!",
    "No they did, and they referred to you as...",
    "Old Man Ral, the sage of Sanguinesti.",
    "Yes, yes, saying you were the local font of knowledge.",
    "Oh, yes, yes. All the time. And only in the most respectful way.",
    "They said that you might be able to help me find some people... Some hidden people.",
    "Well, hopefully they hid themselves. I need to make contact with the Myreque.",
    "Okay, thanks very much.",
    "Sorry to bother you.",
    "Sorry to bother you.",
    "Hello again!",
    "What do you do here?",
    "I'm lost... Can you help me?",
    "Do you know about the Myreque?",
    "Can you help me?",
    "Well, you've helped me before! You said something about symbols? To find the Myreque.",
    "Which symbols?",
    "Oh, and where would that be then?",
    "Okay, thanks.",
    "What do you do here?",
    "Oh, I'm trying to help out around here.",
    "Hello. What do you do here?",
    "Hey, you're with the Myreque aren't you?",
    "I'm a friend of the Myreque; I've come to help!",
    "It's true. I was sent by Veliaf - he's the leader. We've just moved base from the Hollows to Burgh de Rott.",
    "Who are you and what do you do here?",
    "I can't believe that people live in these conditions; it's truly terrible.",
    "I was asked to make contact with the Myreque.",
    "What should I do now?",
    "Okay, thanks.",
    "Hey again, how are you?",
    "Well met, Veliaf.",
    "I have a message for you from Vertida!",
    "What should we do about the vampyres?",
    "What should we do about Paterdomus?",
    "What do you want me to do?",
    "Any tips to offer?",
    "Okay, thanks.",
    "What do you want me to do?",
    "Oh, I've just remembered, I have a message for you from Vertida.",
    "How should I do that?",
    "Oh, I've just remembered, I have a message for you from Vertida.",
    "Okay, thanks.",
    "Hey, Drezel, Veliaf sent me. Apparently there have been some 'strange goings on' which you need me to investigate. Actually, that's a bit odd isn't it? Because in Morytania, 'strange' is the order of the day. I'd have been more surprised if there had been reports of things getting back to normal!",
    "Okay then, what do you want me to do? Hurry up, I have to get on and speak to King Roald, or rather, Roald. We've been on first name terms for quite a while now. Funny that, eh? A lowly adventurer like me having mates like you and the king of a country. Still, at least I haven't lost my common touch.",
    "When and where were these sounds heard?",
    "Do you think the sounds could have come from beyond the steps? I mean, from further west?",
    "Did you hear the sounds as well?",
    "So, maybe Ivan was whispering to you?",
    "Right! That's different! What did they sound like?",
    "Hmmm, never fear, inspector Player is here! I'll work this out Drezel, don't you worry!",
    "Has anyone seen or reported anything unusual?",
    "And if it turns out to be more than that?",
    "How incredibly reassuring!",
    "How is Ivan - is he okay?",
    "It's all so incredibly tragic; I wish there was something I could do for him.",
    "Okay, thanks.",
    "Sorry, Drezel, what did you want me to do again?",
    "Yes, perhaps a bit too much!",
    "But for the grace of Saradomin am I here now! I was attacked from behind.",
    "Not clearly, but I believe they could have been werewolves, or at least a type of werewolf.",
    "I know, it's very worrying.",
    "Very well, I'll make my way and bid you good luck.",
    "Not yet, sorry; what should I do again?",
    "Ah yes, quite right, thanks for reminding me.",
    "Yes, I have some news!",
    "I was attacked near the temple!",
    "By beasts! From Morytania, I believe... perhaps werewolves.",
    "Not yet, I'm afraid. I thought you would want to know about the werewolves as soon as possible.",
    "What should I do now?",
    "Okay, thanks",
    "Hello, Roald, I must speak with you on a matter of grave importance.",
    "I am witness to a great many terrible things happening in Morytania, some of which could be happening in Misthalin before long!",
    "I have for some time now been helping a collection of brave freedom fighters - the Myreque - darkness of Morytania. The land is controlled by a dark, merciless overlord known as Drakan. He and his vampyric kin farm humans for their blood! People, my lord! Men and women like your own loyal subjects, who live such pitiful and desolate lives that death is a welcome end for them.",
    "Sire, I am not certain, but surely this isn't the issue? They are in dire need...",
    "But you don't understand! I also need to tell you that I have seen beasts from Morytania roaming around Misthalin. I am almost certain they were werewolves. I saw them west of the River Salve, beyond the grounds of the temple, Paterdomus.",
    "I'm sad to say that I did not. I had no chance, sire. I was knocked unconscious before I could properly react. Please sir, Misthalin must come to the aid of the people of Morytania. The Myreque cannot fight this battle against the vampyres by themselves!",
    "Yes there is! I saw it with my own eyes!",
    "Signing papers! Is that the sum total of the aid that Misthalin can provide to Morytania?",
    "Why can't you send troops to Morytania?",
    "Like Zanaris?",
    "So we should try to avoid that then!",
    "What is a 'mercenary protocol'?",
    "When can you send aid to Morytania?",
    "What part does Guthix play in all this?",
    "What should I do now?",
    "So I came all this way for nothing?",
    "Sorry, sire, I had just hoped for so much more.",
    "Yes, thanks, I'll accept the free teleport.",
    "No, thanks, I've other things to do here.",
    "Okay, thanks.",
    "Does your offer of a teleport still stand?",
    "I'd like to ask a few questions if I may?",
    "Drezel, I have returned from Varrock with bad news. King Roald isn't able to send troops for our fight against the Drakans. Apparently, some Guthixian edicts need to be scrutinised in more detail or else the balance will be affected?",
    "Can you explain a little about the Guthixian edicts?",
    "So the world belongs to Guthix then?",
    "That seems a bit unfair - doesn't he care for people? I thought Guthix was meant to be a good god?",
    "So how does this relate to edicts?",
    "What should I do now?",
    "Okay, thanks.",
    "Well met, Veliaf, I have some news for you.",
    "I was attacked near to Paterdomus! While I checked around near Paterdomus I was attacked by two beasts. I think they were werewolves! I believe they have found a way to cross the River Salve.",
    "King Roald cannot send troops! I have talked to him at great length and have been unable to persuade him to send troops. While talking with him, his Saradominist advisor kept interrupting. He cited Guthixian edicts as the reason for not sending aid.",
    "Roald is concerned that sending troops down to Morytania might propagate another war between the gods. If he sends troops, Drakan might call for Zamorakian followers from another realm. It could escalate, but the Church of Saradomin is looking into it now.",
    "Roald did agree to enact a mercenary protocol. He thought some brave souls from Misthalin might heed this call to arms and take up their swords in the name of the resistance. Roald said it was the best he could offer for the moment without contravening the Guthixian edicts.",
    "What should we do now? There must be someone else we can turn to?",
    "Okay, thanks.",
    "Not as well as I'd hope, Drezel. I'm still working with the Myreque, trying to help out. I just hope that we can find a way to defeat those Drakans.",
    "Myreque prevail, Drezel, and good luck to you!",
    "Well met!",
    "I have a message from Veliaf - bad news I'm afraid. I was sent on a mission to Misthalin to seek help from Roald. We hoped that Roald might send troops to aid us in our quest against the vampyres. On the way, though, I came across some werewolves, to the west of Paterdomus and the River Salve!",
    "Where is Safalaan and what does he look like?",
    "Okay, great, that's helpful. Now, how can I recognise Safalaan?",
    "What do you think this means for us?",
    "How very comforting.",
    "What should I do now?",
    "Okay, great, that's helpful. Any other details?",
    "Oh, wait, I wanted to ask more questions first.",
    "Okay, lead the way.",
    "Okay, thanks.",
    "Hello, Veliaf!",
    "I have met with the Sanguinesti Myreque.",
    "What should I do now?",
    "Okay, thanks.",
    "Hello, my name is Player. I come with a very important message from Vertida.",
    "He's asked me to come and seek you out. I am working with Veliaf in Burgh de Rott.",
    "I went to see King Roald to see if he would send troops to aid our situation. Unfortunately, his advisor reminded him that Guthixian edicts prevent his intervention at this time.",
    "I'm afraid that's not all. I was attacked by werewolves on the western side of the Salve, near to Paterdomus. I was knocked unconscious and left for dead.",
    "Can I help in some way?",
    "I can certainly try! Are there any specific details I should know?",
    "What did you want me to do again?",
    "What are you going to do?",
    "Okay, thanks.",
    "Okay, thanks.",
    "I was attacked near Paterdomus on my travels. I believe my assailants were werewolves on the western side of the Salve, near to Paterdomus. I was knocked unconscious and left for dead.",
    "Okay, thanks.",
    "I have to talk to you about something.",
    "Hello again!",
    "Huh? What happened?",
    "Hey, Vanstrom attacked me near the castle.",
    "He just flew at me out of nowhere. I was trying to fight him, but I just couldn't hurt him.",
    "No, I'm pretty sure I wasn't followed. So anyway, during the fight, Vanstrom knocked me to the floor and I thought I was done for when a woman named Sarius seemed to appear from nowhere.",
    "No, I saw Vanescula and Ranis earlier, but when I saw Sarius arrive, Vanescula wasn't around. Sarius told Vanstrom that Vanescula wanted to interrogate me. So Vanstrom got angry and flew away. Sarius then told me about a message which was meant for you. Something about 'smoke and statues'? She said that Vanescula was interested in you for some reason?",
    "I have all three sketches for you!",
    "What should I do now?",
    "How do you like those sketches I did for you?",
    "What should I do now?",
    "Is there any new information?",
    "Can you tell me something about this area?",
    "What should I do now?",
    "Okay, thanks.",
    "Hey, I've returned! Myreque prevail!",
    "Hiya, Vertida, what should I do now?",
    "Hey, I've returned! Myreque prevail!",
    "I have a message for you Safalaan - it may be important!",
    "It's a message that Sarius Guile made known to me. I believe she had meant it for you.",
    "Where do you think this laboratory could be?",
    "What should I do now?",
    "Well met, Safalaan. I have something you may be interested in. I found it in the laboratory.",
    "Well, whatever it is, someone went to a lot of trouble to try and hide it.",
    "I'll do what I can, Safalaan, you have my support.",
    "Very well, I'll do as you bid. Farewell.",
    "What should I do again?",
    "But I've lost that message, can I have another one please?",
    "Well met, Veliaf, I have some news for you.",
    "I have a message for you from Safalaan of the Sanguinesti order of the Myreque.",
    "I've spoken to Safalaan. He gave me a message to give to you and I've put it in my bank for safekeeping.",
    "What should I do now?",
    "Okay, thanks.",
    "Well met!",
    "I've lost my Tome of Experience.",
    "So, what's going to happen now?",
    "Oh I am, believe me!",
    "I'm very grateful for the honour!",
    "I guess not!"
  ],
  "Veliaf Hurtz": [
    "I'd say we've achieved a successful mission. This will be our new command base. I've scheduled some recon missions for the area. Secondary phase of operations will involve intelligence missions in the Sanguinesti region. We may need your help with that. We'll also need to extend a diplomatic mission into Misthalin in an effort to secure allies in our fight against Drakan.",
    "Oh, the usual. Keep a low profile and keep an eye on what the Vampyres are up to. We've come across a lot of information recently about what went on in Morytania before Drakan came here, mainly thanks to you. We'll need to spend some time looking through that and seeing if it's of any use to us.",
    "It's where most of us came from. Many of us still have friends or relatives there. And we presume that they're still being farmed for blood in the Ghetto's[sic] of the Sanguinesti region.",
    "That's why we fight the vampyres, even though the odds are stacked against us. If we do find any members of the Myreque, we'll see if we can help out and join forces.",
    "We can't hope to fight the power of the Vampyres alone. They're the most fearsome supernatural entity you could hope to come up against. We'll need help from Misthalin by the bucket load if we're to stand a chance against them.",
    "Well, we've been thinking of scouting a route into the Sanguinesti region for some time now. Are you interested to learn more details? Would you like to take this quest on?",
    "Well, we need you to find a way into the Sanguinesti region. It's important that we find out if there are any members of the Myreque still active there.",
    "There is a wall to the east that you would find impossible to get past. It's higher than any building in Burgh de Rott and it's patrolled by the vyrewatch. The wall extends all the way out to sea, but you may be able to find a way around it. Search around Burgh de Rott; you may find something to help you.",
    "It's the region to the east that is mainly controlled by the vampyres. People live there in ghettos - it's pretty terrible. If you look around Burgh de Rott, and if you're resourceful enough, you'll probably find something to help you gain entrance into that dark land. The wall is best avoided as there are too many juves in that area to work safely. If you find a way in, beware of the vyrewatch - they're powerful vampyres, a bane on the living! They're also invulnerable to every weapon we know of, including the Rod of Ivandis!",
    "The Myreque has sympathisers everywhere, especially in that drab and horrible place. You'll need to talk to some people and ask them about the Myreque. Hopefully, you'll get some information that will help you to track them down. But be aware, the Myreque are very good at hiding their locations... it's why they've survived so long. And beware, Player, the vyrewatch cannot be harmed, even by the Rod of Ivandis!",
    "Certainly. The Myreque, or at least the resistance that has now become the Myreque, originated there. Previously there was nothing. It was many years ago that some very brave people, led by Safalaan Hallow, managed to escape from the ghettos of the Sanguinesti region. They got information out about what was happening and helped to organise the resistance, which today is called the Myreque. The name was given to us by the locals, who named us after the place where we hid in Mort Myre.",
    "There is a wall to the east that you would find impossible to get past. It's higher than any building in Burgh de Rott and it's patrolled by the vyrewatch. The wall extends all the way out to sea, but you may be able to find a way around it. Search around Burgh de Rott; you may find something to help you.",
    "Well, we need you to find a way into the Sanguinesti region and see if you can make contact with any members of the Sanguinesti order of the Myreque.",
    "Well met indeed. What news, my friend?",
    "Great! Please let me see it.",
    "Hmm, bad news. It looks like the vampyres are bringing in fresh victims from somewhere. These beasts just don't know when to stop! I've also heard disturbing news from Paterdomus that needs to be investigated.",
    "We need to get assistance from somewhere... Maybe Misthalin will come to Morytania's aid? If we could persuade Roald to send us some troops, that would be a start.",
    "I'm not sure. There have been some odd reports from that area recently, people going missing and some odd noises being heard. It would certainly help to talk to Drezel and find out from him what he thinks is going on.",
    "Firstly, we need you to talk to Drezel and ask him about the activities near Paterdomus. Drezel will likely also want you to pass some information on to the King. Then, press onwards to Varrock and seek an audience with King Roald. Express the desperate nature of the situation here and beg him to send troops.",
    "Well, you could offer to guide one of the Burgh de Rott villagers up to Paterdomus. It might be nice to have company for the trip.",
    "Please return to the Meiyerditch Myreque and ask them for some sort of status report.",
    "Go back into the Sanguinesti region and talk to your contact.",
    "You've returned already?",
    "Attacked by whom?",
    "This must be Drakan's foul doing! Did you speak with Roald yet? We need his support if we are to end this suffering.",
    "It's good of you to return with this information, but we need to know Roald's answer before we can make any further plans.",
    "We need to know if Roald will aid us in our struggle. Please go and speak to him and ask him for his assistance in this matter. And let us all pray that he will give you a favourable answer.",
    "Hello, Player. It's good to see you again.",
    "This is most likely Drakan's doing, or at least one of his minions. The werewolves, like us, have to pay tithes. However, they're more than willing to take the lives of humans to pay their blood tithes.",
    "How does this prevent Roald from sending troops?",
    "I know you are only the messenger, but you do bear bitter news. There has long been a desire by the Saradominists to see Guthixian power eroded away. I am not so well versed with such dealings but it smells like politics to me.",
    "We must inform the head of the Sanguinesti order of the Myreque of these events. Please go as fast as you can back to the Sanguinesti hideout and forward this information to the leader there.",
    "Hello, Player, how goes it?",
    "Good, it seems like you're really proving your worth. Keep up the good work and if they need your assistance, I'd be grateful if you could accommodate them.",
    "Polmafi, Radigad and myself are still settling down into our new base camp. If the Sanguinesti order of the Myreque needs you, please feel free to aid them.",
    "Hello, Player, it's good to see you again.",
    "Really? Well, let's see it then!",
    "Well, it seems that you have more than proven yourself worthy, Player. Safalaan himself has recommended you for promotion to the rank of a private within the Myreque regulars. And for your trouble, I'm going to give you this rather prestigious tome of experience!",
    "Well, it's not much use there is it? Please bring it to me straight away!",
    "You need to go and speak to the leader of the Myreque in the Sanguinesti region.",
    "Well done, Player. You really have proven yourself! Welcome to the team!",
    "Hmm, okay, let's see if I have another one for you... Ah, here we go!",
    "There are plenty of options for us to move forwards. We'll still keep up regular intelligence-gathering operations within the local area. Then we'll try to look for weaknesses in the vampyres' defences. I'll probably have to meet up with Safalaan at some point, so we can discuss strategies then. This war is far from over, Player. There's plenty of time to contribute; don't worry about that."
  ],
  "Vyrewatch": [
    "Go about your business, meat sack, before I perforate you real good!",
    "Halt! Halt, I say!",
    "Stand where you are!",
    "Slurp! You look positively delicious! Let me help you lose a bit of weight. Either I get a bite or you do my bidding. Which is it to be, meat sack?",
    "Impressive. Not many of you have the spine for it these days!",
    "Very well...",
    "What? What? Where?"
  ],
  "Meiyerditch citizen": [
    "Argghghhh!",
    "Get off me! I haven't got anything!",
    "He-he-hello?",
    "Leave me alone!",
    "Well, I guess so.",
    "I just try to make a living the best way I can. You haven't got some food have you?",
    "I'm barely surviving...",
    "Like everyone else we just survive here. Just try to keep alive till the next blood tithe - that's when they feed us.",
    "When I'm not being drained of blood I'm fixing up the ghetto.",
    "When I'm not being drained of blood, the vyrewatch force me to repair the walls.",
    "Why do you wanna know?",
    "I dunno. I don't know if I can trust you...",
    "Well, you're in sector [one/two/three/four/five/six], but if you were hoping for any other help then I'm very sorry. I find it hard enough to help myself. Life's so very hard here. Before too long they'll be wanting to have another blood tithing and then I'll feel just awful again.",
    "You must be new here, else you'd know for sure. It's where we have to give a blood tithe to the vampyres. They do it on a weekly basis, a different sector each week so they don't kill us all off.",
    "It's probably best not to talk about that, friend.",
    "As are we all, but I really can't talk about them. It's not a subject easily broached here.",
    "Yes... but I really can't talk about them.",
    "I understand, but you may not like what you find. Go and talk to Old Man Ral - he might help you. He lives in the centre of sector one.",
    "Well, I don't need to do that. Just tell him that a friend has recommended you to him. It makes him feel important.",
    "He should be able to give you some background information on this place and perhaps put you in touch with people of the same way of thinking as yourself... Hope that helps. See you around.",
    "Yep, that's where we are at the moment. This place, Meiyerditch, is just one large ghetto. The city is sectioned off so that the vampyres can collect blood tithes on a rotational basis. That way they don't kill us all off in one go.",
    "They're monsters, I know that much. I've never known anything else, but I have a feeling it might be nice to not have to live in fear the whole time. Worrying if I'm going to make the next blood tithe quota. I know that the juveniles are the lowest form of the vampyres, most likely converted from some sort of bipedal creature, probably human. Juvinates are initiated juveniles who've had some training and are starting to get some special powers. After that you have the vyrewatch - they're nasty... really nasty.",
    "Drakan? Which one: Ranis or Vanescula?",
    "Hmm, nothing has been seen of him for many years now. Some people say they occasionally see Ranis or Vanescula flying about, but it's not too often.",
    "To do? Around here? Survive! Eke out an existence and just live for another day, that's it really. The juvinates organise work crews to mine the daeyalt, fix the walls, the castles and so on. If we refuse to do the work they put us on double tithes and you can't do that for long before you dry up.",
    "It's very nice of you to offer, my friend, but I shouldn't expect that you could do anything. The vampyres are just too powerful to overcome. Anyone who has challenged their power in the past, like that poor Queen Effaritay[sic], came undone.",
    "Hello?",
    "Hey, don't sneak up on me like that!",
    "Oh, hello. How's everything?",
    "What? What's wrong?",
    "Well, I guess so."
  ],
  "A Meiyerditch child": [
    "Argghghhh!",
    "Get off me, I haven't got anything!",
    "He-he-hello?",
    "Leave me alone!",
    "Well, I guess so.",
    "I 'elp wiv building fings an' da wall. But mainly I is hiding from da vyresies. I don't like dem vyresies.",
    "I was playin', but den da flapsies came so I was hidin'. Don't want da flapsies to bit me.",
    "I'm not supposed to talk to strangers, and you sure are strange...",
    "Nuffin', I wasn't doin' nuffin'! Yous ain't my dad, I'm tellin' on you!",
    "Urm, well I fink we're in sector [one/two/three/four/five/six]. Not sure what else to say. I'm only a kid ya know!",
    "Err, me dad says I'm not allowed to talk about that. Do you have any sweets?",
    "Err, no! I'm not allowed to say any thingies about dem; but they're the good 'uns what can help us."
  ],
  "[note": [
    "dialogue starts with options right away]"
  ],
  "Cat": [
    "It's a desolate, sad place... The peoples here seldom feed me - take me with you!",
    "Not well, I have to ssssssay, but you look healthy. I wish I were healthy like you.",
    "*Sniff, sniff* I don't think it's me. All I can smell is dirty vyrewatches tithing the poor humans.",
    "As long as I can remember. So far we've not found any way out of this place, and after all, we couldn't leave these poor humans to fend for themselves."
  ],
  "[Note": [
    "all dialogue options are the same as with the regular citizens, except for 'What do you do here?']"
  ],
  "Trader Sven": [
    "I'm a black-market trader... Fancy taking a look at my wares?",
    "Well then, young [lad/lass], that is a good question. In fact, I specifically deal in vyrewatch uniforms – they might leave you alone a bit more if they think you're one of them! Makes it easier to move around the sectors without them demanding a blood tithe every time you dare breathe. So then, do you wanna have a look at my stuff?",
    "Good on ya, [lad/lass]. Good on ya."
  ],
  "Old Man Ral": [
    "Hmph!",
    "Hmph! What do I know about anything? I know nothing of you!",
    "Hmph! A simple man only knows simple truths, and what I know is my own business. I share that which is precious only to those who consider it valuable. Nothing will I share with those who are unknown to me.",
    "Hmph! I am a simple man, what little do I know? Must a man be esteemed before he feels his efforts are truly appreciated?",
    "Hmph! Am I?",
    "Hmph! People say things they do not mean - many times this has been true.",
    "Hmph! Oh yes, what was it?",
    "Hmph! Nope, that can't be me they're talking about, must be someone else.",
    "Hmph! Okay then, what was it?",
    "Hmph! Nope, doesn't sound like me, you sure you've not got me confused with someone else?",
    "Hmph! Yes indeed, what was the name?",
    "Hmph! A snitch! Are you trying to insult me? Get out! Go on!",
    "Hmph! So, no one actually referred to me at all then?",
    "Hmph! Sage of Sanguinesti, eh?",
    "Hmph! So, that's what they call me now, is it?",
    "Hmmm. Sage of Sanguinesti. Has a nice ring to it. Yes, that sounds like they were referring to me. What else did they say about me?",
    "Hmmmph. That depends. Did they hide themselves or did someone else hide them?",
    "Hmph. Myreque, eh? Well, it'll take a lot to find them. It's not an easy route up to sector three, but that's where they are. You'll need to follow the symbols in order to get there. And, now, you should leave - I have little tolerance for people and talking to you has tired me out.",
    "Hmph!",
    "Hmph! Why? What do I know? I'm just an old man; what would anyone want with an old man?",
    "Hmph! Who says I'm not lost, eh? Ever think of that, did you? In a rush to find out all the answers, not thinking for a second that someone else might be just as lost, if not more lost, than you! And what do you care about them, huh?",
    "Hmph! Why should I know about the Myreque, eh? What use have they ever been to me, huh? I ask you!",
    "Hmph! What makes you think that I can help you, eh? Do I look like a fountain of knowledge, eh? Do I?",
    "Hmph! Yes of course, that's how to get to them. Follow the symbols.",
    "The symbol of the Myreque - the silver sickle!",
    "Around and about; it should be an aid."
  ],
  "[Vampyre juvinate/Vampyre juvenile]": [
    "What's your problem, food sack? Better move on before I perforate you real good!"
  ],
  "Mekritus A'hara": [
    "I'm helpin' ta protect the base camp. How about you, what are you doing here?",
    "Good, we can always use extra help - just make sure you don't go getting into any trouble or you'll have me to deal with!"
  ],
  "Flaygian Screwte": [
    "I'm a researcher. I'm looking for ways to defeat those awful Vyrewatch - it's looking tough, but we must keep trying."
  ],
  "Vertida Sefalatis": [
    "Who are you? What are you doing here?",
    "Oh, and I'm just supposed to believe you am I?",
    "Veliaf? Is he still alive? Amazing! Well, you make a convincing story, so I guess I'll have to believe you for now.",
    "My name is Vertida and I'm a member of the Myreque here in Meiyerditch.",
    "I know! It's the reason why I fight for the Myreque. I presume you have the same sentiments!",
    "Well, it seems like you've done that! I'll tell you what I'll do. I'll write you out a message to give to Veliaf as proof that the Sanguinesti order of the Myreque exists.",
    "This will explain our current situation and give some proof that the Sanguinesti order of the Myreque exists.",
    "Well, it seems like you've done that! Just take that message I gave you to Veliaf as proof that the Sanguinesti order of the Myreque exists.",
    "That's really up to you. You could investigate the ghetto a little more - familiarise yourself with the area. However, you'll probably want to get back to where you came from and deliver that message I gave you.",
    "That's really up to you. You could investigate the ghetto a little more - familiarise yourself with the area. Why are you here anyway?",
    "Good, thanks!",
    "Myreque prevails! What can I do for you?",
    "This is disastrous! Things seem to go from bad to worse! You will have to communicate this information to Safalaan directly, my friend. He needs to know as soon as possible.",
    "He's out on a mission sketching Castle Drakan. He's taken the wall route so you'll need to do the same. There is a barricade that prevents further travel north; it's located under the wall. You'll need to search the wall southeast of the barricade to release the lock on the door; it will be unlocked for two minutes. There is a catch on the door so you can always open it when you approach it from the north.",
    "He's very distinctive. It shouldn't be a problem trying to find him if you know where to look, and you've got a good set of eyes on you!",
    "I'm not sure. Safalaan is the best one to talk to regarding that. However, we can but hope for the best. That and a quick and painless death.",
    "Go and scout out the castle by following the great vyre-wall to the west. There is a barricade which prevents travel north, located under the wall. You'll need to search the wall southeast of the barricade to release the lock on the door, it will be unlocked for two minutes. There is a catch on the door so you can always open it when you approach it from the north. If you're careful, the vyrewatch won't see you.",
    "Safalaan is on a mission at the moment; he may wish to return to base when he hears your news, so it would be helpful if you could offer to take his mission over for him. I'm going to the wall now, so you can come with me - it'll be quicker than going back on your own.",
    "Okay, go ahead.",
    "Well met, Player. You should have a chat with Safalaan. He may be able to help you."
  ],
  "The following text is transcluded from Transcript": [
    "Message (Vertida)."
  ],
  "Drezel": [
    "Greetings again adventurer. How go your travels in Morytania? Is it as evil as I have heard?",
    "Good! I'm glad you're keeping your sense of humour; it will help you to maintain mental clarity while dealing with the tasks you've been given.",
    "Just check around the building, will you, and make sure there's nothing funny going on. Ivan mentioned that he had heard some strange noises recently. Not too near, just outside of the temple grounds. Come and let me know if you find something.",
    "Ivan said he heard them occasionally at odd times during the day, but usually when it's very quiet. We both looked around near the temple but we didn't find anything. We were both a bit nervous about going any further west than the steps.",
    "It's certainly possible and more than likely. I'd be grateful if you could extend your search as wide as possible.",
    "I must confess, I have heard some strange things around here recently. Like hushed voices.",
    "They didn't sound human!",
    "Well, very gruff, almost animal-like and speaking in guttural common tongue.",
    "Unfortunately, they have. Several people have gone missing from the local limestone mining area. Other locals have reported seeing shadowy figures moving along the Paterdomus path, which goes from Paterdomus to Varrock. Now, there's nothing to suggest that this is anything more than just an enterprising, though perhaps ruthless, bunch of brigands. If it is, simply give them a taste of Misthalin law and order.",
    "Well then, my friend, I will pray that Saradomin's blessings be upon you, that he guides your actions and keeps you safe from harm.",
    "Don't take that tone with me, young [man/woman]! Saradomin's powers are not to be underestimated.",
    "He's as well as can be expected considering the circumstances. He's a very confused young man at the moment what with the shadowy events that started his life. Both his parents died in the Sanguinesti region, though he still holds hope that they may be found alive. The death of Sani has really affected him as well. Like him, she was an orphan - they had a lot in common.",
    "Well, you brought him here, which was very brave. He's very grateful to you. It's remarkable, really. He has this inner calmness that I find so very affecting. His studies go well and he has Saradomin's blessings, it's clear to see. I would see him as a worthy successor as protector of Paterdomus. When all of his teachings are done, naturally.",
    "Just check around the building, will you, and make sure there's nothing funny going on. Ivan mentioned that he had heard some strange noises recently. Not too near, just outside of the temple grounds. Come and let me know if you find something.",
    "Hello, Player, did you find anything out nearby?",
    "How do you mean, Player?",
    "Did you see the assailants?",
    "This is terrible, terrible news! They have found a way to get across the Salve!",
    "I must make immediate preparations and meet with other members of my order. You must hurry directly to King Roald and impart this information to him. Here, take these runes; they should help you to return to Varrock faster.",
    "Likewise, Player.",
    "Hello, Player, have you been to Varrock yet?",
    "You said that you wanted to warn King Roald about possible incursions into Misthalin from Morytania. You also wanted to ask him about sending troops to help the Myreque in their efforts to overthrow Drakan and his minions.",
    "Oh dear! Yes of course, the Guthixian edicts which govern the balance of power within these realms must be taken into consideration. I learnt something about them during my training. I can certainly understand that if Saradomin's power were to substantially increase, the Drakans would waste no time in calling on their dark brethren from other realms.",
    "Well, only a little. Guthix is merely a nature god of some average power, nothing really compared to Saradomin. However, his followers, the druids of Taverley, and other creatures located around the world, believe him to lie in slumber. They also believe that Guthix made the world, and according to their history, Guthix was said to have evicted the remaining gods from the world during the god wars, and banished or destroyed any powerful entity aligned to a god, leaving only mortals here. Of course, the Church of Saradomin is highly sceptical of all this.",
    "Of course not! But that's what the Guthix followers believe. There are aspects of other gods which people in the world admire and wish to venerate. According to Guthixian followers, when all the gods were banished, a sort of religious balance was created which needs to be maintained. The followers of Guthix have said that if a second war of the gods were to begin, Guthix would be so angry that he would remake the world, destroying civilisation as we know it. Again, both Saradominist and Zamorakian beliefs differ on this point.",
    "He's a god of nature and hates to see imbalance. So even though there is evil in the world, Guthix sees it as necessary in order to keep the balance. The tolerance of evil by good keeps the powers of good, and of law, in check - and vice versa.",
    "Most leaders in the world rely on some of, indeed much of, the advice of their spiritual advisors. And the edicts forbid any action that might lead to an imbalance of power. All spiritual teachings follow the concept of balance in some form or other. Though some followers of Saradomin and Zamorak think that the concept of balance stipulated by Guthix's followers might be different to what Guthix will act on.",
    "The Myreque will need to know all that you have experienced so far. I'm sure they will be grateful. If you have the stomach for it, I'm sure Veliaf would gladly accept your further assistance. I for one am grateful for your efforts. Recently, I have noticed that more people are making their way to Paterdomus through Morytania and into Misthalin. Is that anything to do with you, I wonder.",
    "How's everything going, Player?",
    "You can be sure that a great many people hope for exactly the same thing, Player. Good luck to you, and Myreque prevail!"
  ],
  "Shadowy figure [1]": [
    "I told you to hide it properly!",
    "Nah, we can't take [him/her], it'll look suspicious.",
    "Of course!"
  ],
  "Shadowy figure [2]": [
    "Not to worry! Now we've got more!",
    "Let's go! Have you got the tithe?"
  ],
  "King Roald": [
    "Certainly. What seems to be the problem?",
    "This sounds pretty grave, please go on.",
    "This sounds shocking... awful. Yes, yes of course, we must do something!",
    "Oh yes, we need to consider that as well. You're right of course, Aeonisig. Do you know if these people follow Saradomin?",
    "I dare say you gave fight and slaughtered the foul beasts where they stood!",
    "Yes, yes! I will ready my army and prepare to enter Morytania via Paterdomus. Morytania has for too long threatened the borders of Misthalin.",
    "But Drakan has invaded Misthalin! I must respond!",
    "But I can't just stand here and do nothing, Aeonisig! I must try to help if I can.",
    "Well speak up man we haven't got all day.",
    "But that will take ages, we need to act now!",
    "Yes, yes, but we can start to make amends for that now, can't we?",
    "I am sorry, but Aeonisig is my advisor, and what he says, while it pains me, is the truth. However, I will enact a 'mercenary protocol'. This will allow all able-bodied men to fight in the defence of Misthalin for glory and spoils. You will find that many sword arms from Misthalin should soon join the resistance force. In the meantime, we will look into the Guthixian edicts and find a way to rid ourselves of Drakan for good.",
    "The followers of Guthix keep a careful account of the balance of religious and spiritual beliefs in the world. At the moment things are 'in balance'. If I send troops to Morytania, Drakan will call for Zamorakian followers to come to his aid, most likely through a portal to another realm.",
    "Similar, but instead of fairies you'll find creatures of such incarnate evil that it will make Morytania seem like a goblin cave. So if I send troops we will start a bloody war and both Saradominist and Zamorakian forces will collide. It will tempt another god war, and followers of Guthix are bound by oath to fight to keep the balance. When all three sides are joined in war, according to the edicts, Guthix will 'reawaken and remake the world without mercy for the pain of beast or man.'",
    "It means that people can fight with the blessings of the King in defence of the realm. Normally, if a force of armed men is amassed they may be considered a threat to Misthalin's national security, and we'd have to send the army to disband them. However, if a group of men form a mercenary company they can be registered, and are allowed certain rights so long as they operate within the law. They're essentially swords for hire, and we don't usually allow such things, but this situation in Morytania requires some action. Unfortunately, this is the best thing I can think of at the moment.",
    "It depends on how long it takes the Church of Saradomin to read through the Guthixian edicts and return with an answer on how to proceed.",
    "Guthixian edicts rule over those of all other religions. Followers of Guthix claim that the edicts have largely controlled the peace that Misthalin has experienced for so many years. My advisors are suggesting that this may not be strictly true. Followers of Guthix have sworn an oath to perform ceremonies to try and re-awaken Guthix if the edicts are broken. They say that peace and tolerance is needed to maintain the balance. But I am certain that they would be outraged to see the conditions that you yourself have witnessed in Morytania.",
    "That is for you to decide, but I would assume that you wish to report back to your comrades in Morytania. If they're relying on support from Misthalin, you may need to let them know that it might take some time before that happens.",
    "Well then, I must try to do something to satisfy you. I will have my advisor Aeonisig teleport you to Paterdomus in order that you are more quickly on your way. Will you accept my offer?",
    "Very good. My advisor, Aeonisig, will teleport you back. The best of luck to you.",
    "Very well. Come back if you change your mind.",
    "Certainly, are you ready now?",
    "Certainly, go ahead."
  ],
  "Aeonisig Raispher": [
    "I would beg my lord not to give in so easily to his very compassionate nature. We know not if these people are loyal Saradomin supporters, my liege.",
    "As are many, my young friend. Is the King meant to leave Misthalin unguarded on the whim of some errant adventurer?",
    "My lord, this course of action will lead to very severe consequences! Your interference in Morytania will likely upset the balance and could send the world into another cataclysmic god war.",
    "There is no proof that Drakan has invaded Misthalin, my lord!",
    "Being knocked out by agents unknown does not constitute evidence. In fact it's something that the most inexperienced of local folk could accomplish!",
    "I am afraid with the Guthixian edicts regarding religious balance, there is little else we can do. Of course, there are measures we can start to take which might have an influence on that...",
    "The Guthixian edicts govern spiritual balance, sire - perhaps these need closer study. In addition, we need to consider a reduction in the Guthixian influence we are forced to endure in our religious affairs.",
    "As you say, sire, it will take some time. We now pay the price for our lack of foresight in letting Guthixian edicts restrict the might of Saradomin's will.",
    "Yes sire, there are some papers to sign, but essentially we can start work on this right away.",
    "Hold your disrespectful tongue! How dare you address the King in that way? We should throw you in the stocks!",
    "Is it nothing then to have an audience with the King? Your lack of respect astonishes me. How you have survived so long with such disgraceful manners is nothing short of a miracle!",
    "Prepare yourself for teleport!"
  ],
  "Safalaan": [
    "Vertida, eh? What makes you think I know a Vertida?",
    "Ah, Veliaf! Myreque prevail! My friend, you're just the tonic for my otherwise black mood. Tell me, what news comes from the west?",
    "Guthixian edicts, eh? Hmm. Well I commend you on your efforts to rally support for our cause, but I have a strange feeling about Roald's reasons for not aiding us. I seem to remember that 'Guthixian edicts' have been given as a reason before when help was requested.",
    "This is terrible! They must have found a way to thwart the Salve's magical influence? But if so, why doesn't Drakan start a full onslaught? You have done well to bring me this information. I must return now to the base camp in order to discuss this information and work out what must be done.",
    "Yes, you certainly can, my friend. I was on a mission to scout out this castle. We need to get plans of the castle in order to mount an attack. I have yet to start, but please could you take over for me?",
    "Indeed there are. We need sketches of the northern, western, and southern sides of the castle. I've checked the situation out with regards to the vyrewatch flight patterns and you'll attract less attention if you quickly make your way to the north and do that sketch first, then sketch the western side, and finally finish off here at the southern aspect.",
    "Just in case you run into some troubles and need some more, you can get some more papyrus off old man Ral. He's helped us out once or twice before.",
    "Good luck, my friend. Return to the base camp when you have completed the plans.",
    "We need some accurate plans of the castle in order to effectively plan an attack. Please make some careful sketches starting from the north side, moving to the west and finishing off with a sketch from this view. One of our agents has already placed some markers on the walls at the best vantage point.",
    "With the news you've just given me, I'll need to go back to the base and discuss the implications with the rest of my team. Your help in this matter will be greatly appreciated.",
    "This is dreadful! They've discovered a way to get past the Salve's magical influence? I am surprised with this that Drakan doesn't start a full onslaught. You have done well to bring me this information. I must return now to the base camp in order to discuss this information and work out what must be done.",
    "Aha! Hello, Player! How goes it?",
    "Myreque prevail!",
    "WHAT?",
    "Brave, very brave. He didn't follow you here did he?",
    "Sarius you say. Hmmm, interesting. Was Vanescula nearby?",
    "Well, Player, my friend, you certainly seem to have had a very close call. Thanks for letting me know all of this - it's very helpful.",
    "You have my gratitude, friend! Myreque prevail! I need to take a good look at these and see if we can find something.",
    "Hmm, good question. Didn't you mention something about Sarius and a message?",
    "They're really very good, my friend, we're all very grateful for your help.",
    "Didn't you mention something about Sarius? She gave you some information regarding a message didn't she? It might be useful if you could get a hold of it.",
    "Not so far, my friend. We're discussing the news you gave me regarding the werewolves in Misthalin.",
    "Yes I could, but I'm a little busy right now. Perhaps later?",
    "Have you done those sketches yet? It would be really helpful to get those! Also, didn't you mention something about Sarius? She gave you some information regarding a message didn't she? It might be useful if you could get hold of it.",
    "Myreque prevail!",
    "Myreque prevail!",
    "A message where from?",
    "Hmm, interesting. This message gives details of some sort of laboratory; maybe there is some interesting information there which we should find out. Now that I have those sketches, we can keep an eye out for this place. In fact, it would be great if you could look for it for us. Keep the message - it may help you to locate it.",
    "It's a good question, but not one I can answer right now. If you get a chance could you look into this for us?",
    "We're looking into mounting an attack on the vampyres, but we also need to see if this so-called laboratory exists. You could look for it if you like, it might help us out. Come back if you find anything helpful.",
    "You've done well, Player, very well indeed. This tome looks like it contains research notes which might give us some clues as to the vampyres' weaknesses.",
    "I can believe that, Player, and once again you have our gratitude. For my part your arrival has not come soon enough. I have a feeling that your efforts in our struggle are not yet over. I for one would be grateful for your continued assistance. Together we can pull back the darkness of Hallowvale.",
    "Then I must beg you for a small task, to return to Veliaf with a message to advise him of what has transpired here. I realise that bearing messages seems somewhat lowly, but your ability to pass in and out of Sanguinesti without being detected makes you perfect for this assignment. I also have a small gift for you which should make your journeys through Meiyerditch a tad faster. It's a key that will allow you to open two doors, the first is in sector one and the other is in sector two. The key is shaped to help you find the doors it will open.",
    "Farewell and good luck, my friend!",
    "Take the message that I gave you to Veliaf. He should be able to explain everything to you when you get there.",
    "Well, okay, but please don't lose this one.",
    "It's nice to see you again, [Player], and congratulations on your well deserved promotion!",
    "We're glad to have you with us! Right, well, I'd better get on with some planning. Those foul Drakans aren't going to get on and destroy themselves,"
  ],
  "Vanstrom Klause": [
    "So yes, lady Vanescula, we're getting maximum yield from the current rotation. And more tithes are coming in all the time.",
    "If I remember, ma'am, I had little choice. You were quite... 'persuasive' the last time we met.",
    "Perhaps a light refreshment m'lady? This is from the fresh batch.",
    "The same is true for me, m'lady.",
    "Ha! So we meet again, Player. Prepare to die!",
    "I take no orders from food sacks like you, Guile. Attend to this yourself. In any case, he wasn't much of a punch bag anyway."
  ],
  "Vanescula Drakan": [
    "Good, good! You seem to be well in control.",
    "Ha, ha, ha. Vanstrom, you do make me laugh.",
    "Why, with these blood tithes you're really spoiling us!",
    "Mmm, delicious! Well, it's been lovely as usual, Vanstrom.",
    "But we really have to get on."
  ],
  "Ranis Drakan": [
    "Viciously efficient as ever, Vanstrom! You never fail to please your masters."
  ],
  "Sarius Guile": [
    "Sorry for the interruption, Lord Vanstrom, but Lady Vanescula 'requests' that this individual be questioned before being used as a punch bag.",
    "Awaken! There are things for you to know.",
    "Your life may be forfeit but for now you live. My mistress will understand my motives. She has an interest in the one you call 'Safalaan'. As a kind gesture for my intervening on your behalf, I take it as a kindness that you would deliver a message to him. The message you will find secreted behind tiles where smoke is carried away from the depiction of statuesque evil. And now be away, but forget not the task that Safalaan set you! For why else would you be here?"
  ],
  "Congratulations! You have completed": [
    "'The Darkness of Hallowvale' - Complete this Intermediate quest."
  ],
  "Polmafi Ferdygris": [
    "Hey there, it's brilliant that you've been made up into a full member of the Myreque! Proud to know you Player, I do hope we get to work together in the future! Keep up the good work, I'm sure Veliaf appreciates it."
  ],
  "Vertida Sefelatis": [
    "Congratulations on your promotion! You should be very proud!"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:The_Darkness_of_Hallowvale?oldid=35994846’"
  ]
}