{
  "Sir Lucan": [
    "Hello there adventurer.",
    "Talk to the King then adventurer. He is always looking for men of bravery to aid him in his actions.",
    "Hello there adventurer.",
    "I've tried all the weapons I can find, yet none are powerful enough to break his crystal prison... Perhaps the mighty Excalibur would be strong enough...",
    "The Lady of the Lake is looking after it I believe... but I know not where she resides currently.",
    "Hello there adventurer.",
    "So… you think Mordred’s behind this? I’m afraid I don’t have any suggestions…",
    "Hello there adventurer.",
    "I'm afraid I don't have any suggestions...",
    "Hello there adventurer. Congratulations on freeing Merlin!"
  ],
  "Player": [
    "I'm looking for a quest...",
    "Good day.",
    "Know you of any quests sir knight?[sic]",
    "Hello.",
    "Morning. Know where an adventurer has to go to find a quest around here?",
    "I'd like some advice on finding a quest.",
    "Um... Hello. I'm looking for adventure! More specifically, some sort of quest.",
    "Oh. Ok. I thought you just had a weird way of saying hello is all.",
    "Hello. I'm looking for a quest. Who should I talk to?",
    "I'm really just looking for a quest...",
    "You're a little full of yourself aren't you?",
    "I seek a quest!",
    "I want to become a knight of the round table!",
    "I will see what I can do then.",
    "So what are you doing on Gielinor?",
    "Thank you very much.",
    "Any suggestions on freeing Merlin?",
    "Excalibur eh? Where would I find that?",
    "Thanks. I'll try and find someone who does.",
    "Any ideas on getting Merlin out of that crystal?",
    "Yeah, that’s not actually too helpful.",
    "I’d like some advice on breaking that Crystal[sic] Merlin’s trapped in.",
    "Um... Hello. Do you know much about breaking magical crystals?",
    "Ok. Goodbye.",
    "Any suggestions on getting Merlin out of that crystal?",
    "Ok, well, thanks anyway.",
    "Merlin’s in a crystal. Little help?",
    "Hmmm. Well, ok, thanks anyway.",
    "I want to get Merlin out of the crystal.",
    "Good day.",
    "Any ideas on how to get Merlin out of that crystal?",
    "Do you know how Merlin got trapped?",
    "And where could I find her?",
    "Any idea how to get into Morgan Le Faye's stronghold?",
    "Thank you for the information.",
    "Hello again.",
    "I need to get into Mordred’s Fortress.",
    "Thanks. I’ll try and find someone who does.",
    "Any ideas on getting into Mordred's fort?",
    "Good a guess as any right?",
    "...I'll figure something out.",
    "I'd like some advice on breaking into Mordred's fort.",
    "Um... Hello. I need to get into Mordred's Fort...",
    "Any suggestions on getting into Mordred's fort?",
    "Ok, well, thanks anyway.",
    "I don't suppose you have any idea how to break into Mordred's fort do you?",
    "Ok. Thanks. See you later!",
    "Any ideas on how to get into Morgan Le Faye's stronghold?",
    "Um...",
    "Pizza delivery!",
    "Have you ever considered letting the glory of Saradomin into your life? I have some pamphlets you may be interested in reading and discussing with me.",
    "Can I interest you in some double glazing? An old castle like this must get very draughty in the winter...",
    "Would you like to buy some lucky heather?",
    "Is that your ship?",
    "Do you deliver to the fort just down the coast?",
    "Can you drop me off on the way down please?",
    "Aren't you worried about supplying evil knights?",
    "Where do you deliver to?",
    "I don't suppose I could get a lift anywhere?",
    "Well, good luck with your business.",
    "Are you rich then?",
    "Tell me how to untrap Merlin and I might.",
    "So where can I find Excalibur?",
    "Ok, I will go do all that.",
    "What are the magic words?",
    "No. He deserves to die.",
    "OK[sic] then.",
    "I need to find Excalibur.",
    "Thanks. I'll try and find someone who does.",
    "Any ideas on finding Excalibur?",
    "Any ideas on finding Excalibur?",
    "I'd like some advice on finding Excalibur.",
    "Um... Hello. I need to find Excalibur...",
    "Any suggestions on finding Excalibur?",
    "Ok, well, thanks anyway.",
    "Know anything about Excalibur?",
    "Know where I can find it?",
    "Have you got any black candles?",
    "I will pay good money for one...",
    "Yes please.",
    "No thank you.",
    "Nope, not yet.",
    "Yes, I have some now.",
    "Who are you?",
    "I seek the sword Excalibur.",
    "And how am I meant to prove that?",
    "Okay, that seems easy enough.",
    "Good day.",
    "Hello, I am here for Excalibur. Can I have it yet?",
    "Yes, certainly.",
    "... except I don't have any bread on me at the moment...",
    "No, I don't have any bread with me.",
    "Yes, here you go.",
    "Actually, I'm wrong. I still don't have any bread. Sorry.",
    "Sorry, no, I still have none.",
    "Now what were those magic words again?",
    "Snarthtrick... Candato... Termon!",
    "Snarthanto... Candon... Termtrick!",
    "Snarthon... Candtrick... Termanto!",
    "I wish to free Merlin from his giant crystal!",
    "I have freed Merlin from his crystal!",
    "Good day.",
    "Know you of any quests sir knight?[sic]",
    "Hey, no problem.",
    "Nothing right now, but I’ll bear it in mind. Thanks.",
    "Um... Hello.",
    "No problem. It was easy.",
    "O… k…"
  ],
  "Sir Gawain": [
    "Good day to you [sir/madam]!",
    "The king is the man to talk to if you want a quest.",
    "Good day to you [sir/madam]!",
    "I'm a little stumped myself. We've tried opening it with anything and everything!",
    "I would guess this is the work of the evil Morgan Le Faye!",
    "She lives in her stronghold to the south of here, guarded by some renegade knights led by Sir Mordred.",
    "No, you've got me stumped there...",
    "It is the least I can do.",
    "Good day to you [sir/madam]!",
    "Good day to you [sir/madam]!",
    "Unfortunately not, adventurer.",
    "Good day to you [sir/madam]!",
    "I think you’ve done the main quest we were on right now…"
  ],
  "Sir Kay": [
    "Good morrow [sirrah/madam]!",
    "An adventurer eh? There is no service finer than serving the bountiful King Arthur, and I happen to know there's an important quest to fulfill.",
    "Good morrow [sirrah/madam]!",
    "Unfortunately not, Sirrah. ‘Tis a magick most powerful and foul. The only person I know of who would possibly have been of help is Merlin…",
    "I am well aware of that, adventurer.",
    "Good morrow [sirrah/madam]!",
    "Mordred... So you think he may be involved with the curse upon Merlin?",
    "I think that you may be onto something there. Unfortunately his fortress is impregnable!",
    "Good morrow [sirrah/madam]!",
    "Unfortunately not, Sirrah.[sic]",
    "Good morrow [sirrah/madam]!",
    "Sir Knight[sic]! Many thanks for your assistance in restoring Merlin to his former freedom!"
  ],
  "Sir Palomedes": [
    "Hello there adventurer, what do you want of me?",
    "Hello there adventurer, what do you want of me?",
    "Sorry, I cannot help you with that.",
    "Hello there adventurer, what do you want of me?",
    "Sorry, I cannot help you with that.",
    "Hello there adventurer, what do you want of me?",
    "Sorry, I cannot help you with that.",
    "Hello there adventurer, what do you want of me? After your help freeing Merlin, my help is the least I can offer as a man of honour."
  ],
  "Sir Palamedes": [
    "I do not know of any myself... but it would perhaps be worth your while asking the King if he has any tasks for you."
  ],
  "Sir Tristram": [
    "Hail Arthur, King of the Britons!",
    "... Then hail Arthur, King of the Britons, like I just said.",
    "Hail Arthur, King of the Britons!",
    "Funnily enough… absolutely nothing.",
    "Hail Arthur, King of the Britons!",
    "Good luck with that!",
    "Hail Arthur, King of the Britons!",
    "Good luck with that!",
    "Hail Arthur, King of the Britons!",
    "Thanks for freeing Merlin."
  ],
  "Sir Pelleas": [
    "Greetings to the court of King Arthur!",
    "King Arthur will let you know. I believe he has a quest at the moment.",
    "Greetings to the court of King Arthur!",
    "My best guess would be using a magic spell. Unfortunately Merlin is our magic expert.",
    "Greetings to the court of King Arthur!",
    "My best guess would be using magic. Unfortunately Merlin is our magic expert.",
    "Greetings to the court of King Arthur!",
    "My best guess would be some sort of spell. Unfortunately Merlin is our magic expert.",
    "Greetings to the court of King Arthur!",
    "You are a very talented Knight indeed to have freed Merlin so quickly. You have all of our gratitude."
  ],
  "Sir Bedivere": [
    "May I help you?",
    "Fortune favours us both then adventurer. I suggest you go and speak to King Arthur.",
    "May I help you?",
    "That is what we were hoping for from you, adventurer!",
    "May I help you?",
    "I am afraid not. Would that we could! Mordred and his cronies have been thorns in our side for far too long already!",
    "Take care adventurer, Mordred is an evil and powerful foe.",
    "May I help you?",
    "Um... it's a really good sword?",
    "Nope, sorry.",
    "May I help you?",
    "All Knights of the Round Table thank you for your assistance in this trying time for us."
  ],
  "Sir Lancelot": [
    "Greetings! I am Sir Lancelot, the greatest Knight in the land! What do you want?",
    "I have every right to be proud of myself. My prowess in battle is world renowned!",
    "Leave questing to the professionals. Such as myself.",
    "Greetings! I am Sir Lancelot, the greatest Knight in the land! What do you want?",
    "Well, if the Knights of the Round Table can't manage it, I can't see how a commoner like you could succeed where we have failed.",
    "Greetings! I am Sir Lancelot, the greatest Knight in the land! What do you want?",
    "That stronghold is built in a strong defensive position. It's on a big rock out into the sea. There are two ways in that I know of, the large heavy front doors, and the sea entrance, only penetrable by boat. They take all their deliveries by boat.",
    "Greetings! I am Sir Lancelot, the greatest Knight in the land! What do you want?",
    "Hmmm. I heard you freed Merlin. Either you’re better than you look or you got lucky. I think the latter."
  ],
  "King Arthur": [
    "Welcome to my court. I am King Arthur.",
    "Well, in that case I think you need to go on a quest to prove yourself worthy. My knights all appreciate a good quest. Unfortunately, our current quest is to rescue Merlin. Back in England, he got himself trapped in some sort of magical Crystal.[sic] We've moved him from the cave we found him in and now he's upstairs in his tower.",
    "Talk to my knights if you need any help.",
    "Well legend says we will return to Britain in its time of greatest need. But that's not for quite a while yet. So we've moved the whole outfit here for now. We're passing the time on Gielinor!",
    "Ah. A good job, well done. I dub thee a Knight Of The Round Table.[sic] You are now an honorary knight."
  ],
  "Renegade Knight": [
    "Yes? What do you want?",
    "We didn't order any Pizza.[sic] Get lost!",
    "No. Go away.",
    "No. Get out of here before I run you through.",
    "No. Go away."
  ],
  "Arhein": [
    "Hello! Would you like to trade? I've a variety of wares for sale, as well as a special supply of pineapples and seaweed!",
    "Yes, I use it to make deliveries to my customers up and down the coast. These crates here are all ready for my next trip.",
    "Yes, I do have orders to deliver there from time to time. I think I may have some bits and pieces for them when I leave here next actually.",
    "I don't think Sir Mordred would like that. He wants as few outsiders visiting as possible. I wouldn't want to lose his business.",
    "Hey, you gotta take business where you can find it these days! Besides, if I didn't supply them, someone else would.",
    "Oh, various places up and down the coast. Mostly Karamja and Port Sarim.",
    "Sorry pal, but I'm afraid I'm not quite ready to sail yet. I'm waiting on a big delivery of candles which I need to deliver further along the coast.",
    "Thanks buddy!",
    "Business is going reasonably well... I wouldn't say I was the richest of merchants ever, but I'm doing fairly well all things considered."
  ],
  "Sir Mordred": [
    "You DARE to invade MY stronghold?!?! Have at thee knave!!"
  ],
  "Morgan Le Faye": [
    "STOP! Please... spare my son.",
    "You have guessed correctly that I'm responsible for that. I suppose I can live with that fool Merlin being loose for the sake of my son. Setting him free won't be easy though. You will need to find a magic symbol as close to the crystal as you can find. You will then need to drop some bat's bones on the magic symbol while holding a lit black candle. This will summon a mighty spirit named Thrantax. You will need to bind him with magic words. Then you will need the sword Excalibur with which the spell was bound in order to shatter the crystal.",
    "The lady of the lake has it. I don't know if she'll give it to you though, she can be rather temperamental.",
    "You will find the magic words at the base of one of the chaos altars. Which chaos altar I cannot remember."
  ],
  "Candle-maker": [
    "Hi! Would you be interested in some of my fine candles?",
    "BLACK candles??? Hmmm. In the candle making trade, we have a tradition that it's very bad luck to make black candles. VERY bad luck.",
    "I still dunno... Tell you what: I'll supply you with a black candle... IF you can bring me a bucket FULL of wax.",
    "Have you got any wax yet?",
    "Have you got any wax yet?",
    "Ah, you again. You're quite a trend setter. Can't believe the number of black candle requests I've had since you came. I couldn't pass up a business opportunity like that, bad luck or no. So I'm selling them now. Would you be interested in some of my fine candles?"
  ],
  "The Lady of the Lake": [
    "Good day to you, [sir/madam].",
    "I am the Lady of the Lake.",
    "Aye, I have that artefact in my possession. 'Tis very valuable, and not an artefact to be given away lightly. I would want to give it away only to the one who is worthy and good.",
    "I shall set a test for you. First I need you to travel to Port Sarim. Then go to the upstairs room of the jeweller's shop there.",
    "I don't think you are worthy enough. Come back when you are a better person.",
    "Well done. You have passed my test. Here is Excalibur, guard it well.",
    "Well done. You have passed my test. Here is Excalibur, guard it well."
  ],
  "Beggar": [
    "Please kind [sir/lady]... my family and I are starving... Could you find it in your heart to spare me a simple loaf of bread?",
    "Thank you very much!",
    "Well, if you get some, you know where to come.",
    "Well, if you get some, you know where to come.",
    "Have you got any bread for me yet?",
    "Thank you very much!"
  ],
  "You find a small inscription at the bottom of the altar. It reads": [
    "'Snarthon Candtrick Termanto'."
  ],
  "Thrantax the Mighty": [
    "GRAAAAAARGH!",
    "GRAAAAAARGH! Thou hast me in thine control. So that I mayst return from whence I came, I must grant thee a boon. What dost thou wish of me?",
    "GRAAAAAARGH! The deed is done. Thou mayst now shatter Merlins'[sic] crystal with Excalibur, and I can once more rest. Begone! And leave me once more in peace."
  ],
  "Merlin": [
    "Thank you! Thank you! Thank you! It's not fun being trapped in a giant crystal! Go speak to King Arthur, I'm sure he'll reward you!",
    "Hello. Now that you’ve freed me from that ghastly crystal, I’m working on a new spell. It’ll turn people into hedgehogs!"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Merlin%27s_Crystal?oldid=36025823’"
  ]
}