{
    "Aftermath": {
        "Adrasteia": [
            "Good, you're here!",
            "Please, hurry back.",
            "No time for long explanations. Zamorak is in the Wilderness crater where the Edicts Monument is, but we can't get to him. He has some sort of magical barrier even my father can't defeat. Azzanadra's agents found a way in, but you're probably not going to like it.",
            "Oh?",
            "Right inside Senntisten, where we battled the Elder Gods, we've discovered a new part of the city. It's some sort of Zamorakian district, and the demons you encountered down there have moved back in.",
            "How does that help us?",
            "Because they have an open portal to Infernus inside, which you can use-",
            "Which I can use to get to Zamorak.",
            "Exactly. Sir Cadian led a contingent of knights ahead of you to clear the way. Meet up with him inside Senntisten. And good luck!",
            "Sir Cadian led a contingent of knights ahead of you to clear the way. Meet up with him inside Senntisten, and deal with Zamorak. And good luck!",
            "You're back!",
            "Did you... Did it...",
            "Zamorak is gone. The Edicts have been established.",
            "That's... Good news. And are you...still the World Guardian?",
            "No, my powers are gone.",
            "I'm sorry.",
            "I don't really feel any different. It's quieter, though.",
            "I must go to the throne room and say farewell. I am sure my father will want to say goodbye to you as well. I shall see you up there.",
            "Please, leave me to mourn."
        ],
        "Player": [
            "Oh?",
            "How does that help us?",
            "Which I can use to get to Zamorak.",
            "Where did you want to be?",
            "The honour is mine.",
            "This world is safer without you."
        ],
        "Sir Cadian": [
            "World Guardian, you're back! Thank Saradomin you're here. I never got a chance to thank you earlier.",
            "No problem."
        ],
        "Saradomin": [
            "The World Guardian has succeeded. The Edicts are re-established and Zamorak is gone.",
            "Most of the demons have withdrawn to Forinthry. The stragglers are not causing us any trouble.",
            "Once again the people of Gielinor have you to thank, Player. But though this is a day for celebration, it is not without cost. The price for Zamorak's defeat is my own removal from this world. Already I feel it clawing at me. I can resist, but not for long.",
            "Kyrios! No! Was this your doing, World Guardian?",
            "Restrain yourself, Zilyana. We concocted this plan with open eyes. It was my sacrifice, and my honour, to surrender ambition for the sake of my people.",
            "But without your leadership-",
            "Indeed. Things will be challenging in my absence. It is vital therefore that we exercise a smooth transition of authority, beginning immediately.",
            "Of cour-",
            "I have therefore selected Adrasteia to serve as Basilissa of the Kingdoms.",
            "But she is a little more than a child!",
            "Hold your tongue, Strategos! You are speaking to my appointed successor. You will do so with respect.",
            "... Of course, Kyrios. Your will be done.",
            "But why, Father?",
            "It is a calculated choice, daughter. You have been trained in statecraft by the finest tutors in New Domina.",
            "One of the kings, surely, should come before me?",
            "The kingdoms are nominally allies, but there are tensions, and this famine will only worsen them. Appointing any Asgarnian would alienate Misthalin and Kandarin. And alas, I cannot see the people of Gielinor pledging loyalty to any Icyene in my stead. You are a veteran of another age, Zilyana, and your strength lies on the battlefield, not the court.",
            "You are wise, Kyrios.",
            "Adrasteia, you are young, but you have surpassed me in wisdom, in courage, and perhaps most importantly of all, in empathy. You are human in a way I have not been for many millennia, and that will serve to your advantage in the difficult years ahead. And do not shy from your status as my daughter. Adopted you may be, but humans place great stock in bonds of family. Many will accept without question on this basis alone.",
            "Yes, Father.",
            "Wahisietel...",
            "Yes?",
            "We have grown apart, you and I, and that does not seem likely to change now.",
            "No.",
            "In light of your long service, I will not ask you to obey Trindine, but you know the humans better than any of us. Walk amongst them. They languish in this...dark age. Push them to do better, if you can. The guise of Dr Nabanik has been yours for some time. You may continue to use it if you wish.",
            "Perhaps.",
            "And try to keep Akthanakos out of trouble.",
            "Player.",
            "Are you going to give me orders too?",
            "You are not subject to my authority. We saved the universe together, you and I. Not bad for a human. I just wanted to say thank you. The rest of you, have faith in this one precept: Zaros will return. The way must be prepared for him. Come, Nex.",
            "What about Char?",
            "I have no doubt that she is protected under the auspices of our Lord, but if the opportunity arises to search for her, we shall. Valete.",
            "Vale.",
            "Later, Dad.",
            "I don't know about you, but I need a lie down.",
            "How did it go?",
            "The gods left Gielinor.",
            "I felt it. Before, there was an energy, a sensation, but now... Nothing. The world seems smaller. It's just us now.",
            "It was the only choice we had.",
            "This world is better off without their influence."
        ],
        "Armadyl": [
            "This is not where I wanted to spend my last moments on Gielinor. But I have duties and I must perform them up until the last moment. I will be leaving soon and there is just too much still to do.",
            "Where did you want to be?",
            "I will go to Tarddiad, as I promised Seren and her people. I may disagree with what Seren has done, but I understand it and the people of Tarddiad should not suffer because of her actions. I do not have Seren's aura of devotion, so I will not further the pain of the crystal shapeshifters. I can use my gifts to help soothe their suffering and, perhaps, in time we can work towards a cure for their plight. In truth it is not selfless, for that world is vibrant and calm. There are trees there as tall as mountains and there is plenty of space for my people and the elves. My people can leave the constant danger of our home world and live a new, peaceful life there. We can rebuild that world together. Aviansie and elf, side by side making each other better. In time, they will learn that they do not need me. And on that day I will rejoice, because what is better than seeing your children able to stand without you holding them? ... But that day is a long way off and the road to it will be difficult. But I think - no, I know - it will be worth it. So, thank you, Player, for these new Edicts. You have freed me from the invisible shackles of this world and now I, like you, can forge my own destiny. I hope I will see you again. You have been a good friend.",
            "You'll think me strange, but deep in the Wilderness. There are some ruins out there. Nothing there now, just dust, dirt and memories. It is where I lived with Obi'Sooth. I would like to have spent my last moments there, just me and my thoughts of him. It's been so many years, yet I can still picture that place clearly. It was one of the first true settlements that we built. Something lasting, a city on this strange new world. Obi and I had a home there. Not some palace, or gleaming temple. Obi was a farmer and a Bo'Ugdan and he would have found such a life intolerable. No, we had a nice simple house, with a garden so beautiful our neighbours would find any excuse to visit. All Obi's work of course. I never had green thumbs, most plants I watered died. He ended up banning me from his flowerbeds. And rightly so. I miss him. If I could be anywhere right now, it would be there. Remembering how it was and spending my last few minutes on this world with him. I'll never see him again. Not even in death. There will be no more afterlife for me, only silence. I deserve that. The strange thing about all of this, is that I find I do not want to leave. Isn't that odd? This world has taken so much from me. Every time I return to it more and more of what I love is ripped away from me. My people, my pride, my principles, and the man I loved so deeply that the pain still burns, even now, thousands of years later. And for what? What about this world is worth such a high price? Is the soil more fertile? Are the summers warmer and the winters less harsh? Is poverty impossible here? No. It is always about one thing... Power. There is power here, and we gods are drawn to it like moths to a flame. And what have we done since we arrived? We have warred with one another. We have squabbled, squandered...burned entire kingdoms to ash. All for just a taste of that power. But what is the point of power if it cannot protect what really matters? I have stolen it from the creators of the universe itself and yet, still, my Obi is gone, and I cannot bring him back. ... I am sorry. For what little it is worth, I am sorry for what we gods have done to this world. To the people here and to the land itself. You are right to banish us. It is time that we left, time to let you choose your own destinies, rather than having us dictate them for you. There are worlds out there that do need us. People in pain. Alone and in need of our help. It is time we gods stopped thinking about ourselves and started thinking about them again.",
            "This is not where I wanted to spend my last moments on Gielinor. But I have duties and I must perform them up until the last moment. I will be leaving soon and there is just too much still to do."
        ],
        "Dr Nabanik": ["Hello, old friend. Welcome to the Kharid-Et Dig Site."],
        "Azzanadra": [
            "Zamorak has been defeated - for now. You all heard Saradomin's proclamation. The truth is that the Edicts of Guthix have returned, and all the gods are slipping from this world.",
            "I feel it too, Sanctitas.",
            "Then your power has grown indeed. Nex and I shall return to Freneskae to continue our work. The rest of you, do the same here. Remember always that we stand for order, for civilization. Even in his absence, Zamorak's minions are a threat to everything Zaros values. Given the choice between peace under Saradominism and the endless destruction the Avernic would bring, there is no question of which side our assistance should fall on. Trindine, work with the new human empress. I do not believe she has the spine to do what is required of her. To ensure security, it will fall to you to do what she cannot.",
            "Shouldn't be a problem.",
            "Make use of Soran and Veilinius. I have already notified them of your authority.",
            "Got it.",
            "Wahisietel...",
            "Yes?",
            "We have grown apart, you and I, and that does not seem likely to change now.",
            "No.",
            "In light of your long service, I will not ask you to obey Trindine, but you know the humans better than any of us. Walk amongst them. They languish in this...dark age. Push them to do better, if you can. The guise of Dr Nabanik has been yours for some time. You may continue to use it if you wish.",
            "Perhaps.",
            "And try to keep Akthanakos out of trouble.",
            "Player.",
            "Are you going to give me orders too?",
            "You are not subject to my authority. We saved the universe together, you and I. Not bad for a human. I just wanted to say thank you. The rest of you, have faith in this one precept: Zaros will return. The way must be prepared for him. Come, Nex.",
            "What about Char?",
            "I have no doubt that she is protected under the auspices of our Lord, but if the opportunity arises to search for her, we shall. Valete.",
            "Vale.",
            "Later, Dad.",
            "I don't know about you, but I need a lie down."
        ],

        "Nex": [
            "I feel it too, Sanctitas.",
            "Then your power has grown indeed. Nex and I shall return to Freneskae to continue our work. The rest of you, do the same here. Remember always that we stand for order, for civilization. Even in his absence, Zamorak's minions are a threat to everything Zaros values. Given the choice between peace under Saradominism and the endless destruction the Avernic would bring, there is no question of which side our assistance should fall on. Trindine, work with the new human empress. I do not believe she has the spine to do what is required of her. To ensure security, it will fall to you to do what she cannot.",
            "Shouldn't be a problem.",
            "Make use of Soran and Veilinius. I have already notified them of your authority.",
            "Got it.",
            "Wahisietel...",
            "Yes?",
            "We have grown apart, you and I, and that does not seem likely to change now.",
            "No.",
            "In light of your long service, I will not ask you to obey Trindine, but you know the humans better than any of us. Walk amongst them. They languish in this...dark age. Push them to do better, if you can. The guise of Dr Nabanik has been yours for some time. You may continue to use it if you wish.",
            "Perhaps.",
            "And try to keep Akthanakos out of trouble.",
            "Player.",
            "Are you going to give me orders too?",
            "You are not subject to my authority. We saved the universe together, you and I. Not bad for a human. I just wanted to say thank you. The rest of you, have faith in this one precept: Zaros will return. The way must be prepared for him. Come, Nex.",
            "What about Char?",
            "I have no doubt that she is protected under the auspices of our Lord, but if the opportunity arises to search for her, we shall. Valete.",
            "Vale.",
            "Later, Dad.",
            "I don't know about you, but I need a lie down."
        ],

        "Wahisietel": [
            "Yes?",
            "We have grown apart, you and I, and that does not seem likely to change now.",
            "No.",
            "In light of your long service, I will not ask you to obey Trindine, but you know the humans better than any of us. Walk amongst them. They languish in this...dark age. Push them to do better, if you can. The guise of Dr Nabanik has been yours for some time. You may continue to use it if you wish.",
            "Perhaps.",
            "And try to keep Akthanakos out of trouble."
        ]
    }
}
