{
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "Missing King Roald asking about how you suspected he was a descendantYou can discuss this issue on the talk page or edit this page to improve it."
  ],
  "Captain Rovin": [
    "What are you doing up here? Only the palace guards are allowed up here.",
    "Well go and do it somewhere else!",
    "Hmmm, an explorer, eh? I might have a little task for you if you're interested.",
    "Yes, 'quest' would be an apt description, if that appeals more to you adventurer types.",
    "I'd use my own guards for this but, for some reason, I have a high staff turnover and I don't have the men to spare. Anyway, I've recently been receiving reports of zombies organising in the Wilderness.",
    "The concept of zombies in the Wilderness I'm not worried about, but one of my scouts has reported large numbers of them forming ranks. Zombies don't naturally organise themselves, so someone must be organising them. There",
    "are necromancers in the Wilderness who've caused problems with zombie armies in the past. I need you to find out what's going on and whether or not it's a threat to the security of Varrock.",
    "The scout who reported the zombies will be able to tell you that. HARTWIN, GET UP HERE!",
    "Hartwin, tell us about the zombies you witnessed in the Wilderness.",
    "Yes, yes, the Graveyard of Shadows, I know of it. Get to the point please.",
    "Right, well, [player] is more experienced in combat than you. I want the two of you to go up there and investigate further, to find out who this 'shadowy figure' is and what they're planning.",
    "If you're so busy, stop wasting time up here. This room is still off-limits, you know.",
    "Are you ready to get going on your mission to the Wilderness yet?",
    "Well, I hope you're ready soon. We've not got all day.",
    "Are you ready to get going on your mission to the Wilderness yet?",
    "HARTWIN, GET UP HERE. (S)HE'S READY TO GO!",
    "Haven't you two made it to the Graveyard of Shadows yet?",
    "So, what news[sic] from your scouting mission?",
    "What information have you found out about this army?",
    "I need to know what the zombie army is up to! Get down that trapdoor and figure out what is going on.",
    "Hartwin turned up here. He says that you had to leave and do something else. Are you ready to continue the mission?",
    "HARTWIN, GET UP HERE. (S)HE'S READY TO GO!",
    "Well, I hope you're ready soon. We've not got all day.",
    "So, what news[sic] from your scouting mission?",
    "Zemouregal! Are you sure? That's bad news. For as long as the people of Varrock can remember, Zemouregal has been talked about in hushed tones as one to be feared. Zemouregal attacking Varrock again is people's",
    "greatest fear and worst nightmare. You must head back into the Wilderness and find out what Zemouregal is planning.",
    "So, what news[sic] from your scouting mission?",
    "Zemouregal! Are you sure? That's bad news. For as long as the people of Varrock can remember, Zemouregal has been talked about in hushed tones as one to be feared. Zemouregal attacking Varrock again is people's",
    "greatest fear and worst nightmare.",
    "Wow, this is quite some news you bring, and not of the happy sort. I'm almost afraid to ask, but any news on Zemouregal's plans?",
    "It's almost too frightening to contemplate that the fall of Varrock could come to pass in our lifetime. What can we do to stop this?",
    "The Shield of Arrav? Hmm, yes, but is it really any use? The legends say the son of the founder held the shield and the zombies fell before him, but, in recent years, we have not been able to unlock such power. We had thought that",
    "maybe the legends were exaggerated and it was just an ordinary shield.",
    "Then, [player], I entrust you to speak to this Thurgo and seek his advice on how to use the shield to defend our city. In the meantime, I shall move the shield into the palace - it will be better defended here than in the",
    "museum.",
    "Have you spoken to that dwarf yet?",
    "Have you spoken to that dwarf yet?",
    "So, what are you doing back here?",
    "We haven't got time for that. See if you can find that forge.",
    "There are zombies all over the palace! I hope you bear good news or we're all doomed. It can't be long until they move on the rest of Varrock.",
    "I'm not sure myself. There are various census records and the like in the Palace Library downstairs. I'd start by looking there.",
    "I brought the shield up here for its protection; here, you'd better take it with you.",
    "Any progress on finding the descendant of the founder of Varrock? These zombies are ripping the place apart.",
    "Please try to make some progress; I quite like Varrock.",
    "Here, I have the Shield of Arrav; you'd better take it with you.",
    "Wow, you did it! The zombies have all gone and you've saved Varrock! The beacon network you helped to test also saved a lot of lives.",
    "Well, thanks to you both. This victory will go down in Varrock history.",
    "Yes, I doubt it's the last we've heard of them; hopefully, it will be a long, long time before they can rebuilt their forces and cause us much harm."
  ],
  "Player": [
    "Just exploring, really.",
    "Ooh, good, sounds like a quest.",
    "What sort of task are we talking about here?",
    "Zombies in the Wilderness? That doesn't seem all that unusual to me.",
    "Where in the Wilderness have these zombies been spotted?",
    "I've got other things I'd rather be doing.",
    "Okay, let's get going.",
    "No, I need to do some things first.",
    "No, I'm not ready yet.",
    "Yes, I'm ready now.",
    "Okay, let's get going.",
    "No. We are on our way, though.",
    "Well, here we are in the graveyard. There's a few zombies here, but it's hardly an army.",
    "Brilliant, Hartwin. Let's follow these and see where they go.",
    "We've tracked the zombie army to a hidden trapdoor.",
    "Err, nothing yet.",
    "Yes, I'm ready now.",
    "Okay, let's get going.",
    "No, I'm not ready yet.",
    "Shh, they'll hear us.",
    "Well, we managed to track down the zombie army. What's more, we discovered that they're being commanded by a mahjarrat going by the name of Zemouregal.",
    "Arrav, could it be that you're fighting Zemouregal's control?",
    "I'm sorry. That sounds like it must be awful.",
    "Hartwin, let Arrav speak.",
    "Is there anything we can do?",
    "Well, we managed to track down the zombie army. What's more, we discovered that they're being commanded by a mahjarrat going by the name of Zemouregal.",
    "Yes, he plans for Arrav to lead the zombie army in an attack on Varrock, and he plans it soon.",
    "At least one exists. In my travels I've met an imcando called Thurgo, living in southern Asgarnia.",
    "No, not yet. I'll be on my way shortly.",
    "I'd like to ask about the Shield of Arrav. I've heard that the imcando dwarves know about this item.",
    "I know that - I've just come from there. There are, however, legends that say it can be powerful, if used correctly. I need to know how to unlock that power to defend Varrock from a deadly foe.",
    "What? What? Tell me.",
    "What on RuneScape is Camdozaal?",
    "Have you not looked for it yourself?",
    "So, any more information on how to find Camdozaal?",
    "I've lost that piece of paper that shows the location of Camdozaal.",
    "Yes, he didn't know a lot. Not to worry, though: he gave me another lead. I may be able to discover what we need if I can find a lost imcando 'Sacred Forge'.",
    "Err, I thought I'd report back on my progress.",
    "Redberry pie?",
    "Okay, here you go.",
    "No, it's my pie.",
    "Wow! I didn't expect to find anyone down here.",
    "Wow, how did you survive here so long?",
    "Why are you wearing that cloth?",
    "So, this is Camdozaal?",
    "Wow, another imcando dwarf!",
    "Well, I have to admit that race hasn't fared well. I know one who is named Thurgo. I don't know if there are any others about. You're considered a rather endangered species.",
    "I wish to use the Sacred Forge.",
    "The city of Varrock is under grave threat from Zemouregal the mahjarrat. We have an artefact called the Shield of Arrav, which we think may be able to help, but we don't know how to unlock its power.",
    "Thank you, Ramarno.",
    "Well, I've done a fair bit of Smithing.",
    "I've now put the blurite in the forge.",
    "Traiborn! What are you doing here?",
    "I never knew my mind was so weird.",
    "That was scary. I must get back to Varrock as quickly as possible.",
    "Thank you for your help with the forge. I must get back to Captain Rovin as quickly as possible.",
    "Don't panic, I'm working on it.",
    "That's all, thanks.",
    "They're an army belonging to Zemouregal.",
    "I'm sorry, Your Majesty. I'm trying to get rid of them.",
    "It's an invasion by Zemouregal.",
    "I am working on a plan to get rid of them, fingers crossed.",
    "It's an army of zombies belonging to Zemouregal the mahjarrat.",
    "I am working on a plan to get rid of them, fingers crossed.",
    "What are you doing here?",
    "Don't panic, I'm working on how to deal with them.",
    "Not really. Normally, they stick to caves and sewers.",
    "Don't you think you should try and get to somewhere safer?",
    "Hi Arrav, it's me, [player].",
    "Is Zemouregal not letting you speak?",
    "I guess that's a no.",
    "Arrav, snap out of it.",
    "That didn't work.",
    "Talk to me, Arrav!",
    "Don't ignore your mate, Arrav!",
    "Well, that normally gets people's attention, but it doesn't seem to be doing a lot here.",
    "Sort of. I know that only someone of a certain bloodline can use the shield: a descendant of one of the first elders of Varrock. I'm not sure how I'd find someone of that lineage still alive today, though.",
    "Not yet, no.",
    "Reldo, I need your help. I must find out if there are any living descendants of the founder of Varrock.",
    "Reldo, this information may help us to defeat the zombies. Now, I know that the founder of Varrock became an elder of the town during the same time of the legendary Arrav. That's as much as I know.",
    "Well, I'm sure I'll find it. Once I've found the names, I still need to find who is descended from them.",
    "Thanks, Reldo, you've been very helpful.",
    "The list of elders looks useful, but I still need to find someone who is descended from the elders.",
    "Hmm. The Varrock Census - year 160. That means it's nine years out of date.",
    "Actually, no, I don't have it. How embarassing. I'll be back in a bit.",
    "So I can see. We might have a solution with this shield, though.",
    "I have a reason to believe that you are descended from an original elder of Varrock.",
    "No, Your Majesty, but it might mean that you can use the shield to defeat the zombies. Here, hold the shield and see if anything happens.",
    "It must be someone else who is descended from the correct elder, then. Ah, well, thank you for your time.",
    "I need your help with this shield.",
    "It's the Shield of Arrav. A descendant of an original elder of Varrock can apparently use it to stop the zombie army. You're one of those descendants, although I'm not sure if you're the right one.",
    "It must be someone else who is descended from the correct elder then. Ah, well, Prysin, thank you for your time.",
    "Well, your surname is Prysin. It matches the name of an early elder called Khom Prysin.",
    "So, are there any genuine Prysins about?",
    "Well, that's handy to know. Thank you for your help.",
    "They're an army belonging to Zemouregal.",
    "You might be able to help with this shield, though.",
    "I have reason to believe you are descended from an original elder of Varrock, which might mean that you have the ability to use the shield to defeat the zombies. Here, hold the shield and see if anything happens.",
    "It must be someone else who is descended from the correct elder then. Ah, well, Aeonisig, thank you for your time.",
    "Well, your surname is Raispher. It matches the name of an early elder called Dathero Raispher.",
    "So, are there any genuine Raisphers around?",
    "Well that's handy to know. Thank you for your help.",
    "Hi. I need to speak to you. A zombie army invaded the palace and you might be the one who is able to stop them.",
    "Ah, but the Shield of Arrav may be able to help here.",
    "I have reason to believe that you are descended from an original elder of Varrock, which might mean you have the ability to use the shield to defeat the zombies. Here, hold the shield and see if anything happens.",
    "It must be someone else who is descended from the correct elder then. Ah, well, thank you for your time.",
    "Well, your surname is Halen. It matches the name of an early elder called Marv Halen.",
    "So, are there any genuine Halens around?",
    "Well that's handy to know. Thank you for your help.",
    "Horvik, I need to speak to you about a matter of some urgency. A zombie army invaded the palace and you might be the one who is able to stop them.",
    "I'm sure it would be - but I have here the Shield of Arrav!",
    "I have reason to believe that you are descended from an original elder of Varrock, which might mean you have the ability to use the shield to defeat the zombies. Here, hold the shield and see if anything happens.",
    "It must be someone else who is descended from the correct elder then. Ah, well, thank you for your time.",
    "No, thanks. I'm just looking around.",
    "Well, your surname is Ravitz. It matches the name of an early elder called Ramone Ravitz.",
    "So, are there any genuine Ravitz's around?",
    "Well that's handy to know. Thank you for your help.",
    "Dimintheis, I need to speak with you about a matter of some urgency. Zombies have invaded the palace and you might be the only one able to stop them.",
    "I'm hoping the Shield of Arrav may help a little.",
    "I have reason to believe that you're descended from one of the original elders of Varrock, which might mean you have the ability to use the shield to defeat the zombies. Here, hold the shield, see if anything happens.",
    "It's never done anything like that before! I think you might be the one - a descendant of the founder of Varrock.",
    "Quick, let's go to the palace and see what the shield does to zombies.",
    "Dimintheis Fitzharmon helped as well.",
    "It's a pity that we didn't catch any of the leaders. Zemouregal, Sharathteerk and Arrav are all still at large."
  ],
  "Option 1": [
    "Ooh, good, sounds like a quest.",
    "Okay, let's get going.",
    "Yes, I'm ready now.",
    "Yes, I'm ready now.",
    "I want to talk about the mission.",
    "Yes.",
    "I want to talk about the mission.",
    "I want to talk about the mission.",
    "Let's go!",
    "Yes, I'm ready.",
    "Skillcape of Smithing.",
    "I'm not scared of the dark!",
    "Okay, here you go.",
    "Wow, how did you survive here so long?",
    "Would you look after my crops for me?",
    "Talk about the zombie invasion.",
    "Who are you?",
    "Talk about Zombies.",
    "I'd like to talk about the invading zombies.",
    "Is Zemouregal not letting you speak?",
    "I'd like to talk about the invading zombies.",
    "Talk about Zombies.",
    "Talk about the zombie invasion.",
    "Talk about the zombie invasion.",
    "Do you want to trade?"
  ],
  "Option 2": [
    "What sort of task are we talking about here?",
    "No, I need to do some things first.",
    "No, I'm not ready yet.",
    "Can you teleport me back to Varrock?",
    "No.",
    "Can you teleport me back to Varrock?",
    "Can you teleport me back to Varrock?",
    "I'm not ready yet.",
    "No, I'm not ready yet.",
    "Something else.",
    "I'm scared of the dark.",
    "No, it's my pie.",
    "Why are you wearing that cloth?",
    "So, this is Camdozaal?",
    "Can you give me any Farming advice?",
    "Talk about something else.",
    "What do you do here?",
    "Talk about Priest in Peril/the beacons.",
    "I'd like to talk about something else.",
    "Arrav, snap out of it.",
    "I'd like to talk about something else.",
    "Talk about Priest in Peril/the beacons.",
    "Talk about something else.",
    "Talk about something else.",
    "Talk about the zombie invasion."
  ],
  "Hartwin": [
    "Yessir!",
    "Yessir. I was scouting north of Varrock and the creepy building surrounded by lava, sir. There's an old graveyard there, often with zombies shuffling about it.",
    "Well, this time there were more zombies than usual. It looked like an army; they were even standing in lines. Better equipped too, sir. It looked like they were all facing a shadowy figure, but I didn't investigate further for fear",
    "of being discovered.",
    "[player], are you ready to get going?",
    "I can teleport us both to the Graveyard of Shadows in the Wilderness. It's a dangerous area, but I can cover our track so that we only encounter brainless zombies.",
    "Let's go!",
    "Okay, come back and talk to Rovin when you're ready. I've got other things to be getting on with for now.",
    "You should get rid of your animal first. This is a covert mission. It's going to be harder to sneak with that around.",
    "I'm here, ready and waiting.",
    "Hartwin, reporting for duty, sir!",
    "We should get closer to the graveyard to look for those zombies.",
    "Okay, but we should get on with this mission soon.",
    "Keep away from that thing!",
    "I swear there was an army here. They must have moved on. Hmm, I wonder...",
    "Aha, yes, look at these tracks here. The zombies seem to have been wandering around - as zombies are known to do - but there are also trails leading out of the graveyard.",
    "We need to continue following the zombie tracks I found in the west of the graveyard.",
    "Okay, but we should get on with this mission soon.",
    "There must be something near where the footprints came to an end.",
    "Okay, but we should get on with this mission soon.",
    "We should explore the area under the trapdoor further.",
    "I can teleport us back to that base in the Wilderness. Just be prepared!",
    "Hartwin, reporting for duty, sir!",
    "Great Saradomin's beard! It's Zemouregal the mahjarrat, the ancient enemy of Varrock.",
    "Arrav! I'm seeing Arrav in the living flesh! Um, well, unliving flesh. But, he was one of the greatest heroes of the Fourth Age! Wow, I'd ask for his autograph if he wasn't a foul undead creature.",
    "I can't believe I've actually seen Arrav. We should explore Zemouregal's base further.",
    "Oh, it's Arrav!",
    "Why would the minion of a mahjarrat care to give us a warning?",
    "Wow, we're talking to Arrav. Wait till I tell the guys back home about this.",
    "They plan to attack Varrock. We must get back to Captain Rovin and warn him about what is going to happen. Here, I have a spare Varrock Teleport tablet.",
    "The legends are true, sir! We saw Arrav too: undead and under the control of Zemouregal, just like the legends say, sir.",
    "We have the shield, sir! The legends say that's how Zemouregal was stopped last time.",
    "The imcando dwarves are said to know the secrets of the shield, but I've not heard much mention of them in recent years, sir. I've even heard they may be extinct."
  ],
  "Option 3": [
    "I've got other things I'd rather be doing.",
    "I'd like to ask about the Shield of Arrav",
    "Wow, another imcando dwarf!",
    "Can you sell me something?",
    "Where did you come from?",
    "Ask about the kingdom.",
    "Talk to me, Arrav!",
    "Ask about the kingdom.",
    "No, thanks. I'm just looking around."
  ],
  "Simon": [
    "(Transcript missing. edit)"
  ],
  "Sharathteerk": [
    "Zemouregal, this magical mist feels like it's corroding my insides. This seems like a bad idea.",
    "Your cousin Lucien grows unusually strong. We should consider allying ourselves to him, maybe even combine forces.",
    "My lord-",
    "I'm telling you, he may be close to finding it.",
    "So, what do we do now?"
  ],
  "Zemouregal": [
    "Nonsense! The mist has no side effects. Anyway, you know it's essential for my new security system. Everyone needs to be imbued with it if they want to go through the doors in the base.",
    "Now, what news do you bring from the north?",
    "While I appreciate that we should keep good diplomatic relations with Lucien, there is such a thing as going too far. Combining forces is a bad plan.",
    "I won't hear of it! Lucien would likely want to lead in such an arrangement and I have no desire to serve at his behest. Besides, I have significantly powerful resources of my own.",
    "After many long years, it is time for Arrav to take command of my zombie troops.",
    "Arrav, Sharathteerk, let's go. We have troops to inspect.",
    "Enough! I don't have time to worry about fairy tales. The ritual approaches and we must be prepared. This may be our last real chance before the time comes to head north.",
    "We will make our attack on Varrock as soon as possible. I will claim the Shield of Arrav!",
    "What's this I've found? Now, this is interesting...a snooping adventurer.",
    "You pathetic human wretch, you have taken too long to discover what needs to be done. My zombie army is at the walls of Varrock, even as we speak.",
    "It's all gone wrong; Arrav, get out of there!",
    "Regardless of this disaster, it's about time for me to head north."
  ],
  "Arrav": [
    "You must leave. It's too...urgh...arrgh...",
    "...dangerous for the likes of you here.",
    "My body is under the control of . I sometimes have enough control to speak when Zemouregal's concentration is elsewhere. Even then, it's painful to move against his will. My mind, however...gahh...",
    "...is still intact. The mahjarrat left it that way so I could feel the horror...urgh...",
    "...the horror of the things he forces me to do. I must look upon innocent people's faces as my body is forced to kill them.",
    "I have been in constant torment for centuries. All the people I've killed haunt me in my nightmares.",
    "If only someone could help me break...arrgh!",
    "My master is again exerting his control over my body. It seems I must leave you here."
  ],
  "Thurgo": [
    "I have heard of the artefact of which you speak. I believe it currently resides in the city of Varrock.",
    "Unfortunately, the properties of the shield are as shrouded in legend for me as they are for the people of Varrock.",
    "I have an idea though. No, it's silly.",
    "Well, you could go to Camdozaal.",
    "It was a great hall under Ice Mountain that used to belong to us, the imcando dwarves. We lost it many years ago in the time of my great-grandfather. When barbarians brutally attacked the imcando dwarves, they caused a",
    "huge cave-in. Those few imcando dwarves left alive fled the area, due to the many rampaging barbarians around there. There was a Sacred Forge in Camdozaal. Our sages would look into it and find all sorts of useful information.",
    "The sages used to come down here to get blurite to power the forge with. Maybe it still exists, if it didn't get destroyed in the cave-in.",
    "Oh, I've tried, but it's really a mess in the entrance tunnel. It's thoroughly blocked. I'm more of a smith than a miner myself and I didn't really have the proper digging tools or a light source. Maybe you'll fare better, though.",
    "It's a little hard to find because it often gets covered in snow, but I do have its location on this piece of paper here.",
    "Good luck with finding the forge. I've always thought it a shame that its knowledge has been lost to the world.",
    "It's buried in the snow on Ice Mountain. That scrap of paper I gave you should reveal its location.",
    "Good job I gave you a copy, then."
  ],
  "Ramarno": [
    "What is that divine smell? Could it be-?",
    "It really is! A legendary redberry pie. I don't suppose I could have some?",
    "The reputation of the redberry pie is well deserved; that was absolutely amazing. Let me reward you for allowing me to experience such an exquisite taste sensation.",
    "A pity, but understandable. I wouldn't give away redberry pie if I had any, either.",
    "I have been here for many years. There were a handful who survived the cave-in caused by the barbarians but, over the years, we have dwindled in numbers. My name is Ramarno. I am a sage of the imcando dwarves and I am",
    "now the only guardian of the Sacred Forge.",
    "We dwarves are adept at surviving underground. Besides, I have fresh water in here and fish swim in from outside.",
    "This cloth over my eyes? I am blind. My eyes were ruined by falling rocks when I was caught in the cave-in.",
    "Well, it's part of Camdozaal. This used to be a huge, magnificent place. Now, it's mostly filled with rubble. Curse those barbarians. They caused the cave-in that destroyed our home. At least the Sacred Forge survived.",
    "There are some more of my people left, then? I always wondered what happened to the rest of the imcando and whether they were all killed by the barbarians.",
    "Well, I hope this Thurgo can come to visit an old sage. If you meet any more of the imcando on your adventures, I would very much like to know.",
    "The Sacred Forge is not for idle fortune-telling. What is your cause?",
    "I must admit, saving a city from the threat of mahjarrat is a worthy cause. I will help you. I would look into the flames of the forge myself, but, as you can see, I am blind.",
    "Wait a minute. The forge will only reveal its secrets to those who respect metal and know the ways of Smithing.",
    "Good, good. Well, the first thing you must do is stoke the forge with blurite; then I will work the magics to light it.",
    "Okay, let's get cracking.",
    "Bron uffon afgi bami.",
    "Look deep into the forge and think of the shield.",
    "Good luck with your quest."
  ],
  "Option 4": [
    "I wish to use the Sacred Forge.",
    "That's all, thanks.",
    "How did you come to be an advisor to King Roald?",
    "Greet the king.",
    "Greet the king."
  ],
  "Traiborn": [
    "You wish to know about the Shield of Arrav.",
    "This is not Traiborn, this is your mind using familiar images to filter the cacophony of information that is coming from the forge.",
    "Legend tells of days of old, when Arrav used a shield to defeat the mahjarrat, Zemouregal."
  ],
  "Queen Ellamaria": [
    "But it was not actually Arrav who stopped the zombie horde. At the last hour, Arrav cast his shield towards Varrock, where it was taken up by the son of the founder. Only then did the zombies meet their doom. But how did",
    "this happen?",
    "What are all these horrible, icky zombies doing in my nice, clean palace? You're an adventurer: get out there and protect me from them!",
    "Please don't eat me!"
  ],
  "Fenkenstrain's Monster": [
    "The powers of the shield are not simple. To truly defend Varrock using the shield, one needs to be of the bloodline that founded the town. But who founded Varrock?"
  ],
  "Wise Old Man": [
    "The leader of the tribe that founded Varrock became one of the city's first elders. There were seven elders when Zemouregal was defeated, but only one was of this founding bloodline. To this day, that bloodline is the",
    "only one that can use the shield to defend Varrock."
  ],
  "Treznor": [
    "Get these nasty zombies away from my nice garden!"
  ],
  "Monk of Zamorak": [
    "Haha, mash those guards.",
    "Let me out, I'll help with your invasion!",
    "Let me out! I'm a bad guy too!",
    "Hey! Zombies, I'm on your side.",
    "So, are any of you zombies gonna break me out?",
    "Oi, Mr[sic] Zombie! Care to let me out?",
    "Hurrah! Free at last.",
    "Erm."
  ],
  "Aeonisig Raispher": [
    "What's going on? Where have all these zombies come from?",
    "Zemouregal? Saradomin preserve us!",
    "What's going on? Where have all these zombies come from?",
    "Zemouregal? Saradomin preserve us!",
    "Ahh, the legend of the shield. We don't really know how to use its power, though.",
    "Well, I suppose it's worth a try.",
    "No, nothing special seems to be happening.",
    "No, nothing special seems to be happening. Why do you think I'm descended from an original elder of Varrock, anyway?",
    "That's smart thinking, I like it. Unfortunately, it's also flawed, because I'm not actually a blood descendant of the Raispher family. My great-grandfather was adopted into the Raispher family.",
    "Well, none with the name Raispher. The last descendant of the Raispher line was a lady named Lucinda Raispher. She married into the Fitzharmon family."
  ],
  "Option 5": [
    "What is happening in the kingdom?"
  ],
  "King Roald": [
    "I'm rather busy right now. In case you hadn't noticed, there are zombies all over the palace.",
    "Well, help get rid of them, rather than standing there yapping at me.",
    "I'm rather busy right now. In case you hadn't noticed, there are zombies all over the palace.",
    "No one has figured out how to unlock the powers of the shield in hundreds of years - are we so desperate that we are relying on legends?",
    "That's right. Would you expect anything less of the man who is king?",
    "Well, I have held the shield before, but I'll give it a go.",
    "It doesn't seem to be doing anything special."
  ],
  "Sir Prysin": [
    "Where did all these zombies come from?",
    "The gods preserve us!",
    "We're doomed.",
    "Where did all these zombies come from?",
    "What shield?",
    "Well, I suppose anything is worth a try.",
    "No, nothing special seems to be happening.",
    "No, nothing special seems to be happening. Why did you think I was descended from an original elder of Varrock, anyway?",
    "Well, it's good thinking, but I'm not actually a blood descendant of the Prysins. My great-grandfather was adopted into the Prysin family.",
    "Well, none with the name Prysin. The last blood descendant of the Prysin line was a lady named Rhee Prysin. She married into the Fitzharmon family."
  ],
  "Reldo": [
    "What's going on? Where did all these zombies come from?",
    "Oh no, that is bad news indeed.",
    "What's going on? Where did all these zombies come from?",
    "Normally, I'm the first person to chat about local history, but you may have noticed that there are zombies all over the place.",
    "I did have an old document pertaining to that time. It had a list of the elders who sent Arrav on the quest for the shield. I think it was on my desk before a zombie knocked it onto the floor.",
    "Well, I suppose you could consult the old census; see if any of the surnames on the census match those on the list.",
    "Good luck. Feel free to consult the census over there. Maybe some of the surnames in the census match those on the list."
  ],
  "Guard": [
    "Making sure that the zombies don't get to the Queen."
  ],
  "Ambassador Ferrnook": [
    "Why are there zombies all over the place? Is this normal in Misthalin?",
    "Well I hope they get removed soon. This isn't safe.",
    "Well, I'd prefer to wait it out, but if someone doesn't deal with these things soon, I may have to."
  ],
  "NPC": [
    "What shield?"
  ],
  "Curator Haig Halen": [
    "Welome to the museum of Varrock.",
    "I'm flattered, but I'm sure I don't have the combat prowess for those kinds of shenanigans.",
    "I'm not sure the shield, nice as it is, will make that much difference.",
    "Well, I've held it a few times in the course of my curator job, but I'll give it a go.",
    "No, nothing special seems to be happening.",
    "No, nothing special seems to be happening. Why do you think I'm descended from an original elder of Varrock, anyway?",
    "Now, that is smart thinking. Unfortunately, it's also flawed, because I'm not actually a blood descendant of the original Halen family. My great-grandfather was adopted.",
    "Well, I'm the only one I know of with the Halen surname. The last descendant of the Halen line, that I know of, was a lady named Edwina. She married into the Fitzharmon family."
  ],
  "Horvik": [
    "Hello, do you need any help?",
    "I like to think I'm good in a fight, but a whole zombie army seems a bit much for me to take on.",
    "I've seen the shield; a good bit of workmanship.",
    "It all seems a bit unlikely to me, but I'll give it a go.",
    "It doesn't seem to be doing anything exciting.",
    "Well, come and see me if you're ever in need of armour!",
    "It doesn't seem to be doing anything exciting. Why do you think I'm descended from an original elder of Varrock, anyway?",
    "Now, that is smart thinking. Unfortunately, it's also flawed, because I'm not actually a blood descendant of the original Ravitz family. My great-grandfather was adopted.",
    "Well, I'm the only one I know of with the Ravitz surname. The last descendant of the Ravitz line, that I know of, was a lady named Shauna Ravitz. She married into the Fitzharmon family."
  ],
  "Dimintheis": [
    "Well, I suppose I could help. I'm getting on a bit now, though; I'm not quite the warrior I used to be.",
    "Ahh, yes, I know of the shield's legend. I don't understand why you need me, though.",
    "That doesn't sound entirely convincing, but I'll give it a go.",
    "That's impressive.",
    "Well, that lighting coming from the shield did seem pretty unusual.",
    "Die, zombie scum!"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Defender_of_Varrock?oldid=35919687’"
  ]
}