{
  "Player": [
    "How goes the research?",
    "Well, I certainly don't like those of the Zamorakian faction.",
    "The actions of the Zamorakian faction don't really worry me.",
    "No, but their beliefs don't affect me directly.",
    "Yes. I know of the power that chaos brings.",
    "Religion isn't something I much care about - I just fight.",
    "At least the Zamorakians offer a fight, unlike Zarosians.",
    "Zaros seems to be an honourable god.",
    "I get the impression that Zaros is unpleasant too.",
    "I don't think we have enough information to know yet.",
    "Not if the Zamorakians slay all my prey before I can.",
    "Zaros sounds like a worthy deity to me.",
    "The Zamorakian Mahjarrat pose a clear threat.",
    "I don't care about the Zamorakians.",
    "Zamorak's followers will be crushed by Zaros's forces.",
    "I don't think we have enough information to know yet.",
    "I am a true follower of Zamorak!",
    "Yes. I know of the power that chaos brings.",
    "I don't think about it. Who am I to question Zamorak?",
    "No, but I have my reasons for following Zamorak.",
    "Zaros seems to be an honourable god.",
    "Zaros seems to be an honourable foe.",
    "The Zarosian Mahjarrat seem feeble.",
    "I never think of Zaros, only of Zamorak.",
    "Zaros is a forgotten nobody.",
    "I get the impression that Zaros is unpleasant too.",
    "I don't think we have enough information to know yet.",
    "Dr Nabanik? The name doesn't ring any bells, I have to say. I suppose I could head over and see what he wants.",
    "Remind me where the Digsite Exam Centre is.",
    "Can you help me get to the Digsite Exam Centre?",
    "Thanks!",
    "See you later, then.",
    "Dr Nabanik, I presume?",
    "(Whisper) Why are we speaking so quietly?",
    "Hey, don't I know you from somewhere?",
    "(Whisper) Okay, then, why are we speaking so quietly?",
    "(Shout) Why do you want me to be QUIET?",
    "Azzanadra? You are quite the master of disguise.",
    "No, I can't remember who you are.",
    "Why are you here, away from the pyramid?",
    "I see, but what is so special about here?",
    "What's Ali's part in this?",
    "Why all the secrecy?",
    "That's a good point, but where do I fit in?",
    "Never mind.",
    "Just tell me what you want.",
    "I hope I won't be required to lie. You do have both of those things, right?",
    "One last thing: whom should I ask?",
    "How goes the research?",
    "Dr Nabanik is Azzanadra, a Mahjarrat, as you well know. I'm helping him restore the temple under the Digsite. I'll tell you all about it when I'm finished.",
    "I'm here about a close friend of mine: Dr Nabanik.",
    "He was in the pyramid for a very long time.",
    "I can be his reference.",
    "I've seen those beetles and they're huge.",
    "You know how fragile paper is.",
    "He studies pyramids, particularly their interiors.",
    "He was involved in one pyramid for so long, you could say he lived there.",
    "I think he was sidetracked by some magical emanations, though, and lost far more time than he would have liked.",
    "He studies the ways of ancient magic.",
    "He hasn't ever been fanatical and, from my experience, he's well aware of the dangers of being exposed to magical forces.",
    "He studies matters so complex they confuse me.",
    "I think it's good. He seems to be working on elucidating his theories, so I'm sure it will become clearer.",
    "He studies ancient views on immortality.",
    "He's never expressed any concerns over his mortality to me.",
    "I'd go so far as to say that old age is something that he doesn't fear in the least.",
    "He mainly studies fossilised dung.",
    "I'm sure he could explain at great length how this is a useful field of study.",
    "He has an aged benefactor.",
    "I think that the benefactor may already be dead, for all intents and purposes.",
    "In any case, the wealth he currently has is sufficient.",
    "He made his fortune selling magical staves.",
    "I suspect that his ventures are centred somewhat south of Varrock and are even more profitable.",
    "He's extraordinarily miserly.",
    "As far as I know, he managed to spend no money at all while in the pyramid he was examining.",
    "I think his food bills are exceptionally low too.",
    "He has links to the desert religions.",
    "I think he was originally working upon the religion of Icthlarin, though he's moved on to more general studies.",
    "He was involved in the recovery of desert treasure.",
    "Oh, no - lost property of no special historical value. Using it this way is far more likely to further knowledge.",
    "So, does Dr Nabanik have permission now?",
    "Thanks.",
    "You're right, it is a bit suspicious.",
    "Never mind.",
    "You're right, it is a bit suspicious.",
    "Never mind.",
    "Never mind.",
    "I've lost the restoration certificate you gave me.",
    "Thanks.",
    "Never mind.",
    "I've talked to the powers that be and they say you are allowed to do your restoration.",
    "Yes, I have the certificate here.",
    "I think I did pretty well at making you seem a worthy person to do this restoration.",
    "No, I don't have the certificate.",
    "Certainly, I'll see you there. I recall needing a rope to descend...",
    "Certainly, I'll see you there. I recall needing a rope to descend, so it's a good thing I have one with me.",
    "Why were you in the desert?",
    "What are you doing here?",
    "Why are you so happy?",
    "Who are your people?",
    "What are you doing here?",
    "Why are you so happy?",
    "Yes. I'm here to take your tools.",
    "Don't worry, I'm not after your tools.",
    "Why do your tools go missing?",
    "What are you doing here?",
    "Yes, I freed Azzanadra.",
    "No, I didn't free him.",
    "How do you know Azzanadra?",
    "What are you doing here?",
    "Why are you so happy?",
    "So, what next?",
    "Is there anything I can do to help?",
    "I'll come back later, then.",
    "No, I can't help you any more now.",
    "Okay, what do I need to do?",
    "Tell me about the mission in Morytania.",
    "Okay.",
    "Tell me about the mission in the north.",
    "Snow-buried? That sounds cold.",
    "The cold has never bothered me before.",
    "I have some questions about the mission in Morytania.",
    "What do I need to do in Morytania?",
    "Do you have any advice for me?",
    "Let's talk about something else.",
    "I have some questions about the mission in the north.",
    "What do I need to do in the north?",
    "Snow-buried? That sounds cold.",
    "The cold has never bothered me before.",
    "Do you have any advice for me?",
    "Okay, and where can I find the fortress?",
    "I've read the letter. It seems your contact needed to draw nearby heat globes towards him. He also wrote that he didn't have the necessary runes.",
    "Okay, and where can I find the fortress?",
    "I've lost the ruined backpack you gave me.",
    "Tell me about this frozen fortress.",
    "Only at times?",
    "What do the Mahjarrat need a stronghold for?",
    "Really? What's the secret?",
    "Yes, I know all about the secret.",
    "I've picked up bits of information about it here and there.",
    "Jhallan told me.",
    "Yes, he's fighting fit.",
    "Only just, he's pretty weak.",
    "No, Jhallan died.",
    "Actually, I don't know what the secret is.",
    "Healthy eating and lots of sleep?",
    "Let's talk about something else.",
    "Tell me about the artefacts you need.",
    "Tell me about the fortress artefact.",
    "Tell me about the Barrows artefact.",
    "Let's talk about something else.",
    "Never mind.",
    "About the letter from the ruined backpack...",
    "I've lost the letter from the ruined backpack.",
    "Oh.",
    "I've read the letter from the ruined backpack.",
    "It sounds like he was outwitted.",
    "It seems the creatures in that area were too much for him.",
    "It's easy to run out of runes, like he did, I suppose.",
    "So, basically, the letter says your contact didn't have the runes he needed to reach something, so he had to retreat?",
    "Only a fool travels without the runes they need.",
    "Let's talk about something else.",
    "I've lost the heat globe from the ruined backpack.",
    "Oh, yes.",
    "Tell me about this place.",
    "Tell me about the temple.",
    "And what about the chamber through there?",
    "Tell me about the city.",
    "How do you know that?",
    "I have something here for you.",
    "What does the Frostenhorn do?",
    "Why is it called the Frostenhorn?",
    "If the Frostenhorn is the human name for it, what do the Mahjarrat call it?",
    "I have the Barrows icon in my bank for you too.",
    "Okay, what do I need to obtain next?",
    "Seriously? This isn't everything?",
    "So, the final item you need is being delivered by another of your contacts. Do we just wait for them to arrive?",
    "Sounds simple enough. I'll be back with this item.",
    "So, what's next - I forgot?",
    "Sounds simple enough. I'll be back with this item.",
    "Mask or no mask, I remember you.",
    "You're nothing but a common thief.",
    "You tricked me into helping you, and then you took the relic in broad daylight!",
    "I guess you're just doing your job.",
    "You certainly think a lot of yourself.",
    "I must admit the Entrana heist was well executed.",
    "Er...remind me who you are again.",
    "You tricked me into helping you, and then you took the relic in broad daylight!",
    "No, I really don't remember.",
    "You tricked me into helping you, and then you took the relic in broad daylight!",
    "No, I still don't remember.",
    "Enough of this.",
    "Hey, this is the relic from Entrana!",
    "Idiot! What if it had broken?",
    "Testing my Agility, huh?",
    "I've lost the delivery for Azzanadra.",
    "Oh, so it is.",
    "That relic is stolen from Entrana!",
    "Remind me where we've met before.",
    "That doesn't sound like the sort of thing I'd do.",
    "And with the teleport beacon in place...",
    "Yes, you couldn't have managed without my help.",
    "And with the teleport beacon in place...",
    "About your weapon...",
    "I remember it well.",
    "Where did you get it?",
    "Is it handy having a sword and bow in one weapon?",
    "Never mind.",
    "Urrrrrgh!",
    "I can see why you didn't want your contact coming down here.",
    "Your choice in agents leaves something to be desired.",
    "It was great seeing the assassin again. It was just like old times.",
    "You sent me to collect a stolen relic!",
    "So you admit it!",
    "Oh, so it's originally yours?",
    "Anyway, what now?",
    "I'm not interested, I just want a reward.",
    "Why, what's going to happen?",
    "Are you sure this is a wise thing to be doing?",
    "Yes! Reach out to us, oh great Lord!",
    "Boring! Get on with it!",
    "I'm glad I could help.",
    "It's been a bit of a hassle, actually.",
    "Remind me what this place is.",
    "Tell me about the temple.",
    "And what about the chamber through there?",
    "Tell me about the city.",
    "How do you know that?",
    "Let's talk about something else.",
    "Never mind.",
    "About the ancient hymnal...",
    "I've lost the ancient hymnal.",
    "Oh.",
    "Perhaps. Can I have another one anyway?",
    "Never mind, I'll get it from my bank.",
    "I have some questions about the ancient hymnal.",
    "What are these curses?",
    "How do I use the curses?",
    "How are curses different from prayers?",
    "How do I go back to using standard prayers?",
    "Never mind.",
    "Tell me about Zaros.",
    "So, is Zaros back then?",
    "What plans does Zaros have?",
    "Can't you tell me anything?",
    "Zaros said he needed my help?",
    "Why did Zaros get banished?",
    "I didn't realise it was a matter of luck.",
    "Is Zaros a cat?",
    "Oh, yes, that doesn't make much sense.",
    "Well, there's this cat called Bob...",
    "He hinted that he might be Zaros.",
    "I've only just remembered.",
    "I didn't want you to think I was crazy.",
    "I think he's a Mahjarr-cat!",
    "That's right.",
    "Let's talk about something else.",
    "Can I use the altar here?",
    "Yes, I've read all about the curses.",
    "No, I haven't read it yet.",
    "Tell me about the artefacts I collected.",
    "Tell me about the Frostenhorn.",
    "What does the Frostenhorn do?",
    "Why is it called the Frostenhorn?",
    "If the Frostenhorn is the human name for it, what do the Mahjarrat call it?",
    "Why do you need the Frostenhorn?",
    "Let's talk about something else.",
    "Never mind.",
    "Tell me about the Barrows icon.",
    "What does the Barrows icon do?",
    "How did the Barrows Brothers get the icon?",
    "Why do you need the Barrows icon?",
    "Let's talk about something else.",
    "Never mind.",
    "Tell me about the Entrana relic.",
    "What does the Entrana relic do?",
    "So it helps unlock holy power?",
    "What's a catalyst?",
    "How did the Entrana monks get the relic?",
    "Why do you need the Entrana relic?",
    "About the assassin...",
    "I can see why you didn't want your contact coming down here.",
    "Your choice in agents leaves something to be desired.",
    "It was great seeing the assassin again. It was just like old times.",
    "You sent me to collect a stolen relic!",
    "So you admit it!",
    "Oh, so it's originally yours?",
    "Let's talk about something else.",
    "Let's talk about something else.",
    "Never mind."
  ],
  "Ali the Wise": [
    "Well, all of our research seems to point to the fact that there are two factions of these Mahjarrat. There are those who are loyal to an ancient and mostly forgotten god called Zaros, and those who are loyal to Zamorak.",
    "What is your perception? Do we treat these two factions differently? Where do you stand on these matters?",
    "They do seem to follow a self-proclaimed god of chaos. Zamorakian Mahjarrat, such as Lucien and Zemouregal, clearly pose a significant threat to human civilisation.",
    "But what of the Mahjarrat who follow Zaros?",
    "They follow a self-proclaimed god of chaos. Is that something that appeals your nature?",
    "Do you really think that ignoring Zamorak will cause his followers to show you mercy? His minions rise to power by slaying without discrimination, even others faithful to Zamorak.",
    "Luckily for the rest of us, lust for power often means that Zamorakians can be diverted into self-destructive paths.",
    "But, tell me, what do you make of the god Zaros?",
    "Do you really think that following Zamorak will cause his other followers to show you mercy? His minions rise to power by slaying those who trust them - it was ever so.",
    "Luckily for the rest of us, lust for power often means that Zamorakians can be diverted into self-destructive paths.",
    "But, tell me, what do you make of the god Zaros?",
    "The Zamorakians follow a self-proclaimed god of chaos. Is that something that appeals to the warmonger in you?",
    "Hmmm... Zamorakian Mahjarrat, such as Lucien and Zemouregal, clearly offer an opportunity for a battle or two. By comparison, the Mahjarrat who follow Zaros must seem a bit dull to you.",
    "Hmmm... Zamorakian Mahjarrat, such as Lucien and Zemouregal, clearly offer an opportunity for a battle or two. By comparison, the Mahjarrat who follow Zaros must seem a bit dull to you.",
    "Do you really think that following Zamorak will cause his other followers to show you mercy? His minions rise to power by slaying those who trust them - it was ever so.",
    "Luckily for the rest of us, lust for power often means that Zamorakians can be diverted into self-destructive paths.",
    "But, tell me, what do you make of the god Zaros?",
    "Yes, nothing we've discovered proves that the followers of Zaros are out to cause evil.",
    "If these Zarosian Mahjarrat are opposed to Zamorak, that seems a good thing to me at least.",
    "I'd still be wary of publicly stating loyalty to such a misunderstood deity, though.",
    "But what of Zamorak and his followers? What impression have they left on you?",
    "I agree. Zamorakian Mahjarrat, such as Lucien and Zemouregal, clearly pose a significant threat to human civilisation.",
    "Do you really think that ignoring Zamorak will cause his followers to show you mercy? His minions rise to power by slaying without discrimination, even others faithful to Zamorak.",
    "Luckily for the rest of us, lust for power often means that Zamorakians can be diverted into self-destructive paths.",
    "It cannot have escaped your notice, [Player], that Zaros is banished and largely forgotten.",
    "What makes you so sure of this sudden turnaround in the fortunes of his followers? I would avoid speculating about such things and concentrate on the hard evidence we have.",
    "[Player], have you been paying attention to our research? I would argue that we know more than enough about Zamorak's actions to form an opinion of him.",
    "My belief is that Zamorakian Mahjarrat, such as Lucien and Zemouregal, clearly pose a significant threat to human civilisation.",
    "Zamorakians follow a self-proclaimed god of chaos. Is that something that appeals to the warmonger in you?",
    "Hmmm... Zamorakian Mahjarrat, such as Lucien and Zemouregal, such as Lucien and Zemouregal, clearly wield the power these days.",
    "Well, I must warn you that following Zamorak will not cause his other followers to show you mercy. His minions rise to power by slaying those who trust them.",
    "Luckily for the rest of us, lust for power often means that Zamorakians can be diverted into self-destructive paths.",
    "But what do you make of Zaros and the Mahjarrat who follow him?",
    "I agree. If these Zarosian Mahjarrat are opposed to Zamorak, that seems a good thing to me at least.",
    "It's hard to know if untoward things that one might hear about Zaros are deserved or not.",
    "If one thing is for sure, it's that the followers of Zamorak are the ones causing grave problems in the world today.",
    "I agree. In all honesty, if these Zarosian Mahjarrat are opposed to Zamorak, that seems a good thing to me at least. No offence intended.",
    "Hmm... The Mahjarrat who follow Zaros are something of an enigma. A group that is loyal to a vanished and forgotten god hardly seems a major threat, so why do they persist? In any case, it would be wise not to underestimate the Zarosians.",
    "Yes, but it's often said that it is the victors who write history. If Zaros has been defeated in the past then his vanquishers will not have promoted his virtues.",
    "Perhaps all that is left for us is what the Zamorakians want us to see.",
    "Yes, but it's often said that it is the victors who write history. If Zaros has been defeated in the past then his vanquishers will not have promoted his virtues.",
    "Perhaps all that is left for us is what the Zamorakians want us to see.",
    "It's hard to know if untoward things that one might hear about Zaros are deserved or not.",
    "If one thing is for sure, it's that the followers of Zamorak are the ones causing grave problems in the world today.",
    "Yes, the Mahjarrat who follow Zaros are a bit more of an enigma.",
    "Nothing we've discovered proves that the followers of Zaros are out to cause evil. Either way, a group that is loyal to a vanished and forgotten god hardly seems a major threat.",
    "It's hard to know if untoward things that one might hear about Zaros are deserved or not.",
    "If one thing is for sure, it's that the followers of Zamorak are the ones causing grave problems in the world today.",
    "Oh, actually, when I think about it, there is something that may be of interest to you. I've just been up to an archaeological digsite east of Varrock. I ran into an old contact of mine: Dr Nabanik.",
    "When I mentioned that I was working with someone called [Player], he seemed to have heard of you. He asked if you could head over to the Digsite Exam Centre as he has some work for you.",
    "You will find it to the south-east of Varrock, south of the actual Digsite.",
    "I do have one item that may be of use to you. It will take you to the Digsite just north of the Exam Centre. Here...",
    "Nothing new. Have you spoken to Dr Nabanik yet?"
  ],
  "Dr Nabanik": [
    "Yes, yes, old friend. I've changed a bit since we last met in that pyramid, so I can understand your surprise.",
    "I don't want to attract undue attention.",
    "Shhh! I need you to be more discrete[sic] than this. I thought I could count on you, [Player].",
    "I don't want to attract undue attention.",
    "Well, now you'll never know, will you, Mister/Miss Loudmouth?",
    "Hehe, last time we met I was in a form that might frighten these peasants. I'll give you a hint: how are those Ancient Magicks working for you?",
    "I suppose you'll want to know what's going on here and why Ali has sent you to me.",
    "So, where do you want me to start?",
    "But I am Azzanadra. It is incredible that you do not recall me.",
    "However, I have heard the opinion that humans are a rather forgetful race.",
    "Oh, no matter that you do not recall me giving you the gift of Ancient Magicks after assisting me in that pyramid.",
    "Still, you'll want to know what's going on here and why Ali has sent you to me.",
    "So, where do you want me to start?",
    "Although I was unaware of time passing, it seems I was there for rather longer than you have lived; a change of scene seemed in order.",
    "Though, I did have a visitor after you left - some fool who thought to come and gloat at my predicament. The look on his face made it all worthwhile, while it lasted.",
    "While his face lasted, that is.",
    "The one I adore was torn from me and is resting beyond the veil of life. I simply wish for us to be reunited and the altar here will allow for this.",
    "You could call it a tale of simple devotion over the ages, an old fool's dream.",
    "Oh, we met while he was researching the Digsite and he mentioned your name. With you being involved in both our lives, it seems that maybe you are fated to help us.",
    "That's quite the question after you have seen me in my true form. My folk have something of a deservedly bad reputation, due to the actions of a headstrong minority.",
    "I'd rather not use mind control or mass slaughter here, when diplomacy can be just as beneficial to my aims.",
    "You have the trust of these dabblers. Use your influence and persuade them that I'm trustworthy.",
    "I wish for your aid in getting a restoration certificate which will grant me permission to perform some restorations to the temple beneath these ruins.",
    "Those who have authority here do not trust my motives. I need to repair an altar below ground and use it for a while, after which they can display it to paying visitors. Everyone wins.",
    "All you need to do is persuade the curators that I have the cash to rebuild the place and the historical knowledge to do it properly, and they should issue a certificate for me.",
    "I'm older than any of your human kingdoms and more powerful than you can imagine. My knowledge could wreck civilizations and my wealth rebuild them in splendour.",
    "Be thankful I am also both fair and merciful. Oh, and don't tell them the awkward details of my background, obviously, make up something believable.",
    "I was told to contact the archaeological expert - he's the senior person here. He seems to have the authority, but not the will to aid me.",
    "You have the restoration certificate?",
    "Good. I overheard your comments about me to that supposed expert.",
    "You really can be quite baffling, [player]. Please return with the certificate.",
    "You should be able to get it from Terry Balando, the archaeological expert in the Exam Centre.",
    "You displayed no more or less skill than I would expect from a mortal.",
    "I am delighted to know of your realisation that matters of religion are important to me - more, perhaps, than you realize.",
    "You were better than I expected. Congratulations.",
    "Although my time in the pyramid was not pleasant, you used it to our advantage in your explanations.",
    "Your combination of my background in pyramids and ancient religions was inspired. You distilled down the truth, while excluding minor issues that might have disturbed the expert's sensibilities.",
    "Your combination of my background in ancient magic and religions was inspired. You distilled down the truth, while excluding minor issues that might have disturbed the expert's sensibilities.",
    "While I liked your mention of my links to ancient religions, your other comments weren't quite as impressive.",
    "I can't really say I was impressed with your claims about me.",
    "Why would you be so bumble-headed as to associate me with petrified dung? What sort of maniac will he think I am?",
    "Characterising me as both a miser and some dung-grubber very nearly cancels out the goodwill created by your freeing me from the pyramid.",
    "In any case, I need that certificate you have.",
    "At last my lackeys can start on the restoration work, which is good. Could you meet me down in the temple beneath the Varrock Dig Site so we can discuss the next steps?",
    "Use the winch at the north-east of the site to descend.",
    "It would be remiss of me not to carry a spare rope in this splendid backpack of mine. Here..."
  ],
  "Archaeological expert": [
    "Hello again. I am now studying that mysterious temple and its inhabitants. The markings are strange...",
    "That's the fellow who wishes to do some restoration work to your find, as I remember. He didn't have any paperwork or accreditation, though - claims it was eaten by beetles.",
    "He also said he lost contact with his references while he was busy in some pyramid, which seemed an equally feeble excuse to me.",
    "I certainly can't issue him with a restoration certificate on such flimsy grounds.",
    "I can just about believe that part, but beetles eating his documents?",
    "Well, as his reference, perhaps you can explain about the beetles eating his documentation.",
    "I see. Well, your support does make the story more credible.",
    "You have a point, [Player]. Most of the ancient texts I've uncovered have been engraved on stone tables.",
    "No, paper really doesn't last very long at all.",
    "I suppose I can at least ask you about his credentials. All I require from you is a brief description of his areas of specific study and personal background - for the records, of course.",
    "Hmm, I don't think I have seen any of his work published. Has he been doing this long?",
    "Ahh, I can understand that. Magic and science can be a complex combination.",
    "That's not exactly within the realms of science... I do hope he won't be involved in any cultish activities or dangerous magics.",
    "I'm not sure whether that is good or bad.",
    "I hope so. The most valuable of work is simple enough to explain to peasants.",
    "I hope he hasn't been seduced into seeking his own personal immortality.",
    "So many promising researchers have lost their careers over that red herring.",
    "Thank you for putting my mind at rest; I was quite worried for a moment.",
    "Err, it's amazing what the human mind can find fascinating.",
    "I don't think that will be necessary.",
    "It's actually starting to look promising. All I require from you next is a brief description of his personal background - for the records, of course.",
    "This benefactor is not likely to die and leave Nabanik suddenly poor, I trust?",
    "I do hope you aren't incorrect or I may be asking you to cover any outstanding monies.",
    "I have heard of that sort of money-making scheme, but never tried it.",
    "Something about Varrock, or so I heard?",
    "An entrepreneur, then? Excellent!",
    "Extraordinary, indeed, if it gives him the cash required for major building works.",
    "I only wish I could be as frugal.",
    "That's an area I could see benefitting from further study. Do you know which areas he is most interested in?",
    "I hope this yields valuable new information.",
    "I hope this wasn't through the pillaging of ancient sites?",
    "Excellent! So many people see archaeology as a way to gain money.",
    "It is refreshing to see someone willing to spend money in the cause of research.",
    "Yes, it seems my suspicions about him were incorrect. He'll need a restoration certificate. Here...",
    "Then let us say no more about the matter.",
    "Hmm, Dr Nabanik has my permission. I'm not sure what else you were after?",
    "That's not very professional, [player], but I suppose I can provide you with another. Here..."
  ],
  "Digsite workman": [
    "So many long years in the desert, but not once did I doubt Azzanadra's return!",
    "They banished our god, imprisoned our hero and took all that we had!",
    "But times are changing, Oh, yes, indeed.",
    "Helping our hero, Azzanadra, restore this temple to our god.",
    "It is good and noble work!",
    "Azzanadra has returned to us! He shall lead us from the desert waste and restore us to our rightful place in history.",
    "At last, our people can flourish again!",
    "Do you not recall us from the Bandit Camp in the desert?",
    "I can remember you quite clearly. I suppose I'd have been just another bandit to you though.",
    "Helping our hero, Azzanadra, restore this temple to our god.",
    "It is good and noble work!",
    "Azzanadra has returned to us! He shall lead us from the desert waste and restore us to our rightful place in history.",
    "You are not here to take our tools are you? Only they seem to go missing all the time.",
    "Well, you can't have them! I have far better things to do than ferry more tools across the world.",
    "Okay. It's just that I'll have to answer to Azzanadra if anything else goes missing.",
    "No offense, but it always seems to be when there's adventurers like you about.",
    "Not that I'm saying you'd steal anything. Of course, I'm sure it's just a coincidence.",
    "Helping our hero, Azzanadra, restore this temple to our god.",
    "It is good and noble work!",
    "Is it you? The one who freed Azzanadra?",
    "I did not believe that a mere adventurer could have brought Azzanadra to freedom.",
    "Oh. I thought I saw you at the Bandit Camp around the time that he was freed. A case of mistaken identity, I guess.",
    "He is the hero of my tribe and the chosen one of our god.",
    "Even as we speak, he makes plans to restore the link to our god and return us to glory!",
    "Helping our hero, Azzanadra, restore this temple to our god.",
    "It is good and noble work!",
    "Azzanadra has returned to us! He shall lead us from the desert waste and restore us to our rightful place in history."
  ],
  "Azzanadra": [
    "As you have gained the permission we needed, my lackeys can start on the restoration work now, which is good.",
    "It will take some time for them to accomplish this, even under my superb direction.",
    "Actually, I could make good use of your services in the interim.",
    "Actually, I could make good use of your services in the interim.",
    "Very well, but see that you return to me. I cannot complete the restoration without your assistance.",
    "While the construction continues, I have some rather more dangerous challenges for you.",
    "More accurately, it is a pair of challenges: one in Morytania and the other in the far north. In both cases, I need an object of ancient power.",
    "You need to get an ancient icon from the Barrows. It absorbs the power of prayer.",
    "Imagine, with so many deperate[sic] adventurers passing through there, how many prayers have been uttered within those gloom-ridden tombs.",
    "After all this time in that foul place, the icon will surely be a powerful article of prayer by now. Retrieve it!",
    "The mission in the north has already bested one of my most loyal contacts. He was sent to retrieve an ancient item, the Frostenhorn, from a snow-buried fortress.",
    "To get to the fortress, I believe you can take transport from the West side of a peninsula in the North of the Fremennik Province.",
    "Indeed, and ice can form a barrier so impenetrable that it may as well be iron.",
    "Nevertheless, ice can form a barrier so impenetrable that it may as well be iron.",
    "The last thing I received from my unfortunate contact was from a messenger who delivered his ruined backpack to me. Here...",
    "Take a look at the contents and tell me what you make of it.",
    "Let's discuss your missions to see if I can offer you any advice.",
    "You need to get an ancient icon from the Barrows. It absorbs the power of prayer.",
    "Imagine, with so many deperate[sic] adventurers passing through there, how many prayers have been uttered within those gloom-ridden tombs.",
    "After all this time in that foul place, the icon will surely be a powerful article of prayer by now. Retrieve it!",
    "The Barrows Brothers are unlikely to yield the icon freely. They have been told to guard it well.",
    "It is fascinating how mindlessly they follow Zarosian orders since they became cursed. If only their orders had included returning the icon peacefully when asked, your task would be a lot simpler.",
    "To ensure you get the icon, you should defeat every brother before raiding their chest. That way, none of them will be able to conceal it.",
    "The mission in the north has already bested one of my most loyal contacts. He was sent to retrieve an ancient item, the Frostenhorn, from a snow-buried fortress.",
    "To get to the fortress, I believe you can take transport from the West side of a peninsula in the North of the Fremennik Province.",
    "Indeed, and ice can form a barrier so impenetrable that it may as well be iron.",
    "Nevertheless, ice can form a barrier so impenetrable that it may as well be iron.",
    "The last thing I received from my unfortunate contact was from a messenger who delivered his ruined backpack to me. The contents of the backpack should prove useful in getting inside the fortress.",
    "I'm uncertain what perils you'll face, but I did notice that the backpack I gave you was charred. Could there be dragons near the frozen fortress?",
    "Perhaps the backpack holds more information.",
    "That's certainly something to think about, then. I know he was well stocked with combat runes, so he must have needed runes for something else.",
    "It's on the northern coast. I believe you can obtain transport from the west side of a peninsula in the north of the Fremennik Province.",
    "Of course, if you want a more dangerous route, you can also enter from deep in the Wilderness, but I strongly recommend the safer passage.",
    "Then it's lucky for you that it was returned to me. Here...",
    "Nonsense, I can sense you are carrying it right now.",
    "It was an ancient Mahjarrat stronghold. It still is, at times.",
    "Yes. I have not discussed this with you before, but there is a secret to the long lives us Mahjarrat lead.",
    "Why? To defend against other Mahjarrat. I have not discussed this with you before, but there is a secret to the long lives us Mahjarrat lead.",
    "There is a ritual that rejuvenates all the Mahjarrat nearby.",
    "It is at a cost though: one Mahjarrat must be sacrificed so that the others may live on.",
    "The frozen fortress is near to the ritual site, and is one of the battlegrounds upon which the sacrificed Mahjarrat is chosen.",
    "You do? But how? Perhaps I have underestimated you. Well, you can see why the fortress is significant.",
    "Ah, you have a keen mind; you would have been of great service to Zaros's strategists during the long years of the war.",
    "Jhallan lives? Oh, blessed Zaros!",
    "Well, now, if he's in good condition, then we Zarosian Mahjarrat are in an even stronger position than I had imagined.",
    "I must admit, I have been critical of him in the past, but, on reflection, Jhallan has always been loyal to Zaros and is such a warrior.",
    "I fancy that the Barrows Brothers could learn a trick or two from him.",
    "I would agree that he could sometimes be a little rude and sneaky, so he had trouble fitting in with the other Zarosian Mahjarrat.",
    "In honesty, we believed he would turn and side with Zamorak as soon as the opportunity arose, but he did not! He is a true Zarosian, sir/madam!",
    "Oh, that does not bode well for the upcoming ritual. I can only pray he makes it through. I shall aid him where I can, as Zarosian brothers should.",
    "Oh, you cannot know how much it pains me to hear that. Although I may have been critical of him in the past, he was fiercely loyal to Zaros. A good warrior in his day, too.",
    "I would agree that he could sometimes be a little rude and sneaky, so he had trouble fitting in with the other Zarosian Mahjarrat.",
    "In honesty, we thought he would turn and side with Zamorak as soon as the opportunity arose, but he did not. He was loyal to the very end, sir/madam!",
    "You make for a confusing ally, Player. Nevertheless, I shall tell you of our rite. There is a ritual that rejuvenates all Mahjarrat nearby.",
    "It is at a cost, though: one Mahjarrat must be sacrificed so that the others may live on.",
    "The frozen fortress is near to the ritual site, and is one of the battlegrounds where the Mahjarrat to be sacrificed is chosen.",
    "Hmm. Does that work for humans? Only temporarily, I think.",
    "We Mahjarrat have a ritual that rejuvenates all nearby Mahjarrat,",
    "It is at a cost, though: one Mahjarrat must be sacrificed so that the others may live on.",
    "The frozen fortress is near to the ritual site, and is one of the battlegrounds where the Mahjarrat to be sacrificed is chosen.",
    "I cannot divulge too much at present, but which artefact would you like to know about?",
    "Ah, the Frostenhorn. The knowledge of its power is something to be earned, not freely given.",
    "If you return here with it then I will reward your effort and explain its cosmic purpose to you.",
    "The fearsome Barrows Brothers have for so many centuries been the sentinels of a holy icon. Let us call it the Barrows icon, for, in truth, I do not think the artefact has a human name.",
    "It is a powerful artefact of prayer, but I will explain more of its purpose when you return with it.",
    "Er, I can sense you carrying it right now.",
    "And what did you make of what my contact wrote?",
    "My contact is of razor wit. I have little doubt that he is capable of solving even the most devilish of conundrums.",
    "Perhaps you should read the letter again to understand what problems he encountered.",
    "Well, he doesn't mention creatures, but I must admit the state of the ruined backpack suggests vicious fauna in that area, possibly even dragons.",
    "My contact is a strong fighter, but even the strongest of warriors needs to withdraw and sleep eventually.",
    "That's just it, I know that he always carries an abundance of runes for combat. The only explanation is that he needed runes for something other than combat.",
    "Yes, that sounds like an apt summary.",
    "Oh, really? That's easy to say if you know what you will need runes for.",
    "I know that he always carries an abundance of runes for combat, but if he needed runes for something else, he may have run in to[sic] difficulty.",
    "Nonsense! I can sense you are carrying it right now.",
    "Then it's lucky for you that it was returned to me. Here...",
    "Would you like me to tell you about this temple, or Senntisten, the city that once stood above us?",
    "Ah, that is a painful point of discussion. Do you recall that my Lord, Zaros, was banished long ago, and that locked away in some distant plane he was unable to communicate with us?",
    "When that happened, we created a communication portal in this temple allowing us contact with our Lord. It was more successful than I dared hope, [Player]!",
    "I used to hear him all the time - in my head, guiding me, bringing me strength and wisdom.",
    "But no longer. This temple was clearly destroyed by our enemies. Without the communication portal, Zaros is too distant to be heard, locked in a cold and empty existence in some desolate plane. In the vast expanse of the universe he cannot find his faithful.",
    "But by restoring this temple and altar, and gathering powerful holy artefacts within, Zaros shall be able to sense us and communicate with us once more, and we shall harken unto him!",
    "And then he shall advise me how best to aid his return. What a wondrous day that will be...",
    "Do you mean the crypt? It was a resting place for Zaros' most loyal followers.",
    "It is infested with skeletons now. That's what happens when burial sites are desecrated, of course.",
    "Above us, long ago, stood the glorious city of Senntisten. Huge towers loomed over the pass leading to Morytania, giant stone sentinels watching over the prize of Zaros's empire.",
    "T'was the crowning jewel of Zarosian civilization. Oh, if only you had witnessed Zaros's finest city, drenched in splendour as it was!",
    "Or perhaps it is better you did not witness it, for it saves you the grief and sorrow of seeing it razed.",
    "It was not long after Zaros was banished, and a communication portal constructed, that I became trapped in that pyramid. At that time, Senntisten was still exuberant and well defended.",
    "Goodness only knows what befell the troops and citizens, but we can safely assume they didn't give up without a fight.",
    "When defenders submit, their city is often taken over, but when they fight to the death, their city is typically destroyed.",
    "Yet there are those who would claim that war is an artform. Fools they are, and fools they remain. By their bloodlust they are blinded to beauty, deafened to melody, and numbed to sanctity!",
    "So, how are the missions going?",
    "How splendid. Let me see what you have.",
    "Splendid! The Barrows Brothers will be furious with you, of course. They have guarded it well, and for so long, but you can clearly handle them without concern.",
    "A magnificent effort on your part, [Player]!",
    "Now, let me see...",
    "Oh my, it is better than I had hoped... I knew that, under the protection of the Barrows Brothers, the power of this icon would not fade.",
    "But it is now much stronger than I recall. A great many adventurers must have uttered their dying prayers in the Barrows, and the icon has drawn all that holy power in.",
    "Wonderful! This shall be an irresistible beacon unto my Lord!",
    "So...here it is. The Frostenhorn has proved so troublesome to obtain.",
    "So many of my contacts have tried, and failed, to bring it to me.",
    "Yet you, [Player], have proven yourself skilled beyond any mere adventurer. My eternal thanks.",
    "Now, let me see... Yes, it shall do the task it was designed to do, as I expected.",
    "How can I explain this in human terms? It's like a magnifying glass for power.",
    "It was in an icy area, up in the north, and so it magnified that, allowing the fortress to remain frozen.",
    "I dare say that were you to return to the fortress you would find it thawing.",
    "In any case, I shall need this power of magnification to reach out to my Lord.",
    "That is the human name for it. Or rather, the Fremennik name. Humans have only ever witnessed its power in frozen lands, so they assumed the power it hold is that of ice.",
    "However, we Mahjarrat know better. Not only do we know what it does, we also know how to harness its power.",
    "I shall do you a service, [Player], and not tell you. For, were your ears to hear its true name, terrible and primeval as it is, they would melt from the side of your head.",
    "How much power does a mere name hold? I pray you never need to find out.",
    "What a strange place to leave such a magnificent item. Please bring it hither.",
    "How wonderful. Now, almost all we need is gathered.",
    "Fear not, there is no more gathering of items for you. Another of my illustrious contacts is making their way here with the final item.",
    "Calm yourself, and remember who you are addressing. No, the final artefact is being delivered by one of my more...respectful contacts.",
    "No such luck. I want you to go topside and collect the delivery. I can't risk going out, and the contact isn't one I'd like poking about in here.",
    "The contact should be waiting by the winch that leads down here.",
    "Ah, hello, most devoted assistant. Your reward is not far away now that those artefacts are replaced. There is just one more simple task.",
    "I just want you to go topside and collect a delivery. I can't risk going out, and the contact isn't one I'd like poking about in here.",
    "The contact should be waiting by the winch that leads down here.",
    "Ah! You have the relic?",
    "What is this?",
    "Those power-grabbing buffoons! See how they have desecrated this relic?",
    "Carving the insidious mark of their idiot god into this venerable stone? They never miss a trick, those Saradominists.",
    "Indeed. I'm sure he's an honourable agent, but why take the risk?",
    "The less he knows about the artefacts down here, the less likely he is to be tempted.",
    "He was not my choice, [Player]. Indeed, it was one of my Zarosian brothers who comissioned[sic] him to retrieve our relic from Entrana.",
    "Who would you have chosen for the task? Did the assassin not manage to complete his mission? It seems to me he was the perfect choice for the job.",
    "Perhaps the two of you have much in common. I hope not too much, though, for he is hired, as is his loyalty and allegiance.",
    "You may only depend upon such people while you pay them well, and to consider them an ally or friend would be a grave error.",
    "However, such people do have a knack for getting things done.",
    "Yes, you are quite right.",
    "Of course. I am happy to admit that the relic was stolen from this very temple long ago.",
    "This age-battered stone belongs only to Zaros. The assassin deserves our thanks for liberating it from those light-fingered Saradominists.",
    "My only regret is that we did not recover it before those imbeciles decided to carve Saradomin's crude mark upon it.",
    "When Zaros sees that, well...let's just say it would be a good day to be a great distance away from any Saradominist lands.",
    "[Player], how well you have done to congregate these relics in this place.",
    "And now you shall see the fruits of your labour.",
    "Ah, you really do not understand. The reward I shall give you is but a raindrop in a river when compared with the reward you shall receive from my Lord.",
    "It is simpler to show you than to explain it.",
    "Empty your mind of all your concerns and watch what unfolds before you.",
    "Oh, fortuitous day! The years I have waited!",
    "Accept theses[sic] sacraments, Lord, as keystones to your might.",
    "We gather here that thou may gaze upon our insignificance, and take pity upon thy servants.",
    "We beseech thee, reach out to this plane, thy plane, and once again restore thy order, thy justice, and thy might.",
    "Be not afraid, [Player]. The true Lord will favour you well, I am certain.",
    "Very good, [Player]. The true Lord will favour you well, I am certain.",
    "Hold thy tongue, [Player]! I will not have you ruin centuries of planning!",
    "In this, thy temple, we submit these tithes of power. Accept these humble offerings and commune with us once more.",
    "My Lord Zaros! The link is finally restored!",
    "Scattered, Lord, across the lands, while Zamorak maintains a stranglehold on the turncoats.",
    "...",
    "You are right, Lord. It won't be long before the whole world knows the link has been restored. We must move swiftly.",
    "Oh, fortuitous day! To commune with my true Lord once more! My boundless appreciation is yours.",
    "And it is time to give you rewards befitting such noble and honourable service.",
    "Of course... You do not have the same dedication to my Lord as I do.",
    "No matter, it is time to give you rewards befitting such dutiful service.",
    "You have returned, faithful one.",
    "Would you like me to tell you about this temple, or Senntisten, the city that once stood above us?",
    "Do you recall that my Lord, Zaros, was banished long ago, and that locked away in some distant plane he was unable to communicate with us? When that happened, we created a communication portal in this temple allowing us contact with our Lord. It was more successful than I dared hope, Player! I used to hear him all the time - in my head, guiding me, bringing me strength and wisdom. This temple was clearly destroyed by our enemies. Without the communication portal, Zaros was too distant to be heard, locked in a cold and empty existence in some desolate plane. In the vast expanse of the universe he could not find his faithful. But by restoring this temple and altar, and gathering these powerful holy artefacts within, Zaros is able to sense us and communicate with us once more, and now we shall harken unto him! He shall advise me how best to aid his return. What a wondrous day this is!",
    "Do you mean the crypt? It was a resting place for Zaros' most loyal followers. It is infested with skeletons now. That's what happens when burial sites are desecrated, of course.",
    "Above us, long ago, stood the glorious city of Senntisten. Huge towers loomed over the pass leading to Morytania, giant stone sentinels watching over the prize of Zaros's empire. T'was the crowning jewel of Zarosian civilisation. Oh, if only you had witnessed Zaros's finest city, drenched in splendour as it was! Or perhaps it is better you did not witness it, for it saves you the grief and sorrow of seeing it razed. It was not long after Zaros was banished, and a communication portal constructed, that I became trapped in that pyramid. At that time, Senntisten was still exuberant and well defended. Goodness only knows what befell the troops and citizens, but we can safely assume they didn't give up without a fight.",
    "When defenders submit, their city is often taken over, but when they fight to the death, their city is typically destroyed. Yet there are those who would claim that war is an artform. Fools they are, and fools they remain. By their bloodlust they are blinded to beauty, deafened to melody, and numbed to sanctity!",
    "Very well, you may have another. The hymnal itself is of no value unless Zaros has granted you his power.",
    "I'm sure I can sense an ancient hymnal in your inventory.",
    "Are you sure you haven't simply put it in your bank?",
    "Very well, you may have another. The hymnal itself is of no value unless Zaros has granted you his power.",
    "Read the hymnal first, then we can discuss it.",
    "These curses are similar to the prayers that humans are so fond of. Ah, but they are so much more!",
    "Why, simply pray at the altar in this temple and allow the chanting voices of Mahjarrats past to fill your mind. You'll then find that, with your prayers forgotten, you can use the curses instead.",
    "To the ungodly they perhaps seem similar, but prayers are to curses as lambs are to lions. Prayers are all about saving your petty, bleating hide, while curses are about rending your enemies with devastating force. And so, you'll notice that while curses may offer you less protection, they more than make up for this by damaging your enemy. Some curses will even do both!",
    "And turn your back on the glory of Zaros? How strange you humans are. Should you wish to commit such folly, then praying at any altar will give you an option of returning to your tired old prayers. But remember, if you then wish to use curses again, you will need to return to this altar and worship Zaros once more.",
    "What is it you wish to know?",
    "Not yet, no. I can merely communicate with him once more. But that is no small achievement, [Player]! For now he can give me instructions, and I shall carry them out to aid his return. Soon the world shall be bathed in the glory of Zaros once more!",
    "Regretably, I am under strict instructions to conceal Zaros's magnificent scheme.",
    "I can say that you should ensure no mishaps befall you. Zaros requires you very much in one piece. It is to this end that I have provided you with his hymnal, so that you may defeat your foes with more ease.",
    "Er...something like that. In any case, you are most definitely needed.",
    "Why? Simply because of Zamorak's lust for power. That feeble usurper got lucky that day. When Zaros and Zamorak did battle, both were impaled on the accursed Staff of Armadyl, and it really could have gone either way. But it was Zaros who was banished, while Zamorak became stronger than ever. It will take a great deal of work to undo that unlucky roll of the dice.",
    "Hmm. No doubt you have heard a Zamorakian version of events. Well, now you have heard the Zarosian side of the story too. You can decide for yourself which faction is more trustworthy.",
    "Oh dear. Have you had a nasty knock on the head? Or perhaps you haven't listened to a word I've said.",
    "Hmm. Of course. A cat told you that he was Zaros. I cannot think why you failed to mention this before.",
    "If I may offer some words to the wise, young [man/lady]? Do not get your information from a talking cat.",
    "Well, it's a little late to worry about that now, isn't it, [Mister/Mistress] Cat-whisperer? If I may offer some words to the wise, young [man/lady]? Do not get your information from a talking cat.",
    "I don't quite follow... Ah, I think I see. A Mahjarrat cat?",
    "In that case, allow me to offer some words of advice, Player... Do not abandon your adventuring to become an entertainer. It really won't end well for you.",
    "Certainly, you may. You'll find it considerably more effective than other altars. Have you read the ancient hymnal yet?",
    "Then you'll know at this altar you can allow the power of Zarosian curses to fill your mind, replacing your prayers. Remember, you can pray at any altar to return your standard prayers, but you must visit this altar again if you wish to use the curses.",
    "Surely you jest. To have such power at your fingertips yet ignore it? How very human.",
    "You have indeed earned the knowledge. What would you like to know about?",
    "Certainly. Is the Frostenhorn not wondrous? It has proved so troublesome to obtain, though. So many of my contacts have tried, and failed, to bring it to me. Yet you, [Player], have proven yourself skilled beyond any mere adventurer. My eternal thanks. And as I had hoped, it is in wonderful condition. It shall play its part well.",
    "How can I explain this in human terms? It's like a magnifying glass for power. It was in an icy area, up in the north, and so it magnified that, allowing the fortress to remain frozen. I dare say that were you to return to the fortress you would find it thawing.",
    "That is the human name for it. Or rather, the Fremennik name. Humans have only ever witnessed its power in frozen lands, so they assumed the power it hold is that of ice. However, we Mahjarrat know better. Not only do we know what it does, we also know how to harness its power.",
    "I shall do you a service, [Player], and not tell you. For, were your ears to hear its true name, terrible and primeval as it is, they would melt from the side of your head. How much power does a mere name hold? I pray you need never find out.",
    "My Lord is banished, distant and trapped, by those who fear his majesty. So remote is he that I cannot communicate with him, but I know he will have a plan, a path to return to his rightful glory. With the Frostenhorn enhancing the power of his temple, I shall be able to converse with him once more. He will guide me, and I shall do whatever he needs.",
    "Splendid work you did there, [Player]! The Barrows Brothers will be furious with you, of course. They have guarded it well, and for so long, but you can clearly handle them without concern. As you may recall me saying, it is better than I had hoped. I knew that, under the protection of the Barrows Brothers, the power of this icon would not fade. But it is now much stronger than I recall. A great many adventurers must have uttered their dying prayers in the Barrows, and the icon has drawn all that holy power in.",
    "It is a powerful artefact of prayer. It draws in prayer power, just as metal draws in heat.",
    "It was no accident. An ally from the old days placed it in their care while I was trapped in that forsaken pyramid. And it is good that they did so! The prayer energy it held needed to be preserved until this very day, when I would be able to use it to communicate with my Lord once more. The Zamorakian Mahjarrat would have destroyed the icon, given the chance, but happily they never found it. The accursed state of the Barrows Brothers has allowed them to conceal it from the Zamorakians. It's very much in their territory, and they never thought to look right under their own noses!",
    "For my Lord, banished and remote, to communicate with me, first he must be able to find me. After all this time in the Barrows, the icon has absorbed so much prayer power that it will be an irresistible beacon unto my Lord.",
    "Ha! Storms raged through my mind when I saw what the Saradominists had done to the relic. Still I feel a terrible wrath when I think upon it.",
    "As odd as this may sound, it acts as a catalyst for prayer energy.",
    "Oh, well done, Player. Indeed.",
    "In this sense, a catalyst is something that accelerates change. So instead of the Barrows icon emitting its prayer power slowly, with the Entrana relic nearby it will give off brilliant pulses of prayer energy.",
    "Oh, who knows what depths they would stoop to just to grab power for their paltry deity. Well, they may have taken the relic, but they didn't have the knowledge of how to use it. After all, by itself the relic can achieve very little. It is only around an item of significant holy power that it has a noticeable effect. You'll have likely notice that the monks on Entrana didn't realise that, which only goes to show how puny Saradomin's might must be.",
    "Ah, it is the last artefact I need to finally communicate with Zaros once more. This relic, when aside the Barrows icon, will allow the icon to create dazzling pulses of prayer energy. That pulsing energy is magnified by the Frostenhorn to penetrate the darkest, most remote planes of existence. Planes that have never seen light and where nothing exists. My beacon to Zaros will cut through these miserable pockets of reality and, wherever my Lord is, we will be able to communicate again. Hear me, Player: with these artefacts there will be no place that has not been bathed in holy power in Zaros's name!",
    "Indeed. I'm sure he's an honourable agent, but why take the risk? The less he knows about the artefacts down here, the less likely he is to be tempted.",
    "He was not my choice, Player. Indeed, it was one of my Zarosian brothers who commissioned him to retrieve our relic from Entrana. Who would you have chosen for the task? Did the assassin not manage to complete his mission? It seems to me he was the perfect choice for the job.",
    "Perhaps the two of you have much in common. I hope not too much, though, for he is hired, as is his loyalty and allegiance. You may only depend upon such people while you pay them well, and to consider them an ally or friend would be a grave error. However, such people do have a knack for getting things done.",
    "Yes, you are quite right.",
    "Of course. I am happy to admit that the relic was stolen from this very temple long ago.",
    "This age-battered stone belongs only to Zaros. The assassin deserves our thanks for liberating it from those light-fingered Saradominists. My only regret is that we did not recover it before those imbeciles decided to carve Saradomin's crude mark upon it. When Zaros sees that, well...let's just say it would be a good day to be a great distance away from any Saradominist lands."
  ],
  "Assassin": [
    "Well, well. Aren't you popping up all over the place?",
    "As well you should. Despite my stealth, I cannot conceal my reputation as a master assassin and burglar extraordinaire.",
    "Ah, still bitter about the Entrana relic?",
    "I'll take that as a 'Yes', then.",
    "Job? This is a way of life. To hone skills to my level, you need more dedication than that of a mere servant.",
    "And so I should. With my impeccable planning and elite skills, you never really stood a chance.",
    "But of course it was. With my impeccable planning and elite skills, you never really stood a chance.",
    "Oh, the very nerve! To fein[sic] ignorance of my skill and reputation.",
    "Unless... do you truly not recall our last encounter?",
    "Or are you just bitter about the Entrana relic?",
    "So, you do remember. Then listen well to what I say.",
    "Those fools on Entrana would not know the power of this relic if it split their petty island in two!",
    "Then let me remind you. You crafted me this fine weapon...",
    "And you were fooled in to planting a teleport beacon on the altar at Entrana...",
    "...which allowed me to teleport in and take their precious relic.",
    "So, you do remember. Then listen well to what I say.",
    "Those fools on Entrana would not know the power of this relic if it split their petty island in two!",
    "Really? Perhaps you've been spending too much time drinking in Keldagrim!",
    "The signifcance of this meeting will be lost on a mindless fool like you.",
    "Very well, think fast!",
    "Smoothly done. I shall have to keep my eye on you...",
    "Wow! I wasn't expecting that!",
    "Oh is it? Is it really? Such typical arrogance!",
    "Sure, you've only ever known it to be on Entrana. Do you think it's always been there? Since the very dawn of days?",
    "You think that Saradomin was here, in the beginning, and gifted his followers with the relic?",
    "Pah! I think it would be best to deliver this to Azzanadra and see what he has to say on the matter.",
    "Well, you know what they say: 'You snooze, you lose.'",
    "Well, it's always good to be on the lookout for potential students.",
    "And for potential threats, too.",
    "What do you want boy/girl?",
    "Did you really think you could fool me? It's in your inventory!",
    "Fool! It is a good thing I followed you and recovered the relic.",
    "Well, here it is again. Try not to be so careless this time...",
    "Oh, is it? Is it really? Such typical ignorance!",
    "You helped me steal a holy relic from the priests of Entrana.",
    "Ha! As if you had a choice.",
    "Of course, you didn't mean to help me. A little trickery was involved to get you to place a teleport beacon next to the relic.",
    "Truly, there is one born every minute.",
    "Ha! Don't kid yourself.",
    "Think you're the only person in the world who wonders around trying to help people? Well, think again.",
    "Any adventurer would have placed the teleport beacon next to the relic for me. Truly, there is one born every minute.",
    "I was able to sweep in and take the relic. It was over before it had even begun.",
    "Ah, that was a good day.",
    "Well, it was fashioned by your own hands. I'd be worried if you didn't remember it.",
    "In any case, it has served me well.",
    "Er, from you, of course.",
    "Perhaps you don't recall making it.",
    "In any case, it has served me well.",
    "Yes, but I've heard of an even more useful weapon which I may try to obtain myself.",
    "They say there is a band of mystics who can make a weapon from something called sacred clay.",
    "While it has energy, this weapon will transform in to[sic] a scimitar, a bow or even a magic staff.",
    "In my profession, it's good to be able to adapt to any situation, especially in combat."
  ],
  "High Priest": [
    "Argh! Look out, he's/she's got a boulder!"
  ],
  "Communion portal": [
    "...zzaannaaa..rraaa...",
    "...aazzaannaaaddra...",
    "Azzanadra... have I found my faithful?",
    "I did not... doubt your.. dedication. What of... your brothers?",
    "Azzanadra... your good work here... will have attracted attention.",
    "Come closer... that I may give your instructions... which others must not know of."
  ],
  "Dark mage": [
    "The portal seems a little... unsettled today.",
    "Oh! What? The portal...",
    "That was a close one. Nearly lost the universe there."
  ],
  "Monk of Zamorak [1]": [
    "Ah, brother, is it not a fine day to scheme against our enemies?",
    "Zamorak would delight in your anger brother!",
    "What has befallen us? The statue of Zamorak...",
    "Well, we shall have our revenge, brother. Come, we have plans to make."
  ],
  "Monk of Zamorak [2]": [
    "Is it? I have been kept up half the night by those idiot goblins.",
    "Must they make so much noise as they squabble? They make terrible neighbours.",
    "Brother, the very earth shakes!",
    "It is ruined! This is clearly the work of the Saradominists."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:The_Temple_at_Senntisten?oldid=35841258’"
  ]
}