{
  "Main article": [
    "Transcript:Desperate Times § Post-quest dialogue"
  ],
  "Brundt the Chieftain": [
    "We can't just keep sitting here waiting for something to happen. Kerapac has stolen the Needle right from under us.",
    "Seren? What can you tell us?"
  ],
  "Garlandia": [
    "If only someone had spoken up about his inevitable betrayal and encouraged us to follow a path of peace.",
    "Sorry,yes,[sic] you're right. Now is not the time for infighting, we need to be united.",
    "I'm not sure anyone deserves that. To be bound to serve the Elder Gods against his will. When he's spent so long fighting them.",
    "I would think death would be preferable."
  ],
  "Commander Zilyana": [
    "Oh? Like you did? Oh wait, no, no you didn't. Sanctimonious as ever Garlandia. You Godless are all alike.",
    "Of course, yes, my apologies. We should save our rage for Kerapac not each other.",
    "Getting angry at the World Guardian, the council's chosen agent to stop all of this, isn't constructive.",
    "Hmmm, I wonder who else would happily wipe out entire continents just to protect themselves.",
    "You know, the sort of person who would turn a rich and vibrant region into a scorched wilderness?"
  ],
  "Seren": [
    "Everyone please, be calm.",
    "We need to work out what Kerapac's plan is before we can stop him.",
    "Forgive me my friends, please talk among yourselves, I must speak to the World Guardian about the situation.",
    "Player, it is good to see you. As you can see, we need to hurry.",
    "Mah's gift to me, my aura. It compels them to trust me, to need me. The longer we deliberate the more bound they are because of it.",
    "Just look how they blindly follow whatever I say. Their moods shift in an instant because they cannot bear disagreeing with me.",
    "Does it not? Each member of the council is here because they bring something unique to the table.",
    "I am glad you see the danger. Each member of the council is here because they bring something unique to the table.",
    "A different point of view. But now, the only viewpoint offered is mine.",
    "I am not all knowing. I am not all seeing. I am a goddess, yes, but sometimes even gods make mistakes.",
    "We are facing the ultimate destruction of all life on Gielinor, possibly the universe.",
    "I am not mortal. I do not fully understand what it means to be mortal. So my voice cannot be the only one to speak for them.",
    "But with each day that passes the stronger they are bound to me.",
    "We need to deal with this threat now, before the effect becomes too powerful.",
    "The matter is quite urgent, Player, when you have time please come speak to me again.",
    "Thank you, Player, I can always count on you.",
    "After Kerapac's betrayal, Thok and Charos wanted to track him down. With the council's permission I sent them on to Anachronia.",
    "They've been sending regular reports and it sounds like Charos has discovered Kerapac's hideout, but needs some help.",
    "I know of none other than yourself that I could trust to help them and I suspect you too might have your own reasons for wanting to find Kerapac.",
    "A worthy goal. If we can understand what he's up to, we'll be better placed to stop him.",
    "Or...if he's right...assist him.",
    "Violence is rarely the answer. But sometimes it's unavoidable.",
    "He has stolen an elder artefact at a time when we needed cohesion. I fear you may have little recourse but violence.",
    "Be wary that he may not listen. Still it's a noble goal to try diplomacy first.",
    "As sad as I am to hear that, it saddens me more to tell you I suspect he does not want you.",
    "You should head to Anachronia and speak with Mr Mordaut there. Mr Mordaut has been keeping an eye on the island for us and will likely know where Charos and Thok are.",
    "Good luck, World Guardian. Gielinor's fate is in your hands.",
    "Player, will you help us put an end to Kerapac's treachery?",
    "You need to return to Anachronia, your allies there are waiting for you.",
    "It is not yet the time for violence. Whatever Kerapac is up to, we cannot risk tipping his hand and forcing him to move his plan forward.",
    "This is a delicate affair and we need to show restraint.",
    "World Guardian, leave them to their arguments and come speak with me.",
    "Hello again, Player, I hope you are here with good news?",
    "As you can see, time is of the essence.",
    "Ah, yes, I was worried that would be the case. The Needle is one of the most powerful artefacts. Its ability to control time makes it almost unstoppable.",
    "Yes. Unfortunately we don't know much about the Needle. We don't know its strengths or weaknesses.",
    "Fortunately, we do know someone who might.",
    "Indeed, the Needle's former host, Gail. Known now, and before, as Primrose.",
    "If there are any answers to be had, then I imagine that she will be the one with them.",
    "Go and speak to Primrose, she might know something about the Needle we can use.",
    "I don't suppose Primrose knows how to do that?",
    "How unfortunate. I had hoped...well, I suppose that leaves us with no other choice.",
    "I had wanted to not involve them, to avoid risking their ire, but we are out of options.",
    "If we want to know how to stop an elder artefact, we will need to speak to its creator.",
    "Get your affairs in order Player, it's time we bring you face to face with the most powerful being in existence.",
    "Meet me outside the Heart of Gielinor. I shall arrange an audience with Jas.",
    "We are out of options. They may be the only ones who can stop this.",
    "But these negotiations are going to be difficult, we cannot afford mistakes.",
    "One wrong move and Jas could decide to end this world once and for all.",
    "So be on your best behaviour.",
    "Meet me outside the Heart of Gielinor. I shall arrange an audience with Jas.",
    "Hello, Player. I have spoken with my aunt. She is willing to listen to what we have to say.",
    "Be careful with your tone, remember who these are. The creators of the universe.",
    "If we say the wrong thing, if we upset them, it's not just our lives that are in danger.",
    "The fate of the entire universe could well be in our hands.",
    "Are you ready?",
    "Take your time, but try not to take too long.",
    "You handled that well Player. We are in a delicate time with the Elder Gods, one wrong step could have been the end of all of us.",
    "But you emerged not only unscathed, but also in possession of a powerful item.",
    "It's a gift from the elder gods, it's going to be important. Keep it with you.",
    "I heard what Jas said, time is of the essence. You should return to Anachronia and speak with your allies.",
    "With luck they might have discovered something that can help us end this.",
    "Before it's all too late.",
    "I have something that you lost. But you will need some space free in order to carry it.",
    "Here, you lost this.",
    "A gift from an elder god should not lightly be discarded. Keep it with you, we will doubtless need it against Kerapac.",
    "You need to return to Anachronia, your allies there are waiting for you.",
    "Perhaps. I cannot condone his actions, he would have endangered the lives of everyone on Gielinor.",
    "But the dragonkin have suffered for so long, I would have perferred none of them to endure it again.",
    "Still, we knew what he was dealing with. His arrogance was his undoing.",
    "No, I would prefer that none would need to endure such a torment.",
    "But he chose to fight the elder gods and such hubris has a price.",
    "Perhaps in time he will earn his freedom again.",
    "Indeed. He now finds himself serving the master he so desperately tried to escape.",
    "If only he had worked with us. Perhaps we could all be safe, all be free from the threat of the elder gods.",
    "Sadly, we will never know what could have been.",
    "You have done this world a great service, Player. Once more you live up to the title that Guthix gave you.",
    "I'm not sure what you mean.",
    "I...I do not know what to say World Guar- Player.",
    "I have no idea what this will do to you, if anything. But you are not alone through this.",
    "You have many friends, Player. We will all stand by your side through this.",
    "Guthix, as always, will have had a plan for you. Only time will tell what that plan is.",
    "But lets[sic] not dwell on this all now.",
    "Come, you have saved us all. Let us celebrate.",
    "Charos arrived with this shortly after you escaped Kerapac's lab.",
    "I believe it to be an ancient dragonkin device that collects and emits cosmic energy.",
    "I inspected the item with Charos when he delivered it, we are certain this is only half of the item.",
    "I know you have spent time studying old artefacts, I think it's most suitable for you to take it.",
    "I see you have found a cosmic focus.",
    "I believe it to be an ancient dragonkin device that collects and emits cosmic energy.",
    "There should be a second piece to complete the item.",
    "I wonder if the final piece could be found on Anachronia, near where that one was discovered?",
    "Thank you again for your help, Player.",
    "The Elder Gods are awake and they're unhappy with us, but all is not lost yet.",
    "Perhaps it's time for more direct action."
  ],
  "Zarador": [
    "Seren is right, that needs to be our focus. We know the consequences of his plan...",
    "Precisely. Whatever he's doing will kill us all, but the question is 'what is he doing?'",
    "Why are we all standing round here just waiting? Shouldn't we be sending everything we have at Anachronia?",
    "Yes, what news have you brought us?"
  ],
  "Zanik": [
    "The death of all life on Gielinor.",
    "Calm down Vanescula, there's no need to get angry.",
    "Can we stop him? There is a restlessness in the underworld, I worry something awful is going to happen, soon."
  ],
  "Player": [
    "What's going on? Is it just me or is everyone acting... a little off?",
    "What do I need to do?",
    "Seren says you might know where Charos and Thok are?",
    "Hah, yeah, sounds like them.",
    "If I might bring you both back on track. Have you learned anything about Kerapac?",
    "Wait. All that to tell me Kerapac's base is in the volcano? The most obvious place on this island for an evil villain lair?",
    "Hrmm, it looks like I've found everything in this spot. I should restore what I've found and speak to Charos.",
    "This seems to be some sort of strange dragonkin device. Charos might know more, I should go check in with him.",
    "Good point. I'll come back with the artefact.",
    "...",
    "I restored this device. It's some sort of crystal-like structure. It seems to be resonating with something somehow.",
    "What is it?",
    "Well, that's not terribly helpful.",
    "Do you really have no idea what this could be?",
    "Some sort of dragonkin tablet. I don't recognise any of the words, perhaps Charos can tell me more?",
    "...",
    "So it's another useless dead end?",
    "Who?",
    "Your little spiders?",
    "Hannibus, what are you doing here?",
    "Ride giant lizards into battle slaying all and sundry?",
    "Looking for you actually. You have a unique understanding of the dragonkin, sharing as you do that lizard mindset.",
    "I wondered whether you might be able to help me translate some of their old writing. I know some of the words, but the prose is strange.",
    "Oh, well, it would probably help if I had it on me. I'll go and get it.",
    "What?",
    "I can't see a way to open this door.",
    "Hmm, perhaps I should talk to Hannibus.",
    "Nodon? What do we know about them?",
    "A creed? Is that more like a caste or faction or what?",
    "This dragonkin device is responding to this door. I wonder...",
    "What is this place? And are those dragonkin in those tanks?",
    "Sleeping dragonkin it is. Well, let's try not to wake them up...",
    "Like a shared dream?",
    "Would that be safe?",
    "Let me look around a little more first.",
    "So, is this a dream? We're still in the hibernatorium.",
    "I think I might have seen all I needed to in this dream.",
    "These look to be the same symbols I saw in the non-dream hibernatorium.",
    "Aha! The dreaming dragonkin changed these. I should remember these symbols and try inputting them outside of this dream.",
    "Oh, right. I should remember these symbols and try inputting them outside of this dream.",
    "This is all dragonkin to me. I'm not sure what I'm doing here...",
    "I think this was the symbol here.",
    "This one looks right.",
    "Looks good.",
    "That's it! These are the symbols the dragonkin input in the dream. Now to press this last button...",
    "I've already used this to power down the shield in the chamber below.",
    "I think I've learned all I can from these two Nodon caretakers.",
    "After you, Hannibus.",
    "I can't see a way to open this door. Perhaps I can learn more with Hannibus's help.",
    "Hmm, what did that dragonkin in the dream memory say?",
    "Hesente!",
    "No, that wasn't it...",
    "Crasortius!",
    "No, that wasn't it...",
    "Vek!",
    "No, that wasn't it...",
    "Hepencaraun!",
    "Vertentis!",
    "No, that wasn't it...",
    "Let me look around a little more first.",
    "Oh, I think that's Sakirth, leader of the Necrosyrtes.",
    "How can I tell which are dreamers and which are their memories?",
    "Aughra, what's that?",
    "Syrtes? Why not Necrosyrtes?",
    "We didn't learn much - we already knew Kerapac had some sort of device. We still don't know what it does or is, other than it supposedly generates 'shadow anima', whatever that is.",
    "Um, Hannibus? These two dragonkin didn't disappear like the rest. Is that supposed to happen?",
    "I'm not so sure this is a good idea...",
    "Er, I think one of them has noticed us.",
    "Hannibus!",
    "We apologise...um, Maragan, is it? We meant not to intrude. We only entered here to discover more about Kerapac.",
    "What does that mean?",
    "Kerapac. He must have realised what we've uncovered and it seems important enough to warrant the personal touch.",
    "Be ready. I doubt this is a friendly hello.",
    "No. I won't give up. Kerapac may have power, but I've faced down powerful foes before.",
    "I've stood up to demons, dragons, gods and the warped abominations of Xau-Tak. I am not going to surrender to some blue dragonkin with a superiority complex.",
    "You're right. We need to see what more we can learn. Charos, you investigate the dragonkin ruins, see if there are any more secrets you can uncover.",
    "Hannibus, you see if there's anything more you can learn from the sleeping Nodon.",
    "I'll return to Seren and see if she and the council have any additional leads.",
    "Thok, you...err...",
    "Sure, you... you go do that.",
    "We'll meet back at the base camp after I've spoken to Seren.",
    "Kerapac won't get rid of us that easily.",
    "Hepencaraun!",
    "I'm afraid I am the bearer of bad news. When Kerapac took control of the Needle, he managed to make himself invulnerable.",
    "Whatever we do to him, whatever harm we inflict, it just vanishes as though it was never there.",
    "I like that word, 'almost'.",
    "Primrose?",
    "I'll go and see if Primrose has any answers for us.",
    "Yeah, sorry about that.",
    "You were tied to it?",
    "As Kerapac has the Needle, I don't think that helps us much.",
    "Hrmm. Whilst I know you don't know how to defeat Kerapac, you have given me some ideas. .[sic]",
    "If the Needle forges a connection with its user and the Needle itself has something like a will of its own.",
    "Something like that yes.",
    "No, but perhaps Seren or the council might have some ideas.",
    "So it's intelligent?",
    "Sadly Primrose didn't have anything concrete we could use, but she did give me some thoughts.",
    "The Needle has some sort of will of its own and a connection with its owner. If we could disrupt that connection, he'd lose his power.",
    "I'm afraid not.",
    "We're going to talk to an elder god?",
    "No pressure.",
    "Can you help me?",
    "If I find a way to get through the barrier, to get to Kerapac directly. Is there anything you can do?",
    "That sounds ominous. You won't destroy the island or anything?",
    "Kerapac, one of the dragonkin, has taken control of an elder artefact. The Needle.",
    "He's used it to bring a version of Orthen, the dragonkin island north of here, through time.",
    "He's sealed himself away in the volcano, in his old lair. It seems like he wants to use something there.",
    "We don't know exactly what he's up to, but we know it's targeted at you and the other elder gods.",
    "And that as a result of his actions, it'll kill all life on Gielinor.",
    "Wait, you know all this?",
    "Can you intervene?",
    "Why not?",
    "You're Jas, an elder god. Your power is unrivalled.",
    "Why won't you deal with this, to you, relatively insignificant threat?",
    "You're not telling me that Kerapac is more powerful than you?",
    "Shadow anima? The substance his machine produced before you enslaved them?",
    "What good are you then?",
    "You can't or you won't?",
    "Tell me about the barrier. How is Kerapac keeping you at bay?",
    "So he's completely safe from you?",
    "Nope. Nope. Definitely correct. Please don't do that just yet.",
    "You're useless! You're meant to be the all powerful elder gods and one annoying dragonkin is beyond you?",
    "What is it for? What is the purpose of the Needle?",
    "Can it be stopped?",
    "How?",
    "Can I assume control? Can I take over the Needle?",
    "What do you mean?",
    "Why did you bind them to the stone?",
    "What did the curse do to them?",
    "Don't you feel guilty? You enslaved and tortured an entire species.",
    "Why were you angry about shadow anima?",
    "Can you tell me about the elder gods?",
    "That was harrowing. But I think I've got something that can help.",
    "Jas says that it will remove Kerapac's control over the Needle.",
    "Errr...",
    "Errr...",
    "Hannibus, are you alright?",
    "Is it just us to protect the entire base camp?",
    "Well, I'm happy you're here to help.",
    "I'm ready.",
    "It's fine, I have my own weapons.",
    "Urrm... Okay then.",
    "Hannibus, move over there!",
    "Urrm, maybe try the weakest dinosaurs if you insist on using your head?",
    "Okay then.",
    "[Character], move over there!",
    "Thok POWER!",
    "Thok, where did you get this thing?",
    "Wow... So much damage!",
    "Wow, that was hard. I should speak with Thok and give it another go.",
    "I'm ready.",
    "I'm ready.",
    "Yes, let's go!",
    "Yes, let's go!",
    "No, but I want to go again.",
    "No, but I want to go again.",
    "Phew, that seems to be the last of them. I should check in with the others.",
    "I think we all helped.",
    "Perhaps he was never there. Everything I know about Kerapac is that Kerapac only does things to help Kerapac.",
    "Perhaps there was something he wanted to take from your species. Some value he thought you had to him.",
    "But I don't think he ever cared. Not really. Not unless it served him.",
    "We need to stop him and we need to stop him now.",
    "He's in there, somewhere. I can understand where Kerapac's coming from.",
    "He's angry, he's hurt and he's scared. He's just been released from millennia of torment and slavery.",
    "He thinks he's found a way to stop it happening ever again, to anyone.",
    "He knows the cost and he may even feel guilty, but it's a price he's willing to pay.",
    "Oh you mean this old thing?",
    "Some sort of defence mechanism?",
    "What's that got to do with Kerapac?",
    "Great, let's go and put a stop to all of this. Why do you look so serious?",
    "Yes, the closer we got to them, the more eratically[sic] they behaved.",
    "What about it?",
    "Where is this going?",
    "What does that mean?",
    "What's the bad news?",
    "WHAT?",
    "Maybe I should bring the item that the Elder Gods made for me.",
    "There's a powered tablet on this lectern, but I don't have room to pick it up.",
    "There's nothing else of interest here, just this powered tablet I have.",
    "These are the same symbols I saw in the hibernatorium. I should look around to see if I can find something to help me decipher these signs...",
    "Hmm, I wonder if anything on Kerapac's tablet can help me decipher these signs...",
    "At the cost of all life on Gielinor!",
    "There has to be another way!",
    "You're one of the greatest minds on the planet, perhaps in the universe!",
    "I know how angry you must be. How hurt. How afraid of being bound once again.",
    "But you don't have to fight this alone. There's a whole council of people willing to find a solution. Work with us!",
    "So there's no reasoning with you? No hope.",
    "I'm sorry, Kerapac...you leave me no choice.",
    "You're insane, Kerapac. A monster! There's no reasoning with you!",
    "You leave me no choice.",
    "I have this.",
    "I'm sorry, I didn't know. But you left me no choice.",
    "You got what you deserved! You were going to kill everyone.",
    "You did this to yourself.",
    "This place is going to collapse in on itself any second... I better get moving.",
    "Why does this keep happening...",
    "Well... Now I'm stuck...",
    "Why did I just hear Thok...",
    "Hey Charos! Can you get me out of here?",
    "I'm really starting to appreciate your head Thok.",
    "Come on, we really should get out of here.",
    "We survived Kerapac's lab being obliterated by an elder god. Let that sink in a moment. We survived the fury of an Elder God!",
    "And that's not even considering that we were stood next to a dragonkin device intended to poison the lifeforce of the world.",
    "I don't know Charos, what would being infected with Shadow Anima do to a person?",
    "...",
    "We didn't fight him... *I* fought the dragon.",
    "It's done. Kerapac's lab is destroyed and he has been bound to Jas once again.",
    "About that title. Did you know what Guthix did to me? What his World Guardian power is?",
    "Guthix infused my soul with shadow anima. The substance that Kerapac was using to fight the elder gods.",
    "They call it toxic and they destroyed Orthen because of it.",
    "And he grafted it to my soul!",
    "I'll take a look. Thanks, Seren."
  ],
  "Armadyl": [
    "Hello, Player, it is good to see you. Were that the times were less tumultuous.",
    "Whilst I would love little more than to speak with you about the nature of things, the council has put their faith in Seren and it is she you should speak with.",
    "Although, I would urge a word of caution. The other members of the council appear to be falling under some sort of enchantment.",
    "Each of them is favouring Seren more and more, regardless of their old rivalries and religious devotion.",
    "I do not believe Seren would intentionally subvert the will of another. But, well, we both know about the elves don't we.",
    "I would urge caution, but also haste. I worry what long term exposure to this effect will do to people.",
    "Let's not start this again. Especially not hurling insults like those."
  ],
  "Azzanadra": [
    "You should speak with Seren, she's coordinating the search for Kerapac.",
    "Do you feel it, World Guardian? Feel Seren's power attempt to strip us of our free will?",
    "I even feel her crystalline tendrils worming their way into my own mind.",
    "But my faith protects me. The Empty Lord will shield me from her influence.",
    "Go, World Guardian, and speak to Seren. Resolve this issue so that she no longer has the time to ensnare us with her tricks.",
    "The fate of us all is in your hands. Do not disappoint me."
  ],
  "Icthlarin": [
    "Well met, World Guardian. I am glad to see you taking an interest in these matters.",
    "The council is powerful, but prone to deliberation and we need someone to step up and take charge.",
    "While the rest of the council appear to be turning to Seren to answers... indeed more so than one might expect.",
    "I would be happier knowing the situation is in your hands. I've worked with you before and I can trust no other with the fate of the world.",
    "But for now, I would urge you to speak to Seren. As strange as the council fawning over her has become, she is still the closest thing to a leader we have.",
    "It is regrettable that anyone should suffer such a fate. But it was a fate of his own engineering.",
    "If we can prove the value of mortal life, perhaps one day we can prove he is worthy of freedom."
  ],
  "[NPC]": [
    "You should speak with Seren, she's coordinating the search for Kerapac."
  ],
  "Vanescula Drakan": [
    "What are you talking to us for? You've had your instructions!",
    "Oh yes of course, you're entirely right. Why would I get angry at the impending death of EVERYONE?",
    "Fine, fine. Still, better that you speak to Seren or your allies on Anachronia than waste your time with us 'World Guardian'.",
    "Have you uncovered Kerapac's plan?",
    "Forget that! Has everyone forgotten that he was about to kill everyone on this entire world?",
    "We need him chained up and let's be honest no other prison could hold him. Death would be a kindness and we need only look at the cave goblin over there to see how meaningless a death sentence can be."
  ],
  "Mr Mordaut": [
    "Hello there, Player.",
    "How can I help you?",
    "Ah yes, those two. Strange pair, I swear they were about ready to kill one another.",
    "They were asking me about the dragonkin ruins here on the island. I think they were last seen heading north west of here towards the ruin by the volcano.",
    "It wasn't that long ago, they should still be there if you hurry."
  ],
  "Thok": [
    "Player! Thok is happy to see you again. Why Thok was just telling Carlos here about how much Thok missed you.",
    "Haha! Your angry mewling is funny. You are like angry wolf cub wanting to be petted first.",
    "Thok would make a mighty duck! The strongest of all the ducks. Perhaps more of a goose? A Thokgoose?",
    "HOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOONK!",
    "No no little Crab-toss. We know your little knife cannot pierce Thok's mighty hide.",
    "Thok knows you were just trying to keep Thok on his toes. But Thok has been stabbed many times he has built an immunity to knives.",
    "Oh, yes, Player! Thok has a mighty tale to tell! Would you like to hear it?",
    "You had better dismiss your pet before we begin. This tale is far too mighty for such a cute and puny creature!",
    "Perhaps when you are less busy you can hear Thok's story.",
    "That night Thok arrived on the island. The air was heavy and Thok knew evil waited round the corner.",
    "Thok was alone on an island full of monstrous creatures round every corner.",
    "Ha! Tiny man is correct. Thok sorry Thok left you out.",
    "Thok was alone apart from scrawny little Charos who was overcome by terrible fear.",
    "Ha ha ha!",
    "Do not worry, tiny man, there is no shame in being scared. Not all can be as mighty and as brave as Thok.",
    "But this is digression from the story. Thok arrived on this island of certain death.",
    "Armed only with rippling muscles and Thok's mighty stick, Thok set out to explore the island.",
    "Grrrr",
    "Come loose, vile cork! Free this bottle's message so that Thok may learn what it says!",
    "FINE! THOK DOESN'T WANT YOU ANYWAY!",
    "Thok stopped. Thok heard a noise, loud and terrible. Danger was approaching.",
    "Thok knew that villainous Kerapac had sent his minions to crush us.",
    "But Thok is mighty! Thok is always ready for BATTLE!",
    "Scrawny man is no fun.",
    "MONSTERS ATTACKED!",
    "Fine. Scrawny Charos is no fun.",
    "The beast was smaller...but...it brought with it many friends!",
    "The beast looked at Thok with hungry eyes. For Thok is big and would make a most impressive meal.",
    "But HA! Thok is a meal made of FISTS and these lizards were only going to eat KNUCKLE SANDWICHES!",
    "Thok definitely killed the lizards before going further.",
    "The lizards were no match for Thok's most magnificent of muscles.",
    "Why, with just one twitch from his left pectoral Thok can stop whole armies in their tracks.",
    "Just imagine what would happen were Thok to unleash the right one...",
    "Thok is getting there scrawny man. Have patience. As Thok was saying, Thok explored.",
    "Thok is that lucky, once Thok found a...",
    "Thank you, yes Thok's legs are like rocks. Strong, sturdy and you can build houses with them.",
    "Because Thok's legs are mighty and strong. Thok can carry much weight between his thighs.",
    "Because he is a villain! Villains always have confusing plans. Thok's plans much simpler, because Thok is no villain.",
    "It is full of big lizards?",
    "Yes! So that is why we explored further!",
    "But as we explored, from the jungles poured MORE LIZARDS!",
    "Thok definitely killed the lizards before going further!",
    "Even though these lizards were bigger than most lizards, they were still easily squashed beneath Thok's mighty heel.",
    "Knowing this land would be fraught with danger would have made lesser warriors tremble. But Thok knew it to be glorious!",
    "And so, with his mighty weapon in his hand...",
    "Ready for battle, Thok bravely marched forward!",
    "We discovered an ancient ruin that had once belonged to the beasts we sought.",
    "Terrible beasts they were. Monsters by the name of...",
    "THE DRAGON KINGS!",
    "Haha yes, Thok is a mighty survivor. Thok is the greatest warrior in the land and even these ignorants you speak of cannot defeat me.",
    "So, this place, this home of monsters, had become home to others.",
    "Brave explorers had sailed to this island before us, seeking to claim it as their own.",
    "Thok wanted to meet them. To shake their hands and share mead with them, so Thok made his way to the camp.",
    "It was then that Thok saw her. The way she carried her weapon, the way she studied the world with those eyes.",
    "A real warrior! A mighty warrior woman. Thok had never seen someone so magnificent even among the Fremennik warrior women.",
    "She... Thok and pretty lass are...taking a break.",
    "It does not matter. Some things are not meant to be. We were from two different worlds.",
    "Quite literally if Thok recall correctly.",
    "But enough of past loves. A new star shines bright in Thok's sky and her name is Laniakea!",
    "It's nice to dream sometimes.",
    "Thok asked the radiant star if she had seen the blue beast Kerapac.",
    "Thok knew it was. Who else could be so infested with evil as the betrayer Kerapac? NO ONE!",
    "Come, my star that ignites the heavens, let us discuss this villain in the main camp.",
    "Thok sometimes struggle with words with magnificent women.",
    "Anyway, we went to the camp.",
    "When Thok arrived in the base camp, a terrible darkness filled the air.",
    "It was heavy, the heaviness of a storm as it approached. Or the heaviness of Thok's breakfast. Heavy.",
    "Then...as if carried on EVIL WINDS! The villain Kerapac arrived!",
    "Villain! You dare show your face in front of the mighty Thok? Thok will punch that smile off your face, along with your teeth.",
    "You interrupted Thok and now Thok has lost his train of thought.",
    "Where was Thok?",
    "Villain! You thought you could escape Thok by cowardly fleeing to this tiny island full of lizards?",
    "Ha! Thok is too skilled a hunter to be escaped from so easily.",
    "But Thok has you now! Thok will destroy you!",
    "With that, the villain left. Thok would have thrown his stick at him, but the villain was too quick.",
    "We watched him fly away and disappeared into this volcano somehow.",
    "Like all villains he hides himself away where he thinks Thok cannot touch him.",
    "But that villain didn't know what Thok knows!",
    "Thok knows that Player and Thok together cannot be stopped! We will seek mighty vengeance for his betrayal!",
    "HAHA! See, Thok knew Player is smarter than Kerapac. Knew they would work it out instantly.",
    "Haha friend, you don't want to be talking to Thok about digging for historical things. Thok only looks to the future, never the past!",
    "Haha yes, Thok has had many victories in the mines. Why he once fought a mighty necronium golem in the mines in Burthorpe.",
    "The golem was twenty feet tall...",
    "It breathed great plumes of fire...",
    "And each arm was a giant broadsword wreathed in lightning!",
    "Isn't there a little lizard guy you are looking for?",
    "Listen! Do you hear something. Thok can sense the encroaching presence of evil!",
    "Hah! This villain has had enough chances. Thok will put a stop to him right now!",
    "Villain!",
    "Die, scaly beast!",
    "Grrr!",
    "Thok smash!",
    "Even Thok cannot harm him.",
    "YES! Thok agrees with Player. This villain thinks he can scare us with cheaty magic tricks?",
    "NO! We cannot give up! We cannot surrender! Kerapac is a villain, and villains lie.",
    "He says we cannot hurt him. Thok says we just need to hit him harder!",
    "You can always find a bigger stick to hit someone with!",
    "We are some of the mightiest warriors in the world. Thok is strongest, obviously.",
    "Player is Guardian of Worlds and would never give in!",
    "Hannibus, though tiny, rides mighty dragons into battle!",
    "Charos is...",
    "Come to think of it, Charos probably would give up.",
    "THOK'S FISTS!",
    "I shall punch some dinosaurs, they might know something!",
    "Kerapac! The villain is making his move!",
    "That villain! Quickly, we should hurry. We need to get these people out of here.",
    "This will be a glorious fight, Player. Talk to Thok when you are ready!",
    "Thok wants to lend you something, but your fists are full.",
    "Thok ready to hit dinosaurs. Are you?",
    "No you not. Take Thok's stick.",
    "NO! You take Thok's stick, it's better.",
    "Thok will headbutt dinosaurs.",
    "Thok will headbutt and kill the STRONGEST dinosaurs.",
    "NO. Thok hits the strongest dinosaurs.",
    "Are you sure you want to leave us?",
    "Thok SMASH",
    "Ready to try again?",
    "This is tough. I make everyone hit harder?",
    "Thok did it!",
    "Mostly Thok!",
    "All this talk of measures and cosmics makes Thok uneasy.",
    "Sounds like tricky magic nonsense. You can't trust magic, it gets in your head, in your hair and sometimes in your beard.",
    "Better to stick to the simpler things in life. Why throw a fireball when you can punch something in the face?",
    "If you want to know about silly magic nonsense, you will need to talk to Charos.",
    "Thok thought it was fun!",
    "But Thok isn't. Boo hoo for Kerapac, he had it hard, his people have it hard. That's sad.",
    "But it's not an excuse. He's wrong, he's doing wrong and there's no room to feel sorry for him.",
    "We stop him, or we all die.",
    "Thok wishes he could join you in this fight. Thok would like to punch Kerapac in the face.",
    "So punch him for me!",
    "Go, Player. Be a mighty hero and defeat that scaley villain!",
    "Thok wish he could be with you to punch the dragonkin in the nose. But Thok will be with you when you take that barrier down.",
    "Thok would wish you luck, but Thok has seen you in battle. It is Kerapac that will be needing luck!",
    "Gah! It's as if the air has filled with angry wasps that sting Thok!",
    "But they are so small Thok cannot see them. Thok cannot fight them!",
    "Go on my brave friend. Thok and friends will defend this entrance.",
    "THOK SMASH!",
    "WHAT WAS THAT?",
    "Did anyone else see that giant volcano monster RIP THE VOLCANO APART?",
    "Thok wants to see it again. Thok wants to punch it in the...Thok was going to say nose, but Thok not sure it has a nose.",
    "Yes, you and Thok defeated the villain single handedly in glorious combat!",
    "Yes, yes, you and Thok are mighty heroes!",
    "So? Thok has faced pain, Thok has faced loss. Doesn't mean Thok tries to destroy the world.",
    "Thok choose instead to do what he can so that others do not need to suffer. Kerapac could have chose the same path. But instead he chose to be a villain.",
    "And villains get what they deserve. Thok's fist, straight to the nose."
  ],
  "Charos": [
    "Charos. We've been over this, Thok. Charos!",
    "If you try and pet me...again... I will enchant you so that you think you're a duck.",
    "Player, help me kill him? No one would know. Just our little secret.",
    "That was totally an accident...",
    "Wait, it doesn't work like that...",
    "Alone? What am I? Invisible?",
    "That's better, I...",
    "I want it on record that this did not happen.",
    "Take it down a notch will you?",
    "Oh, come on. They weren't that big!",
    "For the love of all that glistens, can you actually take us somewhere remotely near a valid point?",
    "You're not seriously going to describe everything step by step are you?",
    "Look. We came to this island for a reason. Your shoddy sailing may have stranded us here but we still had a purpose.",
    "Player, after Kerapac betrayed us all and escaped, we felt... well it was our responsibility to try and fix things.",
    "The storm proved to be a problem for a while, but then it mysteriously died down.",
    "I wish I could tell you it's because everything had magically solved itself, but none of us are that lucky.",
    "Literally no one cares you great lumbering boulder with legs...",
    "What?",
    "Ooh err.",
    "But enough of this nonsense. Let us move on to something of more substance than Thok's lower appendages.",
    "When we came to this island I could feel it immediately. This place is wrong. Like it's not meant to be here, at least...not now.",
    "It can only mean that Kerapac used the Needle, somehow, to pull this island into the present. The question is why?",
    "And Thok is much simpler...",
    "But yes, back to the subject at hand. The island. It's clear that this place has some significance to Kerapac.",
    "I suspect if Kerapac had wanted big lizards, he could have managed that without ripping an entire island out of time.",
    "No, it's this place and it's this 'when'.",
    "Ooh err.",
    "Oh, for the love of Guthix, enough walking. Look, let's just skip us forward a bit, shall we?",
    "It wasn't until we reached the base camp that we really learned anything valuable anyway...",
    "The dragonKIN, KIN as in related to. As in relatives of. DragonKIN.",
    "How are you alive? Genuinely curious how someone as completely ignorant as you could survive this dangerous world?",
    "Seriously I...no...no I give up. I cannot be bothered trying to reason with this. Back to you, you great lumbering idiot.",
    "Oh and what about your pretty lass?",
    "Oh. I'm sorry.",
    "She, of course, never said that.",
    "Star that ignites the heavens? Really? I distinctly recall at the time it was more something like...",
    "I've seen Thok eat, the breakfast is not to be trifled withThough, I think there might actually be trifle in it...",
    "Neither of them said that. You probably guessed that, but I wanted to be clear.",
    "Focus, Thok. Focus.",
    "Now you know what I've had to put up with for the last few weeks.",
    "I really must apologise for Thok. He means well, but he's...well, he's Thok.",
    "I have several theories to explain his behavior, but I fear that time is of the essence.",
    "So, whilst I could sit here and insult the lumbering buffoon all day, let's instead get down to business.",
    "Tell me, what do you know about this island?",
    "Not to worry, I know more than enough for both of us.",
    "Ah, well, sort of. This is what Fossil Island used to be.",
    "So it both Is Fossil Island and it isn't. For the purpose of what we've uncovered, it isn't really Fossil Island.",
    "Well...yes. I'm afraid so, this island is a temporal anomaly. It should not be here in its current chronological state.",
    "Indeed this island, this aptly named Anachronia, is an island torn out of time.",
    "The question is: why?",
    "In my investigations I have come to believe that this island is the ruin of a once great dragonkin kingdom. I believe it was named Orthen.",
    "More so than that, I believe that the dragonkin we know now are quite different from the dragonkin that built this place.",
    "Indeed, I believe that something happened here that fundamentally altered the course of the dragonkin destiny.",
    "Better still, given the state of the island, I believe that these secrets are here for us to discover them.",
    "Fortunately, I happen to know that you've begun to make quite the name for yourself in the Archaeology Guild.",
    "So those secrets shouldn't stay buried for long.",
    "Look around the dragonkin ruins. See if you can excavate any artefacts that might help us piece together the secrets of this island.",
    "Honestly, very little. This island is impossible, a literal land out of time.",
    "As Reldo I heard all about the theories on 'Fossil Island', on the flora and fauna there. On the ancient bones and...well fossils.",
    "But that place is gone now. Instead the past has been dragged forward to replace it. What is, is now, what was.",
    "Have I mentioned I hate time travel?",
    "This island? It was clearly once a stronghold of the dragonkin. The island is littered with their ruins.",
    "Which means Kerapac deliberately chose a time after the fall of the dragonkin, but before this place became Fossil Island.",
    "He wants something here and he wants no other dragonkin around to stop him.",
    "Surprisingly little to be honest. For all their power and fury, the dragonkin have remained secret from most of the world for millennia.",
    "As Reldo I only heard whispers. Among the vampyres I heard even less.",
    "I know that once they were cursed. Bound to the stone of Jas, such that whenever it was used they would feel terrible rage and pain.",
    "They would also grow more powerful, which eventually led to them destroying whatever being was foolish enough to use the stone at that time.",
    "Given the power of the stone of Jas, you can be certain that the dragonkin at the height of their power were a terrible force to behold.",
    "Even the gods feared them.",
    "I also know that there are two dragonkin factions. The Dactyl, led by Kerapac, who sought to end the curse through magic and alchemy.",
    "And the Necrosyrtes that sought only to vent their rage and hatred on the world.",
    "What worries me is that right now, at this time, I only know what the Dactyl are up to. The Necrosyrtes have disappeared from anywhere I have eyes.",
    "Still, right now the Dactyl are the only threat we have time to focus on.",
    "When you find an artefact make sure you repair it so I can study it properly. You're an archaeologist, go archaeologise.",
    "Except to brag of course. You remember very clearly every minor victory and then you twist them into exaggerated nonsense.",
    "No, no you didn't.",
    "The mine is eight feet tall at its highest point...",
    "In a mine, where it's famously easy to find gas pockets...",
    "Aaaaand that's me done. Not going to listen to any more of this, I suggest you do the same Player.",
    "I'm afraid you do need to actually have it with you for me to inspect it.",
    "Whilst I would be quite happy to have your bank pin and to wade through your collection of knick knacks, it would be better for everyone involved if you were to bring it here. Don't you think?",
    "A little bird told me that you've discovered something quite interesting?",
    "I notice you appear to have thrown away an irreplacable dragonkin device which could be of vital importance.",
    "Right at the time that we need to face down an ancient dragonkin hellbent on destroying the world.",
    "As pretty as you are my dear, you're really not that bright are you?",
    "No no, don't ruin it by speaking. Fortunately for us both you've got me around and I...",
    "Well I'm brilliant. So I have already found the thing that we clearly need to solve this mess.",
    "And of course you don't have any room to carry it with you. Backpack too full of pretty pebbles you picked up along the way?",
    "Go but those shiny baubles in your  bank and come back to me with some space free, hrmm?",
    "YES! Amazing! Exactly what we needed!",
    "Not a clue sorry. I mean, keep hold of it, it definitely feels important. But right now, it could be anything.",
    "A key. A door. A book. A magical purse. Could literally be anything.",
    "No, not really. But I suspect it will be, you know how this normally goes. You bumble about the place and everything you find is eventually important.",
    "No, I think this is part of a larger puzzle. I think you need to get back out there and dig up another artefact for us to investigate.",
    "There's a bigger picture here, we just need to uncover it.",
    "I was rather dismissive earlier, let me take a proper look at it.",
    "Hrmm, it's certainly very strange. There's an energy to it, a sort of magical resonance that I've only really encountered in the Lunar Isles.",
    "Whatever it is, it's not built for us I'm afraid. Scalier brains are needed to get into this.",
    "I think you need to get back out there and dig up another artefact for us to investigate.",
    "I notice you appear to have thrown away an irreplacable dragonkin device which could be of vital importance.",
    "Right at the time that we need to face down an ancient dragonkin hellbent on destroying the world.",
    "As pretty as you are my dear, you're really not that bright are you?",
    "No no, don't ruin it by speaking. Fortunately for us both you've got me around and I...",
    "Well I'm brilliant. So I have already found the thing that we clearly need to solve this mess.",
    "And of course you don't have any room to carry it with you. Backpack too full of pretty pebbles you picked up along the way?",
    "Go but those shiny baubles in your  bank and come back to me with some space free, hrmm?",
    "Please stop throwing important archaeological discoveries away.",
    "So, let me get this straight, you uncovered an ancient tablet that might be the key to everything.",
    "And then you just threw it away?",
    "Don't worry though. I found it, I have it here, for you.",
    "Don't lose it again please.",
    "And of course you don't have any room to carry it with you.",
    "Do you even want to save the world?",
    "Just... Just make some space and come back here and we'll try to get back to preventing all of us from dying an agonising death.",
    "You know, if you can hold off from cramming your backpack full of cheese wheels or whatever takes you fancy this minute.",
    "Please stop throwing important archaeological discoveries away.",
    "Hrmm. Well this is definitely something. It's old dragonkin, similar to modern dragonkin but with a bit more nuance.",
    "Unfortunately, it's the sort of prose that requires an understanding of a more draconic way of thinking.",
    "On this occasion, I am pleased to say that we might be in luck.",
    "We fortunately have an expert on draconic thinking. Someone who's made quite the career getting inside the heads of dragons, or their hearts at least.",
    "The 'Last Dragonrider', you know...til he wasn't. I've been keeping tabs on him, someone who can take control of deadly lizards felt like they might be useful on Anachronia.",
    "As the whims of fate would have it, he's made his way to this island region on his own. Apparently to do a little gardening, well farming anyway.",
    "Last my little spiders told me was that he was talking to Great Granny Potterington, on the Ranch.",
    "Well every spy network needs a sinister little name.",
    "Don't worry though, I get my information from something much less sinister than secret spy agencies.",
    "Always listen to gossips Player, you'll be amazed at what secrets you can pick up.",
    "But whilst I would love to talk about myself a little while longer, time is of the essence. Hannibus will have the emotional understanding we need to crack this.",
    "You should go and say hi.",
    "It's an ancient dragonkin tablet. It's written in a very different style to the existing dragonkin works. The modern stuff is gutteral, quick, harsh as though writing is a terrible effort.",
    "But this? This flows and undulates around the page, as if flowing with emotion. Emotion, unfortunately, seems to change the meaning of the words completely though.",
    "I know some words, like 'patience' and 'security', but some of these other words make no sense.",
    "Oddly, though, I don't believe it's a code. I believe this was intended to be read be[sic] someone who could understand the emotion.",
    "But who can understand the emotions of lizards?",
    "Except of course, another lizard.",
    "Please stop throwing important archaeological discoveries away.",
    "You should go and find our expert on draconic thinking. They were last seen talking to Granny on the ranch.",
    "We've got everything covered here. Go and see what you can find out from Seren.",
    "I believe our scaley friend is looking for you on the ruins to the north-east of the island.",
    "Ah good, there you are.",
    "So whilst you've been following up that lead with Hannibus. Thok and I have been studying the island a little more.",
    "Turns out there's a whole wealth of ancient dragonkin knowledge waiting to be uncovered.",
    "Why I could spend years unearthing their secrets. Imagine the technology, imagine the power we could...",
    "Ah yes, I can feel it now. The resonance of elder artefacts mixed with a touch of dragonkin arrogance.",
    "Honestly, you are the worst.",
    "Take this!",
    "What is this madness? He's healing instantly.",
    "A mass evacuation's practically impossible. We could get a scant few hundred through the World Gate, at best.",
    "I am standing right here and, aside from his last comment, I agree with Thok.",
    "Which makes me feel a little ill.",
    "But Thok is right. The only way that Kerapac guarantees victory is if we give up. Direct combat failed, sure, but there are more weapons in our arsenal.",
    "And the most powerful weapon of all is...",
    "Knowledge. I was going to say knowledge. I hate you, I want you to know this.",
    "On it.",
    "Before you say anything, Seren's already informed us that you've spoken with the big squid herself.",
    "I must say I am really quite impressed. You've stood in the presence of one of the creators of the universe and I don't smell a whiff of urine on you.",
    "Most people I know would have wet themselves in the presence of such a creature. Alien and all powerful.",
    "But from what I've been told, you've managed to come away with something useful. May I see?",
    "You don't have it do you? It's in your bank or something?",
    "YOU DESTROYED IT? WHAT IS WRONG WITH YOU?",
    "You are handed what may well be the literal deux ex machina that we need and you just throw it away?",
    "Did you think you were better equipped than the actual creators of reality to deal with this situation?",
    "Did you think a plucky attitude and a few sharks to snack on would be all that you need to deal with an immortal, invulnerable, dragonkin who can manipulate time itself?",
    "What was Guthix thinking? How are YOU the World Guardian? Thok would be better...",
    "AND HE'S AN IDIOT!",
    "...",
    "*Sigh*",
    "I'm sorry. I'm much calmer now. I am in my happy place. It involves lots of knives and an imbecile that you will recognise. pFROM[sic] YOUR MIRROR!",
    "And relax. Breathe in, Charos. Breathe out, Charos. Let calm soothing energies fill you.",
    "Perhaps you should go and find the MAGICAL GIFT FROM THE CREATORS OF THE UNIVERSE!",
    "I suspect you'll actually NEED the gift from the ELDER GODS if we're going to fix this.",
    "Well it's...shiny?",
    "I have absolutely no idea what that is. But hold on to it, it's going to be important.",
    "Well, between us we seem to have made some interesting headway. Player has this shiny device, which should remove Kerapac's time wrangling threat.",
    "I've managed to uncover some interesting information about dragonkin security systems, which should prove useful.",
    "And Thok...",
    "Well Thok punched a couple of dinosaurs. Nothing useful came from it.",
    "This isn't good.",
    "I am ready to fight when the dinosaurs arrive.",
    "Laniakea will join us when they arrive.",
    "Speak with Thok when you are ready.",
    "Player, I can hear the stampede. The dinosaurs are close now.",
    "The beasts are coming from all access points into the base camp.",
    "We have no time to flee. Most inhabitants have managed to get out, but we found these idiotic archaeologists still excavating nearby.",
    "When the dinosaurs arrive, they will likely start attacking out of confusion. They are stupid creatures.",
    "We must help to protect the base camp and I guess these archaeologists too.",
    "I see Thok has given you his stick, don't forget to use it! We will need everything we've got to push them back.",
    "When they come, I'll help with fire bolts. These can bounce between multiple targets if close enough, so should be efficient.",
    "When they arrive, what do you want me to focus on?",
    "The dinosaurs that are strongest, weakest, closest or furthest away?",
    "Don't worry about the others target settings for now, come over and change mine.",
    "Perfect, I'll focus on those dinosaurs.",
    "One last thing, Player.",
    "I have focused on the flow of energy within the base camp to highlight the paths the dinosaurs will take when they arrive.",
    "Knowing this information should put us at an advantage when they arrive.",
    "Player, feel free to direct us around during the battle. If you want any of us to move, let us know.",
    "Good luck, everyone!",
    "Well, I'm glad none of us are dead. Even Thok...which is worrying.",
    "Oh well, he'll say something that will want to make me murder him again soon, I'm sure of it.",
    "But better than that, Kerapac's nonsense spiel about binds, cruelty and the passage of time has given me an idea.",
    "Come meet me by the volcano entrance. It occurs to me that whilst we've been looking for answers in the present, we should have focused more on the past.",
    "It's time we take the fight to Kerapac, I think.",
    "Well, I don't know about you, but that was certainly an experience.",
    "Yes, well. About that. I've been doing some thinking and I've been studying those lovely relics you unearthed and I have an idea.",
    "It seems that the dragonkin technology of Orthen is based on the manipulation of something they refer to as 'Cosmic Energy'.",
    "I believe that the key to unlocking Kerapac's lab, lies around neutralising the...let's call it 'cosmic harmony' of his door.",
    "To that end, I believe we can use the ruins around the volcano to determine what the required resonance will be, so that I can...add a little noise to the harmony.",
    "I believe you have a rather nifty little elder artefact that should help us with that, Player. Something called the Measure?",
    "I can get it for you, but you'll need to have room to hold it.",
    "To speed up time, I, err, borrowed it for you...",
    "Yes, how fortuitous that you should just be carrying that around on your person.",
    "I've explored the ruins around the volcano and discovered areas with a particularly strong magical resonance.",
    "I need you to come find me and use the Measure to track down the frequencies so I can work out a counter frequency to unlock Kerapac's door.",
    "I know it all sounds the weird ramblings of an old enchanter and...well...it is, but it'll work, trust me.",
    "Visit the ruined buildings around the volcano and look for me. When you find me, use the measure next to me and it should help us discover the resonance of this cosmic energy.",
    "Once we've done this a few times at different locations, I should be able to unpick Kerapac's lock.",
    "I'll see you at the sites.",
    "You'll need the Measure for this next part.",
    "The resonance of magic here is different. I think this is the perfect place to place the measure.",
    "Hrmm, interesting. There's a definite magical resonance here. I can see how the term 'Cosmic Energy' might cover it nicely.",
    "Of course it's not actually another form of energy. It's just another way of looking at the same anima that the rest of us use.",
    "But it's refined differently. It's subtler, more sensitive. Good for magical security that's for sure.",
    "Like a magical key, the slightest fluctuations would disrupt the shape, the harmony, of this anima matrix.",
    "You couldn't just brute force magical locks that use this sort of energy. You'd need expert hands to do this.",
    "Fortunately, you have me and I haven't found an enchantment I can't pick apart yet.",
    "Hrmm, that's weird.",
    "Odd. It seems to be behaving oddly the more we try and examine it.",
    "Quite fascinating really. Still, one sample is only the start.",
    "We'll need to gather more data before we can learn anything really useful.",
    "The resonance of magic here is different. I think this is the perfect place to place the measure.",
    "Aha! I can see the patterns start to come together now.",
    "I'll give them their due, the dragonkin, it seems, were quite inventive for their time.",
    "Wait...there it is again. The closer we get to observe the effects, the more distorted it is.",
    "No. No. It's something else.",
    "The funny thing about anima is how strangely easy it is to manipulate. Oh, sure, it's incredibly difficult to forge spells and the like.",
    "But anima itself is manipulated by everything it flows through. It takes on a resonance, if you will, of the area around it. Environmental and emotional.",
    "The anima of a volcano is angry and hot, whereas the anima of a stream is mellow and cold.",
    "In effect that's what a spell is. It's carefully manipulated anima, a clever application of those resonances to achieve a desired result.",
    "All in good time Player, all in good time.",
    "The resonance of magic here is different. I think this is the perfect place to place the measure.",
    "Ah good, yes, this is very helpful. Do you see the way the anima twists back in itself there, like some sort of knot?",
    "Anima really is quite a remarkable substance, you can see why the Elder Gods feed on it. But what's remarkable is also how we define anima.",
    "Take, for example, the soul. As much as we glorify our souls, give it special significance, a soul is little more than a container of anima.",
    "Which sounds mundane, I confess, but it really isn't. Each soul is unique and each soul creates a unique resonance in the anima.",
    "Necromancers, terrible people as they are, recognise this. Why do you think the strongest undead monsters come from the bones of heroes?",
    "Why did Sliske use the Barrows Brothers to create his wights, rather than random people off the street?",
    "Because their souls are stronger.",
    "Of course souls are one end of the spectrum, on the other end are these subtle little locks of 'cosmic energy'. Small amounts of anima, but very specifically shaped.",
    "The resonance of magic here is different. I think this is the perfect place to place the measure.",
    "So. Let's start with the matter at hand. I now have enough information to unlock Kerapac's lab.",
    "Did you notice how the 'cosmic energy' readings seemed to change as we observed?",
    "Well, yes, that's partially true. With one small, slight change.",
    "The closer YOU got. When it was just me, there was no change. When it was just you, well...",
    "Come on, let's return to the entrance. I think it's better I tell you this in the company of friends.",
    "Ah, Player, good you're here. I've got something to tell you.",
    "It's about that little gift that Guthix gave you, the one that turned you from adventurer into 'World Guardian'.",
    "Yes, well, before I get there let's talk a bit about magic, shall we?",
    "Magic, as you're aware, is the manipulation of anima in order to achieve fantastic results.",
    "In essence, the manipulation of anima lets us borrow from the power set out by the elder gods in order to re-order the universe.",
    "Anima is all around us. It is absorbed and...tuned by matter. With animals, plants and even rocks attuning things differently.",
    "The end result is a beautiful harmony of anima that improves everything around us. The sort of song that the elder gods created this very planet to achieve.",
    "Well, you remember earlier when I spoke about souls. About how they're containers of anima that shape the anima with our experiences?",
    "Yes well. It appears that your soul is...different.",
    "It looks like when Guthix made you the World Guardian, by giving you some of his divine power, he also gave you something else.",
    "I believe the dragonkin called it 'shadow anima'. Your soul contains a carefully constructed enchantment of that shadow anima.",
    "Well, on the plus side, it goes a long way to explaining your resistance to the power of the gods.",
    "As for all their terrible might, the power of the gods are ultimately applications of anima.",
    "This shadow anima, your shadow soul if I may, would be repellant to this energy shielding you from their influence.",
    "So, that's the good news.",
    "Well, when has something prefixed with 'shadow' ever been positive in the long term?",
    "However, let's ignore the possible horrifying future that awaits you. Cast aside all notions of mutating into an eldritch nightmare.",
    "Cast that aside. Let's focus only on good things.",
    "Like this little barrier here. You know this lab is protected? Well it seems it's protected by this shadow anima.",
    "Which explains the lack of direct assistance from grandma Jas herself.",
    "Your average anima based lifeforms, like myself, Hannibus and even Thok here, we can't cross that barrier without being torn apart.",
    "But to you it'll be about as unpleasant as the heaviness of the air before a storm. You might feel a slight tingle, but otherwise you'll be fine.",
    "So by infusing your soul with this reality destroying shadow anima, Guthix may have given you exactly the protection you need to save this world.",
    "Which is very handy I think.",
    "But, whilst I would love to discuss this topic, at length, I'm afraid we just don't have the time.",
    "I've used the resonances we've picked up from the measure and unlocked this door.",
    "Until you can shut down that shadow anima barrier, we can't come with you. But as soon as it's down, we'll be there.",
    "So this is it, World Guardian. Time to save us all. Make sure you have that doohickey that Jas gave you, I suspect you'll need it.",
    "When you're ready, Player, the door is right there.",
    "When you're ready, Player, the door is right there.",
    "Only you can do this now Player, but we believe in you.",
    "I'll see what I can do.",
    "That was exhausting, I don't have the energy to do that again.",
    "Thok's clearing the path this way, let's go!",
    "I think it's safe to say that the Elder Gods are awake and that they're not terribly happy with us.",
    "Yes, well, much as I would love to see you atomised Thok. I suspect that would be a bad idea.",
    "Yes, well, thank the stars that's over with. I'm as much a fan of science as the next ancient enchanter, but there are limits to what we should do with it.",
    "And even I draw the line at devices intended to poison and kill an entire planet with Shadow Anima.",
    "I mean, to think of it, flooding the world with that stuff. Enough to poison the Elder Gods, can you even imagine what it would do to us?",
    "Ah right, yes, sorry poor wording on my part.",
    "Look, whatever Guthix did to your soul, it's clearly not an immediate threat.",
    "You've been the World Guardian for several years now, so if it was going to have done something horrific it would probably have done it by now.",
    "So obviously whatever horrible doom and gloom is coming your way, it's a slow burner and you probably have plenty of time before the horrible consequences are revealed.",
    "I mean, with the amount of danger you hurl yourself into, you'll probably be dead long before we see any side effects.",
    "Yes, I can see why that wasn't the best way to put it now.",
    "So let's not dwell anymore. You did it Player, you came face to face with an immortal, invulnerable, dragonkin hell bent on destroying us all.",
    "And you returned the victor!",
    "Yes...well.",
    "We'll take it from here Player. Ful may have levelled this volcano, but we can make sure everyone on the island is alright.",
    "You should return to Seren and let her know the crisis is averted.",
    "I found something as we were leaving that may be of interest to you. Make some space and I'll hand it over.",
    "Oh Player? Whilst we were fleeing, I found this. It must be a Dragonkin power supply as it appears to emitting a lot of energy.",
    "Thok keeps trying to touch it with his enourmous[sic] hands and I don't want to see it get damaged in the hands of that fool.",
    "Here, you take it.",
    "It's an interesting device, it looks like something is missing though. It may be worth investigating to see if you can find another piece.",
    "You did good my friend. You did good."
  ],
  "Scrawny Charos": [
    "I'm so scared. Save me Thok! SAVE ME!",
    "Oh no! I may have soiled me undergarments. Thok save me I am overcome by fear!",
    "Scrawny Charos Oh no! I may have soiled me undergarments. Thok save me I am overcome by fear!"
  ],
  "Laniakea The MAGNIFICENT": [
    "My Thok, you have so many muscles. I am impressed by your mighty beard and impressive musky odour.",
    "Mighty Thok, I have not seen such a beast. But there is a darkness here. A terrible evil that begins in the heart of the island and spreads out like an infection.",
    "Perhaps this is the villain you seek?"
  ],
  "'Thok Impression'": [
    "Er...ib...flib....spogaly...wannagochatinthemaincamppleaseok alsohi."
  ],
  "The Evil Kerapac": [
    "Bwahahahahahahahahaha!",
    "No. Not my teeth!",
    "Bwahahahahahahahahaha!",
    "BWAHAHAHAHAHA! Though you are mighty Thok, perhaps the mightiest of all warriors. With powerful muscles and the most impressive beard...",
    "No, Thok, you will not destroy me. You will not even touch me. As we speak my dark plan moves into place.",
    "Soon my machine will be restored and with it I shall turn this world into dust!",
    "You and all you love will be destroyed! I shall be the end of Thok. The end...OF THE WORLD!",
    "BWAHAHAHAHAHAHAHAHAHA!"
  ],
  "Excavation": [
    "Dragonkin remains",
    "Orthen rubble"
  ],
  "Level requirement": [
    "50",
    "50"
  ],
  "Materials": [
    "Orthenglass",
    "Orthenglass"
  ],
  "Damaged artefacts": [
    "Dragonkin device",
    "Dragonkin tablet"
  ],
  "Hannibus": [
    "Hello there.",
    "I've decided to spend a bit more time on Gielinor, to try and connect with my daughter.",
    "It's a wonderful opportunity and I refuse to squander it. So I thought I'd come here and do what I do best.",
    "Err...no. You may not know this, but before I was a warrior, I was a shepherd. On my world we had the gurh. But your world has stranger lizards.",
    "Fortunately I got to meet young Mrs Potterington here.",
    "Yes...well...err.",
    "What I mean to say is. Mrs Potterington has introduced me to these great creatures here.",
    "I thought I might raise some of them. Give me a chance to settle down and properly provide for my family. Now that I have one.",
    "But what are you doing here?",
    "Of course, my friend, I am always happy to help. Let me take a look.",
    "Hrmm, I can see how you struggled with this. It's not like normal dragonkin, it's more...flowery.",
    "You sort of have to follow the flow of emotions round the page to get the meaning. It's a bit like a poem, only not quite.",
    "This is fascinating. It's so sad. Did you know there were multiple dragonkin castes?",
    "More than two anyway, we know about the Necrosyrtes and the Dactyl, but this tablet is talking about a third group.",
    "The Nodon. It seems that the Nodon had a very different approach to dealing with the curse. Rather than fight it, or succumb to it, they apparently tried to sleep through it.",
    "Indeed and more to the point it stands to reason that they might still be trying to sleep through it. This tablet speaks of a great chamber where several of them went to sleep.",
    "I think I know where it is. There's some ruins to the north east of the island. Meet me there and we can see if we can learn anything useful.",
    "Come, we should visit the ruins on the north-east of the island.",
    "The tablet seems to point us in that direction.",
    "I've been trying to make a new beginning for myself. It feels as if the Olun'dai has drawn me away from Iaia for a reason.",
    "Ha, though I couldn't for the life of me tell you what that reason would be.",
    "Still, I have something I would never have believed possible. I have family here and whilst we're not exactly close, it's a start.",
    "So I've been trying to bond with my daughter. Be a father to her.",
    "Mostly this has involved me teaching her deadly dragonrider fighting techniques, but I'm sure there's no danger there.",
    "Kerapac gave me something I had lost for so long, hope. The serum he gave to my people, it's helped reignite our spirit.",
    "The healers on Iaia have been studying it for some time now and there's definite promise.",
    "It could lead to a cure. A cure for the decline of my people.",
    "I cannot believe someone capable of doing that is capable of killing everyone on Gielinor.",
    "So I want to believe there is something in him left to redeem.",
    "For now, yes. I've got myself a little cave and some arable land. So I'm making myself a little home.",
    "I feel as if the Olun'dai is telling me that my place is here. I have good friends, animals I can raise and train and of course, I have my daughter.",
    "I wish that all of the ilujanka could find such joy.",
    "The ilujanka are a dying people. We have been for many years now. Few children are born and this generation may be the last.",
    "But we are not a people in mourning. We spend our time preparing our homeworld of Iaia for the gurh and other animals. So they may inherit a good world.",
    "We spend our days with songs, with dance and with the company of others. If we are to die, we will die surrounded by love.",
    "And that will be our legacy to the world we leave behind.",
    "Iaia is a beautiful planet. We have three moons and each lights up the planet like a painting.",
    "The silver moon, Silun, casts the world in a sombre blue and reminds us to reflect on the past.",
    "The red moon, Akash, makes the world appear as if it is on fire and reminds us to look to the future.",
    "The purple moon, Ilu, is the moon from which we take our name. She is always taking on the colours of both Silun and Akash, and so reminds us that we are a product of the past and the future.",
    "We are all part of the great tapestry, the Olun'dai.",
    "The Olun'dai is not so dissimilar from the 'fate' that the people of this world believe in.",
    "I find the best way to think about it is to think about a great tapestry. The tapestry is the Olun'dai.",
    "Each of us is a thread, we have our own Olun'det which is our path through life and our place in the tapestry.",
    "We go where we are guided and in turn the tapestry grows and becomes more wonderful.",
    "When the tapestry is complete, the universe will be revealed to all who study it.",
    "I suppose the difference between our Olun'dai and your 'fate' is our place within it.",
    "Human beliefs, I notice, tend to put themselves at the centre. That humanity is the most important thing.",
    "But we ilujanka believe that no creature is more worthy than any other. Everything has its place in the grand design.",
    "My people fade away, but the tapestry will continue to be woven and we are happy just to be a few threads in the pattern.",
    "Honestly? Not well. Vindicta and I are so very different to one another.",
    "She is so full of rage, so full of hatred.",
    "Not that I can blame her. Her entire life she's been raised outside the Olun'dai, outside her people.",
    "And worse, she was raised to be a weapon. Raised by fanatics serving an uncaring god.",
    "Still. She has given me a small place in her life and it's a place I cherish.",
    "I can never make up for the years she was alone. But I can give her what time I have to give.",
    "Now we try and build a relationship. It's too late for me to tell her bedtime stories, or to sing her lullabies.",
    "So I shall teach her instead. I shall teach her how to decimate your enemies atop a great dragon.",
    "I shall teach her how to reach into the mind and urge it into battle, even from afar.",
    "I shall teach her how to sow a field and how to raise animals. I shall teach her to respect life as well as how to destroy it, if she needs to.",
    "One day I hope she thinks of me as 'father' but for now I will settle for teacher.",
    "Ah, hello, Player. You discovered this place too, I see.",
    "According to that tablet, behind these doors should rest the sleeping Nodon.",
    "I understand you have encountered the Dactyl and Necrosyrtes before. The Nodon are...were a third dragonkin creed.",
    "My research suggests there was a fourth, but I have not been able to learn even their title.",
    "More like a faction. They are all dragonkin, but the different creeds held very different philosophical ideologies.",
    "The Nodon were pragmatic. To deal with the curse, they simply went into a long hibernation. I think some of them may be here.",
    "Unfortunately, I could not open this door. I believe it needs a key - the tablet referenced some sort of crystalline device, if I understood correctly.",
    "Have you found a dragonkin device artefact and restored it yet? Something you've unearthed from the ruins, perhaps?",
    "It would be some sort of uniform multi-sided shape, like a large gemstone.",
    "Something rather like that device you're holding - you should try that on the door.",
    "Let us go inside.",
    "Indeed, they are. I believe this place is some kind of hibernation chamber...a hibernatorium, if you will.",
    "Not only sleeping. They are...dreaming? Yes, and also connected.",
    "Hmm, I believe I might be able to temporarily connect us to their dream.",
    "So long as we do not interact directly with the dreamers, we should go unnoticed. Shall we?",
    "Yes. This is a shared dragonkin dreamscape. These two are reliving a shared memory of this place.",
    "Want to see?",
    "We can disconnect from this dream if you wish?",
    "Shall we re-enter the Nodon shared dream?",
    "Pay close attention to what each of them does. Try to see what both of them do.",
    "We can disconnect from this dream if you wish?",
    "Perhaps you should follow the one that went outside.",
    "Perhaps you should stay inside this time to watch what this one does.",
    "Indeed, I heard something power down in the chamber below.",
    "Head into the lower chamber, and I will join you there.",
    "The dragonkin in these pods are reliving a different dream from the caretakers in the upper chamber.",
    "After practising on those two upstairs, I think I might be able to guide these dragonkins' dream towards Kerapac.",
    "I am picking up the term 'Kindra council' from two of these dragonkin.",
    "Perhaps their dream can enlighten us some more about him and how he thinks.",
    "I think there is more we need to learn from this dream...",
    "Not that way, Player. I am up the hill by this pool.",
    "This pool appears to be where this so-called Kindra council held forums.",
    "Are you ready for me to connect to their dream?",
    "And there is Kerapac...well, the dreamers' memory of him, at least. He is not actually in hibernation.",
    "I believe only the two Nodon are reliving this memory. The others are just as the Nodon remember them. There may be some bias in what we see here.",
    "Ah, this must be the fourth dragonkin creed. I can finally put a name to them, though there are very few accounts of them at all.",
    "I sense no mocking here. There is respect in Kerapac's voice. No doubt, this was the original name of this creed.",
    "I believe that is the end of this Nodon memory.",
    "Let me see if I can steer these Nodon to a future Kindra meeting.",
    "It is okay.",
    "Please, I must concentrate.",
    "Ah, I may have made an error in judgement.",
    "Him and this device of his. He has become a threat to the world. Would you help us stop him?",
    "We were hoping to see how his experiments fared in your other Kindra council meetings.",
    "This is going to hurt...",
    "We can disconnect from this dream if you wish?",
    "Thok is right, I can feel...something approaching the ruins.",
    "It isn't weak to hope, Kerapac, it's a belief in better things. That belief stops you giving up. It empowers you.",
    "Hope can stop you doing something terrible. Kerapac, my friend, you've lost hope and look what you've become. What you might do.",
    "Please my friend, stop this madness and work with us. We can find another way.",
    "So, that's it then? Perhaps we could evacuate some of the population?",
    "Then perhaps we should take his advice and spend time with our loved ones. I should go and see Vindicta, see if I cannot be a father to her in her final hours.",
    "I'm not sure there's much more they're willing to share, but I'll see what I can do.",
    "We can disconnect from this dream if you wish?",
    "ARGH!",
    "Can't you feel that? So...so much pain... Pain and fear... It's like a wave of suffering crashing all around us.",
    "No, Kerapac, they're just animals. Don't be so cruel.",
    "I have studied these beasts, I know their weaknesses.",
    "Indeed. Speak with Thok when you are ready.",
    "I have spent a lot of time studying these beasts at the farm on Anachronia.",
    "I will be able to subdue them, stopping them still whilst they remain in my focus.",
    "I'll focus on the stronger creatures unless you tell me otherwise.",
    "Player, it would be beneficial to move me closer to the action, I think.",
    "Move me please, not them.",
    "Where do you want me?",
    "Thanks. When I get there, I'll start attacking any dinosaurs within range.",
    "We did it!",
    "I am not sure what to do currently. You should speak with our other companions.",
    "You should be talking to Charos, to find the way to unlock Kerapac's lab.",
    "You won't find the answers out here Player, only you can enter this lab and put a stop to Kerapac's madness.",
    "Kerapac is defeated.",
    "I am saddened by his fate, but I have faith that the universe will find a place for him where he can be happy.",
    "I didn't enjoy that. Those poor creatures were just frightened and enraged by Kerapac.",
    "What...what happened to him? Where's the man that offered to save my people?",
    "I wish you well, Player. Who knows what you'll face in there. But I have faith you'll prevail.",
    "Please, Player, try and save Kerapac from himself. But if you can't... do what needs to be done.",
    "There is a way out if you follow that corridor. Hurry!",
    "We were lucky to get out of there alive. I have never seen such power!",
    "...",
    "I wish Kerapac hadn't forced the Elder Gods hands[sic]. He fought so hard for freedom, to lose it like that after everything.",
    "Imagine what he could accomplish if he had just let that anger and hatred go. He could have done so much good for his people...and mine.",
    "He never really escaped the Elder God's curse. That anger and pain, it never left him, even with the stone destroyed."
  ],
  "Prehistoric Potterington": [
    "Ooh you little flirt you. Flattery will get you anywhere my dear."
  ],
  "Nodon caretaker": [
    "Vashara check hibernatorium.",
    "Why stuck with Vashara? Vek.",
    "Always complaining.",
    "Always ask same question.",
    "Always too slow at work.",
    "Hurry up Vashara?",
    "There you are. Check hibernatorium.",
    "Opening shields now.",
    "Why stuck with Salabok? Vek!",
    "Always impatient.",
    "Always ignore me.",
    "Never takes me seriously.",
    "Hepencaraun!",
    "*unintelligible!*"
  ],
  "You hear the dragonkin use the passphrase": [
    "'Hepencaraun'"
  ],
  "Sakirth (Syrtes elder)": [
    "We are all here. I call this Kindra council session to order.",
    "We intend to seek out the leader of these elder beings - Jas - and show it our value.",
    "And you call us naive...",
    "This sounds dangerous. We would be like mosquitos attempting to feast on their blood; we could be easily swatted.",
    "This is acceptable to us."
  ],
  "Kerapac (Dactyl fledgling)": [
    "Very well, each creed shall put forth their plan to deal with Jas and the other destroyers.",
    "Of course you would side with your mate. We have been through so much to get here. Now is the time to push forward, not sleep.",
    "Our kind have spent too long in the Abyss. We were lucky that it has had no lasting ill effects on our bodies, but spending more time within it is folly.",
    "And what of the Syrtes?",
    "And you would rather we supplicate ourselves to such power than rise up to meet it? This is not the dragonkin way.",
    "Indeed, the only way to obtain respect from such beings is to match it in stature, surpass it even.",
    "Except my idea is not folly. I have been studying them and how they sculpted this universe, and have drawn up designs for a device that will not only match their power, but rival it.",
    "My device generates a new form of energy, the likes of which is unseen on this world, indeed not seen in this universe: shadow anima.",
    "With it, we can rapidly advance our civilisation and stand shoulder to shoulder with the destroyers. They would not dare oppose us, and we can live in peace and prosperity.",
    "You collectively would all rather run away to the Abyss, hide in your minds or have us become servants. These things are not the dragonkin way!",
    "...",
    "Also to the Dactyl."
  ],
  "Maragan (Nodon elder)": [
    "The Nodon are working with the other creeds to build a hibernatorium north of here.",
    "Surviving the Abyss and then building this city has taken a toll on our people. We must replenish our strength before we do anything with the elders.",
    "Hesente!",
    "What manner of beings are you? How did you invade our dream? You carry the stench of Kerapac's device.",
    "There were no other meetings. Kerapac did not keep his word, turned on his device without Kindra approval.",
    "Perhaps we have slept too long, Daraval. Very well, vekkin. You saw in our dream here Kerapac's intent for his device. Then, let me share with you the direct result of his actions!"
  ],
  "Daraval (Nodon fledgling)": [
    "The Nodon young support Maragan's plan.",
    "The technology being created is already having wider implications. Skeka is working on some experiments with the local fauna, with the assistance of the hunter, Varanus.",
    "The technology being created is already having wider implications. Skeka is working on some experiments with the local fauna.",
    "Indeed. The Nodon align with the Aughra here. We shall continue on with our own plans, but we insist your two creeds keep the Kindra informed of your own progress.",
    "Hesente!",
    "The elder asked you questions. Answer them!",
    "Maragan, I told you we should not have gone into hibernation when we were cursed! Kerapac has taken it upon himself once again."
  ],
  "Dahaka (Aughra elder)": [
    "Perhaps so, but I concur with Kerapac. We must take this opportunity to learn about this newly created universe.",
    "You cannot make peace with such beings. This is idealistic folly.",
    "Your plan for the Dactyl is sound and of value to our people, but the Kindra urges caution. For the Syrtes plan too, Sakirth."
  ],
  "Abracas (Aughra fledgling)": [
    "The Aughra are preparing many expeditions through the Abyss to new worlds.",
    "This is not a concern for the Aughra. Our minds are what makes us dragonkin; our bodies merely crude flesh.",
    "You do your kin a disservice, Kerapac. We do these things for our own betterment, not out of fear."
  ],
  "Strisath (Syrtes fledgling)": [
    "They destroyed our world, our universe, with purpose. They destroyed us unknowingly. Beings of such immense power should be respected from afar.",
    "No, once they are aware of us, they will see we are worthy of respect. We are unique within their creation.",
    "We all witnessed how easily our home was brought to ruin. We were not all so lucky to evacuate in time."
  ],
  "???": [
    "The dragonkin of the Dactyl were regarded for their scientific prowess. And none were as renowned as Kerapac.",
    "It was to riotous applause that Kerapac unveiled his latest invention. A device he promised would spark a new dawn of dragonkin science.",
    "A machine capable of generating limitless power by flooding the world with corruption.",
    "The possibilities were endless.He believed that with power of this scale, the dragonkin would rival the creators themselves.",
    "Pride precedes a fall.",
    "Before Kerapac could celebrate his creation, the Elder Gods' displeasure was made known.",
    "Jas, the eldest of them, laid waste to the dragonkin cities.",
    "In moments, the work of centuries was undone and the dragonkin fled in terror.",
    "Jas bound the dragonkin to the Catalyst, an elder artefact of great power.",
    "The dragonkin sought the power of the Elder Gods, and their wish was granted.",
    "Pride precedes a fall.",
    "Kerapac's life was spent fighting to free his people from the elder gods' chains. But in his hubris, he succeeded only in chaining himself and the unwitting Nodon.",
    "From below, a great shudder rose, the walls of the chamber began to buckle and crumble. A mountain fell on Kerapac's device, annihilating it.",
    "Kerapac and the World Guardian fled the ruins to avoid the same fate.",
    "The island of Anachronia was calm and still. Blissfully unaware of the rising menace.",
    "Then, a gentle rumbling. Slowly it grew and grew until it felt as if the ground beneath their feet would tear itself apart.",
    "The elder god Ful cleaved through the earth, and in her rage tore the volcano asunder.",
    "The elder gods were awake, and they were not pleased."
  ],
  "Kerapac": [
    "So, you have discovered the sleeping Nodon. A fascinating example of the futility of hope.",
    "The Nodon were our builders, our architects and the visionaries who were able to raise up the mightiest of dragonkin cities.",
    "Yet, when faced with the threat of the elder gods, the cowards chose to sleep through it. To dream of better worlds in the pointless hope of waking into one.",
    "Pointless. One cannot simply hope for a better world, one must be willing to do what it takes to create that world.",
    "But hope is such a powerful vice. The weakest people will always yearn to give in to it.",
    "This is pointless. There is no battle here, no conflict. You cannot stop me, I have the Needle. Still, fight me if you must.",
    "Reason has not worked, so come, witness the futility of your efforts.",
    "I am inevitable.",
    "You see now?",
    "This is no fight you can win.",
    "I control the Needle. I control time itself.",
    "Any harm you do me, I unwind and remove.",
    "Abandon hope. I have already won.",
    "There, you see now? There is nothing you can do to me.",
    "I control the flow of time as easily as you control your breathing. Any harm you inflict on me, simply never was.",
    "I could destroy you now. I could unmake your very birth. You would simply never be. I could do this, but I won't.",
    "I am not a monster. I am no wicked villain laughing from my throne of bones. I do not wish to kill this world, but there is simply no other way.",
    "The elder gods have awoken. It is only a matter of time before their eggs hatch and the elder gods tear apart not only this world, but all other worlds.",
    "My people have seen this happen, know first-hand the devastation that such an act causes.",
    "If one world is the price to prevent that happening to all other worlds. It is a fair price.",
    "But I understand how little comfort that is to you and your kind. So I offer you this gift, the abscence of hope.",
    "Know that you cannot stop me. So do not waste your final moments in fruitless attempts to thwart me.",
    "Go spend time with loved ones. Friends and family. Celebrate your lives together, bury old grievances and prepare yourselves for an afterlife with a clean conscience.",
    "Few are granted such a gift. For what little friendship we had, I urge you not to squander it.",
    "Villain? How small you think Thok, it must be quite a terrible existence.",
    "I should have expected you would remain 'World Guardian'. Defiant to the end.",
    "You have no chance, no hope, no possibility of victory and yet here you stand.",
    "You even bring the trinkets of those who would enslave or destroy you. But it will do you little good. My barrier protects me even here.",
    "I bare you no ill will, Player. I would prefer that you spend your final days in the company of loved ones.",
    "But you have chosen to fight. A single reed standing against the flood. I understand, you're a warrior, a soldier.",
    "Only a death in battle would soothe your soul. I am a generous host. You shall have your wish.",
    "I have turned the creatures of this island towards this camp. Each one of them suffers a fraction of what drove my kin for millennia.",
    "Cruel? CRUEL! You stand against me on behalf of the beings that tortured and enslaved my people for centuries and you dare lecture me on cruelty?",
    "No, I am far from cruel. I give you the gift of time, a chance to evacuate your people before I render this base camp to rubble.",
    "A kindness my kind never had.",
    "Again you stand in my way. Again you throw your life away for beings who would snuff you out in a heartbeat.",
    "I am trying to save the universe. To save creation itself!",
    "Collateral damage. This is a war, Player, a war that spans across all time and space. This is but one world, there are countless others.",
    "Without the sacrifice of this world, all the other worlds are doomed to die. Billions upon billions of lives will be snuffed out or enslaved.",
    "HAHAHAHA!",
    "You think we have not tried that? You think my people have spent centuries doing nothing?",
    "We have pleaded with the roakin. We have begged them. We have worshipped them. We have fought for them, died for them. We have done everything to placate them.",
    "None of it...none of it changed a thing. We created life. Nothing. We razed civilisations in their name. Nothing.",
    "The elder gods don't care. The elder gods will never care. They will never see our value. Never let us be free.",
    "There is no other way. Desperate times call for desperate measures and, make no mistake, we are all desperate creatures before them.",
    "So, yes, this world will die. But their sacrifice will create a universe where no one need fear for their lives from capricious creators.",
    "One world, for countless others. There has never been a fairer trade.",
    "Ah, that's where you're wrong. What I do here, I do to bring hope to all the worlds. Hope and freedom.",
    "HAHAHA!",
    "And what do you think you can do to me, little human? I control time itself, you can do nothing to me. You have nothing!",
    "NO! What have you done?",
    "NO!",
    "NO! I beg you. Not again. Kill me. KILL ME. NOT AGAIN!",
    "What...what have you done? I...I was free.",
    "I was free.",
    "And now I shall never have a choice again.",
    "I was going to save everyone else.",
    "You have doomed them all. You have doomed me.",
    "Go, 'World Guardian', you will not want to be around for what is to come."
  ],
  "Lord Daquarius": [
    "This beast is correct. With our combined forces we can level the island, tear his lair out from under him."
  ],
  "King Roald": [
    "You're right, of course, Lady Seren. Now is not the time for reckless actions."
  ],
  "Primrose": [
    "How can I help you?",
    "Foolhardy adventurers and evil dragonkin apparently.",
    "But, to more seriously answer your question, I'm afraid I really don't know.",
    "As Gail, I kept myself hidden, so I never had to face anyone in battle. So I have no idea what my weaknesses are.",
    "I'm afraid elder artefacts don't come with a guidebook.",
    "It was wonderful. She was so...free.",
    "As Gail, I could go anywhere, be anyone.",
    "Well, as long as I didn't stray too far from the Needle.",
    "Something like that. The Needle and I were deeply connected. It was a part of me as I was a part of it.",
    "It's an impossible to describe bond. Like we were attached by the soul.",
    "You're wondering if we can turn that connection against Kerapac?",
    "I'm sorry, I have no idea how I'd do that.",
    "I'm healthy and I'm home. There's been a lot of difficult conversations, but we're getting through them.",
    "Mum's been really trying. She's still overly protective, but she's learned to let go. She even let me write a letter to Sloop.",
    "He's...he's with someone else now.",
    "But we're still friends.",
    "I don't quite know whether I'd call what Kerapac did to me a good thing...but it's not all bad.",
    "I do miss Gail a bit, though.",
    "Ah yes, that. Being connected to the Needle is...indescribable. Past and present so easily melded together and I could undo any mistake with a simple gesture.",
    "No one should have that power.",
    "I'm sorry I have no idea. It's powerful, and it protects itself.",
    "How do you harm something that can undo whatever harms it?",
    "You're really asking the wrong person there. I was its agent, its...voice, I suppose. I wasn't its master.",
    "The Needle has a will of its own, you see. As Gail I could direct it, but I could never act against it.",
    "Not really. Not like you or I. But there's a power there, a strength that threatened to overwhelm me if I wasn't too careful.",
    "Not that I know of, sorry. It can manipulate time itself, there's no defence against that.",
    "Haha. I really don't know what I can tell you there, but I'll help where I can.",
    "I'm sorry I couldn't be more helpful."
  ],
  "Voice of Jas": [
    "Speak.",
    "Yes.",
    "You have insufficient carrying capacity.",
    "Rectify this and return.",
    "Bring this to the dragonkin.",
    "It will correct the mistake.",
    "No.",
    "It will remove his control of the Needle.",
    "Then we will resolve the situation.",
    "Damage to the island will be minimal.",
    "If you act quickly.",
    "We cannot allow this situation to persist too long.",
    "Act now.",
    "Or we will.",
    "Yes.",
    "Yes.",
    "No.",
    "No.",
    "The dragonkin is defended.",
    "He is shielded by the toxic substance.",
    "It is toxic.",
    "Anathema.",
    "You attempt to insult us.",
    "Only proves your lack of value.",
    "The distinction is meaningless.",
    "We are the mechanisms of creation.",
    "Our intention and action are indistinguishable.",
    "It is a barrier of the toxic substance.",
    "Its presence is anathema.",
    "We cannot abide.",
    "Do not misunderstand.",
    "Our inaction is now a kindness.",
    "We can still remove him if we must.",
    "But the island will be removed with it.",
    "The resulting tidal forces.",
    "Will destroy your settlements.",
    "We assume you did not want this.",
    "Were we incorrect?",
    "To unpick and stitch together the strands of time.",
    "To undo mistakes and recover the lost.",
    "So that the anima of a world may bloom.",
    "Yes.",
    "It can be unmade.",
    "Or it can be deactivated.",
    "We can assume control.",
    "But we must be in its presence.",
    "But the dragonkin prevents this.",
    "No you cannot.",
    "Your nature prevents it.",
    "You are not compatible.",
    "To make them useful.",
    "The Catalyst needed protecting.",
    "They possessed the required qualities.",
    "We do not recognise this term curse.",
    "The function of the binding was to protect the Catalyst.",
    "We linked their pain receptors to the usage of the Catalyst.",
    "We are aware that mortal life is motivated by these impulses.",
    "As the pain impulses increased we also amplified their other neurological functions.",
    "This resulted in increased reflexes, speed, magical aptitude.",
    "Combined and directed this served as an efficient system.",
    "Your rage is irrelevant.",
    "They served no purpose.",
    "So they were given one.",
    "It is the toxic substance.",
    "It destabalises[sic] and destroys.",
    "It is anathema to this universe and our design.",
    "It cannot be permitted to be created.",
    "No.",
    "Enough!",
    "This experiment is over.",
    "I have reached my verdict.",
    "Mortal life shall end.",
    "Regained control.",
    "The Needle connects you.",
    "The Needle is mine.",
    "You are mine.",
    "No.",
    "Death is denied.",
    "You will serve us now.",
    "As will those connected to you.",
    "Their dream will serve us.",
    "You have achieved your goal.",
    "We will resolve the rest.",
    "You should leave."
  ],
  "Moia": [
    "So that's it then, the Elder Gods are quite happy to wipe out whole cities if it protects them?",
    "No one thinks you're funny you arrogant pigeon."
  ],
  "Laniakea": [
    "I'm here to help!",
    "Don't start without me!",
    "Let's do this!",
    "I had enough time to prepare some poison bombs.",
    "When the dinosaurs are outside of my melee range, I will throw the poison bombs at them.",
    "If they get too close I'll use my spear. It's safer than spilling poison on myself.",
    "I'll target the dinosaurs furthest away to make the most of my poisons. Let me know if you want me to change focus."
  ],
  "[Character]": [
    "Where do you want me?"
  ],
  "Archaeologist": [
    "Ahhhhhh!",
    "HELP!",
    "SO MANY CUTE DINOSAURS...",
    "Why are you all so SCARY?"
  ],
  "The following text is transcluded from Transcript": [
    "Kerapac's tablet."
  ],
  "Black stone dragon": [
    "Asssssh!",
    "Hsssssss...",
    "Reeeeee!",
    "Tssssss!"
  ],
  "Brundt The Chieftain": [
    "Haha Kerapac bound again? Serves him right the arrogant monster!"
  ],
  "Oneiromancer": [
    "Regardless, Kerapac's threat is over. But I worry about what damage his war has brought us."
  ],
  "Sir Amik": [
    "Indeed. The battle is won, but the dust is far from settled."
  ],
  "Congratulations! You have completed": [
    "'Desperate Measures' - Complete this quest."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Desperate_Measures?oldid=36197216’"
  ]
}