{
  "Gudrik": [
    "Hello there, [laddie/lassie]! What can I do for you?",
    "I've received some troubling news, [laddie/lassie]. As you probably know, supplies are ferried over to Ashdale on a regular basis. But about a week ago, the supply ships started returning with their cargo still aboard. Apparently, the island has been completely deserted – not a soul to be seen – and the sailors say an evil aura hangs over the place. Naturally, I'm eager to find out what's going on, but I'm too old to go jetting off on an adventure. I need someone to travel to Ashdale and investigate.",
    "I knew I could count on you, [laddie/lassie]. When you're ready to leave, just head out onto the dock. The boat will take you directly to Ashdale. Good luck, [laddie/lassie].",
    "Alright, [laddie/lassie]. Whenever you're ready.",
    "Hello there, [laddie/lassie]! What can I do for you?",
    "When you're ready to leave, just head out onto the dock. The boat will take you directly to Ashdale. Good luck, [laddie/lassie].",
    "Welcome back, [laddie/lassie], and congratulations. Sounds like you had quite an adventure. To think that those creatures were beneath the island all that time! Makes my skin crawl just to think of it.",
    "Oh, aye, I nearly forgot! Here you go, [laddie/lassie].",
    "There are all kinds of things lurking beneath the surface of the world – things most folk would turn and run from. But you stood your ground [laddie/lassie]. You should be proud.",
    "I daresay there are. Without their leader they probably don't represent much of a threat, but it might be a good idea to go back to Ashdale once in a while and help keep the numbers down."
  ],
  "Lucy": [
    "Who... Who are you?",
    "Oh, thank Saradomin!",
    "Thank Saradomin – help at last!",
    "We were attacked by these ... creatures. Horrible, horrible creatures, like something from a nightmare. They came out of nowhere, and before we knew it, we were surrounded. We made barricades, but the creatures just climbed over them. I managed to avoid them by hiding in my attic, but the others...The others weren't so lucky.",
    "The creatures took them away, but I don't know where. I remember seeing them dragging off poor Digory. Oh, it was horrible.",
    "I don't know – I didn't see where they went, and I didn't dare leave my hiding place. If I had to guess, I'd say they were hiding underneath the island somewhere, but I don't know for sure.",
    "What, on my own? You need more than one person to sail a ship, you know! No, all I could do was wait, and hope that someone would come to help. And now someone has!",
    "You're not going to leave me, are you? You have to get me out of here.",
    "But... I understand. If you want to get to the other side of the island, your best bet would be to use the sewers. The barricades will make it hard to navigate the streets, and if there are any of those creatures around, you don't want to get caught while you're clambering over a stack of barrels. There's an entrance outside, just through the back door. Please be careful. And don't forget about me!",
    "Yes?",
    "Your best bet would be to use the sewers. There's an entrance just outside, through the back door.",
    "You did it – you saved them! I never thought I'd see my friends and family again. Saradomin bless you! Are you heading back to the mainland now?"
  ],
  "Player": [
    "What happened here?",
    "I need to get to the other side of the island.",
    "I have to find the other townspeople.",
    "I need to get to the other side of the island.",
    "Don't you ever tire of having to be rescued?"
  ],
  "Ned": [
    "To think I was almost turned into one of those ... things!",
    "You impudent rascal! In my day, people treated their elders with respect!",
    "Yes, but for how long? The way things are going, I'd be better off living on the mainland!"
  ],
  "Hendrik": [
    "We have much to thank you for, my friend.",
    "May Saradomin watch over you."
  ],
  "Sarah": [
    "Looks like you saved the day. Don't you ever tire of being a fearless hero?",
    "Haha!! Good one."
  ],
  "Magda": [
    "You have delivered us from a terrible fate, my child.",
    "I always said you had potential. I'm glad to see I was right."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:A_Shadow_over_Ashdale?oldid=26847710’"
  ]
}