{
  "Commodore Tyr": [
    "...which is why I suspect none of our knights can do the job. It needs expertise we simply do not have.",
    "She also knows more of their habits than any of us in the Order, despite our constant fight against them. You said yourself she would be useful fo-",
    "Captain! Get yourself under control.",
    "Ah, Player! Your timing is perfect, I was about to contact Sir Tiffy to ask if you were available to help us.",
    "We've had no luck finding that escaped pest, and Sir Tiffy's agents have been drawing a blank too. I propose to send you, Korasi and Jessika to the mainland to track it down. If you're willing?",
    "Sir Tiffy tells me that his agents have been unsuccessful in locating the escaped pest. As of his latest communiqué, he has recalled the majority of them to deal with an unknown malady affecting Falador.",
    "He wouldn't commit. Anyway, that leaves the problem in my hands and that's why I need you. I would like you to take Captain Korasi and Jessika to the mainland once you're fully briefed and put your tracking skills to use.",
    "I'm afraid our skills have become somewhat specialised in recent years. It's a deplorable lack of balance, and one I intend to rectify, but that will take time. We know you, we trust you, and you have a wide range of worldly skills. You're the ideal agent for us.",
    "Yes, and Korasi is not pleased by my decision.",
    "In talking with Jessika, however, I am reassured that her intentions were good, if not her actions. I have convinced her that the pest must be brought in, and she is willing to use her considerable knowledge of pests to assist. Korasi's role on this mission is to keep Jessika under guard.",
    "Jessika smuggled the pest off the island by stowing it away on one of our ships, so its first landing point would be Port Sarim. If it isn't there, it will have passed through, so someone in town may have seen it.",
    "Be careful out there. Jessika may think the pest is safe, but her judgement is clouded on that point. Have a word with Korasi if you need to, then head for Port Sarim.",
    "Player, once again we owe you a debt of thanks. I have our Temple Knight allies standing by. Please report.",
    "Disturbing news. Savant, did you get all that?",
    "Nonetheless, the operation was a success. Thank you all.",
    "Thank you once again for your services, Player. We shall work with the Temple Knights to find out what happened to the cubes that already shipped, and keep you informed."
  ],
  "Captain Korasi": [
    "I agree with that, sir, and would happily work with Player again, but I believe it's a mistake to let Jessika free. She released the pest in the first place, and Commodore Matthias lost his life trying to set that straight!",
    "Damn what I said! Matthias was right then and it's still true: she's a liability!",
    "My apologies, sir.",
    "There's an understatement...",
    "I don't care what the Commodore says, I don't trust her. I'm going to keep an eye on that mage in case she tries to sabotage the operation for the sake of her pest friend.",
    "Yes. Well, I'll go and collect her and meet you at Port Sarim docks when you're ready.",
    "Our work is done, we must reeport to the Commodore at once."
  ],
  "Player": [
    "Am I interrupting something?",
    "Help with what?",
    "Consider me at your service, Commodore. What's the plan?",
    "Does he believe they're connected?",
    "Why do you need me? I'm happy to help, but do none of your knights have tracking skills?",
    "Wait, you're sending Jessika? The one responsible for releasing the thing in the first place?",
    "Where should I start?",
    "I'm on my way.",
    "Sounds fair to me. That's one of the reasons Tyr wants you along, no?",
    "So, I hear you're to come with me and Korasi to the mainland.",
    "Hmm. Well, good luck with that, although I suspect Korasi will take some persuading.",
    "Hi, Jessika.",
    "Greetings, Korasi.",
    "Got it: stay close to the town and look for signs of scavenging.",
    "On my way.",
    "Greetings, Korasi.",
    "What do I need to do next?",
    "I'm looking fot an escaped animal.",
    "No, thank you.",
    "I'm looking for an escaped animal.",
    "Yes! That sounds exactly right!",
    "Hmm. Thank you kindly.",
    "No, thank you.",
    "Thanks for your help.",
    "Greetings, Korasi.",
    "I'm tracking the pest's trail from the fishmonger's shop. I'll let you know once I have more.",
    "Am I interrupting something?",
    "I've tracked the pest down to a burrow entrance, and I believe we can gain access to it from the cellar of the Rusty Anchor pub.",
    "What was that about Void Knight beliefs?",
    "Yes, I am.",
    "See you there.",
    "Alright.",
    "Good day to you!",
    "I have reason to believe that there is a dangerous animal burrowed under your pub. May I investigate for you?",
    "Erm, are you alright? Dangerous animal on the loose! Possible otherworldly terror in your basement!",
    "I'll just get right on that. Don't strain anything.",
    "Hello, Korasi.",
    "What's up, Jessika?",
    "Pet?",
    "It looks like a storeroom for the beer, Jessika.",
    "This wall looks dodgy, like something has disturbed the ground behind it. Perhaps if I knock a hole in it I'll find the burrow.",
    "What's up, Jessika?",
    "Why would we want goo?",
    "Would a bucket or similar do?",
    "This place is in a mess, Korasi.",
    "Korasi, can you help me set this back where it was, please?",
    "Give me a hand getting this lot untangled, you two?",
    "Got it, Jessika! I'll be right out.",
    "Okay.",
    "Good day to you!",
    "Here's your key back. I'm afraid you had a gas leak, caused by light reflected off a planet through a weather balloon.",
    "It's fixed now, though.",
    "Here's your key back. A void pest had made a burrow by your cellar and filled it with weird goo stuff.",
    "We've extracted the stuff and we'll continue hunting the pest.",
    "Good day to you!",
    "I told the bartender a story to keep him calm.",
    "I told the bartender what was going on. He took it well.",
    "Weren't the sailors on the Musa Point route complaining about being ill lately? And we know the bartender got unwell from being around the pest for too long...",
    "You said the bartender was acting oddly?",
    "Hmm, true. Do you think it's related to the pest?",
    "Will I have to fight this thing?",
    "Enough, both of you! Can I get a straight answer, please?",
    "To Musa Point, then.",
    "Greetings, Korasi.",
    "Certainly.",
    "I'd be interested to know, too.",
    "I'll leave you two to it.",
    "Seen anything odd lately?",
    "Hmm. I think I should pay him a house call.",
    "I have reason to believe that something I am tracking is in the area. Have you seen anything strange moving around here recently?",
    "That sounds promising! Can you take me to where you last saw it?",
    "What? But this is important!",
    "Hmm... Are you feeling listless? Depressed?",
    "I thought as much. Alright, then, what if I made it worth your while somehow? The alternative is I keep bothering you until you relent.",
    "What will that take?",
    "Plank and a log?",
    "I do wish you'd string more than four words together at a time.",
    "I've sorted your wall for you. Now it's time you upheld your side of our deal.",
    "Hmm, yes, I think I have enough to go on. Thank you for your help.",
    "So we were too late. What's our next move?",
    "Yes. Look at these: some sort of wood shards.",
    "I've not heard of waxwood.",
    "So, Jessika, how do you know about waxwood? I've never seen the stuff before in all my experience of cutting wood.",
    "Is this place really what the pest plane is like?",
    "That's a pity. I like seeing new places.",
    "Onwards, then.",
    "I need to ask you about these waxwood shards I found.",
    "Boxes made of waxwood? Wouldn't they be really ugly, clumsy things?",
    "Hmm. How much can you tell me about this order? I think it's important.",
    "Thanks for your help, Rommik.",
    "Hi, you two.",
    "Rommik last saw waxwood when making a large number of boxes for a customer in Falador. It sounded suspicious, but he couldn't remember the customer's name or describe them.",
    "Can either of you two lend a hand?",
    "So, no help then.",
    "Any thoughts on where the pest might have been taken, or by whom?",
    "I'll see about this experiment, then.",
    "Then the three of us should get to Falador at once. This could be serious.",
    "Now might be a good time to give you an update on the situation, Sir Tiffy.",
    "Not yet, Sir Tiffy.",
    "Hello, Ali.",
    "Why would I want a box?",
    "A mystery prize, you say? Is it good?",
    "Tell me a little more about them. I might be interested.",
    "Yes, yes, all of that. How about, say, where you got them? Or who made them?",
    "Okay, okay. Then I take it you'll not tell me what's in the things either?",
    "I suppose I'd better have one of those boxes, then.",
    "What is this? I don't even... This doesn't make any sense! Argh! I don't think this is even feasible!",
    "I couldn't get anything useful out of him. I did get hold of a box, though.",
    "I've tried. It's a very strange puzzle; I can't make any headway with it.",
    "Well, now what?",
    "I think we'll have to blow it open.",
    "We could drop it off a cliff.",
    "It's made of wood; we could set it on fire.",
    "We'll need to sheathe the framework in metal to reinforce it.",
    "The framework would need to be imbued with rune energy in order to withstand the blast.",
    "We could reinforce it with a layer of marrentill tar.",
    "We'll need to put a bowl under the box to catch whatever falls out.",
    "That's fine, then; I think we're done.",
    "Once the box cracks, we'll need a way to catch whatever comes out. I could craft a device that registers a change in weight and opens a sampling box below.",
    "And the box is just a veneer of oak over a waxwood frame...",
    "Will do, Sir Tiffy.",
    "Not yet. I'll keep trying.",
    "Hello, Ali.",
    "I think not. I've just been learning about a set of boxes that seem remarkably similar to yours.",
    "Yeah, really. Where did you get these boxes, Ali?",
    "I think you're lying to me, Ali.",
    "Yet.",
    "Hello, Ali.",
    "I want to examine your stock.",
    "I'll be back with a way to deal with you.",
    "Why are you selling boxes full of goo?",
    "I'll be back with a way to deal with you.",
    "Aren't you ashamed of yourself? Those boxes are dangerous!",
    "In the name of making a quick buck.",
    "I'll be back with a way to deal with you.",
    "I'm afraid not. They're only being distributed here by Ali Tist. He didn't make them and he won't tell me who did.",
    "I need your help, Sir Amik. There's a vendor in town, Ali Tist, who's selling dubious goods, and I really need something to persuade him to spill the beans. Can you provide me with some form of leverage to use on him?",
    "There's no time for internal politics! This man could represent a direct threat to the safety of the city itself!",
    "Thank you kindly, Sir Amik. I'll have this all sorted out as soon as I can.",
    "I have this warrant from Sir Amik that entitles me to search Ali's stall.",
    "Hello, Ali.",
    "I want to examine your stock. And I have this here warrant that says I can.",
    "Sorry, but as is stated on the warrant, I can. Unless you care to be a little more forthcoming?",
    "I think you'd better give me that clue scroll.",
    "Hm, I should probably report in to Tiffy and Korasi before heading out.",
    "Why are you selling boxes full of goo?",
    "Aren't you ashamed of yourself? Those boxes are dangerous!",
    "In the name of making a quick buck.",
    "A clue scroll.",
    "Ali was given it anonymously and it led him to those boxes. I thought I'd follow the trail myself.",
    "I'm still following the trail Ali put me onto.",
    "I'd rather not report my progress until I have some progress to report.",
    "Sorry to interrupt such a touching moment, but I've made a certain amount of progress.",
    "Not yet. I'm west of the city now and I've found a new clue scroll.",
    "What exactly did I just interrupt?",
    "I'll keep you updated.",
    "That's classified, sir. Player to Korasi; come in, please.",
    "I found another clue south of the city. The trail isn't veering too far away from Falador.",
    "Hello there.",
    "No, sorry.",
    "You've still got what you're carrying, though.",
    "I followed the last portion of the trail on Ali's scroll. It ended up at a locked hatchway just outside the Black Knights' Fortress.",
    "It might not be anything to do with them, but I think we'll find out soon enough.",
    "Hello, you two. Are you both ready?",
    "Very nice! Now, then, shall we?",
    "Well, we're in. This must be where Ali found the boxes.",
    "There's not much we can do about the workers; we'll just have to avoid them.",
    "Psst.",
    "Actually, it sounds reasonable to me. If you're certain you can control it?",
    "Not yet.",
    "I don't know, he/she won't talk to me.",
    "Nothing. I just said, I can't get th-",
    "In unity we overwhelm.",
    "I have it here. Is everything alright?",
    "Good thing security is so tight, then.",
    "Secret handshake? Through a door? Nobody told me about a secret handshake!",
    "I'm pretty sharp.",
    "Hi, Jessika.",
    "No promises, but I'll see what I can do.",
    "Greetings.",
    "I'm sorry. This is for the greater good.",
    "Aye, Captain.",
    "Good grief, look at that thing.",
    "You can talk?",
    "Jessika, this creature seems to have imprinted on you pretty hard. It's referring to you as its 'mother'.",
    "What happened to you?",
    "Do you know why?",
    "Tell me about yourself.",
    "What are you? What is your purpose?",
    "And to invade our world?",
    "Enough of this.",
    "It's clear you could be no threat, and I would rather not kill an intelligent being under such circumstancs. Get out of here, and find a remote place away from humans to live out your remaining days.",
    "I'm sorry, but I can't let you live to potentially harm others, whether deliberately or not.",
    "Commodore, we've returned. I'm pleased to say the escaped pest has been found and dealt with.",
    "Which led Jessika to conclude that the remaining cubes have already been shipped elsewhere."
  ],
  "Why do you need me?": [
    "(Same as above.)",
    "(Same as above.)"
  ],
  "Wait, you're sending Jessika?": [
    "(Same as below.)",
    "(Same as above.)"
  ],
  "Where should I start?": [
    "(Same as below.)",
    "(Same as below.)"
  ],
  "Jessika": [
    "Yes, I've been speaking to the Commodore. I'm willing to help as long as the pest is dealt with humanely. Perhaps by helping I can regain the trust of the Void Knights. I find my betrayal worries me more than I imagined it could.",
    "Hi, Player!",
    "We don't want to alarm anyone. There's no need for people to know just what you're chasing.",
    "Void pests are a hive society, like bees, and like bees they have castes. This one seems to be a gatherer of some sort, but I never got to properly examine it, and I'm not enough of a summoner to talk to it directly. Though I do know that without a guiding influence nearby it'll be acting mainly on instinct. It'll try to find a source of food, and that will be easiest around human dwellings.",
    "Because we throw lots of food away! I think it'll scavenge - it can't hunt for itself.",
    "Good luck.",
    "Best of luck, Player!",
    "Best of luck, Player!",
    "I admit I never knew why Void Knights have such...hatred for the pests. Fighting them is one thing, since they are invaders, but I'm only now beginning to understand how far it goes.",
    "Roger that, sir!",
    "Sorry. You just have that whole aura of command thing going on.",
    "You said our missing pet made a burrow near here?",
    "Pest. Have a look around and see if you can find anything out of the ordinary.",
    "Come and look at this wall, Player... does it look odd to you?",
    "What on RuneScape is that stuff? Player, can I have a word, please?",
    "That's very curious stuff... We should take a sample of it.",
    "Because it's something I've not seen before and it may give us clues or insights into our pest. I'll need you to get a container of some sort. Swiftly now, before it's all wasted.",
    "Not by the looks of that flow of material. We'll need an empty barrel or something... Maybe there's one in the storage room next door?",
    "We'll be able to keep this by and find out more about its properties once we've retrieved the pest.",
    "Good. He doesn't need the worry.",
    "Did you really need to scare him like that?",
    "Regardless, we should keep after the pest. I wish I could ask Professor Melville. He'd know what to do, but he's not been answering my contact spells for a while.",
    "Well, having rested here I suppose it'll be heading to warmer climes.",
    "And if it can stow away once it can do it again - it's certainly intelligent enough.",
    "Musa Point! It's easy to reach, warm, jungly... A ship that goes to Karamja would smell right to a pest. Yes, it makes sense.",
    "Now you mention it, it did seem odd that the bartender would just let three strangers into his storage cellar without protesting or coming to keep an eye on us.",
    "Now wait a minute! Why do you have to assume the worst about the pest? He never gave me any reason to think he was capable of such an attack!",
    "That's ridiculous.",
    "It's not a warrior. It's slow and unarmed and of no danger to anyone.",
    "They're not mindless monsters, Korasi! They're just finding themselves in the wrong place at the wrong time.",
    "They have no choice! Their queen commands them, compels them somehow. From my research I'm sure of it! She's the one you should be concerned with, not the dwarf cannon fodder.",
    "It has no martial skill at all. It can't defend itself from you if you choose to kill it when you find it.",
    "But that's a sign we might be on track. Player, do you think you could see if the townsfolk know anything about your prey?",
    "I still can't for the life of me think what makes you think the pest is causing that. I lived with it for weeks without ever going doolally.",
    "Look, Player, this isn't your argument. We'd join you, but I suspect we'd just get in the way.",
    "Well, it was Professor Melville that suggested it, the fellow who trained me. He's a bit of a grump, but a brilliant man. I wasn't sure at first, but he was so insistent. He said that since portals were a travel device that shared many similarities with summoning, and since the void pests are always active, I'd have plenty of samples to examine.",
    "Oh, Professor Melville wouldn't have asked me to put myself in danger! I was only observing, not fighting. He was so interested in my work, and so happy for me when I managed to extract one from the hive.",
    "Regardless, I learned a lot! And he helped me study summoning to improve my study of their portals - it's a speciality of his.",
    "And put up quite a struggle, too.",
    "I suspect our first move is to find out more about that goo and the effect it's been having on the people near it.",
    "That looks very much like waxwood.",
    "That's not surprising. It's not a popular wood as it's too ugly and can't be treated, but it is naturally waterproof, so it's used in a number of scientific experiments. The two of us need to get that goo sample to my chemist friend in Rimmington. Perhaps you could go via the craftsman next door to him and ask about the wood? His name is Rommik.",
    "It's horrible stuff, isn't it? But it's good for making waterproof containers you can't use metal in, and it's cheaper than glass.",
    "That's right, for my analysis of pest blood! I was trying to find out if they had some sort of blood-borne affinity for their portals! But that didn't go anywhere.",
    "Really? I didn't know that.",
    "The portals themselves are fatal to travel through for anything that isn't a pest. I was researching that just before, well...you know.",
    "Would you be able to assist him? I suspect whatever we find will be significant in explaining where our missing pest is.",
    "Sorry, Player, all the chemistry I know I learned at the Wizards' Tower, and wizards tend to limit their chemical studies to applied uses of rune essence. I always meant to learn some herblore when I went to the druids, but I never quite got that far. I spent all my time studying summoning when I was in Taverley.",
    "Sorry.",
    "I'm sure you'll pick up the trail again, and when we find the pest, we'll find the people who took it.",
    "I quite agree!",
    "That would explain the lethargy striking Port Sarim and Musa Point! They're feeling drained because they ARE being drained!",
    "I can teleport the three of us there now if you wish.",
    "Isn't it lovely? I never got a chance to visit when I was at the Wizards' Tower, I was always too busy.",
    "Arcane summoning, largely, and its distinction from druidic summoning. Portals and evocation too, of course - those are on the core curriculum.",
    "Professor Melville encouraged me to study it to further my main studies, yes, though I never got very far. Anyway, to business.",
    "You think he's somehow connected to all this?",
    "Did you have any luck, Player?",
    "I have an idea! Let's do this the unsubtle way... Player, let's plan how to get this thing open. Let's see, now...",
    "Yes, that could work. We'd have to smith up an adamant framework to contain the box once we'd blown it open, though.",
    "Yes, that could work. We'd have to station someone at the bottom of the cliff to run back up with it, though.",
    "Yes, that could work. We'd have to be ready with water to put it out once it had burned through, though.",
    "Hmm, true. Then we would need some sort of timed charge to explode in the box behind the sheath.",
    "Hmm, true. Then we would need a fuse of some sort to be able to light it through the magical containment.",
    "Hmm, true. Marrentill tar is horribly unstable - it's used to feed salamanders - so it would help open the box too.",
    "Yes, a good plan. Also, we- (Continues below.)",
    "Yes, a good plan. Also, we- (Continues below.)",
    "Yes, a good plan. Also, we-",
    "A puzzle that can't be completed on a box that doesn't open, which is full of life-sucking goop. What's going on here?",
    "That was pretty impressive, Korasi.",
    "Excellent! That should make him spill the beans.",
    "It was only natural, Korasi. What I did went against all of your precepts, and you blamed me in part for Matthias's death, yes?",
    "What's prompted this change of heart?",
    "It's not too late to be friends, Korasi.",
    "It sounds like whoever planted this trail didn't want Ali losing interest.",
    "It's Jessika, Player; Korasi's talking to Sir Tifffy. You're close now, I'm sure of it! Oh, and Player...I wanted to thank you. By having faith in me and giving me the benefit of the doubt, you've given me the chance to see what I'd been blind to all the time I was at the Void Knight Outpost. I've come to know Korasi as a friend as well. I think it's clear what I have to do now.",
    "I'd like to accompany you, if I may.",
    "Agreed. I want to see this come to an end. And, um, Korasi?",
    "When all of this is over I'd like to, er, enlist...if it would be allowed.",
    "I've seen the havoc just one free pest can cause and it's not even a warrior. Even though they're not the mindless, unfeeling creatures everyone thinks they are, they're still a threat to human life... I know we didn't start out at the best of terms, but I hoped that you might, um...write the recommendation I'd need.",
    "Why would they lead him right to them?",
    "Any suggestions?",
    "Right here, Player.",
    "Can we try to avoid killing this one? Please? I'm sure you can knock him out or something instead.",
    "I may have an idea...",
    "If we can get a small and sneaky summoned creature up to the door when a worker is entering, it could listen to the password and tell me what it is.",
    "Because what I summoned would be a void drone. Professor Melville taught me the technique and I applied it to void pests.",
    "It would be entirely under my control, I assure you! I've summoned this same one before.",
    "Entirely.",
    "Have you got my drone up close to that door yet?",
    "How did my little boy/girl perform? (Depends on the player's gender.)",
    "Ah, well, they're fiercely loyal if you treat them right. What do you have for me, my lad/lass?",
    "Not you.",
    "With pleasure.",
    "Morning, sir. In unity we overwhelm; may I come in?",
    "Um. Oh dear. I seem to have left it in my other labcoat...",
    "I'm sorry to report that I've had no success with the doorkeeper. We need some form of identification.",
    "I don't go on many field missions. Are they always this tense?",
    "Please try to leave the workers alone if you can. I know they'll have their own keys, but they're unarmed and not truly Black Knights.",
    "It's the pest! By Guthix, what have they done to it?",
    "They look sort of intimidating.",
    "We made it! You know, between us, we make a pretty good team.",
    "Look at all that equipment! How could they do that to a feeling, thinking creature?",
    "The more I see, the more I'm convinced that fighting to redress the balance of the world is the right thing to do.",
    "Oh, the poor thing.",
    "He can talk? Hmm. Perhaps you can understand him due to your skill in summoning...",
    "Really? Well, perhaps a little kindness goes further than expected.",
    "Thank you, Player. (Continues below.)",
    "It didn't deserve that. (Continues below.)",
    "Anyone else think that's a lot of storage space for not very many cubes? We passed through several large and mostly empty storerooms on our way in...",
    "We need to tell the Commodore what we found.",
    "You would have been proud of the Captain, sir, she was magnificent! Her combat and command skills are truly impressive.",
    "Oh, Korasi, thank you!"
  ],
  "Korasi": [
    "Time to put those tracking skills of yours to use, please. (Continues below.)",
    "Good day to you, Player. Time to put those tracking skills of yours to use, please.",
    "You may wish to start with the dockworkers. They might have seen something disembark.",
    "That's not my area of expertise: I just kill them. Jessika?",
    "...",
    "Good day to you, Player.",
    "I would suggest finding out whether anyone on the docks has seen the pest.",
    "Good day to you, Player.",
    "...and when they appeared, ravaging the land in defiance of all balance, the Void Knights of old knew that the moment they had been formed for had come.",
    "Jessika asked me to tell her more about Void Knight beliefs. I have agreed, as it may be that her actions earlier were the result of ignorance rather than malice.",
    "Hmph. If you can grasp that their presence is an imbalance and a blasphemy against Guthix, there may be hope for you yet. Now then, Player, I take it you have news?",
    "Good work. Have a word with the pub owner and we'll meet you there once you've gained access.",
    "Are you interested in learning more?",
    "Here's a spare copy of the book I've been teaching Jessika from. Perhaps you will find it useful too.",
    "Have a word with the owner of the Rusty Anchor and get into the cellar. We'll meet you there.",
    "Good. Now then, you two, please see what you can find.",
    "What?",
    "Well, I have had the full Void Knight officer training. I'm glad to see it's had some effect.",
    "Hello, Player. This sort of investigation is more Jessika's field than mine, I think.",
    "See if you can find us that empty barrel, please, Player. I've given you a Void Knight whistle in case you get into difficulties. A short peep and we'll come and help you move a barrel back a step, a long blast and we'll give you a hand setting the room back how it was.",
    "Good work, Player. Thank you.",
    "That was quick thinking, Jessika, I'll give you that much. Player, could you please make up some story for the pub owner? We'll meet you back at the ship to discuss our next move.",
    "I'm sure he could have handled the truth. (Continues below.)",
    "I'm sure he can handle the truth. (Continues below.)",
    "What's our next step, then? We need to find this pest before it seriously unbalances the local ecosystem.",
    "Hmm, yes, the pest's home plane is mostly tropical jungle from what we know of it.",
    "We need to be careful. That bartender fellow was acting very oddly. If it has something to do with your pest, it might be capable of doing to us whatever it did to him.",
    "He seemed...sick. Listless. As if he had no energy or inclination to care about anything.",
    "Who knows what sort of attacks this pest can use on the unprepared? He could have been the victim of a mental assault of some kind.",
    "What if 'he' was using it on you all the time? To make you susceptible to its suggestions to release it?",
    "It's a void pest. If it can kill you, harm you or make your life unpleasant in any way, it will.",
    "And doing their best to infest and scour that place when they find themselves in it. I can't believe you're defending them!",
    "And if she's wrong, well, I'll be at your side to assist.",
    "Hello, Player. I'm not a great fan of this place. The air feels like the stuff that blows in through the pests' portals.",
    "I would suggest you watch out for signs of odd behaviour among them, too.",
    "All that proves is that it never attacked you with...whatever it's attacking people with, because you were such a willing dupe for it!",
    "I'd suggest you start with the bartender here. They tend to have useful gossip. In the meantime, Jessika, maybe you'd fill me in on the details of how you came to study the pests? You seem sensible enough where they're not concerned... What gives them such a hold over you?",
    "He sent you to pest-infested territory?",
    "Pests wouldn't care.",
    "Curses. It's clear that it was here, and equally clear it's been taken.",
    "If we can't follow it directly, we'll have to find where it's been taken by other means.",
    "Agreed. Player, please see if there's anything more to be discovered in or around the burrow.",
    "Have you found anything of use?",
    "Waxwood shards?",
    "Well, I believe our work here is done.",
    "You know, I think I remember you using a tray made of it.",
    "I don't agree. You might not have found what you were looking for, but the infortmation you provided was what Matthias needed to commission new field medicines that have saved a dozen lives already.",
    "We would have told you, but it was just after we started using it that your...indiscretion was discovered.",
    "Well, from what we can tell from our side of the portals and the air that blows in, yes.",
    "I fear this is one you will not be visiting. I supported Jessika's research, but I never throught she'd find a way through. Sorry, Jessika, but it's the truth.",
    "Ah, Player, glad you're here. What have you discovered?",
    "Good work. We've been trying to help the chemist with his experiment, but, frankly, neither of us know enough about herbs to be of any use.",
    "I suspect you'd be more use than me, Jessika. All I know about analysing substances is what blood comes from what pest. Not that I regret my...specialisation, but I do envy your education just a little.",
    "Sorry.",
    "Sorry, Player. You're the hunter, not us.",
    "We both have complete faith in your skills. And right now, it's your analytical skills we need.",
    "Indeed. We'll meet you in the park... unless you'd care to come with us?",
    "Waxwood boxes?",
    "Maybe I can help...",
    "Oh, for Guthix's sake. Will you two shut up and give that thing here?",
    "By Guthix...there's pest goo in here!",
    "That stuff is highly dangerous, sir. I would suggest you make efforts to confiscate and destroy as many of these boxes as you can.",
    "Heh. Thank you.",
    "Have you found out anything more on the source of the boxes?",
    "Have you found out anything more on the source of the boxes?",
    "What's that you have?",
    "Can't say I'm familiar with that.",
    "I see. Alright, we'll discuss with Sir Tiffy what to do with those boxes while you follow that lead. We'll keep in touch via CommOrd.",
    "Good to know. Best of luck with it.",
    "...and I realised I'd been holding you to standards that simply don't apply to someone who isn't a Void Knight. I fear I treated you poorly as a result, Jessika, and I'm...well, I'm sorry.",
    "That was quick, Player. Have you found the trail's end?",
    "I was apologising to Jessika. I have been more than a little difficult, I think.",
    "Worse. I blamed myself and took it out on you. I should know better, and I'm sorry for that.",
    "In working with you, I've come to realise Player was right: your heart is in the right place and you never meant harm. Yet, when harm came of your actions, you were more than willing to balance that harm.",
    "I'm glad to hear it.",
    "Yes, Player?",
    "Duly noted, Player. Keep up the good work.",
    "I'm listening.",
    "The Kinshra? Could they be involved in this somehow?",
    "Agreed. We should investigate immediately.",
    "I'd be glad to have you along, Jessika. Player, we're teleporting to you now.",
    "We're ready, Player. It's time this sorry business was over with.",
    "Yes, Jessika?",
    "What?",
    "You know what? I think I'd be happy to. Let me mull it over.",
    "Let me give you a hand with that.",
    "Indeed. Please stay here, you two; I'll see what we're up against.",
    "One guard on duty, one locked door and a fair amount of traffic through the room.",
    "The guard should be no problem, though. I can deal with him...",
    "Don't mind me.",
    "Well, that was easy.",
    "Stay hidden, both of you. I'll see about talking my way past the doorkeeper.",
    "Greetings, friend. I have a delivery for whoever's in charge.",
    "Password? This is urgent!",
    "Blast it, that doorkeeper is stubborn. I fear we shall need that password in order to get in.",
    "I've come to recognise that tone of voice. Go on...",
    "That sounds feasible. Why did you hesitate?",
    "What? No!",
    "We should not be responsible for bringing more of those vermin into the world.",
    "Ugh, very well, Jessika. I shall trust you in this, but keep it firmly in control.",
    "Swiftly now - get that drone to one of the workers so it can listen for the password.",
    "Oh, that's not at all fanatical... Regardless, Jessika, why don't you go and try it out?",
    "Curses. Then we'll need to acquire one...and hope there are no further complications. Player, would you kindly put those nimble fingers of yours to work? I'm sure I don't need to tell you to leave the arriving workers alone - steal from one as he leaves as he'll most likely not notice until he's home.",
    "You have an insignia? Good. Now see about getting through that door.",
    "Hello again.",
    "Well, Player, we need to decide what to do with this fellow. We can't risk leaving him free behind us.",
    "Do I look like a follower of Saradomin to you?",
    "We have to get through to the pest chamber. There'll be a key in the workshop somewhere.",
    "And well guarded, too. Those are the Kinshra's elite knights.",
    "Stand well aside, please, Jessika. I don't want you getting hurt. Player, the one on the right is mine. I don't want you to interfere, please.",
    "So those were the vaunted Kinshra elite? They should come and train on brawlers for a while...",
    "Undeniably so!",
    "This is disgusting, Player. The pests ravage and destroy, but it is their nature. That men could do this...",
    "Aye, Jessika. Now, Player, that pest isn't looking good. Please, deal with it while there's still time.",
    "I have no love for void pests, but that's, well...ghastly.",
    "Do we have time for this?",
    "I suspect that releasing that thing was a poor idea. Time will tell.",
    "Killing that creature must have been a difficult decision to make, Player, but the right one.",
    "Commodore Tyr will want to know what has happened here. Let's get back to the outpost.",
    "Sir Tiffy can deal with the rest of this place once we report in. I believe Jessika and I need to return to the Void Knight Outpost. Will you join us now or make your own way?",
    "I can't help but wonder what they needed quite so many cubes for. Falador's not an enormous city, and an operation of that size could have produceed three or four times what their apparent plan would need. I feel there's something more going on here, an influence we've not considered.",
    "And I commend your decision to send Jessika with us, Commodore. Her knowledge and expertise were invaluable in tracking the pest down, and our partnership showed much...balance. She has asked me to forward her for Void Knight training and I endorse the application whole-heartedly."
  ],
  "Seaman Lorris/Seaman Thresnor": [
    "Couldn't help you, I'm afraid. Just over a nasty dose of flu; you might try Captain Tobias, though. Do you want to go on a trip to Karamja? The trip will cost you 30 coins."
  ],
  "Captain Tobias": [
    "A little bulbous devil, low to the ground, sneaky and not quite of this world?",
    "Haven't seen anything like that, sorry. Been recovering from a dose of the lurgy we all got during our last trip to Karamja, so I've been feeling all drained and rundown lately. I do believe the fishmonger was complaining about something damaging his fish barrels, though. You might try around his place.",
    "Now then... Do you want to go on a trip to Karamja? The trip will cost you 30 coins."
  ],
  "Gerrant": [
    "You can buy fishing stuff here. Or sell fish.",
    "If it's the one that went and knocked my fish barrels about, then good on yer! I did see summat head out west of here a couple of days back. Could be you can pick up its trail outside."
  ],
  "Bizarre tracks lead away from this leafy plant.": [
    "=====Searching some stones====="
  ],
  "Something small and alien has left a layer of slime over these stones.": [
    "=====Searching a bush====="
  ],
  "Bizarre tracks lead away from this low bush.": [
    "=====Searching the last bush====="
  ],
  "Bizarre tracks lead away from this low bush in the direction of the Rusty Anchor pub.": [
    "=====Checking the mound====="
  ],
  "Sure enough, it seems that the pest has gone to ground here.": [
    "* Player: Korasi will want to know about this..."
  ],
  "What was that about Void Knight beliefs?": [
    "(Same as above.)"
  ],
  "Bartender": [
    "Eh. I got sick just recently. Too tired to have a good day.",
    "'Kay.",
    "Yeah, I heard. Go in if you want. Can't find the key to the cellar. Somewhere round here.",
    "Eh. I got sick just recently. Too tired to have a good day.",
    "Alright.",
    "Good.",
    "What? Gods above. That could have been bad.",
    "You mean it's still out there? That IS bad.",
    "Eh. I got sick just recently. Too tired to have a good day. I'll start tidying in a bit. Once I've had a rest."
  ],
  "Among the piled-up stuff you find a large, crude key.": [
    "===The Cellar==="
  ],
  "You said the bartender was acting oddly?": [
    "(Same as above.)"
  ],
  "Will I have to fight this thing?": [
    "(Same as below.)"
  ],
  "To Musa Point, then.": [
    "(Same as below.)",
    "(Same as below.)"
  ],
  "Zambo": [
    "Hey, are you wanting to try some of my fine wines and spirits? All brewed locally on Karamja.",
    "It's all been fairly quiet, as far as I know. Kofi the storekeeper had a bit of a shock the other day - he saw a scorpion or something by his house - but the poor man's come down ill since, so he's not had a chance to do anything about it."
  ],
  "Kofi": [
    "'lo.",
    "Yeah. A little blobby thing.",
    "No. Can't be bothered. Ill.",
    "Meh.",
    "Bit, maybe.",
    "Oh, whatever. Suppose you could fix my wall. Needs repairing. Got no energy for doing it.",
    "Wall needs a joist. Plank and a log.",
    "Yeah. Fixed together. Mortise and tenon joint.",
    "Borrow my tools. Table over there.",
    "'lo.",
    "Yeah.",
    "Here somewhere. Smallish thing, fast, didn't see it well.",
    "Think I'll have a nap."
  ],
  "You pick up a plank and a log from the workbench. You take a hammer and a chisel. You leave the tools alone.": [
    "=====Creating the joist====="
  ],
  "You attach the carved components firmly together.": [
    "=====Fixing the wall====="
  ],
  "You fix the ramshackle wall with the joist you constructed.": [
    "====Talking to Kofi again===="
  ],
  "Pest tracks lead away from this succulent plant.": [
    "=====Searching a shrub====="
  ],
  "Pest tracks lead away from this shrub.": [
    "=====Searching a log====="
  ],
  "The missing pest has left telltale gouges in this rotting log.": [
    "=====Checking the mound====="
  ],
  "You've tracked the pest to its main burrow, but someone has clearly beaten you here...": [
    "====Jessika and Korasi join you===="
  ],
  "You go to poke around in the abandoned burrow... ...and find some broken shards of slick, waxy wood.": [
    "====After searching the burrow===="
  ],
  "How do you know about waxwood?": [
    "(Same as above.)"
  ],
  "Is this really what the pest plane is like?": [
    "(Same as below.)"
  ],
  "Onwards, then.": [
    "(Same as below.)",
    "(Same as below.)"
  ],
  "Rommik": [
    "Would you like to buy some Crafting equipment?",
    "Let me take a look...",
    "Funny you should bring up waxwood. I just this month finished a massive order of boxes made of the stuff, to be sent to an address around Falador way.",
    "Yes, it made this craftsman's heart sink. But you could have them clad with something prettier, I suppose.",
    "Well, it was for a large number of untreated sealable watertight boxes. I didn't get the name of the fellow who bought them, but he paid up front. That's about the limit of it, really. I don't like working with the stuff, but the boxes were fit for purpose."
  ],
  "Can either of you two lend a hand?": [
    "(Same as above.)"
  ],
  "Where is the pest now?": [
    "(Same as below.)"
  ],
  "I'll see about this experiment, then.": [
    "(Same as below.)",
    "(Same as below.)"
  ],
  "Ask about lamp oil.": [
    "* Ask about impling jars.: * Ask about A Void Dance.: **Chemist: Ready to analyse the sample you brought? I have all the reagents we need."
  ],
  "Chemist": [
    "Right, here's what you have to bear in mind... It'll take a while to analyse the sample. You'll have to keep the heat and power stable and the chemical sample in an appropriate state while I work. If the system gets far enough out of balance, the analysis will fail and we'll have to start again. The central vat shows what the current state of the sample is. During the experiment, we may need to change it to another state to keep the system in balance. Add a sample to this hopper to mix it with the chemical already present and attempt to form the required state. I've got a log of what chemicals do what; one of the reactions is highly unstable, so watch out. The heat in the system is simple enough to control; if it drops too low just stoke the furnace here. And if it rises too high just open the vent here. The power controls work much the same. Wind the cog to speed up the flywheel if the power drops too low. And here's the brake if the power starts rising too high. I'm sure these chemicals are all we'll need to perform the analysis, and I have plenty if you run out of anything. Don't worry if it all goes wrong, as you can always get more reagents and try again. Keep an eye on my report so you know what's needed at any given time. Ready to get going?",
    "Don't worry, boy/girl, plenty of chemicals left to try again.",
    "Well done with that sample! Thanks to your efforts, I've been able to analyse it thoroughly. It is clear now that the 'goo' is a magically active secretion of considerable complexity. From where you found it, I would imagine it is produced by your escaped pest as a funtion of its caste. That is to say, our pest instinctively lines its burrow with the stuff so that it can perform its purpose: simply put, it sucks the life out of anything nearby that's not a pest. Then, after it has absorbed enough, the pest or its burrow-mates can consume it as an emergency food source - like a very gloopy treacle pudding, full of sugar.",
    "Correct! Of course, Port Sarim and Musa Point are too small for that to be a problem, but if this stuff is somehow getting into Falador..."
  ],
  "About the Task System...": [
    "=====If you fail the analysis====="
  ],
  "Sir Tiffy": [
    "Welcome to Falador.",
    "A great shame! I do swear Falador is brighter yet for your presence, miss. What was it you studied at the Wizards' Tower, if I may enquire?",
    "Ah, all far beyond me, but it sounds useful. Does that mean you learned druidic summoning too?",
    "They do rather sound like the perfect tool for spreading the stuff around, what? Thank you for your report; allow me to respond in kind. There's a fellow near the east bank called Tist, an Ali from the Kharidian Desert. Turned up two weeks ago, d'you see, and in the last few days I've heard of people in that part of town getting sick. The symptoms are very similar to how you described the bartender and the shopkeeper.",
    "Maybe, maybe not, but it's worth investigating. Oh, yes, here's the interesting part: he's selling boxes, don'tcherknow.",
    "If they were, I would have ordered his arrest as soon as I heard your report. No, these are oak, but I'm still suspicious of him. He's clearly up to something. Nobody can open his boxes and that 'noble son of the desert' accent of his is so overblown it must be an act. Go and ask him some questions, Player, if you'd be so kind. If nothing else, get a box off him.",
    "Have you investigated Ali yet? He's set up shop by the east bank.",
    "He's clearly up to something. Nobody can open his boxes and that 'noble son of the desert' accent of his is so overblown it must be an act. Go and ask him some questions, Player, if you'd be so kind. If nothing else, get a box off him.",
    "Have you tried opening it yet?",
    "Well, maybe this tired old brain's still got the gumption, eh?",
    "Too early to say for sure, but I for one intend to find out.",
    "Hrmph. Won't be easy; they've sold well, as I understand it. Player, if Ali Tist is responsible for this I intend to bring down all the wrath of the Temple Knights on his head. I'd appreciate it if you would put some pressure on him and find out where these boxes of his are from.",
    "I say! If he's being obstructionist you should have a word with Sir Amik up at the castle. Get a little leverage, don'tcherknow. Drop my name if you must."
  ],
  "You swiftly sum up recent events for the old Temple Knight.": [
    "* Player: We're not yet sure who kidnapped the pest from its burrow, but it seems certain that whoever it was intends to make use of this life-sucking chemical substance the pest produces. The waxwood boxes Rommik mentioned may be connected."
  ],
  "Ali Tist": [
    "Greetings, effendi! Would you like to buy a box?",
    "Do not be fooled by its commonplace appearance - these boxes have a complex puzzle lock! Buy one now for just five coins, and if you manage to get the box open you win a mystery prize!",
    "Potentially! The gods have smiled on my fortune recently, so I thought it only fair to give something back. So will the noble sir/lady take one?",
    "Oh, they are fine boxes! The puzzle: so complex, so devious... The workmanship so fine and detail-",
    "Noble sir/madam! I am amazed that you could think me so callous as to reveal a supplier who has placed their trade secrets in my hands so.",
    "Oh, sir/ madam, you'll just have to win the contest to find that out!",
    "There you go. Good luck!",
    "Ah, a customer approaches! Will the noble sir/lady care to see my fine wares?",
    "Oh, really?",
    "I bought them as a job lot in a fire sale. And I can't spoil the 'contest' by telling you what's in them.",
    "I think you can't prove anything, you can't go prying and you can't reject my explanation.",
    "Greetings, eff- Oh, it's you. What do you want?",
    "Well, you can't. You have no authority.",
    "I have nothing to say to you. Leave me alone.",
    "Nobody has to buy the things. I'm just offering them.",
    "Yeah. What of it?",
    "Greetings, eff- Oh, it's you. What do you want?",
    "What? No! You can't do that!",
    "Gah. Alright, curse you, you win. An anonymous benefactor gave me this scroll a while ago. It led me on a chase around the whole Falador area, at the end of which I found a cave full of boxes and with a big locked door at the end. I couldn't get the boxes open, but I took them with me to sell off to these chumps. By the time they realise the things don't open I'll be out of stock and long gone.",
    "It seems that I have no choice.",
    "To be honest, I don't know any more. Since I gave you that clue scroll I've begun to feel like it's not worth the bother.",
    "Nobody has to buy the things. I'm just offering them.",
    "Yeah. What of it?"
  ],
  "Man": [
    "Have you got anywhere with this puzzle, dear?",
    "Yeah, me too. Strange...",
    "If we can be bothered.",
    "Strange, the fellow that paid me never said there'd be another... Ahem! I mean, what is it with these onions all of a sudden?",
    "Oh, hello. I don't suppose you've seen a campsite arond here, have you?",
    "Curse this lousy sense of direction. All my stuff is at that campsite!",
    "Well, yes. Not everything else of mine, though."
  ],
  "Woman": [
    "Not really. I've sort of stopped caring now.",
    "Might try again in a bit, I s'pose."
  ],
  "You give Tiffy the puzzle box and he turns his attention to it.": [
    "* Sir Tiffy: Oh, fiddlesticks! I'm getting nowhere with this."
  ],
  "Korasi takes the puzzle box from Tiffy and scrutinises it.": [
    "* Korasi: Nope. Jessika, you're the brains of this outfit - you try."
  ],
  "Jessika takes the puzzle box from Korasi and has a go.": [
    "* Jessika: This puzzle doesn't make any sense!"
  ],
  "Sheathe it in metal.": [
    "(Continues below.)",
    "(Continues below.)"
  ],
  "Imbue it with runes.": [
    "(Continues below.)",
    "(Continues below.)"
  ],
  "Rub marrentill tar into it.": [
    "(Continues below.)",
    "(Continues below.)"
  ],
  "Put it in a bowl.": [
    "(Continues below.)",
    "(Continues below.)"
  ],
  "It doesn't need anything else.": [
    "(Continues below.)",
    "(Continues below.)"
  ],
  "Build a complex weighted device.": [
    "(Continues below.)",
    "(Continues below.)"
  ],
  "Who are you?": [
    "* Speak about the A Void Dance quest.: **Sir Amik: How does life find you today, Player?"
  ],
  "Sir Amik": [
    "Hmm. This sounds decidedly unorthodox. Did Sir Tiffy put you up to this?",
    "I'm willing to put my trust in you; you are, after all, a White Knight of Falador. I'll write you a search warrant for his stock... I'd wager any seller of 'dubious goods' won't want you poking around."
  ],
  "Do you have any news?": [
    "* Do you know anything about the siege of Falador?: =====Talking to Jessika, Korasi and Tiffy====="
  ],
  "Korasi hands you a spare CommOrb.": [
    "* Jessika: Good luck, Player!"
  ],
  "You find another clue scroll!": [
    "* Player: Player to Korasi: come in, please.",
    "* Player: I've found another clue in the monastery garden, Korasi."
  ],
  "Cheer.": [
    "* Angry.: * Wave.: **You've received another clue scroll!"
  ],
  "Dance.": [
    "=====Talking to the man====="
  ],
  "You find another clue scroll hidden in the crate!": [
    "* Player: This is Player checking in. I've found a clue scroll in the farmhouse just north of Port Sarim."
  ],
  "You have found the final destination of Ali Tist's clue trail!": [
    "* Player: Hah, found it at last."
  ],
  "This heavy hatchway is firmly locked by a twin-release bolt. You will need assistance to get it open.": [
    "* Player: Player to Captain Korasi; come in, please."
  ],
  "Guard": [
    "What the..."
  ],
  "Black Knight doorkeeper": [
    "Then you'll know the password we give to scheduled visitors.",
    "Urgent or not, you're not getting in without the password. Get gone. And don't think I won't recognise you next time, either. I have a good memory for faces.",
    "Mumble, mumble.",
    "Of course; I'll just need to see your identity insignia.",
    "Then you're either an impostor or you've committed a we-kill-your-family offence. Either way, I don't want to see you here again."
  ],
  "Jessika summons a small Void pest for you.": [
    "=====Talking to Jessika====="
  ],
  "The Black Knight workers, fearful of being punished if you are discovered, bundle you out the door.": [
    "=====Trying to knock on the door====="
  ],
  "It would be unwise to attract the doorkeeper's attention just yet.": [
    "=====Planting the drone====="
  ],
  "You carefully set Jessika's drone on the side of the box, where it clings and listens.": [
    "=====Trying to take the drone====="
  ],
  "Best leave it here until it can listen in on the password.": [
    "=====A worker walks up to the door====="
  ],
  "Worker": [
    "Mumble mumble mumble mumble."
  ],
  "You are too far away to make out the words, but the planted drone is listening carefully...": [
    "=====Retrieving the drone====="
  ],
  "You retrieve the hidden void drone.": [
    "=====Returning to Jessika and Korasi====="
  ],
  "Jessika holds the void drone and seems to be listening.": [
    "* Jessika: The password is, 'In unity we overwhelm.'"
  ],
  "You steal a small metal disc from the departing worker.": [
    "=====Talking to Jessika and Korasi====="
  ],
  "Doorkeeper": [
    "This had better be good.",
    "Show your identification, then.",
    "Indeed. Now just give me the secret handshake and I'll let you in.",
    "Well done. I see my trick question didn't fool you.",
    "Enter, fr-",
    "You!",
    "Aaargh!",
    "Bah! I regret nothing. Do your worst, Saradominist dogs."
  ],
  "You hand the stolen insignia through a slot in the door.": [
    "* Doorkeeper: Oh, just that we've identified and turned back two intruders today already."
  ],
  "Indentured worker": [
    "Please don't talk to me, I don't want to be punished.",
    "What are you doi-"
  ],
  "You find a heavy iron key on the worker's body.": [
    "====Sparing the worker===="
  ],
  "A large key rests on this shelf, but you can't reach it with your bare hands.": [
    "=====Trying to reach the key with the wrong item====="
  ],
  "You poke around a bit, but can't quite reach the key.": [
    "=====Stealing a tool====="
  ],
  "You search the workbench... You pocket a spare tool while the worker is looking the other way.": [
    "=====Searching the workbench with the hook======"
  ],
  "You search the workbench... ...and notice a small metal hook that seems less sturdily attached than most.": [
    "=====Dislodging the hook====="
  ],
  "You break the tool, but successfully pry the hook free from the workbench. The nearby slave lets you.": [
    "=====Searching a workbench with a metal strip====="
  ],
  "You search the workbench... ...and  notice that a strip of metal on the frame is loose.": [
    "=====Obtaining a metal strip====="
  ],
  "You unscrew the loose strip of metal from the workbench, breaking the tool in the process.": [
    "=====Using a gaff to obtain the key====="
  ],
  "You fish the key from the shelf.": [
    "===The Pest==="
  ],
  "Void leech": [
    "I am full of tubes and woe.",
    "What does the mother say?",
    "With you. With the white shell and the kind lifeness? She raised us, she is the mother.",
    "Freed from small metal world with kind mother. World was big - was lost, confused. Made new home - small, enough - wait until hive came. But no hive came. Instead humans with black shiny shells. One was leading them, his face hidden, his lifeness sparkling magic like a torcher's - 'wizard' they called him. Who, I cannot say. Human all look same, all but carapace, all but the mother. They took me, they brought me here. Attached here in small metal world to these sucking tentacles, taking the foodgoo from me, forcing me to make more.",
    "'Wizard' said the foodgoo will be power, will call out to the hive. Yes. The hive can feel the lifeness-filled foodgoo. The black-shiny-shell humans think they work with 'wizard' to kill white-shiny-shell hive in 'Falador', take lifeness from their human ravagers, take over. No. 'Wizard' thought me unintelligent, talked to me, said he had greater plans for lots of my foodgoo. Please, destroy my stolen foodgoo. Save your 'Falador' hive's lifeness. Can't help me now.",
    "Woke to life and the world was strange. Wrong place, no brothers, no sisters. Home was metal, so small, but the mother was kind.",
    "You would say void leech. I make the foodgoo that stores lifeness - food for the thin times. The hive needs food to hunt, to spread, to grow.",
    "Queen commands. The ravagers and torchers invade. I make the foodgoo.",
    "I swear it.",
    "I expected such."
  ],
  "The mother?": [
    "(Same as above.)",
    "' (Same as above.)"
  ],
  "Player.": [
    "The mother?"
  ],
  "What happened to you?": [
    "(Same as below.)",
    "(Same as above.)"
  ],
  "Tell me about yourself.": [
    "(Same as below.)",
    "(Same as below.)",
    "(Same as below.)"
  ],
  "Enough of this.": [
    "(Same as below.)",
    "(Same as below.)",
    "(Same as below.)",
    "(Same as below.)"
  ],
  "Savant": [
    "Yes, thank you, Commodore, although I have already heard part of the report from Sir Tiffy. Rest assured our agents will continue to gather what information we can and pass on anything relevant; the White Knights have also pledged forces to destroy the cubes we know of.",
    "Good to see you again, Player. Take care of yourself."
  ],
  "Commodore Tyr;": [
    "Indeed? So be it, then. Player, congratulations on a successful mission."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:A_Void_Dance?oldid=16986059’"
  ]
}