{
  "Mr Mordaut": [
    "How may I be of service?",
    "You know, Player, you may be just the person I am looking for.",
    "Indeed. I have something that may interest you.",
    "Careful there, my friend. Humility is a valuable life skill.",
    "As you are aware, I have a deep interest in the history of dragonkind and have made it my mission to seek out as much information on our past as possible. During my recent investigations, I uncovered what may be the final journal of Hannibus, the Dragon Rider.",
    "A fascinating species from another world, made famous because they possessed the enviable power to tame and ride dragons. Alas, they were caught up in the fighting between Zamorak and Zaros and were seemingly wiped out. All but one: a lone rider called Hannibus.",
    "I believe this journal entry could well be the secret to his current whereabouts. Could I interest you in helping me to investigate?",
    "Well if you change your mind, just let me know.",
    "Fantastic! I knew I could count on you!",
    "Take a quick read of that and talk to me when you've finished. I have more information that will prove fascinating, I'm sure.",
    "How may I be of service?",
    "Read that journal entry and then we can talk a bit further.",
    "I believe that Enakhra was successful in her plan and was able to curse Hannibus, turning him into a statue.",
    "Well, I have been researching Enakhra's exploits and there are references to such a statue as tribute for Zamorak, but she was never able to deliver it. I had thought that the end of it, but then I hit on my biggest discovery yet!",
    "Oh, I haven't got to the best bit yet!",
    "During some completely unrelated research on the Dragonkin, I found documents that speak of Robert the Strong finding a strange, lifelike statue of an unknown species. I believe that this is none other than the statue of Hannibus! According to my research, Robert took it to his library for study. Isn't it fascinating?",
    "I'm glad you agree.",
    "Well, each to their own, I suppose.",
    "The only problem now is where do we go from here? Where can we find this library? Who would know anything?",
    "No, I've looked through what we have here. There's nothing of use.",
    "A cat? Why would a cat know anything?",
    "Really? Fascinating! Well yes, that certainly seems like a good place to start!",
    "Well, okay then. I trust you know what you're doing. It can't hurt, I suppose.",
    "Ah no, I tried them. They were initially suspicious of my scales, but seemed quite amenable after I had a pleasant conversation with them. Sadly, they had nothing of value.",
    "I will entrust that task to you, Player, as my presence generally startles the locals.",
    "I think you're right. This Bob the Cat seems a sensible person to start with. He might know something useful.",
    "How may I be of service?",
    "To think, the fabled Dragon Riders are still around. Fascinating. What will become of them though? Only time will tell I fear, only time will tell.",
    "I'm afraid that the museum requires a donation to reclaim this. It will cost 500,000 gold to reclaim.",
    "A shame I did not get a chance to meet him, he sounds like such a noble fellow. I wonder if his unique talents would have been able to bring dragonkind out of the battlefield and into civilisation. Still, perhaps there is hope that we might see him again in the future.",
    "That primer should prove invaluable! You should hold onto that, who knows when we might learn more of their unique tongue.",
    "You actually spoke with the original creator of the Dragons? He is not my maker, but I have heard of him and to know that he is fighting against the curse of Jas is inspiring.",
    "I am glad that one of the white dragons survived, although I would liked to have met her. I hope she will be happy on Iaia and maybe I will get the chance to speak to her one day."
  ],
  "The following text is transcluded from Transcript": [
    "Hannibus Hunted.",
    "The Young Robert.",
    "Animate Rock notes.",
    "Flight of the Dragonkin."
  ],
  "Player": [
    "Bob! I need to find the library of Robert the Strong!",
    "Robert the Strong! You're his reincarnation. Remember?",
    "Hi Unferth. How's Bob?",
    "Feeling OK?",
    "I must go, something came up!",
    "Um nahi listic durooo-rah!",
    "This is the Sixth Age.",
    "For fame and glory!",
    "Goodbye.",
    "Tell me about the Dragonkin.",
    "Um nahi listic durooo-rah!",
    "Do you know of a way to travel between worlds?",
    "Just tell me what to do.",
    "What was that?",
    "Kerapac is the only hope for the Ilujanka. You should go with him.",
    "You should go home and be with your people.",
    "[Talk to someone else]",
    "The Catalyst?"
  ],
  "Bob": [
    "The library of who the what?",
    "I know I'm his reincarnation, but I don't actually remember anything about his life. In this life I'm just a cat with a human to look after.",
    "Dragonstring? That sounds like a fun thing to play with. I think I'd have remembered that.",
    "I think you've met Unferth, my pet human. He lives in a house at the north end of Burthorpe. I love that house. The first time I saw it I felt like it was home. Naturally, I adopted the human who lived there and moved in. Even though I wander around the world, that house will always feel like home.",
    "Be my guest! Unferth is very good at keeping it clean these days - I've finally got him trained!",
    "I do hope Unferth is still keeping the house tidy. If he's let it get messy again, I'll be quite annoyed."
  ],
  "Unferth": [
    "A hidden library? I...I don't know what you're talking about! I've never even read any ogre romance novels! I certainly don't have a secret collection of them!",
    "Well...like I said, I don't have any, so you're wasting your time.",
    "What, so that you can mock me? No! Anyway, I don't have any. It's all a malicious rumour.",
    "Well...if there's another library in my house, I'd like to know about it! I like to keep everything neat, and a misplaced library sounds like it's decidedly...um...un-neat.",
    "Really? Do you think that legendary hero was into ogre romance novels? Well, I suppose you can search if you like. Be careful not to make too much mess, though! I always keep my house very clean, and the dust makes me ill.",
    "Well, he never went upstairs much. He was always running around on the floor down here. I hope that helps with whatever it is you're doing.",
    "I don't see him as much as I used to but he's fine.",
    "Well my spleen is playing up again...",
    "Oh, OK.",
    "Search my house for that library if you like, but please don't make too much mess!",
    "Stop it! You're getting dirt all over my books!",
    "What did my table ever do to you?",
    "What are you doing? You're getting soot everywhere!",
    "Oh, I bet you'll be wanting to rip up the carpet next! You vandal!",
    "You're making such a mess! Bob will be so unhappy when he gets back.",
    "I had no idea there was a trapdoor under my carpet!"
  ],
  "I have found all parts of the incantation, the effective words of which are": [
    "'Um nahi listic durooo-rah'. The ritual also requires two material components, the first of which is an emerald, but the second of which eludes me."
  ],
  "Hannibus": [
    "By the Ancestors, I'm free! I can smell the air...the blessed, dusty air! I was aware of the world around me, in a sense, but it was long - so, so long...I feared I would go mad. I know I was trapped, for how long I cannot say. Last I recall, it was the end of something called the Second Age,...but now I am free. I have you to thank for this?",
    "Then you have my gratitude, stranger.",
    "Do you, perhaps, know who did free me?",
    "Zaros... So he's returned? It doesn't matter. I've washed my hands of his politics.",
    "Someone must have done it. I wonder why they haven't shown themselves. I don't suppose you know when I am, do you?",
    "Then you have my gratitude, stranger.",
    "Forgive me, but I meant 'when' am I?",
    "That must be centuries. Has it been so long? ...",
    "I am sorry. It is so much to take in. Everyone I know...gone. The world must have changed so much. What place have I here, so far from my time? But I must know what has become of the Ilujanka - my people. Forgive my melancholy, it's just...difficult to comprehend.",
    "Now? Now I need to decide my future.",
    "Yes...I could! There is nothing for me here. I could leave! I could... But how? With Zaros gone there's no way back to my world...is there?",
    "No, I cannot trust my fate to those pretenders. Gods are petty, cruel and have little concern for those who serve them. No, there must be an alternative.",
    "Alas, the fairy ring network was something that I tried back before I was imprisoned, but it did not connect to my homeworld.",
    "Ah, I'm afraid my people are not masters of sorcery, and I fear that any spell powerful enough to send me home might have...consequences. No, there must be another way.",
    "Yes...it does seem quite impressive. Maybe there is something we can use here. I have vague memories of a powerful figure here...someone with a strong Olun'det. It's only an impression, but what can it hurt to look?",
    "Ah sorry, yes, the Olun'det is a measure of the impression we leave on the Olun'dai. Sort of like a measure of destiny, or one's spirit. You yourself have a particularly powerful Olun'det so I cannot help but think our journey on the Olun'dai is intertwined at this time. My people are deeply spiritual and it is ingrained in our culture and language. Forgive me if I forget, from time to time, that not everyone shares that history. Let's try some of these books. There must be something that can help me get home.",
    "To what end?",
    "Why would I want that? Power is transient and meaningless to the Olun'dai. It is the pursuit of fools and madmen, and I hope that I am neither. No I would need another cause to ride behind.",
    "Haha! I cannot deny that. But there must be purpose behind riding. It would dishonour the rider and the mount otherwise.",
    "Fame is a fleeting notion and glory is just an excuse for excess of pride. Neither interests me, I'm afraid.",
    "My birth name was Hannibus Eterra. I was born from a clutch of seven and destined to be a ghur rider. It may sound strange to you, but being born from such a large clutch is a great omen for our people. On my world I was a farmer, riding the ghurs in order to plough our fields. It was a simple life and I was happy, for the most part. But our people were producing fewer and fewer young in each clutch - our race was dwindling. Then the Empty Lord - Zaros - came to our world, and our lives were changed. He offered us something we could not refuse: the salvation of our people, just as long as some of us would go with him and join his empire. On your world, we found that our ability to charm ghurs also worked on mighty creatures called dragons. This pleased Zaros. So I became a dragon rider: a warrior of the skies who served in Zaros's army. All for a promise that was never fulfilled. I am not proud of what I became. I was arrogant; I tried to cheat the Olun'dai and I have paid the price, dearly.",
    "It is a difficult concept to explain, so forgive me if I seem unclear. We Ilujanka believe that everything is connected, part of a singular whole. The earth, the trees, the grass and the animals that graze upon it. The whole is like an elaborate painting that's impossible to fully perceive because you're part of it - too close to see everything. But you know that the result is beautiful, and worth all of the effort that went into it. And like a painting, each individual stroke seems almost meaningless without the brushstrokes that came before, or after. The difficult part of the Olun'dai is knowing what your place is and accepting it. Something we all struggle with - I most of all.",
    "Does that make sense?",
    "Haha! Then you are clearly wiser than me, Player.",
    "It is a complex concept that takes a lifetime to comprehend. Even the wisest Ilujanka cannot fully grasp it.",
    "We were the caretakers of our world and worked in harmony with the animals around us. We had our place, they had theirs, and by working together as one we lived a prosperous and happy life, each contributing to the Olun'dai. We had a natural affinity with the animals of our world: we served as their higher reasoning and they served as our limbs. Between us we ploughed fields, built homes and lived well. But then our numbers began to fall. Clutches fell in number from dozens, to fewer and fewer, until soon there were almost no births at all. We were dying, Player, and we had no idea why... That's why we agreed to go with the Empty Lord, because he promised us a solution. The Ancestors warned us not to go, not to defy the Olun'dai...but how could we not? I'm sorry, Player. I can't talk about this any more.",
    "The Dragonkin? If they could travel between worlds, that would be worth investigating. I wonder what statues he refers to. Hrmm, I'm sure there's more here of use.",
    "Hrm... Dragons are uniquely gifted creatures. This looks like something worth investigating, Player. I'll keep track of any words that we've uncovered and can translate for you if you need me to.",
    "That seems to be everything of use. We should investigate those clues.",
    "We should look around this library. Maybe there is something that can help me get home.",
    "Dragons possess wonderful powers. There might be one among them that can be my ticket home. We'll have to decipher that writing, though. Sadly, that's not my area of expertise.",
    "We should investigate the clue he has shown us.",
    "Oh, Player, I cannot do it justice. My people have a gift: the ability to share our experiences with another creature, and - in turn - to share in theirs. When dragon and rider are together we are as one - a great, powerful beast chasing across the heavens! I once rode a black dragon with three heads - a powerful and noble creature - and we shared many an adventure!",
    "So he's alive? He was always a noble beast. I miss his company.",
    "Ah, green dragons. I've dealt with these before. Give me a moment.",
    "Be calm great beast, no harm will come to you. I see... He does not know of dragons with strange powers, but he does speak of visits from the Creators. He says that as they experimented on the dragons, they would record their findings by scribing the rocks with arcane runes as a record for the other Creators in future cruelties. They should be at the back of the cave...south east of our friend here I think.",
    "Look, Player. That rock seems to have writing on it!",
    "Was it not? I wonder why it would glow now.",
    "We should try and translate this as quickly as possible, Player. Maybe it leads to something we can use.",
    "These dragons...their flesh is merged with metal. Why would anyone do such a thing? Shh... Be calm. I mean you no harm.",
    "This one...is stronger than before. It will take time for me to calm him. Player...I need you to protect me...while I do this.",
    "I don't know if I can do this. It's wrong to kill them.",
    "You're right. I must maintain control.",
    "Another dragon! Keep it back Player!",
    "I won't be able to do this, I failed everyone once, I'll fail again.",
    "You're right, Player. I cannot give up now!",
    "There's another dragon coming. I'm nearly done here - keep it back!",
    "Done. He was difficult to overcome, but thanks to your help I've managed to calm him. Please - give me a moment. That was...horrible. I saw a tall, pale-skinned creature, pouring molten metal into eggs. So few of the young survived, even after they infused the eggs with their strange sorcery. All the while, their tormentor would scribe notes onto a wall near a secret dungeon entrance. I imagine we should look there next.",
    "As before, it appears that there is more writing over by a secret dungeon entrance.",
    "Look, Player - more Dragonkin writing! Hopefully this will lead us to what we're after.",
    "That looks a little more complicated than before, we should try and decipher it and see where it leads.",
    "I think it would be better for both of us if this dragon were not to wake. I will commune with her in her dreams. Mighty one, dream to me of your children. Show me where they can be found. ...",
    "... Down...down... I have subdued her. I can't risk communicating with her again, though. She might wake up at any moment. But I've got what we came here for.",
    "We're looking for a hidden dungeon on Dragontooth Island. I saw it in her mind. Let's get out of here before she wakes up.",
    "Do you remember how to get to Dragontooth island?",
    "Then we have no time to waste.",
    "Not to worry, I saw that in her mind as well. There is a captain on the docks of a ghost-ridden port in Morytania. He will take us there.",
    "We're looking for a hidden dungeon on Dragontooth Island. I saw it in her mind. Let's get out of here before she wakes up.",
    "This is going to be tricky, Player. I can already sense their madness - they are not going to be easy to influence. I am going to need to see their rage unleashed and focused on a single target, so I can find a way past their madness. Player, it pains me to ask this, but I need you to keep them engaged in combat until I can overcome their insanity. It's not about death, but about how they fight. Try and keep them alive as long as possible and I will be able to learn from them.",
    "Be still great beast, I mean you no harm.",
    "Oh, Player, I see it now - how the eggs were infused with the strangeness of another place...the Abyss I think? Something took them and twisted them outside of time. I can keep him grounded for now, focused on the present, but it's difficult. It's driven them mad, whatever the process is. Each of them seems unable to cope except on an instinctual level. How could anyone do such a thing? Yet still there is nothing about travelling between worlds, though I can catch glimpses of another that can.",
    "This is a dead end, Player. Perhaps we should explore other avenues. Perhaps we should look into those statues that Robert mentioned.",
    "I see a brilliant white dragon disappearing through holes in the sky. I have memories, fragmented though they are, of pain...destruction. She has hidden and escaped under his protection...my...my old mount. Player we must go visit my old friend, I believe you know him as the King Black Dragon. He has the answers we seek.",
    "This is a dead end, Player. Perhaps we should explore other avenues.",
    "This looks like a dead end. If there are other clues back at the library, we should follow those.",
    "A great dark beast with three heads? That can only mean my old mount!",
    "Hello again, old friend. It has been too long.",
    "No, Shakorexis. This is a friend. Player here has been helping me.",
    "There is no need for taunts, Player.",
    "Please! There is no need for such hostility.",
    "Yes - you know me well, old friend. Much as I wish I could rekindle our old bond, I need to ask you something. We have heard reference to stories of a dragon who could sail between worlds and we were led here. Do you know of such a dragon?",
    "Thank you, old friend. We should go, Player.",
    "We mean you no harm. We come as friends, to humbly ask for your help.",
    "Not dead, merely lost.",
    "We have sought you out, because we have heard of your unique ability to travel between worlds. We know you have little reason to trust us, but we mean you no harm. All we want...all I need...is to go home to my world, a gift only you can grant.",
    "I do not believe that to be a problem. My people are able to share our experiences, thoughts and feelings with certain creatures, dragons specifically. If you allow me, I can share my memories with you and you will know my home.",
    "Now? I do not know. There is a chance that my people have all died out and we would return to a world without them. But once it was a peaceful place with little need for violence or conflict. I dare to hope that it is still as such.",
    "Of that I am certain.",
    "You monsters! Therragorn is the last of her kind! Player!",
    "You are a rare human, Player. Most of your kind would have fallen off by now.",
    "Certainly the ones I tried to train would have.",
    "Player, you're back! You had me worried for a moment.",
    "Yes, Player, Kerapac has helped me back to a full recovery.",
    "It's fine. We can talk in front of Player.",
    "I...what? How? What can be done?",
    "Decades?",
    "But...this research will cure my people?",
    "I will need to think about it. I need some fresh air. Player, will you walk with me?",
    "But...you are Ilujanka! I had thought I was...",
    "So the decline... It is over?",
    "But there is hope! A cure...Kerapac has promised a cure! If I submit to stasis and allow Kerapac to study me, there is a chance of salvation for our people.",
    "I... I would have a word with my friend Player here. Forgive me.",
    "My friend, I find myself conflicted. I have yearned to see my people again, but Kerapac presents a possible cure. That, however, is only the slimmest of hopes. What should I do?",
    "You are right, Player. I have to do everything I can to save my people.",
    "Farewell, Sharrigan. I am glad to have met you. When you return to Iaia, please tell them to wait - to hold on and fight for their survival. There is hope for our people. Do not let them surrender to fate just yet.",
    "Thank you Therragorn, and thank you Player. You have given my people a fighting chance and I will always be grateful.",
    "You are right, Player. I've been running all my life from our fate. There is no shame in accepting the Olun'dai and now I can rest among my own kind.",
    "Therragorn, will you come and stay with us?",
    "Thank you, Player. I cannot describe what you have done for me and I will always be grateful for your kindness."
  ],
  "Steel dragon": [
    "RAAAAAAAAARGH!"
  ],
  "Queen Black Dragon": [
    "Hahhhh... I dream of an Ilujanka, trying to dominate me. Even in dream, it shall not be. See how I turn your power against you. Ahhh...a good dream.",
    "Foolish dream-thing! No Ilujanka can master me. You speak to the first and most powerful of all dragons.",
    "You think I wish to inhabit this dreary dream-body forever? Mine is far more glorious! When I tire of the novelty I will release it, and dream once more of sliding through caverns and soaring through skies. For now...I wish to speak to you through this Ilujanka mouth.",
    "This dream amuses me. Ask your questions, dream-thing.",
    "Ahh, but wait. The dream thing is familiar. I remember the pain it brought to me. But this is just a dream, so I will indulge the cruel dream's questions. Ask.",
    "What strange thoughts come to me in dreams. To travel between worlds? A thought I had never considered before. A distracting thought... Here is some logic for you, dream-thing. I am the most powerful of all beings. I cannot travel between worlds. Therefore, to travel between worlds is impossible.",
    "Speak not of them to me, dream-thing! Dream-thing? No - I name you nightmare-thing! You bring me dreams that I do not wish to dream!",
    "You do come to mock me! You come to stab and jab with words and swords.",
    "They took my children from me! My power could not prevent them! They took my children from me, and experimented on them! My poor white-scaled children! Their suffering was the worst. They were taken to the dungeon on Dragontooth Island and given twisted powers that drove them mad. No! Begone, nightmare-thing! I will dream of destroying you! My peaceful dreams will be restored! RAAAAAAARRGH!"
  ],
  "Celestial dragon": [
    "My mind, clear. Pain. Constant. Burning. Is it tomorrow or today?"
  ],
  "Mysterious Statue": [
    "Who speaks to me? Are you TokHaar, or Dragonkin?",
    "Drakkerkin Kren Volat Roake Falkar.",
    "Praise the Creators for sending you! There is much to be repaired. The circle is in disarray. I felt my siblings being hauled away to be stones in the young races' castles. Now only four remain of the outer ring, and we no longer face the Sleeper. Knights of an upstart younger god repurposed us to point towards their holy grail. You must rotate me to face the sleeper. I will direct you.",
    "A human? Ah yes, one of the upstart younger races, with your so-called 'gods'. Your kind tore down my siblings to use as stones for your castles. Those you did not tear down, you turned around, so that we no longer face the Sleeper. Will you undo your race's crime?",
    "Thank you, creature. The correct order of things is restored.",
    "My siblings and I were built by TokHaar, on the orders of the Creators of the Universe - those you insult by calling 'Elder' Gods, as if any younger beings were gods. Once there were many more of us - a circle, all facing inwards to the blessed and cursed one, the Sleeper. It was the Sleeper who looked upon the faces of the Creators. They entrusted it with the secrets of the universe, even as that universe was created. The Sleeper's task is to relay the Creators' messages and warnings to those that came after. The circle's task is to direct others to those warnings, or keep them away, as we judge wise. We have judged you wise. But remember: it is a great honour to speak to one who has seen the Creators. Be sure you approach the Sleeper with an appropriately humble attitude. Thank you, creature. I am now facing the Sleeper once more.",
    "Follow my gaze, mortal! There you will find another of my kind, with a dire warning from the Creators themselves!",
    "Who speaks to me? Are you TokHaar, or Dragonkin?"
  ],
  "Note": [
    "The direction varies for each statue, indicating the relative direction to the Sleeper. See the Mysterious statue § Locations table for the \"post-One of a Kind direction\" each faces."
  ],
  "Submerged Statue": [
    "Beware the Dragonkin, mortal! Do not use the tools of the Creators, or you will summon the Dragonkin's wrath! Beware! Beware! Ahh... it is good to be able to deliver my warning once more. I feel the gaze of my siblings. Some of them are gone forever, and the circle will always be broken...but enough remain. For many ages I have had only one visitor, and I am glad to speak to someone else. What would you know?",
    "The Creators ordered the TokHaar to make us. Our purpose is to relay the Creators' messages and warnings. The other statues fear me, for I have spoken to the Creators themselves. My task was to warn mortals not to use the Stone of Jas, and to tell of the terror that would come if it were used. Beware the Dragonkin! Beware! Beware! But when the younger so-called 'gods' came, one of them ignored my warning. He hid me beneath the waves so others would not hear it, and turned my siblings of the circle away from me. He sought the stone for himself!",
    "Then you are foolish, mortal! The Dragonkin conquer all! Their cunning and power is directed to the destruction of all False Users of the stone! Beware! Beware!",
    "It seemed to be a Dragonkin, but it did not exhibit the bestial fury characteristic of that race, so I am not certain of its nature. It asked me obscure questions about the curse that affects the Dragonkin. Since it seemed peaceful, I gave it what knowledge I could, and sent it on its way.",
    "It is the power of the Dragonkin to fly between the worlds. Beware the Dragonkin! Beware! The Stone of Jas calls them, and they can pass the planar barriers to seek each False User. No other mortal beings should have this power to fly between planes. And yet...there is one other creature with the power you describe. It flew high above me and then vanished through a hole in the sky.",
    "The great dark beast of the three heads knows where it can be found.",
    "Beware the Dragonkin, mortal! Beware! Beware!",
    "You have touched the Catalyst mortal, you have doomed yourself and will invite the Dragonkin's wrath. Beware the Dragonkin, mortal! Beware! Beware!",
    "What you mistakenly call the Stone of Jas. It is a tool of the Creators and is not meant for mortal hands. In time you will learn the error of your ways. But I have grown fond of you in our conversation mortal. I shall give you my wisdom so that you may have a fighting chance in what will come. Beware the Dragonkin, mortal! Beware! Beware!"
  ],
  "King Black Dragon": [
    "Indeed, rider. We have missed your company. Have you brought us a snack?",
    "Shame. We are hungry and the human does look delicious. No matter. Greetings, friend of Hannibus.",
    "Yes... we've met before.",
    "Hrmph. It's fine - we're used to it.",
    "...",
    "Hrmmmph.",
    "If you think yourself a frightening morsel, you are sadly mistaken.",
    "Hrmmmph.",
    "We are pleased to see you, Hannibus, but we suspect there is more to your visit than simple nostalgia.",
    "Yes, we know of her. She is Therragorn - last of the white dragons. She is also our friend. Come - walk with us, rider. We will take you to her.",
    "She came to us, seeking sanctuary as her people were slaughtered. We knew of a place, built by the Creators, that we could hide from view. I will unlock it now.",
    "Arakken Kos Roake Pthen Deskar",
    "There. Be gentle with her. She has been in hiding for so long now."
  ],
  "Therragorn": [
    "How did you find me? Get back! BACK!",
    "Hah! I've not survived this long by falling for such obvious tricks!",
    "Hannibus? But you cannot be. You were thought dead.",
    "The king spoke highly of you, even as he helped me to escape to this cavern. I trust his judgement, so I'll listen to your plea.",
    "Loneliness, I know well. *Sigh* I should know better I'm sure, but I believe you. Very well, I will listen.",
    "I do not know your world, Dragon Rider, so I'm not sure I could find it.",
    "And this home of yours, what is it like?",
    "And would there be a place for an elderly dragon there?",
    "Then, Dragon Rider, I will... Wait, what is that?",
    "I am Therragorn, last of the white dragons. Once a mate, mother and friend to other white dragons, now the last of my kind.",
    "It is difficult to gauge the time without the sun to guide me. I have slept for many years, so I cannot be sure. 'Too long' is perhaps the only sane answer. I have been down here for longer than any creature should.",
    "Yes, that is our gift. We can move between worlds as easily as we can sail through the skies. We need to know where we're going, of course, or we risk ending up in nothingness. I cannot explain how it works. It comes as naturally to me as walking, or flight.",
    "Human greed. Our skin, given its magical nature, was highly sought after as armour. And so we were hunted down, slaughtered and skinned. We were isolationists by nature: territorial, suspicious of one another, and we valued our privacy. By the time we knew what was happening, it was far too late. I should have left, but I had nowhere to go. Nightmarish as it is, this world is my home and my only friends are here. I went to the king, begging for sanctuary, and he led me here to a secret place that only he knew of. I have been here ever since, the last of my kind.",
    "Oh, we can be violent if we need to be, but we were never consumed with the bestial rage that the other dragons possessed. I think that is why the creators abandoned us. They were unhappy with our lack of ferocity.",
    "I remember a being, pale of scale like ourselves, but different in shape. We were born from its blood and the eggs of the queen herself. But we were not the children they wanted, and the Creator cast us aside. It is not wise to meet your gods. They will always disappoint you.",
    "You revealed my position! You defeated those hunters but more will arrive soon... Graaaargh! Nowhere is safe for me now. Your world is my only hope, Dragon Rider. Quickly! On my back! I will carry you both away from this place.",
    "LOOK OUT! FIREBALL INCOMING!",
    "Hah! Don't put your faith in his words, Dragon Rider. He does not care for anyone but himself.",
    "I...I would like that, thank you.",
    "I am torn. I do not trust Kerapac - his only concern is the curse and he will do anything to break it. But then, I wonder what I would endure if it meant I could see other white dragons again. I would be tempted by Kerapac's offer. But then I know that his offer is just a fleeting chance - no promises and with a high cost. If I were as tired as Hannibus - even as he tries to hide it - I would want to rest among my people. There is no shame in accepting your fate, Player, and perhaps it is time for the Dragon Rider to do just that.",
    "After the fire blast hit, I was knocked from the sky. When I came to, I saw Kerapac carry the two of you into Daemonheim. All Kerapac cares about is breaking that curse and I knew he would bring you and Hannibus in somehow. I wanted to remind Hannibus of what he was trying to achieve. After our flight, I still had the lingering remnants of Hannibus's memories and it was enough for me to travel to his world. There I met Sharrigan, and we returned here to show him that he can still go home."
  ],
  "Dragon-hunter archer": [
    "I knew you'd lead us to the White Dragon if we followed you! Now step aside while we claim its hide!",
    "Excellent! That will make its hide even more valuable!"
  ],
  "Kerapac": [
    "Ah, good. You're awake.",
    "Forgive me for interrupting, but let's skip this bit, shall we? Yes, I rescued you. Yes, I am a Dragonkin. Yes, you have encountered my kind before, and it usually ended in violence. No, I do not intend to kill you or demolish your cities. Yes, we are deep within the place you call 'Daemonheim', and yes, you can leave at any point. You are not my prisoner. Have I missed anything?",
    "I am not wholly altruistic, Player. Yes, I know who you are, and all about your special status as 'World Guardian'. I rescued you because of the particular benefits you can bring to my research.",
    "Your friend did not fare as well as you did. He's alive, but will not survive without aid. Which I can provide, in exchange for your assistance in another matter.",
    "There is no time to indulge your curiosity. It is better to show you than explain. But if you want your friend to live, you have little choice but to assist me.",
    "Then we have an agreement. Follow me. I shall explain the situation.",
    "No. We will make an exchange. You will perform a task for me and I will heal your companion. There is no negotiation.",
    "No. We will make an exchange. You will perform a task for me and I will heal your companion. There is no negotiation.",
    "So, you met one of my failed creations, then? I saw no sign of her. Likely she perished, weak as she was.",
    "But none I would consider worthwhile.",
    "Should I not? Her species was a failed experiment. Ultimately worthless.",
    "I am Kerapac. I am a Dragonkin. That should be all you need to know.",
    "We are in my laboratory in what you call Daemonheim. Despite this recent infestation, it is still a Dragonkin stronghold. I have locked this lab outside of the standard rotations, so we should be free of interruptions.",
    "I am not here to indulge your curiosity. You know who we are and what we are capable of, so let's skip the small talk.",
    "Are you ready to return?",
    "When you're finished wasting time, return to me.",
    "I believe you have met Strisath before.",
    "Language, Strisath. We have a guest. Try to watch your manners.",
    "You see what the curse does to us, Player? Strisath was once one of our most celebrated philosophers. Time was he could peer at the vagaries of the universe and pluck meaning from chaos, but now... Now he is one of the Necrosyrtes, spitting death threats at anyone who so much as thinks about that accursed Stone of Jas. You are aware that the Dragonkin are bound to the stone, I'm sure. The pain that the stone inflicts on us drives many of my kind mad, reducing them to the sorry state you see before you. I want to know if your special traits can help to weaken this effect.",
    "The curse that my kind suffers is like a chain that connects us to the Stone of Jas and also the Vosk... Sorry. The 'False Users'. This will allow someone to travel into a magical construct that represents the curse. Which is where you come in. As World Guardian, you have a degree of resistance to the power of the gods, and - by extension - a resistance to the enchantments of the Elder Gods. I believe you will be able to weaken the curse's hold on poor Strisath here, long enough for me to talk with him.",
    "I will open the portals and begin drawing in wisps. I believe you are familiar with these. These wisps are the congealed remnants of the Stone of Jas's energy, sloppily wielded by your so-called gods. Harvest them and channel them into Strisath. It will make him receptive to what comes next. About 25 should be sufficient.",
    "Drakkerkin Roake Pthen Tesska Askanth Kuln",
    "The time for idle chatter is over. Gather the memories, Player, and we can proceed.",
    "When you are ready, I will activate the circle and send you into the construct. Inside, I do not know what you will face, but it will represent the curse in some way. Overcome it and I will pull you out of the construct.",
    "Then I shall send you into the construct.",
    "Drakkerkin Roake Pthen Kalgat Askanth Kuln",
    "A living incarnation of the Dragonkin's curse, for lack of a better term. Some sort of failsafe left by Jas herself to prevent us from doing what we have just done. You are a fascinating subject World Guardian. Thanks to your efforts, Strisath is now much calmer. It will be a while before I can let him leave Daemonheim, but it's a definite improvement.",
    "The change is temporary, but not insignificant. It is a step towards a solution, but not enough on its own.",
    "I am true to my word.",
    "Complicated. I have neither the time nor the inclination to explain it at this point. Think of it as an inner demon made manifest. That should suffice for now.",
    "You can leave. However, I would have words with your companion.",
    "Very well. Your people are afflicted. I may be able to help.",
    "If you submit yourself to my study, then I believe there is a slim chance - within a few decades - that I may be able to provide a cure.",
    "I will store you in stasis, so the passing of time will mean nothing to you. Your species and mine share similar physiologies. I believe that by investigating your affliction I may be able to help my own people.",
    "Might. There are no guarantees, and I will not promise you a solution. However, I suspect I am the only hope you have.",
    "Hrm... you live, Therragorn. Perhaps I underestimated your resilience. Regardless of your slander, my offer is sincere.",
    "If you must.",
    "You have made the right decision. Superstitions are meaningless. Only results matter. Come, Hannibus. I will prepare the stasis chamber.",
    "Pathetic! You abandon the future of your species for quaint superstitions and short lived social ties. I leave you to your demise, then.",
    "That is a stupid question. He should go with me as that is the only chance his people have to survive. Frankly, I am not sure why we are having this discussion. Yes, it is only a chance, and yes, it means more time in stasis. But still, it is the only hope for his people.",
    "There are no guarantees. It could take centuries to find a cure, or there could be no cure. But seeking the cure should be all that matters.",
    "Meaningless superstitions and sentiment. The ends justify the means.",
    "No."
  ],
  "Strisath": [
    "Sokun-Kerapac! Release me now!",
    "False User! Kill!"
  ],
  "Echo of Jas": [
    "Accidental thing of earth... You trespass into regions you cannot understand. Your destruction will be swift.",
    "Accidental thing of earth... Your efforts here are futile. My defeat is not all-changing. The Creators' blessing may be weakened... But it cannot be undone."
  ],
  "Sharrigan": [
    "Hello, great grandfather.",
    "The last of our kind? No, great grandfather. The white lady of the skies came to our world and found me. When she spoke of you, I knew we had to come. It is time you were with us - your people - in our final days.",
    "No. The decline persists and our population dwindles. There have been no births in a decade now. The Olun'dai has called us to the next world and we are ready.",
    "We are grateful for the sacrifice that you made all those years ago, but it's time to stop fighting. The Ilujanka have embraced our destiny, we are ready for the next life, great grandfather. We are leaving a memorial of us for those who come after. A great tree is being grown from our villages. Upon its bark we are carving our history, our stories and our names. It would honour us greatly if you would carve your stories upon it and join us in the celebrations. It will serve as a guide for whatever creature from Iaia is chosen to replace us.",
    "Of course, great grandfather.",
    "No, great grandfather! Please - the Olun'dai!",
    "Goodbye, great grandfather. I will mark your name on the tree for the future. It was good to have met you.",
    "I am glad great grandfather! We have so many stories to share!",
    "Yes! Come share the skies with us!",
    "Because that is the way things should be. Great grandfather has fought hard and has been through much. He has sacrificed a great deal for our people. He is a legend among our people, one of the few who left to another world. We had thought him little more than a story, but now we learn he has been alive for centuries. He of all people has earned a rest...and he deserves to enjoy that rest with his own kind. He is also old - more than he appears or lets on. I see pain in each movement he makes, and I see the burden that rests upon him. Let him come back to his people. We have accepted our fate and are at peace with it - let him be at peace as well. He has earned it.",
    "I am Sharrigan, Pastkeeper for the Ilujanka. I am also Hannibus's great, great, great, erm...great granddaughter. When Therragorn came to our village, she sought out those that knew of Hannibus and I stepped forward. I was so happy to hear that he was alive, and that he might spend his last days among us.",
    "We enter the twilight of our kind. Births are rare and deaths are common. Where once we were thousands, now only a few of us remain. Even if a cure could be found, I fear it is too late for our people. But we are not sad. We know that death is but a transition from one life to another. Where once we were the mind of Iaia - our homeworld - now we become its soul. We have prepared for our departure, creating homes for the ghur and the other creatures of our world. In time, it will be their turn to become the mind, and eventually they will join us as the soul. Do you see, Player? It is a time to celebrate, not to mourn.",
    "And is it guaranteed to succeed?",
    "And what of his spirit - his soul? He was a statue for centuries. You would do the same to him again? You would keep him from his people and never allow him to follow his Olun'dai."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:One_of_a_Kind?oldid=36229574’"
  ]
}