{
  "Player": [
    "Hello!",
    "How goes your fight with the trolls?",
    "What happened?",
    "I'm sorry to hear that.",
    "Is there anything I can do to help?",
    "I'm sorry, there's nothing I can do.",
    "I'll get Godric back!",
    "Hello!",
    "I haven't found a way to climb up yet.",
    "Not yet.",
    "Hey Sabbot, how's it going?",
    "Tree?",
    "Urgh...that explains the smell.",
    "Why are you called Dad?",
    "I accept your challenge!",
    "Eek! No thanks.",
    "I'll be going now. [Spare Dad]",
    "I'm not done yet! Prepare to die! [Kill Dad]",
    "I'm not climbing that without a good reason. I might scrape my lovely hands on the rough ladder.",
    "Er, hi.",
    "Oh, you don't want to eat me! I'm a tough, hardened adventurer, not tender or tasty at all!",
    "Nothing. I was just leaving.",
    "Errr... I've got to go.",
    "O-oh, he seems cheesed off...",
    "Hello!",
    "I've found my way into the prison.",
    "That's all.",
    "How are you doing in there?",
    "I haven't found the key yet.",
    "I have the key right here.",
    "How are you doing in there?",
    "I don't have the key.",
    "I have the key right here.",
    "Hello!",
    "I have freed Godric!",
    "Has Godric returned home?",
    "I'm glad to hear it.",
    "I'm afraid I lost the lamp you gave me.",
    "I'm afraid I lost the lamps you gave me.",
    "Thank you!"
  ],
  "Commander Denulth": [
    "Welcome back friend!",
    "I'm afraid I have bad news. We made our attack as planned, but we met unexpected resistance.",
    "We were ambushed by trolls coming from the north. They captured Dunstan's son, Godric; we tried to follow, but we were repelled at the foot of their stronghold.",
    "The way to the stronghold is treacherous, friend. Even if you manage to climb your way up, there will be many trolls defending the stronghold.",
    "Saradomin be with you, friend! I would send some of my men with you, but none of them are brave enough to follow.",
    "Saradomin be with you, friend!",
    "Welcome back friend! How are you getting on with rescuing Godric?",
    "Hurry, friend! Who knows what they'll do with Godric?",
    "Then hurry, friend! What are you still doing here?",
    "Welcome back friend!",
    "...and?",
    "Hurry, friend. Find a way to free Godric!",
    "Welcome back friend!",
    "Oh, what great news! You should hurry to tell Dunstan, he will be overjoyed!"
  ],
  "Dunstan": [
    "Have you managed to rescue Godric yet?",
    "Please hurry! Who knows what they will do to him? Is there anything I can do in the meantime?",
    "He is safe and sound, thanks to you my friend!",
    "I have very little to offer you by way of thanks, but perhaps you will accept these family heirlooms. They were found by my great-great-grandfather, but we still don't have any idea what they do.",
    "You're in luck! Someone found it and brought it back to me. Here you go.",
    "You're in luck! Someone found them and brought them back to me. Here you go."
  ],
  "Sabbot": [
    "Terrible! The missus is still insisting on living on the surface like some sort of...some sort of...",
    "Yes! Exactly! Like some sort of TREE! So, I'm going to sort this place out myself! At least there's room to have a separate toilet down here.",
    "You shut your cake hole! Why did you come to bother me anyway?"
  ],
  "Dad": [
    "What tiny human do in troll arena? Dad challenge human to fight!",
    "Troll named after first thing try to eat!",
    "Tiny human brave. Dad squish!",
    "Coward. Dad wait for braver fighter.",
    "No human pass through arena without defeating Dad!",
    "Stop! You win. Not hurt Dad."
  ],
  "Burntmeat": [
    "Hmm? What human do in troll kitchen? Burntmeat tired of cooking goats. Human look tasty.",
    "Hmm. Burntmeat think you probably right. What human doing here?"
  ],
  "Aga": [
    "What man-thing want?"
  ],
  "Arrg": [
    "Aaaarrrrrghhh!"
  ],
  "Godric": [
    "I'm a little weakened by my stay, but nothing serious. How soon can you get me out of here?",
    "One of the guards is bound to have it. Find a way to get it off them!",
    "Excellent! Unlock this door and I'll have us out of here in no time.",
    "Thank you my friend."
  ],
  "Eadgar": [
    "I'm fine! Just dandy! A bit cold, I keep asking them to install a fireplace but they don't listen.",
    "It's on the guard's belt, silly. Free me and I can cook you something good!",
    "Well done, well done. Now let me out! That rock is looking at me funny.",
    "Thanks! I'm off back home!"
  ],
  "PLAYER": [
    "Hi!",
    "Why do you live so close to the trolls? Isn't it dangerous?",
    "What do you have to offer?",
    "Thanks, I might come back with some logs.",
    "No thanks, Eadgar."
  ],
  "EADGAR": [
    "Welcome to Mad Eadgar's! You'll never want to leave! Would you care to sample our delicious home cooking?",
    "Well, I suppose I do keep getting captured by the trolls nd thrown in prison... But they always release me in the end, I'm far too old and skinny for their tastes. In any case, this is my home, and I'm not leaving it. And this area has the tastiest goats!",
    "The chef's recommendation for today is mountain goat stew. I'll give some stew in exchange for logs for my fire. They're hard to come by around here.",
    "Your loss!"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Troll_Stronghold?oldid=35521146’"
  ]
}