{
  "Rantz": [
    "Hey you creature! Make me some stabbers! I wanna hunt da chompy?",
    "For da stabbie chucker, I's wanna hunt da chompy! Creature knows what Rantz wants... ...flyin' to stabbie da chompy!",
    "Yeah, is what Rantz sayed, make da stabbers for da stabby chucker!",
    "Da chompy is der bestest yummies for Rantz, Fycie and Bugs! We's looking for da yummies all da time. Da chompy is a big flapper, Rantz want's stabbers to sneaky, sneaky, stick da chompy.",
    "Yeah, is what Rantz sayed. Da chompy is da big flapper and is bestest yummies. But Rantz needs stabbers to stick da chompy... Will creatures make dem stabbers for us?",
    "Ahhh, da creature wants to know Rantz secret for stabbers? Rantz not say till da creature says will make da stabbers for us else you Creature steals da chompy from us!",
    "When I make 'stabbers', I pretend you chompy and practice on you!",
    "Good you creature, you need sticksies from achey tree and stabbies from dog bones.",
    "Hey you creature... Have you made me da stabbers? I wanna stick da chompy?",
    "You do stabbers quick!...quick!.. Or Rantz make stabbers for Rantz and then practice for chompy sticking on creature!",
    "Grrr creature...you's no good stabber maker! You's make da stabbie bit from da dog bones, and get da sticksies from da Achey tree...simple see! Oh and da flufsies from da flappers as well!",
    "Is just what Rantz sayed! ~ The hulking ogre nods excitedly.",
    "Good creature, quickly, hurry bring da stabbers!",
    "Hey you creature... Have you made me da stabbers? I wanna stick da chompy?",
    "Ahh, der creature has dem...goodly, goodly. Now us can stick der chompy bird... But da chompy not coming without da fatsy toadies... Godda get der fatsy toadies to get da chompys. Den we put it over de're and sneaky, sneaky stick da chompy.",
    "Chompys love fa fatsy toadies. Toadies get big on der swamp gas and der chompys are licking der lips for em as me is licking lips for da chompy. Da chompys don't like da smaller toadies from nearby swampy. Dey's fussie eaters just like Rantz. Fycie an' Bugs play with toadies and blowers dey's all times making fatsy toadies.",
    "Fatsy toadies are da chompy burds bestest yumms. But da toadies here are too small for da chompy. You've godda make da toadies big and round!",
    "Over der!",
    "Ok creature? You got dat? Over dere by der no tree's place.",
    "Duh! You creature is a bit stoopid yes? US needs to sneaky, sneaky and stick da chompy! Den we can eat da chompy!",
    "Hey you creature, you still here? Da chompy still not coming! We need da fatsy toady to get da chompy, do you got it? Do you got da fatsy toady? Then we can sneaky, sneaky stick da chompy.",
    "Dat's a pidy...but maybe Rantz can help da creature?",
    "Hey you creature, you still here? Da chompy still not coming! We need da fatsy toady to get da chompy, do you got it? Do you got da fatsy toady? Then we can sneaky, sneaky stick da chompy.",
    "Dat's a good fatsy toady, now we's need to put it for da chompy to come.",
    "Over 'dere creature, put da toadies over der! ~ The ogre points to a clearing to the south. ~",
    "Goodz, me now waits for da chompy! It shouldn't be long now. Sneaky...sneaky...",
    "Hey..you's creature, is da fatsy toady still dere? Go get more fatsy toadies if dey all gone!",
    "Hey, dere's da chompy, I's gonna shoot it!",
    "I knows, I keep missing...because your stabbers are worserer at flying than a dead dog.",
    "Grrrr.... You lookin' like a chompy!",
    "No, is Rantz stabby thrower... you too weedy...",
    "Oh, ok...I lend you other stabby thrower... but creature don't better cry when it hurts itself.",
    "Or I eat you instead!",
    "Hey! You! Got da chompy yet?",
    "Well hurry up and get some, we is hungry!",
    "Dat's a great chompy, you musta got a lucky shot wiv da stabbie chucker.",
    "Okay's now you's needs to cook da chompy! Slurp! You's can cook it's over der! ~ Rantz points to a nearby spit roast.~",
    "But's we's particular about our chompy yumms. Me's wants Onion. wiv mine! Fycie and Bugs want something wiv der's as well, go and ask 'em wat dey want.",
    "Yep, da split's over der! Last time Rantz did yummies, got very bad, did bad things to food...and belly.",
    "Hey creature, did you's get da cooked chompy yet? I smelled something cooking and it mades me 'ungry. Hand over da chompy if ya know what's good for ya.",
    "Hey hey! We got da delicious chompy bird Yay! This looks really tasty as well! Tank's very much for da chompy... Fycie an Bugs like very much da chompy yumms!~ The family of ogres sit down together ~~ and enjoy your well cooked chompy bird. ~",
    "Creature done good, cooking da chompy. Maybe you wants a free hatsie? Rantz got lots of hatsies for chompy shooters.",
    "Creature stupid? Hatsies to wear on head, make you look good. Huh huh huh.",
    "Dat's what Rantz said. You want hatsies or not?",
    "Okay, but Rantz only give hatsies if creature stabbied lotsa chompies. You not get hatsies until you stick more chompies."
  ],
  "Player": [
    "What are stabbers?",
    "I think I understand. You want me to make some arrows for you?",
    "What's a 'chompy'?",
    "Ah, so 'da chompy' is some kind of bird?",
    "How do I make the 'stabbers'?",
    "Er, make your own 'stabbers'!",
    "OK, I'll make you some 'stabbers'.",
    "That's right... and I'm making some 'stabbers' for Rantz.",
    "How many 'bright pretties' do you want?",
    "Ok, I'll give you 50 bright pretties.",
    "Er, sorry, I can't give you that many...",
    "Er not exactly?",
    "How do I make the 'stabbers' again?",
    "Oh, so I need logs from the achey tree, bones from a canine...and feathers?",
    "Ok, I'll make the 'stabbers' for you.",
    "Well, yes actually, as you asked so nicely. Here you go! Here's your 'stabbers'.",
    "How do we make the chompys come?",
    "What are 'fatsy toadies'?",
    "Where do we put the fatsy toadies?",
    "What do you mean 'sneaky..sneaky, stick da chompy?'",
    "Ok, thanks.",
    "No I haven't got the 'fatsy toady' yet!",
    "Rantz said that you play with the 'fatsy toadies', what are they?",
    "Rantz said that you play with the 'fatsy toadies', what are they?",
    "Humph!",
    "I guess this is what an ogre would call a locked chest.",
    "Yes, I have a 'fatsy toady' for you, here look!",
    "Where should I put the 'fatsy toadies'?",
    "There you go, I've placed the bait.",
    "Yes, I know...stick da chompy!",
    "What? I have to get more bait if there's none there? Does this Chompy Bird even exist I wonder?",
    "Hey there, you keep missing the chompy bird.",
    "Oh, keep trying then.. you might hit one through pure luck.",
    "Come on, let me have a go...",
    "I'm actually quite strong... please let me try.",
    "Oh suit yourself, you'll just have to go hungry.",
    "Not yet!",
    "Yep, here's your chompy Bird![sic]",
    "What! Now I've gotten the chompy bird, you expect me to cook it as well?",
    "HUH!",
    "Yes, here you go, here's your cooked chompy bird.",
    "It's my pleasure!",
    "What are these 'hatsies'?",
    "Ah, I see, you're offering me hats.",
    "Okay, show me your 'hatsies'."
  ],
  "Bugs": [
    "You's better talk to Dad, him chasey sneaky da chompy.",
    "Oh we sometimes use da blower on da toadies but Dad don't let us get in da locked box no more. He, he, it was good fun making da toadies fat on da swamp gas.",
    "Dad says you's making da chompy for us! Slurp! Me's has to have cabbage wiv mine! Chompy is our favorite yummms!"
  ],
  "Fycie": [
    "You's better talk to Dad, We not talk to wierdly 'umans.",
    "Hey you Creature, I know's what you is You's a 'uman!",
    "Dat's great...Dad want's to hunt da chompy...Da chompy is our bestest yumms! You needsing flufsies for stabbers. Fycie have some but I is wanting some bright pretties for em!",
    "Mee's want lots of bright pretties, this many! ~ Fycie quickly opens and closes her hands in front ~ ~ of you to indicate a number of bright pretties ~ ~ It looks like she wants 50 gold coins.~",
    "Ok, dat's good 'un. I got da bright pretties and you got da flufsies!",
    "Well, you not have da flufsies den!",
    "I's sorry creature, I don't got no more flufsies! But I got lots of bright pretties! Hope you's get da stabbers for Dad soonly!",
    "Oh we sometimes is using blower on da toadies but Dad don't let us get in da locksy blocksy no more. He, he, big chucklees when make da toadies fat on da swampy gas.",
    "Dad say's you's roasting da chompy for us! Slurp! Me's want tomato wiv mine! Yummy, can't wait to eats it."
  ],
  "Chompy bird": [
    "Sqwark! Gobble!"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Big_Chompy_Bird_Hunting?oldid=36233804’"
  ]
}