{
  "Head chef": [
    "Hello, welcome to the Cooking Guild. It's always great to have such an accomplished chef visit us. Say, would you be interested in a Skillcape of Cooking? They're only available to master chefs.",
    "Player! Ah yes, I've heard good things about you from the cook in Lumbridge Castle! He was telling me at the latest meeting of the 'Cooks, Apprentices and Kitchen Experts Society' that you really helped him out of a pickle with the Duke's birthday cake!",
    "And that incident with the feast... you saved his bacon on that one!",
    "Well... there is something I could use some help with...",
    "It's quite a delicate matter... can you be... discreet?",
    "Great! I knew I could rely on you.",
    "Well, I'm in a bit of a bind, so I guess I'll just have to take the risk...",
    "Ah, well if you change your mind I'll be here...",
    "Excellent! Here's the situation...",
    "The Cooks, Apprentices and Kitchen Experts Society are looking for a new leader, after the previous one, er... 'retired'.",
    "There was... an incident... with a wild pie. Things got a bit messy... we don't really speak of it... But at least there were no lasting injuries!",
    "But enough about that... it would mean the world to me to be the next leader of the society! As Head Chef, I'm always experimenting in the kitchen. Working on new recipes. INNOVATING!",
    "Oh, I ADORE food. Combining new flavours, tasting them...\tSeeing the enjoyment on others' faces as the flavours dance along their tongues, exploding in a crescendo of deliciousness! It's what I live for!",
    "Oh it's so much more than just a job! Who wouldn't want to do the thing they love every day? But anyway, I digress...",
    "Sorry, I got lost in the moment there. Where was I?",
    "Oh yes...",
    "I've been working on a new dessert to show off to the other members, and convince them that I'm the right man for the job! It's a TOP SECRET recipe. Something that will change the pudding landscape for ever... This recipe will astound and amaze them. Their taste buds won't know what's hit them!",
    "Oh, it is!",
    "Are you ready?",
    "Are you sure?",
    "Brace yourself...",
    "Cheesecake!",
    "Cheesecake...",
    "It's not cheese *in* a cake. It's cheese on some biscuits.",
    "No! Not cheese AND biscuits... Oh dear, you're getting me all flustered, I'm not explaining this very well...",
    "... I'll show you how to make it! Then you can experience it for yourself! But here's the problem, I've run out of one of the main ingredients - cream cheese.",
    "Would you be so kind? The cream cheese I use comes from a cottage dairy, run by a lovely couple called Phil and Delphie. They're based in Falador, just north of the Artisan Workshop.",
    "We all have to start somewhere... Anyway, run along and pick up the cream cheese from Phil and Delphie.",
    "Have you got the cream cheese I asked for from Phil and Delphie yet?",
    "I need some cream cheese so I can show you how to make cheesecake. I'd like you to collect some from Phil and Delphie. You can find them in Falador, just north of the Artisan Workshop.",
    "Wonderful! *sniff* Aaaah that smells so fresh and delicious! Right, we're going to need some additional ingredients... A pot of cream...",
    "...and some biscuits. If you'd like to make some you can do so by combining flour and butter to make biscuit dough, then bake in the oven for a few minutes. Oh, and you'll also need a cake tin.",
    "Actually, let me write that down for you...",
    "I need you to bring cream cheese, a pot of cream, biscuits and a cake tin, so I can show you how to make cheesecake.",
    "Ah good... now you'll need to combine them all together!",
    "No, no, no! We don't just 'bung' things in! We must craft the cheesecake, with love and care!",
    "You must gently break up the biscuits into crumbs, then carefully line the tin to form a delicious buttery, crunchy base.\tThen you combine the cream cheese and the pot of cream into a decadent topping, and spread delicately on top.",
    "What?! No! You don't COOK cheesecake!\tAre you going to take this seriously, or do I need to throw you out?",
    "That's OK. Now, follow my intructions[sic] and make the cheesecake. Then let me see what you've made.",
    "Have you made a cheesecake yet?",
    "My, you are forgetful! Place biscuits, cream cheese and a pot of cream into a cake tin. It's that simple!",
    "How'd you get that? There must be a leak...",
    "A mole!",
    "... No.",
    "That looks good enough to eat! Now, there's just one more thing I need you to do for me...",
    "I need you to take that cheesecake to some of the members of the Cooks, Apprentices and Kitchen Experts Society, so they can sample it before they vote on who will be leader!",
    "I can't possibly leave my post here! What if someone wants to buy a Skillcape?",
    "A minor detail! It's my recipe, and that's what counts!",
    "Here, take this list! Come back to me when you've been to them all.",
    "Yes, I gave you a list of people to take cheesecake to. Please come back to me when you've been to them all!",
    "Have you looked in your backpack?",
    "Here, take another!",
    "I know, Player! I just got word from the Cooks, Apprentices and Kitchen Experts Society - they've voted me in as their new leader!",
    "Thanks for all your help!",
    "You need four free spaces in your backpack for me to give you your reward.",
    "Welcome back, Player!",
    "You've made all the flavours of cheesecake!",
    "What do you mean 'even the bacon cheesecake'?",
    "You don't have enough space for your reward, come back when you've made space for two items.",
    "Here you go.",
    "Oh, it's fabulous! We're sharing so many new recipe ideas and techniques...",
    "I just wish I could remember what they were after the meeting...",
    "I don't know what you mean...",
    "I'd be delighted to!",
    "You have your ordinary, plain cheesecake. Creamy and delicious, and simple to make!",
    "But you know all about that one already, of course!",
    "If you can get your hands on some vanilla, chocolate or strawberry milk, you can make some flavoured cream cheeses.",
    "Of course!",
    "Now, if you're after something a bit... tangy... just pop a lemon in with your basic cheesecake mix!",
    "And I've got just the thing for you, if you're feeling... adventurous?",
    "Bacon!",
    "Bacon!",
    "Of course not! Trust me, it'll change your life. You'll wonder how you ever lived without it!",
    "They have healing properties you know. Each more powerful than the last, and strongest of all the bacon...",
    "Make one of each flavour and I'll give you a reward!",
    "I've actually been having some trouble with that. I don't suppose you have any ideas?",
    "You mean redberry?",
    "Sorry, I have no idea what you mean by 'raspberry'.",
    "Hilarious.",
    "Hmm, that might just work...",
    "Yet another great recipe idea by me!",
    "By. Me.",
    "Yes, I need some more ideas, do you have any?",
    "Well I want to make new flavours, not just some more of the same.",
    "What?",
    "Okay.",
    "It's more flavoured?",
    "Ah! So just use my standard flavours but stronger. That might actually work...",
    "Raw chicken?!",
    "Panini head! You're going to kill someone!",
    "Uh, definitely not a secret recipe I'm working on...",
    "Well it was worth a try, let me know if you thing of anything."
  ],
  "Player": [
    "Oh really? That was so long ago, I've forgotten all about it!",
    "Well, I was pretty amazing! But anyway, did you have any quests for me?",
    "Go on...",
    "What do you mean, 'retired'?",
    "...",
    "You sound pretty passionate...",
    "I'm not really sure...",
    "So, what is this revolutionary dessert?",
    "Yes.",
    "Yes.",
    "... I'm sorry, I think I misheard you. Did you say *cheese* *cake*?",
    "...Why on Gielinor would anyone put CHEESE in a CAKE? Have you lost your mind?",
    "Your revolutionary new dessert is cheese and biscuits?",
    "That seems an odd place for a dairy... it's not exactly close to any cows!",
    "Yes Chef!",
    "Er... no. Can you remind me what I'm supposed to be doing?",
    "Right. Got it.",
    "Hello... you must be Phil and Delphie?",
    "The Head Chef from the Varrock Cooking Guild sent me to collect some cream cheese for his special top secret recipe... oh no, I've said too much!",
    "Er... how did you...?",
    "*snigger*",
    "You've been making cheesecake?",
    "So what do I do about the cream cheese?",
    "I'll see what I can do.",
    "Oh, I already have those with me!",
    "Oh, yes... I'll get right on that.",
    "I have the logs and the steel bar for repairing the churn!",
    "I repaired the churn, can you show me how to make the cream cheese now?",
    "Oh, well that's OK, I just happen to have a bucket of milk with me...",
    "Not yet, I'm still working on it.",
    "I have the milk you needed!",
    "That's all there is to it?",
    "...",
    "Here's the cream cheese...",
    "I just came from a dairy! You could have said sooner!",
    "Got some right here...",
    "Got it...",
    "Thanks, I'll be back soon.",
    "OK, I'll be right back.",
    "I have all the items you asked for to make cheesecake...",
    "What? Just bung them all in?",
    "I thought we were cooking...?",
    "And then we cook it?",
    "Yes Chef.",
    "No... could you remind me what I need to do?",
    "OK!",
    "A talking leek?",
    "A talking mole-leek hybrid?!",
    "I made the cheesecake...",
    "Oh...",
    "Why can't you take it yourself?",
    "I see. But wait... Isn't that *my* cheesecake?",
    "... Fine, who do I need to take it to?",
    "Was I meant to be doing something?",
    "Oh... silly me!",
    "The Head Chef asked me to bring you this to try.",
    "I'm glad you liked it! I'll go and tell him that I've finished, see you later!",
    "The Head Chef asked me to bring you this to try.",
    "The Head Chef is a true culinary genius.",
    "I have a feeling you're about to suggest something.",
    "... Banana bread? Don't be ridiculous! You can't just mix two random foods and hope to make something delicious!",
    "I'm glad you liked it! I'll go and tell him that I've finished, see you later!",
    "The Head Chef asked me to bring you this to try.",
    "I'm glad you liked it! I'll go and tell him that I've finished, see you later!",
    "Everyone loved the cheesecake!",
    "I should've trusted you when you said they would be good, even the bacon cheesecake!",
    "Er, nothing... You mentioned a reward?",
    "So, how are things in the Society, now that you're leader?",
    "Too many Short Green Guys?",
    "Never mind.",
    "Can you tell me more about the different flavours of cheesecake there are?",
    "And I can use those to make vanilla, chocolate and strawberry cheesecakes?",
    "Er...?",
    "What?!",
    "You've been on the Short Green Guys again, haven't you?",
    "Sure...",
    "Okay!",
    "Do you have any more ideas for cheesecake flavours?",
    "Raspberry?",
    "No, raspberry!",
    "Turtle?",
    "By you? It was my idea, so surel-",
    "Wow, that sure was a great idea Head Chef!",
    "S'more?",
    "Yes! S'more cheesecakes!",
    "...",
    "Ok, imagine a cheesecake.",
    "Now imagine it's s'more flavoured!",
    "I... Nevermind.",
    "Raw chicken?",
    "I wasn't being ser-",
    "Wait did you just call me a 'panini head'? What's a 'panini'?",
    "Nope!"
  ],
  "Delphie/Phil": [
    "That's right... what can we do for you, adventurer?"
  ],
  "Phil": [
    "Top secret? Ha! Is this his cheesecake recipe by any chance?",
    "We've been filling so many orders for cheesecake, the thing just fell to pieces!",
    "Of course! It's not a secret any more, with that loose lipped drunkard blabbing about it! EVERYONE knows about cheesecake! Plus, it helps to pay the rent... much more than dairy churning ever will! You wouldn't believe the number of orders we get from the Party Room over the way. And those dwarven miners just can't get enough of it!",
    "Great! By the looks of it, some basic logs and a steel bar should suffice for the repair.",
    "Wow, how very efficient of you! Get to work then, Player!",
    "Any luck getting those logs and steel bar to repair our dairy churn? Without it we can't make the cream cheese you need for the Head Chef.",
    "Great! Get to work then, Player!",
    "Well, Delphie isn't that fond of the smell of farm animals. Plus we have the beautiful park right on our doorstep here!",
    "Have you got us some milk, so we can make the cream cheese?",
    "Well, what did you expect?"
  ],
  "Delphie": [
    "He's been working on that recipe for months... He hints about it at every Cooks, Apprentices and Kitchen Experts Society meeting, then gets blind drunk on Short Green Guys, and gives all the details to anyone that will listen! By the next day he's forgetten[sic] he's told anyone!",
    "Anyway dearie, you said you wanted cream cheese? I'm afraid we've had to stop production temporarily, as our dairy churn is out of action...",
    "If you help us repair the dairy churn, we'll show you how to make cream cheese, and then you can take some back to the Head Chef.",
    "Of course... Oh shoot, we're out of milk... Would you be a dear and fetch some for us?",
    "My, that is fortunate!",
    "Excellent! Just give the milk a good mix in the churn, and you'll have delicious cream cheese in no time!",
    "Just give that bucket of milk you have a good mix in the dairy churn, then you'll have delicious cream cheese to take back to the Head Chef.",
    "Oh good, you managed to make the cream cheese! You can take it to the Head Chef now."
  ],
  "Mess Sergeant Ramsey": [
    "Where is the library? What am I saying? I mean where is the cheese? Can I help you?",
    "I am partial to a slice of cake... It's raw! ...and delicious! Wow! The topping is so rich and creamy! He has my vote!"
  ],
  "Cook": [
    "That buttery biscuit base is to die for! He has my vote! Who'd have thought to combine cream cheese and biscuits...",
    "I wonder what else might work?",
    "Banana... bread?",
    "You're right, it wouldn't be as good as cheesecake. Maybe I'll just try my hand at making cheesecakes for now, they sure are good...",
    "What do you want? I'm busy?",
    "This is a taste sensation! The Head Chef has excelled himself this time. He has my vote!"
  ],
  "Congratulations! You have completed": [
    "'Chef's Assistant' - Complete this quest."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Chef%27s_Assistant?oldid=36202456’"
  ]
}