{
  "Kangai Mau": [
    "Hello. I Kangai Mau of the Rantuki tribe.",
    "I'm looking for someone brave to go on important mission. Someone skilled in thievery and sneaking about. I am told I can find such people in Brimhaven.",
    "Let's hope I find them.",
    "Adventure is something I may be able to give. I need someone to go on a mission to the city of Ardougne. There you will find the house of Lord Handlemort. In his house he has our tribal totem. We need it back.",
    "Lord Handlemort is an Ardougnese explorer which means he think he have the right to come to my tribal home, steal our stuff and put in his private museum.",
    "I don't know Ardougne. You tell me.",
    "Best of luck with that adventurer.",
    "A proud and noble tribe of Karamja. But now we are few, as men come from across, steal our land, and settle on our hunting grounds.",
    "Have you got our totem back?",
    "Bah, you no good.",
    "Have you got our totem back?",
    "You have??? Many thanks brave adventurer! Here, have some freshly cooked Karamjan fish, caught specially by my tribe."
  ],
  "Player": [
    "And what are you doing here in Brimhaven?",
    "Yep. I have heard there are many of that type here.",
    "I'm in search of adventure!",
    "Why does he have it?",
    "How can I find Handlemoret's house? Ardougne IS a big place...",
    "Ok, I will get it back.",
    "Who are the Rantuki tribe?",
    "No, it's not that easy.",
    "Yes. It's very nice.",
    "So... who are you?",
    "So... do you garden round the back, too?",
    "Doesn't all of the security around the house get in your way then?",
    "Whose middle name?",
    "Do you need any help?",
    "Two jobs? That's got to be tough.",
    "So, what have you invented?",
    "So where is the other block?",
    "Who are the RPDT?",
    "Now I just need someone to deliver it for me.",
    "So, when are you going to deliver this crate?",
    "Can I be teleported please?",
    "Yes, that sounds good. Teleport me!",
    "Yes I have."
  ],
  "Horacio": [
    "It's a fine day to be out in a garden, isn't it?",
    "Days like these make me glad to be alive!",
    "My name is Horacio Dobson. I'm a gardener to Lord Handlemort. Take a look around this beautiful garden, all of this is my handiwork.",
    "That I do!",
    "Ah. I'm used to all that. I have my keys, the guard dogs know me, and I know the combination to the door lock. It's rather easy, it's his middle name.",
    "Hum. I probably shouldn't have said that. Forget I mentioned it.",
    "Trying to muscle in on my job, eh? I'm more than happy to do this all by myself!"
  ],
  "Wizard Cromperty": [
    "Hello Player, I'm Cromperty. Sedridor has told me about you. As a wizard and an inventor, he has aided me in my great invention!",
    "Not when you combine them it isn't! Invent MAGIC things!",
    "Ah! My latest invention is my patent pending teleportation block! It emits a low level magical signal, that will allow me to locate it anywhere in the world, and teleport anything directly to it! I hope to revolutionize the entire teleportation system! Don't you think I'm great? Uh, I mean it's great?",
    "Well...Hmm. I would guess somewhere between here and the Wizards' Tower in Misthalin. All I know is that it hasn't got there yet as the wizards there would have contacted me. I'm using the RPDT for delivery. They assured me it would be delivered promptly.",
    "The Runescape Parcel Delivery Team. They come very highly recommended. Their motto is: \"We aim to deliver your stuff at some point after you have paid us!\"",
    "By all means! I'm afraid I can't give you any specifics as to where you will come out however. Presumably wherever the other block is located.",
    "Okey dokey! Ready? Dipsolum sentento sententi!"
  ],
  "There is a label on this crate": [
    "Senior Patents Clerk, Chamber of Invention, The Wizards' Tower, Misthalin. The crate is securely fastened shut and ready for delivery.",
    "To Lord Handlemort. Handlemort Mansion, Ardougne. You carefully peel it off and take it."
  ],
  "RPDT Employee": [
    "Welcome to R.P.D.T.!",
    "Well...I guess we could do it now..."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Tribal_Totem?oldid=32992760’"
  ]
}