{
  "This page contains dialogue related to Recipe for Disaster": [
    "Freeing Evil Dave.The content below is copied verbatim from RuneScape and thus copyrighted by Jagex."
  ],
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "dialogue options for spice dosesYou can discuss this issue on the talk page or edit this page to improve it."
  ],
  "Player": [
    "Evil Dave? What's he doing on the secret council?",
    "So how do I free him?",
    "But who could that be?",
    "You mean I need to talk to Evil Dave outside the time bubble?",
    "Oooooookaaaaay....",
    "That fellow with the unhealthy obsession with black... Dave his name is...",
    "I can't quite remember what I did to protect him.",
    "Uh... what?",
    "Oh yeah... I remember now...",
    "Is Dave in?",
    "Yes, I'm evil!",
    "No, I just want to talk to him.",
    "Can Dave come out to play?",
    "Nice basement!",
    "I mean, evil!",
    "So have you had any luck with the demon-summoning?",
    "And did you manage to summon any?",
    "See you later!",
    "Weren't you going to give up evil?",
    "What did you eat at the secret council meeting?",
    "Right...",
    "I need to make that exact food in order to save you from the culinomancer's spell.",
    "Sort of, it's complicated. It works like this...",
    "Although you're here, you're also still in the time freeze.",
    "I mean, the whole room was frozen in time at the moment the culinomancer cast his spell, right?",
    "Of course you didn't! You were frozen!",
    "They're both you!",
    "From YOUR point of view I've saved you, but from MINE I haven't.",
    "But I have to save you, otherwise you won't be saved!",
    "That's what I meant, from your point of view I've saved you but from mine I haven't!",
    "I've to take the food back in time to give it to you.",
    "Because otherwise you won't be saved from the culinomancer's spell.",
    "Exactly! That's why I know I have to go back and save you!",
    "I can't not, because I already have!",
    "The fact that you're here means I already did save you, which means that you have to tell me the correct recipe. It's logically impossible for you not to!",
    "There will be a temporal paradox and the universe will implode!",
    "Exactly! So you've got to tell me the recipe!",
    "I don't know.",
    "You've got to tell me because the magic requires it!",
    "So what was it?",
    "The food you ate at the council meeting.",
    "Evil stew? How was it evil?",
    "I think you're mixing up 'good' and 'evil' again!",
    "I suppose that makes some kind of sense. But I need to reproduce this stew, so can you describe it in more detail?",
    "Okay, I'd better talk to your mum.",
    "Oh, never mind.",
    "Let me try to explain the time travel thing again...",
    "You've got to tell me because the magic requires it!",
    "May I use your spices for making stew?",
    "I'd better go and kill some hell-rats then.",
    "I haven't been able to make any stew that Dave likes yet.",
    "What's it like living so close to the wilderness?",
    "How did Dave come to be evil?",
    "What's happened to my cat?",
    "No, I like it this way.",
    "Could you taste this stew please?",
    "Don't eat it all! Now I just have to go back in time and give it to your earlier self!",
    "You've already eaten it! This is the stew that you remember tasting in the first place!",
    "Yes. I'm just about to go back in time to give it to him in the first place.",
    "I've just saved you from a buffet worse than death!",
    "Yes. Now it's very important you remember what the stew tasted like!",
    "Because... it just is!"
  ],
  "Fortuneteller": [
    "The council is meant to include one dark wizard, but obviously the other members did not want to include anyone who was a real threat.",
    "To free Evil Dave you must make a stew, but it must be seasoned in a very particular way. The only way to find the recipe would be to ask someone who has tasted the stew.",
    "Remember that from the point of view of the outside world, anything you do in here has already happened. All the people here are out in the world, because from their point of view you have already rescued them.",
    "Yes. He lives in Edgeville. With his mother. In her basement. I make no judgement about that.",
    "Remember, you need to make a particular stew for Evil Dave. Speak to him outside the time warp, because from his point of view out there you have already rescued him so he has already eaten the stew. He lives in Edgeville.",
    "Good work adventurer, I've teleported them away to safety! You only have [number] council members left to protect!"
  ],
  "Cook": [
    "Oh yeah! I didn't understand that one myself, but apparently you went and asked him how he likes his stew, then made him remember it after he'd tasted it!",
    "Yeah, I didn't understand it either, but you mentioned something about demonic incursions and evil cats too!",
    "Did you want a reminder on any other of your brave exploits?"
  ],
  "Doris": [
    "Hello, dearie?",
    "Yes, he's just down in the cellar. Are you one of his evil friends?",
    "Well, I hope the two of you have a good time. Try not to make too much mess.",
    "Oh, that's good. He needs to spend time with more normal people. He hardly ever leaves that cellar, it can't be healthy.",
    "I know he's a grown man who lives in his mum's basement and hardly ever sees daylight, but there's no need to be nasty about it.",
    "Hello again.",
    "You can if you can find them. Dave's hell-rats stole them all!",
    "Hello again. Did you make your stew?",
    "Oh, he's terribly hard to please, isn't he? I never know how to make food evil enough for him, I just have to try different things and see what he likes.",
    "Oh, it's not all that bad. It was a bit scary at first but as long as I don't go past the warning signs I'm all right. It's actually pretty quiet here. I used to live in Lumbridge and, let me tell you, that's the dangerous place for people like me. Thieves were picking people's pockets with impunity, and killing them on the streets in broad daylight! And there weren't even any guards to protect us! Not that the guards in the other cities do much good to protect people from what I've heard. I just thank goodness I haven't got an Attack option any more! I wouldn't last five minutes!",
    "Oh, I don't know really. He's always been evil, I think. Maybe growing up so close to the wilderness has affected him in some way. When he was little he used to want to go into Edgeville dungeon. You know how kids are, always wanting to be dungeon adventurers! But he didn't want to be a hero, he wanted to be a monster! And then he spent all summer building a tree-house. Except it wasn't a tree-house, of course, it was his Tower of Fear! Of course I was hoping he'd have grown out of it by now and maybe even left home. But at least it keeps him happy.",
    "Oh, poor thing. The hell-rats do that, you know. I think a nice drink of milk would sort it out. Shall I give it one?",
    "Here puss...",
    "Well, I suppose as long as the cat is all right, it doesn't matter what it looks like.",
    "Hello dearie. Did Dave like the stew you gave him?",
    "Have a nice time then."
  ],
  "Evil Dave": [
    "Welcome to my BASEMENT OF DOOM!",
    "Nice?!",
    "Yeah! I'm going to use it to summon DEMONS to DO MY BIDDING, or raise an ARMY OF THE UNDEAD! And then I'm going to totally, like, take over the world! Ah-ha-ha-ha-ha-haa!",
    "Well, I thought I should start small, so I asked Wizard Grayzag for some help with summoning imps...",
    "Well, not imps, exactly. It turns out they're not the lowest form of demon after all. I got these hell-rats. They're hardly evil at all! They're just like regular rats only they smell vaguely of sulphur!",
    "Soon you will return to bow before my EVIL THRONE!",
    "Yeah, well... I did try. I wore this bright red jumper and I got up in the morning and spent the day outside in the sunshine...",
    "But I couldn't keep it up. I just didn't find anything good very interesting, you know? Sometimes I worry about the consequences of evil. I don't really want anyone to get hurt, not like what happened with Denath. But I can't not be evil! It's just who I am! Ah-ha-ha-ha-ha-haa!",
    "Hey, the council meeting! They wanted me to be their evil representative! That proves I'm a great dark wizard! Right?",
    "But anyway, why do you want to know what I ate?",
    "What? But that was last week! You've already saved me!",
    "What?",
    "What? I didn't notice anything.",
    "So how can I be there and also here? Which one is me? I mean, I feel like I'm me, but what if I'm not me? That would be terrible!",
    "How does that work?",
    "Well that's all right, as long as I'm saved from my point of view!",
    "But I'm here so you must already have saved me!",
    "What?",
    "Why?",
    "But I was saved from the spell! I remember it!",
    "What will happen if you don't?",
    "What?",
    "I don't understand this at all.",
    "Oh no! That would be bad, and not even in an evil way!",
    "But I still don't understand why you need the recipe when you've already saved me!",
    "That's not very helpful. I don't even understand why you need the recipe anyway.",
    "All right! Now that makes perfect sense!",
    "What was what?",
    "It was, like, this totally evil stew!",
    "Well, it kind of tasted evil, you know? You know, how you taste something and you think, that's really EVIL?",
    "What? Well, I'm evil, and I only like evil stuff, and I liked that, so it must be evil. Right?",
    "Well it tasted like the stews my mum makes. She puts these spices in them. But it was like she'd got the amounts totally right this time.",
    "Welcome to my BASEMENT OF DOOM!",
    "Woah, that's one totally evil cat! It looks way more evil than you!",
    "That's what you said before! Honestly, why make it more complicated than it needs to be?",
    "Welcome to my BASEMENT OF DOOM!",
    "Woah, that's one totally evil cat! It looks way more evil than you!",
    "That's nothing like the stew I tasted. All the spices are wrong.",
    "Hmm... I think you've got the amount of one spice right, but the others are wrong.",
    "TOTALLY EVIL! That's EXACTLY how the stew tasted!",
    "What? Why can't I eat it?",
    "So confused...",
    "Woah, what happened?",
    "Hey, this is pretty evil stew!",
    "Why?",
    "Okay."
  ],
  "Congratulations! You have completed": [
    "'Recipe for Disaster: Freeing Evil Dave' - Complete this Intermediate quest."
  ],
  "v • d • eRS3 Recipe for Disaster": [
    "Freeing Evil DaveA subquest of Recipe for DisasterNPCs"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Recipe_for_Disaster:_Freeing_Evil_Dave?oldid=35386031’"
  ]
}