{
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "zombie protester dialogue when spoken to directly pre/in-quest, misc dialogue optionsYou can discuss this issue on the talk page or edit this page to improve it."
  ],
  "Player": [
    "Hello there!",
    "Yes I am! Got any quests for me?",
    "No, I don't think I'll help you out this time.",
    "Yes! Your uncorroborated sob story has touched my heart. When do we set off?",
    "Barrelor?",
    "Of course, I fear no demon!",
    "Nonsense! Keep the money! I will dispose of this evil half-brother of yours and leave you what little money is left to feed your family.",
    "What diversion?",
    "Ow!",
    "Great, I'll take the cash in used coins please.",
    "Not a chance, this sounds too dangerous.",
    "Had any luck finding someone to slay the demon?",
    "Because I came to offer to help.",
    "No reason. I was just in the area and I thought I would ask.",
    "Hello again!",
    "I've decided to help you for free! I will dispose of this evil half-brother of yours and leave you what little money is left to feed your family.",
    "Ohhhh... My head... It feels like someone has smacked me one with a bottle...",
    "What? What is going on here? I can't seem to remember anything beyond chatting to a man at the docks.",
    "Okay... I'll buy that. It sounds like something I would do. So where am I, and what is going on?",
    "Wow!",
    "Oooh!",
    "Who?",
    "Are they...",
    "...protesting?",
    "So, what do you want me to do?",
    "Well, how can I help?",
    "So...",
    "What exactly do you want me to do?",
    "And what happens if I lose the seed?",
    "Why do you talk like a pirate? Didn't you tell me you were an alchemist?",
    "And?",
    "That... that... that sounds utterly impossible!",
    "So what do you make here anyway?",
    "Rum, eh?",
    "What's the difference?",
    "Riiiiiiiight...",
    "No thanks... I think I'll skip it for now.",
    "So... how are you holding up?",
    "You sure?",
    "So... how are you holding up?",
    "Well, I don't know... the way I'm breathing could give it away.",
    "So... how are you holding up?",
    "Errr...keep up the good work.",
    "So... how are you holding up?",
    "So... how are you holding up?",
    "Considering what?",
    "Wow... I always thought pirates were tough...",
    "So... how are you holding up?",
    "I didn't think this counted as a war.",
    "That's right. Have you?",
    "So... how are you holding up?",
    "What?",
    "So... how are you holding up?",
    "O...kay...walking away now, smiling and not making eye contact.",
    "Hello!",
    "Why are you not helping out the others?",
    "And those are?",
    "That doesn't sound all that holy to me.",
    "Excuse me, but...",
    "Is there any way you could...",
    "Is there anyone else I could...",
    "Fiiine...",
    "I, err, came to...",
    "I have come to tell you to leave.",
    "Yes.",
    "I have come to tell you to leave.",
    "I've come to ask you what you want.",
    "So...if I were to give you 'rum' you would leave?",
    "Oh...",
    "I've come to join your crew!",
    "Err, I mean...",
    "Arr! Shiver me mainbraces and make them landlubbers walk the scurvy plank, Cap'n! I've come to join yer cut- throat, bilge swillin' crew! Also, arr!",
    "Yes, for the time being anyway.",
    "Huzzah!",
    "Oh...",
    "Never mind what?",
    "Err...look...an astonishing...thing. There. Behind you.",
    "Hey you!",
    "...so that all you will be able to hear from then on will be the rustling of the ants walking through them!",
    "Hey you!",
    "...so that you will know exactly what time it is due to the horrible pain in your earlobes!",
    "Hey you!",
    "...meaning you'll need a dozen Ogres and a team of highly skilled surgeons to remove them!",
    "Hey you!",
    "...leading to the eventual, violent explosion of those organs!",
    "Hey you!",
    "Hey you!",
    "...and then I'll use a wrench to remove the handles, so you'll see it every time you cough!",
    "Hey you!",
    "...and I'll grind up what's left, mix it with lemon juice and throw the whole lot into the ocean!",
    "Here! I have your Blindweed!",
    "Captain... I grew some blindweed but then I lost it...",
    "And what happens if I lose the Blindweed between here and the intake hopper? Theoretically, of course, as it would be almost impossible for me to simply lose the stuff in the time it will take me.",
    "You had some all the time? Why was I risking my neck killing pirates to grow some if you had some all along?",
    "Well, that takes care of the Blindweed. What now?",
    "Where can I get some of that?",
    "Here in the brewery?",
    "Up a mountain?",
    "And I assume the place is crawling with these zombies?",
    "Oh, good!",
    "When is it ever...",
    "What exactly do you want me to do?",
    "Are you all right?",
    "That's not a cutlass. I think it's a twig.",
    "All right...",
    "I think I'll pass.",
    "What happened to you?",
    "What if I said please?",
    "Are you sure?",
    "Is that how you got so badly injured?",
    "Owwwwwwwww...",
    "Oh...my...god...[sic]",
    "Witchwood? What's that?",
    "Wow, that stuff must be very valuable!",
    "There there.",
    "So how flammable are you?",
    "I'll soon have you out of the way! Burn!",
    "My world is an ocean of paaaain!",
    "So what is going on here anyway?",
    "No Mr. Luke, I expect you to die!",
    "Egad, outsmarted by the man with the wooden brain. But seriously, what is going on here?",
    "Well if you can't tell me, perhaps you could show me through the medium of Interpretive Dance?",
    "Mime?",
    "Hey you! Look over there!",
    "Who's that making faces behind you?",
    "Oh my! Is that a genuine 3rd Age Diversion?",
    "Is that your distraction?",
    "Who is that behind you?",
    "That is the most amazing thing I have ever seen!",
    "Nothing.",
    "What exactly do you want me to do?",
    "Err... Captain...",
    "Well, on my way over to the hopper some big boy stole the bucket and ran away...",
    "So is that everything?",
    "What? Sluglings? That's disgusting!",
    "Why Sluglings?",
    "Why?",
    "They aren't related to those Seaslugs are they?",
    "So what should I do with these Sluglings anyway?",
    "And then I...",
    "Pressurise them?!",
    "What should I do with it?",
    "What exactly do you want me to do?",
    "How am I suppost to catch these things?",
    "And if I don't have one?",
    "The slugs are talking to me... They tell me to do bad things...",
    "Egad... what just happened?",
    "How could I kill my sluggy brethren...?",
    "What? Who? Gah! Sorry about that.",
    "Well, how far away will I have to go to grab it?",
    "Great! What is it?",
    "Possessed!",
    "What exactly do you want me to do?",
    "Mumblemumblewhatwrenchmumble...",
    "I said, what if I've lost the wrench?",
    "Steady on!",
    "I'm looking for a priest.",
    "No, I just need...",
    "Seriously, for a man trapped in a building full of alcohol you are remarkably tense.",
    "I'm looking for a priest.",
    "Will they help?",
    "I'm looking for a priest.",
    "I'm looking for a priest.",
    "I am not a zombie. I just haven't had a bath today is all...",
    "I'm looking for a priest.",
    "For anything in particular?",
    "I'm looking for a priest.",
    "What do you have?",
    "Great...",
    "I'm looking for a priest.",
    "I'm looking for a priest.",
    "What?",
    "You used to be a priest, right?",
    "What? Never mind. I need some help with the spirit in the brewing equipment.",
    "Can you bless this wrench for me?",
    "Is that it?",
    "Groovy.",
    "Thanks!",
    "Really? I mean, it's holy and everything, but I don't think it looks all that useful.",
    "I don't know what you mean, but I'm sure I'll find out!",
    "Nope?",
    "Come again?",
    "What?",
    "Oh!",
    "Well why didn't you just say so?",
    "Come out and face me!",
    "The power of Guthix compels you!",
    "And that is?",
    "Remind me never to drink anything you have ever made. Or touched.",
    "What exactly do you want me to do?",
    "Well, I stuck your spider in the hopper, what now?",
    "Is that it?",
    "Who?",
    "Oh! I haven't spoken to him yet!",
    "Yes! That it be!",
    "So... I take it your boss will be pleased?",
    "Oh well, I guess I'll have to try again.",
    "I'm sure he would. Good job you caught me out, eh!",
    "Not much that was coherent. Who is Rabid Jack?",
    "So, who is he?",
    "No, I think I'll pass.",
    "Good. Everything seems to have worked out ok.",
    "What?",
    "What? The Holy Wrench? But I lost it somewhere...",
    "Thanks...",
    "Hello there!",
    "But I just saved you!",
    "Hello there!",
    "Total confidence?",
    "Well, great...",
    "So, got any sleep yet?",
    "So... what are you going to do now?",
    "Right... good luck with that.",
    "Hello there!",
    "Everything ok with you now?",
    "Great!",
    "Hello there!",
    "I'm not any form of undead!",
    "What?",
    "Hello there!",
    "All in a day's work, think nothing of it.",
    "I may come for it later, you hang on to it for now.",
    "Hello there!",
    "Well, no, but they are a lot calmer now.",
    "In your case I would say relax.",
    "Hello there!",
    "How's things?",
    "Excellent! Since I get the feeling I don't want to know why you said that so oddly I'll just go over here!",
    "Who? Me?",
    "What happens if I don't?",
    "Don't you mean clap me in irons?",
    "Ok, well it's a good job that I have some over here isn't it?",
    "Errr ...Arrr! I will in a sec, I've just go to, err, plunder some landlubbers...",
    "Do I know you?",
    "Okay!",
    "Magical Teleporting Bottle?",
    "This I have to see.",
    "Oh well, here goes.",
    "One...",
    "What friend?",
    "Oh no! Get it out, get it out!",
    "Thanks!",
    "Why are you looking over my shoulder?",
    "What?",
    "Well, I don't see what this will accomplish, but...",
    "What? Where?",
    "Where?",
    "Ow!",
    "Ooooh... my head...",
    "Wow... I'm lucky I wasn't seriously hurt!",
    "Can I go to Mos Le'Harmless instead?",
    "Not now.",
    "I'm getting an awful headache talking to you. Any idea why?",
    "Why do I get a headache every time I see you?",
    "You're a doctor?",
    "What was that last bit?",
    "Are you any relation to Party Pete?",
    "Well, you don't sound too happy about it. What happened?",
    "So what happened?",
    "I'm sure it wasn't that bad.",
    "Ouch..."
  ],
  "Pirate Pete": [
    "Mornin'. Hey...you're an adventurer, right?",
    "Yeah, I do, as a matter of fact! (Ahem.) I am a poor, dispossessed nobleman, forced by circumstance to lurk in the middle of nowhere, soliciting help from passers-by. You see, my fiendish half-brother has seized my estates and forced me into exile. The simple lemon farmers suffer under his tyrannous yoke, and only a brave adventurer can lift his iron boot from the neck of the poor. To reclaim my lands I will need to have my family sword returned to me so that I may present it as proof of my rulership. Will you help me find my family sword?",
    "Look, I think I'll wait here for someone a little more... you know... ...heroic.",
    "You'll help! Wonderful! But, alas, my half brother has a powerful ally, the mighty demon... Err... Err...Barrelor! Yes, the mighty, fearsome, tall, deadly, oaken, round demon Barrelor the Destroyer.",
    "That's what I said! Barrelor is an awesome opponent, and to reclaim my family sword you will need to defeat him, for he guards it within the deadly Trapped Pit of Barrelor. Wanna give it a shot?",
    "Atta [boy/girl]! When I am reinstated in my rightful place, I will not be a very wealthy man, as my half-brother has squandered my family fortune. However, I will gladly give you every bent penny of what is left, and starve in the gutter with my many adorable children if you say you will help me.",
    "Wonderful! Just pick up your diversion and we'll leave!",
    "Er...",
    "What? Oh! Yes! The demon, with the oppression and stuff! No, not yet. Why?",
    "I see...",
    "Oh, it's you again. So, what brings you down here today?",
    "Cap'n!",
    "Good news Cap'n!",
    "I found us a hero down by the docks!",
    "Aye! They also be gullible, tied up and unconscious! They were willing to help out some random stranger with a good enough sob story, so I smacked them with a bottle and rowed them over.",
    "Yes, you owe me some money.",
    "Want a lift somewhere?",
    "All right. I'll need to use my Magical Teleporting Bottle.",
    "Yes. Just turn around three times, then clap your hands and say the place you want to go.",
    "All right. You know that it's going to cost extra to take your friend as well, right?",
    "Certainly. By the way, you have a spider in your hair.",
    "Sure, turn around and I'll get it for you.",
    "Err... sure...",
    "Turn around[sic]",
    "Turn around.",
    "Well I'll be more than happy to...",
    "Egad! Did you see that?",
    "Would you like a hand with your stuff? You seem to have dropped something.",
    "Are you ok?  [sic]You, errr...",
    "Are you ok? You, errr...",
    "...got into a fight with my evil twin.",
    "...hit your head on my oars while I was rowing over.",
    "Twice.",
    "...managed to fall onto my boot while I was practicing kicking.",
    "...missed your mouth while drinking from a bottle. Hence the bottle-shaped bruises.",
    "...slipped and fell down some stairs.",
    "...slipped and slid into a brick wall.",
    "Nope. It's Braindeath island[sic] or nothing. Interested?",
    "No idea whatsoever.",
    "Well, it's possibly the weight of all of your expensive items giving you a sore back.",
    "As a doctor I can tell you that sometimes a bad back can manifest as a headache.",
    "I'm on a break.",
    "Regardless, I can tell you that if you hand me your most expensive items, then the pain will disappear.",
    "CoughonceyouturnaroundagainCough!",
    "Nothing...",
    "Yes I am, he's my cousin.",
    "Well, I arranged with all my friends to have a party at his place.",
    "But then I humiliated myself by trying to dance with the knights.",
    "All of them collapsed on me in a horrific, jangling pile.",
    "I tried to salvage the night by having all the balloons come down...",
    "I didn't know that someone had swapped the balloons with cannonballs!",
    "The casualties were horrific...",
    "That was the worst fifth birthday party in the history of the world.",
    "Not according to the Official History of Gielinor!",
    "Every edition... the pictures bring it all back..."
  ],
  "Captain Braindeath": [
    "Arrr... 'Tis lookin' bleak...",
    "Be they heroic, brave and true?",
    "Brilliant! The island's location will remain a secret! Bring 'em here and wake 'em up.",
    "We may make it through this yet...",
    "Are ye alright, [lad/lass]?",
    "Arr... Those devils gave ye a nasty knock when ye came to aid us. But now yer here we'll run those evil brain-eatin' dogs off the island fer good!",
    "Arr. Well, [lad/lass], that would be Pete, one of my men.",
    "He's been out lookin' fer heroes like yerself to aid us in our peril. When ye arrived ye took a nasty knock to the head, so ye probably don't remember agreein' to help us out. But I swear to ye that ye did.",
    "Yer on Braindeath Island!",
    "Where it lies is a secret, because ye are standin' in the brewery of Cap'n Braindeath, purveyor of the most vitriolic alcoholic beverages in the world!",
    "I am the notorious alchemist Cap'n Braindeath, and this whole operation be my idea!",
    "With my crew of sturdy, upright pirate brewers, we sail the seven seas, distributing cheap 'alcohol' to all and sundry. Well, fer a price, at any rate.",
    "These be dark times, though, [lad/lass]. See, a week ago we awoke to find ourselves beseiged.",
    "The lads and I have held them off so far, but 'tis only a matter of time before they sweep through the buildin' and put us all to the sword.",
    "Them!",
    "Arr, [lad/lass]! That they are!",
    "Day and night they seek to break our will with their chantin', and their singin' and their passive resistance!",
    "Seems they lost their fightin' spirit after the first few days. Now most of them just protest all the time.",
    "Well, me and the lads got our heads together and decided that if we can get their Cap'n drunk enough, perhaps they'll stop protestin'.",
    "If that happens, we'll slip out the back and set up shop somewhere else.",
    "Well, first of all, we need someone to go out the front and grow us some Blindweed.",
    "'Tis one of the ingredients of our 'rum'.",
    "The only problem is that those rottin' fiends have torn up and destroyed all but one of the Blindweed Patches.",
    "Here, [lad/lass]. I'll give ye the seed you'll need fer growin' the herb. Help yerself to the gardenin' equipment in the basement.",
    "I'll warn ye again that those devils are sat right on top of the patch.",
    "Try hecklin' 'em from a distance. Those Swabs may talk a good fight, but if ye can put a scare in 'em they'll keep out of yer way!",
    "Arr, well I want ye to get outside and grow some Blindweed.",
    "Best be careful, [lad/lass], fer them pirates will skin ye alive if they catch ye.",
    "Then I'll have ye flogged, hung, slapped with a haddock and sent back out there to fight the zombie hordes with little more than harsh language!",
    "Arr... Here, [lad/lass]. Just take this and get goin'!",
    "Ye'll need ter keep an eye on yer plants, [lad/lass]. Wouldn't want them pirates to trample all over 'em, would ye?",
    "Arr, [lad/lass], 'tis true.",
    "However, 'tis also true that I stumbled across the basic recipe fer my most potent of brews in a terrible alchemical accident.",
    "See, 'twas a dark and stormy night, and the wind was howlin' around the trees as I worked late into the night.",
    "Steppin' too close to a candle with my flask in my hand, I was suddenly swept up in a terrible, yet potently alcoholic, explosion.",
    "Well' [lad/lass], it seems the fumes from that first batch of me 'rum' did strange things to me brain.",
    "I don't remember the exact words the healers used, but apparently the stuff burned out the tiny, specialised part of me brain that tells me not to talk like a pirate.",
    "Arr! That be what I told them!",
    "'Rum', [lad/lass]!",
    "The finest, most potent, most flammable and most debilitatin' 'rum' in the whole of Gielinor!",
    "No, [lad/lass], 'rum'!",
    "Well, see, it's like this.",
    "If we called the stuff we make 'rum' without makin' the little quote gestures every time, then the Cookin' Guild has promised to do entertaininly[sic] painful things to us with whisks.",
    "See, technically - And by that I mean technically according to the Disposal of Hazardous Waste Act and the Health and Safety Laws - technically, what we're brewin' here is Artificially Produced Hyper Condensed Sweetened 'Rum' Flavour Distillate.",
    "So ye see, [lad/lass], we just call it 'rum' because the real name be a bit of a mouthful.",
    "Want a drop?",
    "Splendid, [lad/lass]! Go shove it in the Intake Hopper upstairs. We'll beat them zombies yet! Arr!",
    "There there, lad. 'Tis all right. Here, I've been savin' some fer an emergency. Go shove that in the Intake Hopper, and try not ter lose this lot!",
    "I want ye to go put yer Blindweed in the intake hopper, and to be sharp about it!",
    "Yer nothin' better than a sea-slug wearin', lilly-legged, bandy-livered landlubber! Here, I was savin' a little fer an emergency, so take this and shove it in the hopper before I bung ye in there and turn the handle",
    "Less talk, lad, haven't ye got a hopper to be fillin'?",
    "Well, now ye've shoved the Blindweed into the mix, what we need is a bucket of stagnant water.",
    "Ye won't have to go far, [lad/lass], we have a pool of the stuff here!",
    "No, [lad/lass], that would be a strange thing to have in a brewery! It's up the mountain to the north.",
    "Well, 'tis technically a volcano, but ye get the general idea.",
    "No [lad/lass], there be not a zombie in sight.",
    "All ye have to do is get past the keen-eyed lookout that's been spottin' my men when I send 'em.",
    "I'll tell ye that it won't be easy!",
    "Don't ferget yer bucket!",
    "To get off yer lazy behind and head out to the stagnant lake on top of the volcano. Chop chop, [lad/lass].",
    "Don't ferget yer bucket!",
    "I want ye to go pour yer bucket into yonder hopper. Take yer time, [lad/lass], we're only bein' besieged by zombies.",
    "Aye, what is it, lad?",
    "Give me strength! If ye weren't so good at distractin' the zombies I'd skin ye alive! Take this bucket and pour it into the hopper. If ye don't get it right this time I'll have yer guts fer garters!",
    "No, [lad/lass], next ye'll need to go outside and catch five loads of Sluglings fer the brew.",
    "Arr, [lad/lass], that it be. To a weak-stomached, knock-kneed landlubber...",
    "'Cos, [lad/lass] they're one of our super-secret ingredients! Yer not too susceptible to mind control are ye [lad/lass]?",
    "Because they have been known te, well, influence people every now and again.",
    "I'm sure ye've got nothing te worry about!",
    "No [lad/lass], we just call them 'Sluglings' 'cos of a long and convoluted story involvin' a metal pipe and three dead seagulls.",
    "Aye they're related! Tis a good job they'll starve if they tried te eat yer brains!",
    "Well, ye shove them in the Pressure Barrel in the attic.",
    "And then ye...",
    "And then ye... Pressurise 'em.",
    "Just a little.",
    "Look, we don't have all day, get movin'.",
    "Here. Ye'll need this to catch them.",
    "Just dunk it in the water. I'm sure a clever [lad/lass] like yerself will have no problem.",
    "Oh, and if ye haul up some squiddy-looking things, don't hesitate to shove 'em in the barrel too.",
    "They add a special, fishy texture to the drink.",
    "I want ye to go outside and catch five sea creatures from the squid fishin' spot. When ye've grabbed them, jam 'em in the barrel in the attic and pressurise 'em.",
    "Ye'll be needin' to use a fishbowl in a big net to snare these little devils.",
    "Why, I oughta... Here! Try not ter lose this one! These things don't grow on trees, ye know.",
    "Gimme that!",
    "What happened is ye were messin' about with Sluglings! Don't ye have anything better to do?",
    "Gah! Get that slimy thing away from me!",
    "Snap out of it, [lad/lass]! Yer in slug-shock!",
    "No problem. Well, now ye have just one more ingredient to grab, and then we can get this 'rum' flowin!",
    "Not far at all, [lad/lass]. Ye've just got to get it from the basement!",
    "Hold yer horses, [lad/lass]! While ye was off gallivantin' with yer slimy aquatic playmates, the 'rum' achieved spiritual critical mass.",
    "To put it in terms ye'll understand: the brewin' equipment is possessed.",
    "Don't ye worry yerself about it! This happens all the time.",
    "Well, to tell the truth, my lads are a little quicker off the mark, so it only happens occasionally. Not that I'm criticisin' yer performance, [lad/lass].",
    "Give the controls a couple of belts with this wrench.",
    "One of the lads did a little priestin' on the side before he came here. Get him to bless it and ye'll do fine.",
    "I want ye to go clear the Evil Spirit out of the brewin' controls. Use the wrench I gave ye, but get it blessed first.",
    "What were that?",
    "Arr! I'd get more work out of a minty flavoured brick! If ye lose this one I'll have ye turned inside out, covered with spiders and turned rightside in so they'll eat ye alive!",
    "I see ye've got the wrench good and blessed, so go whack the hopper 'til the Evil Spirit pops out.",
    "Well, now that ye've got that spirit out of there ye can dump in the final ingredient.",
    "We need the body of a diseased Fever Spider!",
    "When yer quite done flappin' yer lips, go down into the basement and whack spiders until ye find a fever spider body. Shove it in the hopper, and then we're in business.",
    "I see yer already wearin' some Slayer Gloves. That'll keep the Fever Spiders from gnawin' yer hands off!",
    "Ye may want to hop back to the mainland and see a Slayer Master. These Fever Spiders carry a nasty disease, and ye'll need a pair of Slayer Gloves on to not catch it!",
    "I want ye to go kill a Fever Spider and jam its body in the hopper.",
    "Whenever yer ready, [lad/lass].",
    "I want ye to jam that body into the hopper and come see me.",
    "Arr! Yer not as slow as I took ye fer!",
    "What are ye doin', lad? hopper, not in me face! Ye just can't get good help these days...",
    "Now ye stand well back and watch the glory of brewin' at its best!",
    "Aye [lad/lass]! Now get outside and feed that stuff to the pirates. Try givin' it to the Captain, he's in charge. Get him bladdered and the rest will fall!",
    "Ye'll need to use that bucket of yours. Most stuff can't stand bein' in contact with our 'rum' fer too long. Took us a lot of dissolvin' to work that one out.",
    "Here, ye'll need to use one of these. The rum tends to eat through almost everything else.",
    "Oh, and don't try using anything but a bucket. Our 'rum' tends to eat through stuff.",
    "So, what did he say?",
    "The Cap'n!",
    "Well, get a move on! And don't ferget the 'rum'!",
    "So, what did he say?",
    "Rabid Jack!",
    "THE Rabid Jack!",
    "Egad...I haven't heard that name...",
    "...before.",
    "Dunno [lad/lass].",
    "Almost as if I aren't changing subjects, well done!",
    "With those rottin' dogs legless they'll never keep fighting us now, so we've decided to stay here and keep the 'rum' flowin!",
    "Thanks, [lad/lass]. We'd never have managed without ye!",
    "Fancy some 'rum', [lad/lass]? It's still fresh. Well, fresh-ish."
  ],
  "Brewer": [
    "Very well.",
    "Oh Guthix, who am I kidding? We're all gonna die!",
    "How do I know you're not one of them?",
    "That means nothing! NOTHING!",
    "Game over, man! Game over!",
    "Don't talk to me! If I play this right, I can sell you lot out and make it to the mainland!",
    "Very well, considering.",
    "That I've been crawling into the corner to cry whenever nobody is looking.",
    "Don't sneak up on me like that! Don't you know there's a war on?",
    "That's because you're a landlubber! I bet ye've never had to beat a dozen zombies to death with a blunt toothpick!",
    "No, I've spent most of my time in the toilet to be honest.",
    "No school today mother, my brain hurts real baaaad...",
    "I no sleep in many, many, many days.",
    "Who are you? You're one of THEM arent[sic] you!",
    "Why do you need a priest?! For the last rites? Are we done for?",
    "Were all gonna diiiiiiiiiie! Flee to the longboats! Run to the hills, run for your lives!",
    "Well, you could try asking the others.",
    "No, I just want you to leave me alone so I can cry in peace.",
    "What, so you can eat their brains? I won't help you!",
    "What do you want with a priest? Trying to get yourself exorcised?",
    "That's what they all say!",
    "Well, I'm not a priest, but I must admit I've been praying feverently since the zombies arrived.",
    "A new pair of trousers. Those things are scary.",
    "An old priest or a young priest?",
    "Neither, sorry.",
    "Shhhh! GET AWAY FROM ME, HUMAN WHO I DON'T KNOW! AS A LOYAL ZOMBIE PIRATE INFILTRATOR I WOULD NEVER HELP THE LIVING AT ALL! That was close, just shove off and keep away from me.",
    "I want to go on the donkey rides, but there is too much sand in my bucket...",
    "My hovercraft is full of eels...",
    "I don't know what your game is, but I know you're one of THEM!",
    "The voices tell me different. It's all part of a plot! Confess!",
    "Hello there, brave [hero/heroine], in whom I had total confidence!",
    "Yes! I was so confident that I would never, ever have sold your soft, edible body to the pirates outside!",
    "On a completely unrelated note, I would steer clear of Hungry Frank for a while. He's a filthy liar. And a forger. It wouldn't surprise me if he has written out a note detailing the terms of our surrender and your dismemberment and cooking in MY handwriting. Imagine that, the fiend.",
    "My brain is no longer capable of sleep.",
    "I was gonna try and will myself dead.",
    "Hello yerself Landlubber!",
    "Hmmm... Overall everything is good!",
    "Well you proved that you're probably not a zombie. So what are you then? A ghoul? A vampyre?",
    "Oh... oh god I'm sorry, I didn't realise it was natural...",
    "Nothing...",
    "You saved us! Huzzah!",
    "I don't have anything to reward you with except my collection of bleak, gothic poetry I wrote when I assumed we were all done for. Do you want it?",
    "Have they gone yet?",
    "What are we gonna do now, huh? What are we gunna do now?",
    "Hello yourself!",
    "Fine...",
    "I think that would be for the best!"
  ],
  "Davey": [
    "'Ello guv.",
    "Well you see, guv, I've got these unshakable religious convictions.",
    "Well, it's like this, see. I used to do a bit of the old priestin' on the side.",
    "You know, collectin' for repairs to the church roof, passing the collection plate, jumble sales, nicking the lead off the temple roof so they needed repairing again.",
    "Real holy stuff, you know.",
    "Well, that's because you're not a [man/woman] of the cloth are you?",
    "You are, in fact, what we refer to in layman's terms as a punter.",
    "But anyway, all that priestin' left me with an unshakable faith in three things.",
    "The power of good over evil.",
    "The true glory of the human spirit.",
    "And that I ain't goin out there with those things runnin' around.",
    "I didn't nick anything, [guv/miss]. I've got twenty people who'll swear blind I was...",
    "Well, I'll bless something for you if you need it, but just don't spread it around that I'm giving out freebies.",
    "Trust me, [guv/miss], lots of people need help after coming into contact with the spirits we produce here.",
    "I might well do.  Remember, only the first one's free. Dominoes Ad Nauseum, Romanes Eunt Domus. Sorted.",
    "Oh, you want the full package deal. All right. Brace yourself.",
    "No problem, [guv/miss]. Good luck with your little problem. You might find that little wrench worth hanging on to after you're done with the Spirit.",
    "Well, it may not look much, but you'll find that you might need a few less prayer potions if you have it in your pack, if you know what I mean.",
    "You mean more help? I've already blessed one wrench for you, that should be enough.",
    "Nope.",
    "Nope. You don't strike me as being... devout, you know?",
    "Your holy aura, it's a little shoddy, if you catch my drift.",
    "You need a Prayer of 47.",
    "I might have had a bit of an overestimation problem [guv/miss]. I'm sure it won't happen again.",
    "Ello again [guv/miss]. How's things?",
    "I'm sure it'll stay that way so long as you don't know it's missing.",
    "Nothin' [guv/miss], you just have a nice day.",
    "Ello again [guv/miss]. I take it you're here about the wrench?",
    "Well [guv/miss], maybe thats what I want you to think. There you go. I've kept it nice and holy for you."
  ],
  "Zombie protestor": [
    "Ye'll never get away!",
    "Give us yer rum, ye scurvy dog!",
    "Give us rum or give us death!",
    "United we stagger!",
    "Arr! Come back here!",
    "Where d'ye think yer goin?",
    "Spare us a drop, you scurvy dogs!",
    "Rum! Rum! Rum!",
    "Arr!",
    "ARRR!",
    "Arrrrrrrrrr!!!",
    "Arrr! Tis yerself! Have a drink!",
    "Good huntin'!"
  ],
  "Captain Donnie": [
    "Arr! What be ye wantin?",
    "Ye have?",
    "Hahahahahahahahahahahahaha!",
    "Bwahahahahahahahahahahahaha!",
    "Wheeze...wheeze... Gadzooks [lad/lass], that be the funniest thing I've heard all day! Say it again!",
    "Stop [lad/lass]! I'll shatter me ribs!",
    "Whadda we want? 'Rum'! When do we want it? Now!",
    "Not really [lad/lass]. If ye were to give us 'rum' we'd kill ye quickly, as opposed to over a few weeks.",
    "Are ye quite done, [lad/lass]?",
    "Well, ye'll be glad to know that after that little performance I'd be glad to have ye on me crew!",
    "Course, I'll have te kill ye first.",
    "Don't ye worry, lad. After we take the island I'll have the boss haul yer body to the temple and... Err, never mind.",
    "Ferget I said anything.",
    "Be that the finest, most abrasive 'rum' I've ever smelled?",
    "Hand it over or I'll run ye through!",
    "Arr. Ye be a good [lad/lass], fer a filthy livin' landlubber.",
    "Arr, that he will. I'll tell... Wait a minute... Arr, ye tricky dog! Ye tried to trick old Donnie!",
    "Arr, [lad/lass], you tried to trick me, but I was too clever for ye! Besides, Rabid Jack would have my hide if I told ye it were him that sent me!",
    "Aye! Now get ye gone, and don't return without more 'rum'!",
    "Hey you! I can smell the 'rum' on ye! If it isn't in my belly by the time I count ter three, I'll have ye flogged!",
    "Arrr...that hits the spot...",
    "Hey! You!",
    "Aye! Ye! Got any more rum?",
    "Then I'll clap ye in Runes!",
    "No [lad/lass], not irons, Runes! We upgraded last week.",
    "Arr, yer a good [lad/lass]..."
  ],
  "Zombie swab": [
    "Hahahaha! Yer goin ter die!",
    "That be the most intimidatin' thing I've ever heard! I'm not messin' with you!",
    "Hey yerself, landlubber!",
    "That be the most intimidatin' thing I've ever heard! I'm not messin' with you!",
    "Arr! Prepare to die!",
    "That be the most intimidatin' thing I've ever heard! I'm not messin' with you!",
    "Yer a deadman, sez!!",
    "That be the most intimidatin' thing I've ever heard! I'm not messin' with you!",
    "Yer brave, but stupid!",
    "Yer brave, but stupid!",
    "That be the most intimidatin' thing I've ever heard! I'm not messin' with you!",
    "Yer a deadman, sez!!",
    "That be the most intimidatin' thing I've ever heard! I'm not messin' with you!",
    "Arr! Do what ye like, just don't hurt my face!",
    "Egad! 'Tis him!",
    "Arrgh! It's him! Run fer it lads!",
    "Be there anything I can say to get out of here undead?",
    "No! Not the flyswatter! I'll be good!",
    "(Gulp) Be there anything ye want, sir?"
  ],
  "(If the player has completed Sea Slug": [
    ")[source needed]"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Rum_Deal?oldid=36234352’"
  ]
}