{
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "failure/change task dialogue with secretary/director of company, additional companies' dialogue if different, misc dialogue with director/secretary, and just cleaning up the company dialogue in generalYou can discuss this issue on the talk page or edit this page to improve it."
  ],
  "Dwarven Boatman": [
    "Ho there, human!",
    "Ho there, Player! Want to take a ride with me?",
    "No no, that's what the ferryman is for! I'm going to Keldagrim, my home!",
    "For a human like you, I can do it for free!",
    "Excellent! I'm just waiting for my ship to arrive and then we can go.",
    "Mind, this trip could take a few minutes! Are you sure you're ready to go as well?",
    "Well, let's not waste any more time then!",
    "Sure, sure! Come back when you need to!",
    "Hello again, Player! Want to go back to Keldagrim?",
    "Hey, it was only a little accident! Calm down!",
    "Look, there's the statue of King Alvis, guarding the entrance to Keldagrim!",
    "That's right! Er, hold on! There's something wrong!"
  ],
  "Player": [
    "Player.",
    "Where are you going? Across the river?",
    "How much will that cost me then?",
    "That's a deal!",
    "I prefer the mines to the city.",
    "Amazing! And we're going to go straight past it?",
    "I err, I'm Player. I was told I was under arrest. I had a little accident on the way in here.",
    "I suppose so... I mean, I didn't do it on purpose or anything...",
    "Well, ehm... nice to meet you, Veldaban.",
    "No, I can't be bothered.",
    "Yes, I will do this.",
    "To be honest I'm not much of a sculptor myself.",
    "I'll see what I can do.",
    "Excuse me, are you Blasidar, the famous sculptor?",
    "Oh, well, I'm Player. Veldaban of the Black Guard sent me to you, you see. Said you might need some help with the statue.",
    "I'm not a sculptor.",
    "I'm not a model!",
    "Ehm, right, okay. So what did you need doing?",
    "Not a very artistic race, then, are you?",
    "No, I can't be bothered.",
    "Yes, I will do this.",
    "Right, so I need a pair of boots, a piece of clothing and a battleaxe. Is that all?",
    "But... wait, wait, how am I supposed to find all this?",
    "Hello there, can you help me?",
    "What? No, I was wondering if you could help me.",
    "Alright, alright.",
    "Don't worry, I'll be back later with all those items!",
    "What was it you needed doing again?",
    "I don't have your boots yet.",
    "I also don't have your clothes yet, I'm afraid.",
    "Sorry, no, I'm still looking for it.",
    "Yes, I'm looking for some special clothes.",
    "I'm helping the sculptor to rebuild the statue of King Alvis. But he wants to know what his clothes looked like.",
    "But the clothes, do you have any similar clothes?",
    "Who's that?",
    "West?",
    "But I need the actual clothes themselves, not just the designs.",
    "Great, thanks a lot, I'll check out the library!",
    "Yes, about those special clothes again...",
    "I haven't actually spoken to the librarian yet, let me do that now.",
    "Do you know anything about King Alvis's clothes?",
    "I'm helping Blasidar the sculptor to rebuild the statue of King Alvis, but he needs to know the design of his clothes.",
    "Sounds like just the thing. Where exactly could I find it?",
    "Can you be any more specific? Upstairs, downstairs?",
    "Well, thanks, I'll have a look.",
    "Yes, about those special clothes again...",
    "Yes, I have a book right here, have a look at it!",
    "What does it run?",
    "Don't worry, I'll get them for you. Let's see... some coal and some logs. Shouldn't be too hard.",
    "Yes, about those special clothes again...",
    "Right, and what did you need again to start the engine?",
    "I've got them right here!",
    "Yes, about those special clothes again...",
    "Can I have those clothes now?",
    "What, after all that work?",
    "I'll pay, I'll pay.",
    "Thank you very much!",
    "I won't pay, that's outrageous!",
    "These clothes are too small for me, I might ruin them if I put them on. I'd better take them to the sculptor instead.",
    "Yes, about those special clothes again...",
    "Can I have those clothes now?",
    "Yes, I'm looking for a pair of special boots.",
    "The best you have! Boots fit for a king!",
    "And you don't have anything else?",
    "Please, tell me! Who did you sell the boots to?",
    "What house does he live in?",
    "Thanks!",
    "Calm down! I just want to ask you a few questions.",
    "I went to the Quality Armour shop. The proprietor told me you have just recently purchased a pair of boots from him.",
    "You're not actually using them then? Might I be able to buy them off you?",
    "Tell me, how much will you accept for these boots?",
    "Are you sure you don't want to give me those boots?",
    "What, wear just one boot? Besides, the boot is too precious for that.",
    "I shouldn't wear these boots, I don't want anything to happen to them before I bring them to the sculptor.",
    "Don't worry, if I find out who did it I'll take care of them.",
    "Yes, I'm looking for a particular battleaxe.",
    "No, actually, I'm looking for King Alvis' axe.",
    "I've been tasked by Veldaban, Commander of the Black Guard in Keldagrim, to assist in every way possible with the rebuilding of King Alvis' statue.",
    "How do you mean?",
    "Just give me the axe already, I know you have it!",
    "I've had just about enough of this! Goodbye!",
    "Blasidar the sculptor needs it for his statue. He wants a model for the axe, you see, and he believes the original axe still survives.",
    "What happened to it?",
    "Can I see it?",
    "Are you sure this is the real axe then?",
    "This is tedious, I've lost interest.",
    "Perhaps I can repair the axe?",
    "Perhaps I could try and find one?",
    "Oh, I know where I can find an Imcando dwarf! He actually made a sword for me a while ago. I'm sure I can get him to help me again.",
    "He lives on a cliff at the very south end of Asgarnia, just south of Port Sarim. I can visit him again if you like.",
    "Thank you. I will not disappoint you.",
    "I don't really care for it after all.",
    "Yes, I'm looking for a particular battleaxe.",
    "Yes, but I was just wondering what I should be doing with this piece of junk.",
    "Oh yes, of course, that's what I was going to do!",
    "Yes, I'm looking for a particular battleaxe.",
    "I... sort of... ehm... Look, I lost it!",
    "I should be very careful with this battleaxe, it's almost a museum piece! I don't want to damage it by wielding it.",
    "Can you help me find an Imcando dwarf?",
    "Yes, I need the help of an Imcando dwarf to repair an ancient battleaxe.",
    "Is there no one else who can help me?",
    "Do you think he can help me?",
    "I've come from Hugi, he suggested that I speak to you.",
    "I've come to ask you about the Imcando dwarves. Hugi says you might know something about them.",
    "So are there any Imcando left at all?",
    "Hello. Are you an Imcando dwarf?",
    "Can you help me with this ancient axe?",
    "Can you help me with this ancient axe?",
    "Err, never mind.",
    "Hello. Are you an Imcando dwarf?",
    "Would you like some redberry pie?",
    "Can you help me with this ancient axe?",
    "Can you help me with this ancient axe?",
    "Here... the blade of this axe has become extremely dull and brittle. I need it restored to its former glory.",
    "It was given to me by someone in Keldagrim. I prefer not to say any more than that.",
    "We?",
    "You don't want any blurite this time?",
    "I've got one right here.",
    "Can you help me with this ancient axe?",
    "No, not yet.",
    "Can you help me with this ancient axe?",
    "I've got one right here.",
    "Thanks for your help Thurgo!",
    "Thanks for your help Thurgo!",
    "Err, Thurgo..?",
    "I've lost that axe you repaired for me. Have you seen it anywhere?",
    "Thanks!",
    "I went through all this trouble to restore this axe, I'm not going to ruin it now by wielding it and accidentally smashing it to pieces. I'd better take it to the sculptor.",
    "Yes, I'm looking for a particular battleaxe.",
    "Yes, and I got Thurgo the Imcando dwarf to fix it up nice and proper! Look!",
    "Yes, I'm looking for a particular battleaxe.",
    "Yes, and look, it's all fixed up now! I got Thurgo the Imcando dwarf to fix the blade, and I've crafted three sapphires onto the hilt.",
    "Yes, I'm looking for a particular battleaxe.",
    "Er, well... I had it repaired by and Imcando dwarf, but...",
    "I lost it! I don't remember where I put it!",
    "I have your boots in the bank.",
    "I had Vermundi make these clothes, but I left them in the bank.",
    "Look, I've got it right here.",
    "Sorry, no, I'm still looking for it.",
    "I have your boots!",
    "I had Vermundi make these clothes!",
    "Oh, yes, I've got it right here!",
    "Here, I have these boots for you to wear.",
    "And look, I have some clothes as well!",
    "And finally, I have this battleaxe for you!",
    "Hey, you're looking nice in that outfit!",
    "So is the job done now? Hello?",
    "Care to tell me why not?",
    "It's very tiring trying to talk to you, you know?",
    "I've all the items you asked me to get you. Can you make the statue now?",
    "So you need me to find a crown now as well?",
    "So what is the head supposed to look like now?",
    "What? But I thought the whole point was that it would look like king what's-his-face?",
    "No, I suppose you can't. Alright, I'll check it out.",
    "No, the directors have not made a decision yet.",
    "I'm glad I don't have to talk to you anymore!",
    "Yes, it just needs a head now. But I'm not sure the Consortium is able to make a decision on what the head should look like.",
    "Do you really think they would do that? Letting a human in on their meetings?",
    "I'll see what I can do again.",
    "How rude.",
    "Why not?",
    "You shouldn't say such things to people.",
    "Who are you?",
    "Where am I?",
    "Is there anything I can help you with?",
    "I'll take it.",
    "No thanks.",
    "I need to speak to the director.",
    "But you don't understand. I've come from Blasidar the sculptor.",
    "But... Commander Veldaban of the Black Guard has instructed me to do this!",
    "How can I prove myself?",
    "I have to go!",
    "I've completed your task! Here is your [material]!",
    "Do you have another task for me?",
    "I need to speak to the director.",
    "I have to go!",
    "It's an honour to meet you!",
    "I'd like to officially join your company.",
    "Do you have any more tasks for me?",
    "I'll take it.",
    "No thanks.",
    "Blasidar the sculptor has sent me.",
    "He says he needs to know what the head of the statue should look like now that it's no longer going to look like King Alvis.",
    "Hreidmar? Who is Hreidmar?",
    "So I shouldn't tell the sculptor that he should base it on him then?",
    "I would support you.",
    "What if I were?",
    "I hope you lot figure it out soon.",
    "Thank you for your time.",
    "I've completed your task! Here are your bars!",
    "I'd like to officially join your company.",
    "I will not disappoint you!",
    "I would support you.",
    "How do you mean, play our cards right?",
    "Now you're really losing me... what meetings?",
    "Yes! Long live the [Company]!",
    "I need to have a think about that.",
    "I have told the director of the [Company] that I will support their bid to be put upon the statue.",
    "What, now?",
    "I'm ready.",
    "I want to attend, no matter how long it takes!",
    "I do NOT want to attend, I don't have time to waste.",
    "I just have a lot of smithing to do today. I can't attend.",
    "I choose... [Company name]!"
  ],
  "He founded the Consortium": [
    "the gathering of mining companies that were to serve the monarchy. But eventually the monarchy came to serve the Consortium."
  ],
  "[Both]": [
    "Argh!"
  ],
  "Black Guard Berserker": [
    "Halt! By the order of the Black Guard, you are under arrest!",
    "Come with us, human! Commander Veldaban wants a word with you!"
  ],
  "Commander Veldaban": [
    "Identify yourself, human!",
    "Ah, so you're the one who knocked over the statue of our glorious king!",
    "Ah, don't worry about it!",
    "We haven't been ruled by a king for many a year... that statue was long overdue for replacement anyway. You're not under arrest, I merely wanted to talk to you.",
    "But let me introduce myself. I am Veldaban, son of Dondakan. I am the Commander of the Black Guard in Keldagrim.",
    "Now listen carefully. I have a task for you.",
    "I want you to go and see the local sculptor and help him build a new statue.",
    "Will you do this for us?",
    "You destroy our statue and you cannot be bothered to help rebuild it? By Guthix, you are rude... even for a human!",
    "You are a good human, Player. Now, I need you to go to Blasidar, he is a sculptor who lives in Keldagrim-East.",
    "Oh, don't worry! I just need you to help him out while he rebuilds the statue. I'm sure there are many tasks that he needs doing.",
    "I see the new statue is nearly completed, Player! Well done!",
    "Perhaps you can be of help here again. If you can get a director to trust you enough, they might let you come along to one of their meetings.",
    "I can come along if you like. You, as an outsider, are in an excellent position to influence the Consortium.",
    "What news from the Consortium, Player?",
    "Then perhaps they can finally end their impasse! Well, let's go to the meeting then!",
    "Yes, now! Are you ready?",
    "I do have to warn you, this meeting may take a while. Do you want to attend the meeting personally, or do you simply want the minutes of the meetings so you can read what happened afterwards?",
    "Happy to hear that! Let's hurry then, I think the meeting is already starting!",
    "Player, are you absolutely sure? You may not get another chance like this. Are you sure you just want to read the summary of the meeting instead of seeing the actual meeting?",
    "Very well, I'll give you the meeting minutes after it's finished.",
    "Veldaban, Commander of the Black Guard in Keldagrim, presenting himself to the Consortium with a guest.",
    "This human helped to rebuild the statue. [He/She] has deserved this honour, surely?",
    "Well then, Player, what is it going to be?"
  ],
  "Blasidar the sculptor": [
    "Why, yes, yes, that I am!",
    "Oh, I don't need an assistant sculptor, really, I can do just fine on my own.",
    "And I've also got a model here, you see, to base my statue on.",
    "But come to think of it, I do need some errands run. Yes, quite important errands too. Yes, you will do just fine.",
    "Well, see... the Consortium has commissioned me to rebuild the statue exactly the way it was. But the statue itself has broken into a million pieces... and we dwarves aren't very good painters, you know, so we don't have any paintings of it either.",
    "No, that's not what I said, I said we're not very good painters. We're excellent with, for example, stone. OH yes, quite good if I say so myself. But I digress... simply speaking, I need some help with getting items that I can base the new statue on. Will you be able to help me with this, Player?",
    "How rude is that? I don't think the Black Guard will be very pleased with you!",
    "Excellent, excellent! Now what I need is the following... I will need a pair of boots, the most exquisite boots you can find. The more they look like the original the better, but I don't think you'll be able to find an exact match.",
    "For the torso, I need clothes that look like King Alvis' clothes. I'm not sure where you would be able to find that, but I'm sure you'll manage.",
    "Also, I need a battleaxe. Now this is particularly important. You are in luck, however, as I believe King Alvis' original axe still survives.",
    "For now, Player, for now! I wish you good luck, and hurry back with the items!",
    "I don't know! You're supposed to find that out for me! But it's a beautiful city, Keldagrim is, I'm sure you'll see many things while you do these tasks!",
    "How are you getting along with those items, Player?",
    "What else?",
    "And? The battleaxe?",
    "Look a little harder please!",
    "How are you getting along with those items, Player?",
    "Then go and fetch them for me, would you? What else?",
    "Go and pick them up please? That would be ever so helpful. And? The battleaxe?",
    "What, that old thing? Is that a piece of rubbish you found in the garbage? Besides, from what I recall of the original axe, this doesn't even look anything like it.",
    "Look a little harder please!",
    "How are you getting along with those items, Player?",
    "Excellent, excellent! Go and give them to Riki over there so I can start my work on the base of the statue! What else?",
    "Oh yes, Vermundi is a good woman, she's very reliable. Wonderful clothing. Give it to Riki please. And? The battleaxe?",
    "Good job! Riki is your man, right over there. Give it to him please!",
    "Yes, yes, that will do just fine. There is only one problem now, I still need to make the head.",
    "Oh no, no no, apparently the Consortium has decided that crowns are out of fashion. As well as kings. Well, kings have been out of fashion here for hundreds of years.",
    "I don't think they've quite made a decision on that. You see, I think each of the directors of the Consortium fancies their own face on top of the statue.",
    "Yes, the Consortium can be a little fickle like that, unfortunately. But can you go and see if they've made a decision yet? I can't very well continue working on this statue without knowing what the face should look like, can I?",
    "Great! In the mean time, I'll build the statue up to the neck!",
    "Any word from the Consortium yet?",
    "Then please, try to persuade one of the directors to force the Consortium into a decision. I must finish this statue before I can move onto my other work."
  ],
  "Riki the sculptor's model": [
    "Talk... to Blasidar.",
    "Talk... to Blasidar.",
    "Thank... you.",
    "Thank... you.",
    "Thank... you.",
    "Yes... I do.",
    "No... it isn't.",
    "Talk... to Blasidar.",
    "Hrm."
  ],
  "Vermundi": [
    "Welcome to my clothes stall, can I help you with anything?",
    "Oh, that sounds interesting, what's this about?",
    "Oh dear, that statue is in a terrible mess, isn't it? I could hear the tumult from over here!",
    "Oh no, no, I can't quite recall what the clothes looked like. But I know someone who can!",
    "Well, I'm sure Hugi the librarian in West can help you along.",
    "Keldagrim-West, dear... on the other side of the Kelda, towards the north end of the city. I'm sure he can show you the exact designs of the clothes.",
    "Oh, just bring the designs to me then, I'll fix you up some nice clothes! Sounds like a fun little thing to do!",
    "Oh yes, did you get those designs from the librarian?",
    "Oh yes, did you get those designs from the librarian?",
    "Oh, I see, I see!",
    "I can definitely help you with this.",
    "I only have one small problem, you see... I've run out of fuel for my spinning machine.",
    "Steam, of course! But I've used up all my coal and wood and I don't have the time to leave my stall to get them.",
    "Well, like I said, I can't do anything really without my spinning machine.",
    "Some coal and logs should do it!",
    "Then put them in the machine dear!",
    "Yes, I can spin them for you, but I will have to ask for a small payment of money for them.",
    "I'm sorry, but the cloth to spin this is expensive. But for you, I can make the clothes for a nominal fee of 200 credits.",
    "Wonderful, let me get started then! There we go! And look how beautiful these clothes look!",
    "I'm sorry for feel that way, I was looking forward to making these clothes.",
    "Didn't I already make the clothes for you? I'm not rich, you know, I can't afford to make any more."
  ],
  "Librarian": [
    "Welcome to the Keldagrim library, human traveller!",
    "His clothes? How do you mean?",
    "I see, I see. There is a book, somewhere in the library, that may help you. It is the 'Scholars Guide to Dwarven Costumes' and it contains the designs of the costumes of a lot of old Kings and dwarven dignitaries.",
    "Let me think... I believe it is on the top shelf of one of the bookcases in the library, because it is such an old book.",
    "I don't remember, sorry. You will have to try several bookcases. You will probably need the ladders, tall a human though you are.",
    "Welcome to the Keldagrim library, human traveller!",
    "An Imcando dwarf, you say?",
    "I see, I see. Ah, I'm afraid I can't help you here, Keldagrim lost contact with that particular tribe of dwarves a long time ago.",
    "I suppose you could try Reldo, in the palace of Varrock. He is a most capable human librarian and knows quite a bit about us dwarves.",
    "He lives quite a good deal closer to where the Imcando used to live than we do, so it is not unlikely. Tell him Hugi the librarian sent you and I'm sure he'll be happy to help. And take a cart to Ice Mountain from the station in the east side of the city. It'll help you get to Varrock faster."
  ],
  "You dust off the book you just retrieved and read the title": [
    "'Scholars Guide to Dwarven Costumes'. Just what you need! You can take this to the clothes stall in the palace market now."
  ],
  "Saro": [
    "Welcome to my store, human! Are you interested in buying anything?",
    "Boots, you say? What kind of boots?",
    "Hmm, let's see... Well, I've got this pair of very exclusive boots. They're not armoured, but they look nice. Or rather, I had. I'm afraid I sold them, come to think of it.",
    "I don't normally stock boots, no, nothing that's appropriate for... what did you say? A king?",
    "Old chap here in the west part of town, his name is Dromund. He's quite well known, not only for his wealth, but also for his... peculiarities.",
    "Go out the door, and head north. You'll have the headquarters of the Black Guard on your left and the bank on your right. Keep heading north and you'll find Dromund's house on your right. Can't miss it! And if you're going to try to get the boots off him, good luck. You'll need it."
  ],
  "Dromund": [
    "You're trespassing, get out!",
    "Are you with the Black Guard or something? No, you wouldn't be, you're just a human. What do you want from me?",
    "Right, and nice they look too on my display tables.",
    "Good one, human! They're mine and the last thing I'll do is part with them!",
    "Get out you pesky human! The boots are mine and you're not having them!",
    "Get out of here before I get one of my servants to throw you out!",
    "Stay away from there! Who do you think you are, coming into my house like that?",
    "What are you doing, casting spells in my house? Get out!",
    "Hey! Is there someone at my window?",
    "Scram before I get the Black Guard to arrest you!",
    "What are you doing?",
    "Servants! We have another thief!",
    "Someone stole my beautiful boots... I had to buy some crummy replicas, the real boots were one of a kind."
  ],
  "Cat": [
    "Growl!"
  ],
  "Santiri": [
    "Welcome, human, to the Quality Weapons Shop! Can I interest you in a purchase?",
    "Fancy a particular colour then? Blue is quite popular at the moment, and red is on the rise.",
    "The King's axe! What would a human want with it?",
    "Oh yes, the statue... a most unfortunate incident. Not that I'm entirely sure that it was merely an accident, of course.",
    "I'm not entirely sure what I mean, human. But the axe, you say, what exactly did you need it for?",
    "I'll give it to you, embedded into your head!",
    "And so it does! It's been in my family's care for a few generations now, after it has been lost for a long time.",
    "I do not know how it got lost, but my great-grandfather found it at the banks of the Kelda, further downstream from the city.",
    "There is not much left of it, to be honest. The blade has almost completely rusted away, and the sapphires on the hilt were either stolen or were washed away by the river before it was found. I doubt it is useful to Blasidar in this state, master sculptor though he is.",
    "Not entirely, no, but it matches the description well enough, and the holes for the sapphires are still clearly visible on the hilt. But since no one has a similar claim, I don't really care. It's genuine to me.",
    "I'll get back to work then.",
    "On your own? I doubt it. The sapphires, perhaps, if you are a skilled enough crafter. But the blade...",
    "Your feeble smithing skills will be of no use. No, you will need expert help on this.",
    "You're a decent smith, but this is far beyond your capabilities.",
    "Clearly you are a master smith, perhaps one of the best human smiths in all of Gielinor. Yet this is beyond even you.",
    "Your feeble smithing skills will be of no use. No, you will need expert help on this.",
    "What you need is the skills of an Imcando dwarf... but they must all be dead by now.",
    "Yes, perhaps, perhaps... Perhaps the librarian, just due east of here, can help you. Yes, I like the sound of this!",
    "Really? That is amazing news.",
    "Excellent! You can take a cart to Ice Mountain from the station here, that should help you get there faster.",
    "I will entrust you with King Alvis' battleaxe, then, human.",
    "Help to restore it to its former glory!",
    "And please ask Blasidar to return it to me after he's done with it, I would sure love to see the restored blade again.",
    "Then stop wasting my time.",
    "Ah, you mean King Alvis' axe? You still have it, yes?",
    "Piece of junk?? I thought you were going to put sapphires on it and bring it to an Imcando dwarf?",
    "Ah, you mean King Alvis' axe? You still have it, yes?",
    "At least you are honest; human. I found it, actually, after you lost it. I'm not happy with giving it to you again, but the rebuilding of the statue is more important. Be careful with it this time, alright?",
    "Ah, you mean King Alvis' axe? You still have it, yes?",
    "Oh, that's beautiful! All it needs now is three sapphires crafted onto the hilt.",
    "Ah, you mean King Alvis' axe? You still have it, yes?",
    "That is amazing! Absolutely astounding work! Go and give Blasidar a hand with it then, and make sure to tell him to send it back to me when he's done with it!",
    "Ah, you mean King Alvis' axe? You still have it, yes?",
    "Yes, Player?",
    "Then you'd better go back to your Imcando dwarf and find out!"
  ],
  "Reldo": [
    "Hello, stranger.",
    "Hugi? I haven't seen him for a long time! He's still in Keldagrim, is he?",
    "Perhaps I should go there again some day, now that humans are allowed in again.",
    "The Imcando dwarves, you say?",
    "Ah yes... the master smiths among the dwarves. They used secret smithing knowledge passed down from generation to generation.",
    "Unfortunately, about a century ago, the once thriving race was wiped out during the barbarian invasions of that time.",
    "I believe a few of them survived, yes. But with the bulk of their population destroyed their numbers must have dwindled even further.",
    "I believe I remember there are a couple living in Asgarnia near the cliffs on the Asgarnian southern peninsula but they DO tend to keep to themselves.",
    "They tend not to tell people that they're the descendants of the Imcando, which is why people think that the tribe has died out totally, but you may well have more luck talking to them if you bring them some redberry pie. They REALLY like redberry pie."
  ],
  "Thurgo": [
    "Maybe. Who wants to know?",
    "No. I don't do that anymore. I'm getting old.",
    "What axe?",
    "Maybe. Who wants to know?",
    "I'd never say no to a redberry pie! They're GREAT stuff!",
    "By Guthix! THAT was a good pie! Anyone who makes pie like THAT has got to be alright!",
    "No. I don't do that anymore. I'm getting old.",
    "You make excellent redberry pies, Player, so how can I refuse? Let me see what's wrong with it then.",
    "Its former glory eh? May I ask where exactly you got this axe from?",
    "Ah, Keldagrim. We have not been there for a long time.",
    "Never mind. Hand me the axe and I'll fix it right up for you.",
    "Oh no, blurite is not appropriate here. No no, this is going to be a very delicate piece of work, requiring only a small amount in the way of raw materials. Can you get me one bar of iron? Then I'll be able to start my work on this.",
    "Good, good! Hand me the axe and I'll get to work.",
    "Did you get me a bar of iron?",
    "Better go get one then, huh?",
    "Did you get me a bar of iron?",
    "Good, good! Hand me the axe and I'll get to work.",
    "Here you go, Player, good as new.",
    "Here's your axe, Player. It looks like there's some damage to the hilt as well, probably some sapphires that are missing. But I'm sure you can take care of that little problem yourself.",
    "Yes, Player?",
    "I did find something washed up on the beach, I think it might be the axe I repaired for you, yes."
  ],
  "Yellow Fortune Director": [
    "I can't help you, go and see my secretary.",
    "A male? How preposterous!",
    "Stop your hollow threats and let the human speak."
  ],
  "Blue Opal Director": [
    "Talk to my secretary, I don't have time to deal with you.",
    "We are not assembled here to squabble over accounting details or the economic state of the Consortium.",
    "It is not yet clear what consequences that discovery will have on the economy."
  ],
  "Purple Pewter Director": [
    "I can't help you, go and see my secretary.",
    "Aye."
  ],
  "Green Gemstone Director": [
    "My secretary is sitting just over there, thank you.",
    "Perhaps, then, we should choose a director for the statue at random?",
    "Aye."
  ],
  "White Chisel Director": [
    "Talk to my secretary, I don't have time to deal with you.",
    "The fact that The Red Axe does its accounting behind closed doors makes that claim quite dubious!",
    "Dondakan's breaking of his rock, and the finding of his gold, has laid doubt to that claim!"
  ],
  "Silver Cog Director": [
    "My secretary will deal with any inquiries you have about the Silver Cog.",
    "But the statue is clearly male! It can't have a female head!",
    "Aye."
  ],
  "Brown Engine Director": [
    "Today is not a good day, can you come back tomorrow?",
    "Clearly it is I who is most suitable.",
    "Amusing, I accept!"
  ],
  "Red Axe Director": [
    "I am conducting a meeting here, begone!",
    "Enough of this, everyone! This bickering is pointless. The Red Axe is the largest and wealthiest mining company, we have all rights here!",
    "No! I will go on top of that statue! I proposed this in the first place!",
    "A human, at a Consortium meeting? What is this?",
    "This is outrageous! I'm warning you, The Red Axe will boycott the Trade Octagon!",
    "You'll regret this, all of you!"
  ],
  "Red Axe Secretary": [
    "Don't bother me!"
  ],
  "Brown Engine Secretary": [
    "The Brown Engine is a gentleman only society, I'm afraid."
  ],
  "Yellow Fortune Secretary": [
    "The Yellow Fortune does not employ the services of men.",
    "We often find that they are too weak or too slow to be of sufficient use."
  ],
  "Note": [
    "May be different dialogue for each company - The Purple Pewter was used in this transcript"
  ],
  "[Company] Secretary": [
    "And what can I do for you?",
    "Yes, I think we do have something for you. We need [number] pieces of [material] in the next [time].",
    "Thanks, it's appreciated.",
    "And I would grant you such a request, why? You need to prove yourself to the company first before such a privilege is bestowed on you.",
    "I don't see any reason to grant such a privilege to a lowly worker. No, first you must prove yourself.",
    "Blasidar does not command the [Company].",
    "Nor does the Black Guard. They are under the command of the Consortium, not the other way around.",
    "It's all very simply. You perform some tasks for us, help us  out a little when we need something done urgently, and in reward you will rise in our estimation.",
    "And not a minute too late as well. Well done.",
    "The [Company] recognises your performance.",
    "Wonderful! I will personally oversee that it goes to the trade floor on time!",
    "I knew you were the right human for the job!",
    "Of course, we reserve our best tasks just for you, [Player]!",
    "You should speak directly to the director."
  ],
  "[Company] Director": [
    "[Player]! I've been hearing great things about you!",
    "Why, certainly. We need [material] in the next [time].",
    "Then hurry back, [Player], I'm counting on you!",
    "Oh yes? This is in connection with the statue, presumably?",
    "Oh yes, Hreidmar suggested that it should be one of us. The Era of Kings is long gone, after all. Now the Consortium provides peace and above all prosperity... so the statue should reflect this.",
    "He is the Director of the Red Axe. Ha, that old fool quite fancies his own head up on that statue, he thinks he can get away with that just because his company is one of the biggest in the Consortium.",
    "Certainly not! The Consortium has yet to make a decision... all the companies are vying for the honour.",
    "Ah, would you now, would you? I'm not altogether sure... much appreciated though you are, you are not really part of the [Company]. Not as such.",
    "Were what? A part of the [Company]? Yes, that might certainly change things...",
    "You never fail to satisfy, [Player]!",
    "You are a true asset to the [Company]!",
    "Guthix be praised! Have you ever considered joining the [Company], [Player]? You would truly make a marvelous member.",
    "Hmm, interesting, a human joining the [Company]. But you have certainly proven yourself to be a most worthwile contributor. I have not seen such dedication in all my years as director of this company. It is agreed then! You are now a 'trusted associate' of the [Company]. Welcome!",
    "Ah, would you now, would you? This might well work. Yes, an outsider to the city might have considerably more influence than one might expect, if we play our cards right.",
    "We wait until the most opportune moment for you to show your support. Yes, you must really come along to one of our meetings.",
    "A Consortium meeting, when all the directors meet on the top floor of the palace. We have them from time to time. We'll have another one soon, to once and for all solve our little problem with the statue. So what do you say, will you speak out for me at the next meeting, so that they will base the head of the statue on me?",
    "Hurrah!"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:The_Giant_Dwarf?oldid=36234874’"
  ]
}