{
  "King Veldaban": [
    "Hello, Player.",
    "Oh, don't call me that, Player. You of all people...",
    "What do you want to talk about?",
    "Meike altered the records. It only took a few pen-strokes, she said. It looks like I, and not Hreidmar, descended from King Alvis's secret heir. You, I and Meike are the only people who know it isn't legitimate. This must stay our secret, Player. I never wanted this kind of power, but it was the only way to keep Hreidmar off the throne.",
    "The old rules of succession included a maximum age. Once the king reaches a hundred and fifty, the throne passes on to their heir.",
    "The monarchy was for men only and everyone knows that. No one would have believed the records if they had pointed to Meike.",
    "The Consortium still exists. It's gone back to being an advisory body, just like it was in King Alvis's day. I don't like the Consortium's priorities, but they've got experience in running the city that I don't. I still need them around.",
    "It doesn't seem right. Maybe one day, but not anytime soon.",
    "What now? Everything now! Everything, right now! The Consortium had eight leaders - they could divide responsibility between them. I'm just one dwarf. I spend most of my time judging disputes. Company leaders squabbling over who owns how much of some mine or factory; workers trying to get better treatment out of the companies... I let the workers unionise, and now the company leaders hate me. The Consortium is meant to advise me but I have to second-guess everything they say. Those are just the domestic problems. I'm also trying to negotiate a permanent peace treaty with the local trolls, over the objections of half the Black Guard officers who think a war would be good for their careers. Not to mention that Guthix is apparently dead and the actual GODS are back in Gielinor. Most dwarves can pretend it's not happening, but a head of state doesn't have that luxury. Gah! Listen to me! I don't like what I'm turning into, Player.",
    "Oh, don't give me that. Do you know how many of the old kings of Keldagrim were the first-born sons of their predecessors? Maybe half. At first, the 'rightful' king was whichever warlord held onto the throne long enough to put his son on it after him. Later it was whichever nobleman murdered everyone above him in the line of succession. Our worst kings have been spoiled children who inherited the kingdom then taxed it to starvation in order to decorate their palaces. That's what Hreidmar would be like, and that's why Meike put me on the throne - to protect the kingdom from him and his like.",
    "Back when I was Keldagrim Black Guard Commander, I'd rant about the Consortium for not allocating me enough resources. Now I'm the one having to turn down Lieutenant Brae's requests for more funding. I have to make every decision myself because I can't trust my advisors. Dwarves - civilians - are going to die because of decisions I make, and eventually there'll be so many dead that I'll stop caring, and then who will I be? Being king will turn me into either a tyrant, or a puppet for the Consortium. The transformation is inevitable.",
    "I can't focus on the other problems until I've dealt with the real threat - the Red Axe! I haven't heard anything from them since we foiled Hreidmar's last plot. Whatever they're doing, they're being secretive about it. This time I'm not going to wait for them to strike! I'm the King of Keldagrim, with the entire Black Guard under my command, and a new alliance with the trolls. I'm going to attack their base before they have time to move! I could use your help, Player. You're the only person I know I can trust. Can I count on you?",
    "Right. There are three things I'd like you to do. Firstly, Lieutenant Brae has rounded up some suspected Red Axe spies. She's holding them in the records chamber in Keldagrim West. I'd like you to investigate and see if they're really spies. Secondly, I'd like you to go to Taverley Dungeon for me. There are chaos dwarves there, so the Red Axe must be up to something, and I want to know what. Kill those chaos dwarves and see if you can find any leads. Lastly, I want to have some defence against that ogre shaman's memory-altering magic. I know the Watchtower Wizard has experience with ogre shamans, so I'd like you to ask him for help. This seal will mark you as my agent.Veldaban gives you a royal dwarven seal.",
    "The suspects are in the records chamber, in the west wall of Keldagrim, next to the Black Guard HQ. Talk to Lieutenant Brae when you get there for more instructions. Remember: if they really are Red Axe spies, the penalty is death. Hreidmar and his cronies have killed Guthix-knows how many innocent dwarves. No one who's worked with them deserves mercy. If someone has committed treason but you can't link them to the Red Axe, there's a lesser punishment: exile. Get them far away so they can't damage Keldagrim. As my agent I'm empowering you to make the decision in each case.",
    "We both saw that the Red Axe creates chaos dwarves by transforming ordinary dwarves. Any chaos dwarves out there in the world, we've got to assume they're part of a Red Axe plot. Taverley Dungeon is dangerously close to human and dwarf lands. If the Red Axe is up to something there, I want to know what it is. Go there and kill some chaos dwarves. Keep an eye out for anything that happens and chase up any leads you see.",
    "I know the Red Axe have an ogre shaman working for them who can wipe people's memories. We've both been the subject of his spells. I hear the Watchtower Wizard once gave you a potion that let you kill ogre shamans. I want you to ask him for help against the Red Axe's pet ogre.",
    "Okay, bye.",
    "How are you getting on, Player?",
    "This seal will mark you as my agent.Veldaban gives you a royal dwarven seal.",
    "How are you getting on, Player?",
    "Thank you! I'll get a full report from Lieutenant Brae later, but I trust your judgement. I know you won't have let anyone live if they had a connection to the Red Axe.",
    "Interesting! They must have shed their old agents and gone deeper into hiding. This is a sign that they're planning something new and more dangerous. We must stop them quickly!",
    "How are you getting on, Player?",
    "Did you believe her?",
    "I wouldn't be so sure. She could be in league with the Red Axe, and trying to mislead us! We've got to move quickly!",
    "She could be in league with the Red Axe, and trying to mislead us! We've got to move quickly!",
    "How are you getting on, Player?",
    "Good work! I want you to keep hold of it - be prepared to use it on the ogre shaman when the time comes.",
    "It could? I didn't realise... No. It would be too painful, and I can't...I can't let anything distract me. Perhaps I'll use it when all this is over, but not now. I think we're ready. My army is assembling in the Barendir caves. I'll meet you there.",
    "What?",
    "How can you say that, after all we've seen? After all we've been through together? They kidnapped countless dwarves and transformed them into abominations. They tampered with both our memories. They blew up the Lava Flow Mine in order to overthrow the Consortium. Does Hreidmar seem like someone who would give up? While he still has a secret base, and an army of chaos dwarves? No, he's out there, and he's plotting something, I know it.",
    "How can I? How can I deal with problems properly while the Red Axe is still plotting to take over and no one believes they're a threat but me? Once we've defeated them, I'll focus on the other problems.",
    "I think we're ready. My army is assembling in the Barendir caves. I'll meet you there.",
    "Everything is ready! The Red Axe base is on the other side of that wall. I don't know what we'll find there, but we can be pretty certain there will be fighting. Speak to the quartermaster if you want anything from your bank. Once you're ready, you can have the honour of firing the cannon to breach the wall!",
    "It's up to us, Player! We've got to get to get [sic] past the lava flows, deal with those cannons, and raise the bridges so the army can advance!",
    "You think that makes it all right that you wiped the memories of hundreds of dwarves? That you wiped Hilda's memory?",
    "Finish him, Player! Then we can go after Hreidmar and Grimsson!",
    "You'd better not set foot in dwarven lands while I'm still king, ogre. Get out of my sight.",
    "Hreidmar and Grimsson were gone when I regained consciousness. They must have gone deeper into the Red Axe base. Let's go!",
    "Come on, Player! I bet Hreidmar and Grimsson are holed up in the top of the palace. We should find them!",
    "What?",
    "We'll make you the *only* Red Axe director in the palace. Come on, Player, let's kill some directors.",
    "There! Now the last Red Axe Director will make me a Red Axe member!",
    "Full of dwarves you'd kidnapped from Keldagrim East and turned into abominations! I don't care if you've given up - you still need to pay for your crimes!",
    "Player... I don't like...agh...what I'm...turning into.",
    "You've got to...kill me. Don't let me...turn into...that.",
    "We stopped Hreidmar. We...we won. Let...someone else...be king.",
    "Now I know what...what she went through. We'll be dead...chaos dwarves...together. Hilda...I remember you.",
    "I'm a bad king. I don't know what to do.",
    "Now I know what...what she went through. We'll be dead...chaos dwarves...together. Hilda...I remember you.",
    "Guthix damn you, Player. This is all your fault. You knocked that statue down...started this whole thing off. Hah. Hah hah hah. Hah hah hah hah hah hah haaah!",
    "What are you lot doing here?",
    "The question of continuing government?",
    "If this is a coup, it's a pretty poor one. The Black Guard is loyal to me.",
    "Player is right. Meike, I'm not cut out to be king. You put me on the throne to stop Hreidmar, and I've done that. It's time for me step aside. Ladies and gentlemen, the city's 'darkest days' are over. You 'band of petty councillors' can take it from here.",
    "You're right, I don't want to be king. But do you know who did want to be king? Hreidmar. I took the throne to protect the people of Keldagrim from Hreidmar, and I'll stay to protect them from the Consortium. I may not be a good king yet - but I'll learn. Now get out of my throne room.",
    "Hello again, Player.",
    "Now that the Red Axe is gone, I'm getting down to the serious task of being king. It's hard work but, like you said, I can learn.",
    "I'm learning to pick my battles and be realistic about how fast I can move. I'll get nowhere if I fight the Consortium, but I think I can work with them without compromising my principles.",
    "I'm not going to make Keldagrim into a better society overnight, and maybe not in my lifetime, but I can make steps in the right direction.",
    "I don't pretend to understand magic. I saw what happened to Grimsson and Hreidmar, and I could feel something happening to me, and I didn't want to end up like them.",
    "I could delay the change by concentrating. I thought I was dead, one way or another, but I wanted to hold on until you put me out of my misery. I didn't want to change.",
    "I was thinking, maybe this is best. I'd had my revenge on the Red Axe, and besides that revenge I had nothing left to live for. If this is the end, I thought, it was a good end.",
    "But then you didn't kill me, you stubborn human! I should have known you'd pay no attention to me.",
    "And then I saw the funny side. This whole thing started when I first met you, when you knocked down the statue and I made you rebuild it.",
    "I was king, but it was like I wasn't even the hero of my own story - it was always you! And at the end, there you were again, not even letting me have my heroic death.",
    "Maybe it's not really funny, but in that moment it seemed like the funniest thing in the world.",
    "And, I don't know, I think the realisation that you weren't going to kill me gave me the strength to fight off the transformation. I couldn't die, so I had no option but to live.",
    "Or maybe you just helped me for long enough for the magic to wear off. Either way, thanks, Player. You could easily have given me my wish, but you didn't.",
    "Yes...I suppose you could.",
    "You'd have to get another one from the Watchtower Wizard first, though.",
    "You know - I think I was using the Red Axe threat as a way to put off things I didn't want to think about, and this was one of them.",
    "It's an odd thing, knowing that a person once meant a lot to you, but barely being able to remember them.",
    "I have an image of what she was like, but I don't know how much of that is a memory and how much is my imagination. I'm scared that if I find out, I'll find I was wrong.",
    "You're right. Not knowing is an act of cowardice. All right, I'm ready.",
    "...",
    "Yes, yes, that's how she was.",
    "Thank you, Player.",
    "I think that's between me and Hilda's memory, Player. But thank you, you were right to restore my memory.",
    "Yeah, you're probably right."
  ],
  "Player": [
    "Hello, Veldaban.",
    "Your Majesty.",
    "I don't understand how you ended up as king.",
    "Shouldn't your father, Dondakan, be king?",
    "Why didn't Meike make herself queen?",
    "What's happened to the Consortium now?",
    "Will you have the statue rebuilt with your head?",
    "Goodbye.",
    "So you're a king - what now?",
    "Plus you're not even the rightful king.",
    "What do you mean, what you're turning into?",
    "So what are you going to do?",
    "I have a question.",
    "How should I investigate the suspected spies?",
    "What should I do in Taverley Dungeon?",
    "What about the Watchtower Wizard?",
    "That's all, thanks.",
    "I have a question.",
    "Sorry, I can't help.",
    "He's not coming. He sent me instead.",
    "Who are the suspects?",
    "What should I do?",
    "I know someone else who might be a spy.",
    "Drorkar, the old power station owner.",
    "The engineers working with the penguins.",
    "Actually, never mind.",
    "Thanks.",
    "What were you doing on Jatizso?",
    "Why did King Sorvott say you were from the Red Axe?",
    "I'll come back.",
    "What were you doing on Jatizso?",
    "Why did King Sorvott say you were from the Red Axe?",
    "What was the nickname of your ship's captain?",
    "I'll come back.",
    "What weapon was Grundt carrying?",
    "Grundt says the ship's captain was Sigridsdottir.",
    "Calling for the overthrow of the king is treason.",
    "How do you know Veldaban isn't the rightful king?",
    "I think the Red Axe told you to say this.",
    "I'll come back.",
    "Klaas is calling for a revolution.",
    "Why does Klaas think Veldaban isn't the rightful king?",
    "Could he have got the idea from the Red Axe?",
    "Goodbye.",
    "I spoke to Meike. She vouched for you.",
    "Who are you?",
    "I want to search the workshop.",
    "I want to buy a warhammer.",
    "Bye.",
    "Here are some letters I found in your workshop.",
    "I've dealt with the suspected spies.",
    "Vigr said the Red Axe broke off contact with him.",
    "I have a question about what you asked me to do.",
    "Goodbye.",
    "Who are you?",
    "Haven't you heard? Guthix is dead!",
    "Saradomin defeated Zamorak at the Battle of Lumbridge.",
    "That's an interesting interpretation.",
    "Your beliefs are ridiculous.",
    "I am ready.",
    "It was a worthy combat!",
    "Just tell me about the chaos dwarves.",
    "Could you repeat your information first?",
    "You're weak. Zamorak would want you dead.",
    "You're my enemy. Die, Zamorakian scum!",
    "I'm not a murderer. You live.",
    "Who are you?",
    "I'd rather test *your* strength.",
    "I investigated Taverley dungeon. The chaos druid leader claims that the chaos dwarves there are nothing to do with the Red Axe.",
    "Yes, I believed her.",
    "No, I didn't believe her.",
    "I have a question about what you asked me to do.",
    "Goodbye.",
    "King Veldaban sent me. He wants something to fight an ogre shaman with memory-wiping powers.",
    "What? All my memories are fine!",
    "You're right, some of my memories don't really fit.",
    "I'm ready.",
    "I'll come back later.",
    "Do you have any more quests for me?",
    "That's okay.",
    "There's the Red Axe director again!",
    "Chaos dwarves!!! I must tell Veldaban!!!",
    "Nooooooo!",
    "I got a wand from the Watchtower Wizard.",
    "It could restore your memories of Hilda.",
    "I want to say something first.",
    "I'm not sure the Red Axe is a threat any more.",
    "I don't think you're coping well with being king.",
    "I'll meet you in the Barendir caves.",
    "I'll keep hold of it.",
    "I want to say something first.",
    "I'll meet you in the Barendir caves.",
    "I have a question about what you asked me to do.",
    "Goodbye.",
    "You're talking nonsense!",
    "Red Axe chaos Zamorak Hreidmar!",
    "I'd like to join the Red Axe.",
    "My friend here would like to join the Red Axe.",
    "They're right, Meike. The Consortium should take power.",
    "Crown the rightful king, whoever that is.",
    "They're right, Veldaban. You should step down.",
    "Don't let them do this, your majesty!",
    "So, you're still king - what now?",
    "What are you doing now you've stepped down?",
    "How did you resist the chaos transformation?",
    "I could use the wand to restore your memories now.",
    "It's better to know.",
    "So, what did you see?",
    "You're welcome.",
    "Maybe it's best not to know.",
    "*You're* the rightful king?",
    "You were crowned 'King Drunken Dwarf'?",
    "I could restore your memory using the memory wand.",
    "I did use it. Didn't anything happen?",
    "So you're still head of the Keldagrim Black Guard?",
    "I want to talk about the Red Axe spies.",
    "What do you think of my choices?",
    "Where do you send dwarves when they're exiled?",
    "How do the executions take place?",
    "I should go.",
    "What's happening to the Black Guard now the war is over?",
    "Who are you?",
    "What news have you?",
    "I must go now.",
    "How do you think Veldaban is doing as king now?",
    "How do you think the Consortium is doing now?",
    "Have you heard from Veldaban lately?",
    "What do you think of the new king?",
    "I'm sorry about Veldaban's death.",
    "Goodbye.",
    "Where did you get that cat?",
    "What do you think of the government of Keldagrim?",
    "Goodbye.",
    "I spared your life. You could be more grateful.",
    "What will you do now?",
    "Goodbye.",
    "I spared your life. You could be more grateful.",
    "What will you do now?",
    "Goodbye.",
    "So now you think Veldaban is legitimate?",
    "What do you think of Veldaban's rule now?",
    "Goodbye.",
    "So now you think Veldaban is legitimate?",
    "What do you think of the Consortium now?",
    "Goodbye.",
    "So now you think Veldaban was legitimate?",
    "You don't think the new king is legitimate?",
    "Goodbye.",
    "I spared your life. You could be more grateful.",
    "What will you do now?",
    "Can you tell me about the Red Axe?",
    "Goodbye.",
    "Dragon warhammers?",
    "Can you tell me about the Red Axe?",
    "Goodbye.",
    "I spared your life. You could be more grateful.",
    "Why don't you leave?",
    "Can you tell me more about the Red Axe?",
    "Goodbye.",
    "I spared your life. You could be more grateful.",
    "What will you do now?",
    "Can you tell me more about the Red Axe?",
    "Goodbye.",
    "What will you do now?",
    "Can you tell me more about the Red Axe?",
    "Goodbye.",
    "You don't remember me?",
    "What do you remember?",
    "Chaos dwarves? Hreidmar? The Red Axe?",
    "Goodbye, Grunsh.",
    "I'm no one you know. Goodbye.",
    "So you're allies of Keldagrim now?",
    "What was it like working with the Black Guard?",
    "Goodbye.",
    "We defeated the Red Axe - why are they still attacking?",
    "Tell me about your assault on the Red Axe base.",
    "Tell me about the hand cannoneers.",
    "Tell me about the chaos dwogres.",
    "Goodbye.",
    "I'm sorry for your loss.",
    "He is the king.",
    "I could restore your memory using the memory wand.",
    "Your memory. The Red Axe tampered with it, but I could restore it using this wand.",
    "It's okay. Veldaban and I defeated the Red Axe. You must have been too drunk to notice.",
    "What happened to Brendt and Grundt?"
  ],
  "Lieutenant Brae": [
    "Hello, human. Do you know when King Veldaban will be here to deal with these suspects? I can't hold them for much longer without charging them.",
    "I'm afraid you'll need to show me some proof of that, human.",
    "That is the King's seal. I was hoping he would come personally, but I suppose he has no time. You should investigate each of these suspects and tell me if you think they're a spy. King Veldaban has given you his seal, so you can pass judgement on them. Good luck.",
    "Vigr is a tradesman. His warhammer shop is in the north-west of the ground floor of Keldagrim Palace. We know he was a member of the Red Axe before the company left the city - that's not illegal. What we want to know is whether he's been in contact with them since. Klaas is a member of the Monarchist Society, but he's been publicly calling for people to rise up and overthrow King Veldaban. He says Veldaban isn't the rightful king. That in itself is treason, for which he could be exiled, but if he's doing it at the instigation of the Red Axe then he's an enemy agent and should be executed. We picked up Brendt and Grundt on Jatizso, where they were buying a shipment of ore from King Sorvott. They claim to be independent traders, but King Sorvott told us they mentioned the Red Axe. They also stayed on the island after their trade had been concluded, so it's possible they were spying for the Red Axe.",
    "Question each of the suspects, and then gather more information. If you find evidence, you can accuse them of being a Red Axe spy and then pass judgement.",
    "Really? Who?",
    "We investigated him, but he's clean. He's done business with all the mining companies, but he hasn't dealt with the Red Axe since they left the city.",
    "Baden, Glosur, Medwin and Obert? Yes, we investigated them, but they're not Red Axe agents any more - they left the Red Axe and became independent. King Veldaban decided to leave them alone.",
    "Is there anything else you need?",
    "You've found a contradiction in Brendt and Grundt's stories. It's up to you to pass judgement, Player. Firstly, what about Brendt? He told you a tale about 'Captain Redaxe', but Grundt didn't confirm it.",
    "Now, what about Grundt? He claims to have been carrying a red axe.",
    "It's not up to Meike, Player. You're the one who needs to pass judgement.",
    "Vigr has confessed to being a Red Axe spy, so it's up to you to pass judgement, Player.",
    "Thanks for dealing with the spies, Player. You should report back to King Veldaban.",
    "What can I do for you, Player?",
    "I am. I was having trouble with the responsibility at first, but the Supreme Commander says I've grown into the job.",
    "Thanks for your help with that, Player. At first I was annoyed that Veldaban would send a human to judge dwarves, but perhaps only an outsider could have judged them fairly.",
    "What do you want me to say? Is your conscience troubling you? Do you want me to tell you that you made the right choice?",
    "As the king's agent you were empowered to judge the prisoners however you saw fit. From a legal standpoint, whatever you did was correct.",
    "Decisions like that come with the territory, I'm afraid. No one said they were going to be easy.",
    "They're forbidden to enter lands controlled by Keldagrim. A lot of them seem to end up to the south of Yanille.",
    "A dwarf sentenced to death is taken to the mines outside the city and a Black Guard cuts off their head with an axe. It may not be a perfect system but at least it's quick.",
    "Luckily for the prisoners, you spared them all that fate.",
    "It was good to see you again, player."
  ],
  "Brendt": [
    "You have no evidence that I'm a spy. King Veldaban is throwing around these accusations in order to intimidate respectable businessdwarves.",
    "We were there to collect a shipment of ore that we had bought. We received it later than agreed, but we let the matter go.",
    "The captain of the Fremennik trading ship on which we arrived was nicknamed 'Captain Redaxe', due to his red, axe-shaped beard. You can see how King Sorvott might become confused.",
    "Honestly, I don't remember. I think he kept it in his cabin for the journey and I'm not certain I ever saw it. It could have been anything.",
    "Really? He must remember it incorrectly. It was definitely Captain Redaxe.",
    "The Red Axe will win! King Veldaban will drive the city into the ground through bad leadership, and Hreidmar will move in to take over!",
    "Good! I'll do better away from King Veldaban's anti-business regime.",
    "At last this charade of justice is over. Let me get back to my business.",
    "It's far too warm here. I miss the Fremennik Isles.",
    "You've condemned me to live out my life outside of dwarven society. No more dwarven food, dwarven clothes, dwarven drink! Yes, I'm grateful to be alive, but don't expect me to be jumping for joy.",
    "I'm a known exile! No reputable ship will take me as a passenger, even if I could afford their fee. If I tried to go anywhere on foot I'd be killed by ogres or bandits.",
    "They sent us to Jatizso to keep an eye on the Fremenniks there, in case they formed an alliance with Keldagrim. Grundt and I didn't know anything specific about the Red Axe's plans.",
    "None of the companies will accept me as a member! I'm a highly skilled trader, and they shut me off just because I worked for the Red Axe!",
    "Everyone in Keldagrim sees me as a traitor! I'll never be accepted into dwarven society again. No more dwarven food, dwarven clothes, dwarven drink! Yes, I'm grateful to be alive, but don't expect me to be jumping for joy.",
    "I can't get a job as a trader or manager because of my association with the Red Axe. My only option may be to become a... manual labourer!",
    "They sent us to Jatizso to keep an eye on the Fremenniks there, in case they formed an alliance with Keldagrim. Grundt and I didn't know anything specific about the Red Axe's plans."
  ],
  "Grundt": [
    "Are you going to keep us here much longer?",
    "We collecting some ores that we'd bought.",
    "Because...um...because I was wearing a red axe, to defend myself from trolls. I mean, I had an axe, and it happened to be red, so maybe the king got...confused?",
    "The ship we arrived at Jatizso on? She was called...let me think... She was called Captain Sigridsdottir. I don't know if she had a nickname.",
    "I'm sorry! I promise I'll never work for the Red Axe again!",
    "Oh no! Oh no!",
    "Thank you! You'll never hear from me again!",
    "Thank you! I'll be loyal to King Veldaban from now on!",
    "Player! Thank you for sparing me! You've given me a whole new lease of life!",
    "I love it here! The warm sun, the sea breeze... even if I could move away, I wouldn't! I think I'll learn to fish, and maybe build myself a little hut. It'll be a good, quiet life.",
    "I think I'll move away from Keldagrim, find somewhere with warm sun and a sea breeze. I think I'll learn to fish, and maybe build myself a little hut. It'll be a good, quiet life.",
    "I'm so glad to be free of them! My only regret is that I didn't get out sooner. Out on Jatizso I didn't know how evil they'd become."
  ],
  "Klaas": [
    "Release me! King Veldaban is not the true king of Keldagrim! The people have a right to know! There should be an uprising - Veldaban should be deposed! Speak to the Monarchists in the King's Axe Inn - they all agree with me!",
    "Calling for the overthrow of the rightful king would be treason. I'm calling for an usurper to be removed from power. And didn't Veldaban call for the overthrow of the Consortium before he became king?",
    "A rightful king is anointed by Guthix! His touch cures disease! He can do no wrong! 'No band of petty councillors can preserve this city through its darkest days - only a king.' And yet King Veldaban keeps his band of petty councillors around to advise him. There's been no real change! The rightful king is still out there. Veldaban should step aside - and if he doesn't, the people should push him aside!",
    "No! The Red Axe would be worse than Veldaban! Talk to Meike. She knows I'd never work with the Red Axe.",
    "I told you she would. I'm not a spy! Now, release me!",
    "I don't recognise your authority! Veldaban is not the rightful king!",
    "I'll be a martyr. When the people find out you murdered me, hundreds more will rise in my place.",
    "You can't suppress the truth forever! Wherever I go, I'll tell people that Veldaban is a usurper.",
    "You made a mistake arresting me. Now I'll tell everyone how I was treated by Veldaban's Black Guard!",
    "Now that the consortium is back in power, they'll let me back in to Keldagrim before long - and then you'll be sorry you exiled me.",
    "I'm sure the messenger will arrive any day now.. Any day now...",
    "You knew you had no choice! If you'd executed me, there would have been an uprising! I'm surprised you even got away with exiling me.",
    "I'm sure I'll be able to return to Keldagrim before long, but for now, this exile is giving me time to think.",
    "I'm planning to write a book about dwarven politics - everything that's been wrong with the government through the years.",
    "You may have banished me to the middle of nowhere, but someday the truth will be known! Veldaban is not the rightful king! History will vindicate me!",
    "(Same as above.)",
    "(Same as above.)",
    "A toast to King Veldaban - true king of the dwarves!",
    "He defended the city from the Red Axe. Great military victories are the mark of a true king!",
    "I still think he could be moving faster to solve all the city's problems - but if he can defeat the Red Axe threat, I'm sure he can do everything else he needs to.",
    "The thieving Consortium robbed King Veldaban of his birthright! I don't know how they forced him to step down, but someday they'll pay for it.",
    "He defended the city from the Red Axe. Great military victories are the mark of a true king!",
    "They're back in power for the moment, but they haven't gotten rid of the people's desire for a monarchy. The monarchy will be restored before long, you'll see.",
    "Rest in peace King Veldaban, last true king of Keldagrim.",
    "He died defending the city from the Red Axe. Only a true king would lay down his life for his people like that.",
    "That drunken fool? How could he be? The true royal line was imbued - by Guthix himself - with great alcohol tolerance. A king's judgement is never impaired!"
  ],
  "Meike": [
    "Klaas has been arrested! Do you know what's happening?",
    "I know. Back when the Consortium was in power he wanted to call for a revolution to install a king. Now that there's a king, he wants a revolution to install a better king. I know that calling for the king to be overthrown is treason and he could be exiled. I tried to talk him out of it. He's a good person, but he's hot-headed - if you have any leeway for mercy, please show it.",
    "He didn't get the idea from me, if that's what you're implying. I don't know where he got the idea from.",
    "You're saying he might be a Red Axe agent? I suppose I don't know for sure he isn't...but I've never seen any indication of it, and it doesn't match the Klaas I know.",
    "Player! You've got to deal with this. They're trying to take power back!",
    "Player, this is out of order! Veldaban didn't take emergency powers - he was crowned king.",
    "Your majesty, this is out of order! You didn't take emergency powers - you were crowned king.",
    "Veldaban, no...",
    "Hello again, Player.",
    "He seems to be governing more responsibly now that the Red Axe is off his mind. He's implementing reforms, but he's moving slowly and not antagonising the Consortium. Being king is a heavy responsibility, but he's rising to it.",
    "They're back to their old ways. It could be worse, but...it's disappointing.",
    "After what happened you can bet the company leaders are thinking of ways to prevent another loss of their power. I doubt I'll see the monarchy permanently restored in my lifetime.",
    "Yes, he's been in touch. I invited him to join us here, but I think he's more comfortable on the other side of the city. Too many company leaders live over here, I think.",
    "He *is* the new king. I was there when they went through the records, and there really is no doubt this time.",
    "I suppose one of the strengths of a monarchy is that each heir is trained for their role from a young age. You're not going to get that with a restored monarchy.",
    "But even so, I wish it had turned out to be someone who hadn't spent their whole youth wandering the world in a drunken daze!",
    "It's sad...but I know if there had been a way for you to save him, you would have done it."
  ],
  "Vigr": [
    "Get away from me, human! How dare you hold me like this? Show me some proof - physical proof - that I'm a Red Axe agent. Otherwise, release me!",
    "... Yes, I suppose those do constitute physical proof. But...but look at the date on the last letter! I haven't had contact with the Red Axe since Veldaban became king. The Red Axe abandoned me, and all its other agents. And even if they were to contact me again, I wouldn't work for them! I've learned my lesson! I'm not a threat to King Veldaban!",
    "Please, have mercy! I'm not a threat to King Veldaban! Send me into exile instead, and you'll never hear from me again - but please let me live!",
    "No!",
    "Thank you! I promise you and King Veldaban will never hear from me again!",
    "Really? Thank you!",
    "Get away from me, human! I lost everything because of you!",
    "What, you want me to give you a reward? I have nothing but the clothes on my back! The Black Guard confiscated everything!",
    "The warhammer shop I'd built up from nothing with my own sweat...yes, it was all owned by the Red Axe, but I deserve to keep something, don't I?",
    "Now I'm going to make a new life for myself outside of dwarven lands! I don't need Keldagrim, or the companies! Somehow I'll find something that people want to buy, and I'll make my fortune!",
    "As I told you back in Keldagrim, I hadn't heard from them since Veldaban's coronation.",
    "Yes, I knew they had been kidnapping dwarves from Keldagrim East to turn them into an army. Good riddance, I thought!",
    "If those dwarves had worked harder and made something of themselves they wouldn't have ended up in East.",
    "Now the Red Axe is gone, no doubt Keldagrim will see an explosion of useless, unproductive population. They don't know the service the Red Axe was doing for them by removing the dead weight!",
    "Thank you for saving me from the Red Axe, human! Now I'm back in charge of my shop and I've got some new weapons to sell: dragon warhammers!",
    "Yes! The Black Guard recovered schematics on how to make them from the Red Axe base. Supreme Commander Bisi has asked me to make them for the elite Black Guard berserkers, and I'm also selling them here.",
    "As I told you back in Keldagrim, I hadn't heard from them since Veldaban's coronation.",
    "Yes, I knew they had been kidnapping dwarves from Keldagrim East to turn them into an army. Good riddance, I thought!",
    "If those dwarves had worked harder and made something of themselves they wouldn't have ended up in East.",
    "Now the Red Axe is gone, no doubt Keldagrim will see an explosion of useless, unproductive population. They don't know the service the Red Axe was doing for them by removing the dead weight!"
  ],
  "Sieglinde": [
    "Do you know what's happened to Vigr? The Black Guard has been holding him for a while.",
    "I'm a junior weapon-smith working for the Orange Flame. The Consortium asked me to mind Vigr's shop while he's under investigation by the Black Guard. I'd been hoping for a chance like this, but I wish it wasn't under these circumstances.",
    "Go ahead. Everything is as Vigr left it - I haven't touched anything.",
    "Oi! Did I say you could use my furnace?"
  ],
  "Ikadia the Exile": [
    "Adventurer! You won't find what your dwarf king is looking for here. Speak to me at my ritual circle to the north of this dungeon and I may tell you what I know.",
    "I have the knowledge that the dwarf king seeks, but it is not the way of Zamorak to give knowledge freely. Are you ready to fight for your dwarf king?",
    "I am Ikadia the Exile, leader of the chaos druids. I wear the title in honour of my ancestor Urval, who was exiled by the druids above for preaching the truth about Guthix and Zamorak. Zamorak is Guthix's most perfect incarnation! He brings balance to the world through chaos!",
    "Of course I've heard, you insolent little man! Like all druids, I felt the shiver run through the world. Unlike them, however, I rejoiced! Guthix has shed his old form, just as Urval foretold. Now he returns in the form of Zamorak, to bring balance through chaos!",
    "Fool! You see only the surface and are blind to the true meaning! When Saradomin and Zamorak began to fight, Lumbridge became a war zone, did it not? A place of conflict and destruction - a place of chaos!",
    "I'm glad to meet someone who's willing to think independently, rather than blindly accept popular beliefs.",
    "I am not here to win converts. Believe what you will.",
    "You have defeated me! The strength of Zamorak - most perfect incarnation of Guthix - is with you!",
    "Indeed it was! And you have earned the information you seek.",
    "The dwarf king believes that the chaos dwarves in this dungeon were created by his enemy, but that is not so. Colonies of chaos dwarves have existed since the Third Age. The dwarf's king enemy can transform dwarves into chaos dwarves, but he does that by unlocking the potential that exists within all dwarves - planted there by Zamorak, most perfect aspect of Guthix. Chaos dwarves are dwarves in their truest, most perfect form. Loyal servants of Zamorak - nothing but chaos in their hearts! Would that the same potential existed in humans and that I could unlock it! Now - you have defeated me. Kill me, and be done with it!",
    "There comes a time when we each grow weak. Thank you for saving me from feeble old age. I will become one with Zamorak and Guthix, like Urval before me.",
    "By killing me, you sow chaos against yourself! Every Zamorakian you kill only allows a stronger one to take their place. Praise be to the chaos god!",
    "Fool! Zamorak despises your weak will.",
    "Praise Zamorak for conflict, friend. Will you not test the strength of my chaos druids? I fear they grow weak and deserve to be cut down.",
    "You have tested my strength once before and defeated me. It was a worthy combat!"
  ],
  "Watchtower Wizard": [
    "Greetings, friend. I trust all is well with you? Yanille is safe at last!",
    "An ogre shaman with memory magic? I didn't think any such creatures existed in this age! An ordinary magic ogre potion will do no good against such a creature. You will need something to repair the damage to the victims' memories. Let me see... Yes! I believe I could make an anti-memory-magic wand, but first I will need your help to complete it.",
    "Before you use it against the ogre shaman, you'll need to help me calibrate the memory wand. I think...hmm, yes, I think you've already been the subject of memory-altering magic. Am I correct?",
    "I'm sure it seems that way to you, but this magic can be quite subtle. Please humour me.",
    "Excellent! If you can identify a memory as incorrect, you're well on the way to restoring it!",
    "I'll project myself into the memory in order to guide you. Are you ready?",
    "To start, you should use the memory wand on each element of the memory that you think is incorrect.",
    "Now you should investigate each void and work out what it originally was, and use the correct fragments on it. If you get it wrong, you'll have to collect the fragments again.",
    "Excellent! The wand worked! The memory you watched play out was how the events really happened! If you think back, you'll find that all the memories that the ogre shaman altered are now restored. The memory wand is finished! You can take it to King Veldaban, with my compliments. I hope it helps!",
    "I heard you managed to defeat that ogre shaman! I'm glad my wand was useful to you."
  ],
  "Red Axe Director": [
    "How did the experiment go?",
    "Excellent! We are improving. Laneel!",
    "Return to Arposandra and tell your superiors we've had a partial success.",
    "Zamorak chaos Zamorak Red Axe Zamorak long live King Hreidmar!",
    "Red Axe chaos Zamorak chaos!",
    "Chaos Hreidmar Zamorak Red Axe! Long live the King!",
    "No humans allowed! Humans! Chaos! Zamorak chaos Zamorak Hreidmar Red Axe!",
    "Red Axe! Red Axe! You join Red Axe! I must be greatest Red Axe director! Makes me greatest Red Axe director in palace! Chaos Zamorak chaos!",
    "Chaos!",
    "Kill kill kill! Kill directors! I will be greatest Red Axe director! For chaos! And Zamorak!",
    "You make me greatest Red Axe director! You go far in Red Axe! You now full member! For chaos and Zamorak and King Hreidmar! Long live the chaos!"
  ],
  "Colonel Grimsson": [
    "The test subjects are still alive, director. They will suffice as soldiers.",
    "Look, here comes the first group!",
    "Guthix damn it, Veldaban! You won! You're king! Why can't you leave us alone?",
    "We've lost the Lava Flow Mine! Veldaban's army will reach the palace soon. We should flee!",
    "We should flee...your majesty.",
    "Shh! What's that? It's the human! He/she followed us!",
    "Go get them, dwarves! For King Hreidmar and the Royal Red Axe! Today we will win the Battle of Barendir!",
    "DIE, TROLLS! DIE! DIE!! DIE!!!",
    "Dwarves! They were dwarves! I killed a troll after he surrendered, and then I attacked dwarves. Why did you make me see it? Why couldn't you let me keep lying to myself? Leave me alone.",
    "And will it...you know...",
    "With pleasure, your majesty.",
    "He didn't have a plan, you idiot! He'd given up!",
    "So after the last time, he holed up here.",
    "You think I want to live after all this? I'm the Butcher of Barendir!  I'll die at Veldaban's hand - as I would have done all those years ago if he'd had the guts to kill me when I went berserk - or I'll kill him and die fighting his army when it reaches the palace. I don't care which.",
    "Stand aside, human. This isn't your fight.",
    "All right, Veldaban. Let's one of us give the other a warrior's death."
  ],
  "Gnome emissary": [
    "I will tell them, but I'd like to see some of your test subjects first, if I may.",
    "Even if it can hear us, it'll soon rationalise this conversation as part of whatever belief system it develops. I've forced it to wipe all its memories about its life in Gu'tanoth. It will believe whatever you tell it. I suggest you say that it was freezing to death on the mountain and you saved its life."
  ],
  "Grunsh": [
    "Lookings likes we's finding da spying creatures'ies![sic]",
    "Is hard! Would be quicker make him think of beers and kebabies.",
    "What happen? Me lost control of magicsies!",
    "No! Grunsh not want remember! You leave  memorieses alones[sic]!",
    "Red dwarf man say he rescue Grunsh from snow! But gnomy man kidnap Grunsh from home!",
    "Grunsh weak. Grunsh learn whole life a lie. If you kill Grunsh, Grunsh not fight you.",
    "Grunsh not want live any more. When Grunsh dead, Grunsh not remember anything. Grunsh think that nice.",
    "Grunsh always remember you mercy.",
    "Who you? Grunsh think Grunsh remember you, but Grunsh not sure.",
    "Grunsh think maybe you kind to Grunsh once...but Grunsh forget.",
    "Grunsh not remember very much. Other ogresies, they say Grunsh arrive one day, they say Grunsh look very tired and sad. They say Grunsh go into cave, say magic-type wordsies, then go to sleep.",
    "Grunsh not remember any of that. Grunsh just remember he wake up in cave. Grunsh not remember what happen before. But Grunsh happy in Gu'tanoth, living with ogresies, Grunsh eat chompy bird and get into fights! Life good!",
    "Grunsh think best not try to work out what happen before. But Grunsh have feeling maybe you kind to him once, so Grunsh want say thank you.",
    "Those things sound nasty and far away. Grunsh just simple ogre, Grunsh not know about those things."
  ],
  "Nulodion": [
    "Hello, human. I think King Veldaban wants to talk to you.",
    "King Veldaban asked me to give you something to deal with any special defences the Red Axe might have. Now, I don't have an evil secret base filled with chaos dwarves, but if I did, I know what I'd use to defend it: cannons! Assuming that the Red Axe cannons are basically like ours, I've come up with a way to deal with them. If you can get to a cannon, slot one of these gears into its rotation mechanism. The gear has a small bomb attached to it which will take the cannon out after a short delay.",
    "Now, I think everything's ready. Fire the cannon when you want to start the attack."
  ],
  "Hreidmar": [
    "Use my title when speaking to me!",
    "No, we will not flee! We have Veldaban, and he is all we need now! Ogre! Hurry with your magic! Veldaban must remember exactly what I specified!",
    "Lumbering imbecile! A king obsessed with beer and kebabs would change nothing! I must have a loyal puppet who will hand me the crown!",
    "Quickly, ogre! Deal with him/her!",
    "Lord Zamorak. I have been awake for three days, searching the records in the sealed chamber. My father showed me how to open the door.",
    "I could trace my family tree back to the secret son of King Alvis. The Red Axe directors are the rightful kings of Keldagrim! I am the rightful heir!",
    "The Consortium has denied me my true heritage!",
    "The face on that statue should be mine!",
    "Yes, Lord Zamorak! It is clear! Put my face on the statue...and Keldagrim will be mine! Keldagrim will be mine!",
    "Lord Zamorak. I have been awake for three days, searching the records in the sealed chamber. My father showed me how to open the door. I could trace my family tree back to the secret son of King Alvis. The Red Axe directors are the rightful kings of Keldagrim! I am the rightful heir! The Consortium has denied me my true heritage! The face on that statue should be mine! Yes, Lord Zamorak! It is clear! Put my face on the statue...and Keldagrim will be mine! Keldagrim will be mine!",
    "... So I was talking to a statue! You think I care at this stage? You ruined my plans, and you won't even leave my illusions? I am the rightful king! Get out of my head!",
    "Are you sure it's unconscious?",
    "Yes, Grimsson. It can get rid of your nightmares. But it can do so much more! I will have an army of dwarves mindlessly loyal to me! Anyone who discovers us can be made to seem a raving drunkard! This dumb ogre will be my most useful servant!",
    "You again! The low-born usurper and his filthy human pet! Your army may be carving its way through my city but I'll have the pleasure of seeing you die! Grimsson! Deal with them!",
    "I am the rightful king of Keldagrim! All I wanted was my birthright! You stopped me, again and again! I would have been a good king - a just king! It was my right! I'm a hundred and forty-eight years old. Even if I were to become a king now, I'd have too little time to enjoy it!",
    "So I turned the Red Axe base into my own city - with my own statue - full of chaos dwarves who would be loyal to me and Zamorak!"
  ],
  "Lieutenant Veldaban": [
    "No trolls will ever enter the Kingdom of Keldagrim - not while the beloved King Hreidmar sits on the throne! Long live the king!",
    "Long live King Hreidmar!",
    "Long live King Hreidmar!",
    "Human! What are you doing here? No humans are allowed. Wait... Player? This is a memory, isn't it? The Battle of Barendir was years ago. That ogre shaman was trying to brainwash me, but you stopped him. I think I'm fine now. Can you feel that? I think we're linked to other minds. Whatever you did with the Watchtower Wizard's wand must have affected everyone in this room. I think you've got some memories to deal with, I'll see you back in the real world..."
  ],
  "Zamorak": [
    "Kneel, my favoured one. Tell me how you have served me.",
    "What did you see?",
    "It is true. The weak, Guthixian Consortium has denied you your true heritage.",
    "The statue of your ancestor King Alvis stands as an insult to your blood. The face on that statue should be yours!",
    "Put away thoughts of peace and balance. When you inherit the Red Axe, you must work to increase your power. Find allies, but do not trust them. Increase your company's power in Keldagrim, but build a centre of power outside the city. Worship me in secret, and at last I will elevate you for all to see. When the time is right, put your face on the statue of King Alvis. All else will follow, and Keldagrim will be yours!"
  ],
  "Chaos Dwarf": [
    "Red Axe members only!"
  ],
  "Chaos dwarf": [
    "Long live King Hreidmar chaos Zamorak chaos Red Axe!"
  ],
  "Greem Gemstone Director": [
    "We have convened a special meeting of the Consortium to address the question of Keldagrim's continuing government."
  ],
  "Blue Opal Director": [
    "The crisis for which Veldaban took emergency powers has been resolved. The Red Axe is defeated! Now that the emergency is over, we can return to Consortium rule.",
    "Now, to business.",
    "I hope you don't regret your decision, Player.",
    "We're not seizing power, Veldaban - we're giving you a chance to step down with dignity. We know you don't want to be king. Leave government of the city to those who know what they're doing."
  ],
  "White Chisel Director": [
    "Veldaban died without an heir, and the line of succession is unclear.",
    "Preserving the monarchy would mean going back into the records chamber and handing power to whomever the records showed to be next in line - no matter how evil or incompetent.",
    "Surely it's better to leave government of the city to those who know what they're doing?",
    "Thank you for seeing wisdom, Player."
  ],
  "Green Gemstone Director": [
    "Your majesty, we have convened a special meeting of the Consortium to address the question of Keldagrim's continuing government."
  ],
  "Purple Pewter Director": [
    "The crisis for which you took emergency powers has been resolved, your majesty. The Red Axe is defeated! Now that the emergency is over, we can return to Consortium rule."
  ],
  "Veldaban": [
    "Supreme Commander Bisi offered me my job back, but I turned it down. A senior Black Guard position would lead to me butting heads with the Consortium, and I'm through with politics. I'm going to stay in Keldagrim for a while, then I'm going to retire from public life and look for a quiet place to live somewhere. Maybe I'll become a miner – that's an honest trade for a dwarf. I'm certainly not going to go wandering the world as an adventurer or anything like that. I'll leave that to younger people."
  ],
  "King Drunken Dwarf III": [
    "Wahay, matey!",
    "That's what whatsername says! Could have been anyone...*hic*... turns out it was me!",
    "Well whatsername used my name, I think, but I got totally sloshed at the post-coronation party and can't remember it. So I've asked everyone to call me 'King Drunken Dwarf'!",
    "The memory what? Oh yes! The thingy you used on the ogre. Whatsername told me about it.",
    "You'd have to go get it first, though, matey!",
    "Sure, why not!",
    "...",
    "Well, have you used it yet? Any time you're ready.",
    "No, mate! Not that I remember! I guess this means that nobody magically tampered with my memories. If I can't remember things, it's just because I'm a bit drunk!"
  ],
  "Player's chosen director": [
    "I hope you understand what you've done, human. You could have convinced Veldaban to step down and let the experts take over. Instead we're saddled with his ridiculous policies again.",
    "Thanks for your support in the meeting, Player. Now Keldagrim can put the silly business of kings behind it and let the company directors manage things properly.",
    "Things could be worse, I suppose. The new king is listening to the Consortium's advice... on the few occasions he's sober enough to understand it."
  ],
  "Supreme Commander": [
    "Thanks for your help in the assault on the Red Axe base, human. I didn't think we had the resources, but with your help and the help of the troll army, we just about pulled it off.",
    "Now, was there anything else you wanted to talk about?",
    "The new king is giving me freedom to run the Black Guard without interference. His only orders were that Black Guards should be given free beer every day, paid for out of the royal treasury.",
    "That's certainly making him popular with the troops. Whether it'll improve our fighting fitness remains to be seen.",
    "Apart from that, things are back to more or less how they were when the Consortium was in charge. I'm keeping guards on the troll border. I don't trust those smelly piles of rocks, treaty or no treaty.",
    "Now that his war with the Red axe is finished, King Veldaban has asked me to review the Black Guard's priorities. He wants more focus on police work across the city, less on defence of the Consortium's assets.",
    "He's also set up a special division to tackle fraud and tax evasion. Sometimes i think he wants to use any excuse to seize the companies' wealth and redistribute it to the people...or to his own treasury.",
    "I'm glad he's letting me keep guards on our border with the trolls, though. I don't trust those smelly piles of rocks, treaty or no treaty.",
    "With the Consortium back in charge, things are going back to how they were before Veldaban became king.",
    "Outside the city, we're focusing on defending the Consortium's mining sites from trolls and goblins. With Veldaban dead, the Consortium isn't expecting his treaty with the trolls to last forever. [note: He says this even when Veldaban is not dead]",
    "In Keldagrim, we're increasing patrols in Keldagrim East to guard against a possible Monarchist uprising. The Consortium has given us powers to break up protests. They don't want a repeat of what happened last time."
  ],
  "Luitger": [
    "Aww, who's my cuddly little snookums?",
    "Aww...such a cute fluffy cat.",
    "One of the Black Guard soldiers found him in the Red Axe base. She couldn't keep him herself, so she gave him to me to look after.",
    "The poor little thing must have been so scared! I'm glad he was rescued and not eaten by a chaos dwarf.",
    "King Veldaban is still doing a great job. I just wish he'd have more parades and statues and things! Meike says he thinks they're a waste of money, but what's the point of monarchy without some pomp?",
    "It was so sad that King Veldaban died. He's a hero of the dwarven people! At least he'll always be remembered in the lists of the kings of Keldagrim.",
    "I loved the new king's coronation ceremony! I got commemorative beer stein with the king's face on it. It's my most prized possession!",
    "I'm sad that we don't have a king any more. Back to the boring old Consortium. Ah well...it was good while it lasted."
  ],
  "Red Axe cat": [
    "Foolish dwarf! Someday you will pay for your disrespect!"
  ],
  "Pretty Flower": [
    "Yeah! We crush smelly chaos dwarves! Knock down chaos dwarf not-Keldagrim! That good fight!",
    "Hmm... We not at war for now, but me not sure we allies. Me not trust dwarves. King Veldaban, he warrior, me respect him, not like sneaky tradey dwarves.",
    "He still in charge for now, but me not trust other dwarves. Me keep eye on border, not let sneaky tradey dwarves in with sneaky poison.",
    "Me sad he dead. New king... me not like him. All he do is invite me to have drink. Me not fall for that! No one poison Pretty Flower that easy.",
    "Now sneaky tradey dwarves back in charge, me not know if things go so well. Me keep eye on border, not let sneaky tradey dwarves in with sneaky poison.",
    "It not easy. Me have to explain carefully to trolls. 'You not kill these dwarves, they friends, but you kill those dwarves, they bad.' Very complicated, make brain hurt. But when we get used to it, it fun! Each army work to own strengths. Friendly dwarves run around, use something called 'tactics'. Trolls go up to bad dwarves and hit them! Me like lady dwarf colonel! She have tiny dwarf lungs but she shout like troll!"
  ],
  "Colonel Grenda": [
    "Come on, you sons of trolls! D'you want to live forever?",
    "The Red Axe unleashed forces they couldn't control, human! This is what happens when you try to play Guthix! These chaos dwarves and dwogres have become a self-sustaining population. They're going to keep coming - all we can do is hold the line.",
    "I'm thinking of it as a training ground for Black Guards. Once you've been face to face with a screaming chaos dwarf waving a tube full of gunpowder, then you can call yourself a dwarven warrior.",
    "It was thanks to you, human! If you hadn't destroyed the cannons and raised the bridges, we'd never have gotten the army across.",
    "After that, the rest of the Red Axe didn't pose much of a challenge. Trolls aren't the brightest bunch, but I'll say this for them - if you point them at a locked door, that door won't last long.",
    "It's just a shame we got there too late and missed your fun with Hreidmar and Grimsson. I'd have liked to give them a taste of my axe!"
  ],
  "Dondakan the Dwarf": [
    "I suppose I should be proud of how incorruptible my son is...but would it kill him to use his royal powers to give his dad's business a helping hand?",
    ": Oh well...I suppose this rock is still providing a steady stream of income for me. After the company takes its cut, of course.",
    "So my son got to be king, and then stepped down! It's like I've always said - the current generation lacks ambition!",
    "His royal powers could have made us both so rich!",
    "I wish I'd spent more time with Veldaban when he was alive, rather than being obsessed with this rock. My only son, and I ignored him because he became a Black Guard rather than a miner.",
    "Since you helped me mine the rock, I've had all the riches I could want...but all the gold in the world won't bring my son back.",
    "Thanks."
  ],
  "Orange Flame secretary": [
    "I hear you finally defeated the Red Axe in their secret base! That's what a company gets for committing treason and leaving the city. The Orange Flame will make no such mistake!"
  ],
  "Drunken Dwarf": [
    "Hahahaha! You won't believe it, matey! You won't...*hic*...believe it! I got so drunk...SO drunk...I thought my cousin was the king!",
    "Oh!",
    "Then this calls for a celebration! Let's have a drink!",
    "Memory wand? You ain't got no memory wand. Maybe you *hic* forgot it. Hahahaha!",
    "My memory? What'sh wrong with my...what was it you said?",
    "Sounds like fun! Go ahead!",
    "...",
    "My goodness! So that was it! Not kebabs - chaos dwarves!",
    "The Red Axe were kidnapping dwarves and trying to turn them into chaos dwarves! But their process was faulty, and the test subjects all died. What a horrible sight!",
    "And their leader, Hreidmar, was carying a staff. A pink...dragon staff. Yes, that was it - a dragon staff, not a pink dragon!",
    "And there were gnomes! I saw gnomes and dwarves working together! The gnomes were carting off huge heaps of gold and valuable ores. It looks like they were trading their magical expertise for dwarven metals.",
    "Human, we must do something! The Red Axe experiments I saw all failed, but if they were to succeed, the Red Axe would have an army of chaos dwarves large enough to conquer Keldagrim!",
    "Come on, human! We must tell Commander Veldaban of the Black Guard!",
    "You did? Then this calls for a celebration! Let me get us something to drink...",
    "Wa-hey, matey! *hic* A toasht...a toasht to...whatever it was we were talking about."
  ],
  "Brundt": [
    "Who?",
    "Oh, yes. Something about them being Red Axe spies, wasn't it?"
  ],
  "Grendt": [
    "Our predecessors. The Black Guard arrested them and took them back to Keldagrim.",
    "Yes. The Red Axe is outlawed, so the ore shipment that Brendt and Grundt were here to collect will be divided between the other mining companies. We're here to make sure it's delivered. Anything else Brendt and Grundt might have been doing, we know nothing about. They may have been spies or they may just have been traders."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Birthright_of_the_Dwarves?oldid=36189562’"
  ]
}