{
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "Some of dialogue.You can discuss this issue on the talk page or edit this page to improve it."
  ],
  "Bert": [
    "Eeee, wha' shall I do! I'll mos' certainly lose tha job...",
    "I w-w-work...over yon sand pit...and weeell...I found...this...hand! T'were buried in't Sand!",
    "They's no' wha' they once was. Tha cap'ain o'the Guard spends near all o'the time drunk in yon pub.",
    "Weeellll...do you think yer could 'elp me?",
    "....Nae, ye can 'have the 'and as h'evidence.",
    "P'raps tha smell will get t'Guard Cap'ain's nose out o'his beer fer 2 seconds!",
    "Did ye see yon Guard Capt'n 'bout hand?",
    "Thank t'gods! I tho' I searched up another when I been pickin' this'un up outside... Take tha' blasted thing to yon Guard Captain quick sharp.",
    "Did ye see yon Guard Capt'n 'bout hand?",
    "So why you hangin' abou' 'ere then? Go ring t'bell at t'mage guild just over yonger!",
    "Thank t'gods! I tho' I was bein invaded by undead 'ands from t'sand when I found this'un! Take i' to tha mage guild and ring tha' bell to talk ta someone.",
    "What info ye find out 'bout hand, Player?",
    "Sand! Lots o' sand! Me boss be Sandy o Sandy's Sand Corp based in Brimhaven on the isle of Karamja an' I hauls sand fr' there to yon sand pit!",
    "I's looong harrrrd hours, bu' keeps me busy, y'know what tha say! 'Idle hands'r Zamorak's tools.'",
    "Nae! See for yersel', here's a copy o' me rota tha' be held a' head office - yer can looksee iffin ye talk t' Sandy, me boss.",
    "Ey'up Player. Did yer see Sandy in Brimhaven 'bout me rota?",
    "Lucky fer yorn tha' I's made a copy then ain't it, 'ere 'ave another.",
    "Nae! Nae! I din't remember tha', bu'... hmmm, aye... tha' migh' be it...",
    "I's all be tha wizard's fault! Tha magic leaks fr'm yon magic guild I tells yer! That's why this weirrrrd scroll appeareded a week ago!",
    "Of course (Player), le's be 'avin'yon rota and 'ere be tha scroll, yer be takin' it back ta those inferrrrnal wizards quick sharp!",
    "I be hopin' tha search is goin' well... are tha wizard's owning up ta anythin' yet?",
    "I's be seein' ya drop it on tha' way out, 'ere 'tis",
    "Arrr...Good news always be handy.",
    "ME JOB! I'VE LOSTED ME JOB! 'ow c'n yer say tha' be good news?? Me wife'll tear me limb fr'm limb!",
    "Bu' wha'll I be doin' wit' me day now! I be lovin' tha sand.",
    "I din't think so... bu' iffen yer ever need someone ta haul buckets o'sand 'round. ye be lettin' me know Player, I's can help yer!"
  ],
  "Player": [
    "Lose your job? What's wrong, why?",
    "Oh, you found a hand in the sand - that's nice for you.",
    "Eww a hand, in the sand! Why haven't you told the authorities?",
    "Oh? The Guard Captain is drunk in the pub you say? That's not good, what will you do?",
    "I want no part in this!",
    "Sure, I'll give you a hand.",
    "Not at the moment, but I will be seeing him soon.",
    "Err, I kind of... lost my grip on it.",
    "Thanks Bert, I'll go see the Guard Captain right now.",
    "Sir? I have some more beer for you...",
    "I've come to report that Bert, the sandman, found a hand in the sand pit.",
    "But aren't you going to find out who it...belonged to?",
    "Err...ok, I'll go ring the bell and talk to a wizard then.",
    "Hello Sir!",
    "I think I should go talk to the wizards in the guild before he makes me buy him more beer!",
    "Yes, the Guard Captain said to see the wizards in the guild.",
    "It seems to have slipped through my fingers!",
    "Thanks Bert, I'm off to see the wizards, the wonderful wizards of Yanille!",
    "But I was told to ring the bell if I wanted some attention.",
    "I have a rather sandy problem that I'd like to palm off on you.",
    "Ummm...Do you have all your wizards?",
    "The Guard Captain asked me to see if you have any...missing...wizards.",
    "Erm...no...",
    "Well...maybe, you see Bert found this hand and it might belong to...a wizard!",
    "Do you have any input as to the matter at hand?",
    "Not yet, but don't lose your head over it.",
    "I dug up quite a lot about the hand. Can you tell me about your job?",
    "So you're employed by Sandy's Sand Corp in Brimhaven. Have you changed your hours recently?",
    "Thanks for the Rota Bert. I'll go check for the original with Sandy in Brimhaven.",
    "Err, no, I kind of... lost it...",
    "No, I'll fit it in my schedule somewhere soon.",
    "Hello Sir, do you run the Sand Corp?",
    "I'm (Player). I'm here investigating the possible murder of a wizard.",
    "I managed to get a copy of the original rota. Your hours changed a week ago!",
    "What? Give me a hand here, I'm having a hard time understanding how you don't remember changing hours!",
    "A scroll appeared? Can I take a look at it while you look at the rotas?",
    "I've found out a lot and will let you know when it's all over.",
    "Err, no, I kind of... lost the scroll...",
    "I talked to Bert and found something very strange about his hours.",
    "No, but he doesn't remember changing his hours, and his rota and the original that his boss Sandy had, are different!",
    "... oh, and this scroll appeared when they changed - he gave it to me.",
    "I took a look around his office. I don't know about a hand in it, I think he has both hands and feet in it!",
    "I've lost my magical scrying orb!",
    "Can you help me more?",
    "I have a vial here for you.",
    "Yes, that would be great!",
    "No, I prefer using my legs, thanks all the same.",
    "I've come from Yanille, the wizard says you can make Truth Serum?",
    "I'll have to find one then, I'll be back!",
    "I have one here!",
    "I'm still working on it.",
    "I'm afraid I've forgotten how!",
    "I've lost my bottle!",
    "Ok, what does that do?",
    "Ok, I'll see if I can find something.",
    "What about this sand straight from his pocket?",
    "I've lost it!",
    "Not yet, but don't bust a gut over it!",
    "There's a herd of huge mutant herring about to drop from the sky!",
    "A small parrot with a pink banana is sitting outside your window!",
    "But the pygmy shrews have eaten all the sand!",
    "Now, I'm going to ask you some questions and I want you to answer me truthfully...",
    "Why is Bert's rota different from the original?",
    "Why doesn't Bert remember the change in his hours?",
    "Why?",
    "What happened to the wizard?",
    "I think I have enough evidence now, you can go for now, but I think you're up to your neck in it!",
    "I got the whole story from Sandy... but I lost the orb",
    "Erm, why?",
    "Umm.. ok, I'll get you the 5 earth runes and bucket of sand.",
    "I've brought what you wanted, what are you going to do?",
    "Hello there!",
    "Uhh.... How do you know my name?",
    "Er.. ok. Well, I've been sent from the Wizards' Guild in Yanille. There's been an... incident... Do you have any body parts?",
    "Ahhh good! I need to take it back to be buried!",
    "What should I do with the head?",
    "I've lost my head!",
    "Bert! Good news!",
    "They arrested Sandy for the murder of the wizard and the sand pit now refills itself!",
    "Don't worry, the Wizards are going to pay you a large pension so that you can retire...",
    "What will you do with your day? Well... You could build sand castles with your own two hands!",
    "Wow! That would be great! Buckets of sand direct to my bank everyday, you say? That's great!"
  ],
  "Guard Captain": [
    "Need more beer...",
    "I hate the schtuff, just gimme a beer...",
    "Ahh... just' wha' I need, now, wha' did you wanna know?",
    "Lucky for him, means he can get even more work done.",
    "Oops, No 'arm done. S'prob'ly a wizard. i's always the wizards fault, go ask them, jus' ring the bell outshide the guild and talk to the first pointy hatted ninny you shee!",
    "Go 'way. This pint'sh nearly finished! Unnlessh you got more that ish....? Wizards, s'all the wizards fault...prob'ly that Zavistic one, he'sh the worsht!",
    "E're, you left this 'and in me beer!"
  ],
  "Zavistic Rarve": [
    "What are you doing ringing that bell?! Don't you think some of us have work to do?",
    "Well...anyway...we're very busy here, hurry up what do you want?",
    "What are you doing...Oh it's you...sorry didn't realise...what can I do for you?",
    "All my...whatever do you mean...?",
    "That's silly! No one would kill a wizard...would they?",
    "Bert? Ah yes, the sandman who seems to have been working for very long hours recently. Let's see that hand...",
    "Oh my! This is most definitely Clarence, my most able student! You must find out who did this!",
    "Well...Ask Bert about the long hours he's been working, that sounds suspicious to me. Digging things up at all hours of the day isn't natural.",
    "Did you find out who killed Clarence yet?",
    "Oh? Did he kill Clarence?",
    "I recognise that type of scroll! It's used in a mind altering spell of some sort. Did you speak to this... Sandy guy? Perhaps he had a hand in this.",
    "Even more suspicious! Here, take this magical scrying orb and get some Truth Serum from Betty in Port Sarim, she owes me a favour, just tell her I sent you if she complains.",
    "Then you will be equipped to ask Sandy a few questions. Oh Clarence, I will find your murderer!",
    "No matter, here, have another and please hurry, whoever killed Clarence must pay!",
    "Bring me a vial and I'll help you a little more.",
    "Ok, would like me to transport you to Port Sarim? I'm sticking my neck out a bit helping you like this and can only do it once though.",
    "Off you go then, break a leg!",
    "Ok, suit yourself!",
    "Unfortunately I've already helped you with one teleport, get some exercise - your legs won't fall off!",
    "Have you made the serum and talked to Sandy yet?",
    "It's ok, I saw the whole thing as the orb is connected via magic to me as I enchanted it.",
    "Well, well...I think this Sandy needs a lesson, please bring me 5 earth runes and a bucket of sand.",
    "Don't question me or you'll end up as braindead as that legless Guard Captain!",
    "You really mean you forgot? Bring me 5 earth runes and 1 bucket of sand to help stop that moneygrabbing Sandy!",
    "Ahh excellent, let's have those! Watch and learn...",
    "There, the sand pit will now magically refill. No more work for Bert!",
    "We must find the rest of Clarence, I've sent some wizards out to some of the sandpits, would you please check the Entrana sandpit?",
    "Did you visit the Entrana sandpit yet? Ask the worker there if he's found an arm or a leg.",
    "Not yet no. I've been running around like a headless chicken, but I'll get to it!",
    "Alas poor Clarence, I knew him well.",
    "Thank you Player, we shall bury him today. I have sent word for the guards to arrest Sandy, so no one will ever see him again!"
  ],
  "Sandy": [
    "Who wants to know?",
    "I don't care about that. I have far too much work to do. Let the authorities take care of things like murder and stop snooping around my office!",
    "I don't have time to talk to you. Go away!",
    "I'm not falling for that one!",
    "I'm not falling for that one!",
    "Wow! I must see this!",
    "Ok...",
    "Because... I changed it.",
    "Because.... because...... I bribed a wizard to put a spell on him so he would believe everything I say!!",
    "So that I could make him work longer without paying him more!",
    "I....I... KILLED HIM! So I wouldn't have to pay him and no one would know. I put his body in the next load of sand."
  ],
  "Betty": [
    "This is true deary, I'll need an empty vial.",
    "That's good, now you'll need to make a rose tinted lens. Pink dye can be made from red berries in this bottle to make redberry juice, then add white berries. Just use that on a bullseye lens.",
    "Hello deary! Have you manage to make that lens yet?",
    "Pink dye can be made from red berries in the bottle I gave you. Add white berries to make the pink dye and then you just need to use that on a bullseye lens. Good luck!",
    "Oh don't worry about that deary, I have plenty and you can start the whole thing again. Here, have another.",
    "Wonderful deary. When you're ready, just stand in the open doorway and focus the light on the empty vial on my desk and I'll pour the serum into it.",
    "Why it makes the person who drinks it unable to hide in the shadow of lies. The light of truth will shine!",
    "Ok, now the last ingredient, something personal from the person you need to tell the truth, else it won't work!",
    "That's excellent deary!",
    "Don't forget to dilute it in something like tea or coffee.",
    "That's not a problem, I kept some of it here just in case, here you are!"
  ],
  "Mazion": [
    "Uh...greetings Player!",
    "Oh, I like to keep ahead of things.",
    "How did you know! I found the most awful thing in my sandpit - a head!",
    "You're very strange, but if it means I get rid of the horrid thing...",
    "I see you still have that head! Take it back to the Wizards in Yanille!",
    "Hello again Player!",
    "It was you that came demanding the head to give to the wizard in the first place! Go back to Yanille with it!",
    "Keep your hair on! You dropped it! Make sure you take it straight back to the wizards else you won't have a leg to stand on."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:The_Hand_in_the_Sand?oldid=33117523’"
  ]
}