{
  "Dr Nabanik": [
    "Hello, old friend. Welcome to the Kharid-et Dig Site. Player, I commend you for freeing Trindine from the shadows here. You could not have acted in a more timely fashion. There is, however, one final thing I would like to discuss with you on this matter...if you would hear it?",
    "That is...disappointing. Please let me know as soon as you are able. Now, was there something else you wished to ask of me?",
    "Player, before we talk of Kharid-et in general, I wished to discuss Trindine with you.",
    "Not here at Kharid-et. You may recall that Lord Zaros tasked me with certain things upon his return... While I have made some progress with these tasks, doing so has meant I was unable to visit here sooner. When Zaros handed me a new directive to uncover Trindine, it was unexpected, though most welcome. Not only have I wished to learn of her fate ever since you freed me from my own prison, but now her service is also required by our lord.",
    "Before you ask, no, I am not privy to the details... I wished only to say a profuse thank you for your aid in this matter. I hope that you will become as much a friend and ally to her as you have become to me. Now, was there something else you wished to ask of me?",
    "You may or may not be aware that a very secure vault sits beneath the sands within Kharid-et. There is something in that vault I require. You are easily experienced enough to access this vault. I only wish to instil in you the same urgency I feel. Restore the relevant spell scrolls you discover here, activate their associated dials and then head to the vault. Please, open it and bring me whatever you discover within. Now, was there something else you wished to ask me?",
    "Hello, old friend. Welcome to the Kharid-et Dig Site. Player, before we talk of Kharid-et in general, I need to dicuss with you a matter of some urgency. I am sure your inquisitive mind is already delving deep into this site's many mysteries, but I am running short of time to uncover my true purpose here. Would you assist me in this as a top priority?",
    "That is...disappointing. Please let me know as soon as you are able. Now, was there something else you wished to ask of me?",
    "You may or may not yet be aware that a very secure vault sits beneath the sands within Kharid-et. There is something in that vault I require. However, I know you are not yet experienced enough as an archaeologist to completely uncover its secrets. Unfortunately, I am on a tight schedule here. As such, I have enlisted other archaeologists on the team here to assist us both. They can do the graft, but I only trust you with this particular task.",
    "Here, you will need these spell scroll artefacts. Around Kharid-et, be on the lookout for any inactive dials - use these scrolls on them to access parts of the vault, open it, and bring me whatever you find inside. You will likely require other artefacts than these to access all the dials - certain pieces of jewellery to pass security barries, for example - but you are more than capable of obtaining these yourself. Now, was there something else you wished to ask of me?",
    "Hello, old friend. Welcome to the Kharid-et Dig Site. Player, before we talk of Kharid-et in general, I wished to discuss Trindine with you.",
    "Not here at Kharid-et. You may recall that Lord Zaros tasked me with certain things upon his return... While I have made some progress with these tasks, doing so has meant I was unable to visit here sooner. When Zaros handed me a new directive to uncover Trindine, it was unexpected, though most welcome. Not only have I wished to learn of her fate ever since you freed me from my own prison, but now her service is also required by our lord.",
    "Before you ask, no, I am not privy to the details... I wished only to say a profuse thank you for your aid in this matter. I hope that you will become as much a friend and ally to her as you have become to me. Now, was there something else you wished to ask of me?"
  ],
  "Player": [
    "I can't right now, sorry.",
    "Was there more you wanted to do than find her?",
    "I can't right now, sorry.",
    "Was there more you wanted to do than find her?"
  ],
  "Congratulations! You have completed": [
    "'The Vault of Shadows (miniquest)' - Complete this Experienced miniquest.",
    "'The Vault of Shadows (miniquest)' - Complete this Experienced miniquest."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:The_Vault_of_Shadows?oldid=36001346’"
  ]
}