{
  "Monk": [
    "Good day to you adventurer, could you spare the time to help me?",
    "Our warriors are facing new and dangerous threats, we need a specially designed weapon to be victorious. If you could help by building one of these weapons you will help to ensure victory is ours.",
    "Yes yes, now pay attention. I need you to take a two handed sword, mithril should do, to Doric's place and grind it down to a slender blade. Once it's flexible enough you should be able to string it with a normal bow string. Bring it back here when you're done.",
    "Ah well, come and see me if you change your mind.",
    "Ah well, our lord is always gracious to those who help him, I'm sure you'd be fittingly rewarded.",
    "Your loss, our lord can be very generous indeed. Come back and see me if you change your mind.",
    "Ah well, come and see me if you change your mind.",
    "Have you brought the weapon for me?",
    "It's a foreign design, maybe later one of our warriors will show you how it's used.",
    "Well hurry along then.",
    "Have you brought the weapon for me?",
    "Ah excellent, this won't be forgotten. You've been a great help, though I wonder if you could do me one final favour.",
    "What are you talking about? I just need you to make a delivery to Entrana for me. There's a special ceremony, which unfortunately I can't attend, and I wanted to give them a gift to mark the occasion.",
    "Not so fast, it's supposed to be a surprise so you'll need to sneak it onto the island. I hear there's some kind of 'other realm' or some such which you've got access to...",
    "Yes that's the one. Now take this orb and put it in one of the large pouches from there, don't want it getting damaged.",
    "It's a foreign design, maybe later one of our warriors will show you how it's used. Speaking of which, may I have it please?",
    "Well hurry along then.",
    "You need to hurry or you'll miss the ceremony.",
    "You what? Ah well, good thing I have a spare, be more careful this time.",
    "What's this large orb?",
    "What's this large pouch?",
    "You won't have it."
  ],
  "Player": [
    "Sure thing, what do you need?",
    "Ooohhh a new weapon!",
    "Sorry, but I'm busy right now.",
    "That depends, what's in it for me?",
    "Ah well in that case, what do you need?",
    "Sorry, but that's not good enough for me.",
    "Sorry, but I'm busy right now.",
    "Can you teach me how to use it?",
    "Not yet, sorry.",
    "It's a Bow and a Sword... how am I supposed to use this?!",
    "Yep, got it right here for you.",
    "Wait... this sounds familiar...",
    "Ok, let's do this then, pass me the present.",
    "You mean the abyss?",
    "Can you teach me how to use it?",
    "Yep, got it right here for you.",
    "Not yet, sorry.",
    "Not yet, sorry.",
    "Er... I lost the orb...",
    "Err...nothing. I'll be going now.",
    "Err...nothing. I'll be going now.",
    "Uh... yeah, about that...",
    "I put it there...",
    "It was supposed to be a gift from a monk near the river Salve.",
    "Not yet...",
    "Not yet. I went back to where that monk was but all I found was a dead body.",
    "Yeah it looked like he'd been killed by magic. I'm not sure if it was the same person either...",
    "Thanks, unfortunately I've got some bad news.",
    "Uh... yeah, how'd you know?",
    "Well there was this monk who needed help...",
    "...so I was told to come see you.",
    "You mean I can learn to use it?",
    "Is there anything I can do to help?",
    "The High Priest of Entrana sent me to talk to you.",
    "Pardon?"
  ],
  "Chat Box": [
    "You grind the blade until it's slender and flexible.",
    "You add a string to the slender blade.",
    "You hide the orb in the pouch."
  ],
  "High Priest": [
    "Protect the relic!",
    "Noooooo! Someone just stole our relic, this is a disaster! Adventurer, you must find the fool who put that teleport beacon on the altar!",
    "What are you trying to say?",
    "Well at least you're honest about it, but where did you get it from?",
    "Those orbs are volatile, they use some very old magic, no worshipper of Saradomin would dare touch one. You must return to this monk and find out more, but be wary.",
    "Have you found our relic yet?",
    "Please hurry, it can't be allowed into the wrong hands.",
    "Many greetings. Welcome to our fair island. Have you found our relic yet?",
    "What?",
    "This is not good, that relic was part of an ancient artefact which was said to have awesome power. You must report to Sir Tiffy in Falador, he must be informed.",
    "Hurry and report to Sir Tiffy."
  ],
  "Info Box": [
    "The poor guy appears to have been killed by powerful magic!"
  ],
  "Sir Tiffy Cashien": [
    "Jolly good show on getting into the White Knights, what? Now, how can I help you, young master/mistress?",
    "Good day, Proselyte. Is there anything I can do for you?",
    "This wouldn't be that old relic being stolen from Entrana would it?",
    "Part of the business, what do you know about what went on?",
    "Good that confirms our own intel and with the designs for that weapon we can work on some tactics.",
    "Ha ha ha, no. At least not yet anyway, we need to know more about what we're dealing with. We still don't know who the monk was and where he got that orb from.",
    "Not yet, but we'll be in touch. Oh and don't worry about that relic, we'll get it back somehow!",
    "Getting a bit ahead of ourselves, aren't we?",
    "Oh, never mind. It'll all make sense when you've done a few more quests."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Devious_Minds?oldid=35773357’"
  ]
}