{
  "King Narnode Shareen": [
    "Welcome Traveller. I am King Narnode. It's nice to see an outsider.",
    "For now.",
    "Traveller, can I speak to you in strictest confidence?",
    "Not here, follow me.",
    "Down here.",
    "These, my friend, are the foundations of the stronghold.",
    "Not just any roots Traveller! These were created by gnome mages eons ago, since then they have grown to become a mighty stronghold!",
    "In the last two months our tree guardians have reported continuing deterioration of the Grand Tree's health. I've never seen this before! It could be the end for us all!",
    "In effect yes. Would you be willing to help us discover what is happening to the tree?",
    "I understand Traveller. Please keep this to yourself.",
    "I'll show you the way back up.",
    "Up here.",
    "Thank Guthix for your arrival! The first task is to find out what's killing the tree.",
    "My top tree guardian, Glough, believes it's human sabotage. I'm not so sure! The only way to know for sure is to talk to Hazelmere.",
    "Hazelmere is one of the mages that created the Grand Tree! He is the only one that has survived from that time. Take this bark sample to him, he will be able to help!",
    "The mage only talks in the old tongue, you'll need this.",
    "It's a translation book, you'll need it to translate what Hazelmere says. Do this carefully! His words are our only hope! You'll find his dwellings high upon a towering hill, on an island east of Yanille. Please make haste.",
    "Up here.",
    "Enjoy your stay with us. There are many things to see in my kingdom.",
    "Traveler, any word from Hazelmere?",
    "Here's another sample, hang on to it this time!",
    "Don't worry, I have more.",
    "Hazelmere lives on an island just south of the Khazard Fight Arena. Give him the sample and translate his reply. I just hope he can help us in our hour of need!",
    "Hello Traveller, did you speak to Hazelmere?",
    "Do you understand what he said?",
    "So what did he say?",
    "Wait a minute, that doesn't sound like Hazelmere! Are you sure you translated correctly?",
    "I'm sorry Traveller but this is no good. The translation must be perfect or the infomation's no use. Please come back when you know exactly what Hazelmere said.",
    "Of course! I should've known! Someone must've forged my royal seal. Hazelmere thought I sent him for the Daconia stones!",
    "Hazelmere created the Daconia stones. They are a safety measure, in case the tree grew out of control. They're the only thing that can kill the tree. This is terrible! The stones must be recovered!",
    "First I must warn the tree guardians. Please, could you tell the chief tree guardian Glough. He lives in a tree house just in front of the Grand Tree. If he's not there he will be at his girlfriend Anita's place. Meet me back here once you've told him.",
    "Here's another sample, hang on to it this time!",
    "Time is of the essence Traveller!",
    "Hello Traveller, did you speak to Glough?",
    "OK. He lives just in front of the Grand Tree. Let me know when you've talked to him.",
    "It's OK Traveller, thanks to Glough! He found a human sneaking around! He had three Daconia rocks on him!",
    "Yes Glough really knows what he's doing. The human has been detained until we know who else is involved. Maybe Glough was right, maybe humans are invading!",
    "Certainly. He's on the top level of the tree. Be careful, it's a long way down!",
    "Hello Traveller. If you wish to talk to the prisoner go to the top of the tree, you'll find him there.",
    "Hello Traveller. So, did you speak to the culprit?",
    "What do you mean?",
    "That's absurd! He's just trying to save himself! Since Glough's wife died he's been a little strange. He would never wrongly imprison someone though! Now that the culprit is locked up we can relax. It's sad but I think Glough was right. Humans are planning to invade and wipe out the tree gnomes!",
    "Who knows? You may have to leave soon Traveller! I trust you but the local gnomes are getting paranoid.",
    "Why? Don't worry about him now the culprit has been caught. I'm sure Glough's resentment of humans will pas with time.",
    "If you're really concerned speak to him.",
    "Traveller please accept my apologies! Glough had no right to arrest you! I just think he's scared of humans. Let me get you out of there.",
    "I know he can be a bit extreme at times. But he's the best tree guardian I have, he has made the gnomes paranoid about humans though. I'm afraid Glough has placed guards on the front gate to stop you escaping! Let my glider pilot fly you away until things calm down around here.",
    "I'm sorry again Traveller!",
    "Glough is looking for you! Leave on the glider now before it's too late!",
    "Traveller, what are you doing here? The stronghold has been put on full alert! It's not safe for you here!",
    "That's an absurd accusation!",
    "That's enough Traveller, you sound as paranoid as him! Traveller please leave! It's bad enough having one human locked up.",
    "Please Traveller, if the gnomes see me talking to you they'll revolt against me.",
    "Glough's scared the whole town, he expects the humans to attack any day. He's even begun to recruit hundreds of gnome soldiers.",
    "Please Traveller, leave before it's too late!",
    "Look, if you're right about Glough I would have him arrested but there's no reason for me to think he's lying.",
    "If these are to be believed then this is terrible! But it's not proof, any one could have made these. Traveller, I understand your concern, I had guards search Glough's house but they found nothing suspicious, just these odd twigs.",
    "On the other hand, if Glough's right about the humans we will need an army of gnomes to protect ourselves. So I've decided to allow Glough to raise a mighty gnome army. The Grand Tree's still slowly dying, if it is human sabotage we must respond!",
    "Please Traveller, take my advice and leave!",
    "Traveller you're wounded! What happened?",
    "What?! Glough?! With a demon?!",
    "Never! Not Glough! He's a good gnome at heart!",
    "Guard!",
    "Go and check out that passage!",
    "I..I don't know what to say! How could I have been so blind?! Guard! Call off the military training! The humans are not attacking!",
    "You have my full apologies Traveller! And my gratitude! A reward will have to wait though, the tree is still dying! The guards are clearing Glough's rock supply now but there must be more Daconia hidden somewhere in the roots! Help us search, we have little time!",
    "Traveller, have you managed to find the Daconia?",
    "The tree will still die if we don't find it! It could be anywhere!",
    "Traveller, have you managed to find the Daconia?",
    "Yes! Excellent, well done!",
    "It's incredible, the tree's health is improving already! I don't know what to say, we owe you so much! To think Glough had me fooled all along!",
    "I'll drink to that! From now on I vow to make this stronghold a welcoming place for all! I'll grant you access to all our facilities.",
    "It should make your stay here easier. You can use the spirit tree to transport yourself, as well as the gnome glider. I also give you access to our mine.",
    "Very few know of the secret mine under the Grand Tree. If you push on the roots just to my north they will separate and let you pass.",
    "That's magic trees for you! All the best Traveller and thanks again!",
    "Well, hello again Traveller! How are you?",
    "Better than ever, thanks to you!"
  ],
  "Player": [
    "Hi! It seems to be a busy settlement.",
    "You seem worried, what's up?",
    "Of course sire.",
    "So what is this place?",
    "They look like roots to me.",
    "Impressive. What exactly is the problem?",
    "You mean the tree is ill?",
    "I'm sorry, I don't want to get involved.",
    "Of course.",
    "I'd be happy to help!",
    "Do you have an idea?",
    "Who's Hazelmere?",
    "What is it?",
    "I'll be off now.",
    "Not yet.",
    "I've lost the bark sample.",
    "I've lost the translation book.",
    "Can you write this down and I'll try and translate it?",
    "Hello again, Your Highness.",
    "Yes! I managed to find him.",
    "I think so!",
    "King Narnode must be stopped, he is a madman!",
    "Praise be to the great Zamorak!",
    "Do you have any bread? I do like bread.",
    "The time has come to attack!",
    "The tree is fine, you have nothing to fear.",
    "You must come and see me!",
    "The tree needs watering as there has been drought.",
    "Grave danger lies ahead, only the bravest will linger.",
    "Time is of the essence! We must move quickly.",
    "There is no need for haste.",
    "A man came to me with the King's seal.",
    "You must act now or we will all die!",
    "Time passes us by.",
    "I gave the man Daconia rocks.",
    "You must use force!",
    "Use a bucket of milk from a sacred cow.",
    "Take this banana to him, he will understand.",
    "Only Adamantite is any use.",
    "All with[sic] be fine on the third night.",
    "You must wait till the second night.",
    "Nothing will help us now!",
    "The tree will die in five days!",
    "And Daconia rocks will kill the tree!",
    "Erm...I think so.",
    "What are Daconia stones?",
    "Can I help?",
    "OK! I'll be back soon.",
    "No, I need to go back. I've lost the bark sample.",
    "Not yet.",
    "Hello.",
    "The King asked me to inform you that the Daconia rocks have been taken!",
    "Apparently a human took them from Hazelmere. Hazelmere believed him; he had the King's seal!",
    "Never!",
    "Hello, Your Highness. Have you any news on the Daconia stones?",
    "Wow! That was quick!",
    "I doubt it, can I speak to the prisoner?",
    "Thanks.",
    "Tell me. Why would you want to kill the Grand Tree?",
    "Don't tell me, you just happened to be caught carrying Daconia rocks!",
    "I don't understand.",
    "Sounds like Glough is hiding something!",
    "OK. Thanks Charlie.",
    "Hello Charlie.",
    "No idea.",
    "Yes I did and something's not right!",
    "The prisoner said he was paid by Glough to get the Daconia stones!",
    "But why?",
    "Hello there!",
    "What do you mean?",
    "Surely not!",
    "Your Highness! I'm concerned about Glough!",
    "I'm not so sure.",
    "Glough! I don't know what you're up to but I know you paid Charlie to get those rocks!",
    "I know the Grand Tree's dying! And I think you're part of the reason.",
    "It's Glough! He's trying to cover something up.",
    "Why?",
    "Thanks Charlie!",
    "I don't think you can trust Glough, Your Highness. He seems to have an unnatural hatred for humans.",
    "Well, OK.",
    "I can't figure this out Charlie!",
    "Apparently, humans are invading!",
    "I don't understand it either!",
    "Take me to Karamja, please.",
    "Not anywhere for now.",
    "What?, why?",
    "That's crazy! Why?!",
    "That's ridiculous!",
    "Where am I meant to be going?",
    "Hello.",
    "Quite a few ships you're building!",
    "Hello.",
    "Hello.",
    "How are you?",
    "You shouldn't work so hard!",
    "Hello.",
    "Quite an impressive set up!",
    "Hello.",
    "I'm new!",
    "Hello!",
    "How are you?",
    "Touchy!",
    "Hello. Looks like hard work?",
    "Hello!",
    "So where are you sailing?",
    "Don't worry, just kidding!",
    "Hello!",
    "Something like that.",
    "Hello!",
    "Hello!",
    "What are you building?",
    "Of course not! You're obviously building a boat.",
    "Hello!",
    "What?",
    "Hello!",
    "Is that any way to talk to your new superior?",
    "Hello!",
    "What's wrong?!",
    "I'm afraid not.",
    "Hello!",
    "I'm just looking around.",
    "Hello. You look busy!",
    "Hello.",
    "What?",
    "I'm trying to open the gate!",
    "I'm from the Ministry of Health and Safety.",
    "You will respect my authority!",
    "Glough sent me.",
    "You're wasting my time! Take me to your superior!",
    "Ka.",
    "Ko.",
    "Ke.",
    "Lo.",
    "Lu.",
    "Le.",
    "Mon.",
    "Min.",
    "Men.",
    "I'm just looking around.",
    "I'll leave when I choose!",
    "Well I'll just stand here then until you let me in.",
    "I will!",
    "Yeah!",
    "...",
    "So are you going to let me in then?",
    "...",
    "You bored yet?",
    "...",
    "Alright you win. I'll find another way in.",
    "Yes I will.",
    "Hello, are you in charge?",
    "Glough sent me to check on how you are doing.",
    "His gnomes are busy.",
    "Er...Glough sent me?",
    "Yes, they're getting on great.",
    "Always arguing as usual!",
    "Sadly his wife is no longer with us!",
    "He loves tangled toads legs.",
    "He loves worm holes.",
    "Anita.",
    "Of course, security is paramount.",
    "Indeed.",
    "That's a lot of troops!",
    "Take over?",
    "No?",
    "OK. I'll head off and give this order to Glough.",
    "Alia.",
    "Alia.",
    "He loves choc bombs.",
    "Orders from who?",
    "Glough!",
    "I can't believe they won't let me in!",
    "I really need to see King Narnode. Could you help sneak me in?",
    "OK, what should I do?",
    "Erm I know, but this is an emergency!",
    "1000 gold pieces!",
    "No chance!",
    "OK then, here you go.",
    "Thanks again!",
    "Can I help?",
    "I'd better get going!",
    "I know what you're up to Glough!",
    "You may be able to make a fleet but the tree gnomes will never follow you into battle against humans.",
    "King Narnode won't allow it!",
    "King Narnode, I need to talk!",
    "Your Highness, I believe Glough is killing the trees in order to make a mass fleet of warships!",
    "His hatred for humanity is stronger than you know!",
    "How are you doing Charlie?",
    "Glough has some plan to rule Gielinor!",
    "I need some proof to convince the King.",
    "Where does she live?",
    "OK, I'll see what I can find.",
    "Hello, Your Highness.",
    "That's crazy!",
    "Don't you understand he's creating his own army?!",
    "I'm going to stop you, Glough!",
    "Hello there.",
    "Yes, I'm helping him with a problem.",
    "Indeed!",
    "I suppose so.",
    "No...thank you!",
    "Hello there!",
    "What do you mean?",
    "Surely not!",
    "You were right! I searched Glough's chest and found some invasion plans!",
    "Hold tight Charlie!",
    "Hi, Your Highness, did you think about what I said?",
    "Look, I found this at Glough's home!",
    "I've lost those twigs you gave me.",
    "Hello?",
    "Anybody?",
    "Glough?",
    "Glough?",
    "You're crazy, Glough!",
    "What makes you think I'll let you get away with it?",
    "Your Highness, it's true about Glough I tell you! He's planning to take over RuneScape!",
    "He plans to make a fleet of warships from the Grand Tree's wood!",
    "It's Glough! He set a demon on me!",
    "Glough has a store of Daconia rocks further up the passage! He's been accessing the roots from a secret passage at his home.",
    "That's what I've been trying to tell you! Glough's been fooling you!",
    "No sign of it so far.",
    "Don't worry, Your Highness! We'll find it!",
    "Is this it?",
    "All that matters now is that humans and gnomes can live together in peace!",
    "Thanks! I think!",
    "Mine?",
    "Strange!",
    "You too, Your Highness!",
    "Hello, Your Highness!",
    "I'm good thanks, how's the tree?"
  ],
  "Hazelmere": [
    "Blah. Blah, blah, blah, blah...blah!",
    "Blah, blah...Daconia...blah, blah.",
    "Blah, blah?",
    "Blah, blah....Daconia...blah, blah."
  ],
  "Glough": [
    "Can I help human? Can't you see I'm eating?!",
    "Surely not!",
    "I should've known! The humans are going to invade!",
    "Your type can't be trusted! I'll take care of this! Go back to the King.",
    "You shouldn't be here human!",
    "The Gnome Stronghold is for gnomes alone!",
    "We don't need your sort round here!",
    "You're a fool human! You have no idea what's going on.",
    "How dare you accuse me! I'm the head tree guardian! Guards! Guards!",
    "You have no idea human!",
    "So, you know more than I thought! The gnomes fear humanity more than any other race. I just need to give them a push in the right direction. There's nothing you can do traveller! Leave before it's too late!",
    "The King's a fool and a coward! He'll bow to me! You'll soon be back in that cage!",
    "You're becoming quite annoying traveller!",
    "Where are those darn keys? Leave human, before I have you put in the cage!",
    "You shouldn't be here human!",
    "The Gnome Stronghold is for gnomes alone!",
    "We don't need your sort round here!",
    "You really are becoming a headache! Well, at least now you can die knowing you were right, it will save me having to hunt you down like all the other human filth of Gielinor!",
    "Bah! Well, soon you'll see, the gnomes are ready to fight, in three weeks this tree will be dead wood, in ten weeks it will be 30 battleships! disease called humanity!",
    "Fool...meet my little friend!",
    "Pay attention when I'm talking to you!",
    "Mummy!"
  ],
  "Charlie": [
    "What do you mean?!",
    "All I know is that I did what I was asked.",
    "Glough paid me to go to this gnome on a hill. I gave the gnome a seal and he gave me some rocks to give to Glough. I've been doing it for weeks, this time though Glough locked me up here! I just don't understand it.",
    "I don't know what he's up to. If you want to find out you'd better search his home.",
    "Good luck!",
    "Hello adventurer. Have you figured out what's going on?",
    "To get to the bottom of this you'll need to search Glough's home.",
    "So they got you as well?",
    "I shouldn't tell you this adventurer. But if you want to get to the bottom of this you should go and talk to the Karamja Shipyard foreman.",
    "Glough sent me to Karamja to meet him. I delivered a large amount of gold. For what? I don't know. He may be able to tell you what Glough's up to. That's if you can get out of here. You'll find him in the Karamja Shipyard, east of Shilo village. Be careful! If he discovers you're not working for Glough there'll be trouble! The sea men use the password Ka-Lu-Min.",
    "Go and see the foreman in the Karamja jungle, there's a shipyard there, you might find some clues. Don't forget the password is Ka-Lu-Min; if they realise that you're not working for Glough there'll be trouble!",
    "I've been better.",
    "I wouldn't put it past him, the Gnome's crazy!",
    "Hmm...you could be in luck! Before Glough had me locked up I heard him mention that he'd left his chest keys at his girlfriend's.",
    "Just west of the toad swamp.",
    "Go to the King and tell him! Finally you have proof. Surely King Narnode will belive[sic] you now and set me free!",
    "I'm not going anywhere!"
  ],
  "Gnome guard": [
    "Come with me, human!",
    "Halt human!",
    "By order of the head tree guardian! You can not leave!",
    "Humans are planning to attack our stronghold. You could be a spy!",
    "Maybe, but that's the orders, I'm sorry.",
    "I'm afraid that we have orders not to let you in.",
    "The head tree guardian, he say's[sic] you're a spy!",
    "I'm sorry but you'll have to leave.",
    "Sire!",
    "We found Glough hiding under a horde of Daconia rocks!",
    "Yes sir!"
  ],
  "Captain Errdo": [
    "Hi. The king said that you need to leave?",
    "I find that hard to believe. I have lots of human friends.",
    "So, where to?",
    "Okay, you're the boss! Hold on tight, it'll be a rough ride.",
    "Okay. I'll be here for when you're ready.",
    "The shipyard is east of here. I thought I saw some buildings on the coast while we were crashing..."
  ],
  "Jogre": [
    "Ug!"
  ],
  "Shipyard worker": [
    "This is just the start! The completed fleet will be awesome!",
    "No time to talk we've a fleet to build!",
    "Hello matey!",
    "Tired!",
    "It needs to be. There's no other way to build a fleet of this size!",
    "Hello there. I haven't seen you before?",
    "Well it's hard work, but the pay is good.",
    "Too busy to waste time gossiping!",
    "I like to keep busy.",
    "What do you mean?",
    "Hello there, are you too lazy to work as well?",
    "I'm just sun bathing!",
    "No time to talk we've a fleet to build!",
    "Are you serious?",
    "I'm getting tired of this!",
    "Breaking my back for pennies! It's just not on!",
    "What do you want?",
    "Oh, I'm sorry, I didn't realise!",
    "Ouch!",
    "I cut my finger!",
    "Do you have a bandage?",
    "That's ok, I'll use my shirt.",
    "Can I help you?",
    "Well there's plenty of work to be done, so if you don't mind...",
    "Of course. Sorry to have disturbed you.",
    "We need double the men to get this order out on time!",
    "I've had enough of this!",
    "Breaking my back for pennies! It's just not on!",
    "Hey you! What are you up to?",
    "I can see that! Why?",
    "Never 'erd of 'em.",
    "Get out of here before I give you a beating!",
    "Hmm...really? What for?",
    "OK. Password.",
    "You have no idea!",
    "Sorry to have kept you.",
    "This ain't a museum! Leave now!",
    "Well you're not on the list so you're not coming in. Go away.",
    "You do that!",
    "Yeah?",
    "...",
    "No.",
    "...",
    "No. I can stand here all day.",
    "...",
    "No you won't.",
    "I'm not starting that again. Maybe if I ignore you you'll go away..."
  ],
  "Foreman": [
    "That's right, and you are...?",
    "Right. Glough sent a human?",
    "Hmm...in that case we'd better go to my office. Follow me.",
    "Tell me again why you're here.",
    "By the way how is Glough? Still with his wife?",
    "Really? That's odd, considering she died last year.",
    "Die imposter!",
    "Die imposter!",
    "Right answer. I have to watch for imposters. What's Glough's favourite dish?",
    "Our survey said.... Bzzzzzz! Wrong answer!",
    "Die imposter!",
    "OK. Just one more. What's the name of his new girlfriend?",
    "Well, well, you do know Glough. Sorry for the interrogation but I'm sure you understand.",
    "As you can see things are going well.",
    "When I was asked to build a fleet large enough to invade Port Sarim and carry 300 gnome troops I said: 'If anyone can, I can.'",
    "True but if the gnomes are really going to take over Gielinor they'll need at least that.",
    "Of course, why else would Glough want 30 battleships? Between you and me I don't think he stands a chance.",
    "I mean, for the kind of battleships Glough's ordered I'll need tons and tons of lumber! Still, if he says he can supply the wood I'm sure he can! Anyway, here's the order for the lumber.",
    "You almost had me fooled!",
    "Die imposter!",
    "You almost had me fooled!",
    "Die imposter!",
    "Our survey said.... Bzzzzzz! Wrong answer!",
    "Die imposter!"
  ],
  "Femi": [
    "I don't believe all this rubbish about an invasion. If mankind wanted to, they could have invaded before now.",
    "Well, as you helped me I suppose I could. We'll have to be careful. If I get caught I'll be in the cage!",
    "Jump in the back of the cart. It's a food delivery, we should be fine",
    "Why should I help you, you wouldn’t help me!",
    "So was lifting that barrel! Tell you what, call it a round 1000 gold pieces.",
    "That’s right, 1000 and I’ll sneak you in.",
    "Alright, jump in the back of the cart. It's a food delivery, we should be fine.",
    "OK traveller, you'd better get going.",
    "That's OK, all the best.",
    "Now, to get this lot to the Grand Tree!",
    "No, you're OK traveller. I can manage from here."
  ],
  "Anita": [
    "Oh hello, I've seen you with the King.",
    "You must know my boy friend Glough then?",
    "Could you do me a favour?",
    "Please give this key to Glough, he left it here last night.",
    "Thanks a lot."
  ],
  "King narnode shareen": [
    "Here take these, I don't see how it will help though."
  ],
  "King Narnode Sgareen": [
    "I'm sorry Traveller but it's just not realistic. How could Glough, even with a gnome army, take over?",
    "That's enough Traveller! I've no time for make believe. The tree's still dying. I must get to the truth of this!"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:The_Grand_Tree?oldid=35623644’"
  ]
}