{
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "Additional dialogue options. Reference to 'RuneScape' needs checkedYou can discuss this issue on the talk page or edit this page to improve it."
  ],
  "Grubfoot": [
    "Please let me in Dorgesh-city!",
    "[Player]! I so glad you here! You help me get into Dorgesh-city? I want talk to Chosen Commander.",
    "Yea, that her. I have dream about her, remember, before you come to Goblin Village. She Chosen Commander who lead all goblins to new age. Generals still not sure, but Grubfoot sure. She Chosen Commander!",
    "Yes, that right. Wait...you just insult me?",
    "Thank you, [Player]! I promise I be no trouble.",
    "Will you take me into Dorgesh-city now?",
    "Okay, I go back to wait in Dorgesh-mines.",
    "I want go into Dorgesh-city, not go that way. I meet you back at Dorgesh-mines.",
    "Hello, [Player]! Will you take me into Dorgesh-city now?",
    "So big...so many Dorgesh-goblins...",
    "Okay, I go back to wait in Dorgesh-mines.",
    "I looking for Chosen Commander!",
    "I not make any trouble!",
    "I not mean any harm. Just here to see Chosen Commander.",
    "Where is Chosen Commander?",
    "Yes. Zanik is Chosen Commander.",
    "Big High War God! He choose Zanik to lead all goblins into new age!",
    "Nothing wrong with my eyes.",
    "I looking for Chosen Commander.",
    "I looking for Chosen Commander.",
    "No! Chosen Commander!",
    "Yes! Chosen Commander!",
    "Want to talk to Chosen Commander.",
    "Chosen Commander?",
    "Yes, I am goblin.",
    "Yes. You Chosen Commander. Other goblins not believe, but I believe.",
    "They say Zanik not true goblin. She cannot be Chosen Commander because she not worship Big High War God. Because she not think war good.",
    "But does that mean she have no destiny? Perhaps her destiny to lead goblins into new age of peace.",
    "Goblin legend. Hopespear, long ago goblin, he have dream. He say some day Chosen Commander come, lead all goblins to new age. Most goblins, they think Chosen Commander lead goblins to war and fight other races. But I think maybe not. I have dreams that Zanik is Chosen Commander. Before you visit Goblin Village I dream about Zanik. And now, last night I have new dream.",
    "To tell Chosen Commander about new dream I have.",
    "I have dream of far-off land. It like no land I ever see, but somehow I know it. It cool and wet. Ground is soft, big plants everywhere, red water bubbling. I see goblins, many goblins. Goblins of all tribes, but they not fight. They have no weapons. They live in peace. Then I see Chosen Commander. She stand at entrance to new land. She show way in. She lead all goblins on long journey to new land. I never see land before. I see it only in dream. But somehow I know what it is. It Yu'biusk, Land of the Goblins.",
    "That goblin legend. Land of Goblins. Legend say long ago, even before war of gods, goblins come from Yu'biusk. Big High War God find them in Yu'biusk and take them to other lands. Most goblins forget legend. Think only of war. But I think, if Zanik lead us back to Yu'biusk, maybe we have peace. Maybe we be safe from people who want to kill us.",
    "Most do, but not me. I see goblins kill goblins, humans kill goblins. I think, is this really best thing in life? I not say that to other goblins. They kill me if they think I not like war.",
    "This dream not like other dream. It so real.",
    "It's not just dream! It true! I know in heart!",
    "Thank you, [Player]. I know you believe me!",
    "I not know. Not know any goblin who know. But...",
    "I should not tell! Not in front of non-goblin!",
    "I suppose... but you must promise to keep goblin secret. There secret place. Secret temple to Big High War God. No one know of it but goblins. Priests in secret temple, I think they know way to Yu'biusk. But before I tell you where temple is, you must make promise. Promise not to tell any other non-goblins where temple is. If humans find out, maybe they attack, kill all goblins in temple.",
    "[Player], you must promise as well. That very important.",
    "I trust you, [Player]. You save village from H.A.M. Now I tell you where temple is. It built long ago, on Plain of Mud. It sink into mud and now it underground in muddy caves. It far west of here, near place where many humans catch fish.",
    "I can't go. I must get back to Goblin Village before generals miss me."
  ],
  "Mistag": [
    "I'm sorry, but surface goblins are not allowed into the city.",
    "Our laws don't allow surface goblins to enter. The council made an agreement to let humans from the surface into the city, but there was no such agreement about goblins. The council wants to extend a hand of friendship to surface goblins, but we have heard that they are a very warlike people. Most of the Dorgeshuun think that letting them into the city now would be going too far.",
    "Rules are rules. I'm sorry, [Player].",
    "I'm afraid I will have to.",
    "Hmm... If you are prepared to vouch for him, then I suppose we can trust him. Very well, Grubfoot. You may enter Dorgesh-Kaan, but you must stay with [Player] until you leave."
  ],
  "Player": [
    "Chosen Commander? You mean Zanik?",
    "Mistag, why won't you let Grubfoot into the city?",
    "Grubfoot is a very puny goblin. He's no threat at all!",
    "So you're just going to make Grubfoot wait out here?",
    "I'll take responsibility for Grubfoot. I know he won't cause any trouble.",
    "Follow me.",
    "You two can sort this out yourselves.",
    "You two can sort this out yourselves.",
    "Follow me.",
    "I need to do something else.",
    "Follow me.",
    "I don't have time right now.",
    "Follow me.",
    "I need to do something else.",
    "He means Zanik.",
    "Mistag said that Grubfoot could come in as long as he stayed with me.",
    "But...you're a goblin.",
    "He means Zanik.",
    "He means Zanik.",
    "It's okay! Zanik isn't in league with any war god.",
    "Grubfoot, you probably shouldn't mention the Big High War God down here. He's not exactly popular with the Dorgeshuun.",
    "Grubfoot is a goblin from the surface. They all have eyes that size.",
    "He means Zanik.",
    "He means Zanik.",
    "Hello, Zanik! There's someone here to see you.",
    "Why don't other goblins believe?",
    "What is the Chosen Commander?",
    "What was this new dream?",
    "So why have you come to talk to Zanik?",
    "What was this dream?",
    "Yu'biusk?",
    "That's an unusual sentiment for a goblin.",
    "How do you know your dream was true?",
    "How do you know your dream was true?",
    "It's just a dream. It doesn't mean anything.",
    "I think it must mean something.",
    "I promise not to tell anyone where the temple is.",
    "I'm ready.",
    "I'm not ready.",
    "I won't promise that.",
    "I don't know.",
    "Follow me.",
    "I need to do something else.",
    "But you said we could go in.",
    "Is this the entrance to the secret goblin temple?",
    "They wouldn't let me into the temple. They let Zanik in, but not me.",
    "How can I get into the temple without being a goblin?",
    "What? But you said you had a way.",
    "Can you teleport me to the temple again?",
    "Okay.",
    "I'll have to go get the law runes and molten glass, though. (when you don't have the items)",
    "Never mind, I'll walk.",
    "Can I buy a teleport sphere, please?",
    "Tell me more about this 'makeover'.",
    "Sure, do it.",
    "No, thanks.",
    "Cool amulet! Can I have one?",
    "Can you turn me into a goblin?",
    "I need to slip past some goblin guards.",
    "I promised not to tell anyone.",
    "I just like goblins.",
    "Can you turn me into a goblin or not?",
    "Actually, I don't want to be a goblin.",
    "I just like goblins.",
    "I need to slip past some goblin guards.",
    "Can you turn me into a goblin or not?",
    "Actually, I don't want to be a goblin.",
    "Actually, I don't want to be a goblin.",
    "Yes. She told me how to make a goblin transmogrification potion.",
    "Yes. He told me how to make a goblin transmogrification potion.",
    "Can you teleport me to the temple again?",
    "Can I buy a teleport sphere, please?",
    "Me want get into temple.",
    "Yes, I'm [Goblin Name].",
    "Thank you.",
    "Guess again.",
    "Actually, I don't want to go into the temple.",
    "I'd like to get into the temple please.",
    "Nothing. Never mind.",
    "Can you tell me about Yu'biusk?",
    "I understand the ways of the Big High War God.",
    "I'm ready for the test.",
    "True.",
    "The Big High War God commands it.",
    "Otherwise they would lead us astray.",
    "I don't know.",
    "False.",
    "The Big High War God commands it.",
    "Goblins should not fight against goblin.",
    "We should try to convert them instead.",
    "I don't know.",
    "I don't know.",
    "True.",
    "We taught ourselves to be mighty!",
    "Some other god made us mighty.",
    "We are naturally mighty warriors.",
    "False.",
    "He chose us for some other quality.",
    "Goblins were not mighty warriors before he chose us.",
    "Goblins are not mighty warriors.",
    "I don't know.",
    "True.",
    "Big High War God rewards victory.",
    "Big High War God teaches us to think for ourselves.",
    "Planning is part of war and all parts of war are good.",
    "False.",
    "That's one of the commandments.",
    "The Big High War God controls the outcome of the battle.",
    "Goblins are stupid and would make poor plans.",
    "I don't know.",
    "I don't know.",
    "Lead all goblins to the promised land of Yu'biusk.",
    "Lead goblins to victory over the whole world.",
    "Destroy the world.",
    "Make goblins fight one another.",
    "I don't know.",
    "I'm not ready for the test.",
    "It's not for me, then.",
    "Where is Zanik?",
    "Never mind.",
    "Where is Zanik?",
    "She's a Dorgeshuun goblin.",
    "She's the Chosen Commander.",
    "Can you tell me about Yu'biusk?",
    "Will goblins ever return to Yu'biusk?",
    "Where is Yu'biusk?",
    "Where can I find him?",
    "Oh well.",
    "What? But you said he was dead!",
    "Can I talk to the old high priest?",
    "What is the Big High War God's true name?",
    "You do know Bandos is dead, right?",
    "He fought Armadyl on Gielinor. Armadyl killed him, turning him into stone with a cannon powered by divine energy.",
    "But you can go and see what's left of him! His head's there near the G... near our village.",
    "Why are there only six tribes in the temple? What happened to the other tribes?",
    "How can I get into the tribal rooms?",
    "Where can I get dye?",
    "Can I take your test again?",
    "Never mind.",
    "Hey, you're a witch aren't you?",
    "You mad old witch, you can't help me.",
    "So what is actually in that cauldron?",
    "What could you make for me?",
    "What do you need to make red dye?",
    "What do you need to make yellow dye?",
    "What do you need to make blue dye?",
    "Can you make black or white dye?",
    "Then how can you colour your clothes white?",
    "Okay remove the dye from this goblin mail please.",
    "Yeah, I was just about to do that.",
    "I don't think I have all the ingredients yet.",
    "I can do without dye at that price.",
    "Where can I get the whitefish?",
    "What other colours can you make?",
    "No thanks, I am happy the colour I am.",
    "Can you make dyes for me please?",
    "I don't have one of them.",
    "What do I need that for?",
    "I need to catch a Hemenster whitefish.",
    "Zanik! It's me, [Player]!",
    "I turned myself into a goblin so I could get in here!",
    "I have a teleport sphere here.",
    "Why did you get put in prison?",
    "Have you learned anything about Yu'biusk?",
    "How can I rescue you?",
    "Sit tight. I'll be back soon.",
    "[Snothead/Snailfeet/Mosschin/Redeyes]!",
    "Where is Yu'biusk?",
    "What was your predecessor's name?",
    "Why did you attack me?",
    "What's it like being dead?",
    "Goodbye.",
    "Strongbones!",
    "Where is Yu'biusk?",
    "What was your predecessor's name?",
    "Why did you attack me?",
    "What's it like being dead?",
    "Goodbye",
    "I defeated all the undead high priests in the crypt, and the last one told me how to reach Yu'biusk. He said Yu'biusk was another plane of existence, but if the barriers between the planes were ever breached, goblin blood would call out to Yu'biusk and create a portal to there.",
    "But how could we breach the barriers between the planes?",
    "That's a fairy ring. They're part of the fairies' teleportation network. (unknown conditions)",
    "The high priests didn't know exactly. Thousands of years.",
    "I don't know! She just vanished!",
    "We've got to get back there. We've got to rescue Zanik!"
  ],
  "Guard": [
    "What are you doing in the city, surface goblin?",
    "Commander of the guard?",
    "Zanik's not any kind of commander. She'd never fit into a command structure, she's too independant.",
    "Anyway, I think I saw her with Oldak earlier. You should check his workshop.",
    "I'm keeping an eye on you, surface gobiln.",
    "A surface goblin in the city? That's against the rules!",
    "Carry on, then. But I'm keeping an eye on you.",
    "Pass, brother!",
    "Praise Big High War God!"
  ],
  "Cave goblin": [
    "Eek! A goblin!",
    "Yes, but a goblin from the surface.",
    "Chosen Commander?",
    "Zanik? I should hope that fool isn't in command of anything!",
    "Hello?",
    "Who?",
    "Oh? Chosen by whom?",
    "The war god? Oh no!",
    "What happened to your eyes?",
    "Oh! Welcome to the city, surface gobiln! What are you doing down here?",
    "Zanik? She's no commander.",
    "I think she's in Oldak's workshop at the moment."
  ],
  "Captain Undak": [
    "Surface goblin. Who let you in?",
    "I'm commander of the guard. What can I do for you?",
    "Zanik? A commander! Ha ha ha!",
    "Zanik's a great kid - best shot with a crossbow I've seen - but she couldn't command anything.",
    "I think she's in Oldak's lab right now, messing about with runes."
  ],
  "Oldak": [
    "You must be a goblin from the surface! What are you here for, surface goblin?",
    "Ah yes, that's your name for Zanik, isn't it? Well, she's right here.",
    "Remarkable! You must be a goblin from the surface, correct?",
    "Yes, how do you know? Dorgeshuun scientists and philosophers generally believe that dreams are a way for the mind to sort through memories. There is no known mechanism by which they can predict the future.",
    "I'm sorry, Grubfoot, but wanting something badly doesn't make it true.",
    "If that is what is required to keep your temple safe, then I promise as well.",
    "Hmm... I believe that I know which cave system you mean. I can make teleport spheres to take you there.",
    "Oh, that's a pity. Just a minute... Here, break this sphere on the ground. It will take you back to Goblin Village. [Player], Zanik, are you ready to leave?",
    "Hello, [Player]. What did you find in the secret goblin temple?",
    "Hmm... that is an interesting problem. But I think there is a way to get you in.",
    "Perhaps you can't.",
    "Yes, I think you can get into the temple, but not without being a goblin. I have been in correspondence with some of the wizards who live on the surface. One of them might be able to help you. She... or he... calls him or herself the Makeover Mage. You should go and talk to him, or possibly her.",
    "I can, but I can't afford to keep doing it for free. If you give me two law runes and a piece of molten glass I'll make a sphere to take you there.",
    "Hello, [Player]. Did you talk to the Makeover Mage?",
    "Excellent! You should use it to get into the secret goblin temple.",
    "Excellent! You should use it to get into the secret goblin temple.",
    "Another plane? You mean goblins aren't native to RuneScape? That's remarkable. Think of the historical implications...",
    "Yes... that sample you showed me had properties very similar to the active ingredient in 'law' runes. I believe that the fungus ring could create an effect similar to my Moving-Over-Distance Spheres.",
    "If it can create a Moving-Over-Distance effect then, with enough power, we should be able to break the planar barriers. All we need to do is activate it without any destination set, with Zanik standing next to it, and it should open a portal to Yu'biusk!",
    "We should see if this works before we tell anyone else. I think I can create an apparatus to open the fungus ring. Come on, Zanik. [Player], will you meet us by the fungus ring to the south of the city? You should be there to see what happens.",
    "Ah, [Player]. The machine is nearly ready. When I activate the machine, it will bombard the fungus ring with magical energy. But the power will have to be distributed correctly between the three circles of fungus. I need to handle the activation. [Player], could you please handle the distribution of power between the rings? The inner ring is two zurgs wide, the next one is four zurgs, and the outer one is six zurgs wide. You will need to distribute the power in proportion to the area inside each ring.",
    "Something must have gone wrong. This isn't what Grubfoot described.",
    "But it's so barren. What happened here?",
    "You two should explore. See if you can find any more information. I'll stay here and shout if the portal starts to close.",
    "Zanik! [Player]! The portal is starting to close! You don't have much longer!",
    "The portal is closing! You've got to get back NOW! [Player]! What happened? Where's Zanik?",
    "There is no time to find her. The portal will close any second.",
    "There's no way to rescue her, [Player]. I'm sorry. When the portal closed, it was as if the fungus ring was becoming resistant to my machine. Opening the portal again now would take more power than there is in the whole of Dorgesh-Kaan. If you can find some other way to use the fairy rings, maybe you could look for Zanik. But even then you might not be able to find her. Whatever's happened to Zanik, wherever she is... she's on her own."
  ],
  "Zanik": [
    "Hello, [Player]!",
    "I recognise you. You were at Goblin Village, weren't you? You said you had that dream about me.",
    "I certainly don't!",
    "Yes, what was it?",
    "Yes. I thought all surface goblins thought war was good.",
    "What do you think, [Player]?",
    "Even so...if there's any chance there might be something in it, we have to investigate.",
    "So where is this promised land, Grubfoot? (identical to the other options)",
    "So where is this promised land, Grubfoot?",
    "But what?",
    "[Player] is a friend. You can tell [him/her].",
    "I promise, Grubfoot. I won't tell anyone where the temple is.",
    "I'm ready.",
    "Then let's go!",
    "I'll wait for you to be ready, then, [Player]. I don't want to go without you!",
    "I want your help with this, [Player]. If you won't promise to keep the temple secret then I won't go there.",
    "It's probably nothing, but if there's even a small chance there's something in it, we have to investigate.",
    "So where is this promised land, Grubfoot? (identical to the other options)",
    "The entrance to the secret temple must be around here somewhere, [Player].",
    "I'm Zanik of the Dorgeshuun.",
    "Yes please!",
    "What do you want now?",
    "[Player]?",
    "Oh! Thank you, [Player]! I knew you'd come to rescue me!",
    "Oh, thank you, [Player]! I shouldn't try coming back in here, so it's all up to you now to find the way to Yu'biusk!",
    "I said the wrong things to the high priest. The high priest said he would answer my questions if I passed a test about goblin religion. But I didn't know how to answer! I don't know anything about goblin religion! They were already suspicious of me because I was a cave goblin rather than a surface goblin. So when I couldn't answer, they locked me up in here.",
    "I'm sure the high priest knows something. He said he would tell me if I passed his test. But I failed, so I'm in here.",
    "I just need a Moving-Over-Distance Sphere. The goblins confiscated mine when they put me in here. They didn't know what it was, and they were frightened that it might explode if they broke it. So they put it away in one of the crates around here.",
    "How are you getting on in the temple? Have you found out where Yu'biusk is?",
    "I know! The fungus ring in the southern caves! Didn't you say it had magical properties, Oldak?",
    "I can't believe this! If we can reach the goblin homeland, Grubfoot and the other goblins will be able to go there and be safe! [Player], this is my destiny! I'm sure of it.",
    "Oldak! It's working!",
    "No, this is the place. I can sense it.",
    "The Big High War God happened. [Player], how long ago did the goblins come from Yu'biusk?",
    "That vision that Grubfoot had – it was of Yu'biusk thousands of years ago. This is what happens when the god of war has his way with a place for thousands of years.",
    "What's that? Quickly, [Player], we can look at it before the portal closes.",
    "Help me get this open, [Player]! There's something important in here, I'm sure of it!",
    "What's happening? [Player]!"
  ],
  "Goblin guard [1]": [
    "Who you?",
    "Me hear Dorgesh tribe return from below ground.",
    "You goblin, you come in.",
    "No, we say Dorgesh-goblin go in. You human, you go away!",
    "Go away, human!",
    "No, Def'nitly not. There no secret goblin temple.",
    "Nothing. We not guarding anything. There no secret goblin temple.",
    "Yes, but me try to fool human. Get him to go away.",
    "Idiot.",
    "No wait, I guess. Is it [Goblin Name]?",
    "Ha ha! Me knew me guess right!"
  ],
  "Goblin guard [2]": [
    "Dorgesh-tribe?",
    "You want get into temple, Dorgesh-goblin?",
    "Human! Where you think you going?",
    "Humans not allowed! Only goblins allowed!",
    "What? Then what we guarding then?",
    "But...me was just down there earlier.",
    "Oh me see. Human, you go away. We not let you in to secret temple that not down these stairs.",
    "What you want?",
    "What your name, goblin?",
    "You go into temple now, [Goblin name]."
  ],
  "Make-over Mage": [
    "Hello there! I am known as the Makeover Mage! I have spent many years researching magicks that can change your physical appearance. I call it a 'makeover'. Would you like me to perform my magicks on you?",
    "Into a goblin? What do you want to turn into a goblin for?",
    "Really? What are they guarding?",
    "Okay, okay, sorry I asked.",
    "What a strange thing to want to turn into.",
    "I think I know how, but I've never deliberately transmogrified someone into another species before. It's a very risky procedure and I don't want to be held responsible if it goes wrong. I'll tell you the recipe so you can make the potion yourself. You'll need some pharmakos berries; they are the special ingredient I use to transmogrify people. Make a potion with them and toadflax, like this...",
    "Now, when you've made the potion, remember that the transmogrification is very delicate. It will reverse itself if you are in direct sunlight or if you perform a strenuous activity like fighting. It will also reverse itself if you try to wear anything that goblins don't normally wear. You should only drink it in the area you're going to need it, so you don't waste it."
  ],
  "High Priest": [
    "May the Big High War God fill your eyes with hate for his enemies!",
    "May the Big High War God fill your soul with the glory of war!",
    "May the Big High War God fill your arms with strength to do his bidding!",
    "May the Big High War God fill your heart with courage to die for him!",
    "May the Big High War God clear your mind of all thoughts!",
    "That knowledge not for ordinary goblin. Only those who understand ways of Big High War God may learn secret.",
    "Do you? You must prove it to me. Pass test.",
    "Then I begin test. True or false: those who do not believe in Big High War God, whether they goblins or other races, must die.",
    "Oh? Why?",
    "'Not to doubt Big High War God! Doubters must die!' This mean we slay goblins who not believe. 'Always to slay enemies of Big High War God! Enemies must die!' This mean we slay other races who not believe.",
    "That wrong! No true goblin be led astray by those who not believe. If goblin led astray, that goblin deserve to die!",
    "I think you weak in faith, if you think you be led astray. You go now, think on this, be stronger in faith.",
    "Oh? Why not?",
    "Big High War God command we NOT kill enemies?",
    "You not understand Big High War God at all! You like filthy, stinking cave goblin! Go away and think on how stupid you are!",
    "It true that prophet Hopespear tell us goblin should not fight against goblin. But Big High War God, He command that those who not believe must die.",
    "To little mind, weak mind, this seems to contradict. But only if you not have faith. In Big High War God there no contradiction.",
    "Convert them?",
    "You stupid goblin! You not even know name of god. He Big High WAR God! We kill enemies, not convert!",
    "Second question. True or false: Big High War God chose goblins to be his race because goblins mighty warriors.",
    "Really? Then how we come to be mighty warriors, before Big High War God find us?",
    "Fool! Heretic! You guilty of sin of pride! Goblins teach selves nothing. All good we have come from Big High War God!",
    "You confused. Yes, in time of great wars, some goblins serve other gods. But no one make us mighty but Big High War God.",
    "Look around at how mighty we are! How we proud of war, how we never flinch from battle or pain or death, how we never surrender of show mercy or pity!",
    "How could any other god but Big High War God do this?",
    "Naturally? Ha ha ha!",
    "Let me tell you what goblins are naturally! We tiny, we weak, we cowardly, we love peace and not war! All that is good, that is strong, that is powerful, we get from Big High War God! Go away and remember this.",
    "Oh? Why you say that?",
    "What other quality important, except that we great warriors?",
    "Get away, silly goblin! Too much drink muddle brain, give you strange thoughts!",
    "That good! Goblins mighty warriors now, but that only because Big High War God make us so! Without Big High War God we nothing! Remember that.",
    "How dare you? You insult goblin race in holy temple! We mighty warriors becasue we worship Big High War God!",
    "Goblins like you, who say we not strong, you are thing that make us weak! Never doubt, never question, never think! That way of Big High War God.",
    "Third question. True or false: goblin leaders should be good at planning in order to win battles.",
    "Oh? Why you say that?",
    "Even victory that comes through clever dirty tricks? Even victory that comes through breaking Big High War God's commandments?",
    "No. Not all victory honour Big High War God.",
    "What? Where you hear that?",
    "You think for yourself, you maybe think stupid, dangerous thoughts. You maybe think war not good, or Big High War God not best god.",
    "No. Do not think for self. Think only thoughts of Big High War God. His thoughts perfect, so if you think different thoughts, those thoughts bad. That why Big High War God command, 'Not to make own plans. Thinkers must die.'",
    "You confused. It true all parts of war are good, but not all parts of war are for goblins.",
    "Big High War God not make us commanders. He make us solders, and send commanders to lead us. They make plans for us. We not have commander now, but still we must not make own plans.",
    "Why not?",
    "That right. 'Not to make own plans. Thinkers must die.'",
    "That true. But it true whether goblin leaders make plans or not. So it not answer question.",
    "You call me stupid? Big High War God make goblins perfect! Big High War God tell us not make plans, but if we make plans, they be best plans ever!",
    "Last question. Prophecy say some day Big High War God send Chosen Commander. What Chosen Commander do?",
    "Yu'biusk? You have story wrong way round!",
    "Yu'biusk land all goblins come from. But there no prophecy we go back there.",
    "That right! And war will end in victory and victory last forever! You have passed test. Now I answer questions.",
    "Destroy world? Why Big High War God want to do that? Then there be no goblins to fight for him!",
    "Ha ha ha! Big High War God not need send commander to do that! Only reason goblins not fight more is prophet Hopespear say not.",
    "That good. Goblins not menat to know ways of Big High War God. Now go, fight and die for his glory and never think again.",
    "Zanik? Who is Zanik?",
    "Yes, there was goblin who say she Dorgesh-goblin. She have big eyes and she speak in strange accent. She ask about Yu'biusk, but she not pass test. She not just not know answers, lots of goblins not know. She start shouting crazy ideas, about how war is bad and we not need gods. Huzamogaarb guards, guards in black armour, they grab her, they put her in prison in Huzamogaarb enclave.",
    "Chosen Commander? You have history mixed up. Chosen Commander come in future, not now. When Chosen Commander come, I know, and I not see any Chosen Commander today.",
    "Yu'biusk is goblin legend. Very old legend, from before this temple built, from before Hopespear the prophet. Even before great war. Legend say that goblins come from land of Yu'biusk. Big High War God find goblins in Yu'biusk and bring them to other lands to train them as warriors.",
    "Why we want to return to Yu'biusk? In Yu'biusk we weak. Big High War God take us from Yu'biusk and make us strong.",
    "Me not know. Me think Snothead know though.",
    "He is in temple crypt. He dead!",
    "Maybe me ask him next time me see him.",
    "Ha ha! You not know. Since you pass test, me tell you. When goblin high priest die, they buried in crypt in special magic way. This mean next high priest can ask them questions, even though they dead. I just say name of priest over grave, and he appear and answer questions.",
    "No. Only high priest allowed into crypt. You not get into crypt. Door locked by six keys, kept by six tribal priests. Priests only give keys to me. They not give them to normal goblin like you.",
    "You ask many questions. Big High War God's true name not for normal goblin minds. But since you pass test, I tell you. His true name Bandos. That name that ogres call him, that orks call him. That name that goblin priests call him on holy days. But normal goblins, you must show respect. You only call him Big High War God.",
    "What you talking about? Bandos not dead. Nothing can kill Big High War God.",
    "I heard of Armadyl. Big Chicken God. Fought against Bandos in God Wars. He weak, he let Saradomin push him round. No way he kill Bandos. You wrong.",
    "No! You lying, or you crazy, and when Bandos hear you talking like that he kill you either way. Now stop it.",
    "Goblin tribes are thing of past. Long ago, all goblins divided into twelve tribes. Dorgeshuun tribe rebel, Big High War God punish them, then there eleven tribes. No other tribes disappear like Dorgeshuun, but over ages, tribes all merge. Now most goblins, they not know what tribe they come from. Sometimes goblins remember. General Wartface and General Bentnoze, they know they come from different tribes. But most goblins in Goblin Village, they not know what tribes they come from. Sometimes, goblins who know what tribe they come from, they come here and make tribal room. They colour armour different colours to show what tribe they in. But not all tribes here.",
    "No one really know what goblin from what tribe. So when goblin want to be part of tribe, they dye armour in special tribe colour.",
    "Me not sure. Me not need dye, me go into any room me like because me high priest. Me hear other goblins say they go to witch-lady in Draynor to get dye. Me hope they beat up witch-lady and take dye! That way of Big High War God!"
  ],
  "Aggie": [
    "What can I help you with?",
    "I mostly just make what I find pretty. I sometimes make dye for the women's clothes to brighten the place up. I can make red, yellow and blue dyes. If you'd like some, just bring me the appropriate ingredients.",
    "Black dye can be made by grinding up black mushrooms. That's dead easy. The mushrooms grow in some old caves and ruins, and you can grind them up yourself with a pestle and mortar. But white dye? There's no such thing!",
    "Usually you can't. But with poorly-made clothes, like goblin armour, it's possible to remove the dye. Even then, its' a very tricky process and involves a special ingredient found in the gut of the Hemenster whitefish. It requires specific bait to catch: slimy eels. If you bring me a Hemenster whitefish and some goblin mail, I can try to do it for you. I'll charge five coins for it.",
    "You'll need to go and get a Hemenster whitefish first. (not having a whitefish)",
    "​You know what you need to get, now come back when you have them. Goodbye for now.",
    "​That's your choice, but I would think you have killed for less. I can see it in your eyes.",
    "​From Hemenster, of course. It's only found in the Fishing spots where the Fishing Contest takes place. To catch it, you need to use another fish as bait: slimy eels. I think you can find them in Morytania and Lumbridge Swamp Dungeon. When you've done all that, bring the whitefish to me and I'll see what I can do."
  ],
  "Morris": [
    "Competition pass please.",
    "The whitefish, eh? Okay, since you've won the competition before then I'll let you in."
  ],
  "[Snothead": [
    "You beat me. What you want?]",
    "It long way away. Me not know where. Priest who come before me, he say that when goblins die we go to Yu'biusk. Perhaps he know where it is.]",
    "Snailfeet. That his name.]",
    "You not goblin. Not high priest. So me attack.]",
    "It dark. Very dark. And cold.]"
  ],
  "[Snailfeet": [
    "You beaten me. Ask your questions.]",
    "Far, far away. Me not know where. But priest who come before me, he say that when goblins die in battle our souls travel to Yu'biusk.]",
    "Mosschin.]",
    "You not goblin high priest! Me only answer questions for goblin high priest!]",
    "Why me here? Me die in battle, fighting humans! Why me not in Yu'biusk?]"
  ],
  "[Mosschin": [
    "You have defeated me, human, Ask your questions]",
    "Far, far away, on the other side of the world. Long ago, the Big High War God brought goblins from Yu'biusk. The priest who came before me said that whenever goblins die in battle and their blood spills onto the ground, Yu'biusk is close and their souls can travel there.]",
    "Redeyes.]",
    "I only answer the questions of those who are worthy. I had to test you.]",
    "All alone. I thought my soul would travel to Yu'biusk. But perhaps I was not worthy."
  ],
  "[Redeyes": [
    "You have defeated me, human. Ask your questions.]",
    "Yu'biusk is far away. Beyond the icelands to the north, beyond the mountains to the west, beyond the oceans to the south and the deserts to the east. But it is also close. Wherever goblins fight in the name of the Big High War God and their blood spill on the ground, Yu'biusk is close. My predecessor told me that no living goblin has ever gone back to Yu'biusk. I think, if no living goblin can go there, then perhaps the dead can.",
    "Strongbones. He was a mighty priest and warrior of the Big High War God. It was he who learned the magic that allows us to be called up to speak with the living.]",
    "You are not a goblin high priest, so I had to see if you were worthy.]",
    "I had thought perhaps I would go to Yu'biusk, to fight in endless battles with the Big High War God but, instead, there is only endless sleep.",
    "Good luck in your quest, human.]"
  ],
  "[Snothead and Snailfeet": [
    "...]"
  ],
  "[Mosshin": [
    "Goodbye, human.]"
  ],
  "Strongbones": [
    "You have proved yourself the stronger, human. Ask your questions.",
    "Yu'biusk is not a place on Gielinor. It is another plane of existence. No goblin alive today has ever been there. It is many millennia since the Big High War God brought our ancestors from Yu'biusk, but the call to that plane is still strong in us. If the barriers between the planes were ever to be broken, goblin blood would call out to open a portal to Yu'biusk.",
    "His name is not important. He is not buried here. Before my time, priests were cremated, and their ashes scattered to the winds. You cannot talk to him.",
    "You are a human, not one of the children of the Big High War God. For this reason you had to prove yourself in combat before I could answer you.",
    "I cannot tell you. I no longer remember what it is like to be alive.",
    "Goodbye, human. I am sure that the Chosen Commander will find what she is looking for when you bring her to Yu'biusk."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Land_of_the_Goblins?oldid=36183278’"
  ]
}