{
  "This page contains dialogue related to Recipe for Disaster": [
    "Defeating the Culinaromancer.The content below is copied verbatim from RuneScape and thus copyrighted by Jagex."
  ],
  "Gypsy Aris": [
    "Now you've freed them all, I'll restart time so you can deal with the culinaromancer.",
    "TEMPUS PROCEDIT!",
    "We have broken your feeble spell! Begone!",
    "One day he'll return. You must go through the portal and finish him off.",
    "Adventurer you must hurry! You have freed the members of the secret council, but we must ensure that the Culinaromancer is defeated once and for all!",
    "Follow him into the portal and make sure he never leaves again!",
    "[Player], I must warn you: inside that dimension you will have no assistance from the gods and your prayers will not work at all!",
    "Also, be aware that he will use his powers to draw upon the might of foes you have fought before.",
    "Take care, I suspect the Culinaromancer will not give up so easily.",
    "Good work [Player]! I think that will be the last we'll see of him! You'd better come back now."
  ],
  "Player": [
    "If you're sure...",
    "Hooray – he's gone!",
    "Hi.",
    "Oh yeah... I remember now...",
    "Do you have any other quests for me?",
    "That last one of yours was fun!",
    "I am getting strong and mighty.",
    "I keep on dying.",
    "Can I use your range?",
    "Can you tell me anything about that chest in the basement?",
    "So that chest in the basement that suddenly appeared along with the Culinaromancer...",
    "Can you tell me anything about it?"
  ],
  "Culinaromancer": [
    "What was that?",
    "You DARED to meddle?",
    "But you cannot defeat me! I'LL BE BACK!",
    "You DARE come HERE?",
    "Say hello to my little friend!",
    "NOOOooo...",
    "I will not be thwarted by you.",
    "NOOOooo...",
    "I have waited a long time for my revenge!",
    "Let's see how you deal with this!",
    "NOOOooo...",
    "You've been lucky so far... but no more!",
    "You have caused me enough grief! I guess I'll have to finish you off myself!"
  ],
  "Cook": [
    "Oh MAN! That was AWESOME!",
    "After you managed to save all of the members of the secret council with those weird foods, the culinaromancer tried to make a run for it, but you followed him into his magic portal and Biff! Bang! Boom! sorted him out once and for all!",
    "Did you ever know that you're my hero?",
    "Did you want a reminder of any other of your brave exploits?",
    "Seriously, you were great! I can't believe I nearly caused all of those people to be killed!",
    "You really got my bacon out of the fire there!",
    "Ooh dear, yes I do! It's the Duke of Lumbridge's birthday today, and I need to bake him a cake!",
    "I need you to bring me some eggs, some flour, some milk and a chocolate bar...",
    "Nah, not really, I'm just messing with you! Thanks for all your help, I know I can count on you again in the future!",
    "You mean you didn't check it out yet?",
    "I really think you should, it seems to be some kind of magical cooking chest, I found a bunch of food in it earlier, along with a bunch of weird looking kitchen equipment and some snazzy gloves!"
  ],
  "Karamel": [
    "Semolina-Go!"
  ],
  "Dessourt": [
    "Hsssssssssssss"
  ],
  "Gelatinnoth Mother": [
    "Krrkrrrk."
  ],
  "v • d • eRS3 Recipe for Disaster": [
    "Defeating the CulinaromancerFinal subquest of Recipe for DisasterEnemies"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Recipe_for_Disaster:_Defeating_the_Culinaromancer?oldid=16604743’"
  ]
}