{
  "Player": [
    "Vanescula, what are you doing here in Burgh de Rott?",
    "What do you know of the recent disappearances? Burgh de Rott's villagers have been going missing.",
    "Which is?",
    "You're referring to his icyenic heritage, aren't you?",
    "I should talk to Safalaan first.",
    "Vanescula. She sought me out in Burgh de Rott, asked me to come find you - she said it's a matter of some urgency. Since the deaths of Ranis and Vanstrom, Meiyerditch has gotten worse. A lot has happened since you left.",
    "Okay, what do you need?",
    "Not that impossible - you are half-icyene.",
    "Both Vanstrom and Vanescula have revealed as much to me.",
    "Let me take a look at it...",
    "That seems to have done it!",
    "I've already unlocked this seal.",
    "Safalaan, I've found this...",
    "What was that? I feel a bit dizzy.",
    "Whoa, that was some teleport! I guess he's in a hurry... I should catch up with him.",
    "Vyres! Vyres in the base!",
    "Vanescula is here? You led her here?",
    "Veliaf is here too?",
    "Radigad, what are you doing here?",
    "No, I mean in the Sanguinesti base.",
    "What's going on with those vyres in the base?",
    "Vertida, what's going on here? Why are there vyres in the base?",
    "It was. What's it to you?",
    "Oh, I didn't know. I'm sorry, but he had it coming.",
    "Fighting? What fighting?",
    "Ivan, what are you doing here?",
    "I'm surprised he let you tag along here.",
    "What's going on?",
    "Yes, but you killed Ranis, not us.",
    "Shouldn't we run this past Calsidiu first - the Myreque leader?",
    "Don't worry, you'll be fine. It's just nerves.",
    "Well, try not to.",
    "Do you still think this plan is a bad idea?",
    "So, maybe the Burgh de Rott order should stay behind, or at least hang back here.",
    "And if it does go wrong?",
    "What do you need me to do?",
    "Any suggestion of where to find some?",
    "What are you making there?",
    "So you think he's dead?",
    "Vyrewatch, Vanstrom, Ranis... We've got some good momentum going here, and Vanescula's with us.",
    "What do you actually know about him?",
    "We've got enough to worry about with what we can see in front of us. Don't waste energy worrying about the unknown.",
    "More than once. Don't worry, they don't come in here. Doubly so since Vanescula warned them away.",
    "Of the vyres? Of Drakan?",
    "Just keep that in mind when we're up against Drakan. You'll do okay - we're all in this together, try to remember that.",
    "How do you feel chopping off parts of it?",
    "You think all vyres are evil?",
    "When the time comes, Ivan, you'll know what's the right thing to do.",
    "How are you finding being out in the field?",
    "But it hinges on Vanescula upholding her end of the bargain - to free humans and find a new source of blood.",
    "Radigad.",
    "Let's see. Blessed silver...nice and sharp...and are those blisterwood handles?",
    "What's the carving on the blades?",
    "The Myreque are using the arboretum as a staging area, making weapons - we just need some disguises.",
    "Oh, do the Myreque smell that bad?",
    "I don't suppose you know where I could find some spare Vyrewatch uniforms, do you?",
    "Well, we needed some vyrewatch uniforms to blend in.",
    "Are you ready for this?",
    "Still worried?",
    "Steel yourself, Kael. We'll be going in soon.",
    "How are you set, Ivan?",
    "Are you all set?",
    "You're not one for many words, are you?",
    "Any news?",
    "No!",
    "Really?",
    "The others are on the way. We're ready.",
    "Does that surprise you?",
    "Don't worry, and keep your voice down.",
    "Shhh. It's worked for me before at least. I'm sure we'll be fine.",
    "Managed what?",
    "It wasn't easy. I had to make some difficult choices. Just remember why we're here.",
    "I don't think vampyres get sick. You'd best hold it in.",
    "Maybe just snarl at a few vyres - that's all they seem to do to each other anyway.",
    "Shh! Ivan, it's me, Player. Keep it down.",
    "What about them?",
    "If I might inquire, what are you referring to?",
    "Maybe these rumours are of special werewolves, or they are just rumours.",
    "[Player's vampyre name].",
    "Player.",
    "What is wrong with this child?",
    "That's barbaric.",
    "What is wrong with this child?",
    "That's barbaric.",
    "What sort of thing?",
    "Me...my lord?",
    "[Player's vampyre name], my lord.",
    "You would see them set free?",
    "You would stop turning humans into vyres?",
    "My lord, I don't understand.",
    "Bring in the harvest!",
    "Hang up the sickle!",
    "Safalaan, wait!",
    "There's no way I could crawl through the hole without being cut to ribbons. Unless I can maybe bend back the sharp teeth...",
    "Ouch!",
    "Even vampyre doors have a thirst for blood.",
    "No, not yet. What happened?",
    "I don't know, I haven't seen him yet.",
    "It's these cell doors - they seem to open in exchange for blood.",
    "Even at a time like this, you're still so stoic.",
    "There's no need to open this cell, it's empty.",
    "It's designed to slowly drain the blood of whoever's put inside it. There's a contraption for keeping the wings splayed - this must be some sort of vampyre or icyene torture device. The vyrewatch in this one is dead - it was one of those loyal to Vanescula.",
    "How? What are they?",
    "To be fair, you were trying to have him killed.",
    "We were worried about you. What was that, back on the roof?",
    "We found the vyres in some strange bloodletting devices - she's been drained.",
    "Isn't that a good sign that Vanescula's on our side?",
    "She did seem genuinely concerned about Safalaan.",
    "What is this place?",
    "What creature even is this? It's unlike anything I've seen before.",
    "We're all a bit weakened - some food would do us good, but I don't think we should ea- Ivan, wait!",
    "Ivan found a book about the 'tasting notes' of blood. So human blood tastes different to you depending how they feel?",
    "But these notes suggest treating humans well improves the taste of blood - so why the slums, the oppression?",
    "So human blood tastes different to you depending how they feel?",
    "How are you feeling?",
    "Well, hold on to that aggression - we might need it to get out of this.",
    "Surely you must have some opinion on our situation?",
    "It's kind of important so that we can get out of here.",
    "You're not referring to Vanescula, are you?",
    "The way out is already open. I'm not sticking my hand in any more of these things!",
    "This isn't what?",
    "I'm not holding anything that would help!",
    "Vanescula, are you okay?",
    "This window is already barricaded.",
    "That's one!",
    "Two down!",
    "That should keep them out!",
    "It wasn't your fault.",
    "He was scared is all.",
    "My guess - the opposite of what he was thinking when Andiess died.",
    "It won't budge.",
    "And by 'someone' I'm guessing that means me.",
    "One more to go!",
    "We should be safe here now.",
    "Another locked door.",
    "That's too big to barricade like the other windows.",
    "Put the blame where it lies - on Drakan.",
    "Have to do the last one now!",
    "The gallery is safe.",
    "It's not over yet.",
    "Are you speaking figuratively or literally?",
    "It looks to be connected to this vampyric seal.",
    "That seems to have done it!",
    "Vanescula, are you okay?",
    "*ahem* Am I interrupting something? What did you just hand her?",
    "Uh huh... Found anything yet?",
    "Oh, er, sorry. I was just looking for whatever we need to power the seal.",
    "Ivan... Ivan, are you okay?",
    "Ivan!",
    "If you don't mind me asking, why are you worried about what Drezel would think? Why IS Ivan special?",
    "You're a descendent of one of the seven?",
    "So, Ivan is...",
    "I guess Vertida and Radigad must have gone in already.",
    "Oh, hey guys. You got in, then - found anything yet?",
    "This looks like a minature blisterwood tree. It doesn't appear to be moving, but it does look to be carefully pruned. Maybe it's a cutting from the one in Darkmeyer?",
    "I'm not looking in there.",
    "That should be the last one.",
    "You two spent a long time alone. What did you have to talk about?",
    "That seems to have done it!",
    "Unfortunately, what comes next is going to require brawn over brain.",
    "Just stay safe out of the way. We need to keep you protected.",
    "You're a monster.",
    "But why bring us here?",
    "It's over, Drakan. You're beaten. Let me take my friends and go.",
    "I'm not sure. You hit her pretty hard. Why do you care?",
    "We wouldn't have defeated you without her help.",
    "Yeah, well, this is YOUR end!",
    "What should I do with Drakan's spear tip?",
    "But the plan? What about freedom for humans, a new source of blood?",
    "But we thought haemalchemy would provide this new source of food?",
    "If food is so scarce, then stop turning so many humans into vampyres!",
    "Ivan, let's just get back to Burgh de Rott. You two go ahead. I'll follow once I've manage[sic] to pry that speartip out of Drakan's head...",
    "Ivan, leave him...",
    "That's a good point! Calsidiu is...",
    "I don't understand. Why would you do that?",
    "That's a good idea. I'll catch up with you both later.",
    "Hey, Drezel, how are things?",
    "He'll be okay. We'll find a way to honour the fallen Myreque.",
    "Not yet, no. I should go do that.",
    "King Roald, I have an urgent update for you regarding the Myreque struggle in Morytania!",
    "Lord Drakan is dead.",
    "I'm sorry, but there's more. The cost was great; the Myreque are no more. Only a few of us survived the misson and the movement has failed. Vanescula Drakan has taken control of Morytania and now sets her designs on Misthalin.",
    "Not any more - she has found a way for the vampyres to cross. It's not enough to hide anymore.",
    "Tell that to the werewolves crossing the Salve. Tell that to the Zamorakian/Saradominist splinter group I uncovered. Nobody else cares about these Edicts! When the vyres arrive at your gates it will be too late.",
    "What of the people of Morytania?",
    "But if we don't help the humans of Morytania, they'll just become more vyres that we then have to kill!",
    "How go your preparations?",
    "I have. He'll be sending an advance guard to Paterdomus soon.",
    "He was of the mind that plenty of others have already broken them, or will be doing so soon, and nothing catastrophic has come of it so far. I don't know how long it will take, but Vanescula will be coming here with a vyre army. If he just lets them cross that might tip the balance. He can't ignore this threat any longer, so he'll be sending his army here. Hopefully, war won't do the same anyway.",
    "Paterdomus is the last line of defence, and it is a good position to hold. We'll have to find some other way to help those on the wrong side of the Salve.",
    "Any news?",
    "I guess there's no reward then?",
    "I have a nerve? You're the one who betrayed us! You murdered Safalaan!",
    "So stop turning humans into vyres!",
    "Did he understand it would mean his own death?",
    "But at your own hand?",
    "Veliaf's sickle has broken the plaque in two."
  ],
  "Vanescula Drakan": [
    "Urgh, I've been asking myself that same question. I loathe being this near the water, and this place smells disgustng - like desperation.",
    "I don't know what you're talking about and, honestly, I don't care. I have other concerns. Though your disappearances may be connected to the reason I AM here.",
    "And so you keep me waiting? You are exasperating!",
    "Which is something I need to tell you Myreque all at once. I don't like having to repeat myself. I need you to return Safalaan to Meiyerditch. I find that he is more willing to see things from my perspective that you humans.",
    "Obviously. I gave him some information about his ancestry. You'll find him around the coast at an old icyene graveyard. It's not somewhere I can go. Tell him his trip must be cut short - I have an urgent matter to discuss with you all. One that requires immediate attention or we're all dead. Well, hurry along - in the boat! I don't like to be kept waiting.",
    "Let's not drag this out. Hurry up with your little ceremony - we've more pressing matters to discuss.",
    "Now you've finished congratulating yourselves, can we get back to why I'm here?",
    "Enough! This childish bickering won't protect you from my brother's wrath!",
    "All of your 'successes' have angered him. Ranis's death was the tipping point.",
    "Yes, and don't you dare forget that. I killed my own brother to protect you - you owe me!",
    "Don't pretend you're not pleased to see me. But I'm not here just to warn you. I want you to kill him!",
    "Ally or not, you must know that Lowerniel Drakan is an enemy to us all, and he's worse than any vyre you've ever faced. Vanstrom was a worm compared to him.",
    "No. But if you ever have a hope to, now is your best opportunity. He's called for a gathering of the true-borns of Vampyrium - but he's unaware of the details of Ranis and Vanstrom's deaths.",
    "If I openly oppose him, with humans at my side no less, there's no way I'll be accepted as his replacement. I can ensure the vyrewatch don't interfere - Overwatch Mornid is loyal to me, and I've installed her as their new commander.",
    "And what of you, Veliaf?",
    "Good, so we're agreed - my retinue will await you in Darkmeyer, outside the castle gate. Make your preparations and meet us there.",
    "If you're that eager to die, you can go now to face Lowerniel alone. But maybe you should return to the Myreque and actually make some preparations for a change.",
    "Well, are you prepared?",
    "I don't need to know everything about the plan, silly meatsack. Some House Drakan personal guard uniforms should do - ask Mornid. They're already blood-marked, so they'll mask your scent too.",
    "Not bad, delicious...",
    "Wasn't killing Vanstrom enough that you had to burgle his house too?",
    "I highly doubt that, but we'll proceed nonetheless. Open the gate!",
    "Someone who wants you to open the gate!",
    "Good. I'll fly Safalaan up, Mornid - you take Player. The Vyrewatch can fly the rest of the Myreque up.",
    "All but the lowliest vyres can fly. The gathering is being held on the roof; not flying might draw suspicion. Don't tell me you're afraid of heights, Veliaf.",
    "Try to mingle. Don't arouse suspicion, and don't do anything to give yourself away! While you may be 'hot stuff' on the streets of Darkmeyer, the true-born nobles will take a lot more to win over. Mind what you say.",
    "Don't talk to me now! It's unseemly for me to be seen talking to such a lowly vyre at gatherings like this. Go mingle with the nobles, try to blend in.",
    "You've done enough hobnobbing. Let's have a little chat.",
    "I suppose that will have to do. Now that you've improved your reputation in polite society, we can... Wait! A surge of power. Do you smell it? It has a familiar scent.",
    "Welcome, Lowerniel. Your absence has been too long.",
    "I simply meant that you have been missed, dear brother.",
    "Then we should retreat to do so in private.",
    "But brother, you must be tired. Surely it can wai-",
    "Lowerniel. You speak of a promised land - surely you do not speak of Misthalin? Unless...have you discovered a way to cross the Salve?",
    "Vampyrium? So that is where you have been gone all these years? We thought you secluded in your quarters, obsessing over that 'rock'.",
    "You have lost touch with your people, brother. I have a better solution to our food shortages, one which does not require us to devolve back into beasts.",
    "Lowerniel, I...",
    "Yes, my lord. This vyre speaks truth.",
    "Yes, Lowerniel. This vyre speaks truth. Ranis was found in the arboretum...",
    "Brother, why ask such questions of a lowly vyre? Your nobles grow anxious with your decree to return us to Vampyrium. This is our home.",
    "Slaughtered? If you intend for us to depart, why not leave them be?",
    "You have made your point, brother.",
    "I would rather die than become someone's broodmare.",
    "Brother, don't! Put him down!",
    "Don't speak to me now! Listen to my brother!",
    "You don't say! What, do you just not see me in here? Get us out of these things!",
    "Too weak... The seal. You have to unlock the seal.",
    "The seal unlocks the exit too. Unless you want to die down here with us, you don't have a choice.",
    "Hurry...",
    "How dare he do this to his own sister?",
    "But to humiliate me in this way, to drain my blood in this archaic fashion. He is too far gone - he would have us all devolve back to uncultured barbarians. Mornid, how are you?",
    "We must feed to regain our strength.",
    "No! Where is he? Is he safe?",
    "I know I'm captivating, but focus on Safalaan.",
    "We'll live. I hate you seeing me like this, but I haven't the strength to look more human.",
    "She doesn't want to come. You can't save everyone, especially not from themselves.",
    "I am glad you are alive and well, Safalaan. I thought for sure Lowerniel was going to kill you.",
    "I can still speak for myself!",
    "It pains me to say, but I agree with him. I do not wish to drink your blood.",
    "Ah, that's better. I feel strong again.",
    "I should think that obvious. These are the castle cellars - food stores, blood cellars, kitchens. Not that I ever come down here. We have servants for a reason.",
    "All blood, not just from humans.",
    "House Drakan's roots can be traced back to many tribes, and not all vyres share the same tastes. Each tribe prefers the taste of certain emotional states. The Drakan tribe quite enjoy the taste of hope, of optimism. You humans have vegetarians, fish-eaters, 'sweet-tooths'... To assume all vyres are the same in this regard is narrow-minded and offensive. Though, if hungry enough, a vampyre will eat anything to survive. Besides, the current situation for you humans is more due to the scarcity of blood in Morytania. It's what we're working together to change, remember?",
    "What's the problem now? A simpleton could get us out of here. Each of these tithing machines requires blood flavoured by a certain emotional state, related to the original vampyric tribes as depicted on each lock. That tasting notes book should suggest to you which lock should received[sic] which blood. It's up to you to figure out which of you emotionally stunted Myreque is best suited to each lock.",
    "Hahaha! Oh, you fools. You didn't think it would be that easy, did you?",
    "Would you set aside your mistrust just once, human? This is my brother's doing, not mine!",
    "Don't look this way unless you want to go higher up the castle.",
    "Not now, Mornid.",
    "Hunt? You would treat your own sister as prey! How dare you?",
    "Mornid!",
    "Mornid...",
    "I...",
    "What do you want?",
    "Oh, why, I'm just fantastic, thank you for asking. Do I look okay? My own brother is hunting me like some sort of prey! Now, if you meatsacks are done, can we get moving?",
    "I don't think you're going to like what comes next.",
    "Look, I'm not used to this sort of thing, plus he murdered Mornid right in front of me. We still need each other if we're going to survive this.",
    "Know? Nothing. I only suspect. What we find upstairs will confirm it. Let's just move on.",
    "Yes.",
    "Like I said, you're not going to like what's ahead of us.",
    "You've hardly earned your keep either! My brother is mocking your attempts to kill him.",
    "Private quarters for Lowerniel, Ranis and myself. There'll be something in each of them to power the seal.",
    "So, you want to see my private quarters, do you?",
    "Now that we're alone...",
    "We had a deal, and I presume my information proved useful?",
    "A good job too. Without its protection, we'd have all died on the roof.",
    "Once Drakan is gone, I am.",
    "So long as you don't make me regret killing my family.",
    "It's a personal matter, not of your concern.",
    "I'm sure we're capable of finding it ourselves, but seeing how you're here now, why not make yourself useful?",
    "Excuse me! Do you make a habit of invading people's privacy like this? How rude!",
    "Yes, well, you're not going to find it in my bed are you?",
    "Now, if you're quite finished disturbing my private quarters, you should rejoin the others.",
    "Obviously, I'm sure you all thought that meant me, but I assure you it wasn't. Clearly it was just my brother's attempt to drive a wedge between us.",
    "Hurry up with that seal. My brother won't wait for you to finish before killing us!",
    "You Myreque had better be prepared this time. Either my brother dies or all of us.",
    "It depends on how soon you want to die.",
    "If you think we'll reach the roof and just fly off into the moonrise, you're sorely mistaken. Lowerniel has been herding us this whole way. He'll be waiting. The only escape will be through him and his venators.",
    "And here's me thinking you were dumb. Of course it's not Darkmeyer.",
    "Vampyrium? And why not? Lowerniel said he'd found a way back. Where better to hunt us all undisturbed?",
    "I've suspected since the courtyard. Castle Drakan was built in the same style as the original here on Vampyrium - the differences are subtle. I rarely venture so low down, but something felt off. It wasn't until I saw my private quarters - my OLD private quarters - that I was certain. But if I'd told you, would you have believed me? You're hardly the trusting type, Veliaf. What I told you was what you needed to know. He'll be here soon; get ready to fight.",
    "I'll see if I can speed things along.",
    "You do not speak for us all, brother.",
    "You may have rejected civilisation and culture, brother, but the aristocracy has not. You've been absent so long that you are out of touch with your own people. And now you want us to devolve back into animals like your venator pets? You are obsolete, a relic from a forgotten age. The vampyre nation no longer needs you!",
    "I have found another way, a new source of blood! It doesn't have to be this way, brother. Join me. Join us!",
    "You can't know that! You don't know!",
    "Brother, no!",
    "JUST DIE!",
    "I... I will be.",
    "I was lucky - the spear only caught my wing. I'll heal.",
    "Keep it. I never want to see that vile thing again.",
    "Well, I'm glad you're finally seeing sense.",
    "I am now the head of House Drakan - there are none left that could contest me. My association with you humans remains secret, and so the nobles will accept me willingly. Eagerly too, I might add. My brother's call to return to our beastly roots on Vampyrium did not meet with their approval. We have grown too accustomed to our ways on this world. Lowerniel chose to reject civilisation when he fell under the sway of Zamorak. But I shall see us returned to the heights of our society, when human and vyre lived in peaceful co-existence.",
    "It will take time to bring all vampyres in line, and we shall require a new source of food to ease the process. As a temporary solution, I shall arrange for the blood stores from Vampyrium to be transported here, after which I shall have this portal destroyed. In the meantime, I shall appoint a new overwatch to keep the vyres in line and return a level of calm to Meiyerditch.",
    "Yes, you should have. There is, however, one last thing I must ask of you, in order for us all to achieve our goals. Specifically of you, Safalaan - none other.",
    "I typically find it easier to ask for forgiveness than permission, but let me whisper it to you...",
    "Nothing has changed! This IS the plan! I shall bring in a new era for human and vampyre alike. Safalaan's sacrifice was necessary to bring about peace. With his icyene blood coursing through my veins, I am sanctified against the Salve. And through the power of haemalchemy, I can transfer this gift to the vampyre nation. We shall rebuild the empire of old within Misthalin, with a plentiful supply of food.",
    "And so it shall, just not directly. Surely you understand enough of magic to know you cannot create something from nothing. I cannot just magic a new source of food into existence - there is always a cost. Blood is our food! You are our food! It is simply the scarcity of your kind in these accursed lands that has led to the decline of both our races. A larger population will require lighter tithes, and less frequently. None need suffer nor die ever again. You will be left to live your lives in freedom. This is how it was in the days of the Zarosian Empire, and this is how I shall make it again!",
    "And leave ourselves weak against you righteous humans? Lead our race closer to extinction? The opposite is necessary, unless you think the Kingdom of Misthalin will welcome us openly. We'll need to turn more vyres.",
    "No? You tell me no? This is what we have been working for! You would stop me now? You would leave the humans of Morytania to their fate at the hands of a starving vampyre nation, and you think ME cruel? You are not freedom fighters, you are idealists! I seek to resolve all of our problems, yet you would deny me?",
    "I already have them. Safalaan handed over the book you found in exchange for information about his parents. The Myreque are no longer required. You are free to leave - I owe you that much, at least - but dare not interfere with my plans! Go, now, before I change my mind.",
    "Do you still believe I lack conviction, brother?",
    "You have a nerve coming back here.",
    "You humans are so short-sighted. I did not betray you. You Myreque wanted a way to free your kind - this is it! Ever since the Salve barrier went up, this place has become as much a prison for my race as yours. Food is growing ever scarce for us too. If we cannot also escape, vampyres will become all but extinct.",
    "And risk appearing weak to our enemies, who would no doubt take the opportunity to wipe us out? Or is it that you only wish for the humans of Morytania to be free, and not its vampyres too? Freeing us ALL from this accursed land is the only way! Safalaan understood this, why can you not?",
    "He made it abundantly clear to me that he was willing to die for his cause, for his beliefs.",
    "I did what was necessary for the survival of my kind, and I will continue to do so. What will you do?",
    "So you do only care about your kind - how selfishly human of you.",
    "We do not need to make enemies of one another.",
    "I doubt the humans of Misthalin would be so welcoming. There will be blood.",
    "That is not an option. Once I have the portal destroyed, there will be no way back.",
    "Whatever you think of me, I hold no grudge against you."
  ],
  "Safalaan": [
    "Player, how did you find me here? No one knew I was coming here save for...",
    "Clearly! It sounds as if you have fared better without me than with! I'm sorry I left as I did, but coming here was important - IS important - to me. Whatever Vanescula's urgent matter is will have to wait. I can't leave until I've found what I'm looking for. Perhaps, if you would help me, we can both return to the Sanguinesti base sooner?",
    "This place is an old graveyard, in use during the time Queen Efaritay ruled these lands - the crypt here is hers, along with King Ascertes. What Vanescula showed me - I'm their son! I'm still not sure how that's possible, but it feels true.",
    "You know?",
    "I have to open this crypt, to pay my respects. From what I've pieced together thus far, there's something interred with them that will aid the Myreque. Yet it seems Lord Drakan thought the same, hence why there's this blasted vampyric seal barring my entrance. I've not been able to open it.",
    "Thank you for unlocking the seal. Let's search the crypt.",
    "My mother's pendant? I can feel her strength flowing through it.",
    "I'm not entirely sure. I think it was...understanding? I felt a connection with my icyene side, with my mother, like I've never felt before. I feel protected. You have reconnected me with my heritage. Thank you. You are a true friend. Now, you say Vanescula had urgent business with the Myreque? Allow me to return to the Sanguinesti base to catch up with them. Please, join us there when you are ready.",
    "Ah, good. Perfect timing, Player.",
    "Veliaf and I have been corresponding about this for some time now, and, well... With all you've done for the cause, we thought it was about time...",
    "We were wondering what you'd think to becoming...",
    "I've apologised already, Veliaf. I had to go, but you coming here risks the entire movement!",
    "And Vertida was a good choice - you were right to promote him too.",
    "So you're here to warn us? You could have sent word through Sarius.",
    "Vanescula has proven herself an ally. Helping her helps us all.",
    "So if we combine forces now, spring a trap, we can take him unawares?",
    "Plus he doesn't know we have the blisterwood tree...my mother's tree. The Sanguinesti order at least will back your plan, Vanescula.",
    "Indeed. He'll be with us all in spirit, no doubt.",
    "We should use the arboretum as a staging area to prepare, stock up on blisterwood weaponry. I'll be able to teleport us there now, thanks to my mother's pendant.",
    "Well, it looks like we have our first order for you as lieutenant, Player.",
    "This tree. I think I remember it. Finding my parents' shrine, that pendant... It's like it's unlocked a door in my mind. Efaritay and Ascertes planted the first of these trees together, and I think I was with them when they did, even helped them. I must have been very young, the memory is so vague and fuzzy, but being near it makes me feel safe. I've instructed everyone to make sure they're well-armed. This tree can protect us still when we make our move. Lord Drakan murdered my family and turned their kingdom into a nightmare. It gives me comfort to know my mother's tree will soon end him. I shall avenge their deaths.",
    "Ah, you got some vyrewatch uniforms, I see. We're almost ready; you should talk to Veliaf.",
    "It's nice to know you're all worried about me, but I'm okay! Through here!",
    "When Drakan grabbed me, I thought I was done for. I was so scared, but he just got me so angry and...I wanted so much to kill him that I lost control. That blast of icyene magic appeared to weaken him, but it must have knocked us all out too. When I came to, I was in here.",
    "I'm okay, old friend. I'd have come looking for you all, but, well, I was stuck here. Vanescula, Mornid - are you alright? You both look weakened.",
    "Yes. Everyone's okay.",
    "She won't say; Lord Drakan put her in here so long ago, that she might as well be nobody. Those are her words, not mine. I've been trying to find a way to get her out. She can escape with us.",
    "We can't just leave you here.",
    "Leaving her behind still doesn't feel right.",
    "And I you, Vanescula. If we weren't before, we're definitely in this together now. You look weakened.",
    "Here, you can have some of my blood.",
    "Um, it's, er, kind of hard to explain. Do we have to discuss this here?",
    "Yeah, okay. I feel...love.",
    "What? No! My mother's pendant protected me up on the roof, and I just have this feeling of closeness to her, like she's here with us...with me. Actually, since you brought it up...I'm not sure how I feel about Vanescula either. It's certainly not love, but... Admiration? At what she's trying to do - usurping her brother and co-existing with humans. I hate vyres more than anyone, with what Drakan did to my parents, but Vanescula is different. She's curt and rude, sure, and lacks empathy, but she's the most 'human' vyre we've encountered. You know she's embarrassed that she looks like a vyre?",
    "Good, now we can find Drakan again and give him what's coming.",
    "Not before killing you.",
    "Fall back! Fall back!",
    "Vanescula[sic] is right. we must head upstairs, quickly.",
    "I think she might be in shock.",
    "I can't believe we lost Kael. What was he thinking?",
    "If he'd just held position - we could have taken out Drakan there and then!",
    "Those bookcases look pretty weak!",
    "Think of all the knowledge we could obtain here - all of these books.",
    "I know - it's just a shame is all. They could teach us more about vyre weaknesses, help us find new allies...",
    "I'm not sure what to do.",
    "It happened so fast!",
    "Do you think Mekritus is...",
    "Try the weapons rack behind the stairs!",
    "The stairs are blocked by this barrier - we're not getting up there yet.",
    "That's another seal broken.",
    "What is it, Vanescula? What's ahead of us?",
    "Everyone, just calm down. We're all hurting, but we have to go on. Now, how do we get here to the roof?",
    "We'll cover more ground if we split up. I'll go with Vanescula.",
    "You want me to hand it over now?",
    "My parents' tomb was exactly where you said it would be. They weren't in it, though. Just this pendant.",
    "True enough, and without your help we'd have died sooner still. You're certain you can make this work?",
    "I'm entrusting this to you. Don't make me regret doing so.",
    "Oh, Player! It was the, um...my mother's pendant. I wouldn't have found it in the first place without Vanescula's help.",
    "Not yet, we were jus-",
    "We'll be back down in a moment. I just need to discuss something with Vanescula...in private.",
    "Don't look at me - I couldn't even figure out the seal in the graveyard!",
    "I was telling her of my parents' crypt, how they weren't there and what Drakan said about them. Especially the bit about my father's killer being among my allies - that threw me.",
    "Drakan is going to pay for all he's taken from me.",
    "Vanescula, what is it? What's waiting for us up there?",
    "Steel yourself, Myreque. This day's not done yet.",
    "But where? Surely it can't be...",
    "But how do we escape?",
    "But why not just kill us and be done with it? Why bring us here?",
    "Vanescula!",
    "Not Vertida too!",
    "Over here!",
    "But Vanescula, Vertida?",
    "Good. We need to regroup. Let's just get out of here before...",
    "Vanescula, are you okay?",
    "We thought you'd died, back on Vampyrium.",
    "So, what happens next?",
    "What of the plan to free the humans of Morytania?",
    "What is it?"
  ],
  "Sarius Guile": [
    "Wait! They're here with my lady. You're not in any danger.",
    "I'm sorry. If it wasn't so urgent, I... Please don't be mad at me. She's with Safalaan and Veliaf in the operations room.",
    "They've been waiting for you to arrive.",
    "Please trust my lady. She may be brash, but she has always treated me well.",
    "She's not like other vyres - I've seen her at her best.",
    "I'm sorry you feel that way, but you must at least try.",
    "That's all I could ask.",
    "Good, I am glad at least one of the Myreque does.",
    "Please, at least give her a chance."
  ],
  "Radigad Ponfit": [
    "Guarding the entrance.",
    "Oh, you'd better talk to Veliaf. He's in operations.",
    "I don't know, I'm guarding the entrance.",
    "It's about time we got a crack at a Drakan ourselves. Can't leave all the fun to you.",
    "Player.",
    "I made these - the sickles - think they'll do the job?",
    "They are indeed. I made one of these beauties for Veliaf too...but I'm going in swinging.",
    "'H' and 'S' - it's for Harold and Sani, so they'll be with us in spirit too.",
    "Player.",
    "Player.",
    "I trust you'll find us a way out.",
    "I'm not the one for feelings, Player.",
    "*spit* I hate vyres. That's an opinion. They're foul, disgusting creatures. They think nothing of us beyond their next meal, and I hold nothing but contempt for the whole damn lot of them, Vanescula included.",
    "Now, let's go kill some vyres.",
    "We should head upstairs.",
    "I'll cover this window.",
    "Kael should have known better, running in alone like that.",
    "I know. I don't blame him. It's just easier to be angry at him right now is all.",
    "I've got this one.",
    "Player.",
    "Help us lift.",
    "Stay and fight me, you vyre scum!",
    "Give me a minute...",
    "This one's covered.",
    "That should hold them.",
    "Let's move on.",
    "Don't worry, LT, I've got your back.",
    "You're asking the Myreque's 'muscle' if it's just stuck? No, it MUST be locked somehow.",
    "Nope.",
    "Good, let's head back down.",
    "It's nothing. The others are back - we should rejoin them.",
    "Go! I'll hold him!",
    "Go, dammit! Player, get him out of here now!"
  ],
  "Vertida Sefalatis": [
    "They're Vanescula's lackeys - she's in the operations room with Veliaf. Sarius led them here.",
    "We'll meet you at the arboretum.",
    "Before he, uh, disappeared, Flaygian designed a new crossbow for me - repeating, fires blisterwood stakes.",
    "Not for certain. We looked into some rumours about an over-tithing, who'd been sent to the mines...all sorts. Didn't find anything concrete. That's what it's like here.",
    "He's not the type for a triumphant, heroic return. If he's not dead, I doubt we'll ever see him again. I find it more comforting to think of him as dead rather than a coward. And I'll honour his memory with this new crossbow - I've named it Screwte, because that's what any vyre I find with its sights is.",
    "Well, first fletch a blisterwood stock, from this tree here. Then combine the blisterwood stock with silvthril limbs. You craft sivthril crossbow limbs much like a silvril chain - in a furnace from a silver bar and mithril bar. The nearest furnace is in north-east Darkmeyer. Add a crossbow string, and you'll be ready to Screwte these vyres to the wall.",
    "Have you seen Safalaan?",
    "All I remember was that Drakan had him and then - flash - everything went white.",
    "Is Safalaan in one of these cells? Is he okay?",
    "We're just missing Safalaan, sir.",
    "Sir, we still need to find Safalaan.",
    "This seems to be the way out of the dungeon, go on ahead, we'll be right behind you.",
    "I'm trying not to think about it. I'm just happy taking orders. Whatever Safalaan and Veliaf need me to do, I'll do it. I can't think beyond that else I'd be paralysed by fear. Only myself and a couple other Myreque have a military background. I just wish my two superiors would get on the same page and stop arguing, then get us out of this mess.",
    "Nice work, now let's get out of here and regroup.",
    "Sir, this door's locked!",
    "Perhaps we should listen to Vanescula[sic].",
    "I've got the stairs covered.",
    "Kael... I've never lost someone under my command before. I've never HAD someone under my command before. I failed him.",
    "I'll cover Polmafi; you deal with the barricades.",
    "Let's move.",
    "Help with the table.",
    "Why is it targeting MY men?",
    "Now Mekritus... I'm a failure.",
    "You're right. I'm sorry.",
    "Everything's clear here.",
    "(Same as above)",
    "Let's go.",
    "They appear to be connected to some windows above - are there rooms up there?",
    "So I guess that leaves Drakan's room for me and Radigad? Ha! Sure, no problem!",
    "It doesn't seem locked to me, but it won't budge. Are you sure it's not just stuck?",
    "Well, you keep pushing and I'll keep looking. Player, you should probably see if anyone else needs helping first.",
    "I can't see anything of note.",
    "Wait! Did you hear that? Something feels...off.",
    "Radigad, behind you!",
    "Not a chance.",
    "Get that thing unlocked quickly!",
    "Player, get out of my line of fire!",
    "At least on the roof there'll be open space and clear lines of sight. It's about time I got to put this crossbow to good use!",
    "Player, get out of my line of fire!",
    "Can we leave now? I'm getting real nervous standing here.",
    "I'll scout out the roof."
  ],
  "Overwatch Mornid": [
    "Show some respect, human. We are Lady Vanescula's personal guard and, Myreque that you are, you're all under her protection. Our loyalty is to her; we're not here to eat you.",
    "Save that zeal for your real enemies. Let's not start something here.",
    "Do not confuse restraint with fear. You, the human just arrived[sic] - you are wanted with the other leaders. Do not keep my lady waiting. The sooner she is done here, the sooner we can leave you in peace.",
    "So you're the one they call Player? Was it really you that killed Vanstrom?",
    "He was my mentor. He trained me up personally when I joined the vyrewatch. It's thanks to him that I'm the residing overwatch.",
    "That he did, and the only thing you should be sorry for is killing him before I got the chance to do so myself. He relished in his cruelty towards humans. I suspect he grew to despise his own human beginnings. But I am not like him. Vyres need blood to survive, and humans are food to use, but what this kingdom has devolved into sickens me as much as it does you. Vyrewatch have become undisciplined since Vanstrom's death, but I intend to reign[sic] them in, to cease their cruelty towards humans and their random tithings. Vanescula has not shared her entire plan with me, but she assures me that humans will benefit from it as much as us vyres, that we can all learn to live together peacefully. So don't worry yourself with my vyrewatch here - you're under Lady Vanescula's protection, and my loyalty to her is unwavering. When the fighting starts, we'll be at your side.",
    "That is for my lady to inform you of. She's waiting for you.",
    "I look forward to fighting alongside you...'[Player's vampyre name]', is it? Yes, I would totally have fallen for such an obviously made-up vampyre name.",
    "Vanstrom's old mansion is now mine. I've left some House Drakan uniforms in storage. They've already been blood-marked, which should mask your human scent.",
    "Those vyrewatch uniforms are for Vanescula's personal guard. Even though we're the elite of the watch, the true-born nobles still look down on us. Nevertheless, it is our duty to provide security for them when required, so you won't look out of place at the forum. A lower-ranking vyre would draw suspicion.",
    "Sentinel! How dare your question your lady AND your direct superior. Now open this gate before I have you put in a bloodletting device for insubordination and have your wings clipped! Or perhaps you'd prefer a lower standing?",
    "I've sent scouts ahead to make sure our arrival goes unseen.",
    "Follow my lady's instructions and try not to raise any suspicions.",
    "Be quiet! Listen to what Lord Drakan has to say!",
    "Can't... I... My lady...",
    "I will be okay, my lady, but my vyres are dead.",
    "How dare he do this to my lady...to my vyres?",
    "I don't like this place. Something smells off.",
    "Me too, though it is quite common in vampyre society for the nobles to have access to things us lower vyres do not.",
    "Where there is food, there will be blood. I shall find my lady.",
    "It may well do for the vyre nobles, but I was human-born. To me, blood is just sustenance - perhaps my palate is just too unrefined.",
    "If you are struggling to unlock this exit, you should talk to Lady Vanescula.",
    "My lady, this isn't...",
    "This isn't time for idle chat, perhaps? Let's just get out here...quickly!"
  ],
  "Merkitus A'hara": [
    "A vyre's a vyre - try anything an' tha only thing you'll be eatin' is silver."
  ],
  "Kael Forshaw": [
    "Wow, could it be the vyres are actually scared of us for a change?",
    "I'm scared, but I hope I don't let everyone down.",
    "You've been here before, right? In Darkmeyer, I mean - surrounded by all these vyres?",
    "I'm scared.",
    "Well, yes, obviously those. But I'm more scared of letting everyone down. Like I did before when Andiess...",
    "Okay, I'll try. Thank you.",
    "I was worried we were the only ones left.",
    "Oh, thank Saradomin it's you. I thought I...",
    "I'm thinking about Andiess - it's all I can do to stop me being afraid. I still mourn him. I think about him every single day. It's like he is with me, in every room of this damned tower.",
    "Praise Saradomin, I thought we'd be stuck in here forever.",
    "For Andiess!"
  ],
  "Vyrewatch": [
    "Human.",
    "Talk with Overwatch Mornid or Lady Vanescula. We take our orders from them.",
    "Human."
  ],
  "Ivan Strom": [
    "We came with Veliaf, all of us.",
    "Heh, yeah, I've worn him down. He says if I won't stay put as he says, then I might as well stick close to him. Besides, what's the point of me being in the Myreque if he always keeps me out of the fight? Anyway, you should go in - they're waiting for you inside.",
    "It wasn't long ago Veliaf wanted me safe at Paterdomus, yet now he wants me to be part of the team going into Castle Drakan!",
    "This tree is amazing, miraculous even! That it's the very thing we need to defeat the vyres - surely that's a sign.",
    "It feels right...no, not right - righteous. The tree recovers, given time, and it provides us with protection from evil.",
    "Um, well, I used to. It's what Drezel always taught me. If they weren't, why would Saradomin have blessed the entire Salve to imprison them? Plus, seeing the state of Meiyerditch and everything we've been through, it's hard to NOT think of them as evil. But hearing about how the Columbarium is freeing those poor human souls trapped in vampyric bodies... And that we wouldn't have made it anywhere near this far without the help of Lady Vanescula. Lord Drakan hasn't been seen for so long. What if he's not as bad as everyone's made out. Are we doing the right thing here?",
    "Are you okay? You're bleeding.",
    "Well, talk to me again when everyone's out and I'll see if I can help.",
    "How in the name of Saradomin did we get here?",
    "And Vanescula with her vyres too.",
    "*scoff* What? It's some sort of jerky; reminds me of Myreque provisions. It's really good - try some! Oh, and I found this book in here - might be useful. I'll grab enough food for everyone. Let me know if you ever run out.",
    "Right, and I'll catch up with the others.",
    "Pretty good, all things considered. I mean, we failed to kill Drakan and got locked up, but at least we're all still alive and together. The way things are going, I'm optimistic we'll be able to escape, then we can regroup and try again.",
    "See, I knew you could do it!",
    "We should continue on upstairs.",
    "Here, have some food!",
    "You already have some - I have to save some for the others!",
    "I'll keep watch here.",
    "Kael... That thing just mauled him. He didn't stand a chance.",
    "I'll guard our flank.",
    "What I wouldn't give to spend some time here reading. You know, if we weren't busy being hunted to death by a blood-crazed vampyre.",
    "Help us lift.",
    "You already have some - I have to save some for the others!",
    "Those things just move so fast. Mekritus was gone before I could even react. If only...",
    "I'll keep watch here.",
    "Thank Saradomin that's over.",
    "We should continue on upstairs.",
    "So this is Ranis's room? Well, this is disturbing.",
    "Others will have, though...",
    "Hey, I think I can see Polmafi from here...",
    "...",
    "I'm up! I'm awake! What is it?",
    "What happened? Where am I?",
    "I feel like I was hit by a runaway cart. Drezel would be so mad.",
    "I'm really not! My surname is Strom, not Seergaze or Dunegun or whatever.",
    "So Veliaf and Drezel think, but there's really nothing special about me.",
    "Radigad was the strongest of us. What chance do we have?",
    "I'm sorry, but I don't think I'll be much use in the fight ahead. That jerky from the cellars is running low, but I do still have some if you need.",
    "Don't you start as well! I had enough of Veliaf being overprotective.",
    "Player, you should take this jerky, you might need it.",
    "Yes, sir.",
    "What now, Veliaf?",
    "I saw Lieutenant Player deliver the killing blow. Drakan is dead.",
    "Safalaan!",
    "No, you can't! This is not what we wanted. We cannot allow your cruelty across the Salve.",
    "We'll never let you have the secrets of haemalchemy.",
    "Sir, what do we do? Sir? Sir?",
    "Veliaf!",
    "Veliaf, what do we do? Veliaf?",
    "But I don't know what to do...I'm lost.",
    "There must be something we can do! What about Calsidiu?",
    "What do you mean - we need him!",
    "But he's the Myreque leader - its founder!",
    "But what do we do? What do I do? The Myreque...",
    "I can't! I won't!",
    "Player, would you come back with me to Paterdomus? I'm not sure what else to do.",
    "Okay, let me know when you're ready to go.",
    "The Myreque, Drezel - they're dead. All of them gone. I...I wasn't sure where else to go.",
    "Player, I've been thinking this over on our way here. While I catch Drezel up with what happened, I think you should inform King Roald - he needs to hear about this.",
    "Have you informed King Roald of what happened with the Myreque, with Lord Drakan?",
    "Have you spoken with King Roald?",
    "He should have done more sooner. If he had, the Myreque - my friends - might still be alive.",
    "Yes, what about the people of Morytania? Does he just plan to leave them to their fate?"
  ],
  "Polmafi Ferdygris": [
    "Oh, hello, Player. You know, it's good to be 'out in the field' for a change...even if just to another Myreque base.",
    "Well, it looks like my little excursion is going to unexpected places. I feel queasy - is that normal?",
    "This arboretum is truly remarkable. It must take a lot of maintenance to keep intact, with the tree constantly poking holes in it. Fascinating!",
    "It's an eye-opener, I can tell you that. I'm more used to staying back at base and offering strategic insight. Seeing all the suffering here first-hand paints everything in a new light. That being said, I did initially advise Veliaf against this course of action. We exist in cells for a reason - to commit all of us to this one action is risky. But that lady vyre isn't wrong - strategically speaking, this is our best opportunity to defeat arguably the most dangerous vampyre in recorded history. With him gone, we've won! So this is our final push - and us all going improves our odds of success.",
    "True, but whatever her intentions, it makes strategic sense for us all the be rid of Lord Drakan first.",
    "Yes, thank you.",
    "Well, this is a part of Castle Drakan I was hoping not to see.",
    "Well, this is a part of Castle Drakan I was hoping not to see. Hmm, would you like me to reset the seal to where it started?",
    "Scared witless, my [lad/lass]. My first mission in the field and I end up in a vampyre prison cell. But, as horrific as this place is, I do find it fascinating. Everything is built around blood - harvesting, storage, delivery. I'm in awe of vampyric architecture and history too - they may be dark, but there's beauty in both.",
    "That's a grisly, yet fascinating, security feature - doors unlocked by blood.",
    "Uh oh.",
    "It didn't work, sir. I don't get it - we've never had problems teleporting around Meiyerditch before.",
    "We should go upstairs.",
    "We should be careful not to let the loss of Kael diminish our morale. Once we escape and regroup, we can properly mourn his loss.",
    "My guess is this works like the one in the cellar. Someone will have to stick their hand into that blood lock.",
    "Another tithe door? These vampyres, honestly.",
    "We can go through now.",
    "Ha! I find the idea of a vampyre dining room farcical. They clearly have no need for such a room, yet their desire to appear civilised leads them to it. It's a fascinating insight into their culture. At least, it would be if it weren't so disturbing.",
    "I hate those things.",
    "Poor Mekritus. We must stay strong.",
    "And now a gallery? Perhaps I have been too glib about vampyric culture. Clearly, they can appreciate art...though none of this is to my tastes.",
    "We have another vampyric seal to unlock. After you, Player. Unless, would you like me to reset the seal to where it started?",
    "The seal has opened the way to the next floor.",
    "I think I'm starting to understand how things work around here...",
    "Sirs, I suspect this central vampyric seal will reveal a way up... but it's seemingly unpowered.",
    "Player, I could use your assistance with the seal.",
    "Oh, sorry, Player. I was mistaken. This seal isn't even active. Perhaps you should see if any of the others require your assistance first.",
    "Lieutenant, I need your help solving this vampyric seal.",
    "I'm sorry, Player, but I still don't quite have these down. You'll have to unlock this one.",
    "I get it! I think I finally understand how this castle works!",
    "I'm not much of a fighter, but I'll do my part.",
    "The seal is unlocked, Lieutenant! The grate above has opened and we can get to the roof via this central staircase.",
    "Sirs, if I might interject. I've been studying how this castle works. The blood stores, the vampyric seals, the tithe doors, the central shaft - it's all connected! This entire castle IS the portal! To open such a portal even once would require a vast quantity of blood. The blood stores in the cellars must be converted into magical energy, likely through some form of haemalchemy. And I believe that these three pylons on the roof can be used to focus that energy to form a portal. Given time, I'm certain I can figure them out.",
    "Sir.",
    "That's the first pylon calibrated!",
    "She... She saved me... Why?",
    "Yes, sir! (He runs towards the second pylon)",
    "That's it! The last pylon!",
    "Yes, sir!"
  ],
  "Veliaf Hurtz": [
    "Yes, maybe you can talk some sense into this one.",
    "Spit it out, man!",
    "I'm making you my lieutenant, [lad/lass]. There, done. Now, can we get back to why this vyre 'lady' is in your base?",
    "Why we're BOTH here!",
    "As does you NOT being here - someone had to take charge, you were gone so long.",
    "Drakan is returning?",
    "We're not assassins working through your personal hit list, woman!",
    "I'd hardly say 'proven'.",
    "Yet you still think we can take him out?",
    "Ha! Where will you be in all of this, 'ally'?",
    "This is a mistake, Safalaan. This vyre's not to be trusted... The enemy of my enemy is still my enemy, it just means I'm surrounded. But I can't very well let you go in alone, can I, you damn fool? My cell will go in, but only to cover the retreat when this all goes to Infernus.",
    "Oh, I think this plan is most definitely right up his alley, wouldn't you say, Safalaan?",
    "If we're really doing this, let's at least be smart about it. I'll have Polmafi prepare an exit strategy.",
    "Yes, and we'll have to pass as vyres. Disguises will be in order.",
    "Let's all just get to the arboretum in one piece first, shall we? Player, scout ahead and we'll meet you there.",
    "Go on ahead to Darkmeyer arboretum, Player. We'll meet you there after briefing the rest of the Myreque.",
    "So, this tree is our deliverance? I'm glad I got to see it at least once before I died.",
    "Yes, and I don't care if you trust Vanescula or not - I don't. The way Safalaan defends her, you'd think him a love-struck teenager. I'm worried about him too. He's different since he got back - he seems more reckless.",
    "And let Safalaan go in alone? No chance. Look, we'll play it safe. Safalaan's team will be the ones to spring the trap. My team will hang back from the fight in case things go wrong.",
    "We'll cover their retreat. Polmafi has crafted some teleport tablets to give us a quick escape should we need one.",
    "Right now? Well, we're going to need some vampyre disguises so we can get in unnoticed. I don't think your Darkmeyer outfit is going to cut it with the nobles. We'll need something more prominent, like House Drakan personal guard uniforms. Posing as vyrewatch, the nobles should mostly ignore us, but we can't look out of place.",
    "That overwatch vyre - Mornid - she's in charge of the vyrewatch now, she should know. She should be waiting for us at the castle gate by now.",
    "Still don't have the Vyrewatch uniforms? We're ready when you are.",
    "Nicely done, lieutenant. Here's your disguise. Don't lose it, though - I'll have to charge you for a replacement set. If you're finished talking to the lads, I'll get these uniforms handed out and we can get this farce over with.",
    "Very well. Let me know when you're ready. In the meantime, we'll just keep carving enough stakes - can never have enough, right?",
    "Good job, lieutenant. Get these cells open.",
    "Thank you - let's free the others.",
    "Well, that worked out well, didn't it? Is everyone here?",
    "I don't care about that harpy. She led us into this mess, she can get herself out of it. We need to think about ourselves.",
    "Player, scout ahead. Be careful. We'll catch you up.",
    "Keep your fangs to yourself, vyre. You led us into this mess; you're not getting our blood too.",
    "Good. We're all still alive.",
    "Praise Saradomin, I thought we'd lost you.",
    "Who's that in the oubliette? Found a new friend?",
    "If the lady can't leave, we'll take her prayers with our thanks. Drakan's days are numbered; we will come back for you, I swear it by Saradomin.",
    "Lead us out, Player.",
    "Don't be so stupid, man. She'll live, and you'll need your strength to get out of here.",
    "I send most of the Myreque to scout ahead. You should explore this area. The vyres think these are the castle cellars and are looking for something to eat that isn't us.",
    "Not to me. As long as Drakan still lives, she needs us. That doesn't mean I trust her.",
    "Don't get me started on that one. I don't like how close they seem to be getting - it's not natural.",
    "How do I feel? I 'feel' like I could murder that vyre witch for leading us into this mess. I'm angry at Safalaan for going along with this stupid plan of hers. And the next time we have a chance at killing Drakan, I'm going to tear him a new one. That's how I 'feel'.",
    "Good work, lieutenant. Now, let's get out of here.",
    "It's about time something went our way. Let's get topside and teleport to safety.",
    "Okay, Myreque, our teleports should work now that we're above ground. Let's get out of here. Polmafi!",
    "'Uh oh'? What do you mean, 'uh oh'?",
    "Surely the teleport block should only cover the prisons and cellars?",
    "What have you done, vyre? Is this some twisted plan of yours?",
    "Fine! We need another way out.",
    "Then we'll have to fight our way out the main gate. Player, take point and lead us out through that portcullis!",
    "No time for sight-seeing, Player. Get that portcullis open!",
    "We need you down here, lieutenant!",
    "Myreque! Fall in!",
    "Not very good at counting, are you, vyre? In case you missed it, you're outnumbered.",
    "Kael! Stay in formation! Kael!",
    "Player, quick - find something to help barricade that door! We need time to regroup.",
    "That should hold them for a while.",
    "Kill it!",
    "All of you, upstairs! Quickly!",
    "Quickly, upstairs.",
    "Get those windows covered! We don't want more of those things getting in!",
    "Whatever else is wrong with her right now, she's also useless. We have more pressing concerns!",
    "Another one!",
    "We can't afford to let those things in! The ease with which it killed Kael...",
    "Quick! More windows in this library!",
    "Hold your ground, Myreque. Player, cover those windows!",
    "Yes, if only Drakan would postpone his little hunting trip - it's so inconvenient.",
    "True, but we must keep moving.",
    "Move up!",
    "Help us with the table, [lad/lass][sic]",
    "Help us shift this table, [lad/lass]!",
    "Mekritus!",
    "Those accursed things!",
    "We still need to cover this window - grab the table, [lad/lass]!",
    "That will have to suffice - let's move on.",
    "Yes. The way that thing threw him...",
    "I'm not losing any more men! Barricade these windows!",
    "Same drill as last time lads!",
    "Lieutenant, get those windows barricaded first!",
    "For all their apparent culture, vyres are still nothing more than monsters. They try to hide it with this veneer of civilisation, but we've seen their evil is always there, sitting just below the surface.",
    "Both.",
    "Good work, Player.",
    "It's about time you snapped out of it, vyre, but I already don't like what's behind us. Maybe now you could actually do something useful?",
    "Spill it, vyre. What do you know that aren't you[sic] telling us?",
    "Well, vyre, are you suspicions confirmed?",
    "And?",
    "Useless! You're not exactly helping us to trust you.",
    "Well, perhaps you're not entirely useless.",
    "*spit* Fine, but be quick! I'll take the west room - Ivan, you're with me.",
    "Okay, Myreque, get to it.",
    "Ah, Player - since you're here, help us look around.",
    "I'm just glad we never got to find out his cruelties first-hand.",
    "Try not to dwell on it, lad. Instead, try to picture Vanescula killing him. Huh - for once I'm glad she's on our side. Keep looking around.",
    "I wouldn't go looking in there, if I were you. This Ranis was one sadistic individual, who knows what you might find?",
    "Ivan, get away from the window!",
    "Check on Ivan! He HAS to be okay!",
    "Make sure Ivan is okay.",
    "By Saradomin's grace! I thought we'd lost you, boy. I was already bracing myself for an earful from Drezel.",
    "Still in Castle Drakan, lad. Give it a minute.",
    "Aye, but you have the birthmark, just like Drezel. You've got holy blood in your veins.",
    "Player, I trust you can keep this knowledge secret. Now, let's rejoin the others - I'll help Ivan, you lead on.",
    "Shh... You never know who's listening.",
    "And hurry with it, we can't hold this position against Drakan!",
    "I'm too angry to think straight. I trust you can break this seal, like you did the others.",
    "Player, we've done all we need to up there. We have to get to the roof.",
    "Alright, Myreque - we've been imprisoned, bled, mocked, hunted and worn down. That stops now! But we're survivors, and we will survive Lord Drakan. When we hit the roof, there'll be nowhere for him to hide. And when it comes down to a straight up fight between us and him, my money is on you lot! If the vyres love blood so much, then let's show them their own!",
    "Good! That just means we'll get another crack at killing him. No holding back this time!",
    "Lead us up, Player.",
    "Where...where are we? This isn't Darkmeyer.",
    "You knew this! You knew and you didn't tell us!",
    "Excellent work, Polmafi - get started immediately!",
    "And you should rest up, boy. I don't want you dying here too.",
    "The pylons, man! Without you we're trapped - move, soldier!",
    "Run!",
    "Quick! Before he comes back! I'll grab Ivan. Everyone else, through that portal NOW!",
    "Leave them! There's no time.",
    "Polmafi - do you still have some of those teleports?",
    "Is it over?",
    "I hate to admit this, but I was wrong about you, vyre...Vanescula. I mean, don't get me wrong - we should never have agreed to your suicidal plan. We lost too many good men. But without you, we'd ALL have been killed.",
    "Huh, to be honest, I was half expecting this to be when you betrayed us. I should have trusted you sooner.",
    "What...what have you done?",
    "I...",
    "We're all lost, kid. The Myreque are lost. We're beaten.",
    "Calsidiu is a lie!",
    "He's not real! He never existed!",
    "No! He's just a name, a stupid name. Safalaan and I, we...invented him.",
    "To inspire hope, that there were more of us out there. If one should fall, others would stand in his name. But it's a lie...it's all a lie. We're all that's left...and I'm done. I can't... Safalaan, you fool - why did you trust her?",
    "The Myreque are dead! Get out of here, kid! Go on!",
    "Go! Both of you, go! I don't want you here. Leave me be.",
    "Leave me be.",
    "We are forsaken..."
  ],
  "Mekritus A'hara": [
    "I'm worried about tha plan.",
    "I can't 'elp it - I'm a worrier. It's kinda what I do.",
    "Do ya think this plan is gonna work? We only recently found a way to even kill normal vyres, but Lord Drakan? It's all 'appened so fast.",
    "Yeah, but...it's Lord Drakan!",
    "Um, well, nothing really. No one has seen of 'eard of him fer centuries - not even Vanescula.",
    "I guess...",
    "How did we even get here?",
    "Phew! I was worried we'd be in here for good.",
    "Ya know, when Veliaf an' Safalaan told us da plan, I was the only one ta disapprove. I can't 'elp feeling that we're doing this fer ourselves, our pride. I regret the ones we've left behind. We've forgott'n the weak'uns. Meiyerditch an' Burgh de Rott, ya know?",
    "You 'ad me worried for a second there, but ya came through.",
    "Let's get outta here!",
    "I got this one.",
    "Kael was my buddy. I've known 'im since we was kids, grew up together. I can't believe he's gone.",
    "This one's mine.",
    "Let's get outta 'ere.",
    "Lift da table!"
  ],
  "Veliaf Hurtz'": [
    "' Like I said, (continues above at \"we're going to need some vampyre disguises so we can get in unnoticed.\")"
  ],
  "'Venial Hurts'": [
    "Okay, listen up, Myreque! Thanks to this tree, we're equipped for vyre slaying, and Lieutenant Player has found us some vyrewatch disguises. I'm going to send [him/her] ahead to scout our path to the castle gate and to inform Vanescula that we're ready. I want you in teams of two - watch each other's backs in there and we'll be fine. We'll be surrounded by vyres, but keep your wits, and try to fit in like '[Player's vampyre name]' here - that is your vampyre name, right? At the first sign that Vanescula's leading us a merry dance, use your escape teleport and get out of there. But if she's on the level, that means we'll be facing off against the meanest, most dangerous vyre out there. Know our target - Lord Lowerniel Vergidiyad Drakan. He goes by many names: the Scourge of Sanguinesti, the Prince of the Blood, the Lord of Vampyrium. Now, you know how I feel about people pumping themselves up with fancy titles, but this vyre is the real deal - he will kill us all given the chance. Do not give him that chance! And remember the signals. Lieutenant Player is the most experienced vyre-killer, so we're going by their judgement on this. If you think we should all retreat, just say 'Hang up the sickle', and we'll retreat to here as our rally point. But if you think we can take him, the signal to spring the trap is 'Bring in the harvest'. Give him no quarter! Are we clear, Myreque?",
    "Now that didn't sound like a resistance group about to take out their biggest threat, did it? I said ARE WE CLEAR?",
    "Then it's over to you, Player. Go inform Vanescula we're ready. We'll be right behind you.",
    "Fly? No one said anything about flying!",
    "Oh, you're loving this, aren't you?",
    "I don't know how you managed to blend in with these fell beasts."
  ],
  "The Myreque": [
    "Sir.",
    "SIR, YES, SIR!"
  ],
  "'Venial Hurts' or 'Deathly Hallows'": [
    "You go on ahead, Player - let Vanescula know we're ready here. We'll follow you in small groups, try not to draw too much attention."
  ],
  "'Vertigo von Cephalitis'": [
    "About as ready as I can be. I've got a stake with Drakan's name on it - literally, I just carved it in!",
    "I don't know how you managed this, Player.",
    "Blending in with these monsters, gaining their respect."
  ],
  "'Mekky Grah'": [
    "I am. Can't 'elp it with all these unknowns. But we'll know those unknowns soon enough, you know? I'm 'anging in."
  ],
  "'Kill Fosho'": [
    "Don't worry, I'm still here.",
    "I think I'm going to be sick...",
    "Oh gods."
  ],
  "'I Vanstrom'": [
    "I'm ready. I mean, I had to throw up a little while you were out getting the uniforms, but I'm good now.",
    "I Vanstrom! My name is I Vanstrom!",
    "Sorry, I got a bit carried away."
  ],
  "'Pygmalion Mardigras'": [
    "I'm actually intrigued by what we'll see when we get in the castle. It was supposedly built on top of Queen Efaritay's old stronghold, you know? Though I'm not exactly a fan of vampyric interior design - it's a bit too stark for my liking - it does have a certain aesthetic quality. And if nothing else, I'll follow your example and map the inside of that thing. You never know when something like that might come in handy.",
    "Do you see the three pylons on the roof? They seem new compared to everything else - relatively speaking, of course.",
    "I'm not sure...but I find them somewhat ominous."
  ],
  "'Rageguard Pain-fire'": [
    "Yeah. 'Harold' and 'Sani' too.",
    "No. I'll let these two do all the 'talking'.",
    "I hate this.",
    "Works for me."
  ],
  "Sentinel Plaguemanst": [
    "You haven't heard? Vanstrom is dead!",
    "A rogue Myreque agent, from what I hear, with weapons from the tree. The rumour is that Drakan has been informed and is furious; especially with Ranis' murder so fresh in his mind. They say he's put a price on the killer's head; a whole vat of blood for the vyre who brings them to him!",
    "Yes. Isn't it great? I haven't had this much excitement in years.",
    "Who goes there?",
    "But your retinue...er, my lady Vanescula...who goes with you?",
    "Y-y-yes, of course. At once. I apologise, my ladies. Open the gate! Open the gate!",
    "I thought you were already on the castle grounds?",
    "I heard rumours that Lord Drakan planned to return all the true-born vyres to Vampyrium, and also to get rid of us human-borns. Who is he to show up after all this time with such demands? Clearly he wasn't strong enough to impose his will on us. I'm glad that Lady Vanescula stood up and deposed him."
  ],
  "You can only smuggle the following items into Castle Drakan": [
    "Darkmeyer outfit, House Drakan outfit, Drakan medallion, blisterwood weapons and ammo, flail of Ivandis, runes."
  ],
  "'Deathly Hallows'": [
    "I'm ready. Take me up.",
    "I think Vanescula likes all of this even less than I do!",
    "I guess not, though I don't know if it's just that she's not a fan of parties or the anticipation of Lord Drakan's arrival.",
    "No! Myreque, attack!",
    "You murdered my parents!",
    "I am Safalaan Hallow, son of Queen Efaritay and King Ascertes!",
    "Don't you dare talk about my mother! I don't believe you! I'll kill you for what you did to them!"
  ],
  "'Mekky Graah'": [
    "We're gonna get found out!",
    "But how? We're just wearing 'oods. We don't even have wings!"
  ],
  "Werewolf": [
    "Please be merciful - I tried to cross, but the barrier hurts.",
    "You have consigned me to a slow and painful death. At least tell me your name.",
    "Well then, Player's vampyre name, I shall curse you with my final breath.",
    "A strange name for a vampyre, but I shall curse it with my final breath all the same.",
    "Not even the courage to be honest with your victims. Then I shall curse the vampyre race with my final breath.",
    "You are beyond cruel to suggest such a punishment. I am thankful that my master did not heed your advice. I still hope to have pups one day.",
    "Aww. At least only my pride is hurt this way."
  ],
  "Lady Nadezhda Shadum": [
    "Silly dogs. I don't know why we still put up with them. We should have had them all put down years ago.",
    "Oh, one of the werewolves in my pack. I sent him to cross the Salve and procure me some exotic foreign blood. But he came back empty handed, said he was unable to cross. Honestly, I've heard rumour of other wolves crossing, why not him?",
    "Nothing but excuses. If he couldn't manage he should have kept trying until he succeeded or died. And now I have to make an example of him. As a rising star of vampyre society, what would you suggest I do with him?",
    "Death is too good for it... but I suppose that would still cheer me up a little. Not here... of course. I'll take it somewhere private and have some fun with it.",
    "Leave it alone? Leave it alone? How will it learn if I don't punish it when it fails? And how do you think the rest of the pack will respond if I let it off? You low-borns are supposed to be good at this sort of thing - you must have a better suggestion for what I should do!",
    "You do realise it's not an actual dog? What good would that do me? I still need it to stud some progeny. I'm not wasteful! How disappointing. I'll ask someone else's advice.",
    "Ha! A nice, clean humiliation. I only joke that it's a dog, but if it fails its master then yes, I will treat it like one. Now, how best to do it? I could shave its fur off? Ooh, and make it wear a cone of shame - yes, the one with the silver barbs...",
    "Killing the werewolf granted me brief satisfaction. I can't help but feel that there was a better solution...",
    "Neuter my werewolf? Really? That's the best advice you could muster? What's wrong with you?",
    "You have an undeniable streak of cruelty that I find most refreshing. I think my property enjoys its new collar."
  ],
  "Frightened man": [
    "P-p-please leave us alone.",
    "(Same as above.)",
    "P-p-please don't let them bite me again! It hurts.",
    "(Same as above.)"
  ],
  "Protective girl": [
    "Take my blood instead of my husband's. He's been through enough!",
    "(Same as above.)",
    "My blood would have been enough, but you had to let them gorge their appetites on my husband too, didn't you? You monster.",
    "(Same as above.)"
  ],
  "Defiant old man": [
    "Vile creatures, the lot of you! Go on, try to take my blood. I've still got some fight left in me!",
    "They can take the blood of a weak old man, but they cannot take my spirit. I'll stop this madness, or die trying. I just need to... rest for a moment. Get my strength back.",
    "(Same as above.)",
    "(Same as above.)"
  ],
  "Catatonic child": [
    "Would you like my blood? Mr Bitey says it is fun. Vampyres are my friends.",
    "(Same as above.)",
    "(Same as above.)",
    "Mr Bitey said it would be fun to give blood, but I don't feel so good. If vampyres are happy, I'm happy. Mr Bitey says so."
  ],
  "Lord Mischa Myrmel": [
    "Second generation personal tithe. They're brought up to view us with fondness, so as not to resist so much.",
    "I'm inclined to agree. Younger humans always taste so bland, and you can't breed out the fear.",
    "Second generation personal tithe. They're brought up to view us with fondness, so as not to resist so much.",
    "I'm inclined to agree. Younger humans always taste so bland, and you can't breed out the fear.",
    "Honestly, I'm not sure what to do with it. You're [Player's vampyre name], aren't you? You have a reputation for dealing with this sort of thing.",
    "My personal tithe - she's a scrawny little thing. When I went for my mid-morning snack today she had the audacity to be unconscious. How should I punish her for such disobedient insolence?",
    "Well, that would certainly teach her a lesson, but personal tithes are getting harder to come by these days. No, it will have to be something else. Do you have a better suggestion?",
    "Well, yes, I'm entitled. If it kills her, though, I'll have to get a new one, which might prove difficult.",
    "I suppose I can miss a meal or two, but I'll make sure she knows not to inconvenience me like this in the future.",
    "Interesting... Not only would I seem to be kind to her, it might even make her taste a bit better.",
    "She's disappointed me for the last time. At least my thirst is sated.",
    "The thirst gnaws at me, but there's already a little colour in her cheeks. I'll drain it soon enough. I must be patient.",
    "Your advice was most sound, Player vampyre name. Her mood has improved, and with it her taste."
  ],
  "Lord Alexei Jovkai": [
    "But they all look so tasty... Which one should I try? What would you suggest?",
    "What a good selection. That defiance will taste ever so sweet.",
    "Hmm, the boy is scared witless, but the girl seems protective of him. A sweet and sour mix. I suppose that's a half-good idea.",
    "Such uncultured tastes. That fear will make her blood taste bitter. Such swill might suit the vyrewatch, but us noble have more refined palates.",
    "How positively decadent, but it does not do for one of such noble breeding to be so unreserved. It's about what I'd expect from an uncivilised human-born. Now, give me a proper recommendation!",
    "Sweet nectar! The rich flavour of an elder heart's defiance, brewed in a long life's suffering. The old ones are the best.",
    "Mmm...a heady cocktail of terror and courage. The pair of them formed an exquisite flavour. Thank you for your recommendation.",
    "Remind me not to ask your advice where it comes to food, vyrewatch. Blood needs to mature to improve its flavour. The bitter taste of a fledgling's fear is ill-suited to my cultured palate."
  ],
  "Blood tithe": [
    "I'm sorry, I couldn't help it. He's been feeding more often lately - I need a rest.",
    "P-p-please don't punish me too much, my lord. I will try to recover more quickly.",
    "Th-th-thank you, my lord. I shall try to do better in the future.",
    "He's been strangely kind to me of late. I don't understand, but I believe I have you to thank, for as long as it lasts."
  ],
  "Lowerniel Drakan": [
    "I am returned.",
    "Yes, that much is obvious, as are your failures as a leader.",
    "I know what you meant, sister. Do not play your games with me, we have much to discuss.",
    "No. What I have to say is for all to hear. I have a decree for the vampyre nation!",
    "Silence! Your lord is speaking. Vampyres of Morytania, hear me! Too long have I languished in solitude. Too long have I left the vampyre nation to govern itself, and allowed it to fall into this sorry state. In ages past, the Stranger from Afar led us to this place. His words twisted us to fit his own design. It was his belief that he was uplifting our race with culture and society, but in truth we were domesticated! Fear not, my brethren, for I have returned, and I shall lead us back to the promised land. The blood in the veins of Morytania is drying up, and I have long since lost my taste for it. It has made you soft - you are farmers now, not hunters. Humans have become our cattle, no longer our prey. I shall take us all to a land flowing with blood, where we can embrace our vampyric history. Vanescula, step forward. Now you may speak.",
    "No. Nor do I care to. We do not need another empire on which to grow fat. I seek to return us to our proud heritage. It has taken many years, but I have created a way for us all to return to Vampyrium!",
    "Do I seem a moody vyreling to you, sulking in my room? No, that 'rock' showed me the way - its loss merely delayed my plans.",
    "I care not for your schemes, little sister. Nor for how you stand before me in your human guise. Are you so ashamed to be a vampyre that you hide it? Or is it to hide your true nature from your human pets?",
    "Spare me your lies. Or would you have me believe your weakness played no part in the deaths of Ranis and Vanstrom? You - my sister's personal guard - step forward!",
    "What is your name?",
    "Would you too deny weakness? Am I truly to believe that mere humans murdered your master? Speak!",
    "You speak truth! Weakness sits at the heart of all human-born vyres...but it has also crept into the hearts of true-borns. When we return to Vampyrium, we shall excise this weakness from our ranks.",
    "That is a bold claim. Is there any truth in this, sister?",
    "Then this human-born vyre shames you all. If you have not the strength to maintain your status, you have no rights to it!",
    "Is this true, sister?",
    "How else could you have allowed such a thing to happen if not through your weakness?",
    "I like this vyre - [he/she] speaks plainly to me. And what are your thoughts on keeping humans captive?",
    "I could not agree with you more.",
    "You sound surprised. Humans are not built to live in captivity. And free-range blood tastes so much better.",
    "If you truly think that, you have clearly only ever fed on scraps. Humans need hope and love - it sweetens their blood. The morsels in these lands are bitter. That you think them delicious only speaks of this nation's failings.",
    "Oh, they will be, but not for the reasons you might wish it.",
    "Their sacrifice is required to send us home. We shall make it merciful and swift.",
    "Not yet, I haven't, but I shall! Finally, what do you feel about human vampyrification?",
    "No doubt. You have been blessed...but humans are not worthy of such a blessing! If the human-borns were not such shame to my so-called nobles I would have them all put down.",
    "Impertinence! That you feel you could say such a thing in my presence speaks to the rot at the heart of this nation. In this nation's glory, a dozen true-borns would have already torn you limb-from-limb for showing such disrespect.",
    "Yet again, we are in agreement.",
    "The creation of your like was a mistake. You are a burden on our resources, and my nobles' reliance on your kind's servitude has made them weak. Vampyres should be sired by true-borns alone.",
    "Then perhaps you shall!",
    "I have one final question for you, [Player's vampyre name] - tell me... Do you take me for a fool?",
    "To think that I would not smell the defiance in your blood? That I would not sense the creaking of blisterwood around me? How transparent my sister is to me? HUMAN! Choose your next action wisely...",
    "And what is this here?",
    "I have killed many parents, boy. Many children too. I don't remember them; I won't remember you.",
    "Who is he to you, sister? Who is he that I should not just eat him right now?",
    "Hahahaha! Ah, yes, now it comes back to me - you smell just like them. But I did not kill your parents, boy. Your father's killer stands amongst your allies, and your mother...well, your mother...",
    "Graah!",
    "Kill the traitorous vyrewatch. Keep these humans alive...for now. But separate the half-icyene.",
    "Leaving so soon?",
    "Such defiance - just like your mother. At least, before I broke her. You, I think I'll just eat.",
    "Oh, I don't need help. But if it would make you feel better...",
    "Good. Everything is in place. Now the hunt can begin!",
    "If you insist on siding with humans, on looking like one, then I will hunt you like one! Here, let me show you how...",
    "Oh, that's simple...",
    "Where would be the sport in that? Zaros's interference led us astray. His words twisted my mind, made me want to conform, to be 'presentable' and restrained. Vampyres are none of these things. I hunt and I kill and I eat. I do it to live and because I enjoy it. I am a hunter and you are my prey - there is nothing more pure than this.",
    "Yes, but unlike my dear sister, I do not deny this truth - I embrace it!",
    "I knew my decree to return here would not be welcomed by the vampyric nobility. I fully expected to have to crush the dissenters so as to reaffirm my authority. Though I'll admit I did not expect my sister among them. It's not like she hasn't tried to kill me before, you understand. I just thought she had more sense. Bringing you here ensures a fair game, but it also demonstrates my resolve to the nobles.",
    "And it does need you?",
    "I know your plan, dear sister, and that you will ultimately fail.",
    "But I know you, sister. You have always lacked conviction. Besides, I do not play with my food... I eat it!",
    "(Lands in the centre of the roof) Oh, I hope you weren't planning to leave without a proper farewell.",
    "Pitiful.",
    "Enough games. It is time the Myreque faced a true vampyre!",
    "Get over here!",
    "Do you think you can escape?",
    "Running will not help you.",
    "Still trying to run?",
    "Accept your fate, morsel.",
    "Run all you want...",
    "(Teleports to you)  You can't escape the darkness.",
    "Yes, you fight well! I am weakened. But you see, unlike you humans...",
    "We're not that easy to kill.",
    "Embrace darkness!",
    "Fear me!",
    "Graaah!",
    "We're not done yet!",
    "It cannot be!",
    "You have...spirit. I shall enjoy...breaking it.",
    "Never! The blood hunt...is not done. Your friends' blood will replenish me. Then we can continue our fight!",
    "GRRAAAAAAAAAR! [Exact amount of A's is uncertain, based off the same line from his Phase 4 ability]",
    "No! I shall not be denied! Run, morsel!",
    "GRRAAAAAAAAAR!",
    "You are...strong.",
    "Ha! I've never had to work...so hard...for a meal. Does Vanescula still live? She is stronger...than she looks.",
    "She is...my sister.",
    "Nor would she have...without yours. Remember that. It is time...for the blood hunt...to end. I regret nothing. But know this, morsel... She will betray you...before the end."
  ],
  "Myreque": [
    "Don't draw attention to me. Pay attention to Lord Drakan."
  ],
  "???": [
    "Are those your allies? Even the vampyre?",
    "No, I can't come with you. My prison is deeper than just this hole. Drakan holds a greater sway over me. So long as he lives, I daren't even think of escape. Though yours are the first voices I have heard in too long. I thank you for your company, but it sounds like you must go now. I will pray for your safe return home.",
    "You must. Drakan will know if I'm gone, and I fear what he might do. I have faith that your group will find a way to defeat him still. Only then could I escape.",
    "Then I place my faith in your vow.",
    "He...he is dead? I am free!"
  ],
  "'Notes from The Black Prince": [
    "The Memoirs of Prince Tenebra Remanis' Whole sections have been removed from the beginning."
  ],
  "'Bloodreign": [
    "The Art of Torture' A list of dos and don'ts for vampyres who want to torture other vampyres. Apparently, vampyres have a fear of being impaled through the chest or head."
  ],
  "Drezel": [
    "Ivan, Player, what are you both doing back here? Not that I'm not pleased to see you, but what's happened?",
    "Calm down, Ivan. Take your time.",
    "Ivan has been very quiet. I'm worried about him. He's spending a lot of time researching the Ivandis Seergaze and the other priests.",
    "The Salve's barrier must be strengthened...",
    "Ivan has told me all that transpired. I am sorry for your losses.",
    "But what of the Edicts? He can't dare risk breaking them!",
    "Why not send his army into Morytania itself then - surely the risk is the same?",
    "Then let us focus on what we can. It is a good thing you have returned, Ivan. We must work together to find a way to strengthen the blessing on the Salve."
  ],
  "King Roald": [
    "Go on.",
    "By Saradomin's beard! The Myreque have made short work of House Drakan. When this is all over, we must find a way to thank them - Aeonisig, take a note.",
    "Aeonisig, is there any truth to this?",
    "Why did you not inform me of these things?",
    "It is not your place to determine such things! Prepare a detachment to be sent to Paterdomus as soon as possible!",
    "Damn the Edicts! Do it now, or the only advice you'll be giving out is which flowers my wife should be planting next! Keep them on this side of the Salve for now, but then you and I will be having a little chat.",
    "Even discounting the Edicts, I cannot risk sending a force into the heart of Morytania. Varrock's army is not what is used to be. We have no choice but to make our stand at Paterdomus.",
    "Hmm, perhaps the work of a lone spy behind enemy lines could help? You've made such great strides already, I can think of no one better for such a task.",
    "How indeed. Have troops been sent to Paterdomus yet, Aeonisig?",
    "Well, hurry about it then, man!"
  ],
  "Aeonisig Raispher": [
    "No matter - the Salve will protect us.",
    "Now, hang on there! We've already done all that we can by enacting the mercenary protocol. Anything more and we risk breaking the Edicts of Guthix.",
    "There have been further reports of werewolf sightings, still unsubstantiated. And this so-called splinter group was nothing more than rabble in clashing robes.",
    "I did not think it worth bringing to your attention. Your time is precious.",
    "But, my liege - the Edicts...",
    "Not yet, my liege, but I assure you this is my highest priority."
  ],
  "Sentinel": [
    "You really don't keep up with current affairs, do you? Lord Drakan himself came back to punish Vanstrom's killer, but ended up getting killed himself!",
    "No, but Lady Vanescula is in charge now, and she apparently recovered a hidden cache of blood from somewhere. The nobles are eating well these days, and the vyrewatch are being more obedient."
  ],
  "The following text is transcluded from Transcript": [
    "Plaque (Burgh de Rott)."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:The_Lord_of_Vampyrium?oldid=35985712’"
  ]
}