{
  "Player": [
    "Hello. How are you?",
    "What's wrong?",
    "That's not a job for me.",
    "I can do that for you.",
    "Where can I find some protective clothing then?",
    "How will I know which sheep are infected?",
    "That's life for you.",
    "I'll do my best sir.",
    "Some more sheep poison would be appreciated...",
    "Hello doctor. I need to acquire some protective clothing so that I can dispose of some escaped sheep infected with the plague.",
    "Sorry doc, that's too much.",
    "Hello again.",
    "Not yet.",
    "No, I don't need any more.",
    "Uh... yeah... not quite just yet...",
    "Ok, I'll get to it.",
    "It doesn't look very safe in there. I'm not going in without decent protective clothing.",
    "Hello there.",
    "The sheep looks extremely unwell. I don't want to touch it without a full protective suit.",
    "I'm not prodding a sickly-looking sheep with my hands! I'll need to wield an appropriate tool.",
    "I don't think I should kill the sheep outside the enclosure. The councillor was worried that it might spread the plague.",
    "Yes, I have.",
    "Hello again sir.",
    "Fine thank you. And yourself?",
    "Like what?",
    "Hello there. Sorry about your sheep..."
  ],
  "Councillor Halgrive": [
    "I've been better.",
    "You may or may not be aware, but a plague has spread across Western Ardougne. Now, so far, our efforts to contain it have been largely successful, for the most part. However, four sheep recently escaped from a farm near the city. When they were found, we noticed that they were strangely discoloured, so we asked the mourners to examine them. They found that the sheep had become infected with the plague. As the councillor responsible for public health and safety here in East Ardougne I am looking for someone to herd these sheep into a safe enclosure, kill them quickly and cleanly and then dispose of the remains hygienically in a special incinerator. Unfortunately nobody wants to risk catching the plague, and I am unable to find someone willing to undertake this mission for me.",
    "I do not blame you adventurer. It is not particularly pleasent work. My problem remains however. If you know of anyone suitable please send them this way; time is of the essence.",
    "Y-you will??? That is excellent news! Head to the enclosure we have set up on Farmer Brumty's land to the north of the city; the four infected sheep should still be somewhere in that vicinity. Before you will be allowed to enter the enclosure, however, you must ensure you have some kind of protective clothing to prevent contagion.",
    "Doctor Orbon wears it when conducting mercy missions to the infected parts of the city. You should be able to find him in the chapel just north of here. Please also take this poisoned sheep feed; we believe poisoning the sheep will minimise the risk of airborne contamination, and is of course also more humane to the sheep.",
    "The poor creatures have developed strangely discoloured wool and flesh. You should have no trouble spotting them.",
    "That's what concerns me... There might not BE much life around here soon.",
    "Please... please find and dispose of those diseased sheep as quickly as possible. Every second the risk of contamination grows!",
    "Certainly adventurer. Please hurry!",
    "Have you managed to find and dispose of those four plague-bearing sheep yet?",
    "Not quite's not good enough. It is vital you catch, kill, and incinerate all four sheep as quickly as possible. Each second they are free the risk of further contagion increases.",
    "Have you managed to find and dispose of those four plague-bearing sheep yet?",
    "Excellent work adventurer! Please let me reimburse you the 100 gold it cost you to purchase your protective clothing. And in recognition of your service to the public health of Ardougne please accept this further 3000 coins as a reward.",
    "Well hello again adventurer! How are you today?",
    "MUCH better now that I do not have to worry about those horribly discoloured sheep spreading the plague. Although we still have plenty to worry about!",
    "Well, you never know what will happen. Not so long ago two gods turned up in Lumbridge and started fighting. I'd hate to think of that happening here! Have you seen how they left the castle?"
  ],
  "Doctor Orbon": [
    "Protective clothing? I'm afraid I only have the one suit which I made myself to prevent infection from the contaminated patients I treat. I suppose I could sell you this one and make myself another, but it would cost you at least 100 gold so that I could afford a replacement.",
    "I'm afraid it will cost me that much to replace: I cannot possibly sell it for less.",
    "These should protect you from infection.",
    "Did you dispose of those infected sheep yet?",
    "You MUST hurry! With the rate of infection I have documented in West Ardougne, they could infect the entire town in a matter of a few days!",
    "I notice you do not appear to have your protective clothing with you. Would you care to buy some more? Same price as before.",
    "I suggest you go and retrieve your protective suit then. Trust me, you do NOT want to be infected.",
    "Well hello again. I was so relieved when I heard that you had managed to dispose of the plagued sheep successfully. It means that our quarantine is working again."
  ],
  "Farmer Brumty": [
    "Hello adventurer. Be careful herding those sheep; I don't think they've wandered far, but if you touch them you risk getting infected by the plague. I suggest you use the cattleprod from the barn over there to herd them, that way you won't have to touch them directly and risk infection.",
    "That's alright. It had to be done for the sake of the town. I just hope none of my other livestock get infected."
  ],
  "[Sick-looking sheep]": [
    "BAAAAA!",
    "Baa"
  ],
  "Congratulations! You have completed": [
    "'Sheep Herder' - Complete this  quest."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Sheep_Herder?oldid=36025468’"
  ]
}