{
  "Broken clay golem": [
    "Damage... severe... task... incomplete...",
    "Repairs... needed...",
    "Graar! Must... not... injure... human...",
    "Damage... severe..."
  ],
  "Player": [
    "Shall I try to repair you?",
    "I'm not going to find a conversation here!",
    "What enemy?",
    "How do I open the portal?",
    "What makes you think you can defeat the demon?",
    "I'll get right on it.",
    "What do you do here?",
    "What is this place?",
    "I don't know, Varrock palace is impressive.",
    "What happened to the city?",
    "I found a letter in the desert with your name on.",
    "Where did you say the notes were?",
    "Where is the statuette that Varmen took back from Uzer?",
    "I'm looking for a statuette recovered from the city of Uzer.",
    "No, I need to take it away with me.",
    "I want to open a portal to the lair of an elder-demon.",
    "Well, I, er, just want it.",
    "It's okay, the demon is dead!",
    "No, you don't understand. I saw the demon's skeleton. It must have died of its wounds.",
    "I already told you, he's dead!",
    "Oh, how am I going to convince you?",
    "But the whole city is destroyed! Doesn't that bother you?"
  ],
  "Clay golem": [
    "Damage repaired... Thank you. My body and mind are fully healed. Now I must complete my task by defeating the great enemy.",
    "A great demon. It broke through from its dimension to attack the city.",
    "The golem army was created to fight it. Many were destroyed, but we drove the demon back!",
    "The demon is still wounded. You must open the portal so that I can strike the final blow and complete my task.",
    "My task is incomplete. You must open the portal so I can defeat the great demon.",
    "The four statuettes in the temple must be turned to the correct pattern.",
    "I do not know the pattern. Golems are not permitted to open the portal.",
    "If not I, then who else? No living being can destroy the demon. That is why the golems were created in the first place.",
    "But the demon was badly wounded and elder-demons heal very slowly indeed. It was almost dead when it retreated to its own dimension.",
    "Now that I am repaired, I will be able to destroy it easily!",
    "My task is incomplete. You must open the portal so I can defeat the great demon.",
    "The demon must be defeated...",
    "Demon must be defeated! Task incomplete.",
    "My task is incomplete. You must open the portal so I can defeat the great demon.",
    "Task incomplete.",
    "New instructions... Updating program...",
    "Task complete!",
    "Thank you. Now my mind is at rest.",
    "Thank you for helping me. A golem can have no greater satisfaction than knowing that its task is complete.",
    "I was never programmed to appreciate the city. My only purpose was the destruction of the demon, and that is achieved!"
  ],
  "The following text is transcluded from Transcript": [
    "Letter (The Golem).",
    "Varmen's notes."
  ],
  "Elissa": [
    "Hello there.",
    "I'm helping with the dig. I'm an expert on Third Age architecture.",
    "In the Third Age, this was a great city, which would have put Varrock to shame!",
    "Hmph. I don't think it will look this good when it's been buried in the ground for three thousand years!",
    "No one knows for sure. But the Third Age was a time of destruction, when the gods were violently at war. Many great civilizations were destroyed then.",
    "Ah, so you've found the ruins of Uzer. I wrote that letter to my late husband when he was exploring there. That was a great city as well, but the museum could only fund one excavation and this one was closer to home. If you're interested in his expedition, the notes he made are in the library in the Exam Centre.",
    "Hello there.",
    "They're on a bookcase in the Exam Centre.",
    "Hello there.",
    "The statuette? Oh, yes... That statuette was the only thing we had to show from that expedition. It was very worn, but you can still make out a lot of detail. The Uzerians were expert sculptors. It's a pity we only have that small example. Now it's on display in the Varrock museum."
  ],
  "The nomads were right": [
    "there is a city here, probably buried for millennia and revealed by the random motions of the sand. The architecture is impressive even in ruin, and must once have been amazing. One puzzling factor is the pottery—there are fragments all over the ruins, surely too much for a city even of this size. We have set up camp and will do a proper survey tomorrow."
  ],
  "Septober 21": [
    "As we examine the ruins one thing becomes increasingly clear: most of the damage was not due to weathering. The buildings were destroyed by force, as if torn down by giant hands."
  ],
  "Curator Haig Halen": [
    "Welcome to Varrock Museum!",
    "Ah yes, a very impressive artefact. The people of that city were excellent sculptors. It's in the display case upstairs.",
    "What do you want it for?",
    "Good heavens! I'd never let you do such a dangerous thing.",
    "Well, you can't have it! This museum never lets go of its treasures."
  ],
  "You write on the papyrus": [
    "YOUR TASK IS DONE"
  ],
  "Congratulations! You have completed": [
    "'The Golem' - Complete this quest."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:The_Golem?oldid=36119910’"
  ]
}