{
  "Player": [
    "Hey Golrie! How are you doing?",
    "Actually, I came here for Glarial's pebble.",
    "Sure, I'll help you out. First, I have a few questions.",
    "Can you show me the letter again?",
    "Who's Gena?",
    "How long have you had the letter?",
    "Woah, nobody said it was your fault. Don't worry, we'll get to the bottom of it.",
    "What should we do next?",
    "Your mum?",
    "That'll be all, thanks.",
    "Pleased to meet you.",
    "Maybe. I hope he says good things about me.",
    "Ah, yes, that's me.",
    "If I may... I've been in Arposandra's sewers, fought mutated terrorbirds and operated anti-illusion devices. To be honest, I could probably do this by my...",
    "Yes, let's go.",
    "I have a few things to do first.",
    "There's a ledge here. We should be able to cross.",
    "'Freakish'?",
    "I can't go any further. That next stone is too far away.",
    "Haha! Well. I'm sure Bolrie found a way round that didn't involve hitch-hiking on adventurers.",
    "There's a small crevice here.",
    "Relax? Just you wait, we'll come across a really high lever and then you'll need me.",
    "Hello again, Ilfeen.",
    "Thanks, I'll read all about it.",
    "Goodbye, Ilfeen.",
    "Goodbye, Ilfeen.",
    "That's the last of them! I've got everything I need to build the device.",
    "The device is built, but it doesn't seem to work yet.",
    "Yes. I just need a bit of time to figure it out.",
    "Yes. I'm not sure how it works though.",
    "I don't know what I have to do.",
    "Thanks!",
    "I don't know how to make crystal coins.",
    "Right.",
    "Thanks.",
    "I don't know how to find the right combination.",
    "Okay, I'll give it a try.",
    "Actually, never mind. I think I know what I'm doing.",
    "Thanks.",
    "No. How do I calibrate the machine?",
    "Thanks",
    "Finished! I've followed the instructions carefully. It should work!",
    "Yes, let's go.",
    "I have a few things to do first.",
    "You're right!",
    "No problem!",
    "Like a rock tied to the end. I have other uses, you know.",
    "Is that Glouphrie?",
    "With Glouphrie, you can't be sure of anything. Those gnomes: they're all dressed like Glough.",
    "A vindictive gnome who used to be a Grand Tree Guardian – until he tried to kill the Grand Tree and frame humans for the crime.",
    "Perhaps. It may be that Glough comes from Arposandra. Let's get going before they notice us.",
    "It's rather dark in here.",
    "That's my head! Would you please get off?",
    "I can see an opening further down.",
    "The rope doesn't seem to go any further dow-",
    "Ow! Watch where you're go-",
    "Aaaah!",
    "Urrgh.",
    "Well, I've just been pushed to the bottom of the chute. You?",
    "You sure you didn't push me on purpose? Oh, never mind: wait there, I'll try to find you.",
    "These tortoises, are they...mining?",
    "I should get out of here before I get noticed.",
    "No. I've seen what's there and I've got better things to do, like looking for Bolrie and Golrana!",
    "My name is [Player]",
    "Yes! Fear me!",
    "Well done, you just passed the test. No need to press that red button.",
    "I...am a gnome disguised as a human sent to test your reactions in case of a human invasion. You have followed the protocol and succeeded. Congratulations!",
    "Absolutely! Why don't you take a break now? I'll guard the prisoner while you're away.",
    "No, I'm a gnome. Can't you tell?",
    "I am one of the tallest. That's why they sent me to do the legwork. I am here to check on the prisoner.",
    "Can you leave the room? I need to interrogate this prisoner, and it is a confidential matter.",
    "I'm a gnome. Can't you tell?",
    "I am one of the tallest. That's why they sent me to do the legwork. I am here to check on the prisoner.",
    "Can you leave the room? I need to interrogate this prisoner, and it is a confidential matter.",
    "That's because I'm disguised as a human. I came to test you, and you failed the test by neglecting to raise the alarm. You shall be relegated to watching over the downstairs area. Please leave. I will take over.",
    "No, we can't take the chance. It could be worse: we could have dumped you in the sewers.",
    "Your master, Glouphrie.",
    "I am one of the tallest. That's why they sent me to do the legwork. I am here to check on the prisoner.",
    "Can you leave the room? I need to interrogate this prisoner, and it is a confidential matter.",
    "That's because I'm disguised as a human. I came to test you, and you failed the test by neglecting to raise the alarm. You shall be relegated to watching over the downstairs area. Please leave. I will take over.",
    "No, we can't take the chance. It could be worse: we could have dumped you in the sewers.",
    "I can't believe I got away with that.",
    "Are you Bolrie?",
    "Will you snap out of it and let me speak? My name's [Player]. I'm getting you out of here.",
    "Who's this Glouck you keep talking about? I thought Glouphrie was in charge of this place?",
    "I travelled with your daughter to rescue you after your grandson, Golrie, found your last letter.",
    "I fell down the shaft and we got separated. I landed in what looked like a mine, while she came out on this level, the prison level, I think. We should go and find her.",
    "Hey, I'm not clumsy! She pushed me down accidentally – I think. And she can certainly handle herself. If you are so worried about your daughter, we should go and look for her as soon as possible.",
    "We decided to split up, so that we would find you quicker. I guess I found you first.",
    "What's with the 'little'? Trust me, she can handle herself. Anyway, if you're really worried for your daughter, we should go and look for her.",
    "She is waiting for us somewhere safe. I'll take you there.",
    "For one, I don't know who Glouck is...",
    "You know, you could always ask me questions that Glouck couldn't answer. If he's spent his life in Arposandra, there must be plenty he doesn't know.",
    "Teclyn?",
    "Ilfeen.",
    "Arianwyn?",
    "Oronwen?",
    "I don't remember.",
    "Golrie?",
    "Golrana?",
    "Gena.",
    "Bolren?",
    "I don't remember.",
    "We followed the instructions in your lab, made a portable anti-illusion device and scouted the west of the mountains. There, we found an aeration vent that wasn't there before. We tied up a rope and came down.",
    "28?",
    "35?",
    "42.",
    "64?",
    "I don't remember.",
    "The Grand Tree.",
    "Mountains?",
    "Gena?",
    "The sea?",
    "I don't remember what the painting was like. I do remember that there was a pot of rune glue behind it, though.",
    "Okay, I admit, I didn't know the answer to any of those.",
    "But we have to get out of here! Trust me, give me a second chance.",
    "Otherwise you'll lose the chance of freedom and of seeing your daughter again, and for what? All because I'm a human? Why on earth would I go through the trouble if I wanted to trick you? To put you in prison again?",
    "One more chance, then. If you don't know the answer, don't lie to me!",
    "Okay, I admit, I didn't know the answer to a lot of those.",
    "Okay, I admit, I didn't know the answer to some of those.",
    "Please, Bolrie, come with me.",
    "Please, give me another chance! Golrana wouldn't forgive me if I left you behind.",
    "I'm not an illusion. Let's say I'm so focused on your rescue that I ignore everything else.",
    "Look - would Glouck ever do this?",
    "Golrana? She's fine, I'm sure she's just around the corner. We'll meet up with her in no time.",
    "Could you stay in this alcove for a minute while I go and get Golrana? I want to make sure the coast is clear.",
    "Golrana, I found...",
    "Let's get out of here before they find us. I hope your dad is where I left him.",
    "We can catch up later. We need to climb up the chute. I'll go first; Golrana, Bolrie, attach yourselves to the rope and I'll pull you both up.",
    "There! That should keep them occupied for a while.",
    "Oh no, not again...",
    "I can promise you he isn't. If he was a trick, we'd know, because Golrana is wearing a portable anti-illusion device.",
    "Hello again Bolren.",
    "I found Arposandra!",
    "Briefly, yes. It really is a dangerous place.",
    "Maybe, one day, you'll believe me.",
    "I'll help, you can count on that. You're not the only one who wants to get to the bottom of this.",
    "It's okay, Golrie. It all worked out in the end. Although, I'm fairly certain your granddad hasn't given up with his plans to bring down Glouphrie and Arposandra. Keep an eye on him and make sure he doesn't go and do anything silly, will you?",
    "I heard your mum's staying around the village now, to train as a tree whisperer. Your mum is full of surprises.",
    "Bye!",
    "Actually, I came for Glarial's pebble.",
    "Hello again. Are you still offering to chant seeds?",
    "There is something I meant to ask you about. Do you remember Oaknock? He was a gnome inventor.",
    "I think Oaknock died of old age a few hundred years ago now...",
    "Did you ever give him a seed?",
    "I think he did! Thanks."
  ],
  "Golrie": [
    "Hey, [Player]! Nice of you to come down for a natter. Actually, I wanted to talk to you. Remember how I said I was going to sort all this junk out? Well, I started on it, and, while I was taking a break with a book, I realised that my bookmark was a letter from Gramps. It might be the last one he sent, and, well, have a look: I don't know what to do.",
    "So, you're going to help, right?",
    "Fire away!",
    "That's grandma. She died like seven years ago. She smelt of worm crunchies and confused me with Gramps a lot.",
    "I don't know! It would've been years, but I don't know how long. There have been so many of them.",
    "I'm not the family's secretary! Why should it be my fault if Gramps is in trouble?",
    "We're going to need an adventurer: someone who will recklessly bound into Arposandra, vanquish an army of gnomes, throw Gramps over their shoulder and be back home in time for cocktails.",
    "We're going to need...my mum.",
    "She's in the centre of the village at the moment. I'll introduce you. Just don't mention anything about the bookmark.",
    "[Player], this is my mum, Golrana.",
    "And mum, this is [Player]. [He/She]'s been helping me to catalogue Gramps' stuff.",
    "Mum, sorry to interrupt, but [Player] found this in the storeroom downstairs. [He/She]'d been using it as a bookmark.",
    "It probably arrived in Gramps' last shipment a few years back, but I'm not sure.",
    "You can't go on your own, mum. I said that [Player] should go with you.",
    "Right, I'll go back to the cave. All this excitement has given me the urge for a nap.",
    "What's all the noise?",
    "Hello, [Player]. Did you come to tell me about Gramps?",
    "[Player]! I can't thank you enough for getting Gramps out of that pickle! You can't imagine the trouble you would have been in if anything had happened to him. Can't believe you left that letter in a book.",
    "Mum will help with that, don't you worry. I'll keep doing what I do. You know, cataloguing and stuff.",
    "Yeah? Well, your mum... Naah, just kidding! Anyway! Thanks again, [Player]! I'll see you around!"
  ],
  "Golrana": [
    "Wait, are you THE [Player]? The one my uncle keeps going on about?",
    "He said that you saved the Tree Gnome Village by bringing back the protection orbs from the Khazard warlord, and got rid of Glouphrie's evil watchers.",
    "I would have gone about it a little differently, but still: pretty heroic, for a human.",
    "Show me that, Gogo!",
    "This is terrible news! I can't wait a moment more. Gather my quest kit, Gogo: it's time to bring dad back, once and for all!",
    "You shouldn't make promises you can't keep, Gogo. The letter asks for a gnomes's help.",
    "Yes, yes, yes. Fair enough, you can come along as my quest apprentice.",
    "I'll get ready and will meet you just before the Galarpos Mountains. They're the mountain range to the west of here.",
    "Travel west through the valley between the Observatory and the lava fields until you reach some shrubbery. I'll take everything we should need and will meet you there; you pack a determination to learn from the best.",
    "Ah, [Player]! I hope you've done your stretches; it's going to be quite the climb. I've had a quick look around the area and I think we can squeeze between these plants. Ready to go?",
    "To Lletya!",
    "Make sure you hurry!",
    "[Player], please say you are ready to go.",
    "Really? You haven't figured it out yet? Here's a hint: why don't you look under the big dead tree over there?",
    "It's too fragile. You'd only fall down and break one of your freakishly long legs.",
    "Okay, I take it back: you have the legs of a terrorbird. Now, wait here.",
    "You can do it! Baby-steps across the rope!",
    "We need to find another way round. Those stones are too slippery, and there's no way you're going to stuff me into your backpack.",
    "My turn again, so soon? Put your feet up and relax, but don't run off while I'm in there.",
    "Of course, we will, [Player]. Of course.",
    "There's no crevice too small for Golrana to squeeze into! Now, let's get you over to this side. I'll push the stone in the water so you can get across.",
    "Onwards! It can't be far to the other side.",
    "Fresh air! What an interesting smell! It smells like a forest, but so unlike any I've visited before. We must be getting close to the elven lands!",
    "That's a breathtaking view - truly beautiful. Now, we just need to find a way down to Lletya. Perhaps there's something we can tie a rope to.",
    "In my experience, a tree this sturdy would hold me without a problem. Of course, I couldn't say the same about you.",
    "But I say we give it a go!",
    "That was a nifty reef knot, [Player]! We just need to go down this rope and we'll be in Lletya. Go Team Golrana!",
    "Greetings, elf. I'm Golrana. I'm not exactly experienced talking to elves, so please excuse us if we're insulting you by being here. I was hoping to speak to Ilfeen.",
    "We are indeed.",
    "We only found it recently. Let's say that we came as soon as we could. By the way, this is [Player]: [he/she]'s going to help me in this mission.",
    "You've got no shortage of good references, [Player]! Anyhow, Ilfeen, the letter mentions that you would help us to find my father.",
    "That I am.",
    "You know, this place isn't dissimilar from Golrie's cave. Look: there are a couple of books lying around, [Player]. You should read them to see what needs to be done.",
    "This diary is fascinating! My father's character just leaps from every page! Before, I only knew him from my mum's recollections and his diary.",
    "We should make an anti-illustion device. I bet that everything we need is in this room: we just have to look.",
    "I'm no expert, but it looks like we have everything we need! We should be able to build the device now.",
    "How is it going, [Player]?",
    "According to the research notes, the machine needs to be calibrated. Have you...uh...calibrated it?",
    "Fair enough. I'm here for moral support. I'm not sure I can help in any way, but I support you.",
    "Which particular (sic) are you having trouble with?",
    "As far as I can see, you have to make the right colour and shape of crystal coins using the bowl and prism over there.",
    "The exact value and colour of the coins depends on what the calibration device requires. Try combinations of coins and see what happens. When a combination of coins corresponds to the target colour and intensity, the machine will tell you.",
    "There are three different combinations to figure out. Once you have successfully entered all three combinations at the same time, the machine will be calibrated.",
    "First you need to find some minute crystal seeds. You can find some in one of the crates. Then you have to use the bowl and prism over there.",
    "There are two things you can adjust: the rotation of the prism on the table will affect the colour of the final coin; how full the bowl is will affect the shape of the coin, as detailed in the research notes.",
    "When you're all set, sing the bowl and all your seeds will turn into the corresponding coins. If you revert the coins using that song, only the coins of the corresponding shape and colour will revert to seeds.",
    "The colour mixing section of the research notes lists the colours you receive from each combination of colours. To find the intensity of each combination, you have to find the intensity of each coin and add them up.",
    "I'll be there if you need me.",
    "According to the research notes, you should use the calibration device. It's on the crate over there, if I'm not mistaken.",
    "You should check it out.",
    "By Oaknock's saw, [Player]! I feel I've misjudged you. In several lifetimes, I could never have constructed that.",
    "Now, I don't think we'll be needing any more of those crystal coins. Would you like me to put them back for you?",
    "There we go.",
    "As you wish. But don't come back later begging me to take them, because I won't. Now's your chance!",
    "Anyway, we have to push on: I'll strap this onto my back and meet you at the Lletya bank. You may be a master craftsman, but I'm pretty sure I'll beat you in a footrace!",
    "Right, you ready to go? Feeling limber?",
    "I'm right behind you.",
    "Make sure you hurry!",
    "We need to scout around and see if this machine reveals anything. There has to be a way into Arposandra somewhere in these mountains.",
    "Look! What's that? It wasn't there before!",
    "It must have been revealed by the anti-illusion device. Let's open it.",
    "An air vent in the middle of the mountains? I call shenanigans! Here, attach this rope and feed it into the hole.",
    "Let's go down this hole. Since you're the heaviest of us, you should probably go first. You'll steady the rope for when I go down.",
    "Glouphrie can't be alive. That makes no sense.",
    "Who's Glough?",
    "You seem to know more about our race than I do! You think the gnomes are related to Glough?",
    "I've found something! It's hollow.",
    "Ha, sorry!",
    "Sorry! You okay?",
    "I managed to grip onto that vent you missed. It leads to a quiet corridor. I'll have a look around.",
    "Shhhhhhhh! Look...",
    "Dad? Is that you?",
    "Quick, [Player]! We removed the rope, but the gnomes in black will find other ways up. Push that boulder in front of the vent!",
    "Quick, we need to seal that hole so they don't come after us! Can you push that rock in front of it?",
    "Dad, is that you? Are you all right?",
    "Oh, dad. Just hug me, will you.",
    "You may not know it, but you've been gone for a long, long time. I could barely walk when you left, and now my hair is going grey.",
    "Oh, Dad...",
    "Mum died...",
    "Mum died, Dad. She died seven years ago.",
    "Mum passed away quietly in her sleep. She never stopped thinking of you, even at the very end.",
    "And every time she saw Golrie, your grandson, she'd note how much he looked like you. Gogo's more like you than he knows.",
    "You've been away so long! Almost two hundred years!",
    "Of course, Dad. Why else do you think I'm here?",
    "We all suffered, like you did, but we dealt with it and became stronger because of it. I wouldn't have travelled the globe, seen the things I've seen, had you become king. Although you couldn't forgive yourself, it only took a few years for people to forget about your 'disgrace'. Uncle Bolren supported us from the start, and soon let us live above ground. He's the king, you know.",
    "As soon as I was old enough, I left the Tree Gnome Village. At first I told myself that I was looking for you, but I soon grew to love travelling and exploring for its own sake. I found a kindred spirit, Belmondo, a charming gnome pilot, and we married and had a son. We called him Golrie in your honour. We stayed at the Tree Gnome Village until Gogo was old enough to cope on his own.",
    "Gogo's not an adventurer. He loves living in his cave, reading books and studying.",
    "He's like you, in that sense, and he's so very eccentric and quick-witted. He's been keeping an eye on those parcels you sent, but he soon became overwhelmed with them.",
    "I'm sure you'll both get on like a tree on fire! But, we can't just stay here.",
    "Let's go back to the Tree Gnome Village. I can't face losing you again in the mountains. I'll use a few Grand Tree seed pods. Hopefully there's enough space for a few gliders to land here.",
    "Belmondo! I didn't know you were on duty!",
    "You charmer! Let me introduce you. Belmondo, this is my dad, Bolrie. Dad, this is my husband, Belmondo.",
    "In fairness, Belmondo asked mum for my hand – she told me that much.",
    "There's nowhere to land at the Tree Gnome Village. Besides, didn't Uncle Bolren disapprove of gliders near the village?",
    "Uncle Bolren!",
    "Hehe! I can't help it: I'm in too good a mood, uncle!",
    "Gogo! Dad, this is Golrie: your grandson and a little miscreant.",
    "That he is! Please excuse me uncle, but there's someone here who deserves our thanks.",
    "[Player], I was skeptical at first, but we couldn't have done it without you. You couldn't deserve your reward more.",
    "Thanks again for aiding me in my father's rescue, [Player]. While he gets back to full health, I've decided to stay in the Tree Gnome Village and care for him.",
    "I thought I'd use the time to train up as a tree whisperer. If you have any spirit tree seeds, then I can keep them for you. I study them as part of my training, and you can get them back whenever you need them!",
    "Uncle Bolren also allowed Belmondo to establish a glider route to the village. Belmondo won him over with stories of his landing in the Galarpos Mountains and they've become fast friends since. Bolren's no longer worried about having a flightpath so close to the village - as long as Belmondo's operating the line, of course! I get all the men of my life close to me: my dad, my husband, my son and even my uncle! Lucky lady, right?"
  ],
  "Golrie Nah, I'd rather not. Crawling about in funny places, getting swallowed by beasties": [
    "that's not my idea of a night out."
  ],
  "Ilfeen": [
    "I am Ilfeen. It seems I have become a friend to all gnomes! Teclyn saw you arrive from a distance and called for me. You're only the second gnome to arrive this way; I presume you are here because of the letter?",
    "This was forwarded years ago. We had lost any hope that someone would come.",
    "[Player] and I have met before. You have made a wise choice for a partner in your mission.",
    "Your father? Are you Bolrie's daughter?",
    "Then I could not be more honoured to meet you. Your dad has a brilliant analytical mind. It is such a shame that it is set so stubbornly on revenge. He's spent a few hundred years experimenting in his cave, researching methods for dispelling illusions, just to find Glouphrie and avenge his family. A very dedicated, admirable gnome, albeit irritable. His cave is in the sheep field at the north-west of the village. I'll take you there.",
    "There you go! I'll be in the village if you need me.",
    "Of course! I remember him from when I was living in the eastern lands. He was just a budding engineer then. I rather liked the young gnome: he was rather loud, but he had a good soul. He was very interested in elven magic.",
    "Last time we spoke, not so long ago, he was very interested in illusion magic and how to dispel it. I gave him some advice and a few pieces of equipment to help him.",
    "I keep forgetting - a hundred years ago is a long time ago for you.",
    "Of course. It grew into a saw. I hope he found it useful.",
    "I am, but you'll need your own seed. After I've made you a new bow or shield once, I'll be able to chant your old bows and shields back to full charges.",
    "Would you like me to enchant anything? Or I could give you a book about crystal singing?",
    "Show me a crystal seed or crystal item, and I'll see what I can do with it.",
    "Well, good luck.",
    "Well, good luck.",
    "There you go! I'll be in the village if you need me.",
    "I am, but you'll need your own seed. After I've made you a new bow or shield once, I'll be able to chant your old bows and shields back to full charges.",
    "Of course! I remember him from when I was living in the eastern lands. He was just a budding engineer then. I rather liked the young gnome: he was rather loud, but he had a good soul. He was very interested in elven magic. Last time we spoke, not so long ago, he was very interested in illusion magic and how to dispel it. I have him some advice and a few pieces of equipment to help him.",
    "I keep forgetting – a hundred years is a long time for you.",
    "Of course. It grew into a saw. I hope he found it useful."
  ],
  "Gnome": [
    "Come on! Faster! We're not going to subdue humankind by being wimpy, and you know it.",
    "Stop! Vanish! Attack!"
  ],
  "Guard no. 103": [
    "Who goes there?",
    "[Player]? Never heard of you. Wait, are you one of those human adventurers we've been warned about?",
    "Oh no! I have to press the red button!",
    "Test? What test?",
    "Really?",
    "Awesome! I've never had a break before. This has got to be the best day ever!",
    "Aren't you a little tall for a gnome?",
    "He's over there.",
    "Aren't you a little tall for a gnome?",
    "He's over there.",
    "Awww, squawk! I didn't know we would get tested. Can I get a second chance? I will react properly next time, I promise!",
    "Gasp! I will go downstairs now! Thank you for the opportunity!",
    "Glouphrie? Never heard of you. My master's Glouck. Aren't you a little tall for a gnome?",
    "He's over there.",
    "Awww, squawk! I didn't know we would get tested. Can I get a second chance? I will react properly next time, I promise!",
    "Gasp! I will go downstairs now! Thank you for the opportunity!"
  ],
  "Bolrie": [
    "A human, Glouck? What do you hope to achieve? The illusion's life-like, though, I must say. A little podgy around the edges, perhaps, but still pretty good.",
    "Pffrt! You know full well that I'm Bolrie! Look, I'm not in the mood for you today. Leave me here to rot? Fine. Just leave me to rot in peace.",
    "Ha! You thought this would work, Glouck? Or were you just bored? You know me better than this; I'd rather take orders from a warped terrorbird than a human.",
    "I'm surprised: no-one has mentioned that traitor's name in years, least of all Glouck. Okay, I'll humour you. Perhaps you are who you say you are.",
    "You say I have a grandson? How could I possibly...? And little Golrana, my princess...",
    "No, snap out of it Bolrie! My daughter would never trust a human to save me! What have you done with her?",
    "What? You clumsy oaf! You left my little Golrana alone?",
    "What kind of neglect is this. You left my little Golrana alone?",
    "Woah! Wait a minute! How do I know you're not one of Glouck's tricks?",
    "*sigh* Glouck's the leader of this place. He looks a lot like Glouphrie the Untrusted did, back in the dark days, but Glouck's forbidden everyone from so much as uttering Glouphrie's name.",
    "It's so extreme that most have never even heard of it.",
    "Questions, huh? I think I can do that. What's the name of the elf mentioned in the letter that brought you here?",
    "Who was the letter addressed to?",
    "How did you find Arposandra?",
    "If, as you say, you made an anti-illusion device, how many different types of coloured crystal coins can be made with the singing bowl?",
    "In my lab, there's a picture on the wall. What is it of?",
    "Not one answer wrong! I'm sorry for being so rude, human. Let's go and find my daughter.",
    "You're just guessing! Pah! Sarko, Glouck! Liar! Fiend!",
    "You're just guessing! Pah! Sarko, Glouck! No more chances for you!",
    "You're just guessing! Pah! Sarko, Glouck! Liar! Fiend!",
    "You're just guessing! Pah! Sarko, Glouck! Liar! Fiend!",
    "All right, you've convinced me, human. Let's go and find my daughter.",
    "All right, you've convinced me, human. Let's go and find my daughter.",
    "In this place, people are rarely who they say they are. No, I will only come with you once you've answered my questions.",
    "Pah! If only my anti-illusion device was with me.",
    "One more time, for my little princess's sake, but don't lie to me if you can't answer the question. I can't abide liars, I trusted one once, and look where that got me.",
    "Either you are one of Glouck's illusions, or you walk around with a gnome scarf about your eyes.",
    "I don't think anyone would. That's ridiculous! Maybe you are who you say you are. Come on, let's find my little princess.",
    "Where's my little princess?",
    "My princess?",
    "My eyes! The light is blinding!",
    "We really need to seal the vent to stop them coming after us. How about that boulder!",
    "Golrana, my little princess, I... barely recognised you. You are so much older than I remember...",
    "You'll always be my beautiful little princess, Golrana. How's your mother?",
    "What?",
    "No! No, I refuse to...",
    "Dearest Gena... How could I have left you all for so long?",
    "You don't know how sorry I am. I wanted to clear our honour, but I've missed my whole life, hurt the people I cared about, and failed to be there for Gena as she passed.",
    "Golrana... will you ever forgive me?",
    "Belmondo, you seem like a fine, well-mannered gnome. I should thank you for looking after my pr...Golrana.",
    "The honour would be mine!",
    "Dearest brother, it's been too long!",
    "You are looking so well, brother! Interesting hedge maze you've built around the village.",
    "Haha! Golrie, I hate to say it, but you look a lot like me at your age. Golrana, he's a fantastic-looking gnome.",
    "Greetings, [Player]. I was...rude to you in the dungeons of Arposandra, and never gave you the thanks you deserved. What can I say – they were an old man's prejudices. Thank you. A warning, though: this isn't over. I'm going to find another way into Arposandra to have my revenge, if my legs will carry me. Blast it, I'll learn to glide there if I have to! When that day comes, I may ask for your help."
  ],
  "Option 1": [
    "Teclyn.",
    "Golrie.",
    "28.",
    "The Grand Tree."
  ],
  "Option 2": [
    "Ilfeen.",
    "Golrana.",
    "35.",
    "Mountains."
  ],
  "Option 3": [
    "Arianwyn.",
    "Gena.",
    "42.",
    "Gena."
  ],
  "Option 4": [
    "Oronwen.",
    "Bolren.",
    "64.",
    "The sea."
  ],
  "Option 5": [
    "I don't remember.",
    "I don't remember.",
    "I don't remember.",
    "I don't know."
  ],
  "Operator no. 126": [
    "Squawk! Squawk! I have to make the machines ready!",
    "I hope this batch fares better than the last. 100% failed conversion, that was.",
    "There's a nice one in this lot. Lovely plumage. Let's hope she makes it.",
    "No, no! We can't touch the machines! It's forbidden!",
    "Ooh, that one worked! We might be in luck! Out of the way, no. 202.",
    "We'll take you to the conditioning pods later. You'll get taught everything you need to start work in a moment. Now, time for the hot chick!",
    "So sad. She didn't make it. What a waste.",
    "Blue was not her colour.",
    "What's this? The alarm! Squawk! Squawk! Don't panic!"
  ],
  "Breeder no. 153": [
    "Coming through!",
    "I know! Why spend so much time breeding them when so few make the conversion? On the other claw, it's better than guarding downstairs or working in the factory. At least we get to ogle the ladies.",
    "We can hope! I wonder if fiddling with the machine would make more useful terrorbirds, like us. I reckon the bosses would appreciate that.",
    "Ah, well. I suppose we should get on with it.",
    "Off you go!",
    "What could be causing it? Prisoner escaping? Guard 103 sleeping on the button?"
  ],
  "Captain Belmondo": [
    "Gnome glider for a very special lady!",
    "I'm always on duty for a beautiful lady like yourself.",
    "Most delighted to make your acquaintance, sir! You'll have to excuse me for not asking your permission before taking Golrana's hand.",
    "Rest assured, had anyone known your whereabouts, I would not have made such a presumption.",
    "She's the one looking after us all, sir. Now, we normally take people back to the Grand Tree, but, in this case, I presume you would rather go to the Tree Gnome Village?",
    "Darling, I can land anywhere. Besides, you need to make a big entrance when you have the king's long-lost brother in tow!",
    "Sir, may I have the honour of flying you back to the Tree Gnome Village?"
  ],
  "King Bolren": [
    "Golrana, stop calling me uncle! It makes me feel ancient, and I'm barely older than you are!",
    "Bolrie, is that you? Golrana, why have you brought me this cruel Glouphrie trick?",
    "You like it? We're still fighting the swine Khazard. The hedge maze seems to keep him at bay. It's a copy of one of the puzzles you used to draw for me, brother.",
    "Well hello, it's good to see you again.",
    "Really? You've actually been there?",
    "I don't believe you! You've got to be joking."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:The_Prisoner_of_Glouphrie?oldid=35972704’"
  ]
}