{
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "Additional fishermen dialogueYou can discuss this issue on the talk page or edit this page to improve it."
  ],
  "Player": [
    "Hello there.",
    "What's wrong?",
    "Maybe the post was lost!",
    "I'm sorry, I'm too busy.",
    "Bye.",
    "I suppose so, how do I get there?",
    "Ok, I'll go and see if they're ok.",
    "Hello Caroline.",
    "I'm working on it now Caroline.",
    "I'll do my best.",
    "Hello.",
    "I would like a ride on your boat to the fishing platform.",
    "Swamp paste?",
    "Where can I find swamp tar?",
    "I'll see what I can do.",
    "Oh yes, I forgot about that stuff. Can you use it?",
    "Hello Holgart.",
    "I'm afraid not.",
    "Ok, I'll try to find some.",
    "Hello Holgart.",
    "Yes, I have some here.",
    "Hello Holgart.",
    "Will you take me there?",
    "I'm keeping away from there.",
    "Hey, Holgart.",
    "No, I'm going to stay a while.",
    "Okay, let's go back.",
    "Hello there.",
    "Who is lost?",
    "Ermm... So you don't want to tell me then?",
    "Hello there.",
    "What?",
    "Are you ok?",
    "Ermm... I'll leave you to it then.",
    "Hello there.",
    "Yes?",
    "Where will you go?",
    "Riiiight.",
    "Hello there.",
    "Pardon?",
    "Hello there.",
    "Who waits?",
    "Who? Who came to who?",
    "Too many what? Make sense!",
    "You'd better start making sense Sonny Jim or I'll...",
    "Hello there.",
    "I'm trying to find out what happened to a boy named Kennith.",
    "Hiding from what? What's got you so frightened?",
    "The sea slugs?",
    "I doubt they would taste too good.",
    "I'm sorry, I didn't mean to upset you.",
    "Are you okay young one?",
    "Where is your father?",
    "That's good advice, you stay here and I'll go try and find your father.",
    "Holgart, something strange is going on here.",
    "Apparently Kennith's father left for help a couple of days ago.",
    "Your wife sent me out to find you and your boy. Kennith's fine by the way, he's on the platform.",
    "What's going on here?",
    "Yuck! Thanks Kent.",
    "Hello.",
    "We'd better get back to the platform so we can see what's going on.",
    "Ouch!",
    "Hello.",
    "They're all being controlled by the sea slugs.",
    "I need to get Kennith off this platform, but I can't get past the fishermen.",
    "I've managed to light the torch.",
    "Don't worry I'm working on it.",
    "Hello Kennith, are you okay?",
    "You'll be able to see him soon. First we need to get you back to land, come with me to the boat.",
    "What, why not?",
    "Okay, you wait here and I'll go figure another way to get you out.",
    "Kennith, I've made an opening in the wall. You can come out through there.",
    "Not one.",
    "I'll figure that out in a moment.",
    "Did you get the kid back to shore?",
    "Looking forward to it.",
    "Hello.",
    "We found Kent stranded on an island.",
    "Thanks!",
    "Hello again.",
    "Not bad thanks, yourself?",
    "Hello there, Kennith. How are you today?",
    "It was my pleasure Kennith. You take care now.",
    "Hello again Kent.",
    "Oh, don't be silly, it was nothing really.",
    "I only did what anyone would have done in my position. I have to go now, take care."
  ],
  "Caroline": [
    "Is there any chance you could help me?",
    "It's my husband, he works on a fishing platform. Once a month he takes our son, Kennith, out with him. They usually write to me regularly, but I've heard nothing all week. It's very strange.",
    "Maybe, but no-one's heard from the other fishermen on the platform. Their families are becoming quite concerned. Is there any chance you could visit the platform and find out what's going on?",
    "That's a shame.",
    "Bye.",
    "That's very good of you Player. My friend Holgart will take you there.",
    "I'll reward you for your time. It'll give me peace of mind to know Kennith and my husband, Kent, are safe.",
    "Brave Player, have you any news about my son and his father?",
    "Please bring them back safe and sound.",
    "Brave [Player], you've returned! Kennith told me about the strange goings-on at the platform. I had no idea it was so serious... I could have lost my son and my husband if it wasn't for you.",
    "Yes. Holgart told me and sent a rescue party out. Kent's back home now, resting with Kennith. I don't think he'll be doing any fishing for a while. Here, take these Oyster pearls as a reward. They're worth quite a bit and can be used to make lethal crossbow bolts.",
    "Thank you. Take care of yourself [Player].",
    "Hello traveller, how are you?",
    "I'm good. Busy as always looking after Kent and Kennith but no complaints."
  ],
  "Holgart": [
    "Hello m'hearty.",
    "I'm afraid it isn't sea worthy, it's full of holes. To fill the holes I'll need some swamp paste.",
    "Yes, swamp tar mixed with flour and heated over a fire.",
    "Unfortunately the only supply of swamp tar is in the swamps below Lumbridge. It's too far for an old man like me to travel. If you make me some swamp paste I'll give you a ride in my boat.",
    "In fact, unless me nose be mistaken, you've got some in yer pack.",
    "Aye lad/lass. That be perfect.",
    "Hello m'hearty. Did you manage to make some swamp paste?",
    "It's simply swamp tar mixed with flour heated over a fire. Unfortunately the only supply of swamp tar is in the swamps below Lumbridge. I can't fix my row boat without it.",
    "Hello m'hearty. Did you manage to make some swamp paste?",
    "Right me hearty. Let's get this boat fixed.",
    "Huzzah! We've fixed the leaky old tub.",
    "Of course m'hearty. If that's what you want.",
    "Fair enough m'hearty.",
    "Have you had enough of this place yet? It's really starting to scare me.",
    "Okay... you're the boss.",
    "You're telling me, none of the sailors seem to remember who I am.",
    "That's a worry, no-one's heard from him on shore. Come on, we'd better go look for him.",
    "You're right. It all sounds pretty creepy.",
    "Yes, he's safe and sound with his parents. Your turn to return to land now adventurer."
  ],
  "Fisherman": [
    "Lost to us... She is Lost to us...",
    "Trapped by the light... Lost and trapped...",
    "Trapped... In stone and darkness...",
    "Must find family...",
    "Soon we will all be together...",
    "Must find family... They are all under the blue... Deep deep under the blue...",
    "Free of the deep blue we are... We must find...",
    "a[sic] new home... We must leave this place...",
    "Away... Away to her...",
    "Keep away human... Leave or face the deep blue...",
    "You will all end up in the blue... Deep deep under the blue...",
    "Below the deep, deep blue she waits...",
    "They came to her with fire and faith...",
    "Too many... Too many...",
    "Locked away for all eternity...",
    "Free... Soon to be free..."
  ],
  "Bailey": [
    "What? Who are you? Come inside quickly! What are you doing here?",
    "Oh you mean Kent's son. He's around somewhere, probably hiding if he knows what's good for him.",
    "Haven't you seen all those things out there?",
    "It all began about a week ago. We pulled up a haul of deep sea flatfish. Mixed in with them we found these slug things, but thought nothing of it. Not long after that my friends began to change, now they spend all day pulling in hauls of fish, only to throw back the fish and keep those nasty sea slugs. What am I supposed to do with those? I haven't figured out how to kill one yet. If I put them near the stove they squirm and jump away.",
    "This is no time for humour.",
    "That's okay. I just can't shake the feeling that this is the start of something... Terrible.",
    "Oh, thank the gods it's you. They've all gone mad I tell you, one of the fishermen tried to throw me into the sea!",
    "I figured as much.",
    "The sea slugs are scared of heat... I figured that out when I tried to cook them. Here.",
    "I doubt the fishermen will come near you if you can get this torch lit. The only problem is all the wood and flint are damp... I can't light a thing!",
    "Well done traveller, you'd better get Kennith out of here soon. The fishermen are becoming stranger by the minute, and they keep pulling up those blasted sea slugs.",
    "Just be sure to watch your back. The fishermen seem to have taken notice of you."
  ],
  "Kennith": [
    "No, I want daddy!",
    "He went to get help days ago. The nasty fishermen tried to throw me and daddy into the sea. So he told me to hide here.",
    "No, I want my daddy.",
    "No!",
    "I'm scared of those nasty sea slugs. I won't go near them.",
    "Are there any sea slugs on the other side?",
    "How will I get downstairs?",
    "Ok, when you have I'll come out.",
    "Great [mister/miss]! Thanks again for rescuing me.",
    "Sure [mister/miss]. Goodbye now."
  ],
  "Kent": [
    "Oh thank Saradomin! I thought I'd be left out here forever.",
    "I knew the row boat wasn't sea worthy. I couldn't risk bringing him along but you must get him off that platform.",
    "Five days ago we pulled in a huge catch. As well as fish we caught small slug like creatures, hundreds of them. That's when the fishermen began to act strange. It was the sea slugs, they attack themselves to your body and somehow take over the mind of the carrier. I told Kennith to hide until I returned but I was washed up here. Please go back and get my boy, you can send help for me later.",
    "[Player] wait!",
    "A few more minutes and that thing would have full control of your body.",
    "Oh my, I must get back to shore.",
    "Hello there, [Player]!",
    "I never did get the chance to thank you properly for saving Kennith and myself.",
    "Play it down if you will. It was a truly brave thing you did.",
    "You too, [Player]. Goodbye."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Sea_Slug?oldid=35914516’"
  ]
}