{
  "Endwyr, Emissary of Seren": [
    "My goddess, Seren, is holding a council of all gods and races. To draw attention to this momentous gathering, for this weekend only she has cast her voice out beyond Prifddinas and over the whole world.",
    "Lady Seren has become aware of a great threat which faces this world, and wishes to address all of its most influential rulers. She has not revealed the nature of this threat to me. You should visit the council yourself - they can be found upstairs in the castle in Burthope.",
    "Lady Seren casts her voice out into our great city of Prifddinas to empower the clans. Powerful bonuses are imparted to humans depending on the clan. This weekend, at great personal exertion, she has cast it across the entire world. Every two hours a new benefit will become active for everyone. The effect is random, and could buff gathering skills, artisan skills, combat or support."
  ],
  "Seren": [
    "I'm afraid you're a bit early for the meeting.",
    "Greetings, Player. I'm afraid you're a bit early for the meeting. I know you're busy, there's no need to wait.",
    "Greetings, Player, I'm glad you could make it. I've gathered everyone together and now that you're here we can begin.",
    "There are some administration matters to attend to, so we can wait. Try not to be too long though.",
    "Good people of Gielinor, thank you for coming.",
    "For those who do not know me, my name is Seren. Some call me the goddess of the elves.",
    "I have called you here because you represent every race of people and every god on Gielinor.",
    "There is a threat, a threat which faces every one of us. One you may be unaware of.",
    "The elder gods.",
    "They are beings, older than our world. Indeed, they created this world, and indirectly everything on it.",
    "Great artefacts, like the Stone of Jas, which have brought us war and woe for millennia, are merely their discarded tools.",
    "They are so powerful, so far beyond all of us, that even we gods are nothing more than ants to them.",
    "For the entire lifetime of this planet they have slept, but now they are waking up.",
    "To them, this planet and all of its people are nothing more than food for their children.",
    "They laid their eggs in the heart of the planet, and when they hatch, they will consume Gielinor and all life on it.",
    "Then they will move on to the rest of the universe, destroying world after world, until their work is finished and there is nothing but darkness.",
    "How can I know this?",
    "Because I too am their child.",
    "It fills my heart with pride to be considered the goddess of my people, but that is not my true identity.",
    "My mother was an elder god. Though weak, deformed, abandoned. No Threat to Gielinor.",
    "She created me, millions of years ago, along with- with... another.",
    "I went out into the universe, dicovered mortal life, and though it took time, I learned to appreciate the joy and wonder that your kind brings to existence.",
    "I do not share the goal of my kin. I would not see life on this planet, in this universe, ended.",
    "We have only one chance to avoid this fate.",
    "You must meet with the elder gods. You must go before them, prove to them that you are more than merely food to be consumed.",
    "I am sure they will come to see your value as I have.",
    "That is why I have brought you here. To warn you. To plead with you to make this case.",
    "It is only working together that you can do this. Only united can you show the elder gods that you are worthy.",
    "We are all different voices in a vast choir. I know each of us has our own needs and agendas. But now is the time that we must come together to appease the elders and save us all. I propose we start simple and turn our attention first to the elder god Bik. Bik is the elder god most associated with nature and plant life. She is known to nurture trees and plants bringing life and vibrancy to the worlds she engineers. It is the work of Bik that is responsible for some of the once vibrant worlds, Tarddiad and Naragun are both prime examples of her handiwork. And this I believe shows how we can reach her. How we can find a common ground to appease her. I propose that we create a great garden. A place where nature and beauty can thrive, without the interruption of civilisation. World Guardian, you are a neutral part in this. Please talk to the council, work with them to find a way we can build this. We will need: A location for the garden, somewhere large and spacious where nature can run rampant. A workforce we can commit to preparing the land. A supply of seeds. We will need trees, herbs, plants of various rarities and in large quantities. When we've come to an agreement, we shall consider the next goal.",
    "When we've come to an agreement, we shall consider the next goal.",
    "Our only hope lies in appeasement, Lady Drakan.",
    "Please all of you, there must be a solution. We must make this work!",
    "No! You have no choice. You must cooperate with each other!",
    "If we cannot agree on a plan for a garden, perhaps something else...",
    "We must find something. There is no alternative!",
    "No. We can't do that. Whatever threat they possess, they are still our creators...",
    "Is...is this the will of you all? Will you not see reason? Must my aunts be punished for crimes they cannot understand?",
    "You too my friend?",
    "The council has spoken Player, I do not agree with their plans, but you should put your faith in Kerapac now.",
    "Orthen? It doesn't ring a bell, I can only assume it's a dragonkin word.",
    "Madness!",
    "It will take time before we can prepare an appropriate response. Let us hope we are not too late.",
    "The situation is dire, World Guardian. Kerapac must be stopped.",
    "Yes. We must find him. And we must kill him.",
    "You must meet with the elder gods. You must go before them, prove to them that you are more than merely food to be consumed. I am sure they will come to see your value as I have."
  ],
  "Thok": [
    "Thok is pleased to see you! But Thok is busy, busy waiting for all these villains to do something EVIL! When they do Thok, will teach them a lesson. With his FIST!",
    "Player! Thok is pleased to see you! But Thok is busy, busy watching all these villains. One of them is bound to do something EVIL and when they do, Thok will teach them a lesson. WITH HIS FIST! And not in a fun way. The pretty sparkly woman is in charge. Not in charge of Thok. But in charge of this boring meeting.",
    "Ha ha! Thok sorry to laugh at your pain. But Thok knows that politicians are tricky snakes to deal with. Thok would wade in there and smash their heads together til they come to an agreement. But Thok been told that's not how diplomacy works. Diplomacy sounds stupid!",
    "And Thok. A great battle? The end of days? How can Thok not be there on the front line? Thok MUST be there!",
    "Yes! Thok will do it! Thok will fight these elder gods and make sure they're too scared of Thok's fists to ever threaten us again!",
    "Why are we hanging around these talkie types? Let us run TO GLORY!",
    "Look at this thing. It is big and imposing and it makes all the hairs on Thok's body bristle. Thok is like a hedgehog. Only burlier and better at drinking. Also not so good at rolling into a ball... So Thok is not like a hedgehog at all! Thok is more like a great lion, if the lion is in a thunderstorm. Ha ha ha. Yes. Thok is like a lion in a storm, all bristly but still mighty like a bear! Is Thok more like a bear then?",
    "The air makes Thok's beard bristles stand on end. It makes them tickle Thok's nose and makes Thok want to sneeze. But Thok must not sneeze, for Thok's sneezes are so mighty that they might scare all the bunnies that live in the woods. Thok likes bunnies. They are proud and clever and their ears are pleasingly large and fluffy. Thok would like to keep a pet one, but Thok is too busy with great adventures to look after one. Maybe Thok get one for Marm to help calm him down. Or maybe Thok could train a war bunny! We could adventure together, slay dread beasts and drink mead around the fire! Erm...what was the question again? Thok got distracted.",
    "Huh? Thok does not understand a word of what you're saying.",
    "Haha! Thok has been there, Thok slept through a whole bar fight once because he drank too much mead. It is a good plan!",
    "Ok, what do we need to do to make this thing work?",
    "Thok does not like this. Why do we need lies and trickery to make this magic stone behave? Thok could just punch it. You'd be surprised by how many things behave when faced with the full force of Thok's fists. Thok's fists are mighty weapons that make enemies tremble in fear and makes the ladies just tremble at Thok's innescapeable manliness. But scaley man knows more about this stone than Thok. So we should listen to him on matters of big pebbles with a temper.",
    "So this is the enchanterman. Charred-boss?",
    "Ha ha. That is what Thok said. Car-box. Tiny man has strange name.",
    "Thok still say you don't need these fancy doo-dads and whatchamaflinkies. Thok say we just go and glare at this Needle until it gives in and does what it's told. Thok has never had anything outstare Thok.",
    "Then Thok shall! Do not worry Crybush, Thok will make this Needle do what it is told.",
    "Ha ha ha! That is a good joke tiny magic friend. Thok enjoys the company of his good pal Tarnosh!",
    "Your strange arm is very amusing. Thok's beard bristles are now all pointing in strange places.",
    "Thok knew that the scaley nerd was a villain! Now Thok has an excuse to punch him in the face. Thok rarely needs an excuse... But it is much more fun to have one! Thok has decided. Thok will help Crabloss and Player to hunt down this villain! Thok swears it on Thok's MIGHTY BEARD! Kerapac will pay for what he has done.",
    "Thok does not like the scaley villain. So Thok will punch him so hard his scales fly into the sky. What would be under those scales? Fur? Skin? No...EVIL! Evil all the way down.",
    "He is definitely a villain!"
  ],
  "King Roald": [
    "My kingdom owes a great debt to you, World Guardian.",
    "Alas Misthalin is a crowded and bustling space. We simply don't have the space to spare.",
    "I...I don't have a workforce no. Times were I could call on such resources, but...well. I would suggest you turn to an agent of Saradomin, he might be able to provide the resources I now lack.",
    "Yes, I believe I can. We have many farmers and the farming guild can be generous when it's called for. We will help!",
    "You already have my support.",
    "I would suggest speaking to the agents of gods. Now that the gods are back, people rarely have time for Kings and Queens any more.",
    "I'm sorry but I cannot give our seeds to those... ogres. This garden represents a powerful resource. It would give the ogres the strength to expand their influence. They are dangerous creatures with no respect for human life. I cannot justify surrendering resources to them.",
    "I'm sorry but no, Varrock cannot have any part of anything to do with this necromancy. We fought against these abominations in the past and I cannot in good conscience allow myself to work with them again. Please, find an alternative workforce.",
    "Dragonkin!",
    "What is this trickery?",
    "Then we are in agreement. Kerapac, World Guardian, we entrust you with this task.",
    "Yes, you must make haste. The longer we wait the more dangerous the situation becomes.",
    "It's quite hard being the king you know.",
    "When your literal god is nearby, no one really wants to listen the king.",
    "No one really wants your advice as a king when your god is next door.",
    "Oh they'll come round and say hi.",
    "But its only ever for the paperwork.",
    "No one really WANTS to know. You know?",
    "Conscription? Really? Is this what we have come to?",
    "We're not at war, what could we possibly need to conscript for?",
    "Fine fine fine. What Saradomin wants, Saradomin gets.",
    "But I think it's all fuss over nothing.",
    "Kerapac's betrayal is too much to countenance. Would he really kill all life on Gielinor?"
  ],
  "Sir Amik Varze": [
    "Whatever the challenges presented here, the White Knights are ready to take it up.",
    "Ah sadly not. The White Knights do not have much land we can claim as our own. We might be able to convince one or two of the human kingdoms to give up a few acres... Ah but there's just no space there either really. Well, except maybe in the desert.",
    "Ah now manpower, that I can indeed provide. We knights are more than just warriors I'll have you know. We have people that grew up around agriculture and we know the serene delight of an honest day's work. We can spare you a workforce for this task, if you need.",
    "Unfortunately not I'm afraid. Most of our food is given to us by the local farmers. We do not grow our own.",
    "I would be careful around the Black Knights. They're more likely to raze a garden than rake it.",
    "Come now, we mean you no harm.",
    "I can imagine",
    "Yes your majesty, terribly tragic.",
    "My heart overflows with sympathy for you.",
    "But I really must urge you back to the point at hand.",
    "I need to know how many young men you can push to the white knights.",
    "Begging your pardon your majesty, but I must correct you.",
    "We are not at war, yet..",
    "The black knights are up to something, we need to be prepared for them."
  ],
  "Lord Daquarius": [
    "The Kinshra will not be denied a part in these proceedings. We have as much right to be here as the self-righteous White Knights.",
    "As you may have noticed, primarily we're based near the wilderness. Little grows there. We could plant seeds, but they would all die long before we saw them bloom.",
    "Our forces are...too busy at the moment. We simply cannot spare them.",
    "Ha ha ha! Oh no, I'm sorry. I'm afraid we do not stockpile seeds. Do you take us for farmers? We get our food from...donations. We do not feel the need to grow our own.",
    "Do not trust the White Knights. They will offer you platitudes and extend the hand of friendship. But it is a clawed glove and once they dig their fingers into you, you can never be free. Be careful around them.",
    "We need to make sure that we're ready. The white knights are conscripting, we need to be ready.",
    "Fear is a great motivator, but it doesn't inspire great loyalty.",
    "Saradomin's methods and actions have begun to spread questions among the people.",
    "Terrible virus questions. Leads to disunity and betrayal.",
    "Alone.",
    "We shall be a safe haven for those willing to think outside their cage."
  ],
  "Armadyl": [
    "Greetings World Guardian, it is always a pleasure to see you.",
    "Please, all of you. I know Seren. She can be trusted. We must hear her out.",
    "No. I can verify... parts of it at least.",
    "The floating islands of the aviansie are, unfortunately, poor places for agriculture. The soil lacks the nutrients necessary to really allow life to flourish. I'm afraid this is not something I can help with. We do not have the land on Gielinor.",
    "My people are not natural farmers. Our homeworld is a place where life does not easily thrive. Whilst we would be more than willing to help, I fear we are not the best choice for this development.",
    "Ah...well...about that. My people have an unfortunate habit of...well...snacking on seeds. Something about the texture, it's just irresistible to us. As such I'm afraid our seed stocks are...err...not terribly robust right now.",
    "The land is the biggest concern. Gielinor is a heavily populated place and any land taken for this garden is going to be hard earned. If we could use the wilderness then there might be hope. But that place is barren and full of dark energies. Perhaps the vampyres would be willing to repurpose their swamps? The area is haunted and twisted, but perhaps the curative powers of the icyene could help there?",
    "We must have patience and wisdom, Chieftain.",
    "You are foolish to attack us here, dragonkin. Even your kind cannot hope to defeat all of us.",
    "There is little justice in this Seren. But I see the wisdom here.",
    "If there were another way...I would take it. But Kerapac is right. I have seen what the elders have done to the dragonkin. And I have seen what they have done to other worlds. When I travelled the stars I witnessed the broken discarded remnants of planets. Discarded and scattered in the darkness without the slightest concern for what might have been. The elder gods...they're not like us. They do not think as we do. They cannot. I don't know whether they can ever consider us as worthy in their eyes. We are tiny things to them. Less than ants, you said so yourself. I'm sorry my friend, but no, appeasement can never work. So if there is a chance...if Kerapac has a solution that puts them to sleep. Then let us take it. Let them dream pleasant dreams and let us live through it.",
    "We're counting on both of you to find a solution to this problem.",
    "We will need to prepare. We cannot let him go through with this."
  ],
  "Brundt the Chieftain": [
    "That one over there has wings!",
    "The goddess Seren promised to reveal to us information on a matter of great importance. Something that threatens all of us.",
    "Sorry lad, but no. We Fremennik keep to ourselves and our land is our lifeblood. We just have nowhere big enough that we could afford to lose.",
    "Ah we can help out there. Need a job done? Nothing is better for that than a horde of mighty Fremennik warriors. Just say the word and we'll be there.",
    "You already have my support.",
    "Of course! We have all of the hop seeds you could ever need. Fields upon fields worth.",
    "I don't understand.",
    "But none of those make ale...",
    "No! I will not send our brave Fremennik into the Morytania swamps! That place is full of strange spirits and dark omens. I will not see my people corrupted by its witchcraft.",
    "No. I am sorry, but I cannot budge on this.",
    "Ah, I am afraid that's not going to work. My people are not desert people. We are not used to such hot conditions.",
    "I fear it would be too great a strain for them to work under. I will not endanger my people that way.",
    "How can we work together with villains and monsters?",
    "I will believe it when I see it.",
    "Yes...what a marvelous plan. You should go with them Thok. We need to make sure this plan goes off without a hitch."
  ],
  "Doric": [
    "I don't know why I'm here really. All the other dwarves were too busy.",
    "Can anyone tell me what this meeting is supposed to be about?",
    "I know lad, but what is this threat?",
    "It may have escaped ye notice, but dwarves tend te live underground. Not a lot of room for big gardens down there. You also need sunshine for a good garden.",
    "Sorry lad, but dwarves aren't much good at gardening.",
    "If I cannae forge it out'a iron, then I cannae help.",
    "About this nonsense? I got nothing. Now if you be needing advice on smithing, I can talk shop."
  ],
  "Osman": [
    "Player. It is good to see you. However, I did not call this meeting and it would make me a poor guest to take up your time.",
    "Hrmm, the desert is large and there is certainly space for a garden. It would be tricky though. The northern desert has the greatest potential for such a garden. I believe we could agree to allowing that to be cultivated.",
    "I have already offered you the desert.",
    "No, I'm afraid not. After the...transition in Menaphos, we must use all our resources on preventing civil unrest.",
    "I'm afraid not. We have little agriculture and so few seeds to spare.",
    "The Arposandran gnomes likely have nothing. It's not worth your time talking to them. Likewise the emissaries of the Underworld almost certainly can't offer any assistance here. Be careful on who you agree what with. There are some people who will never work with others. For example the godless are unlikely to work alongside any of the strongly religious organisations.",
    "Forgive me, but I must rescind my offer. The White Knights are a military force under the banner of Falador. I would be a fool to simply welcome them to my front door.",
    "For now, yes. But soon your god will want to expand his influence. I will not be the key to that.",
    "I will do no such thing. That abbey has every right to be there.",
    "Then we will find another workforce.",
    "Save us? How?"
  ],
  "Ichi": [
    "I am not used to gatherings of so many different races at one time.",
    "Not really. Our island is small and filled with...well us. We do not have any room spare.",
    "I don't really think your locals would be too happy seeing us wandering around.",
    "We have bamboo...but that's about it. We're more into our fishing products than agriculture.",
    "I'm afraid I don't really know much about you Western Lands types."
  ],
  "Commander Zilyana": [
    "I am here on behalf of my lord Saradomin, who could not attend. He has more important matters elsewhere.",
    "Lying wretch! It is your unholy master, Zamorak, that we must unite against!",
    "On Hallow? We would perhaps be able to spare one of the old islands. But here? You should speak to the rulers of kingdoms, only they have the land to spare. Back when we controlled Morytania, we could have offered the swamps, but now you will need to speak to the vampyres for access.",
    "We Icyene are too few to spare for such labour. I'm sure the human kings have farmers to spare.",
    "I am no farmer and neither are my people here. We are warriors. We do not carry seeds.",
    "Speak to the vampyres. As much as I loathe them, Morytania's swamps are vast and fertile. With care you could turn them into a garden.",
    "You know why you had to be made an example of traitor. Your weakness endangered us all. I will not be weak. I will not allow these elder gods to bully me and my people. I agree with the dragonkin."
  ],
  "Garlandia": [
    "Self-proclaimed gods and their mindless zealots. Whatever this is, only harm will come of it.",
    "Your masters are as bad as each other! All the gods are our enemies!",
    "I'm afraid we godless have no land to spare. I'm not sure we could agree to it even if we did. We've appealed to the gods for too long, maybe it's time for a new solution.",
    "Whilst there are more godless now than ever before, we are hardly a workforce. Very few of us are particularly skilled with plants.",
    "Actually, I might be able to help here. We have been stockpiling seeds, just in case another god decides to obliterate an entire region. Again. We wanted seeds to hand so that we could try and replant the area, giving it a chance to survive. If this will save the entire planet from destruction, it seems like a reasonable use for them.",
    "You already have my support.",
    "I'm sorry, we make it a policy not to interfere with the various alliances. So I could not tell you who has what resources.",
    "Excellent. The godless can assist and we can teach the ogres about life outside of Bandos's teachings.",
    "Then you can find your seeds elsewhere.",
    "I cannot aid a military force that serves one of the so called gods. Certainly not one that supports Saradomin. He has taken to much from me already. I will not give him more. There must be an alternative.",
    "No. I will not support the use of necromancy. It's a dark art and evil art. The tools of monstrous creatures. It entombs souls in corpses, trapping their spirits. I cannot be a part of that. I will not aid them.",
    "I have seen what happens when we allow gods to dictate our fates. I say no more."
  ],
  "Moia": [
    "I am Zamorak's emissary in this matter. He is far too busy to attend the whims of Seren.",
    "It is Saradomin! Saradomin is Gielinor's greatest threat!",
    "No. I am afraid not. The humans still keep Zamorak at arms length. They label him as evil and monstrous. They are misguided. But it means that our land is limited. One day the Zamorakian empire will rise again, but not today.",
    "Hrmmm...I can offer you a workforce yes. But it will not be the normal type. My father was a monster, but he had quite the extensive knowledge of necromancy and I am a quick study. I could raise an army of the dead to serve as your workforce. They would never tire, never leave. A more devoted workforce you could never hope to find. I will gladly help you create a workforce.",
    "I've already offered you an army of the undead, I don't know what more you want from me.",
    "Ah sadly not, I'm afraid the lord of chaos has little need for pretty flowers.",
    "Be mindful of the White Knights and their icyene allies. They will pretend friendship, but they have their own agenda.",
    "There is a price. The Citharade Abbey, is a blasphemous monument to Saradomin. If you want my aid, tear it down.",
    "It is an affront to my lord. If you want my workforce, you will tear it down.",
    "I have seen enough. It is clear there can be no agreement here.",
    "Have a care. I am not one of your elves to be ordered around.",
    "My lord would never see appeasement as the solution. We must be creatures of action if we are to thrive!",
    "Now, finally, you're making sense."
  ],
  "Azzanadra": [
    "I suspect I know what this meeting concerns. You would do well to listen, for the fate of the world and all the gods may depend on it.",
    "Whilst the Empty Lord's empire was once vast and could have easily accommodated your request... Disappointingly, now we can spare no such lands.",
    "Our numbers are too few to offer real help here. I am sorry.",
    "Yes, yes, I believe I can help here. As part of his research into how to help the Ilujanka, Zaros studied various specimens of plantlife. I believe his hope was that there might be a medicinal element he could use. Sadly, that avenue of research proved fruitless. Yet the seeds still remain. I can turn them to this cause.",
    "You are more the diplomat here than I, World Guardian, trust your instinct.",
    "I am disappointed that you would think so. But there are other places seeds may grow.",
    "If you would discard such supplies over superstitious nonsense, then yes.",
    "Whilst this is indeed a grave task and I am loathe to act as opposition. I cannot support the White Knights. They are a military force with a clear agenda to promote the will of Saradomin. It is folly to believe that they would not take advantage of this situation to push that agenda. I'm sorry, we must consider an alternative.",
    "Be careful World Guardian. The elder gods are dangerous beyond measure, you must proceed with caution.",
    "In a heartbeat.",
    "No. It's sacrifice. One world for all others. We mahjarrat have long understood that level of sacrifice."
  ],
  "Zanik": [
    "Hey Player, it's good to see you! We'll catch up later, okay?",
    "Wow, I mean wow. How do you even do that, prove you should be allowed to exist? Oh sorry, I got distracted there. I've got no land, no workforce and no seeds for you. Sorry. I'm sort of here as a voice for the dead. Ambassador to the Underworld. It sounds a lot scarier than it is. There's some strange stuff going on in the Underworld, I think it's all connected to this. So I'm going to stay and help, if I can.",
    "It's good to be back.",
    "I would never try and be in your way.",
    "See reason Chief Brundt. It's only a swamp. The ghasts can be easily dealt with.",
    "If anyone can do it, you can Player.",
    "But that's madness!"
  ],
  "Icthlarin": [
    "Greetings my friend, it is good to see you again. The Underworld is stirring, I am glad that we are all here together.",
    "Whilst the underworld is vast, I'm afraid little grows there but memories. It would be a poor choice for a garden.",
    "I tend to work alone. I am a shepherd, not a king. I guide the dead, I do not rule them. So, regretfully, I cannot offer any support to your cause.",
    "Ha. I'm afraid that little grows in the Underworld. I am afraid I have not gathered any seeds for you.",
    "If you are after a workforce, look to those who deal with nature on a daily basis. The elves cannot stray far from their city without Seren or her crystals, but there are others with a strong connection to nature."
  ],
  "Zarador": [
    "Bandos may be lost to us, but his people are still there and they need representation. It is my honour to serve in that capacity.",
    "Ridiculous! Ancient gods beneath the ground... Tales of the apocalypse. And delusions of grandeur from a goddess long irrelevant.",
    "I believe I could convince the ogres at Oo'glog to allow us to improve the Feldip hunting grounds nearby. There is plenty of space there and the land is fertile.",
    "Hardly. The herbs and plants we would grow, they would be very useful resources. I can see the value there.",
    "I do not like to repeat myself. I have offered you Feldip already.",
    "Ha ha ha. As if this lot would ever allow goblins to tend these grounds, no let's not waste our time.",
    "No.",
    "Why ask? Why not simply take? This diplomacy is a waste of time and doomed to failure.",
    "No! We will not allow those...things...near us. We have dealt too long with zogres. We will not invite them to our gates!",
    "You will do no such thing. Bandos may be dead, but his words still have meaning. I will not allow you to erase them for your own ideology.",
    "And what would that be? Perhaps you think we should put on a musical show? Placate these elders with song and dance?",
    "Let him speak!",
    "We will fight, Bandos would never have allowed us to cowtow to these elders!",
    "But also haste."
  ],
  "Glout": [
    "As representative of the great city of Arposandra, it is my honour to witness these proceedings today.",
    "Alas, the great city of Arposandra is not large enough to house such a garden.",
    "Hrmm. No, I don't think so. We could probably spare some workers, but they are not farmers as you would understand.",
    "No, I fear we would hinder rather than help.",
    "I'm afraid not. We have a very self contained ecosystem and we simply cannot spare the seeds.",
    "I'm afraid we don't really deal with the other alliances much. I have no advice to offer."
  ],
  "King Narnode Shareen": [
    "Hello there human.",
    "Whilst I would normally be the first to leap at the chance to grow a giant garden. I'm afraid we just don't have the land available.",
    "Sadly I cannot help. My people are...needed elsewhere.",
    "I'm afraid we had a bit of a chinchompa problem and...well.... Let's just say that our seed stores are not what they used to be.",
    "The human kingdoms often stockpile resources, they may have some seeds they can spare."
  ],
  "Vanescula Drakan": [
    "Crossing the Salve is not easy for my kind, and not without sacrifice, but these matters are not to be missed.",
    "Hrmm. Well we do have all that swampland. It would be nice to see that made a little prettier. Very well, promise me you'll make the swampland into something more appealing and we will cede that territory to this project.",
    "I have already offered you the swamps of Morytania, what more do you expect us to give?",
    "Hrmm, well we do have a few sla...workers we might be able to spare. But I don't think they're ready to be let out on their own just yet. Better leave them where they're...taken care of.",
    "The only seeds we have are from Vampyrium and sadly they do not grow well here.",
    "I'm afaid[sic] we've been rather...closed off from the other alliances here. It makes offering you diplomatic advice a trifle difficult I'm afraid.",
    "Do you think us insane? Do you think we would allow an invading force into our lands?",
    "It was the accursed Saradominists who imprisoned my people behind the river Salve. Now you want to send them in force?",
    "No! I cannot and will not allow this!",
    "This is a waste of time! If we are to believe that ancient, omnipotent gods threaten our very existence, why are we planning a garden?",
    "We shall see.",
    "Good luck World Guardian, we're all counting on you. Try not to mess it up.",
    "He would go that far to stop the elder gods?"
  ],
  "Oneiromancer": [
    "Hello Player, it is good to see you.",
    "In the spirit of fostering cooperation between our two cultures, I have offered Brundt our resources. You should speak with him."
  ],
  "Major Mary Rancour": [
    "Burthorpe is honoured to be hosting this gathering. We are well accustomed to providing safety and security.",
    "I'm just here for the security of Burthorpe. I'm afraid I cannot help with this mess.",
    "I've been at the mercy of powerful beings before. I will not just let them walk all over me again."
  ],
  "Juna": [
    "I have not seen a meeting such as this for many millennia.",
    "Guthix himself told me this story. The Elder Gods. Seren speaks truly."
  ],
  "Player": [
    "I need to complete a few errands before I can start, can we postpone?",
    "Anything other than hops?",
    "Tree seeds, flowers, herbs?",
    "So that would be a no to my original question then.",
    "Not right now, maybe later.",
    "That's very helpful of you.",
    "The ogres of Oo'glog have suggested we use the Feldip hunting grounds for the garden. The grounds are fertile and there is plenty of room. The springs mean there's plenty of water as well.",
    "The vampyres have kindly offered the swamps of Morytania for the garden. The swamps are dangerous, but they are large and they are fertile. With effort we should be able to convert them into something magnificent.",
    "I suggest that we consider the desert as prime location for the garden. Pharaoh Osman has kindly offered us the land. It will be tricky to grow things there, but it's a large area so we can grow a large garden.",
    "Chief Brundt has offered several Fremmenik to help plant and tend the garden. The Fremmenik are hardy folk, who will do an excellent job tending the garden.",
    "The White Knights have kindly offered their services. They are a disciplined force and should make quick work of the garden.",
    "Moia has offered her extensive knowledge of necromancy to our cause. What better way than to show how we can bring life, when we use the dead to grow the garden for us.",
    "Azzanadra has offered the remaining seeds from Zaros's research. These will include medicinal herbs and hardy species from various worlds. It should create a truly unique garden.",
    "The godless have kindly offered to donate their stockpile of seeds. These were to be used to repair a damaged land in the case of another wilderness style attack. But now they can be used to bring life to an area before it's destroyed.",
    "King Roald has kindly offered the seeds stores of Varrock for this project. These are the seeds gathered by the people. So it will be a truly global undertaking.",
    "I'll go talk to Kerapac and leave you to your existential crisis.",
    "I can feel it. It's like the air is full of potential. As though anything could happen.",
    "Should it?",
    "Impossible?",
    "I feel...nothing. It's just a rock. I mean I know what it does and that it has power, but it's just a rock. Cold and inert. Nothing special.",
    "Impossible?",
    "Basically Kerapac is saying that we can use the Needle to corrupt the elder god's food supply. Put them to sleep as if they'd drunk an awful lot of mead.",
    "I don't really understand either.",
    "How can I do that?",
    "That feels like all of them. I should go and speak to Kerapac.",
    "I've closed all the temporal instabilities Kerapac. What now?",
    "Is there nothing we can do?",
    "Yes, he created a ring that could persuade people round to his way of thinking.",
    "But we have no idea where he is.",
    "Wait...what? Isn't this... ...oh. Guess I need to go visit the Varrock Palace Library.",
    "Nice to meet you Charos. My name is Player.",
    "The stories don't do you justice. I expected someone...well...less handsome.",
    "You going to hide again now? It seems to be the pattern.",
    "I miss Reldo.",
    "So why pretend to be Reldo?",
    "So was Reldo ever real?",
    "It just so happens that I've already got those components with me.",
    "I just had an inkling that I'd need them. It's as if I was guided here by an external will.",
    "Here are the components.",
    "What's this?! Where am I? I should look around. There must be something I can do to attune the Needle to Kerapac.",
    "Alright... keep calm, maybe I can stop this all from happening.",
    "Get out of my head!",
    "Guthix...",
    "Guthix?",
    "Are you ok Gail...er...Primrose?",
    "You do that Primrose, you've got a lot of catching up to do. I need to head back to the council in Burthorpe. This...this did not go according to plan.",
    "I should really tell Seren about what's happened before I get the council involved.",
    "It was a setup. Kerapac just wanted to steal the power of the Needle for his own schemes. He escaped, with the Needle, to an island to the north east. Somewhere they called 'Orthen'.",
    "There's more. Kerapac's plan, I saw a vision of his past. It's...it's going to kill everyone. All life on Gielinor.",
    "Any strange after effects from the Needle?",
    "I'm sure you will Megan."
  ],
  "Kind Roald": [
    "Gods on top of gods! But what can we do about it?"
  ],
  "Brundt the chieftain": [
    "I don't know where you might find anywhere suitable to plant this garden. But if it's seeds you're after you should try talking to that great big snake thing. She's got the smell of druid about her and if there's one things druids have a lot of it's seeds."
  ],
  "Sir amik": [
    "You already agreed to use my White Knights. Didn't you?"
  ],
  "Vanescula": [
    "Do you think we're stupid? We're not going to accept 'experimental' seeds from the high priest of Zaros! We know how long you hold grudges Mahjarrat. We hold them just as long. You would poison us all in a heartbeat."
  ],
  "Brundt the Chieftan": [
    "You expect us to handle these experiments? Do you think us fools?",
    "We will not be the guinea pigs in your master's deranged experiments. We refuse to work with you and your cursed seeds."
  ],
  "Kerapac": [
    "There is always an alternative.",
    "My people's invitation seems to have slipped your mind, goddess. No matter, I found my way here.",
    "I am not here to attack you. I am here to save you.",
    "Seren has told you of the Elder Gods. She has told you that your only chance is to bargain with them, to appease them.",
    "She is blinded by familial bonds. It is a naive lie. My people know what it means to bargain with the Elder Gods. We tried the same thing. We were enslaved to their will, and remained slaves for an aeon. Finally we are free. I would see no other make the same mistake. None should suffer as we have suffered. Appeasement can never work! The elder gods cannot be reasoned with, cannot be bargained with. Once the dragonkin believed as you did. Believed that we could make them understand. And what did we get for our efforts? We were enslaved. Each of us bound, body and soul to their tool. We were forced to endure agonising, unending pain whenever the stone was used. A pain that never went away. As we dreamed, the dreams burnt us. When we were awake the pain was like hot coals beneath the skin. Every moment a constant agony. And that fate is what awaits you all if you try to appease them. No. But there is another way. A solution that removes the chains from our own necks and places it back upon the elders. With the World Guardian's help I believe I can use the elder artefact known as the Needle to put the elders back to sleep. They will never rise. Never threaten us again and we need make no concessions to them.",
    "Which means what exactly? That they have the right to destroy us? That we should prostrate ourselves in fear at the mention of their names? Must we live as frightened children to abusive parents? No.",
    "Together we can fight them back.",
    "That's alright the World Guar...",
    "... Fine. World Guardian, we must head to the Needle west of Piscatoris. There I will explain what must happen next.",
    "World Guardian, we must head to the Needle west of Piscatoris. There I will explain what must happen next.",
    "This is the Needle? It's a strange device. Full of power, but not the same as the accursed stone. I touch my hand to its surface and I can feel the rhythmic pulsations of the anima as it knits, undoes and reknits itself together. Can you feel it World Guardian? Your rather unique nature should offer some sort of reaction here.",
    "Nothing more than that? How does it feel to you? On your skin, your muscles? Does your soul rail against it?",
    "I do not know, which is why I ask.",
    "You are the World Guardian. You are bestowed with impossible power. You are quite the riddle.",
    "Indeed. Nothing like you has ever existed. Nothing like you should exist. I have studied the power of the elders for a long long time world guardian. You should not exist. It remains to be seen exactly what that means.",
    "And you Fremennik? What do you feel?",
    "I am sorry I asked. It is strange that you feel nothing World Guardian, but perhaps not so strange. You are an impossible thing. Immune to the power of the gods and it would seem at least resistant to even these artefacts.",
    "Indeed. Nothing like you has ever existed. Nothing like you should exist. I have studied the power of the elders for a long long time world guardian. You should not exist. It remains to be seen exactly what that means.",
    "Very well.",
    "The Needle is currently attuned to the flow of time in a small area, but it doesn't have to be. It can be attuned to the temporal flow of anima itself. We can make it so that the anima flows differently for the elder gods. In essence we can make the anima flow away from them. We can take their food source, prevent their eggs from hatching. They will go back to sleep as if their cycle had just begun. It will keep them still. Keep them sleeping. Keep Gielinor safe.",
    "The Needle controls time. We'll use it to put the elder gods back to sleep. Their threat just goes away.",
    "I will attempt to attune the artefact. We dragonkin have a unique connection to the elder artefacts and it allows us to affect them slightly. World Guardian. As I attune the artefact temporal instabilities will appear in the area. These instabilities are created by the power of the artefact, so your World Guardian nature should allow you to force them closed.",
    "My understanding is that you can literally squeeze them closed with your hands. Crude, but effective. They should all be localised around the area, please find them and close them.",
    "Are you ready?",
    "Go now World Guardian. I must remain here and focus my attention on the Needle. Only you can close the instabilities. Hurry, or all is lost.",
    "Very well, talk to me again when you are.",
    "The instabilities are open Player. You must close them before we can continue.",
    "Now I...just...need...to...",
    "GATTARIK VEK! VOKUN VEK! HAK HAK GELIK! I'm afraid it won't work. The Needle will not work without the whims of its keeper and she's nowhere to be found.",
    "Well, perhaps there is one thing. The elder artefacts are, in their own strange way, intelligent and alive. Not an intelligence as you would understand, but an intelligence none the less. We need some way of overpowering that intelligence. Subduing it just long enough for us to put the elders back to sleep. There was once an enchanter of great skill, one of your people. He was able to create devices that could affect the minds of others. His name was Charos. I believe you've heard of him.",
    "Yes. I believe he has grown quite adept at disguise and trickery. I believe he has the potential to help us.",
    "No, true. But you do have something that belongs to him. A necklace I believe. It has the potential to unmask him, if attuned properly. I believe our best bet to unravel the mystery of Charos is to find his tomb. It is a fiction, but an artist often leaves clues in their work. If I recall correctly the tomb can be found in the fenced off woods claimed by someone called McGrubor.",
    "If I recall correctly the tomb can be found in the fenced off woods claimed by someone called McGrubor.",
    "While this conversation is riveting, we have more pressing matters to attend to. Charos, your reputation precedes you even among my kind. I am told you are quite the enchanter.",
    "Quite. I need you to build this.",
    "Name them.",
    "World Guardian, if you would be so kind as to obtain those components for us. I will stay here and discuss what the device needs to do.",
    "We have everything we need. We must return to the Needle.",
    "Very well, let us head to the Needle.",
    "We have everything we need. We must return to the Needle.",
    "This is it Player, time to attune the Needle.",
    "Player I have little time to explain. I must battle Gail, you must tune the Needle. I am sending you into a temporal instability, your World Guardian nature will protect you. You must find a way to realign the Needle so that we can fight back against the elder gods. I do not know what you will see, or what you will have to do. Time is a treacherous thing. Do not let whatever happens distract you from your mission. You must find a way to divert the Needle's power to me. Everything rests on you now.",
    "Time is a treacherous thing. Do not let whatever happens distract you from your mission.",
    "Pay her little attention World Guardian. This is but a projection. I can assure you her true attention is focused very heavily on myself. I would appreciate a little haste on your part. She is stronger than she appears.",
    "The necrosyrtes are rabid beasts. Savages.",
    "They lack the subtlety needed to engineer our freedom.",
    "All they do is react. Lashing out at 'false users'. Following the rule of our enslavers without question.",
    "Yet they may still prove useful.",
    "I have heard rumours of Sakirth's experiment.",
    "It's bold and interesting. If flawed.",
    "It requires elements he does not yet possess. Access to the vault for one.",
    "They also need a test subject. They will not use one of their own.",
    "Hrmm, there is that troublemaker who's been chasing after the Fremennik god.",
    "Perhaps a meeting could be arranged between them.",
    "Solve one problem and gain some valuable insight.",
    "I know how to do it. How to destroy the accursed stone.",
    "Sakirth's ill fated plan. The work I did with the World Guardian in my lab.",
    "All I need is enough anima. I can do it. I can set us all free.",
    "And here I have in my hand an invitation. An invitation to the Heart of Gielinor.",
    "The biggest, purest, concentration of anima on this world.",
    "I do not believe in fate...but...",
    "All the pieces are falling into place.",
    "For the first time in an aeon, there is a chance.",
    "WE WILL NO LONGER BE SLAVES!",
    "A weapon is built for wars, World Guardian, but it can be turned to peace. We must finish this. For the good of Gielinor!",
    "There is no turning back now Player. The elders must be aware of us now. We must finish this or all is lost.",
    "They are from long long ago. My first laboratory on Orthen.",
    "Ancient, yes. Mythical, no. Orthen is real and it's time I returned. There is something I need there. Something that will save us all.",
    "I intend to put a stop to this madness. To save my people, once and for all. So that never again may we be choked by the shackles of the Roakin. That is why I must return to Orthen. Why I must restore the crucible.",
    "Of course I can. I must. For the good of all kin.",
    "Of course I can. I must. For the good of all kin.",
    "There is always sacrifice in war. Always casualties. But they breed quickly these races. The ones offworld will replace their numbers soon enough. To save all life in the universe, the lives of one world is a fair trade. We can no longer be chained by useless morality. It is time for this war to end, once and for all."
  ],
  "The following text is transcluded from Transcript": [
    "Letter from Charos.",
    "Mysterious clue scroll (Desperate Times)."
  ],
  "Archaeologist (southern)": [
    "Zanaris isn't real, you know!",
    "Did you hear? Finally we're seeing some actual funding.",
    "I heard it was some shadowy organisation.",
    "Who wants to control the destiny of Gielinor!",
    "Probably a lizardman.",
    "No I don't!",
    "Shut up!"
  ],
  "Examiner": [
    "Oh, shut up!",
    "Yes, well.",
    "Let's leave Aaron's unhealthy obsession with lizard people to one side.",
    "We do have actual work to do."
  ],
  "Archaeologist (western)": [
    "I heard about that. Do we know where from?",
    "What is it with you and lizardmen?",
    "You really do. You're always on about them.",
    "How they smell."
  ],
  "Archaeologist (eastern)": [
    "Not the palace, that's for sure.",
    "Yeah you have a really unhealthy obsession with them."
  ],
  "Lieutenant Crane": [
    "The white knights have an edge on the propaganda war though.",
    "Don't forget we're the 'evil' black knights, getting new recruits won't be easy.",
    "The people will feel lost.",
    "And that's where we come in."
  ],
  "Blacklock": [
    "We could... encourage people to join.",
    "Angry.",
    "The White Knights won't know what hit them."
  ],
  "Charos": [
    "Oh excellent. Really quite well done. There aren't many people who can track me down. But you, you are quite the hunter. And just look at you. I mean we've spoken before, but now I don't need to pretend to be poor, timid little Reldo. The World Guardian, I always thought it a bit grandiose, but I have to say you carry it off rather well. Oh but forgive me, I haven't introduced myself properly. My name is Charos. I know you already know of me, but it's nice to formally meet you.",
    "Oh I know you quite well. But it's very nice to meet you now that you know who I truly am.",
    "Careful now, we've only just met. We've plenty of time to appreciate one another properly.",
    "Ha, yes, well. I have caused my fair share of trouble in the past, so I have need to keep my profile pretty near to the ground. But, fortunately, it appears that most of my troubles have been rather splendidly dispatched by your good self.",
    "So I think it's time I come out from this little fiction for a bit.",
    "Do you know what, I will as well. He was a good person to be. But he was just a mask and masks can be put on again easily. So he'll always be here if you need him.",
    "Why disguise myself as the head librarian, to the royal court of Varrock? Central hub of adventurers everywhere? Do you know how much information is just handed out here? I've gotten the gist of just about everything that happens on this planet. And I've barely needed to leave this room. I also have the ear of the king himself. He comes to me with questions, looking for the expert knowledge of gentle Reldo. So I have power, knowledge, prestige and the security of the palace walls around me. Being Reldo was marvelous. I can thoroughly recommend it.",
    "Well real is so subjective isn't it? I would argue yes. Reldo had his own life, his own hopes and dreams. He was a disguise, true, a mask. But I don't think that inherently makes him unreal. After all, we're all just masks really, aren't we? Ah, but we must cut this conversation short, your friends have arrived.",
    "Charos, Ka-Ross.",
    "Wait...you're called Thok and you're mispronouncing my name...is...is this some sort of obvious trap? I mean Thok...it sounds awfully like...",
    "I have been known to dabble in the odd enchantment. Oh why be humble, I'm great at it. One should always be proud of their accomplishments.",
    "This...I think I can make this...it's tricky, but not impossible. I will need a few things first though.",
    "I'll need the basic building blocks. Runite should do it, 3 rune bars is enough. I'll also need the 2 runite stone spirits, to change the nature of the metal ready for enchanting. 10 mind runes and another 10 gleaming energy in order to infuse them.",
    "Why in the world are you just lugging those about with you?",
    "What a marvelous idea Thick, you should definitely go and do that.",
    "He's not even trying now.",
    "I'll take that. Now, if you'll excuse me, this will take a little while. Why not do a little reading, there's plenty of good books here.",
    "There, one device that should suppress even the will of an elder artefact. At least for a time.",
    "Yes and I'd like to tag along as well. I would really like to see my new device in action.",
    "You weren't meant to find it funny! You were meant to be shocked and surprised. That jolt was basically a mini lightning bolt!",
    "Be careful with the device, it's powerful but it's not been tested on something like this.",
    "That...that...well I don't have an insult for him right now. But I am brewing one and it will be epic! He lied to me! TO ME! No one ever lies to me...I'm furious! A little impressed as well. But mostly furious! It's been so long since I've had an actual grudge to hold on to! Reldo was always so gentle and unassuming. Oh Kerapac is going to rue the day he betrayed me. My revenge shall be LEGENDARY! BWAHAHAHAHAHAHA!",
    "It means 'first city' I believe. Although that's probably not that helpful right now.",
    "What would you like to know?",
    "I do not like being tricked. It's rare that it happens and it never sits well with me. I will need time to think of a suitable revenge. But revenge is something I shall most definitely have.",
    "Hrmm, now that's a big question. I've been around a lot you see. Oh I know, I look good for my age. But...yes. I grew up in Morytania, in the slums of Meiyerditch. My parents died young so I had to look after myself. I learned fast in those days. Learned who's opinions mattered and whose ears were easily coerced with honeyed words. I quickly learned that if I was to get anywhere in life, it would be at the whims of the vampyres, not my fellow humans. So I did what had to be done. I'm not proud of it, but I'm not going to claim I wouldn't do it again. I started as an informant. Telling our vyre masters about the seditious people, the suspicious people, the dangerous people. In exchange they gave me food. They gave me shelter and I learned from them. I was taken in by a haemalchemist at first. I worked as her lab assistant. I mopped the floors, cleaned the equipment. Drudge work. But while I cleaned, I read. I studied. I learned. I learned about magic and I learned about the art of artifice, of invention and enchantment. And I tinkered. In what little free time I had, I tinkered. I experimented. I studied and I learned. I made the ring there. Quite early in my career. A ring. So simple, do you know what it does? All it does is put a tiny little thought at the back of someone's mind, a little phrase 'this is ok'. I gave them a gut feeling. That's all. A gut feeling that when I use the ring, what I'm saying means I'm trustworthy. You would be amazed at how many people just accept a gut feeling. With that one ring, that simple device, I climbed the ladders of vyre society. At least as high as any human could dare to climb. I was brought in to diplomatic discussions because I had a way with words. I was brought into interrogations because people found themselves trusting me. I was useful. And useful has its perks, believe you me. I was given my own workshop, a place to continue my tinkering. I created wonders...and the odd horror. Then I drew the attention of Lord Drakan himself. Do you know what it's like to have the ear of pure evil? To have to laugh as innocent people are murdered for the sake of entertainment? To feel the gut wrenching realisation that you're starting to enjoy it yourself? We are all monsters deep down. After that, well, you've read my journal. Oh I know you have. So you know how I ran. How I hid. After all of that, I took on masks. Became other people. I lived as so many different people. Finally, I became Reldo and then I met you and, well, it's been your story ever since. Not mine.",
    "Ha. Do you know, it's surprisingly easy to live forever? I know! Shocking really. But it is. There are so many spells and potions that it's almost trivial. Almost. For me, it may not surprise you to learn, the gift of immortality comes from a rather clever little invention of my own. But we don't yet know each other...intimately enough, for me to share the exact details. One day, perhaps, I'll sit you down and tell you all about it. But for now let's leave a little mystery in our relationship.",
    "Oh I have had many lives. I was a farmer once. I raised sheep. Do you have any idea how dull it is to raise sheep? It's just endless wool and bleeting[sic]. It was supposed to be idyllic, but I was just so bored. So I tried my hand at being a circus clown. I called myself Mr. Giggly. Problem was, it's actually quite hard to be a clown. It's far easier to come across as a serial killer than it is to be a source of mirth. So I was politely asked to leave the circus. It was a fairly reasonable request. I tried my hand at being an assassin. I thought a life of sneaking around and taking out dangerous targets would be fun. But those who could afford my services often made requests that even I couldn't justify. So I left that life as well. Well, for the most part at least. After that I tried lots of faces. I was a knight, a wizard, a bar mistress. I was a goblin once, that was weird, don't recommend. In the end I settled on good old Reldo and he just stuck.",
    "Enchanting is a lot like your invention. I think it's probably a branch of the same sort of thinking. But where you refine and use divine energy, I create my effects by manipulating the flow of magic within a device. Quite similar in many ways, but my devices mostly take their power from the user. Just little bits, here and there, you'd barely notice it. Whereas your inventions seem to require an external source of power to make them tick. The potential is practically limitless, just as magic is practically limitless. Although like magic it has rules. But it has taken me several lifetimes to master my art and I won't give you a headache by trying to teach you it all now. I suppose you're more interested in what it can do. You're, I suspect, familiar with my ring and you've already seen my necklace. These are subtle devices that shift perceptions and emotions. Little nudges in the synapses to let you see or feel differently. Arguably more useful are devices like this here.",
    "I lost this arm a long time ago, it was annoying, but I adapted. When I learned how to create my little inventions, I thought 'how can I help people?'. Ok, I thought 'how can I help myself?'. I created an arm. It works just like a normal arm, although it lacks the full range of sensations. It's quite handy. Oh no.. I punned. I am so sorry."
  ],
  "Gail": [
    "No and it never will be!",
    "How dare you profane this sacred relic with your dragonkin sorceries! Do not think for a moment I will allow you to corrupt the Needle.",
    "I will protect it!",
    "NO!",
    "NO! You must not interfere with the Needle. The Needle serves the anima flow. It serves the Elder Gods. I will not let the Needle be defiled by one of the bound ones! You saved me from death, World Guardian, I am grateful. But I cannot let you do this.",
    "What you are doing is wrong, World Guardian. It is blasphemy of the highest order. It is a forbidden act. See reason, please. The Needle is not meant for this!",
    "No, please, I am losing it. Losing the song. Stop. I beg you. Please stop!"
  ],
  "Guthix (voice over)": [
    "I know you are there, Sliske. The Shadow Realm cannot hide you from me. Step forward. We will speak.",
    "I know why you have come, Sliske. I know what you are here to do.",
    "You are here to kill me.",
    "Good.",
    "Know this: My death will not bring you what you seek, but it must be done. And it must be by your hand.",
    "You will never be a god, but your hand will usher in the new age. With my death, the gods shall return.",
    "It is necessary. From my death will be born another, one that the world needs more than me. A new Guardian for this world, one with the power to stand against those who will rise."
  ],
  "Sliske (voice over)": [
    "Quite perceptive, Guthix. Most people don't even have an inkling that I'm watching them. Not even the other gods!",
    "Yes.",
    "If I gain nothing, what is the point?",
    "And immediately start trying to kill each other. A new God Wars. Now, that does sound like fun! But why would you want such a thing?",
    "A World Guardian. Hmmm... Tell me more."
  ],
  "Sliske": [
    "Oh, World Guardian, look at you, quaking in your boots. I think you and I are destined to do this forever.",
    "You know what happens next.",
    "Yes, absolutely. It is a vital part of the process.",
    "The staff, what you call the Siphon, is a great symbol to the gods.",
    "It will rally them, it will make them listen.",
    "What are gods? Well, now that is a complicated question.",
    "They are mortals suffused with a fragment of your great power, that lets them tower over their own kin.",
    "They are focal points for the people of this world.",
    "Leaders and figures of worship.",
    "That is precisely why we should bring them all together for you to study.",
    "And I know just how to get them all together.",
    "Why aren't they fighting?",
    "I gave them the perfect prize. The perfect reason to kill one another.",
    "But they're doing nothing.",
    "Only Armadyl actually killed one of them. Armadyl!",
    "Everyone else just hides and bides their time.",
    "It's boring! BORING! This isn't what I imagined at all!",
    "Maybe it's time to bring in some other contenders.",
    "Let's get Guthix's precious World Guardian into play.",
    "I do so want to see these 'powers' in action, whatever they are.",
    "Perhaps it's time Nomad came out of hiding",
    "It would be a shame if Death got an anonymous call..."
  ],
  "Guthix": [
    "Just a fragment. A piece of a memory, little more.",
    "It's fitting seeing myself there. In the end, try as I might, was I really any different? My actions tore this world to shreds. I brought the stone here, which created wars that lasted millenia. I banished the gods, which sent entire cultures into exile and despair. Even in death I have brought nothing but pain and misery.",
    "It's kind of you to say that. But you are wrong. I had enough power at my fingertips to change the world. To bring real growth and healing to the universe. But, in the end, mine is a legacy of bloodshed.",
    "It means a great deal to me that you think so, Player. A great deal. But on balance, if you'll pardon the pun, I did more harm to this world than good. By inaction as much as action.",
    "Yes. I think you are right.",
    "I did one good thing in my lifetime. One act that indisputably improves the world. I gave you the power and the opportunity to do the right thing. You, my World Guardian, can now stand against the threats to our world. You have a real chance to make a difference. You and only you, can be trusted with that terrible burden. Forgive me. Do a better job than I did.",
    "Goodbye, World Guardian. Forget me."
  ],
  "Vicendithas": [
    "Father, what is this? These maps, they're so...so old.",
    "Orthen? But...that's a myth isn't it? From times before even the green stone toucher arrived?",
    "What do you intend to do?",
    "I found your notes father. You can't do this!",
    "I found your notes father. You can't do this!",
    "And what of the others? Everyone on this planet will die!"
  ],
  "Narrator": [
    "The world guardian arrived just too late. Kerapac's plan had worked flawlessly. With a triumphant shout he plunged the staff into the Needle to absorb its power. Gail watched in horror as control of the Needle was taken from her and given to the dragonkin. In an instant, she was Gail no more. Primrose stood, staring at the monster before her. Kerapac roared in triumph, the power of the Needle, now his to command. He took to the air, and the Needle vanished from sight at the whim of its new master. He flew east to the coast and out across the sea, vanishing into a great storm. And there he set to work on the next stage of his endeavour..."
  ],
  "Primrose": [
    "I...what...where am I? I...the Needle...it's...it's gone?",
    "I...I think so. It's strange. I can feel my memories coming back to me. I can feel her drowning in them. I...I think I want to see my mum now.",
    "It's strange being back home...being me. Mum has been really trying. She's happy again, it's nice.",
    "It's odd...I can still sort of feel it. Feel the threads of time. I can't control them or change them, but sometimes, if I concetrate, I can read them. I can see what was...what really was. It's not a particularly precise skill though, it probably won't come in handy much."
  ],
  "Congratulations! You have completed": [
    "'Desperate Times' - Complete this quest."
  ],
  "Main article": [
    "Transcript:Desperate Measures"
  ],
  "Megan": [
    "She's back. My beautiful Primrose is back. Thank you! I don't know how it happened, but you've made my whole world bright again. You're a true hero. I will never try and control her again. I'll just be there for her, I'll be a good mum."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Desperate_Times?oldid=36221859’"
  ]
}