{
  "Auguste": [
    "Greetings! Would you like to be my number one accomplice? I mean, assistant?",
    "I am Auguste. I am going to be the first balloonist in all of Gielinor!",
    "Well, they do...I was a monk. But I'm so sick of living on this island! I want to explore new frontiers!",
    "Maybe! That sounds good. I was thinking just over to Taverley, though.",
    "Ugh! Ocean! Don't talk to me about the ocean...oh dear...I think I feel ill.",
    "I have devised a new way to travel. But I need an assistant balloonist to help me build my design. Are you an experienced adventurer willing to help me?",
    "Wonderful! Let's get started.",
    "Of course, of course, how foolish of me. Well, we are going to make a balloon.",
    "Let me show you!",
    "Have you noticed how ashes float above fires for long periods of time?",
    "Don't you see? It's the hot air! It rises, taking the ashes with it. I had this epiphany while I was at the glass blower's house. If we pump hot air into an envelope it will rise because it is lighter than the cold air around it.",
    "We are going to sew a big sack and light a fire under it. Once the sack fills with hot air it will begin to rise, taking us along with it in the basket.",
    "Well, no. You see, I don't have the materials here to make any test balloons. That's where you come in! You are going to collect materials for two test runs of the balloon. You will need to get three sheets of papyrus, one ball of wool, one full sack of potatoes, and one unlit candle.",
    "When you have all of it, bring it to me and I'll explain what to do next. Any questions?",
    "You're the adventurer, you should know! Think of logical places, like, churches; they have tons of candles.",
    "You don't? Oh...well...it's just, they rise, you know, from the fire... Maybe you should pay more attention to things!",
    "Have you gotten the materials?",
    "Good, you have everything! Now, I need you to create an origami balloon.",
    "First, use the papyrus on the ball of wool. The papyrus is folded into an origami box and the yarn will support the heat source. Next, add the unlit candle to the balloon structure. It will act as the heat source. Once you have done that let me know and we will begin our experiment.",
    "Failure is not an option.",
    "You don't seem to have any of the materials. You need a ball of wool, three sheets of papyrus, an unlit candle, and a full sack of potatoes.",
    "You need a ball of wool, papyrus, and a full sack of potatoes.",
    "You need more papyrus, a full sack of potatoes, and an unlit candle.",
    "You need a ball of wool, an unlit candle, and a full sack of potatoes.",
    "You need a ball of wool, an unlit candle, and papyrus.",
    "You need more papyrus and a full sack of potatoes.",
    "You need more papyrus, and a ball of wool.",
    "You need more papyrus, and a ball of wool.",
    "You need an unlit candle and a full sack of potatoes.",
    "You need papyrus and an unlit candle.",
    "You need a ball of wool and an unlit candle.",
    "You need an unlit candle.",
    "You need a ball of wool.",
    "You need more papyrus.",
    "You need a sack full of potatoes.",
    "First, use the papyrus on the ball of wool. The papyrus is folded into an origami box and the yarn will support the heat source. Next, add the unlit candle to the balloon structure. It will act as the heat source. Once you have done that let me know and we will begin our experiment.",
    "Wonderful! I'll take that, and we'll conduct our first experiment.",
    "That was perfect. My hypothesis was right!",
    "One more test. Then we shall proceed.",
    "We shall meekly go! No...no...it needs to sound grander. We shall cautiously go...",
    "Do you have the other two sheets of papyrus and a full sack of potatoes?",
    "You need a full sack of potatoes.",
    "You need more papyrus.",
    "You need a full sack of potatoes and more papyrus.",
    "Commendable. If I may have those, I will construct this experiment.",
    "Failure is not an option.",
    "Ahh, the flash mob phenomenon. Many have hypothesized that they are beings of great power sent to smite those who question the gods.",
    "Don't worry! I know exactly what I'm doing. Those experiments went extraordinarily well.",
    "Yes, very well indeed. Now we will start building the balloon that will carry us off the island. This task will be much greater than the last two. I hope you are prepared for it.",
    "You need to get the following items:Yellow dyeRed dyeTen pieces of silkA clay bowland eight sandbags.",
    "Sandbags can be made by getting empty sacks and filling them at the sand pit here on Entrana. However, there are other sand pits around the world that will work as well; there is one in Yanille, Rellekka, and Zanaris. You can bring items back to me as you get them, while you are waiting for the tree to grow.",
    "I am going to give you a willow sapling and a basket of apples. You must plant the willow sapling at a tree patch. If you give the basket of apples to the gardener near the patch, he will look after the tree for you while it grows. Don't lose the sapling! It took me a long time to save up enough for one. If you do, you'll have to pay me 30,000 coins for a new one. Once the tree is fully grown, cut twelve branches from it using secateurs. Bring the branches back here and use them on the metal frame on the platform to create the basket. Here you go. Now be very careful not to lose it!",
    "Do you have anything for me?",
    "That's the last of it!",
    "Ah, wonderful, yellow dye. Thank you.",
    "Red dye! Thank you.",
    "You don't have any dye with you.",
    "I need red and yellow dye for the balloon.",
    "Sandbags, thank you. This will allow us to change height.",
    "You don't have enough sandbags. Please bring me eight.",
    "Sandbags can be made by getting empty sacks and filling them at the sandpit here on Entrana.",
    "However, there are other sand pits around the world that will work as well.",
    "Silk for the balloon, thank you.",
    "You don't have enough silk. Please bring me ten pieces.",
    "Ah the bowl. This will be used to hold the fuel while it heats the air in the balloon.",
    "I need a plain clay-fired bowl; they're quite ease to come by.",
    "What do you need help with?",
    "I was told a while ago that there was a witch who made dye in Draynor Village. Maybe you should start by looking there.",
    "Sandbags can be made by getting empty sacks and filling them at the sandpit here on Entrana. However, there are other sand pits around the world that will work as well; there is one in Yanille, Rellekka, and Zanaris.",
    "Hmm, I believe silk is imported from the desert. Perhaps someone there can tell you where to find it.",
    "I think there is a spare one in the glass blower's house. I rent a room from him there, so I don't think he'll mind you taking it.",
    "It will cost you 30,000 gold coins to replace it, do you want to pay that?",
    "You already have one! Don't be greedy.",
    "Here you go. Now be very careful not to lose it again!",
    "You just need to build the basket and I can finish the balloon! How are you getting on with the willow?",
    "It will cost you 30,000 gold coins to replace it, do you want to pay that?",
    "You already have one! Don't be greedy.",
    "Here you go. Now be very careful not to lose it again!",
    "Use the willow sapling I gave you to grow a willow tree. Cut twelve branches from it using secateurs. Use the branches on the platform here.",
    "Great! Let me just put it together and we'll be ready to lift off! Speak to me again in a moment.",
    "Well, let's get going!",
    "Theoretically, we are ready for the maiden voyage.",
    "Well, of course. With you piloting I am sure we will survive.",
    "Don't be silly. I'm not going to pilot it. We will be safe in the basket, the only thing we will lose are the logs. You will pilot it, won't you?",
    "Wonderful! Let me explain my hypothesis on how to control a balloon.",
    "The balloon needs ten normal logs for fuel. I believe the balloon will be controlled based on weight, so you must not have more than 40kg with you. Also, I seem to have lost my tinderbox, do you think you could bring one? We need it to light the fire.",
    "Right! So, the balloon mechanics. Your prime direction will always be to land the balloon on the target at the end of our route. I've written to some friends in Taverley who have kindly painted one on the ground there. We must avoid everything, because the balloon is very fragile. Even clouds will be dangerous! But if my calculations are correct, we will be able to squeeze through some surprising spaces, if you pilot it well. Those sandbags you made earlier will give the balloon a big lift when dropped, whereas adding the logs will only make it rise a little bit. But don't use them up too quickly! We have no way of replenishing them. If you do run out of logs and sandbags you will not be able to go up any longer. Just make the best of it and hope we can make it to our destination without going upwards. I've added two ropes, the red one is an emergency rope, it will let the hot air out of the balloon and we will drop quickly. The other rope will only drop us a little. If we get into tribb...beg your pardon, trouble, in all likelihood we will crash. But do not fear! We should be fine. Just make sure you come back to Entrana so we can try again. If it all goes horribly wrong, you can always bail. If we're still over Entrana, we can land quickly and try again. However, once past the island, we will crash. Are you ready to go?",
    "Well, that didn't go as planned.",
    "I'll have to get one of the monks to come pick it up. You head back on your own; just follow the path. I'll meet you back at Entrana.",
    "We have traveled in a way that no man has traveled before! The next step will be to go where no men have gone before. Player, it has been a privilege flying with you. For all your hard work, I give you this jacket and cap for future ballooning adventures.",
    "I am considering starting a balloon enterprise. People all over Runescape will be able to travel in a new, exciting way. As my first assistant, you will always be welcome to use a balloon. You'll have to bring your own fuel, though.",
    "I will base my operations in Entrana. If you'd like to travel to new places, come see me there. Do you want to use the balloon? Just so you know, some locations require special logs and high Firemaking skills."
  ],
  "Player": [
    "Who are you?",
    "Balloo-what? I thought only monks lived on Entrana.",
    "And go where no man has gone before?",
    "Why not take the boat then?",
    "Whoa, ok, no ocean. How exactly are you going to get off the island, then?",
    "Yes! Sign me up.",
    "Wait. I still don't know exactly what we're doing.",
    "Which is what exactly?",
    "How exactly do you plan to get to Taverley in that? How will it work?",
    "What's your point?",
    "Come again?",
    "You seem pretty confident about this. Have you tested it?",
    "What am I supposed to do with all that junk?",
    "Where do I get all this stuff?",
    "Err, no. I can't see that kind of detail.",
    "Yes.",
    "How do you make the origami balloon?",
    "No.",
    "What do I need to get again?",
    "How do you make the origami balloon?",
    "I lost some items, what do I need again?",
    "I finished the origami balloon!",
    "Did you not see the burning?",
    "Burning? Fire? Hello?",
    "We're doomed.",
    "Yes, I have them here.",
    "Well, that went down like a lead balloon.",
    "Oh, I've misplaced them.",
    "Those peasants... where did they come from?",
    "And this isn't worrying because...?",
    "Was I the ONLY one who saw them burning? BURNING???",
    "This is madness.",
    "What tree?",
    "Yes, I want to give you some items.",
    "Here's the dye.",
    "Here are the sandbags.",
    "Here's the silk.",
    "Here's the bowl.",
    "Never mind.",
    "I'm having some trouble finding some of the items.",
    "Never mind.",
    "I have lost my willow sapling. Can I buy a replacement?",
    "No way!",
    "I have lost my willow sapling. Can I buy a replacement?",
    "No way!",
    "What do I do again?",
    "Fine thanks.",
    "Wait; tell me what we're doing.",
    "Theoretically?",
    "WHAT!? This is your balloon! Why aren't you going to pilot it? And what do mean 'survive'? You never said anything about me flying this bird!",
    "Fine, I will. So how do I control the balloon?",
    "Oh no, not another hypothesis!",
    "And here, I thought all the legwork was done. Fine, I'll bring a tinderbox.",
    "Okay.",
    "So what now? How will we get the balloon back?",
    "The crash must have really sent us off course. I'm near Falador!",
    "So what are you going to do now?",
    "Thanks!"
  ],
  "You do not meet the requirements to start": [
    "'Enlightened Journey'.[sic]"
  ],
  "Bob": [
    "Destroy the floating thing!"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Enlightened_Journey?oldid=35811678’"
  ]
}