{
  "Player": [
    "Hi!",
    "Ah, you sound like someone who needs a quest doing!",
    "Sure. Any idea where I should start looking?",
    "Okay, thanks.",
    "Hello, are you Nickolaus?",
    "The Ardougne zookeeper sent me to find you.",
    "Well if you gave me a ferret I could take it back for you.",
    "Trapped?",
    "So it's not that you're trapped then?",
    "Oh, but I'd come to rescue you.",
    "Aren't giant eagles mythical?",
    "How did you manage to find the nest?",
    "So in fact the eagle found you?",
    "Amazing, but what do you intend to do now you've discovered it?",
    "I think you're trapped.",
    "Well, I'll let you get on with your work then.",
    "Well, I'll let you get on with your work then.",
    "Could I help at all?",
    "What would that involve?",
    "That's a good idea. There are plenty of feathers around here. I'll see what I can do.",
    "Well it'll give you a lot of time to study the eagles.",
    "Well, I'll let you get on with your work then.",
    "Hello Nickolaus, how are you getting on with your discoveries?",
    "The Ardougne zookeper sent me to find you.",
    "A pet? Are you crazy?",
    "I've come to rescue you.",
    "Aren't giant eagles mythical?",
    "Errr...what are you saying exactly?",
    "Well, specifically I'm after a couple of bird costumes.",
    "A giant eagle.",
    "What materials would you need?",
    "Wait a second, you have a supplier? But I thought nobody knew where to find the nests?",
    "I'll see what I can do.",
    "What was it you needed to make those eagle costumes again?",
    "I've got the feathers and materials you requested. Can you make those giant eagle costumes for me now?",
    "Okay, here are the materials. Eagle me up.",
    "Thanks.",
    "On second thoughts, that's too expensive.",
    "Hello Nickolaus, how are you getting on with your discoveries?",
    "Yes, I have one right here.",
    "No, Nickolaus, it's me! I'm just in disguise!",
    "No of course not. You sent me to get you an eagle outfit remember? So you could get out of this nest?",
    "Yes, I have one right here.",
    "I've given you the disguise you needed, can we go now?",
    "Hello again Nickolaus.",
    "Well I was originally sent to find you because of a ferret. Can you get me one at all?",
    "That sounds good to me. What do I do.",
    "Okay, so we've baited the trap with meat, now what?",
    "But what if I don't like waiting for things?",
    "Great, thanks!",
    "I was just wondering how you got on with those eagles.",
    "No thanks. I was just dropping by, wanted to make sure you hadn't been abducted again.",
    "Yes I have actually. He'd been abducted by giant eagles, but I managed to rescue him. He's now gotten back to his hunting.",
    "Even better, I have a ferret right here for you.",
    "Hi, how are you getting on with that ferret?"
  ],
  "Charlie": [
    "Yes, er, welcome to the zoo! I'm afraid I'm kind of busy right now; what was it you wanted?",
    "Actually, now that you come to mention it, you might be able to help me. A few weeks ago we had a delivery of a northern ferret. They're funny little creatures. Turns out they're tricksy little blighters too. Whilst we were unloading him from the cart he managed to escape his cage. What's more he gave the driver a nasty nip on the way out too. This was obviously a bit of a blow, you can't make a new attraction without any animals. We got in contact with one of our associates, a huntsman called Nickolaus, who agreed to capture us another. Funny thing is we haven't heard from him for some time now. I don't suppose you'd mind having a look for him?",
    "Well the northern ferret is mostly found around the mountains just west of the Gnome Stronghold, so that would probably be a good place as any to start looking.",
    "Ah, hello again. Have you had any luck finding a clue as to Nickloaus' whereabouts yet?",
    "Giant eagles? What a strange notion. Well, regardless, if you've found him can you tell him to hurry up with that ferret.",
    "You do? Ah, yes, wonderful, I never doubted you for a second. That'll make an excellent addition to the zoo.",
    "Well he seems to be just as vicious as the one we lost, but we're still very grateful for your help in acquiring him."
  ],
  "Nickolaus": [
    "Hello? Er..excuse me?",
    "Aha, I see my reputation precedes me. Yes, I am the renowned hunter and explorer Nickolaus: You've arrived just in time to witness a very momentous occasion, for I have just discovered the nest of a giant eagle. And a most amazing discovery it is too, even if I do say so myself.",
    "Ah yes, he sent me to find a ferret. A trivial task, and one which pales in comparison compared to this momentous discovery. I'm sure he can wait.",
    "Well that's very kind of you, but I'm afraid all my equipment is down at the camp site. I'd go with you but currently I'm somewhat, er ...",
    "How very kind of you. But Nickolaus Farrick never needs rescuing. I may apparently be trapped in a giant eagle's nest, but it is all a cunning ruse to put the beast at ease.",
    "Oh many people believe so, yes, but my relentless exploration has paid off once again, for I stand now in the nest of such a supposedly mythical creature.",
    "Through unfaltering dedication, attention to detail, oh, and I suppose there's the minor point that I got carried here by an eagle.",
    "So it might appear to the amateur yes, and, well, I may have been a little lucky, but it's still a remarkable discovery, don't you think?",
    "Well, there's all sorts to do. I need to observe its behavior patterns and document its feeding habits. The discovery is only just the beginning you know.",
    "It's always a pleasure to discuss my discoveries.",
    "It's always a pleasure to discuss my discoveries.",
    "Well I think trapped is quite a negative way of looking at it. I will admit however that getting out of here may be a little tricky. I did have a plan, but unfortunately it didn't involve being stuck in this nest.",
    "Actually I believe you could. I need to somehow trick the eagles into thinking I'm one of them. Could you fashion some sort of disguise for me?",
    "Well, you could go and speak to the fancy dress shop owner in Varrock. He can make anything if you give him the right materials. In fact you should probably get a couple of disguises, one for each of us.",
    "Very true, and certainly an opportunity I wouldn't want to miss.",
    "It's always a pleasure to discuss my discoveries.",
    "Wonderfully, these giant eagles are sim ply magnificent creatures. I absolutely must see about geting one as a pet.",
    "Quite possibly, quite possibly, but I haven't found a creature I couldn't tame yet.",
    "Wonderfully thank you, although I am still having just a little trouble convincing them to let me leave. I don't suppose you've managed to get that disguise I asked for yet?",
    "What's this, a young hatchling? Oh no, I hope it doesn't think I'm its dinner!",
    "You're sure...you're sure you're not going to eat me?",
    "Wow, that really is a very convincing disguise. Have you got one for me too?",
    "Well bring it over here then. It's not much use to me over there.",
    "Excellent, now there is no way the eagle will be able to tell me from one of its own. Now you run off, and I'll meet you back down at the camp site.",
    "Calm down. You must realize I can't leave just like that, this is far too amazing an opportunity. Just go down to the camp site and I'll meet you there.",
    "Ah, hello again. Can I help at all?",
    "I'll do better than that. I'll teach you how to capture one yourself.",
    "Come with me and I'll show you.",
    "And now... we wait. Quietly!",
    "Did I mention we wait quietly? Shhh, here comes something.",
    "Ha ha, there you go! One gift-wrapped ferret ready for delivery.",
    "See, it's all just a matter of patience.",
    "Ah wonderfully. They're actually most cooperative creatures once they get used to you. With some rope I'm sure you could find some way to tame them... maybe even fly on them.",
    "No such luck I'm afraid, but I'm sure I'll make another discovery soon enough. I always seem to."
  ],
  "Fancy-Dress Shop Owner": [
    "Now you look like someone who goes to a lot of fancy dress parties.",
    "I'm just saying that perhaps you would like to peruse my selection of garments. Or, if that doesn't interest you, then maybe you have something else to offer? I'm always on the lookout for interesting or unusual new materials.",
    "Ah, an inspired choice. What kind of bird were you thinking of?",
    "Very interesting. Unfortunately I don't think I have any giant eagle costumes in stock at the moment. Of course if I had the materials I could make them for you.",
    "Well, the main problem is that I'm fresh out of giant eagle feathers. I've been meaning to get onto my supplier about that for some time.",
    "Well, there was some chap in desert clothing. He said his name was Ali. He assured me they were giant eagle feathers, although when I come to think about it they were suspiciously similar to chicken feathers. Anyway, you're probably looking at about 10 giant eagle feathers, assuming you can find a nest. I'd also need some swamp tar to hold things together and some yellow dye for the beaks. Everything else I can supply myself.",
    "I should be able to knock something up if you get me 10 of the right sort of feather. I'll also need some swamp tar and some yellow dye.",
    "Certainly. It'll also cost you 50 gold pieces.",
    "There we go; two eagle costumes. You should be the envy of the entire party with those.",
    "Well, feel free to come back if you change your mind.",
    "These costumes will be a bit of a handful, and I'd feel better if you had four free spaces to handle them. I mean, you wouldn't want to drop them and get them all dirty now, would you?"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Eagles%27_Peak?oldid=35956150’"
  ]
}