{
  "Kharshai": [
    "Player! You have arrived not a moment too soon. I hope my message found you in good health.",
    "That is...troubling. It may have been intercepted. Regardless, your visit is fortuitous, for I am in need of your assistance. The 19th Ritual of Rejuvenation is upon us. Far, far earlier than expected.",
    "Indeed. Do not be deceived by my youthful appearance. Something is happening to the mahjarrat. Our power is draining, rapidly, and we can do nothing to prevent it. My efforts to divine a cause have only accelerated my degeneration. The mahjarrat are forced to convene at the ritual site, and I am sure to be first in line for the sacrifice. You attended the last ritual, and now Guthix has declared you his World Guardian. You may be the only one who can help me survive the ritual and solve this mystery. Will you help me?",
    "I thought we had developed a friendship... I hope I was not mistaken. Return to me if you change your mind.",
    "You have my gratitude. The ritual will begin shortly. It is imperative we are there when it commences. If you have questions, now is the time.",
    "Our power has always been slowly but surely draining. Every five hundred years we must perform a Ritual of Rejuvenation to reverse the effects. As you have witnessed first-hand, in the ritual we must sacrifice one of our own so that the others may receive their power and continue to prosper. Survival of the fittest. Now something is causing our power to drain more rapidly than ever. A ritual is being called to rejuvenate us and, hopefully, prevent any further power drain. Personally, I am not convinced it will work. Our numbers will simply continue to dwindle. It is high time we solve our reliance on rituals or else consign our race to extinction.",
    "Perhaps you remember when Enakhra and Akthanakos visited me after I regained my memories? They made no secret of their feelings towards my neutrality. Being the only mahjarrat not to pick a side in this war of Zamorakians versus Zarosians leaves me with no allies. I have no shame in admitting I am not the strongest of my race. I cannot stand up to them if they rally against me, which seems inevitable. Unless I have you.",
    "My theory is that it has to do with the return of the gods. It cannot simply be a coincidence. We mahjarrat are born from the same divine energy as Zaros and Zamorak. Energy from our namesake, the elder god Mah. With Zaros's return they could be using more of this energy than in the previous god wars. I theorise that they may be drawing on us as sources for more energy, just like we do in our rituals. I must say, I hope I am wrong. It is a terrifying proposition...",
    "Only slowly. It takes hundreds of years for us to revert to our skeletal forms. At this rate, we would need rituals almost monthly. Our race would be completely wiped out within the year. We must find a solution fast, Player.",
    "Alas, it is a struggle indeed. This feud has stretched over thousands of years. I fear it is as ingrained in our culture as the rituals are. If our race is ever to find peace - ever to free ourselves from this downward spiral - there must be an awakening.",
    "I have tried to calm the rivalries between the factions and certain individuals, but the return of the gods has caused bitter hatred to flare up once again. What little progress I had made appears undone, but I still believe there is hope. One thing, at least, could still unite our race. If Zamorak and Zaros were to loosen their grip on us, to put an end to this war, we could finally start to progress. Perhaps if they were to bury the hatchet, form an alliance or... Or if something left them both completely out of the picture...",
    "Nothing, nothing. Merely the musings of a very conflicted mahjarrat.",
    "Hm, two of the greatest rivals this planet has ever seen. Their factions have been clashing for millennia, but I wonder how they think of one another... I lived in Senntisten under the rule of Zaros, serving in the military before being transferred to the church as Azzanadra's personal inquisitor. There were many positives to the empire, but many felt our race was stagnating. Zaros ruled from his above, rarely gracing either the church or the army with his presence. The 'empty throne', they called it. He was absent yet still controlling from on high, his orders relayed through the cardinals that sat beside his throne. A throne as empty as his promises. Perhaps that is why some use his title so mockingly; the Empty Lord who never delivered us from our curse.",
    "Ah yes, the Legatus Maximus. So frustrated with Zaros's rules and regulations that he brought down the god with his own hands. A shame that his teachings are equally as flawed. He lives and breathes the mahjarrat philosophy of survival of the fittest. 'Strength through chaos'. I believe Zamorak has always acted in what he believes to be the best interests of the mahjarrat, but where has that got us? Our numbers are dwindling and the survival of our once great race hangs in the balance. Perhaps we are the fittest no longer... His teachings may be misunderstood, but they have done precious little aside from fostering cults that preach evil. Our race must forge our own path if we wish to prosper once again.",
    "Very well. I must make preparations for the journey. Go to the site east of Trollweiss Mountain and touch the ritual marker, I will sense your arrival.",
    "Would you like me to teleport you to the ritual marker?",
    "Greetings, Player. Ah, perfect. We are the first ones here.",
    "We wait. The other mahjarrat will have sensed you activating the marker too. They will be here momentarily. It has been some time since I last saw the ritual stone. It brings back...unpleasant memories.",
    "Stop! Please, let us not try to hide the fact that this is no normal ritual. Clearly something strange is happening to us.",
    "I do, as I am sure we all do. How long would another ritual sustain us? Months? Weeks? We cannot go on like this!",
    "Perhaps it is time we outgrow these primitive rituals. There must be another way!",
    "My theory is that the gods you follow are taking it from us. They are made of the same divine energy, it cannot be a co-",
    "My lord, forgive me...",
    "Zaros, if you truly have nothing to do with this, then why have you come here? To witness our demise?",
    "Before we make any decisions, I would like us to recall the last time Zaros made us the very same promise.",
    "This is solving nothing. We are discussing events that occurred thousands of years ago. There is only one way to fairly settle the dispute. We must revisit the events so that they are fresh in our minds.",
    "I am talking about memory projection, Zemouregal. Slightly lofty concept for a brute like you, I know.",
    "Take this, Player. We need to find my memory of what happened thousands of years ago, when Zamorak marched on Zaros at the heart of his empire. Go to the area south-east of Varrock Dig Site. Archaeologists there have excavated the throne room of Senntisten. You can use the charged engrammeter to capture my memories located there. While you are gone, I will explain my research on memories to everyone here. I have kept it a secret long enough.",
    "Go to the area south-east of Varrock Dig Site. Archaeologists there have excavated the throne room of Senntisten. You can use the charged engrammeter to capture my memories located there. While you are gone, I will explain my research on memories to everyone here. I have kept it a secret long enough.",
    "Take this, Player. We need to find my memory of what happened thousands of years ago, when Zamorak marched on Zaros at the heart of his empire. Go to the area south-east of Varrock Dig Site. Archaeologists there have excavated the throne room of Senntisten. You can use the charged engrammeter to capture my memories located there. While you are gone, I will explain my research on memories to everyone here. I have kept it a secret long enough.",
    "Ah, good. I see you have collected my memories. Would you like me to teleport you to the ritual marker?",
    "Excellent, Player! You have the memory stored in the engrammeter. Now, let us continue...",
    "As you are all now aware I have been studying our ability to reconstruct memories. My research has led me to the discovery that I can use an engrammeter to allow others to enter my own. I was present in the throne room on the day of the betrayal. It is time we relived those fateful events. Hopefully they will show us first-hand what Zaros promised us. Brace yourselves...",
    "Azzanadra had summoned me to the throne room, but his message was vague. My job in Senntisten was that of inquisitor, so I first sought information as to what was going on and why I was needed.",
    "Someone has broken this mouthpiece. It could be an indication that they wish to silence the Empty Lord...",
    "I already found this clue.",
    "Hmm, someone seems to have marked this particular pillar with some rushed graffiti. A pair of horns, perhaps?",
    "I already found this clue.",
    "Duke Sucellus.",
    "However will Forinthry cope without your leadership?",
    "Surely a being of your keen insight has seen something.",
    "I see. Anything else you have picked up on?",
    "And what say you?",
    "Char's absence is unlikely to be our Lord's only concern, but her silence is cause for suspicion. Who else was on this mission?",
    "I hadn't given the matter much thought.",
    "What are you and the sixth legion still doing in Forinthry? I thought the area was completely under our control.",
    "Is it difficult, being so far from the capital?",
    "Where are you based?",
    "Of course...",
    "Jhallan, it is good to see you.",
    "Surely you, of all these people, know why we are here?",
    "As is the case all too often these days. What is your assessment of the situation?",
    "Hmm. If this is the case then it would seem I have an inquisitorial duty to perform.",
    "Can I ask you something, Jhallan?",
    "Whenever I talk to the others about you, they call you rude, but you have always been kind to me.",
    "I know exactly what you mean.",
    "Be seeing you.",
    "Perjour, might you know why we have been gathered here?",
    "I recall that Perjour was repeatedly touching a book he used to carry. A curious magical object that would record his every thought and action.",
    "Nothing is more important than a summons from Zaros. Zamorak of all people should know that.",
    "Have you heard from Char? It sounds like you were assigned similar missions.",
    "Well, you keep touching that book of yours. In my line of work you tend to pick up on nervous ticks.",
    "Yes, I have heard all about your book. A curious object, yet extremely useful to the Empty Lord. Always able to read what you have seen and done.",
    "Then I am sure you won't mind if I take a look inside.",
    "You forget yourself, Perjour. I am inquisitor. It is my duty to check these kinds of things.",
    "An interesting read, Perjour. 'I had heard speculation of who the traitors may be, but had no such knowledge myself.' Curious, if there is truly a spy among us it would seem you are not him.",
    "Perhaps. Still, I did not appreciate your description of me. I am only doing my job, Perjour.",
    "How does your book work, Perjour?",
    "Are there others like it?",
    "Why is that?",
    "Are you saying that Zaros does not trust you? Or someone you work closely with?",
    "Zebub.",
    "It surprises me to see you here, should you not be leading your forces in the north?",
    "I meant no offence. I was also summoned, what seems to be happening?",
    "I see. Your presence must be imperative if the Empty Lord was willing to postpone your operation.",
    "I saw your ballet.",
    "Your ballet. The Annihilation of Onkhara.",
    "You do not like it?",
    "It is really very good. It really captures your power and majesty. Even Zamorak is a patron.",
    "The dancer, Char, is away from Senntisten currently, but perhaps when she returns you can see the performance.",
    "The demon looked down for a moment. At the time I thought nothing of it, but in retrospect I realise he knew something.",
    "Farewell.",
    "It was clear we had been summoned because there was a plot to overthrow our leader. As inquisitor it was my job to deal with such situations, but Zaros's most fierce loyalists would still need convincing of my innocence...",
    "Trindine.",
    "I see you are here.",
    "Why are you here?",
    "You don't have to be so hostile.",
    "This was clearly a mistake.",
    "The ring of enchantments protecting this place has been broken here. Someone has undoubtedly tampered with them.",
    "I already found this clue.",
    "Someone has stashed weapons here. The guards prevent most from entering while armed, so someone important must have snuck these in for others to use. Quite worrying...",
    "I already found this clue.",
    "Curious, more wall markings. The horns look like the symbol of the Avernic rebellion adopted by some of our military. Perhaps the guards marked this vantage point?",
    "I already found this clue.",
    "Akthanakos was scanning the room suspiciously. I knew he could be a sly old dog, so I was keen to convince him of my innocence early and avoid it coming into question later.",
    "Akthanakos, my friend.",
    "Prove myself? You have known me for hundreds of years...",
    "Fine, what would you ask me?",
    "Do not worry, I understand the need for suspicion more than most would.",
    "Be seeing you.",
    "Ah, Pernix, what a surprise. It is quite rare to see you away from the battlefield.",
    "Nex sent you in her stead, I assume. Have you had word from Zaros?",
    "Surely you do not suspect me, Pernix?",
    "Glad to hear it.",
    "Where is Nex?",
    "What could be so important that she cannot attend a recall?",
    "Remind me.",
    "I see.",
    "I will be conducting my duties, if you hear of any more spies be sure to let me know.",
    "If you had not noticed there is a bit of a situation. What about you? Not often you show your face...anywhere.",
    "Thank you for the sarcastic answer, but I was talking about your role in proceedings today.",
    "Hopefully you will not get the chance.",
    "He must place a lot of trust in you to act so strongly on your advice.",
    "Care to share them with me?",
    "Now is not the time for games, Sliske. I need to know what you do if I am to perform my duty.",
    "How many traitors are there? Who could be orchestrating this whole thing?",
    "Sliske...",
    "Is that really possible? I suppose the signs do seem to point towards that conclusion...but you are often a difficult source to place trust in, Sliske.",
    "You must have a lot of enemies, Sliske.",
    "How do you always stay one step ahead of them?",
    "And what would you do if all your plans fell apart and you were finally cornered?",
    "Why are you here, warpriest?",
    "I am afraid I cannot, it is my duty to verify your loyalty to Zaros.",
    "I remember thinking it seemed odd that a human would refer to others of her race in such a way. I had a number of tools at my disposal for suspicious situations such as this.",
    "Of course, sorry to bother you. Enjoy this beverage by way of apology.",
    "You ought to remember that mahjarrat are far stronger than humans, warpriest.",
    "As I suspected.",
    "How naive of you to think you could trick me. You will be dealt with alongside the other traitors, demon.",
    "I'm afraid you have been far too conspicuous for my liking.",
    "How naive of you to think you could trick me. You will be dealt with alongside the other traitors, demon.",
    "As you were then, my apologies.",
    "With their accusations quashed but my own suspicions mounting, I headed down to the main floor where suspects were being interrogated. I hoped to offer some rationality...",
    "Azzanadra, finally. Seems I am too late and you have rooted out the traitors already!",
    "It was at this moment that the puzzle pieces connected before me. The horns of the Avernic rebellion, an absent high ranking military commander, Char's silence... The traitor was none other than the Legatus Maximus, Zamorak.",
    "Not particularly. Most of my time has been spent having to clarify my loyalty to every person in the room!",
    "Anything useful? I have found marked vantage points, weapon stashes, broken enchantments. I even uncovered and restrained this avernic spy myself! What is most disturbing, though, is that all evidence seems to point towards our Legatus Maximus as the ringleader. I believe Zamorak is plotting to usurp Zaros.",
    "Anything useful? I have found marked vantage points, weapon stashes, broken enchantments. I even uncovered and restrained this avernic spy myself! It would seem someone wishes to usurp Zaros, but I cannot fathom who would wish to do such a thing.",
    "What is our next move then, your holiness?",
    "I must sentence them?",
    "I see. As you wish, Azzanadra.",
    "I should consult with Azzanadra first.",
    "The evidence seems damning. What do you have to say in your defence?",
    "It is with a heavy heart that I deal your sentence. You have committed treason, forfeiting your life.",
    "Rise, you are no traitor. Go home to your daughter.",
    "I should consult with Azzanadra first.",
    "The demon I had discovered in disguise only moments ago was clearly a traitor. It did not pain me at all to pass the sentence.",
    "I wanted to say he was innocent but only moments ago I had discovered the demon disguised as a warpriest. It pained me to pass the sentence, but with all eyes upon me there was no other choice.",
    "I am sorry, demon. You leave me no other choice. The penalty for treason is death.",
    "I should consult with Azzanadra first.",
    "It gives me no joy to pass judgement on you. I am sorry, the penalty for treason must be death.",
    "I believe you, human. You may walk free.",
    "There. I have done your bidding, Azzanadra. Wh-",
    "In that moment I was forced to make a choice. Stay loyal to the Empty Lord or pledge my allegiance to the usurper...",
    "Well, the fighting was fierce in the throne room. I could not see what happened next between Zamorak and Zaros, but few claimed to have witnessed the struggle. When I became aware of Zaros's demise, Zamorak was standing before him with the Staff of Armadyl plunged through his chest.",
    "Well, I think I would be able to tell if it has been tampered with, but-",
    "I believe so, yes. It was most definitely a memory and showed no signs of interference.",
    "Hmm, perhaps you are right. Our impending doom is not something we can ignore, but if nothing else we are now wiser.",
    "Hmph, I might still be in need of you, Player. Meet me on the other side of the world gate. I will be waiting on Freneskae.",
    "We are still on Freneskae, do not fear. The Falls of Mah, we called this place. Acknowledged as the most dangerous part of the journey to the Ritual of Enervation site. I must say, it feels incredibly strange to be back here after all this time. It would seem seismic activity shook the world gate from its perch, we are lucky it remained in tact. The important part, at least.",
    "I remember hardship; that has always been very much the way on Freneskae. It does not look like much has changed in that way since we left. Come, we have still got a long way to go before we reach the ritual site.",
    "Listen, Zemouregal, this is bigger than all of us. For once we need to work together if we are to survive.",
    "Player, help me!",
    "Player, why?",
    "Player... To think I considered you a friend.",
    "You said there would be no more sacrifices!",
    "Please, let us not descend into insults now. The unification of our factions would be the greatest leap of progress for thousands of years!",
    "Player, we could not have accomplished this without you. You have my gratitude.",
    "You should meet Zaros atop the mountain, unless you wish to ask me something?",
    "I was thinking of leaving, Player. Not just leaving Freneskae or the Fremennik. Leaving Gielinor. Passing through the World Gate. I was and have always been a mediator for my people. They did not know that they needed me, but they did. Now my voice has lost its weight, and there are no ties that connect us anymore. What role does a mediator play in improvised anarchy? I feel a desire to travel, to visit the ilujanka perhaps, to see Infernus roiling one more time.",
    "There will be optimism among us, no doubt, but I am ever the sceptic. I wonder whether the rituals were the only barriers between us and complete chaos. They forced us to ally, to rely on one another. They gave us structure. They gave us perspective and something akin to mortality. Without them, I worry that we will become monsters.",
    "You have become a friend, Player. More than I deserve, more than any Mahjarrat deserves. There is something I have kept from you, and I feel you deserve to know. When we were gathered on the Frozen Plateau, I became aware of who my attacker was - who wiped my memory. Something triggered the memory: it must have a lingering scent, an echo of their power. I do not know why it hadn't come to me before. I am sure that my attacker was Lucien. It gives me pause, as my power was never close to his. I should be dead, a crystal at the bottom of the sea. It's time I did something to give my remaining life some value.",
    "What an adventure, Player. Our race is saved from the threat of extinction! Now I must look towards my own future.",
    "It appears you lost my tome of knowledge upon your travels."
  ],
  "Player": [
    "You sent a message? I don't think it reached me.",
    "So soon? How is that possible? Jhallan's sacrifice should sustain the mahjarrat for another five hundred years.",
    "Why is an emergency ritual needed?",
    "Why are you worried you're the one who would be sacrificed?",
    "Do you have any idea why your power is draining so fast?",
    "Doesn't your power always drain, though? That's why you need the rituals in the first place.",
    "How's your struggle for peace between the two mahjarrat factions going?",
    "Sounds like you have a plan...",
    "What are you suggesting, Kharshai?",
    "What's your opinion of Zaros and Zamorak?",
    "What about Zamorak?",
    "Looks like I'm the first one here. It should be safe to summon Kharshai.",
    "What do we do now?",
    "I should be able to find Kharshai's memories in the throne room of Senntisten, recently excavated south-east of Varrock Dig Site.",
    "The rest of Kharshai's memories should be within these ancient doors.",
    "The engrammeter is full. I should return it to Kharshai at the ritual marker in the frozen north.",
    "[sic] Anything else you wish to discuss?",
    "[sic] Which war?",
    "[sic] I had not thought about it. I do not think it will make much difference to me. There are always more enemies within.",
    "[sic] I suppose.",
    "I should talk to Kharshai before I start playing with rocks near lava.",
    "What happened to the world gate? Where are we?",
    "Can you remember much about your time here?",
    "Zemouregal! Get your hands off him!",
    "Zemouregal, get back here!",
    "This is where the road ends. It seems insane but if I'm going to save Kharshai my only option is to surf the lava falls on this rock. Here goes nothing...",
    "What...what happened?",
    "Seren? What are you doing here?",
    "Oh, of course, thanks for saving me. I was in trouble there!",
    "There was no need to save me, I had everything under control.",
    "Umm, what are you doing here...please?",
    "Does that mean you know why the mahjarrat are being drained of their power?",
    "Really? I wonder why he didn't tell us... What's causing it?",
    "That's a ritual stone?",
    "So what is Zaros doing bringing all the mahjarrat here if she wants to reclaim her energy from them?",
    "Wait, she's siphoning energy from Zaros as well?",
    "But...you're gods! If Mah isn't stopped you'll really all be gone?",
    "What do you think he's up to?",
    "To kill her?",
    "What would he gain from killing Mah?",
    "I should talk to Seren about what happened before I leave.",
    "Release him, Zemouregal, or you'll have me to answer to.",
    "I seem to remember you running with your tail between your legs the last time you faced me.",
    "Why don't you sacrifice him now and get it over with?",
    "I really don't care whether you sacrifice him or not.",
    "Mah is completely helpless. She created all of you, how could you betray her?",
    "What do you mean 'controlling aura'?",
    "Mah isn't just draining the mahjarrat of their power. She's draining it from both of you as well.",
    "I'm on it!",
    "What can I do to help?",
    "How do we do that? Can we defeat the creatures she dreams into existence?",
    "I am.",
    "Hang on. You want to send me into the nightmares of a dying Elder God?",
    "What happened?",
    "What happened?",
    "Wow...why are there muspah stood around her core like that?",
    "Nothing has been destroyed, that must mean it worked!",
    "Did Mah survive?",
    "Can we help her?",
    "I found Mah's core in the deepest part of the nightmare. There was something wrong with it, like it had been corrupted.",
    "Like an icy scar. A spiral of blue crystal carved deep into the core.",
    "What is it, Seren?",
    "How did Seren trick the mahjarrat into performing the rituals?",
    "Feeling sad about the death of your mother was unexpected?",
    "Mah wasn't completely dead when the ritual ended. Seren made the decision to put her out of her misery.",
    "Is that thing all that's left of Mah?",
    "World Guardian is a bit formal.",
    "I'd like to ask about you.",
    "I'd like to talk about the future.",
    "I'd like to talk about your history.",
    "That's all for now."
  ],
  "Zemouregal": [
    "Ahh, I see the sacrifice is already here. Nice of you to show up, Kharshai.",
    "Hah! You fear for your own life as your numbers dwindle, Zarosian worm.",
    "Of course you would try to win him over, Za-",
    "Preposterous!",
    "Khazard.",
    "Good news? He is probably the cause of our troubles!",
    "Pah! Speak for yourself you-",
    "Surprise, surprise. Zaros clicks his fingers and Azzanadra comes running.",
    "Precisely. We did the dirty work building his empire on the false pretence that he would save us from extinction. He turned his back on us time and time again, until we entered his throne room beside Zamorak and made that arrogance his downfall!",
    "He does not! It is just as before...an empty promise with no intention of delivering upon it.",
    "LIES!",
    "What are you talking about, weakling?",
    "You again. Why must you persistently meddle in our affairs? Go forth, then, hound of Kharshai, and unearth this supposedly juicy bone your master has buried for you.",
    "I could not care less if you join us or not, you will be sacrificed before long anyway. Now step aside!",
    "Zamorak overpowered your Empty Lord. That is all there is to it.",
    "Then we all witnessed the truth. Zaros is clearly the one who cannot be trusted. The ritual must go on!",
    "This is ridiculous. The only reason I will set foot on Freneskae is because I cannot perform a ritual on my own.",
    "Do not start making any plans yet, Kharshai. You are coming with me!",
    "I think not. Call this my insurance; if Zaros dares betray us again then Kharshai will be our sacrifice. And if that does not stop this attack on us, I will sacrifice each of those Zarosian maggots one by one until Zaros relinquishes to our might.",
    "This is just the kind of cowardice I have come to expect from the one being sacrificed. Now come along, there is still plenty to get ready before the rest assemble. Our ancestors may have had to traverse these lava falls, but learning the art of teleportation has made a mockery of that pilgrimage. Good luck surviving alone and on foot, Player.",
    "Quiet, rat. I have no trust in Zaros. When he does not deliver I will sacrifice Kharshai right here and be done with these futile games!",
    "Haha! You are awfully pompous for a glorified babysitter.",
    "Hmph.",
    "Haha! Finally someone who talks sense. I might begin to like you yet, Player.",
    "Haha! Looks like you just lost your only ally, old boy. Oh well, I will put you out of your misery soon enough.",
    "Still, it does not hurt to keep him in tow.",
    "The Empty Lord finally graces us with his presence. Just consider old Kharshai here collateral.",
    "Fine. I will come back to you later, Kharshai.",
    "So your plan is to transfer Mah's power directly to us?",
    "Alright. I may not trust you, but I cannot fault the logic of your plan.",
    "Then Azzy and his sidekicks are just lovesick weaklings!",
    "Let us get on with it then.",
    "You may bear the guilt, but not the consequences. Look what you have done to our glorious race. Look at what is left of us!",
    "Bah! You are swept up in the moment. We do not need these Zarosians to regain our glory.",
    "Run along to Zaros, whelp. Unless you would rather talk to me, which does seem likely.",
    "You want to know so you can get in my way again? Ha! You think I am an imbecile, a villain who wanders about speechifying? You want to know what I intend to do with my power? I intend to USE it. It will not be bottled up or researched like these fools. It is going to be like fireworks in the sky! There are things that need to be done - some duties, some grievances to be resolved but they are a quick step to the fantastic dance that will follow.",
    "Who are YOU truly loyal to? You stand and question me, as if I am a merry turncoat, yet you have had more masters than a demon butler. I am loyal. Who or what I am loyal to is none of your damned business. Now crawl back to your pie-making or tree-cutting or whatever it is you do.",
    "Very little, with some minor exceptions. Hazeel alone has earned my true respect, but I must admit I see something of me in Khazard. The rest could all be tossed into the fires of Infernus and I would not even waste a trip to watch them burn."
  ],
  "Enakhra": [
    "And you brought a bodyguard. Hah! Player can't save you. This is going to be the most unanimous vote since we said goodbye to dear Lamistard.",
    "Then why have you come here?",
    "You'd best make haste, my dear. We'll have to continue with the sacrifice if you dawdle. I've yet to be convinced Kharshai is of more use to us alive than dead.",
    "Unfortunately, it would seem we have no other choice. Zamorak will watch over us on our journey, of that I am sure.",
    "You brought us here for another ritual?",
    "The pact will bind him to his word, Zamorak. He will have to free us!",
    "I knew you Zarosians would be forced to see the benefits of Zamorak's teachings eventually.",
    "Off you go to Zaros atop the mountain then, or you could ask me something instead, of course.",
    "What Zamorak bids. He will need me, and I will be at his side. It is the least he deserves. But I intend to sniff around Zaros. He has presented himself as something between a saviour and a friend, and I buy none of it. I intended to see beneath that damned mask and show it to the world.",
    "You humans are so obsessed with distinction. That is female, that is male. Life is not to be tagged and sorted, worm. Life is chaos and chaos cannot be preserved and studied. Our forms are the will of Mah. Do you presume to understand her will? An Elder God's will? She was unknowable. We must call it chaos simply to remain sane. Here is an answer for you: maybe Mah loved Zaros more than the witch Seren. She constructed more commonly in his image. Is that a nice story, wrapped in a bow for you?"
  ],
  "Akthanakos": [
    "I see it did not take long for you to descend into petty insults.",
    "I- I have? Surely not so soon...",
    "Clearly Sliske thought the same, he has not even bothered to turn up. What if he has found his own solution?",
    "Kharshai wastes what little time we have. It is our present degeneration that concerns us. Memories of the past? They are but grains of sand long since drained through time's hourglass. Lord Zaros has shown us the path to our salvation. We should hasten to Freneskae.",
    "I am sorry, I cannot trust you are the real Kharshai unless you prove yourself. There are spies everywhere.",
    "If there are traitors among us, as I have heard, one of them could easily have adopted your visage, especially if they are one of our kind. I cannot be sure until you have answered some questions.",
    "Hmm, let me see... A god watched over us on Freneskae. What was her name?",
    "You must be an imposter, Kharshai would answer that question with ease!",
    "You must be an imposter, Kharshai would answer that question with ease!",
    "Well, that was an easy one. A blabber-mouth like Sliske would probably reveal that information to just about anyone! Oo, I have thought of a better one! What Menaphite deity brought us to Gielinor?",
    "Leave me, I do not believe Kharshai would get that question wrong.",
    "Leave me, I do not believe Kharshai would get that question wrong.",
    "Ah, yes ok, perhaps that one was too easy as well. You could be any mahjarrat. We need something only Kharshai would know... The real Kharshai knows me well. When I wish to be alone, I take advantage of my own shapeshifting abilities. What form do I take on?",
    "Thank Zaros, it is you! Finally someone I can trust. I am sorry to have doubted you, Kharshai.",
    "I will not stop you proceeding any longer, please continue.",
    "Incorrect. Any Mahjarrat would know the answer to that question!",
    "Incorrect. Any Mahjarrat would know the answer to that question!",
    "Have you given any thought to what you will do when the war is over?",
    "Well, all of them. Eventually the last holdouts will be brought under control and we will control all of Gielinor.",
    "And so the backstreet and the courtroom become our new battlefield?",
    "How depressing.",
    "That did not help us at all. There was no mention of what exactly Zaros promised us!",
    "Azzanadra, we cannot trust Zamorak!",
    "Looks like I am not the only one to revert. Even you have assumed your skeletal form, Bilrach.",
    "Oh, well yes, of course. Following my example, obviously.",
    "But she is so weak already. Will she survive?",
    "Some of you I am willing to bury the hatchet with, but you are a snake, Enakhra. You will never have my trust.",
    "You should visit Zaros where Mah died, Player, or is there something else you want to know?",
    "It is not something I would tell the others, but I have always been in the shadow of the ritual. I have kept my head down. I have gathered enough power to direct gazes to other mahjarrat. I have maintained alliances with the prominent. That shadow has gone, and now I look at my life and I do not recognise any of it. It is just a series of blank walls and empty faces. Whatever I do next will be fearless, know that. I am going to stand as equals with the gods. I am going to be known, feared, loved. The name Akthanakos is going to mean something.",
    "I do not know the answer to that question right now. For once, I feel like I want to focus on myself, to understand what this means for me. That is not self-interest, it is something that needs to happen. I feel like a chess piece that was on the winning side having never been moved."
  ],
  "Hazeel": [
    "I would keep your voice down if I were you, Akthanakos. You are so feeble you have reverted to your skeletal form already!",
    "Quiet, Zemouregal. The time for bravado has passed. If our power continues to drain at this rate we will ALL be dead within the year.",
    "Zamorak will know you are here. Do you wish to re-enact that downfall?",
    "You did not keep that promise last time you made it, or when you made it to the ilujanka. Your empire was built on empty promises!",
    "Stop sulking, Zemouregal. I see no other option but to hear Zaros out. First, though, we must inform Zamorak.",
    "Wake up, Azzanadra. Your memory is fogged by blind loyalty. Zaros told us he would find a way, told us we would be rewarded for doing his bidding.",
    "I support Kharshai's plan. Our prejudices and the ravages of time have fogged our memories of that momentous occasion. A reminder of what we all truly witnessed is exactly what we need.",
    "Kharshai, make the right choice. Join us in striking down the Empty Lord and reclaiming our independence. Our glory!",
    "Come on, Azzy. They were in the same room as us the entire time. You cannot still be in denial after all these years.",
    "But history has not changed, and neither has our predicament. Zaros could be using it to manipulate us, just as before.",
    "Zaros requested we meet him at an old ritual site, Zemouregal. We may yet get a sacrifice.",
    "Come on, Zemouregal, we will see what Zaros has to say for himself. Kharshai will not be going anywhere.",
    "Why should we care if she survives? She is the reason we escaped this forsaken planet in the first place!",
    "Zamorak, brother, swallow your pride. We have no other option.",
    "It was all lies. Our race has dwindled to such a paltry number for nothing...",
    "You have taken issue with our methods before, Azzanadra. You know it will happen again.",
    "Zaros wanted you to meet him atop the mountain, Player. We can talk, though, if you have time.",
    "I will take time to test the limits of it. I have never been recognised for my patience, but I am beginning to see its value. Once the dust settles, I will look to the Shadow Realm. It was my province once, and Sliske has made a questionable choice in not joining us here. I also have my eye on a force, a fallen people. It is time to move from a cult to something of substance.",
    "I was not always of the Mahjarrat. That answer will seem strange to human ears. There was a time when I was Mahserrat. Humans would probably call them a different 'tribe' to the Mahjarrat, but that tells a half-truth. Power was not shared among the Mahserrat like it is with the Mahjarrat. They had no rituals. I could see the inevitable: that the Mahserrat were doomed to a death of weakness. Or a death from the Mahjarrat, of course. So I separated from the Mahserrat. But abandoning my nature left its mark on me. My body was twisted. Only Mah will know why this happened. Perhaps I twisted her intentions? But I embrace it. It is a reminder of my progress, of my growing.",
    "We all had our suspicions. Zamorak may have a hatred of secrecy, but he has been reticent to talk about his - what do you humans call it? - personal life. Until this moment, I have been Khazard's... mentor. If Khazard wishes to continue his teachings, then I am ready. If Zamorak replaces me, then I will find another to teach."
  ],
  "General Khazard": [
    "Sounds like something the next sacrifice would say!",
    "Please, Zamorak... Save us.",
    "Kharshai makes excuses to save his own skin. The longer we hesitate, the more of his power is lost to the rest of us.",
    "So we should just play right into Zaros's hands?",
    "Then you mean a Ritual of Enervation?",
    "Z-Zamorak? My father?",
    "F-father, can we really trust this to work?",
    "Chop chop, Zaros is waiting up there. I am far more interesting though, if you wish to converse.",
    "It's tempting to slam a metal fist into your temple, but imagine the grumbling. Azzanadra would be whimpering all day long. Right now, my power is Zamorak's. I am his hand, holding a blade dripping in blood. If he wants me to tear holes in the Shadow Realm, I'll tear. If he wants me to fight Sliske, I'll fight. If he wants your head on a spike, I will chew it off.",
    "What is it to you? This is not one of your human plays, little runt. I'm not going to cry or burst into song. Palkeera was my mother. Zamorak is my father. All I know is this means I have great power within me, as I always suspected. What's important is repaying Zamorak. Whatever he needs, I will give."
  ],
  "Azzanadra": [
    "Kharshai is right, Khazard. Our power is draining at an alarming rate. We are not due another ritual for hundreds of years.",
    "Agreed. It is imperative that we push for a solution.",
    "You have always had my trust, and the trust of those that stand beside me, my lord.",
    "I pray you bring good news, my lord. We fear for the future of our race.",
    "Know your place, you ungrateful whelp.",
    "Well, my opinion should be clear. We must go to Freneskae.",
    "Zaros never promised us anything. He took interest in our rituals and speculated that there may be an alternative. That was all.",
    "My memory is as clear as day, Hazeel. Yours has been warped by Zamorak's propaganda. He has manipulated all of you!",
    "Have you not yet retrieved Kharshai's memory? You disappoint me.",
    "I sent for you hours ago, I cannot rely on information from that untrustworthy snake Sliske alone. What took you so long? Actually, it does not matter. Time is of the essence and if you have come this far then I am sure my sentries have verified your loyalty. I am afraid the corruption spreads much further than these three, Kharshai. They are merely pawns. Have you found anything useful on your journey here?",
    "Yes, well, you know as well as I that you can never be too careful around here, old friend.",
    "I was afraid you might say that. He was summoned here and told to abandon his mission with Char but no one has heard from him since.",
    "I have heard speculation from the Praetorians but I am not ready to draw any conclusions yet. You know how trustworthy Sliske can be.",
    "You are inquisitor, time to fulfil your duty. Prove your loyalty to Zaros once and for all by passing judgement on these suspects.",
    "Either they are innocent and may walk free, or they are traitors and must face execution. You are the most appropriate person here to decide, do you not think?",
    "Speak to each of the suspects to judge their innocence.",
    "An interesting case, this human was found marking pillars with red paint.",
    "Kharshai, I hope I do not have to bring your own loyalty back into question.",
    "This one was found tampering with the ring of enchantments around this room. He claims he was attempting to repair it, a likely story.",
    "Be careful, Kharshai.",
    "Zamorak, this is madness-",
    "You are drunk on power. Does your arrogance know no bounds?",
    "He will not answer your taunts. Call off your men!",
    "So it is as we suspected. Zamorak, the Legatus Maximus... Such betrayal. Make your choice now, Kharshai. Do you stand with Zaros or these treacherous backstabbers?",
    "The Empty Lord will reward your loyalty, of that I am sure. For now we must ready ourselves for battle.",
    "Kharshai, Zaros does not forget.",
    "He has told me himself...no one else was present when the blow was struck. There must be a missing piece to this memory that has the information we need...",
    "We do not need to hear whatever lies you are about to spout, Zamorak.",
    "...",
    "Well, Kharshai? Was this memory legitimate?",
    "I do not trust him. I do, however, trust Kharshai. Even in the throne room, with all eyes upon him, his judgement was sound.",
    "I do not trust him. Kharshai is the only expert we have, although it pains me to say so having just relived him betraying us. He is neutral now, though, and I believe he is telling the truth.",
    "Zaros has changed. He is not the god he used to be.",
    "At least some of you are able to see reason. There may yet be hope for us.",
    "Yet unfortunately the moment is ruined. Let Kharshai go, Zemouregal.",
    "She is still our creator.",
    "Well, that changes things somewhat...",
    "What other choice do we have, Player? It is her or all of us. Sacrifice a life to save many...one last time.",
    "What must we do, Zaros?",
    "Surely it cannot be. Our greatest tradition was never anything but a facade?",
    "And sacrificing our own kin was the best you could think of? With all the power and wisdom you have been gifted that was the best you could do?",
    "Your actions here may have earned my respect, Zamorak, but I will never work alongside a fool like Zemouregal.",
    "Kharshai is right, we stagnated so long that we almost allowed ourselves to be completely wiped out. What gods we pledge allegiance to does not matter unless they are at war. We are all one race. We are all children of Mah.",
    "Zaros awaits you atop the mountain. If you wish to ask me something, be quick.",
    "I wish to talk to you about the same topic, Player. It would seem something strange has happened. Before the ritual, I felt the ceiling of my power. But that is no longer the case. I feel like I am unshackled. I need time to myself, time with my books to research the meaning of this. But I have a very real fear. Let us talk about it later, away from the others, once I have found out more...",
    "It has only strengthened my bond. To an outsider, Zaros's actions may have seemed selfish, perhaps underhanded. But Zamorak needed to be directed. Zaros knows that an unfettered Zamorak is destruction for Gielinor. Zaros needed to manipulate this moment to move Zamorak onto a different path from the one he was on.",
    "I once came across human troops in the Second Age who were discussing whether I could 'take' Zamorak. There is obviously something in the human condition that desires conflict between the powerful. Moia against Char. Zamorak against Zaros. I should spend time ruminating on why humans care about these trifles. But know this! I would have defeated Lucien any day of the week."
  ],
  "Bilrach": [
    "Shhh. I can almost hear it...yes. The power escaping from me, from all of us. You sense it too, don't you, Kharshai? Concerning indeed.",
    "Mmm, yes, a good point has been made. What makes you think we should believe you this time?",
    "Oh yes. Our master will be most intrigued to hear of these developments. If he is not already watching, hmm...",
    "The faces of my fellow mahjarrat are more ghoulish than I recall. Perhaps it is the bright snow. I am yet unaccustomed to daylight's harsh glare.",
    "My lord, you grace us with your presence.",
    "Master, our power escapes with time like sand through our fingers. Our hand is forced-",
    "Curious. The pull on our energy here seems even stronger than before.",
    "Assumed, yes. Reverted, no. I have decreased my energy signature to be as low as possible, thus extending the little time I have left, hmm.",
    "Hmm...",
    "Interesting, very interesting.",
    "Hmm, Mah stirs...the clock is ticking faster. I see no other path to salvation, my lord.",
    "Mmm, yes, it is true. I remember the visit, somewhere in my mind. Aeons ago, it was. You looked somehow different, Seren, but you are not Mah. You are a pretender.",
    "I wonder why Zaros wanted to meet you at Mah's deathplace. Oh, do you have something to ask me?",
    "Ahh, power...it is time to complete my Daemonheim project. No doubt, you thought its sole purpose was to find Zamorak. It had another. Daemonheim was to be an army for my Master...yes. Through trials and fear, I would harden the workers so they would become warriors. I would use my portals to raid worlds for their troops. I would reanimate the fallen to populate His infantry. When He was lost, they were a workforce. Now, they are his horde. This power will be used to raise up Daemonheim, to bring it into the world. Bilrach's great gift. And of course there is a floor that I alone have seen...",
    "She has never been tied to the ritual, so this will mean little to her. I have been teaching her to be so much more than Mahjarrat: to be something new. Oh yes. Hmm, Zamorak has plans for her, and those plans require her to be at Daemonheim.",
    "I had forgotten what most of them even looked like, to be honest. When I began the quest for Master, I resented them all. I could see through their posturing to the self-interest. But my labour gave me perspective, hmm. They were scared of Him, which was natural. They did not help because they feared being close to Him, and what that would mean. The one we should all fear is Azzanadra. Indeed, I have dabbled with the power that can be found in madness, and I see its power in him."
  ],
  "Wahisietel": [
    "You speak the truth, Kharshai. It is good to have you back, brother.",
    "If there is an alternative then I am not aware of it. We need to find out what is draining our power.",
    "Zaros! Y-you have finally returned...I have awaited this day for so long!",
    "This cannot be...",
    "Of course, Zaros. We would follow you to the ends of the cosmos.",
    "And Zaros still had the good grace not to strike you down the moment he saw you! You heard what Zaros said. He wishes to save us.",
    "Well met, my friend. I wonder what secrets Kharshai has buried in his dusty old noggin? I do look forward to being enlightened.",
    "Focus on the tasks at hand, Kharshai. These are grave times.",
    "How can you betray us like this, Zamorak? After all we have been through?",
    "The Legatus Maximus... I can scarcely believe it.",
    "Exactly. No one knows the truth. No one heard any more of the exchange!",
    "Zamorak... Please, Zaros is watching.",
    "Surely we cannot trust him. He is manipulating us!",
    "You have said it yourself...our predicament has not changed. I see no other option but to go to Freneskae and see what Zaros is talking about.",
    "Look, we stand in the shadow of Mah...she exists. The legends were true!",
    "This contemptuous attitude will achieve nothing. Zaros is going to deliver, is that not why we are here?",
    "Of course, your tune completely changes at the first sniff of power.",
    "If this works, you will be the saviour of our people, my lord.",
    "You taught us to kill one another. Made us rely on it. You led us to the very brink of extinction!",
    "Zamorak, you showed self-sacrifice today I did not know you possessed. While my loyalty will always lie with Zaros, I will stand for the unity of our race.",
    "Zaros is waiting for you, Player. Meet him atop the mountain, unless you have something to ask me?",
    "I wish to talk to Azzanadra about that very topic, but he seems distracted. I fear that he has been given another secret note by Zaros, another task that can only been[sic] given to the trusted. As if I am untrustworthy. As if I have no ability. Am I a footnote? Is that where I lie in that damned Perjour's book? Am I to be an observer in this wretched story? Forgive me, Player, it is hard to keep emotions at bay when you are coursing with power. The exhilaration is intense.",
    "Without Mah, they are phasing in and out of reality. They are echoes of her power and will, and over time they will dissipate. In the short term, they are still powerful and to be feared. At least, by you.",
    "A valid question, if an unusual one to ask now. One answer will be less than satisfying. We were made by Mah, and she simply made us that way. We were likely formed from the same crystal that covers Zaros and Seren's bodies. But that gives rise to other questions. Were we made from Zaros? Are we children of Zaros, not Mah? Like the elven city, were we constructed from Seren? We will never find out now. When we die, our crystals remain, yet the rest rots away. It is likely, then, to be our source of power, our long life. It may even be the substance that denies us an afterlife. To answer your question, why do we have these crystals? It is because these crystals are who we are."
  ],
  "Zaros": [
    "Be still.",
    "Silence, all of you. You need not fear me. I have come to earn back the trust you once placed in me.",
    "Your loyalty has never been called into question, Azzanadra. But there are those here that conspired toward my downfall.",
    "Such vitriol, Hazeel. Zamorak does not concern me. I wish you no harm.",
    "I know what is happening to you all. I know why you are gathered here.",
    "Ah, Player. I must thank you again for your assistance. Perhaps your presence here can help clearer heads prevail.",
    "Ah, we have the world guardian in our presence. I hope you will also reconsider your allegiance to me.",
    "Zemouregal. I will warn you only once; do not insult me. Unfortunately you are right to fear for your race. Your power is being drained so rapidly that you will all likely wither and die without a solution.",
    "As I said, Kharshai, I wish to earn back your trust. Hope is not lost. I wish to make good on a promise I made to all of you long ago. Before the god wars... Before the empire. If you accept, I offer you your pride. I offer you salvation. I offer you freedom from your rituals.",
    "I have not come here to beg. I once promised you something I did not know how to give. I return to you now with knowledge I did not possess before. I wish to bestow upon you a gift that will make amends for my past missteps. All you need do is return to Freneskae, the origin of your species. I implore each and every one of you, accept my offering.",
    "Enough. You have heard what I came here to say. Player has already configured the world gate for you. I will await you at the Ritual of Enervation site on Freneskae. Meet me there, or conduct your rituals until the last of you breathes your final sigh of regret.",
    "Enough!",
    "You are Legatus Maximus, you are supposed to be loyal.",
    "Never.",
    "Azzanadra, deal with this fool.",
    "Kill these traitors!",
    "You seem confused, Zamorak. Did you expect to dispatch a god so easily?",
    "I do not know where this power you are wielding has come from, but it means nothing here. You are in my world now.",
    "We are in your mind, Zamorak. You cannot touch me in this place, because we are not physically here.",
    "And I expected more of you than deceit and mutiny. You are - were - my most trusted general.",
    "Semantics! I simply told you what you needed to hear. You are nothing but glorified mercenaries, fighting for whoever is top of the food chain.",
    "Nothing? I am your god. You are simply a child who has grown insolent enough to bite the hand that feeds. But you cannot bite now. Kneel before me.",
    "How does it feel to be utterly powerless?",
    "All that remains is to decide how best to punish you. Perhaps death is too merciful...",
    "What is this? You cannot hurt me here. You cannot even touch me!",
    "Release him.",
    "You will not be needing sacrifices anymore.",
    "Do not forget who you are speaking to. Release him.",
    "I understand you all are sceptical, but it is time I put your worries to rest. This ritual marker has been dreamed into existence by the very Elder God that created each and every one of us. You are the exception, Player, and your assistance will be imperative. I believe Mah created this ritual marker because she intends for us to use it. We must conduct one final ritual.",
    "And I spoke the truth.",
    "Not quite. I will aid you in a Ritual of Rejuvenation, but we will draw energy directly from Mah.",
    "I have more information you would benefit from hearing. Mah is the drain on your power you have all been feeling. It will not stop while she exists. She cares for you. It is my assessment that she created the marker to draw you here and give you the last of her energy.",
    "Yes, Zemouregal. You would gain more power than you have ever experienced, and with Mah gone there would no longer be a need for your rituals.",
    "There will be no more bickering. We must take advantage of Mah's peaceful slumber to begin the ritual.",
    "She has spent most of her life consumed by nightmares. Even her brief moments of lucidity are plagued by madness. It pains me to see her sad existence, truly. We would be doing her a kindness.",
    "I need all of your full concentration now. It is time. Focus your energy-",
    "Zamorak. Right on time, and just as before.",
    "Oh, but it is repeating itself. I will make sure it is different this time though, Zamorak.",
    "And yet the fear in your voice betrays your words. There is doubt in your eyes, not fire. You lack the confidence and naivety you wielded the first time you challenged me.",
    "Yes, the kind of wisdom only loss and hardship can bring.",
    "Have I not also suffered? Neither of us had tasted defeat before; we were both so arrogant we believed ourselves invincible. We are changed now, Zamorak. Both of us.",
    "Hmm, so you know about my curse.",
    "Yes, I am flawed. Doomed never to know whether the loyalty I inspire is genuine unless I withdraw myself as I have done. It is no gift.",
    "Wrong. Their loyalty has always been unwavering, despite my complete absence from this world. And Guthix saw to it that I have no effect on you, Player.",
    "I know how to free them, Zamorak. I know how to free you.",
    "I see. Seren must have intercepted you on your journey then.",
    "Player is right. We are all of the same composition, a family of sorts. I am in the same peril as all of you are.",
    "No, Zamorak. You are wrong. Always so blinded by hatred. Here, let me show you how I can use the ritual mark to channel Mah's energy into Khazard-",
    "You will pay for your ignorance with your life!",
    "Even now it is a shame to end your life.",
    "What? No...",
    "Your self-sacrifice instills devotion in your kin... Somehow, in opposition to everything I try to build - everything I try to give - you stand against me. And it inspires others to do the same. I will not make you a martyr.",
    "You have always had such potential, Zamorak. Even now, you are the embodiment of everything I preach. Such desire to overcome your limitations. I cannot let you go to waste. I am afraid we are far past the point of trust though. There must be precautions this time.",
    "It is a shame you cannot see the value of joining me. The things we could accomplish together... I see only one way we can mutually benefit from this predicament. I suggest we invoke Viniculum Juris, an ancient demonic pact I am sure you are familiar with.",
    "You have no choice. If you wish to leave this place, I need to know you will not interfere with me again.",
    "Sliske has the Catalyst. He intends to give it to the victor of the last of his games and end these nonsensical God Wars. I know you are planning to obtain it. You will continue to do so, but within this game you will perform one action at my request. You will know which request I intend for you to act upon, because I will refer to you as my Legatus Maximus when I address you.",
    "Wait. In return, I vow to deliver upon my promise. We will conduct one final ritual. When it is complete every one of you will have increased in power and the drain on your energy will be gone.",
    "Yes...I will be undone.",
    "We are clear on the consequences. Do you accept my wording?",
    "And the request I intend for you to act upon will be denoted by...",
    "Then it is settled. Player can serve as our witness, [he/she] is sure to be present at Sliske's game. Let us begin.",
    "It is done. We are bound.",
    "Yes, it is about time. Mah will not sleep soundly for much longer.",
    "The marker is acting as a conduit for Mah to siphon energy through. I will reverse this process. This will allow you all to channel power through the marker, as you would in a Ritual of Rejuvenation. The difference being that this time the ritual will draw on Mah's power directly, infusing it into each of you. Permanently.",
    "Player! Mah's night tremors have reached their peak. We need you to head up to her and intercept anything she may spawn!",
    "Go to Mah and prevent any of her nightmares reaching us. If we are to complete the ritual we cannot be interrupted.",
    "We are almost finished here, but Mah could still wake. Go to her in case any of her nightmares manifest.",
    "She is truly gone? Then we did her a kindness, Seren. Her entire existence was pain.",
    "Perhaps not, but now I am one step closer.",
    "Leave her.",
    "Seren, stop, please.",
    "Sister, you will destroy them all!",
    "I will deal with Seren later, for now we must focus on the path ahead.",
    "She has always been caring to a fault; blind to the fact she smothers the subjects of her affection. Her heart ached for Mah, watching her pour what little energy she held into the creation of new beings. To sustain her - to save her from death - Seren taught those creations to transfer their energy back to her in small doses.",
    "She was only doing what she believed was the right course of action.",
    "Then let us not dwell on this topic. There is something far more relevant.",
    "Zamorak, I have kept my word. When Sliske holds his end game, you will be my Legatus Maximus once more.",
    "We shall see.",
    "Just remember, it was I who gave you this freedom. Under my guidance you have all shattered your limitations. It is...inspiring. But remember, Zamorak, I made good on my promise. For now you belong to me.",
    "Believe me, I will. For now there are other matters that require my attention. I must pay homage to my mother. Meet me by her remains, player. I have something for you.",
    "This is all that is left of Mah. In truth, I do feel a sadness spreading within me. It is...unexpected.",
    "She was child-like, treating my sister and I like play things. I was glad to escape her grasp when I left.",
    "Now, though, I feel an aching within me. Like a part of me is no longer there.",
    "I cannot imagine how Seren feels.",
    "Sister... Seeing Mah like that must have caused her immense heartache.",
    "Her reaction is even more understandable after making that decision. I do not expect she will forgive me.",
    "Yes, it is the core of an Elder God. I can sense something dormant residing within. Power, perhaps.",
    "I must thank you for helping me obtain this, Player. It will be very useful for my plans.",
    "None of this would have happened without you. You helped me return to this world and made it possible for the mahjarrat to return here with me.",
    "You were crucial in uncovering shrouded history and even served as the witness for the pact between Zamorak and myself.",
    "You have my respect for helping the mahjarrat. Although some of them will never say this, they are indebted to your efforts here today.",
    "You do not have any space to carry the rewards I wish to give you. Return when you have made room.",
    "Your work here is complete, Player. You may return to Gielinor, unless you wish to converse with the mahjarrat. I am sure they have much to say."
  ],
  "Memories recovered": [
    "[#]/5",
    "[#]/5"
  ],
  "Memory sequence 1": [
    "[#]% complete.",
    "[#]% complete.",
    "[#]% complete.",
    "[#]% complete.",
    "[#]% complete.",
    "[#]% complete."
  ],
  "Duke Sucellus": [
    "*nomf* What do you want, mahjarrat? *nomf scromf*",
    "*nomf* Some matter of the utmost importance, I expect. *crunch* Why else recall the empire's finest general from the north?",
    "My tribunes will manage. *cromf* They are just about capable of acting independently for short periods.",
    "It has been too long since I sampled the delicious variety of the capital. *nomf* Do your own spying.",
    "Well, I note that I am not the only commander here. *scromf* Zebub over there, for example. Avernic belong on the front lines where they have some use. *nomf* I also note a number of august individuals are not in attendance. *crunch* Where is the Legatus Maximus?",
    "The cardinals are in attendance in lieu of our Lord, of course, but the praetorians are also here. *nomf* Sliske and Trindine are somewhere, lurking in the shadows.",
    "More and more have entered the throne room. *nomf* As the murmuring rises it is clear that Zaros is displeased. The room is rife with rumour and speculation as to why.",
    "I say he has spent too long away from that dancer of his. *cromf* My tribunes tell me she was dispatched to the west on some secret matter, and has not been seen in the capital since.",
    "That I cannot tell you. *nomf* Perhaps something to do with the elves that live in that region? *crunch* I wonder what an elf tastes like? Do you think they are very much like humans?",
    "*crunch* The people of the north are unruly and disruptive, not to mention stringy and tasteless. The governor proved incapable of correctly supervising them, so my legion is now permanently assigned to the region. *crunch*",
    "It is no great hardship. *nomf* We ship great carts of food and supplies in every week from the south to supplement the local taxes. The Avernic, of course, do not eat. *scromf* The supplies are primarily for the maintenance of my leadership.",
    "*nomf* We have constructed a new fortress near Ghorrock. Room for ten thousand humans, as well as a great palace for myself, of course."
  ],
  "Jhallan": [
    "Kharshai, my brother.",
    "I would have considered myself worthy of explanation as well, but Azzanadra is too pre-occupied to converse.",
    "The room is full of hushed whispers, my friend. Some say there is a plot to usurp the Empty Lord.",
    "Of course.",
    "Oh, that. It is because I am not interested in playing their political games. All the time everyone is demanding that I pick sides. When I refuse, they just assume I am on the other side.",
    "Good luck, my friend."
  ],
  "Perjour": [
    "Oh, inquisitor! You startled me. R-rumour is that there may be a traitor in our midst.",
    "I was not summoned, personally. The Legatus Maximus sent me as an envoy, his mission in the west is too important to interrupt.",
    "It was the Empty Lord who assigned us our reconnaissance mission. Zamorak assured me he would understand.",
    "Char? The dancer? No, I-I don't think so. Similar missions, you say? I'm afraid I would not know.",
    "Nervous? What makes you say that?",
    "Oh, this? No, no, just a habit I guess. All my thoughts get written in it, so it is never far from my mind.",
    "It is both a gift and a curse...",
    "You can see it already. I assure you it contains nothing interesting.",
    "Only the Empty Lord is permitted to-",
    "Very well. I need not fear you, my intentions are pure.",
    "Indeed. Perhaps you should think twice before distrusting me again!",
    "I-I don't know, inquisitor. One of Zaros's mysteries.",
    "I think so. Mine is the only one in use at the moment though.",
    "The books are only used when Zaros deems it necessary.",
    "N-no, that's not what I said at all."
  ],
  "Zebub": [
    "*snort* Mahjarrat.",
    "Do not probe me, inquisitor. I was recalled by a letter penned by Azzanadra's own hand.",
    "I will be damned if I know, I am supposed to be leading an assault. Azzanadra was explicit in his orders for me to return, though.",
    "Of course, Azzanadra is one of the few that know his will. Now take your leave, Kharshai. I have had enough of your questions.",
    "What?",
    "Bah. That dance had nothing to do with me. I was not asked.",
    "I have not seen it. Dancing is a waste of time.",
    "The Legatus Maximus? Really? Perhaps it does deserve my attention.",
    "Char?",
    "We will see.",
    "FOR THE SCOURGE!"
  ],
  "Trindine": [
    "Kharshai.",
    "I am, yes. Well observed. I can see why they made you an inquisitor.",
    "Why do you think? Mystery and subterfuge? Ring any bells? Hello?",
    "Oh, I do not? You do not think I have good reason to be hostile? To you?",
    "I am glad you realise that now."
  ],
  "Memory sequence 2": [
    "[#]% complete.",
    "[#]% complete.",
    "[#]% complete.",
    "[#]% complete.",
    "[#]% complete.",
    "[#]% complete.",
    "[#]% complete.",
    "[#]% complete."
  ],
  "Pernix": [
    "...",
    "None. Hunting traitors.",
    "There is a traitor in our midst. Why have you come here?",
    "You lie to me, Kharshai.",
    "There are marked walls, you have seen. What was the symbol?",
    "An inquisitor should be more observant.",
    "An inquisitor should be more observant.",
    "What is your assessment?",
    "Wrong. Seems your title is not deserved.",
    "Perhaps you are not a traitor. You may continue. I will not inhibit you.",
    "Busy.",
    "You should have been briefed on this, inquisitor.",
    "She's building a fortress. Tremendous new power source to contain.",
    "Wrong. Seems your title is not deserved.",
    "You lie to me, Kharshai."
  ],
  "Sliske": [
    "And if the whispers are correct they may already be in Senntis- oh look! If it isn't Azzanadra's personal bully. To what do we owe the pleasure?",
    "Oh, Kharshai, I could not miss out on all the fun and games, could I? You need not worry, the Praetorians have the situation quite under control.",
    "We are the secret police in Senntisten, you work 'with' us on a daily basis! Although I cannot understand why for the life of me. It is not like we need two sets of secret police when the Praetorians are already doing such a commendable job. Oh, so sorry, I appear to be ranting. Any more silly questions, inquisitor?",
    "Our 'role in proceedings' is to provide vital reports on potential threats. Plots, traitors, you know...that sort of thing. And if needed, we have our own methods for extracting information from suspects. I must admit, that is the part where I really come into my own.",
    "Of course we did. Everyone is gathered here because of the intelligence WE gathered. I act on the authority of Zaros himself.",
    "It can be oh so stressful ruling an empire. Busy work, you see, even for a god. Zaros relies on me and my Praetorians as his eyes and ears in Senntisten. I know, I know, I am such a charming individual, but I assure you the evidence is quite compelling in this case.",
    "Must you always be so patronising? We have ears all over Senntisten, of course we have suspects. They never seem to expect us to be listening.",
    "Not particularly. Who is to say you are not in league with them, dear old Kharshai? I have always thought you looked quite...shifty.",
    "Alright, alright. You never were much fun anyway. The suspects have been gathered in the centre of the room, mostly minions though, none of the big fish.",
    "Oh, I do hate parting with information. Knowledge is power, after all.",
    "Fine! At this stage we cannot be sure, but we have reason to believe that the person behind all of this is a high ranking military commander.",
    "What can I say? Sometimes being such an enigmatic individual does have its drawbacks.",
    "Must I?",
    "It is all about planning, dear Kharshai. A plan for this, a plan for that. Planning is the foundation of control. You should try it.",
    "All my plans? Why Kharshai, it is like you do not know me at all. There is always another plan."
  ],
  "Warpriest": [
    "Leave me be, inquisitor.",
    "Bother the other humans, they are always huddled around plotting and scheming!",
    "Urgh. This tastes like virii urine. Take your leave, mahjarrat.",
    "Pah! I am an avernic. One day you will all bend the knee to us just the same."
  ],
  "Mol'Zhar the Merciless": [
    "Ahaha, Kharshai! Welcome to the show.",
    "The usurper reveals himself! The Lord's retribution will be swift."
  ],
  "Palkeera": [
    "You will not interrogate me, Kharshai. Not again.",
    "Zamorak has arrived. Your power as inquisitor means nothing now."
  ],
  "Bernard Campbell": [
    "Inquisitor... Kharshai... Please, I have a family. I have a daughter!",
    "They made me do it, inquisitor. The demons threatened my family! Please, I had no choice!"
  ],
  "Memory sequence 3": [
    "[#]% complete.",
    "[#]% complete.",
    "[#]% complete.",
    "[#]% complete.",
    "[#]% complete."
  ],
  "Mal'Koss": [
    "Do what you must, lap dog."
  ],
  "Tobias Bardsley": [
    "I've never stepped a foot out of line! I've always been loyal to Zaros! Please!"
  ],
  "Zamorak": [
    "ZAROS!",
    "Senntisten has fallen! I have the Stone and the Staff. Soon the very walls of this place will be burned to the ground! People of Senntisten. The Empty Lord has led you all to stagnation. He has built this empire on false promises and deceit. Join me in tearing it down!",
    "Hear me, cardinals, scholars of the Church, leaders of the military. Now is the time to rise against the emperor who refuses to show his face! How many of your kin has he sent to their deaths? How many once great races now decay within the walls of this empire? AND FOR WHAT? He has promised you everything, but given you nothing! Stand with me and together we will bring low a god!",
    "It is not you that I seek vengeance upon, brothers. Can you not see what he has done to us? Even now he will not show himself. Even with Senntisten in flames his throne remains empty!",
    "FACE ME, ZAROS! Your reckoning is upon you! People, the time has come. Stand beside me...OR DIE FOR THE EMPTY LORD WHO DOES NOT CARE FOR YOU!",
    "Stand with me, Kharshai. Brother. Zaros would have us consigned to oblivion, we cannot go on beneath his reign.",
    "You have made the right choice today, Kharshai. You have chosen freedom.",
    "Do not make this mistake, Kharshai.",
    "These are my demands, Empty Lord.",
    "You will relinquish control of this empire to me and leave this world.",
    "Hold them back! Leave Zaros to me!",
    "He is correct.",
    "He has left Gielinor and abandoned you already, but I do not wish death upon you. I seek your allegiance. It is vital that you see the final piece of this memory.",
    "Player, it is good to see you here. After the events in Sliske's vault I am confident in saying your assistance is invaluable.",
    "Pity the 'world guardian' has decided to show [his/her] face. In Sliske's vault this one showed [himself/herself] to be nothing more than one of his fanatics. You will regret crossing me, but for now there are more pressing issues to attend to.",
    "Player, I wondered if you would make an appearance. Hopefully since your indecision in Sliske's vault you have made up your mind where your allegiance lies.",
    "Silence, Azzanadra, or I will be forced to make an example of you.",
    "Good. I know what Zaros has asked of you and I implore you not to obey him. He only has his own selfish interests at heart. No good can come of this pilgrimage to Freneskae, but I am well aware some of you will care little for what I say. So I must show you. I only ask that you use the information I bestow upon you to make the right decision.",
    "Have the mahjarrat not always believed in survival of the strongest? Together you are the strongest. You will find a way to survive without Zaros. I will make sure of it. Kharshai, we are about to enter my memory. I trust you will be able to judge its authenticity.",
    "That is all. I believe the sceptics here will trust you as the only expert and neutral party. What I am about to show you all happened precisely after the memory you have just seen. I believe it will provide you with the information you require to resolve your dispute. Only Zaros and I have ever known what transpired in those final moments... Until now.",
    "What... Where am I?",
    "Zaros? What is this place?",
    "What do you mean? Where have you taken me?",
    "Hmm, I expected more of you than cheap tricks, Zaros.",
    "And we entrusted you with the survival and prosperity of our race, but what have you brought us except weakness and decay? You promised you would free us from the need to sacrifice! Free us from extinction!",
    "This empire - your legacy - was built by us. YOU ARE NOTHING WITHOUT THE MAHJARRAT!",
    "Argh!",
    "My head... Please, stop!",
    "As Zaros spoke I became aware of the power of the Staff coursing through me. From my previous use I knew it was able to facilitate the transfer of energy from one thing to another. What I did not know, is that it could also reveal connections. I began to see the metaphysical links to the vast web he had created...",
    "I could see Nex, who was far from Senntisten...",
    "I saw Char, who lay poisoned in a cave to the west...",
    "And I could even see Mah, slumbering on an entirely different planet. I realised that the Staff gave me a connection back to the real world. That I held the power to transcend this prison of the mind. Suddenly I was filled with belief. Zaros could not see what I could see...and he could hold me there no longer.",
    "You think you have fooled me, Zaros, but you have only fooled yourself!",
    "Your arrogance will be your end!",
    "Now you have all seen the truth. It is up to you to decide with whom you place your trust.",
    "Continue to fight for my cause, Player, and you will rank yourself among my most revered followers.",
    "I hope you will not be so naive this time, Player. Reconsider your loyalty whilst there is still time.",
    "Perhaps you will give me your support this time, Player, and rank yourself among my most revered followers.",
    "ZAROS!",
    "You have manipulated the desperate long enough, Empty Lord. Deceiver. I will not let history repeat itself!",
    "Do not underestimate me. I defeated you once, I will defeat you again.",
    "But my power has increased exponentially. What I have lost in naivety I have gained in wisdom.",
    "You know nothing of what I have been through.",
    "You will not manipulate me, Zaros. I am immune to your controlling aura.",
    "Ha! Curse... It is how you have accomplished everything. I figured it out thousands of years ago.",
    "Anyone in close proximity to him will gradually be compelled to follow him. It is false devotion. Clearly it affects some more than others; I believe the effect is stronger the weaker the individual is. Am I not correct, Zaros?",
    "Enough chatter, I know what you are doing. Pulling the strings with your words and promises.",
    "Me? You think I need your help?",
    "Wait, you are being drained of your power as well?",
    "Then your plan is even more transparent than before. It is exactly as I predicted!",
    "You have lured them all here to drain them of their power. Are you truly so desperate to save yourself that you would sacrifice them all?",
    "STOP! MY SON!",
    "I will end your tyranny once and for all!",
    "Arghhhh!",
    "I never asked for this burden.",
    "Everything I did, I did for the mahjarrat.",
    "If I am to die, the power YOU gave me will become theirs!",
    "I am sorry, Khazard. I have failed you.",
    "Then what will you do?",
    "I will not be your instrument, Zaros.",
    "Hmm, I am familiar with the demons' pacts and what they entail. You have truly lost your mind if you think I will allow my fate to be entwined with yours.",
    "Argh, spit it out then. What terms would you have bind us?",
    "Bah! You have gone mad, Zaros. Millennia in the abyss has warped your mind.",
    "I cannot give him what he wants, Enakhra. There is no telling what he would do with the Stone!",
    "Hazeel...",
    "... You know what happens if you break this vow, Zaros. Viniculum Juris is not forgiving.",
    "Then it is no longer a matter of trust. Keep your word, or cease to exist.",
    "With one last ritual you will end the need for any more, prevent any further energy drain and in turn empower us all. If you deliver on this promise, I must perform one action for you in Sliske's game.",
    "You will address me as your Legatus Maximus.",
    "Then hold up your end of the bargain, Zaros. Now.",
    "He is bound to his word by Viniculum Juris, Khazard. Either he keeps his promise or he will be destroyed, both outcomes are victories.",
    "Wait, you have been here this whole time. I sensed you. Your aura, that...pull. I thought it was Mah I felt but it was you. Seren, goddess of the elves.",
    "I know we have, somehow. I remembered your essence from a memory lost in time, but I recognised you as Mah. That must mean... It was you! You came to us posing as Mah all those years ago. You taught the rituals to us. You made us believe they were the will of an Elder God!",
    "Mahjarrat, this is Seren, your false Mah. She alone bears the responsibility of what our race has become.",
    "Millennia of anguish and suffering for our race is on her hands!",
    "You do not get to be sorry. You are the cause of so much loss, so much misery...even the death of your own mother!",
    "Pah! 'These creations'. We were born the same way as you were, Zaros. Our lives did not matter less. Seren came to us, posing as Mah. She created the original ritual marker and taught us to sacrifice the lives of our kin to pay tribute to her.",
    "Do not argue for her, Zaros. You have made an enemy of her now.",
    "Do not taunt me, Empty Lord. I owe you no fealty.",
    "Today, the victory is ours. Mahjarrat, we spoke to Seren as a downtrodden race, sulking and sorry for ourselves. We may have been pushed to the brink of extinction, we may be few, but today is the dawning of a new era. Look around you. This day you have all grown in power. Adversity has pushed every one of you to become greater than you could ever have imagined. And I have achieved godhood. The genes of our species hold such incredible potential, it is within all of you. We are too few to continue these petty feuds. It is time we put aside our differences. It is time we unite!",
    "I do not ask that you all become comrades, but settle your differences. Stop fighting against each other and instead fight for the prosperity of the mahjarrat.",
    "Such things can be discussed in the future. Time is on your side, there is no ritual looming ahead. No pressure to avoid sacrifice. You are free now, all of you. So claim your immortality. Claim your honour. CLAIM GREATNESS FOR THE MAHJARRAT!",
    "Then it would seem we have both garnered respect this day, but you should also remember, I owe you a single action. Choose it wisely.",
    "It is a glorious day for the mahjarrat, Player, but I would be alone now. My form and my pride have both been torn, and I have entered into a pact that may have dire consequences."
  ],
  "Lowerniel Drakan": [
    "Get out of my way, there is blood to be spilt...and devoured."
  ],
  "Thammaron": [
    "Puny whelp. Pledge your allegiance to the Legatus Maximus or I will crush you with my own hands."
  ],
  "Viggora": [
    "This is no time for conversation, Kharshai. Either you stand with us, or you stand against us."
  ],
  "Seren": [
    "Not yet, Player. You have so much left to give... I have got you. Rest now.",
    "Guthix may have had good intentions when he stopped godly magic affecting you, world guardian, but he made it highly difficult to save you too.",
    "Manners cost nothing, Player.",
    "You are most welcome, and far too important to risk being submerged in lava.",
    "I am not sure Guthix's protection extends to being submerged in lava, but I suppose you cannot all be as gracious as the elves.",
    "Well, I suppose you cannot all be as gracious as the elves.",
    "I must confess, I did not come here simply to watch over you. There are fateful events in motion.",
    "I do...and so does Zaros.",
    "Mah. Trying to reclaim the energy she has lost, which she now needs so badly. She has managed to drag herself to the old Ritual of Enervation site and dream her own monstrous ritual stone into existence. You may have noticed it climbing from the skyline to pierce the clouds.",
    "It is, and the clouds are not the only thing it pierces. Mah has used it to literally puncture the abyss, allowing it to act as a conduit through which she can reclaim her energy. That is how she has managed to siphon it back across worlds. It is amazing what she is able to accomplish, even in her current state.",
    "The mahjarrat were not Mah's only creation, Player.",
    "From Zaros. From me. From Zamorak... It is no coincidence we have all taken such a vested interest.",
    "We will. I fear Zaros's plan to stop her is vastly different from my own, though.",
    "I believe he is planning a ritual of his own using the marker Mah has created. Normally the markers act as connections to Mah, drawing upon her energy. On Gielinor the marker was not able to connect to her, which is why the rituals needed the power of a sacrifice. If Zaros can reverse the effects of Mah's immense marker and siphon enough energy from her it will leave her weakened enough to...",
    "Yes, I think so. Our own mother... That is why he needs all the mahjarrat here. The more of them performing the ritual, the more energy they can siphon. Zaros has never had much love for our mother, but she gave him life. Is he so consumed by his hunger to become an Elder God that he would betray his creator? I truly hope that I am wrong, world guardian.",
    "I am not quite sure. Perhaps he believes he can siphon enough of her power for him to ascend. Or perhaps there is something else he can gain from her that I am not aware of. Either way, I will stand beside my mother. Even if it means standing against Zaros.",
    "The gift of world guardian makes you resistant to many of the forces in play here. You may be able to help at the most critical moment. That is why I saved you. I hope I will not regret it. You should continue your journey to the Ritual of Enervation site, Player. The mahjarrat are already gathered.",
    "Player, thank goodness you have arrived. The ritual has completely destabilised Mah, I am not sure how much longer I can soothe her for.",
    "If I try to stop the ritual she may descend into terrors. There is no telling the destruction she could cause.",
    "As her energy is drained Mah's nightmares are intensifying. We need to calm her or else risk the complete annihilation of Freneskae!",
    "No, no, that will only make things worse. We must defeat her nightmares before they manifest. I believe you are familiar with Zaros's ability to enter an individual's mind and create shared spaces of consciousness?",
    "I possess similar abilities. If you accept, I will be able to send you into Mah's nightmare. There is no telling what you will find, but I trust you will find a way to calm her.",
    "With Guthix's blessing upon you I can only open the door, you must step through it. Time is of the essence, Player. Are you ready to enter Mah's nightmare?",
    "Time is of the essence, Player. Are you ready to enter Mah's nightmare?",
    "Time is of the essence, Player. Are you ready to enter Mah's nightmare?",
    "Mah's nightmare defeated you, pushing you out of her mind. Are you ready to try again?",
    "Mah's nightmare defeated you, pushing you out of her mind. Are you ready to try again?",
    "This must be Mah's core. The centre of her mind and the source of all her power.",
    "You are in Mah's nightmare. These must be her fears. The muspah represent everything Mah has lost. As the anima of this planet has drained, so has her energy. Once she created gods, now these grotesque imitations are all that is left of her power. It would appear that in the depths of her mind some part of her still knows this. I will provide you with my light to drive back the dark of these nightmares. Are you ready to release their grip over her?",
    "In defeating the nightmare Muspah's[sic] you have begun to calm Mah's terrors. However, there are greater fears to face - we must go deeper yet.",
    "There were times when Mah would occasionally become lucid. However, she was unable to separate dreams from reality. Her screams would echo across the mountains, causing earthquakes as she hurt herself. It appears I must be to blame for this part of her nightmare. I encouraged the mahjarrat to perform a Ritual of Enervation, which would drain Mah of some power, settling her fury and allowing the Mahjarrat to breed. Mah became more aware of this over time and came to fear these rituals. Her terrors were increasingly violent with each and every one. From what you have found in her nightmares it would seem she was aware enough to know it was the mahjarrat draining her power. Let us banish this fear.",
    "Mah's fears of the mahjarrat have subsided, but there are worse nightmares still. You are close now, keep going!",
    "No... This is the deepest part of her nightmare. Did she truly fear us? Zaros and myself are Mah's greatest creations. She loved us completely, as I have seen countless parents love their children since leaving this place. Alas, her love was overwhelming. Zaros felt smothered by Mah and left Freneskae, leaving me alone to care for her. Those were dark days, her moods travelling between deep depression and intense fury. I alone had to handle her. But nothing lasts forever, even for an Elder God. I was powerless; nothing I did or could do would ever be enough. So eventually I too left, hoping that there would be something out there that could help. Mah, I am so sorry that I am a part of your pain. I never wanted to abandon you. Player, please, drive back these fears.",
    "Mah, I see it now; that icy corruption torn into your core. You are like this because someone close to you willed it... There is only one way I can help you, I am just so sorry it has taken me this long to realise.",
    "You have plunged into the depths of an Elder God's nightmares and lived to tell the tale. Guthix was right about you, Player.",
    "Indeed, you prevented Mah's terrors and saved us all from certain destruction. Alas, the ritual is over. I could not stop it.",
    "Her body, yes, but her mind... Mah's energy has been so irreversibly depleted that she will never wake again. I cannot bear it, Player. I feel her pain in my very essence, as though a piece of myself is dying with her.",
    "Nothing I have ever tried has worked. She has lived such an agonising existence.",
    "Then the sickness that plagued her must have wound its way right through her deepest essence, or...originated there. Player, what did this corruption look like?",
    "Just like the eggs in the Elder Halls. Surely it could not be...",
    "I cannot think about this, Player, not now. Perhaps there are others that can help you understand.",
    "I realise now that there is only one thing that can be done. I am so sorry, mother. I think I always knew in my heart that it would come to this. If I had only known sooner I could have saved you so much pain. You deserved better. You gave us all your love, in your own way. So great and complex, forever doomed to be misunderstood. Forgive me. My creator, my inspiration...",
    "My mother. Zaros. How could you? Come, Player. I will not let him get away with this.",
    "ZAROS! Your actions resulted in the death of our own mother. How could you?",
    "Her existence was beautiful. She had the power to create life and she dared to do so, something you will never achieve!",
    "I thought death would have taught you humility, but you are just as arrogant as before.",
    "Yes, Zamorak. We have met before, but-",
    "No- I... I was trying to help. I could not foresee what would become of your race. How could I?",
    "Please! I never meant to-",
    "Do not defend me, Zaros. You will never stand beside me again.",
    "It was not for nothing! If you had not performed the rituals to give energy back to Mah she would have torn this planet apart. Your whole race would have been annihilated!",
    "I was naive, yes. I have made many mistakes. I bear the guilt of my actions every waking moment.",
    "Please, I am sorry...so sorry.",
    "AAAAAAHHHHHHHHHH!",
    "AAAAAAAHHHHHHHHHHH!",
    "I cannot stay here any longer. It is not over between us, Zaros. Not this easily. You will pay for what you have done here. Mah's death is on your hands, and while I still draw breath, I will stand against you.",
    "Greetings, World Guardian.",
    "Everything I have, everything I am, was given to me by Mah; my life is Mah's, my being is Mah's, my strength is Mah's. She was more than a mother to us, yet Zaros saw her as a distant relative. He waited for her to pass, hoping for an inheritance. I would be angry with him, if I wasn't already busy with my own grief and guilt. They're not fun to be around, I can promise you. I am planning to visit Mah again – soon, if the events of this world will allow it. My elves observe a particular funeral rite, and I would like to bring my lords and ladies to Freneskae to perform it. A crystal seed will be placed in her mouth. This seed will represent the death of her voice, but the continuation of her song. For as long as possible, we will visit her, and continue her memory by singing. The seed will grow, and will fill her body with crystal flowers. I have always loved the sentiment: that a person's memory can grow, rather than shrink away. I would like that to be true of me, when I pass. I will make sure my lords and ladies know that this is my desire.",
    "We have rarely been close, Zaros and I. As a brother of sorts, he kept me at arm's length. As a god, even more so. That has never been a problem. My interests have been far from his, and he has – largely – kept his armies to himself. But he knew, and knew very well, that the one common ground we had was Mah. And while he was indifferent to her, he knew that I loved her. He knew that by hurting Mah, he was hurting me. It's undoubted: Zaros's favourite hobby is to calculate how the world will change to his every whim and action. The magnitude of his indifference makes me sick. I could almost feel the boot in my face as he stepped to victory.",
    "What is there to say about the Mahjarrat other than 'I am sorry' and 'I would not do the same again? I worry that I will forever be known as the God of Regret. It's like I was last in line for godhood: Zamorak has taken Chaos, and now I must be the God of Remorse and Wistful Thoughts. Regardless, I feel intensely that I did wrong. I have not figured out how I can right that wrong, but I will. I may start by talking to Kharshai. He was always the most-level headed of the Mahjarrat, and I feel that has not changed. Reparations must be paid, and I am not one to renege on a debt."
  ],
  "[Zamorak and Zaros]": [
    "Animus contrahendi. Viniculum Juris!"
  ],
  "Current health": [
    "[#]/6000"
  ],
  "I've been meaning to ask": [
    "why the horns?",
    "why the horns?"
  ],
  "Congratulations! You have completed": [
    "'Children of Mah' - Complete this quest."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Children_of_Mah?oldid=36233871’"
  ]
}