{
  "Player": [
    "Hi there.",
    "What?",
    "Erm, no, not really. What d-",
    "Certainly, but why's that important?",
    "Betsy?",
    "She's, erm...not bad.",
    ": The what-now?",
    "And I look like the kind of person willing to risk my life to help you?",
    "You need an extra rower?",
    "So someone strong who enjoys repetitive tasks and is willing to risk their life in hunting a horrible sea creature. I'm not sure many people fit those criteria.",
    "What's his name?",
    "I know him! He's one of those builders down at the Tower of Life. I'll go talk to him.",
    "You need a giant harpoon?",
    "You need a particular sea chart?",
    "I suppose it is for the good of all fishermen.",
    "Can you tell me more about the Thalassus?",
    "Awesome!",
    "That's horrible!",
    "Where does it live?",
    "Actually, I'll be right back.",
    "Hello again.",
    "Not bad. I need your help though. I've been talking to your cousin, Jones.",
    "Well, I'm headed out to sea with him to catch a sea creature. He said you were looking for work and that perhaps you'd be interested in helping. It'll mean plenty of rowing, but hopefully plenty of fortune in return.",
    "To stop you from getting seasick? Right. Perhaps I can make it for you. What are the ingredients?",
    "Some lowland heather and builder's tea – check.",
    "Hi, Bonafido!",
    "Not bad. I'm hoping you can help me. 'The Guns' said you might be able to help me out with some builder's tea?",
    "Excellent, thanks!",
    "I've made the potion!",
    "Wait, before you go, I've been meaning to ask... What's your real name?",
    "Hi there. Not lifting that log anymore?",
    "Sounds wise.",
    "Hi, I was hoping you could help me.",
    "Do you know Jones?",
    "I'll bet. Well, we're looking for a master smith, and since you're master fisher, Jones thought you might have someone in mind who could help.",
    "Thank you!",
    "Excuse me.",
    "I was wondering if you could help me. I'm looking for someone to help me make an item.",
    "Excuse me, are you listening to me?",
    "Not really. You see, I need a harpoon to catch a sea creature. ... I'm still not sure you're listening. It's to catch a creature called the Thalassus.",
    "So you've heard of the beast?",
    "Wait, what are you talking about?",
    "I see. Perhaps we can strike a deal. If you make a harpoon fit for killing the Thalassus, I'll return you one of its teeth should we catch it? I've some plans on what it should be like.",
    "Well, not me. My esteemed fisherman colleague, Jones, has. Here.",
    "Erm, if you say so.",
    "That was amazing, thank you!",
    "So, what exactly will you do with the tooth?",
    "Have you ever tested special materials from creatures before?",
    "Sounds like a weird beast. What happened?",
    "Not to believe in fantastical creatures?",
    "What's that sword for?",
    "What will he use it for?",
    "Which is?",
    "Not yet.",
    "What of other smiths, I'm pretty good!",
    "Sir Vyvin could have gone to the dwarves, no?",
    "Best I get on and hunt the Thalassus.",
    "Hi Jones.",
    "Here's the sea chart!",
    "I've got the harpoon! I had to go see a lady called Linza. She let us have it in exchange for us giving her a tooth from the deadly sea creature. Hope that's okay.",
    "That's it! 'The Guns' is ready, and we have the harpoon and the chart.",
    "Lead the way!",
    "It's a bit cramped, but I appreciate there isn't space for all of us out on deck.",
    "Examine the wrecks – check.",
    "Got it. Guns, you ready to row on my instruction?",
    "I don't see it, maybe it went elsewhere.",
    "Calm down, maybe it hasn't seen us.",
    "Urgh... Where am I?",
    "Um, I was just hunting a sea creature called the Thalassus.",
    "Oh no, poor Jones.",
    "Jones. He was eaten by the creature.",
    "Hmmm, I'm going to have to talk my way out of this.",
    "He's famous among humans. He's caught pretty much everything in the sea that moves.",
    "I've travelled all over the world, talked to many people, survived attacks from many dangerous monsters. I also sailed against your precious Thalassus and yet here I am, alive.",
    "He, you know, stinks and tastes bad. Bad for the Thalassus's diet?",
    "No, telescopic - a harpoon that spans many metres!",
    "It was crafted by one of the world's greatest smiths. It's made specifically for hunting the Thalassus, and Jones has it with him ready to use, and he's in the creature's stomach.",
    "Phew!",
    "But I've no idea where my boat is.",
    "Yes, and just about in one piece. Listen, we have to find the sea creature again. Jones could still be alive.",
    "Where are you?",
    "And hopefully Jones is still alive.",
    "So mean!",
    "Look! There it is!",
    "And a tooth! Quick, Guns: row like you've never rowed before!",
    "Don't look back!",
    "I don't think I've ever seen someone row that fast.",
    "Sounds like a plan, I'll be right back.",
    "Have you recovered now?",
    "I'm sure both hair loss and deadly sea creatures are pretty terrifying.",
    "Yes, that's right.",
    "Hi, Jones.",
    "Certainly.",
    "Hi, Jones.",
    "The tooth! Phew, I thought I'd lost it.",
    "Hi, Linza. I managed to get one of the Thalassus's teeth!",
    "It was quite dangerous getting it; I hope it's useful?",
    "I've given the tooth to Linza!",
    "So, what are you going to do now?",
    "That's great. I'm guessing it has a particular ingredient?",
    "I won't. Promise.",
    "That's great news; probably better to let the Thalassus live."
  ],
  "Jones": [
    "Ah, perfect!",
    "You look pretty bright. Get seasick at all, lass?",
    "Excellent! Done much fishing?",
    "Well, Betsy and I are looking for a hardy fisherman to help us out.",
    "She's my trusty fishing rod. Ain't she a beauty?",
    "Not bad? Pah! She's one of the best rods ever made! Now, back to the job at hand. I'm sick of hard graft for little reward and the sea is an inhospitable workplace. So I'm off to hunt... ..the Thalassus!",
    "Well, I'll be.. the lass ain't heard of it! It's a horrific beast, surviving in the deep seas for hundreds of generations. More naïve fishermen will tell you it's a myth, but I'm convinced it exists. It's got to be the cause of a recent spree of destroyed ships all over the ocean to the north of here. That's where you come in – I've a little boat moored to the north, but I need someone to help me. I can't do this by myself.",
    "Bingo, lass! So, what do you say to helping me catch the deadliest creature ever to swim the seas of Gielinor?",
    "Fantastic! Let's get started. I need help with three things: an extra rower, a giant harpoon and a particular sea chart.",
    "Certainly, rowing across the high seas is a long, gritty and terrible job. Not only do I doubt you fancy rowing for hours, but I need your mind on the hunting with me.",
    "Actually, lass, I have just the man in mind. My cousin has been looking for a job for so long he's probably pretty desperate and wouldn't take much to convince.",
    "It embarrasses me to say, but he insists on being called 'The Guns'.",
    "This isn't a sardine we're catching, lass! The weapon that'll defeat the Thalassus will need to be an incredible feat of smithing, yet none of the smiths I've ever met would be able to make such a thing. I know the fishing master here at the guild has many expert friends, perhaps he would know someone that can help. Here's some plans for what I need the harpoon to be like.",
    "Yes, the fishing master here at the guild has been keeping track of all the ships wrecked at sea. That should help us figure out where to find the sea creature. But the pompous guy won't give it up freely; he likes to hoard information for power. Go pickpocket it from him.",
    "Researching your catch? I like it! It's existed for many generations, so it's bound to be a really tough monster. There are many accounts of what it looks like, so no one's really sure what form it takes. One thing all the stories tell is that it swallows its victims and then slowly digests them over several weeks; melting away skin, flesh and finally bone.",
    "Easy, lad/lass. Many a foolish fisherman has taken the beast lightly and suffered the consequences. It's better you show some respect or you might suffer the same!",
    "Of course, lad/lass. Imagine being eaten alive, swimming in a pool of acid as you slowly die.",
    "Out in the depths of the ocean; it seems to like the cooler water to the north. I've been fishing for practically my entire life and I know those seas better than anyone. We'll find it.",
    "How can I help?",
    "Fantastic work.",
    "No problem! We'll have plenty of teeth by the time we're done.",
    "You're a star, lass. Well, if you're ready, shall we head out to sea?",
    "Oi, Guns, we're off!",
    "Hold on, you can't take your follower with you.",
    "Good job! Are you okay in there, Player?",
    "Let's get to hunting that sea creature. Investigate the shipwrecks to try to reveal the creature's trail. If you keep guessing wrong, you'll have to start from the beginning, so keep an eye on which wrecks you're examining.",
    "If you loot the shipwrecks, you'll probably find some treasure. This is only a small boat, so we only carry so much – choose wisely.",
    "The tracks end here – must be nearby.",
    "Somehow I doubt it. It's about to charge, we need to issue the harpoon. Hold on, you two.",
    "Wow, that was close. Urgh, it was horrible. I thought I was gonna die. Thank you both.",
    "Me neither, Good job, cousin. It was good luck me dislodging one of its teeth as I flew out. While we're having a breather, why don't you go take the tooth to Linza.",
    "Hi. We're still resting up. Why don't you go take that tooth to Linza.",
    "I guess you're looking for this?",
    "You had. Good job I was paying attention.",
    "Superb.",
    "I hit upon a great idea. Since it seems we ended up being caught, and not the Thalassus, I figured we're better off simply trying to scare it away. I'm now selling my very own 'Miracle Thalassus Protection Cream' to other fishermen by the bucket load! They're spreading it all over themselves, their fishing equipment and even their boats!",
    "Yeah, karambwan...but don't you dare tell anyone!",
    "Turns out 'The Guns' is also quite the salesman, so he's helping me sell it. It looks like we'll be able to make our fortune another way.",
    "Indeed, and thanks for all your help. If you're interested, I've been setting up some deposit boxes around the world and you're welcome to use them. If you want, you can continue hunting the Thalassus for some hunting experience. Also, I've fashioned some cast nests, which can be equipped, making them easier to fish with than normal fishing nets. Just talk to me if you want to find out more."
  ],
  "'The Guns'": [
    "Ah! Hi, mate. How... is it... *umpf* ...going?",
    "Yeah? I've not...spoken to...him for...ever.",
    "Sounds good... *umpf* Count me in. But there's...one problem. I get...*umpf* ...very seasick. Jones...has made...a potion for me...in the past.",
    "Simply mix...lowland heather...from around here...and builder's tea...chat to Bonafido.",
    "Superb, mate. I'll take that...and...I'll see you...where Jones is.",
    "Ha, you'll be...lucky. That secret dies...*umpf*...with me. So, you want to...travel back to the Fishing Guild...with me?",
    "No, mate. I'm saving my strength for some hardcore rowing.",
    "Yeah? Right-o!",
    "Here we are!",
    "Ready!",
    "Arrghh! Over there! We're all gonna die!",
    "Holding on!",
    "Oh, no! Now they're both overboard! Help!",
    "You're back!",
    "Gotta be around here somewhere.",
    "Here goes. This'll be a good test of my throwing arm.",
    "He's mighty hungry! Look at him eating it!",
    "Where'd it go?",
    "Jones!",
    "No...problem... Must...breathe...",
    "Just about, thanks, mate. I don't mind admitting that's probably the most frightened I've ever been in my life. That and when I thought I was losing my hair.",
    "Defo. Didn't I hear Jones say you should be headed to see this Linza chick?"
  ],
  "Bonafido": [
    "Ay up, lass, long time no see. How's it goin?",
    "Now that's summat I can help thee with! Here, I've some of me own special brew!"
  ],
  "Master Fisher": [
    "Yes?",
    "Ha! Everyone knows Jones. He's been fishing since before I was born. Not that you could tell from his successes.",
    "Funny you should ask – a friend of mine, Linza, has been helping make some unique fishing tools. If you head up to Hemenster, you might catch Linza smithing away at the anvil there. If she can't help you, I doubt anyone can."
  ],
  "Linza": [
    "This is shaping up nicely.",
    "Hmm, it's almost complete.",
    "What? You want an item? Can't you make it yourself?",
    "The Thalassus, you say!",
    "Hmm. The Thalassus: a creature of the inhospitable sea, incredibly long-lived, durable...in particular the teeth, resistance to sea erosion. Sea pressures resulting in high density? Worth the research, I guess. Tough, natural substances. There might b-",
    "Oh, sorry. This Thalassus has survived the ocean for many generations, and myth tells of its huge, sharp, durable teeth. I'm guessing they're made of an incredibly strong natural material, which might be a great component for weapons or armour. It'd be great for furthering my research.",
    "You've made some plans?",
    "Multiple chains? Blades? Oh, no, this won't do at all. That's of no use to anyone. Don't worry, I'll make you a harpoon that'll do the job. I've some metal I engineered myself by splicing together the properties of several metals – perfect for the job.",
    "Now, let me see... This should be an easy one.",
    "Done! Here you go.",
    "It sounds like it has a great many valuable properties. I'd be taking it back to my workshop to put through various tests.[sic] – see how well it fares in different chemicals, stress tests, try to determine what makes up its structure.",
    "Various things.",
    "Almost...",
    "On one occasion similar to this, I was looking for the fabled Crackjaw. I headed off into the middle of the Wilderness with some of my more...combative friends to track down the beast. It was quite exciting to see how the",
    "weapons and armour I'd made them fared! The creature was said to rebound any weapon and change shape dramatically.",
    "I guessed it'd have skin that could easily stretch to double its original size, yet remain incredibly tough.",
    "We never found it. I can only suppose it was a lie. Instead, we were ambushed by some lowlifes – it was quite the onslaught! I learned a valuable lesson that day.",
    "No. Let others do the fighting. I'll stick to what I'm interested in.",
    "The one I'm making? It's for Sir Vyvin of the White Kinghts of Falador. He knows the odd thing or two about armour and smithing, wanted to make use of my expertise.",
    "Hopefully, something useful.",
    "You sure have a lot of questions. Have you caught that sea creature yet?",
    "Then please hold up your end of the bargain.",
    "You think? This isn't just some generic sword. It has precise properties, all balanced with the wielder's physique, technique and chosen application. I have to consider the weighting in ratio to the strength; how much pressure the wielder applies with a hit; the strength of their grip; their aggression levels... The list goes on.",
    "True, they have discovered some astounding things when it comes to their craft, but so have the many other races. When I visit or look up on a race's methods, I take a bit of all the lessons I learn, then I pick and choose the techniques to best suit the piece of work I'm busy with. I guess Sir Vyvin recognizes that.",
    "Certainly.",
    "You did? Let me see!",
    "Wow...yes, this is a very strong material, surprisingly light. Amazing, I need to do some further research on this. Thank you for getting this."
  ],
  "Player'": [
    "That is quite a high level of attention to detail."
  ],
  "Jones [overhead]": [
    "Take this!"
  ],
  "'The Guns' [overhead]": [
    "I think you angered it!",
    "Jones, Player – look out!",
    "Arghhh!"
  ],
  "Tentacle": [
    "What a wholesome catch, Good work, ladies.",
    "First things first, Anemone. Let's see what it has to say. Human, what are you doing so deep out at sea?",
    "Listen here, human. The Thalassus has protected us for many generations from other sea denizens, and no silly human has ever come close to capturing it.",
    "We love fulfilling the Thalassus's appetite for humans, especially foolish fishermen.",
    "Who?",
    "Ahhh, did the ickie-wickie human lose a friendy-wendy? Don't worry, he won't be dead yet. The Thalassus likes to digest his food slowly and painfully over many agonizing days.",
    "What?",
    "We're compulsive liars. You're going to have to do better than that to fool us.",
    "Jones? Never heard of him. A nobody.",
    "That doesn't impress me.",
    "Your lack of integrity is commendable.",
    "Oh, how stupid you must think we are.",
    "Yeah? In what way?",
    "I'll give you that, human, you seem to be well travelled.",
    "So what? I've seen the sea creature survive many harpoons with my own eyes.",
    "No, I'm not convinced, she's Thalassus-bait.",
    "Impossible.",
    "What do you mean?",
    "Okay, I've heard enough. Let's get this Jones human out of the Thalassus. We don't want to take the risk.",
    "Don't think you're free human. You'd still prove a tasty meal for the Thalassus. We'll give you some karambwan; you hunt down the sea creature and feed it to it.",
    "Exactly, Urchin. We feed the Thalassus karambwan when it's eaten something it shouldn't have. But we will follow you, human. Any wrong move and we tip your boat over. Don't think you've escaped.",
    "We're keeping an eye on you!",
    "Any smart moves and you're Thalassus bait!",
    "What are you waiting for? Feed it the karambwan – quickly!"
  ],
  "Urchin": [
    "Wholesome catch! Wholesome catch!",
    "Stupid human! Stupid human!",
    "Trophies, schmophies.",
    "A horrid hunter! We're gonna die!",
    "Ahhh, best friends forever. Stupid human.",
    "Deadly cannon! Boom!",
    "Big, bad harpoon!",
    "Let him go, let her go.",
    "Teddy scorpic?",
    "Make creature sicky-sick!"
  ],
  "Anemone": [
    "I say we grind it to a pulp first. All the better for the Thalassus's digestion.",
    "Stupid human! How dare he/she attack the Thalassus?",
    "And now we've caught you, you'll be a good meal for the beast.",
    "You're crazy, you wouldn't stand a chance. I'll crush your bones.",
    "You got that right, pathetic human scum.",
    "I don't think I like the sound of this Jones human.",
    "Oh, how very funny. You should be a stand-up comedian...not!",
    "That wouldn't even scratch the mighty sea creature.",
    "What's that got to do with anything?",
    "Rubbish. It's eaten far worse.",
    "Must say I'm pretty convinced. Let's let her go.",
    "It's not far. Stupid man keeps rowing it around in circles.",
    "Down here, idiot, in the water.",
    "Poor Jonesy, who cares about him?",
    "Oi!"
  ],
  "Player Option 1": [
    "I'm going to have to talk my way out of this.",
    "It should, he's been hunting for decades.",
    "He's so horrid, even I don't like him.",
    "He speaks highly of you.",
    "You know Jones also has a cannon with him?",
    "It's no ordinary harpoon."
  ],
  "Player Option 3": [
    "I think the Thalassus is sick.",
    "He's won millions of trophies.",
    "Very horrid! After he's killed the Thalassus, he'll probably come after you.",
    "Come on, just let me go.",
    "Did I mention Jones has a harpoon with him?",
    "Not a telescopic harpoon."
  ],
  "Player Option 2": [
    "The Thalassus has eaten Jones the mighty fisherman.",
    "Doesn't look like anything does.",
    "He's not that bad. Quite friendly, actually.",
    "Trust me, I'm a great adventurer. I should know.",
    "Did I mention Jones never takes a bath?",
    "Please, you must be convinced by now?"
  ],
  "'The Guns [overhead]'": [
    "Humpf!",
    "Look out!"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Deadliest_Catch?oldid=35516474’"
  ]
}