{
  "Kharen": [
    "And just where do you think you're going, hmm?",
    "Perhaps not quite as ready as you thought, hmm?",
    "Return to me once you are, and we shall continue this journey.",
    "The cost for me to ferry you to Rasial's citadel is four obols.",
    "Obols are the name for things placed on the eyes of the deceased to aid in their passing.",
    "I don't really need them. I just like having something to collect, you know?",
    "Sometimes souls get a bit lost on their way down here, or fall overboard into the lake.",
    "It's been happening a lot more since Angurvadal started harassing everyone in Um, purposefully pushing souls into the water.",
    "You can take a little rowboat out on Lake Mnemosyne, hunt for some of these lost souls.",
    "I'm certain they'd happily pay you an obol for guiding them back to the city.",
    "I swear, else my name's not Charon.",
    "Head to Ed in the boat tours shed north-east of here, and take a boat out on the lake.",
    "Boat tours! Lost souls! Four obols!",
    "The cost for me to ferry you to Rasial's citadel is four obols.",
    "Sometimes souls get a bit lost on their way down here, or fall overboard into the lake.",
    "You can take a little rowboat out on Lake Mnemosyne, hunt for some of these lost souls.",
    "I'm certain they'd happily pay you for guiding them to the city.",
    "Head to the boat tours shed just north-east of here to take a boat out on the lake. Ed will sort you out.",
    "Thank you. I shall now begrudgingly ferry you to Rasial's citadel whenever you wish.",
    "You had best prepare for a fight. Rasial and his army awaits you, at journey's end.",
    "Shall we depart?",
    "You're on your own from here. I'll be waiting should you need to return to the City of Um.",
    "Would you like to return to the City of Um?",
    "Come back when you have some space in your backpack.",
    "You managed to beat Hermod.",
    "Do not be disheartened. Now you know what you are up against, and what you must do: get stronger, find more allies, and keep trying.",
    "If you wish to train more against Hermod, or whenever you're ready to face Rasial, I'll be happy to ferry you back up to the citadel.",
    "Well, no, not happy, but willing."
  ],
  "Player": [
    "I'm ready to face Rasial at his citadel. Will you take me?",
    "What payment do you require?",
    "Okay, where can I obtain some, then, since I'm not dead?",
    "You sure this isn't just you delegating work to me you don't enjoy doing?",
    "Shed, Ed, head, gotcha... Wait, your name ISN'T Charon!",
    "What am I doing again?",
    "That's four! I should head back to Kharen.",
    "I have your obols!",
    "But I don't want to give them to you for some reason...",
    "I'm just in time to wipe that smug, rictus grin off your face!",
    "Stop ignoring me! You're so condescending.",
    "I know enough. I've seen the city, what you did to it. Port Phasmatys too! You stole those peoples' choice away!",
    "That's all I need to know you are the villain of this piece.",
    "I'll doom you next!",
    "Unlike you, I value the lives of others! I'm their hero, their champion!",
    "Wha-?",
    "I...",
    "Not really, it just regenerated. Besides, that wouldn't be enough until I can take out Rasial too, though.",
    "I think I need to have a bit of a word with Death too...",
    "Happy to?"
  ],
  "You do not meet the requirements to start": [
    "'The Spirit of War'.",
    "'The Spirit of War'."
  ],
  "Rasial, the First Necromancer": [
    "First you were too late to stop me raising my army; now you are too early to defeat me. Your sense of timing needs improvement. We'll have to work on that...",
    "Perhaps if we showed you your hourglass, you'd see how little time you have left. Hmm...",
    "Oh, you're still here? Fine, I'll engage.",
    "I bet Harold didn't even tell you what's going on, did he? Just his style.",
    "That is a matter of perspective. One person's villain is another's hero.",
    "How many have you doomed, I wonder. All because you think you were chosen, that you're special.",
    "And so self-righteous too. The shadows may be approaching, but you've been living in the dark your whole life.",
    "Ready to throw it away at a moment's notice with minimal provocation.",
    "I suppose when one has such abundance of life - thanks to Harold's meddling - it somewhat loses its lustre.",
    "You are a useful idiot, nothing more. If you are so ready to dash yourself upon my will, have at it.",
    "But first, let's see if you are even ready to defeat my pet. Prove yourself worthy enough for ME to be the one to end your sorry existence.",
    "Very good. I may have underestimated you. Perhaps you are worth my lessons after all.",
    "Of course, one cannot defeat war simply with more violence.",
    "You wield necromancy as a cudgel, with no finesse. You have so much more to learn.",
    "Oh my, you've barely scratched the surface, and yet you come rushing to my citadel to confront me!",
    "Well, you certainly have courage, but courage alone will not suffice. You must BE better if you wish to DO better.",
    "Have you even bothered to study the works of Orcus, to learn the history of necromancy?",
    "Or approached the necrolords of Daemonheim, to learn more current techniques?",
    "Harold really has kept the blinkers on with you, hasn't he? You really should press him on this if you wish to survive my final test...",
    "For your small victory here today, I shall give Um a stay of execution. Angurvadal shall bother the city no more.",
    "Now go! Bother me no more until you are TRULY ready."
  ],
  "Rasial": [
    "Impressive."
  ],
  "Congratulations! You have completed": [
    "'The Spirit of War' - Complete this quest."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:The_Spirit_of_War?oldid=36235813’"
  ]
}