{
  "Dimintheis": [
    "Hello. My name is Dimintheis, of the noble family Fitzharmon.",
    "The King has taken my estate from me until such time as I can show my family crest to him.",
    "Gah! Lousy beggar! Your sort is what's ruining this great land! Why don't you just go and get a job if you need money so badly?",
    "An adventurer hmmm? How lucky. I may have an adventure for you. I desperately need my family crest returned to me. It is of utmost importance.",
    "Well, there is a long standing rule of chivalry amongst the Varrockian aristocracy, where each noble family is in possession of a unique crest, which signifies the honour and lineage of the family. More than this however, it also represents the lawful rights of each family to prove their ownership of their wealth and lands. If the family crest is lost, then the family's estate is handed over to the current monarch until the crest is restored. This dates back to the times when there was much in- fighting amongst the noble families and their clans, and was introduced as a way of reducing the bloodshed that was devastating the ranks of the ruling classes at that time. When you captured a rival family's clan, you also captured their lands and wealth.",
    "Well, my three sons took it with them many years ago when they rode out to fight in the war against the undead necromancer and his army in the battle to save Varrock. For many years I had assumed them all dead, as I had heard no word from them. Recently I heard that my son Caleb is alive and well, trying to earn his fortune as a great fish chef. I believe he is staying with a friend who lives just outside the west gates of Varrock.",
    "I thank you greatly adventurer! If you find Caleb, or my other sons... please... let them know their father still loves them...",
    "I realise it was a lot to ask of a stranger.",
    "The only thing I have heard of my son Caleb is that he is trying to earn his fortune as a great fish chef. I believe he is staying with a friend who lives just outside the west gates of Varrock",
    "Have you any news on my crest yet?",
    "Adventurer... I can only thank you for your kindness, although the words are insufficient to express the gratitude I feel! You are truly a hero in every sense, and perhaps your efforts can begin to patch the wounds that have torn this family apart... I know not how I can adequately reward you for your efforts... although I do have these mystical gauntlets, a family heirloom that through some power unknown to me, have always returned to the head of the family whenever lost, or if the owner has died. I will pledge these to you, and if you should lose them return to me, and they will be here. They can also be granted extra powers. Take them to one of my sons, they should be able to imbue them with a skill for you."
  ],
  "Player": [
    "Why would a nobleman live in a dump like this?",
    "Why would he do that?",
    "You're rich then? Can I have some money?",
    "Hi, I am a bold adventurer.",
    "Why are you so desperate for it?",
    "So where is this crest?",
    "Ok, I will help you.",
    "I'm not interested in that adventure right now.",
    "Where did you say I could find your son Caleb again?",
    "Are you Caleb Fitzharmon?",
    "I have been sent by your father. He wishes the Fitzharmon Crest to be restored.",
    "Uh... what happened to the rest of it?",
    "So can I have your bit?",
    "It's not really much use without the other fragments is it though?",
    "So what ingredients are you missing?",
    "Ok, I will get those.",
    "Why don't you just give me the crest?",
    "Nothing, I will be on my way.",
    "I see you are a chef... Could you cook me something?",
    "I didn't manage to get them all yet...",
    "Got them all with me.",
    "So do you know where I could find any of your brothers?",
    "Thank you very much.",
    "Good luck with that then.",
    "Where did you say I could find Avan again?",
    "I am still working on it.",
    "I have lost the fragment that you gave me...",
    "I'm still looking for it.",
    "I'm in search of a man named Avan Fitzharmon.",
    "Why are you lurking around a scorpion pit?",
    "I'm looking for a man... his name is Avan Fitzharmon.",
    "You have a part of your family crest. I am on a quest to retrieve all of the fragmented pieces and restore the crest.",
    "No, it was your father who has asked me to do this for him.",
    "Can you give me any help on finding this 'perfect gold'?",
    "Well, I'll see what I can do.",
    "I'm still after that 'perfect gold'.",
    "I have spoken to Boot the dwarf about the location of 'perfect gold', but haven't managed to make you your jewelry yet.",
    "I have the ring and necklace right here.",
    "That's correct.",
    "Thanks Avan.",
    "Hello. I'm in search of very high quality gold.",
    "Where did you say I could find your brother Johnathon again?",
    "Greetings. Would you happen to be Johnathon Fitzharmon?",
    "I am here to retrieve your fragment of the Fitzharmon family crest.",
    "I've come here for your piece of the Fitzharmon family crest.",
    "So is this Chronozon hard to defeat?",
    "I will be on my way now.",
    "Where can I find Chronozon?",
    "So how did you end up getting poisoned?",
    "I've come here for your piece of the Fitzharmon family crest.",
    "Wish me luck.",
    "I have your piece of the crest!",
    "I am still working on it.",
    "I am still working on it.",
    "I have lost the fragment that you gave me...",
    "I have retrieved your crest."
  ],
  "Caleb": [
    "Who are you? What are you after?",
    "Why... yes I am, but I don't believe I know you... how did you know my name?",
    "Ah... well... hmmm... yes... I do have a piece of it anyway...",
    "Well... my brothers and I had a slight disagreement about it... we all wanted to be heir to my father's lands, and we each ended up with a piece of the crest. None of us wanted to give up our rights to our brothers, so we didn't want to give up our pieces of the crest, but none of us wanted to face our father by returning to him with an incomplete crest. We each went our separate ways many years past, none of us seeing our father or willing to give up our fragments.",
    "Well, I am the oldest son, so by the rules of chivalry, I am most entitled to be rightful bearer of the crest.",
    "Well that is true... perhaps it is time to put my pride aside... I'll tell you what: I'm struggling to complete this fish salad of mine, so if you will assist me in my search for the ingredients, then I will let you take my piece as reward for your assistance.",
    "I require the following cooked fish: Swordfish, Bass, Tuna, Salmon and Shrimp.",
    "You will? It would help me a lot!",
    "It's a valuable family heirloom. I think the least you can do is prove you're worthy of it before I hand it over.",
    "I would, but I am very busy. I am trying to increase my reknown as one of the worlds' leading chefs by preparing a special and unique fish salad.",
    "How is the fish collecting going?",
    "Remember, I want the following cooked fish: Swordfish, Bass, Tuna, Salmon and Shrimp.",
    "Well... my brothers and I had a slight disagreement about it... we all wanted to be heir to my father's lands, and we each ended up with a piece of the crest. None of us wanted to give up our rights to our brothers, so we didn't want to give up our pieces of the crest, but none of us wanted to face our father by returning to him with an incomplete crest. We each went our separate ways many years past, none of us seeing our father or willing to give up our fragments.",
    "Well, we haven't really kept in touch... what with the dispute over the crest and all... I did hear from my brother Avan a while ago though.. He said he was on some kind of search for treasure, or gold, or something out near Al Kharid somewhere. Avan always had expensive tastes, so you might try asking the gem trader for his wherebouts. Be warned though. Avan is quite greedy, and you may find he is not prepared to hand over his crest piece to you as easily as I have.",
    "You're welcome.",
    "Hello again. I'm just putting the finishing touches to my masterful salad.",
    "Luck? LUCK? With my cooking skill, I don't really need LUCK.",
    "Last I heard he was on some stupid treasure hunt out near Al Kharid somewhere. You might try asking the gem trader if he knows anything. How are you doing getting the crest pieces?",
    "Then why are you wasting your time here?",
    "I have some good news for you then. One of my customers found this on their travels and recognised it as mine and returned it to me here.",
    "I suggest you be less careless in the future. The crest is extremely valuable, and utterly irreplaceable."
  ],
  "Gem trader": [
    "Good day to you, traveller. Would you be interested in buying some gems?",
    "Fitzharmon, eh? Hmmm... If I'm not mistaken, that's the family name of a member of the Varrockian nobility. You know, I HAVE seen someone of that persuasion around here recently... wearing a 'poncey' yellow cape, he was. Came in here all la-di-dah, high and mighty, asking for jewellery made from 'perfect gold' - whatever that is - like 'normal' gold just isn't good enough for 'little lord fancy pants' there! I told him to head to the desert 'cos I know there's gold out there, in them there sand dunes. And if it's not up to his lordship's high standards of 'gold perfection', then... Well, maybe we'll all get lucky and the scorpions will deal with him."
  ],
  "Avan": [
    "It's a good place to find gold...",
    "Then you have found him. My name is Avan Fitzharmon.",
    "Ha! I suppose one of my worthless brothers has sent you on this quest then?",
    "My... my father wishes this? Then that is a different matter. I will let you have my crest shard, adventurer, but you must first do something for me. There is a certain lady I am trying to impress. As a man of noble birth, I can not give her just any old trinket to show my devotion. What I intend to give her, is a golden ring, embedded with the finest precious red stone available, and a necklace to match this ring. The problem however for me, is that not just any old gold will be suitable. I seek only the purest, the most high quality of gold - what I seek, if you will, is perfect gold. None of the gold around here is even remotely suitable in terms of quality. I have searched far and wide for the perfect gold I desire, but have had no success so in finding it I am afraid. If you can find me my perfect gold, make a ring and necklace from it, and add rubies to them, I will gladly hand over my fragment of the family crest to you.",
    "I thought I had found a solid lead on its whereabouts when I heard of a dwarf who is an expert on gold who goes by the name of 'Boot'. Unfortunately he has apparently returned to his home, somewhere in the mountains, and I have no idea how to find him.",
    "So how are you doing getting me my perfect gold jewelry?[sic]",
    "I know how you feel... for such a long time I have searched and searched for the elusive perfect gold... I thought I had gotten a good lead on finding it when I heard talk of a dwarven miner and expert on gold named Boot some time back, but unfortunately for me, he has returned to his underground home near the Ice Mountain, and I don't have the stamina for such a trek.",
    "Well, I won't entrust you with my piece of the crest until you have brought me a necklace of perfect gold with a red precious stone, and a perfect gold ring to match.",
    "These... these are exquisite! EXACTLY what I was searching for all of this time! Please, take my crest fragment! Now, I suppose you will be wanting to find my brother Johnathon who is in possession of the final piece of the family's crest?",
    "Well, the last I heard of my brother Johnathon, he was studying the magical arts, and trying to hunt some demon or other out in The Wilderness. Unsurprisingly, I do not believe he is doing a particularly good job of things, and spends most of his time recovering from his injuries in some tavern or other near the eastern edge of The Wilderness. You'll probably find him still there.",
    "Greetings again, adventurer. How are you doing on retrieving the crest pieces?",
    "I hope you succeed for my father's sake.",
    "I hope you succeed for my Fathers'[sic] sake.",
    "I have a confession myself adventurer... I did not fully trust you with the actual part of my family's crest before, and gave you a worthless replica before... In hindsight, it seems I was right. I will give you the real piece now, but PLEASE try not to lose it; it is a priceless family heirloom."
  ],
  "Boot": [
    "Hello tall person.",
    "High quality gold eh? Hmmm... Well, the very best quality gold that I know of can be found in an underground ruin near Witchaven. I don't believe it's exactly easy to get to though..."
  ],
  "Johnathon": [
    "That... I am...",
    "The... poison... it is all... too much... My head... will not... stop spinning...",
    "What... what did that spider... DO to me? I... I feel so weak... I can hardly... think at all...",
    "Ooooh... thank you... Wow! I'm feeling a lot better now! That potion really seems to have done the trick! How can I reward you?",
    "You have? Unfortunately I don't have it any more... in my attempts to slay the fiendish Chronozon, the blood demon, I lost a lot of equipment in our last battle when he bested me and forced me away from his den. He probably still has it now.",
    "Well... you will have to be a skilled Mage to defeat him, and my powers are not good enough yet. You will need to hit him once with each of the Blast elemental spells before he will be defeated.",
    "My thanks for the assistance adventurer.",
    "The fiend has made his lair in Edgeville Dungeon. When you come in down the ladder in Edgeville, follow the corridor north until you reach a room with skeletons. That passageway to the left will lead you to him.",
    "Those accursed poison spiders that surround the entrance to Chronozon's lair... I must have taken a nip from one of them as I attempted to make my escape.",
    "Unfortunately I don't have it any more... in my attempts to slay the fiendish Chronozon, the blood demon, I lost a lot of equipment in our last battle when he bested me and forced me away from his den. He probably still has it now.",
    "Good luck. You'll need it.",
    "Well done! Now return it to my father!"
  ],
  "Chronozon": [
    "Die!"
  ],
  "Congratulations! You have completed": [
    "'Family Crest' - Complete this Experienced quest."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Family_Crest?oldid=35391195’"
  ]
}