{
  "Postie Pete": [
    "Two days until Christmas...",
    "Didn't see you standing there.",
    "To be completely honest, Player. Not really. Ever since we opened the P.P.S, delivering letters has become an absolute nightmare.",
    "The Portal Postal Services of course! Concept is simple really, each world has a postal service employee such as myself. They gather the letters and then pop them through a designated portal. But, there seems to be a problem with letters coming from the Land of Snow.",
    "There are no letters coming through! Not a single one. Usually at this time of year I'd be up to my eye-sockets in the things with it being so close to Christmas.",
    "If you could just pop into the Land of Snow through that portal there and see if you can figure out why no letters have come through.",
    "A shame. Well, you know where to find me if you're willing to help out.",
    "So what did you find?",
    "Well that's no good.",
    "Good news! Thank you for helping me out with that."
  ],
  "Player": [
    "Pete?",
    "You seem a little down. Is everything okay?",
    "P.P.S?",
    "What sort of problem?",
    "Is there anything I can do to help you out?",
    "A quick job to help out a friend. Sounds simple enough to me.",
    "Hello?",
    "I didn't call you anything, I was simply saying hello.",
    "I'm helping out a friend, he-",
    "Dare I ask what's happened?",
    "Aren't imps always teleporting around causing mischief?",
    "Well, I've saved Christmas enough times to know when not to get involved. Besides, I've already agreed on helping Postie Pete solve this letter problem.",
    "Did you say Player? That's me!",
    "It's Violet!",
    "You know? Violet, little girl about your height and likes to roar at anything that moves?",
    "Well, the letters are from her! I should pop in. See how she is.",
    "You hardly helped me out, you just gave me my letters.",
    "I can do that.",
    "Now, if I remember correctly, Violet's house is just up that hill.",
    "Aren't imps always teleporting around causing mischief?",
    "Well, I've saved Christmas enough times to know when not to get involved. Besides, I've already agreed on helping Postie Pete solve this letter problem.",
    "Did you say Player? That's me!",
    "I've already got my letters. I have no business reading other peoples.",
    "A bucket of carrots.",
    "Doesn't Santa usually use the chimney?",
    "Merry Christmas you little rascal.",
    "Merry Christmas you little rascal.",
    "H-",
    "B-",
    "W-",
    "It's good to see you both again.",
    "That's a good thing! A child's imagination should be let loose like that.",
    "I don't mind sticking around to play for a while and I'd love to see your tree! Can't seem to see a tree in the roo-",
    "Oh wow. You're quite the artist now, Violet!",
    "Why can't you have a real tree?",
    "I'm sure he knows you've been a good girl and I'm even more sure you're going to be on his nice list! I wonder if we can find you a small Christmas tree.",
    "I don't see a problem with cutting any old fir tree down. You've got plenty of trees just across the yard.",
    "I don't think chopping down a tree should take that long. That leaves plenty of time for play.",
    "And where might that be?",
    "A map to an enchanted Christmas tree farm! What more could you want from an adventure.",
    "What's your idea?",
    "Clues?",
    "Kind of like a clue scroll?",
    "A scroll with a clue on it.",
    "Nevermind! What's my first clue?",
    "Nothing in here except some dried up vegetables.",
    "Nothing underneath this rug besides a lot of dust and broken crayons.",
    "No kidding! VERY HOT! Stay back.",
    "That was a good one. Okay, last clue is smelly.",
    "What's wrong?",
    "Some coal and a carrot. Something fishy is going on here... and it's not the barrel next to us.",
    "Was not expecting that.",
    "Who?",
    "Something like that. All a good bit of fun.",
    "You're never too old for a good old fashioned treasure hunt!",
    "Are you going to throw a snowball at me as soon as I shut them?",
    "Okay, I'm shutting them.",
    "Okay.",
    "Where did these come from?",
    "What the...",
    "Actual talking snowmen! But how?!",
    "[sic]",
    "Snow imps!",
    "What's going on here?",
    "Do either of you two know anything about the missing snow imp?",
    "His name is [Imp name].",
    "Oh that's a relief.",
    "What were you playing?",
    "You mean to tell me that [Imp name] may or may not still be playing a two week long game of hide and don't peek?",
    "We should really go find him.",
    "Where were you playing with him?",
    "What are snow imps doing here?",
    "We should ask them about the missing snow imp, I did say I'd look out for him.",
    "We're currently looking for a map to an enchanted Christmas tree farm!",
    "The snow imps said they were playing at this abandoned farm here. Lets have a quick look around to see if we can find him.",
    "I wonder if that's because you're wearing a bucket on your head.",
    "Right. Well, in that case. You protect me whilst I have a look around for [Imp name].",
    "No snow imp hiding here.",
    "I can hear something moving inside this chest! Here goes nothing. Violet, you might want to shut your eyes.",
    "[Snow imp]?",
    "Are you alright?",
    "I see where this is going. Classic.",
    "I was under the impression that imps could teleport.",
    "What's the matter?",
    "Why would you, a snow imp, be decorating for a town of Yeti?",
    "I'm sorry but, I don't see where this is going.",
    "Ummmm I don't know if tha-",
    "That sounds like it came from the town? I suppose one quick peek can't hurt. It doesn't seem too far from here anyway. Should probably also investigate the source of that bang.",
    "Well, I guess you won your game of hide and don't peek.",
    "Language, [Snow imp]! We've got a impressionable child with us!",
    "We'd better go see what they're shouting about.",
    "Qui-",
    "Ssshhh-",
    "Can't forget that extra half.",
    "Wooooo- Wait, what? We are?",
    "How about you sit down for a while. You've gone through quite the traumatic experience. I can't imagine getting trapped in a box has done you any favours.",
    "Okay, Violet. Let's pick an assistant to help out.",
    "You're right, let's talk to the assistants and see what can be done about that.",
    "Well, Violet. You seem to have rallied the town to band together to fix up this mess. Let's see what we can do to help.",
    "Nicked what?",
    "Why did you have the list in the first place? Isn't that list strictly for Santa's eyes only?",
    "Hey there, do you know anything about Santa's missing list?",
    "We didn't accuse you of anything. We're just trying to find that list. No list means no presents.",
    "We're looking for Santa's list! We were told you might have it.",
    "Okay, let me guess. You passed it along to someone else.",
    "What do you mean 'after you were done with it'?",
    "We spoke to Peter. He told us you've got Santa's list so drop the act and give us the list.",
    "Finishing touches? What are these kids up to?",
    "Oh now I get it. Impish mishcheif corrupting the innocent Yeti children.",
    "What did you all want with the list.",
    "Why am I not suprised.",
    "Violet? What are you doing?",
    "What did you do to that list?",
    "You're a thoughtful one, Violet, but you're as cheeky as a snow imp! Your secret is safe with me.",
    "What seems to be the matter?",
    "...",
    "Yeah...",
    "It's a good thing we're here to help out.",
    "Dare I ask?",
    "I'm guessing that very special tree happens to be the one on fire?",
    "What do you think, Violet? Reckon we can convince Taylor to give Brad another chance and get another tree.",
    "Not yet you little rascal! Let's go and find this farm.",
    "Fireworks aren't exactly your most traditional tree decorations.",
    "Who would have thought!",
    "We've not spoken to Taylor yet.",
    "You must be Taylor? We're wondering if you could help us out with a new Christmas tree?",
    "I like to think it was just a little mistake.",
    "Well, they don't just pop into existance. So I'm guessing quite a while.",
    "Violet! Don't just copy words you don't know the meaning of! Your parents will think I'm teaching you naughty words!",
    "It's a little bit... Wonky? Don't you think? I doubt by the time we haul it over to the town it would have any leaves left.",
    "See, Violet. How about one of these nice ones next to it.",
    "It means this tree is going to go live on another farm.",
    "Hmmm. I guess with a bit of love, care and some decorations it'll look quite special.",
    "Good thinking, Violet.",
    "Cor blimey! That is one ugly tree!",
    "Oh.",
    "Nope! Taylor was more than happy to help us out and you did say Violet could choose whatever tree she wanted!",
    "We should help out the assistants before we try and decorate the tree.",
    "Cor blimey! That is one ugly tree!",
    "How can we decorate if someone set all the decorations on fire.",
    "I hope they'll be willing as they didn't seem too happy when we arrived.",
    "Hello?",
    "Violet, perhaps we should try a diff-",
    "We've already got decorations from this house.",
    "Violet is blue.",
    "We've already got decorations from this house.",
    "We've already got decorations from this house.",
    "That should be enough.",
    "Jhee, it's getting quite late an-",
    "There she goes again. Signing me up for the hard work.",
    "That looks like all the assistants helped out. Let's go tell [Snow imp]!",
    "We should let [Snow imp] know that we've helped out all his assistants.",
    "I suppose us sorting that out might make you finally happy?",
    "Hey buddy, we're doing you a real solid here. The least you could do is be a little more enthusiatic. I didn't hear any complaining from your assistants. Infact, they were more than willing to let Violet and I help out.",
    "We'll have to look around for a ladde-",
    "Okay, how do you plan on reaching all the way up there?",
    "Of course! Snow impli- Wait what? Snow implings?",
    "How on earth did you think of that.",
    "Of course you did. It sounds like a great plan. Let's see if we can find some snow implings that are willing to help us out.",
    "What the-",
    "Why would I grab you?",
    "I'm not here to catch you.",
    "Uhhh I don't think s-",
    "No that's not wha-",
    "Oh wow! That plan actually worked! Let's send out some more.",
    "Beautiful...",
    "Scrubbed up nicely all things considered.",
    "Now it's saved for sure and it's all thanks to you, Violet.",
    "Look! Here comes everybody.",
    "We did quite a good job, eh Violet?...",
    "Turned out alright in the end.",
    "I should get her home now. Glad we could help out, [Snow imp].",
    "Ah, home sweet ho-",
    "Violet! Watch out!",
    "Are you okay? That looked like quite a bump.",
    "I was asking mys-",
    "Of course I can, Violet.",
    "Any time, you little rascal.",
    "Such a lovely drawing!",
    "The snow imps ran into a large amount of trouble as one of them happened to go missing.",
    "The good news is that I helped find him so now things are back to normal which means Posty will be back to getting letters through to you as quickly as he can!"
  ],
  "Posty": [
    "What did you just call me?",
    "What do ya want then? Little busy can't you see.",
    "I don't have the time to help you out. Look at the amount of letters I need to get to sortin'. Christmas is in a real mess this year and if I don't get this mail sorted then I doubt us imps will ever be allowed to help out with Christmas again.",
    "Do yous remember that snow imp, [Imp name]?",
    "Well he's gone missing and at this time of year, that's a BIG problem.",
    "Nah, not old [Imp name]. He's all about the business now, helping out Santa, sorting decorations and all that. Doesn't have time for muckin' about.",
    "Have you not listened to a word I've been sayin'? I'm workin' on it! How am I supposed to deliver letters to someone called 'Player' when I've not a clue who it is.",
    "Well that was the easiest mail I've ever delivered! Here ya go!",
    "Who?",
    "Never heard of her.",
    "Wait! Could you do me a favour. Ya know... Seeing how I helped you out n'all that?",
    "Just keep an eye out for [Imp name] will ya? He's been gone quite a while and people are starting to get worried.",
    "Well he's gone missing and at this time of year, that's a BIG problem.",
    "Nah, not old [Imp name]. He's all about the business now, helping out Santa, sorting decorations and all that. Doesn't have time for muckin' about.",
    "Have you not listened to a word I've been sayin'? I'm workin' on it! How am I supposed to deliver letters to someone called 'Player' when I've not a clue who it is.",
    "Well that was the easiest mail I've ever delivered! Here ya go!",
    "Hey! Get your thieving mitts off those!",
    "HELP!",
    "HELP!",
    "HELP!",
    "They've gone and nicked it!",
    "Santa's bloomin' naughty'n'nice list! There I was, checking it once...",
    "I don't see why that's any of ya business. Anyway, as I was saying, put it down for a second, then I went to check it twice and it was gone.",
    "Well it didn't just sprout legs and walk off!",
    "It's those pesky kids around the town. I knew they were up to something dodgy. Look, perhaps you could help me out. Have a chat to the kids around the town and see if you can track it down for me. If Santa realises the list is gone, I'll be out of a job.",
    "How strange...",
    "It doesn't look the same as when I last left it.",
    "Not to worry! That Santa is a great judge of character and if he deems everybody 'nice', then who are we to question it.",
    "Consider this list checked twice! I had better get this back over to the big boss before he realises it was missing.",
    "Bye"
  ],
  "Betty": [
    "Would you mind getting that please sweetheart?",
    "Violet, love! Give some space. Come on in out of the cold, Player. It's lovely to see you again dear.",
    "My my, Player. Look at how you've grown! Would you care for some food deary?",
    "*sob* They grow up so fast. One day they're in your arms and the next, off saving the world...",
    "Oh do slow down will you, Violet.",
    "Looks like she's got you roped into playing for a while. You'd better not keep her waiting.",
    "Oh do slow down will you, Violet.",
    "Looks like she's got you roped into playing for a while. You'd better not keep her waiting.",
    "I've not seen her this excited in such a long time. What does she have you running around for.[sic]",
    "Why does she have a bucket on her head, Player?",
    "Oh I see that now. It looks lovely.",
    "Your little imp friends stopped by to decorate the place and donate some leftovers. They were talking something about you helping save yeti town in time for Christmas? Sounds like you two have had quite the adventure!",
    "Well, before you fall asleep there. There is one more little suprise[sic] for you.",
    "Do pop in from time to time to say hello to Violet!"
  ],
  "Trevor": [
    "Come I-",
    "We'll be with you in a minute, Violet. Ever since we took Violet off to Yeti town for the festival, her imagination has run wild. She's all but exhausted every single book in the house. She doesn't stop reading or telling us tales of mighty dragons, saving princes from castles and lifting curses.",
    "Not if you don't eat your vegetables.",
    "What's the magic word?",
    "Good girl.",
    "I won't if you won't.",
    "I heard that, Violet.",
    "I see Violet has roped you into one of her games, eh?",
    "Better you then[sic] us! We're getting too old to keep up with her.",
    "Take your helmet off so you can see it.",
    "And a little present under the tree there from Rasmus. Would you like to open it now?",
    "We're grown ups! The only thing we need for Christmas are socks!",
    "Thank you, Player. You've really made this Christmas memorable for her.",
    "Thanks again, Player. You managed to help Violet get her very own tree and save Yeti town!"
  ],
  "Violet": [
    "I'LL GET IT.",
    "Maybe it's Santa!",
    "IT IS YOU! Oh gosh.",
    "Did you get alllll my letters?",
    "How have you been?!",
    "Where have you been!?",
    "I want to show you my new drawings... and my Christmas tree, oh... So much to tell you...",
    "But Muuuuummm I want to play with Player.",
    "Hey! I'm not a child. I am six! ..and a HALF!",
    "I won't just be saving THE world! I'll make sure ALLLLL the worlds live happily ever after!",
    "YUCK! Could we go play now?",
    "ABRA KADABRA ALAKAZAM!!!",
    "Weeeee!",
    "Come, Player. I want to show you my Christmas tree!",
    "I want to show you my tree and then we can play?",
    "Look here! That's me there! And there is my tree!",
    "I wish we could have a real tree this year.",
    "Mum and Dad say they're too old to chop one down for us. So I drew this one! Hopefully Santa still stops at the house. I sent him a picture telling him that we don't have a tree.",
    "Really?!",
    "But, will we still have time to play?",
    "It should be a special Christmas tree and I know just where to find one!",
    "The enchanted Christmas tree farm of course! There is a map to the farm in one of the books that I've read!",
    "Where did I leave it?",
    "Aha!",
    "Here you go. It's called 'Violet and the map'!",
    "Oh no! It looks like the map has been taken. Don't worry! I've got an idea to help us find it, do you want to play it with me?",
    "Clues!",
    "Yes! I'll give you a clue and you have to search for it!",
    "What's a clue scroll?",
    "...",
    "Woohoooo, I knew you'd want to play! The first clue is in a dusty chest!",
    "Nope! That's not it!",
    "I wonder how those got there. Ssssshh! Don't tell Mum!",
    "The next clue is sitting under a big monster!",
    "That's where they went! Your next clue is hot!",
    "You got the clue right! The last clue is smelly! ...and it's not Dad!",
    "*gasp*",
    "What are these?",
    "MAYBE THE SNOWMAN KING SENT HIS SNOWMEN TO STEAL OUR MAP.",
    "The Snowman King rules over aaaaalll the snow and wants to steal aaaaalll the Christmas trees. He must have taken the map to the enchanted Christmas tree farm! Quick! We might be able to catch them leaving! Hurry hurry, follow me!",
    "I can't, Mum! We're on another adventure!",
    "I can't, Mum! We're on another adventure!",
    "Now, shut your eyes and don't open them until I say so. Okay?",
    "I promise I won't!",
    "Keep them shut until I say?",
    "I'll know if you peek!",
    "I said no peeking! I'm not ready yet! Just one more minute... Oh no! Player, look! Snowmen!",
    "Just one more minute...",
    "Oh no! Player, look! Snowmen!",
    "It's the Snowman King and his friend and they've got our We need to do something! Let me find some armour to protect us!",
    "Mum and Dad were right! Carrots do help me see better in the dark!",
    "Don't worry. I'll get them!",
    "Raaaaaar!",
    "Missing snow imp?",
    "And then we can all play together!",
    "Let's go find him!",
    "Did I get them?",
    "They're my friends!",
    "But I can't see anything!",
    "It's not a bucket! It's a helmet! And we need it incase of more snowmen!",
    "Awh. Lets look somewhere else.",
    "But I already can't see anything!",
    "Who's that? Where are they?",
    "Hold on! I want to see.",
    "Woooow! Everything is really bright!",
    "Why didn't you come out the box?",
    "What happened.",
    "Ahhh!",
    "It's okay, you're out now and it's only two days until Christmas!",
    "Yeti town! I've been there!",
    "Can we go see Yeti town again, Player?",
    "Oh please please please! I haven't seen my yeti friends in ages!",
    "Yaaaaaaaaaay! Do you want to come with us, [Snow imp]?",
    "Oh noooo!",
    "ROARRRRRRRRRRRRRRR",
    "ROARRRRRRRRRRRRRRR",
    "Ooop. H... hel... hello everyone.",
    "My name is Vi... Violet... and I am six. and a half!",
    "It's not [Snow imp]'s fault.",
    "It's okay because Player and I are here to turn Yeti town into CHRISTMAS TOWN!",
    "Don't worry, [Snow imp]!",
    "Wooohooooo!",
    "We should help out with fixing this mess.",
    "I wonder what Mum and Dad would think!",
    "You're doing a really good job-",
    "What's wrong?",
    "Where did it go?",
    "Maybe it did!",
    "Don't worry, we'll find it!",
    "Oh no! Don't let it stop snowing!",
    "We're looking for Santa's list!",
    "Well that was easy! Let's go find Peter.",
    "No list means no presents so we need to get it back to Santa!",
    "Who did you give it to?",
    "Let's go find Mozzie!",
    "Mozzie?",
    "You can trust us! We're here to save Christmas!",
    "Thank you, Mozzie! See you again soon!",
    "Neal isn't a yeti!.",
    "We need Santa's list. Do you still have it?",
    "Tossed it where?",
    "Let's get check by the window..",
    "Here it is!",
    "Nothing...",
    "That's better.",
    "Everyone should be on the nice list! I'd be sad if any yeti or imps missed out on Christmas.",
    "Let's get it back!",
    "...",
    "Don't disturb him, Player. He's trying to make sure it stays snowing.",
    "We really get to pick a Christmas tree!",
    "Wooohooooo! CHRISTMAS IS SAVED!",
    "We'll bring you back an awesome tree.",
    "Why did you set it on fire!",
    "Fireworks!",
    "We'll go see her now!",
    "WOOOOOOOW! A real life Christmas tree farm!",
    "Brad says he's sorry.",
    "I've always wanted to grow my own Christmas tree!",
    "Thank you, thank you, THANK YOU! Player, let's go get [Snow imp] a new bloody tree!",
    "Woops!",
    "Thank you for letting us pick a tree!",
    "Oh.",
    "My.",
    "GOSH!",
    "It's PERFECT.",
    "What's the woodchipper?",
    "Please, Player! Lets pick this one!",
    "We'll take the wonky one please, Taylor!",
    "Quick! We should make sure Brad doesn't burn it down!",
    "Too tall!",
    "Too straight!",
    "Too smelly!",
    "Too green!",
    "Too treelike!",
    "We should make sure Brad doesn't burn down our new tree!",
    "Brad!",
    "It's your new tree! Do you like it?",
    "I can't wait to decorate it! I've never decorated a tree before! We could add fireflies and ribbons and paper snowmen and the best star ever! But where did the fire go?",
    "It's so pretty! The best stage for the best tree!",
    "Awh.",
    "My name is Violet! What's your name?",
    "Happy Christmas, Susi!",
    "How can we help turn Yeti town into CHRISTMAS TOWN!",
    "They're all gone?",
    "Well let's go ask! See you in a bit, Susi!",
    "Knock knock!",
    "But we don't have enough decorations yet.",
    "What are they doing in there, Player?",
    "Yaay! Merry Christmas.",
    "Knock knock!",
    "Violet!",
    "Uh...",
    "I just need Christmas decorations for the town, do you have any?",
    "Oh no...",
    "Wooooooow! These are so pretty!",
    "Knock knock!",
    "Excuse me! Do you have any spare Christmas decorations please?",
    "...",
    "Poppet?",
    "Thank you so much!",
    "Knock knock! Is anyone home?",
    "My name is Violet and we're looking for decorations to help to save Christmas.",
    "Wooooow. You have your own tree!",
    "Thank you, Korg! Have a good Christmas!",
    "Not enough to decorate the whole wide world! We need to tell Susi we've got everything. I wish we could take some back home to my house.",
    "Susi! Susi! Look at all of these! This bauble looks like my Because it's big, blue and round!",
    "We'll do it!",
    "Where should we put them, Susi?",
    "YES! I LOVE DECORATING!",
    "Look at the lights!",
    "Done! Let's find the next one.",
    "Susi is going to be so happy!",
    "Almost done!",
    "I'm so happy!",
    "That's better!",
    "I like this one!",
    "PERFECT!",
    "Maybe he'll let us decorate the tree now.",
    "Susi did you see the town?",
    "We're on it!",
    "Hey, [Snow imp], we've done it!",
    "I know how to cheer you up!",
    "I'll decorate the tree so it's the bestest tree in all the If you like, you could help?",
    "Awh, it would have been fun to do it with you. But we'll be sure to make you the best tree we can!",
    "Oh no! How are we going to reach it.",
    "I've got an idea!",
    "Snow implings of course!",
    "We'll get them to carry the decorations and drop them onto the tree.",
    "I read about it in a book!",
    "...",
    "No, really My Impling, we need your help to save Christmas!",
    "Y-",
    "Christmas pudding! YUCK. No Mr Impling, we need your help decorating the tree! We can't reach it!",
    "Use your wings!",
    "Bloody is a naughty word! You can fly for us?",
    "Not us silly! The decorations!",
    "Let's find a spot high enough to throw the snow impling from.",
    "It's starting to look better!",
    "Finished! Let's go see it.",
    "Look how pretty it is.",
    "CHRISTMAS IS SAVED!",
    "*giggle*",
    "We did!",
    "So...  Pretty...",
    "Say hello to Santa for me! Merry Christmas!",
    "Wooooooooow! The house...",
    "It... looks like a Christmas tree! Mum and Dad put up decorations!! Lets go tell them about yeti town! Wait! I want to show them my new helmet!",
    "Ooops.",
    "So dizzy. I can only see your feet but I'll follow you.",
    "MUM, DAD! You decorated the house!",
    "It's not a bucket! It's my new helmet!",
    "But Mum, where did you get all the decorations?",
    "It. Was. AMAZING! The snow imps burnt down Rasmus's favourite christmas tree. We got to pick a new Christmas tree and decorate it and add lights EVERYWHERE! And then we ran around town to add more lights and decorations to make it CHRISTMAS TOWN! And then... I'm so tired...",
    "Huh?",
    "Woooooooow!",
    "My very own Christmas tree! My Christmas wish came true!",
    "But, what about all of you?",
    "Player, could you help me open it?",
    "Oh my gosh! Luncheons and Flagons 5th edition!",
    "I can't wait to play with ALL my friends!",
    "And some crayons! I can draw all the fun we had.",
    "I'm going to go draw about our adventure today!",
    "Thank you, Player!",
    "I found these lamps. I'd give them back but looks like you need more room to hold them first.",
    "Here, it looks like you lost this.",
    "Here, it looks like you lost these.",
    "I can't wait to play Luncheons and Flagons with all my snow imp friends.",
    "And it's Christmas in two days!",
    "I'm really excited!"
  ],
  "*** Violet": [
    "Quick! We might be able to catch them leaving! Hurry hurry, follow me!"
  ],
  "Snowman 1": [
    "ARGHHHH ME HEARTYS!",
    "What do yous mean I'M on the wrong script? How do we know it's not YOU on the wrong script."
  ],
  "Snowman 2": [
    "No no no. You're on the wrong script.",
    "Unlike you pal, I actually listened to Violet when she told us what to do.",
    "Ooof."
  ],
  "Snow imp 1": [
    "Playtime with Violet!",
    "I didn't even know there was a missing snow imp. What's their name? I'll keep an ear out.",
    "Oh, [Imp name]! We know where he is!",
    "Yeah we were playing with him about two weeks ago. Now you mention it, we haven't seen him since.",
    "Hide and don't peek. It was his turn to hide.",
    "Now that's commitment!",
    "Just a little bit of a way through the trees there, you'll find an abandoned farm.",
    "We didn't ruin nuffin'!",
    "Whatch ya mean 'Your kind'?!"
  ],
  "Snow imp 2": [
    "Well... That's not technically true, we sort of know where he is.",
    "We never did find manage to find him.",
    "He could be?"
  ],
  "[Snow imp] Claus": [
    "Oh sweet Saradomin! Snow never felt so good. Oh and snow never tasted so good!",
    "A kid wearing a bucket. Not exactly the first thing I'd have guessed I'd see when being freed.",
    "It's you, Player. Of course you'd be the one to save me! Always getting me out of sticky situations.",
    "Nope. I am definitely not alright. You try sitting in a dark box for a couple of weeks!",
    "Not that simple, kid.",
    "Me and a few of my buddies were playing a game.",
    "Well it seemed like the perfect hiding spot at the time so I hopped right on in and then- -BANG!",
    "The lid slammed shut behind and I was stuck.",
    "It's not that easy ya know.",
    "There is only so many times you can sing the only song you know...",
    "Two days until Christmas... Oh no. Oh no no no no no no. I'm in big trouble.",
    "I haven't done any of the decorating of Yeti town!",
    "Well, over the last few years, as I've helped Santa out more and more I've wanted to take on a more... creative role in the business.*** Player: Right?",
    "After chatting to the big boss man, I offered up my services for the decoration of Yeti town for Christmas. Figured it would help scratch that creative itch.",
    "This year I had such grand plans for the decorating but kept pushing it until last minute to make sure everything was just perfect. Then I get distracted into playing games and this happens. Santa will never let me help out again.",
    "What was that?!",
    "I suppose I did. I can't believe they left me.",
    "I'm really sorry. I don't have the heart to carry on... The town is in shambles and everybody hates me. Talk to my assistants over by my tree.",
    "I cna't believe they burnt my tree down.",
    "*sob*",
    "My tree...",
    "Everyone hates me",
    "It's not my fault I was trapped",
    "I've ruined Christmas",
    "*sob*",
    "Forgive me",
    "*sob*",
    "But what about that... thing... in the middle.",
    "I suppose so...",
    "You're right! I'm sorry. You've done such a fantastic job already, I guess I'm just a little upset about the situation.",
    "How so?",
    "I think it's best if you decorate the tree without me, Violet. I'd only mess it up."
  ],
  "[Snow imp]": [
    "They've set my bloody tree on fire...",
    "Not a single Christmas decoration in sight either...",
    "MY TREE!",
    "YOU'VE BURNT DOWN MY PRIZED CHRISTMAS TREE!",
    "I didn't-",
    "It's no use pal, we'd need something awful loud to shut this lot up and besides... What's the point. They hate me now.",
    "It's no use. I'm a failure. Santa is going to want nothing to do with me.",
    "I suppose with help from my assistants you might be able to fix this in time.",
    "Talk to them. They'll be able to tell you what is left to do.",
    "It looks...",
    "Awh shucks... You guys did me a real solid here. Thank you both.",
    "Thank you so much! I'll be sure to let Santa know how much the two of you helped me out here. Especially you, Violet.",
    "Farewell friends. Merry Christmas."
  ],
  "Yeti female": [
    "You've ruined Christmas!",
    "Perhaps he shouldn't have come back. I doubt he's here to fix up this awful mess. You snow imps have caused us enough problems. I have no idea why Santa thought it would be wise to put your kind in charge.",
    "Even without [Snow imp] they've made a huge mess.",
    "They're here to help us!",
    "Who decorated the town?",
    "Look at the tree! It's amazing!"
  ],
  "Yeti child 1": [
    "We're all going to be on the naughty list this year.",
    "What if Santa doesn't visit us because he thinks we hate Christmas!",
    "We're saved!"
  ],
  "Yeti child 2": [
    "*audible tears of sadness*",
    "*audible sobs of hope*"
  ],
  "[All snow imps, Yetis, and Yeti children]": [
    "*gasp*"
  ],
  "Yeti male": [
    "[Snow imp] is back!"
  ],
  "Snow Imp 2": [
    "It's not our fault [Snow imp] abandoned us!"
  ],
  "Snow Imp 1": [
    "Probably couldn't handle the pressure!"
  ],
  "Yeti (male, female, and children)": [
    "You started it",
    "Christmas is ruined because of you",
    "You're always making a mess",
    "Your mum is hairy",
    "Well you're blue!"
  ],
  "Snow imps": [
    "It's not our fault!",
    "No it's because of you!",
    "No! YOU started it.",
    "Don't bring my mother into this!",
    "You're blue too"
  ],
  "[All]]": [
    "*gasp*"
  ],
  "Assistant Timothy": [
    "Mummy told me to be quiet so she put me on charge of making sure it's still snowing.",
    "No, but Mummy says that if I let it stop snowing, she'll write Santa and tell him to put me on the naughty list.",
    "I'm trying really hard!",
    "I let it stop for a second there! I hope Mummy didn't notice."
  ],
  "Objective": [
    "Talk to the snow imps and yeti children around the town to see if they know where Santa's list is.",
    "Return the list to Posty.",
    "Visit Taylor to the northwest of town to pick out a new Christmas tree for the town centrepiece.",
    "Gather Christmas decorations by knocking on doors and asking residents of the town if they have any to spare.",
    "Add decorations to houses and lampposts around Yeti town with Violet.",
    "Tree decoration progress 1/3",
    "Tree decoration progress 2/3",
    "Tree decoration progress 3/3"
  ],
  "Elizabeth": [
    "List? I aint seen no list? What are you accusing me of?",
    "No presents? It wasn't me I swear! I did have it but not for long. I gave it to Peter.",
    "Please don't tell on me."
  ],
  "Peter": [
    "Busted. That Elizabeth... Any sign that she may be in trouble she'll spill the beans.",
    "I don't have it anymore.",
    "You got me.",
    "After I was done with it I gave it to Mozzie.",
    "What is this? An interrogation? I've given you what you need."
  ],
  "Mozzie": [
    "Hello Violet! So happy to see you here.",
    "Woah easy there... Such aggression.",
    "First, I want full immunity for anything that may or may not have happened to the contents of the list. The list is with Neal who is adding the finishing touches. He was up in the big house on the hill."
  ],
  "Neal": [
    "Tossed it didn't I.",
    "Out the window. Caught whiff of an investigation going around.",
    "Simple plan really. We moved all our names back over to the nice list."
  ],
  "[Assistant]": [
    "You're already helping out one of the assistants. Come chat to me after you're done!"
  ],
  "[NPC]": [
    "Can't talk right now. I'm busy."
  ],
  "Assistant Brad": [
    "The boss doesn't look happy, eh? It's all really fallen apart for him.",
    "I'm glad you are. I was previously charged with Christmas tree duty. But as you can see... It hasn't quite gone to plan.",
    "A pretty lass named Taylor runs a farm northwest of the town and she owes me a couple of favours but I'm not exactly in her good books at the moment.",
    "Well, you see... Taylor and [Snow imp] had been working on a very special tree together.",
    "I worry if I try and get another tree from her she'll stuff me and use me as a tree topper.",
    "You can choose whatever tree you like if you manage to convince Taylor to help us out.",
    "The Yeti-folk wouldn't let us. It's like they wanted us to fail so so we don't get to help out next time.",
    "A slight mishap with a lot of fireworks.",
    "Got to try everything once, eh? Turns out, they don't work so well when exposed to fire.",
    "How are you two getting on with finding that Christmas tree, did you speak to Taylor?",
    "Ah, well if we're going to get a new tree in time for Christmas day then we're going to need help from her.",
    "Put in a good word for me will ya?",
    "What is that?",
    "Do you really call that a tree? This is Taylor playing a cruel joke on me isn't it.",
    "We dumped as much snow on it as we could and then used the last of the decorations that didn't go up in flames to build the base for that thing you're calling a tree.",
    "Well, thank you both for the help. We'll have to decorate it shortly but for now, see if you can help out the other assistants for now.",
    "Thank you, Violet, for all your help! Now that we're done with all our tasks you should talk to [Snow imp] and see what he wants doing with that tree.",
    "Let's celebrate with some more fireworks!"
  ],
  "Taylor": [
    "Let me guess. Brad sent you two to fix the awful mess he created because he can't help but get involved. The tree was fine! It didn't need fireworks. Fireworks don't have anything to do with Christmas!",
    "As he should be! It took us years to craft the perfect tree but now the only way to proudly display it would be in an urn on a mantlepiece.",
    "Just a mistake?! Do you know how long it takes to grow a tree?",
    "Well, I don't see how I could say no to that! Feel free to have a browse around the farm and pick out any tree you",
    "No problem. Make sure you don't let Brad and his fireworks anywhere near it!",
    "That one was headed straight for the woodchipper.",
    "You can have it free of charge if you like it.",
    "I think all the TLC in the world isn't going to help that poor thing.",
    "Pleasure doing business with you both. Enjoy your new tree."
  ],
  "Assistant Susi": [
    "It's Susi. Nice to meet you, Violet.",
    "Oh it's Christmas alright and this years is proving stressful with all the drama going on. It's great that you found [Snow imp], but he seems in no state to help decorate, so I'm very glad the two of you have volunteered to help out.",
    "Christmas decorations. For whatever reason, a few imps decided it would be a fantastic idea to put the entire lot on the tree at once... ...before it went up in flames.",
    "Well, we've got no other choice but to go around the town and ask the residents if they'd be willing to donate anything they can.",
    "Thank you both!",
    "Aren't those just lovely, Violet! As you seem to be having fun, how would you feel about putting them up around the town?",
    "Adding some more colour and lights to the lamp posts, and some wreaths on the doors. That ought to be enough, don't you think?",
    "Violet! What a fantastic job you've done! Thank you both for helping out with this one. Now that you've helped out all of us, you should try talking to [Snow imp] and see what he wants doing with that tree."
  ],
  "Stacey": [
    "Oh no! We've been caught-",
    "Ahem, how may I be at your most humble service?"
  ],
  "Mike": [
    "Quick, pretend to be an adult... Or we'll get into trouble for nickin' the eggnog.",
    "You sound like an idiot, not an adult.",
    "Here, take these and leave us alone."
  ],
  "Charlie": [
    "Who's there? Mum says I'm not supposed to talk to strangers.",
    "Violet who?",
    "Why is she blue?! Is she a snow imp?! Is she sad?!",
    "I just made some but I can't reach the door handle and my parents aren't home.",
    "Don't be sad, Blue Violet! Oh I know. I'll slide them under the door for you.",
    "Thank you."
  ],
  "Sandra": [
    "Why, hello there, sweet girl!",
    "Seeing as you asked so nicely let me just get my husband to check for you. GORDON!",
    "THERE IS A LITTLE GIRL HERE WHO NEEDS THE DECORATIONS FROM THE LOFT.",
    "Won't be a moment, poppet.",
    "Ah here you go. Handle them with care! They're antiques."
  ],
  "Gordon": [
    "WHAT?!"
  ],
  "Korg": [
    "Hey, hey, hey! Allow me to introduce myself, my name is Korg. How can I help you?",
    "Saving Christmas, eh? I'd be more than happy to help you out. I'll nab some off my tree.",
    "It had far too many baubles on it anyway. Here you go."
  ],
  "Hal the snow impling": [
    "*sigh*",
    "ARRGHHHHHHHHHHHHHHHHHHH! I SWEAR I'VE GOT NOTHING ON ME!",
    "NO LAMPS. NO MINCE PIES. NO CHRISTMAS CHEER. PLEASE DON'T GRAB ME.",
    "You're joking right? You humans are known far and wide to snatch and grab at us poor implings. Imagine being one of us... Flying along and then all of a sudden... BANG!",
    "Either shoved into a jar or subject to a shakedown on the spot.",
    "Sounds like something an impling snatcher would say!",
    "You've got my attention, need me to steal something shiny?",
    "Oh how about something cold, I'm good at nabbing cold things!",
    "Ooo you need me to make a Christmas pudding, wait... how did you know I cook?",
    "Oh? How am I supposed to help with that?",
    "I've got bloody wings?!",
    "You're much too heavy to lift all the way up there.",
    "Well, I really wanted to cook a pudding, but fine. I'll help, as long as there's no grabbing!",
    "It seems no matter what we do we still end up in a musty backpack.",
    "Throw?!",
    "WAAAAAAGHHHHHHHHHHH",
    "WAAAAAAGHHHHHHHHHHH",
    "WAAAAAAGHHHHHHHHHHH"
  ],
  "Yeti child": [
    "They got us a new tree! Violet saved Christmas! *audible tears of joy*",
    "Hooray! Christmas is saved!",
    "Wooo! GO! Violet!"
  ],
  "Snow imp": [
    "Look at all the lights! Maybe we'll be back on Santa's nice list!"
  ],
  "Violet and Player": [
    "NO!"
  ],
  "You have unlocked a new music track": [
    "Violet's Celebration."
  ],
  "Congratulations! You have completed": [
    "'Violet is Blue Too' - Complete this quest."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Violet_is_Blue_Too?oldid=36230119’"
  ]
}