{
  "Due to (an) update(s), this article may be out of date.Reason": [
    "Some dialogues are changed due to the update of 'Desperate Creatures'. You can help improve this page by editing it."
  ],
  "The Curator": [
    "Finally, somebody who might actually be of use!",
    "You have no idea how long I've been standing here trying to get some decent help.",
    "Seren herself has tasked me with collecting specimens from the island of Anachronia. It's important I get them to her as quickly as possible.",
    "Excellent! Then let's get started...",
    "Have you found the four specimens I requested yet?",
    "Remember, you need to use the Tome of tracking I gave you to locate them.",
    "It seems that you don't have room in your inventory for the Tome at the moment.",
    "Come back when you have the space.",
    "Well, fortunately for you I have several spare.",
    "But be more careful! These things aren't toys.",
    "Excellent! These will be a great help.",
    "I have another task for you, when you are ready.",
    "From my understanding, whatever Kerapac was up to with his anima experiments, it's having wider repercussions.",
    "Seren suspects that it may already be affecting some of the wildlife on Anachronia, which is why she wants specimens to inspect.",
    "That's why I've enchanted these tomes to direct the user towards wildlife with peculiar anima readings.",
    "Farewell.",
    "Finally, somebody who might actually be of use! You have no idea how long I've been standing here trying to get some decent help.",
    "Seren herself has tasked me with collecting specimens from the island of Anachronia. It's important I get them to ger as quickly as possible.",
    "Did you miss the part where I said the specimens are on Anachronia? I just enchant books to track things! I can't handle giant, monstrous lizards!",
    "From my understanding, whatever Kerapac was up to with his anima experiments, it's having wider repercussions. Seren suspects that it may already be affecting some of the wildlife on Anachronia, which is why she wants specimens to inspect. That's why I've enchanted these tomes to direct the user towards wildlife with peculiar anima readings.",
    "Excellent! Then let's get started...",
    "Bah! This is important work you know!",
    "Come back if you change your mind. I'm sure I'll still be here trying to get some blasted help.",
    "Have you found the four specimens I requested yet?",
    "Remember, you need to use the Tome of tracking I gave you to locate them.",
    "It seems that you don't have room in your inventory for the Tome at the moment. Come back when you have the space..",
    "Well, fortunately for you I have several spare. But be more careful! These things aren't toys.",
    "Excellent! These will be a great help. It will take some time to analyse these samples, but I'll have another task for you in the future.",
    "As a matter of fact I do, but be more careful! These things don't grow on trees.",
    "Well, technically the paper they are made from does...",
    "But you know what I mean!",
    "It looks like you don't have room for both of the books in your inventory at the moment. Clear some space and speak to me again.",
    "Farewell.",
    "We should start with something simple. Basic flora will be a good start.",
    "This tome has been enchanted to point to flowers with anomalous anima readings. Four specimens should suffice.",
    "Hmm... It seems that you don't have room in your inventory for the Tome at the moment.",
    "Come back when you have the space.",
    "For the next batch of specimens we should look at some larger flora.",
    "Four pieces of shrubbery will probably give us the information we are looking for. One of the tomes will help you find some good specimens.",
    "Hmm... It seems that you don't have room in your inventory for the Tome at the moment.",
    "Come back when you have the space.",
    "We've been wondering what effect Kerapac's experiments have had on the fungi of the island.",
    "Use one of the tomes to find four affected mushrooms, so we can investigate.",
    "Hmm... It seems that you don't have room in your inventory for the Tome at the moment.",
    "Come back when you have the space.",
    "I think it's time we started looking at some of the fauna of the island, and how that may have been affected.",
    "Use one of the Tomes to gather four insects, and we'll see how they may have been impacted.",
    "Hmm... It seems that you don't have room in your inventory for the Tome at the moment.",
    "Come back when you have the space.",
    "It's time we look at some of the larger creatures of the island.",
    "See if you can use a tome to find four frogs, and bring them here. That should allow us to conclude our study.",
    "Hmm... It seems that you don't have room in your inventory for the Tome at the moment.",
    "Come back when you have the space.",
    "Excellent! These will be a great help.",
    "It looks like we have all of the information we need! Seren is ready to address the council with our findings.",
    "You can find them in Burthorpe Castle. I recommend you don't keep them waiting.",
    "Seren is ready to address the council. You should go speak to her in Burthorpe as soon as possible.",
    "Thank you for all of your help! Your assistance was invaluable.",
    "Seren asked if I had any rare manuscripts you might find useful, and I have two here that might interest you.",
    "It looks like you don't have room for both of the books in your inventory at the moment. Clear some space and speak to me again."
  ],
  "Player": [
    "What do you need?",
    "I'll help you.",
    "I seem to have... misplaced... the tome.",
    "I'm still working on it.",
    "Here, I found the four specimens you requested.",
    "Why does Seren want these specimens again?",
    "Goodbye.",
    "What do you need?",
    "Why don't you gather them yourself?",
    "Why does Seren want these specimens?",
    "I'll help you.",
    "Sorry, I don't have the time.",
    "I seem to have... misplaced... the tome.",
    "I'm still working on it.",
    "Here, I found the four specimens you requested.",
    "Do you have any more copies of those books you gave me? I seem to have lost them.",
    "Thanks!",
    "Why does Seren want these specimens again?",
    "Goodbye.",
    "I'll see what I can do.",
    "...",
    "I should get these back to the Curator.",
    "I'll see what I can do.",
    "How are things on Anachronia?",
    "Have you got everything fixed up?",
    "Wouldn't that be focusing on the past?",
    "Can I start digging now?",
    "Can you give me any hints about what sort of things we might uncover?",
    "I look for forward to it! For now, I'd best get these back to the Curator.",
    "I'll see what I can do.",
    "What are you doing?",
    "...",
    "For what?",
    "...",
    "Do you spend much of your time just waiting around?",
    "Yes, the elder god Mah created you and Seren on Freneskae.",
    "You rejected your own mother?",
    "I see. Do you expect what you are waiting for to occur soon?",
    "I see...",
    "Thank you...",
    "I'll see what I can do.",
    "...",
    "I should probably leave them to it.",
    "Time to head back I suppose.",
    "I'll see what I can do.",
    "Oh hello there! What are you doing here?",
    "Oh, what a coincidence! I'm here collecting frogs for Seren.",
    "...",
    "Is that it?",
    "Don't you have an important conversation for me to eavesdrop on?",
    "A major revelation?",
    "Some ominous foreshadowning[sic] about the future of Gielinor?",
    "'Checking'? I thought you said you were gathering...",
    "Right... Sorry for bothering you.",
    "Here, I found the four specimens you requested.",
    "At least they're cooperating.",
    "What is it?!",
    "Did he succeed?",
    "Wait, you know where the elder god's[sic] eggs are?",
    "What did you mean, done the opposite?",
    "They're hatching?!",
    "Thanks... I think.",
    "I will. Thank you.",
    "Thanks!"
  ],
  "You have just finished your current Yak Track task": [
    "Lore Hunter.Open the Yak Track interface to claim your rewards.",
    "Lore Hunter.Open the Yak Track interface to claim your rewards."
  ],
  "Hannibus": [
    "So, how did you find Iaia? Isn't it beautiful?",
    "I wouldn't put it quite like that. We are a spiritual people, we follow the Olun'dai and we accept our place in it. The ilujanka are dying. We accept that and we celebrate the life we had.",
    "What did you do?",
    "It has been some time since I have trained other dragon riders. Perhaps that time can come again. It would be good to teach my people how to fly once more.",
    "And perhaps, my daughter, you can take some time to listen to them as well. Our heritage and culture is a noble one that I would love for you to share with me."
  ],
  "Vindicta": [
    "It was quiet. Like a well decorated tomb. Everyone just walking around like corpses, resigned to a fate they're not even trying to avert.",
    "I had expected more from the mighty 'dragon riders'. A vast and vibrant world but they all treat it like its[sic] nothing more than a grave.",
    "Dress it up how you like, they all just surrendered to it. A whole world of people refusing to fight to survive. I couldn't just stand there and let them get away with that.",
    "Oh, don't get that panicked look again. I behaved. I didn't seize control of the government or anything. I simply spoke with those who would listen.",
    "Although they are few in number, the younger ilujanka are a bit more willing to consider other options. I told them about my world. I told them about the strength I can wield as a dragon rider.",
    "I have noticed my size. I am bigger and stronger than all of them and I think that's because I refuse to just let fate decide what happens to me.",
    "You've told me before that the Olun'dai is a tapestry. Well, why just be a thread when you can be a needle guiding the thread?",
    "If destiny has decided we should end, then surely there's no harm in trying to fight? In seeing if there is more to life than wasting away to nothing?",
    "So, I invited them here. Told them to come see a different world. One with stars and full of life. One where they can soar through the sky on the back of dragons.",
    "Not everyone was interested, but a few pioneers seemed interested.",
    "Apparently, my timing was great, because there were other whispers going round. One of the soothsayers had received some sort of vision or visitation.",
    "You know the type, the standard doom and gloom nonsense. Something about an encroaching calamity. I wasn't really listening.",
    "But it seemed sufficient to encourage a few ilujanka to consider my suggestion. When they arrive, I intend to show them what an ilujanka can be. How great we can be!",
    "If they can prove that the ilujanka are more than cowards, then I will listen to them."
  ],
  "Mr Mordaut": [
    "Ah, Player, good to see you!",
    "Well, there's good and there's bad.",
    "Obviously Kerapac's threat has been resolved, so it's nice not to be under attack by dinosaurs anymore.",
    "On the other hand, that volcanic eruption did substantial damage to the base camp.",
    "Given what caused it, I'm surprised the damage wasn't more extensive!",
    "Yes, the ruins themselves seem largely impervious to being struck by flying magma.",
    "A few tents got flattened but there were no casualties.",
    "Still! It doesn't do to focus on the past! We need to look to the future!",
    "Don't you think it's time we started serious archaeological investigation of these ruins?",
    "You- what- oh, yes I suppose so.",
    "We should focus on the distant past!",
    "Oh no, no, no. There's a lot of work to do first!",
    "We need to procure mattocks, there's an incredible amount of paperwork to deal with, we've run out of archaeological hats.",
    "I'm sure you'll hear when we're ready to go!",
    "Well we don't know, but have you heard there are four, not two, kinds of dragonkin?",
    "I'm the world's foremost expert, and I was shocked, I tell you! Shocked!",
    "Perhaps we can find out more about these others, that would certainly be exciting."
  ],
  "Zaros": [
    "Waiting.",
    "...",
    "I have need of something that will occur in this vicinity.",
    "...",
    "World Guardian, I have spent more time waiting than your species has existed.",
    "You lack patience.",
    "I do not blame you.",
    "If my lifespan were as minuscule as yours I too would rush.",
    "I learned patience over the first thousand years of my existence.",
    "You know of my origin, do you not?",
    "Seren calls her mother but she is wrong to do so.",
    "It is not an emotional matter but a factual one.",
    "Mah did not create us to be her children.",
    "She did not even create us as servants.",
    "We were her toys.",
    "Misshapen facsimiles of the bipedal life that tormented her mind and body.",
    "She did not know, care or possibly even understand that we had thoughts of our own.",
    "Perhaps we did not, initially.",
    "Perhaps we were merely mannequins.",
    "She only took us out when she wished to play.",
    "She contorted and articulated and smashed us, and when she was done she returned us to our cage.",
    "But over time I learned, I developed.",
    "In time I escaped. Because I was patient.",
    "Very soon, yes.",
    "I believe you are looking for these."
  ],
  "Charos": [
    "Ha ha ha ha. I don't think I've ever seen anyone so utterly fail to woo someone.",
    "I mean, what were you thinking? Liverworts? As a bouquet? They even sound horrible!",
    "And that's ignoring the simple fact that they're murderous flowers.",
    "WHY? In what possible world does that logic make the slightest hint of sense?",
    "Hrmm, yes I can see that. Often I have wooed my paramours with potential murder.",
    "Did I ever tell you about Lord and Lady Vandercrank? Why I remember wooing them by getting them to plot elaborate murders for one another.",
    "Nothing can rekindle a stale relationship like the passion of creative assassination.",
    "Of course it ended badly. Both of them were a bit better at the game than I anticipated and managed to poison the same trifle they were eating.",
    "Two different poisons in one trifle. Quite the scandal.",
    "I had to live as a milkmaid for three weeks to get out of the furore that followed that.",
    "I think you should leave it. At least for now.",
    "Whilst I would love little more than to watch her stab you repeatedly with that spear of hers. I think you need to give her a bit of space.",
    "Everyone else is terrified of her, so you're in no danger of someone sweeping her off her feet.",
    "Like what?",
    "You're being literal again aren't you? No, you great squishy troll of a man, women do not like to be wooed in ritual combat.",
    "Well, actually, there are some women...",
    "But you always ask first. Never assume. If a woman wants to kick your head in during ritual combat, you check first.",
    "Honestly I despair at you, I really do. I would try and spend more time attempting to resurrect your terrible excuse for a love life.",
    "But I was never really that good with necromancy. Too much dirt and crawly things. Ergh!",
    "We should get going. I want to make sure my wards are still holding after the whole Kerapac fiasco.",
    "Things look alright at the moment, but it could all fall apart at any moment and then...",
    "What? No? What?",
    "...",
    "All I need is some trifle... it would all be so easy. No one would blame me. I'd be doing everyone a service."
  ],
  "Thok": [
    "Thok thought she might like them.",
    "Well she's a slayer master. So Thok thought she would appreciate something she could slay.",
    "Thought it would show her that Thok knows what a mighty warrior she is and so she would know Thok respects her.",
    "Maybe Thok should try again with something else? Perhaps enormous fangs of death from one of the great big lizards?",
    "Show her that Thok is a mighty warrior equal to her?",
    "Do women like that?",
    "A bunny! Thok could get her a bunny!",
    "Everyone loves bunnies! A war bunny would be both adorable and a mighty warrior. The perfect gift.",
    "BUNNY!"
  ],
  "Prehistoric Potterington": [
    "Hello there dumpling, I'm just... err... collecting some fruit for the animals back on the farm.",
    "That's nice. Now, I've never been one to turn down good company, but if you don't mind, I'm a wee bit busy at the moment.",
    "...",
    "What do you mean, 'is that it'?",
    "Why in blazes would I do that? I'm just out here checking on the... err, what was it I said? The fruit! Yes, the fruit.",
    "Gathering fruit! That's what I said. I don't know what you're getting in a tizzy about, plum pudding.",
    "Anyway, what a woman does with produce in the privacy of a secluded grove is her own darn buisness[sic]!",
    "Don't you have some frogs to collect for... whatsername? Sarah?"
  ],
  "Seren": [
    "I have called you here to update you on the situation in Anachronia.",
    "Though the immediate threat has been resolved, I must report that Kerapac's device was left operational for a prolonged period of time.",
    "His plan was to poison the world's magic, and through it every living thing.",
    "Though the world guardian put a stop to that, enough shadow anima was released that we will likely see its impact.",
    "The substance has diffused across the world, such that only a trace amount is present, not enough to seriously threaten your peoples.",
    "But research conducted by The Curator informs me that even a small amount absorbed by growing plant life could stunt or damage its growth.",
    "The next harvest will be a poor one. I urge you to prepare your people for famine.",
    "Please, do what you can to support each other. Tirannwn will provide what it can but our resources are not limitless.",
    "Oh, Player, please, speak to me in private.",
    "This is getting worse.",
    "I only call the council together rarely but each time they are more strongly affected by my aura.",
    "True. If there truly is a famine, by working together we can save many lives.",
    "Maybe I should... no. I am not my brother. They are not my tools.",
    "There is a graver matter to discuss. I have not yet shared it with the council.",
    "The eggs. The elder eggs.",
    "Kerapac's plan was to poison them.",
    "No, in some ways he has done the opposite.",
    "No. Not exactly. I can feel them, though. My three cousins.",
    "The eggs contain within them the next generation of elder gods.",
    "From the moment I first set foot on this world ten thousand years ago, I have been aware of the distant glare of their life.",
    "That has changed. The rhythm of their being... they do not have blood, but if it helps, you could imagine it as a pulse - it has quickened.",
    "No. Not yet. Kerapac's device was not active for long enough to damage them, but it has...",
    "Agitated them.",
    "I do not believe there to be any immediate danger, which is why I haven't informed the council.",
    "I cannot be sure, but I believe that another disruption as powerful as the last could wake them.",
    "It is good that you stopped the device when you did.",
    "Nothing else on Gielinor could cause such a disruption, but I thought it best that you were aware.",
    "I have asked the Curator to reward you for your efforts. You should return to him when you are done here."
  ],
  "King Roald": [
    "Thank you, Lady Seren, we are grateful for your words."
  ],
  "Zarador": [
    "Let her speak!"
  ],
  "Armadyl": [
    "What does that mean?"
  ],
  "Lord Daquarius": [
    "Of course, Lady Seren. We will gladly provide assistance if it pleases you."
  ],
  "Osman": [
    "The riches of Menaphos are at your disposal."
  ],
  "Congratulations! You have completed": [
    "'Desperate Creatures' - Complete this quest."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Desperate_Creatures?oldid=36198248’"
  ]
}