{
  "The Old School RuneScape Wiki also has an article on": [
    "osrsw:Transcript:Roving Elves"
  ],
  "Player": [
    "Hello there.",
    "...But...",
    "Grandmother?",
    "Gnomes?",
    "Was your grandmother's name Glarial?",
    "It's a bit of a long tale, but to cut the story short, her remains reside in Baxtorian's home. I thought it's where she'd want to be. It was I that removed your grandmother's ashes.",
    "Maybe I could help. What needs doing to consecrate her new tomb?",
    "I'll see what I can do.",
    "Sounds like you've got a lot to do. I'll leave you to it.",
    "I overheard someone in the pub talking about her, they talked of leaving her remains in the home of a guy called Baxtorian, under a waterfall.",
    "Sorry this holds no interest for me, good day.",
    "Hello there.",
    "Hello again.",
    "No, not yet.",
    "Ok... I'll see what she has to say.",
    "Hey there... Islwyn said you may be able to help me. He told me you know how to consecrate ground for an elven burial. I need to reconsecrate Glarial's resting place.",
    "Okay, I'll be back as soon as I have it.",
    "Hello.",
    "No, not yet.",
    "Okay. I'll see what I can do.",
    "Hello again.",
    "Yes, she told me I must retrieve a crystal seed from Glarial's old tomb.",
    "Hello again.",
    "Yes, she told me I must retrieve a crystal seed from Glarial's old tomb. Which I have right here.",
    "OK... Will do.",
    "Hello.",
    "Yes, I have it here.",
    "How odd. I can see her lips moving, but there's no sound.",
    "Okay.",
    "Hello there.",
    "Indeed I have, all I need to do now is plant it.",
    "Hello.",
    "No, not yet.",
    "Well I'll go finish the job then. See you later.",
    "Hello. I lost the crystal seed.",
    "How odd. I can see her lips moving, but there's no sound.",
    "Hello.",
    "Yes, it's done.",
    "Hello Islwyn...",
    "How did you know that I had consecrated the tomb?",
    "Revert to seed? What do you mean?",
    "Shields are for wimps! Give me the bow!",
    "I don't like running and hiding behind mushrooms. Shield please!",
    "Hi there.",
    "It was a worthy deed."
  ],
  "Islwyn": [
    "Leave me be, I have no time for easterners. Between your lot and them gnomes, all you do is take and destroy. No thought for others.",
    "Save your excuses young one! It was one of your species that disturbed my grandmother's remains. Will she never get the peace she deserves?",
    "Yes! Someone took her ashes from her tomb. If it wasn't for them gnomes she'd have been left in peace. But now I can sense her restlessness.",
    "Yes gnomes! One of those little pests took the key to my grandmother's tomb. He must've given it to the human that desecrated the tomb.",
    "Yes... How did you know that?",
    "You've been in grandfather's home? That's where we originally wanted to leave Glarial's ashes to rest, but we could not understand how to enter. This is gravely concerning... Her resting place must be consecrated.",
    "Are you offering to help?!? Maybe not all humans are as bad as I thought. I don't know the consecration process. You should speak with Eluned... she is wise in the ways of the ritual.",
    "Really... Grandfather's home? That's where we wanted to leave Glarial's ashes to rest, but we could never work out how to enter... This is no good... Her resting place must be consecrated.",
    "Tell me again, what do you know of grandmother's remains?",
    "Good day. Have you spoken to Eluned yet?",
    "She may be able to help with the consecration of grandmother's new resting place.",
    "Good day. Have you spoken to Eluned yet?",
    "Well I wish I could help but the east lands are no place for my kind.",
    "Good day. Have you spoken to Eluned yet?",
    "Good, you should go and show it to her.",
    "Good day. I hear you managed to retrieve the crystal seed.",
    "This is good to hear. Soon I will be able to sleep without my dreams plaguing me in the woken world.",
    "You have returned! Thank you for all you have done. Now both me and my grandmother can rest in peace.",
    "Her restlessness has finally left me. Here - I should give you something for your effort.",
    "Crystal equipment is at its best when it's new and fully charged. These I'm offering you only have a little charge left before they'll revert to seed.",
    "Ah, young one. It was thousands of years before we fully understood that ourselves. All will be explained if we feel you are ready. Now which one of these crystal creations would you like?",
    "Oh, you don't have space to take it. Make some room and talk to me again.",
    "Alright. If you ever need a replacement I can sell you another."
  ],
  "Eluned": [
    "That I do... It is elven tradition to plant a specially enchanted crystal seed at the graves of our ancestors. The seed will create guardians to protect the area. Unfortunately, the crystal seed must be attuned to the person it's protecting. A new seed won't do, but you should be able to recover the seed from her old tomb. The tomb's guardian will be protecting the seed, you'll need to defeat him to get it. Once you have it, return here and I will re-enchant it.",
    "Hello. Any luck finding the consecration seed?",
    "Well, bring it here as soon as you find it, then I can re- enchant it.",
    "Hello. Any luck finding the consecration seed?",
    "[sic]",
    "Plant this seed in Glarial's new tomb close to her remains and she will rest in peace.",
    "Hey, how's it going? Have you managed to reconsecrate Glarial's resting place?",
    "I'm sure her family will appreciate your effort. Plant the seed in Glarial's new tomb close to her remains and she will rest in peace.",
    "Not to worry. Now I know the harmonic of Glarial's crystal I can reproduce another one.",
    "[sic]",
    "Plant this seed in Glarial's new tomb close to her remains and she will rest in peace.",
    "Hey, how's it going? Have you managed to reconsecrate Glarial's resting place?",
    "Well done! You should go see Islwyn, but I'd guess he already knows.",
    "Hi! I hear you finished consecrating Glarial's tomb. Well done."
  ],
  "Congratulations! You have completed": [
    "'Roving Elves' - Complete this quest."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Roving_Elves?oldid=36196471’"
  ]
}