{
  "TzHaar-Mej-Ak": [
    "Welcome, Yt'Haar.",
    "TzHaar live a long time, but all die and become TokKul. Now each TzHaar's egg is born as Ga'al, without TzHaar memories, without TzHaar strength.",
    "We want you to lead the expedition into the Elder Kiln, and resurrect greatest TzHaar champions. Will you aid us?",
    "Why do you hesitate, Yt'Haar? It is a good thing that you have done. Now, Ga'al can live with TzHaar, and serve a useful purpose.",
    "TzHaar-Mej-Gek is the obvious choice. He was the greatest of our caste, and much knowledge of our ancient magic was lost in his passing.",
    "Agreed. Their endurance in the Fight Pit was legendary, and since their return to stone, neither caste has equaled their technique.",
    "During your search of the city, round up three Ga'al and send them to this plaza. They shall have the honour of bearing the memories of our lost champions.",
    "We still require the TokKul of three TzHaar champions.",
    "Ga'al are weak, and cannot do their duty - we send them to the Fight Pits for an honourable death.",
    "You shall now be know as 'Yt'Haar' wherever you go.",
    "Your title has been removed.",
    "I am TzHaar-Mej-Ak - we met at Birthing Pool. I am one of the elders of the TzHaar City.",
    "No, no. TzHaar have no leader. All TzHaar equal[sic], all TzHaar have their role. No need for leaders.",
    "I guide the TzHaar when there's change. TzHaar do not like change. If it were up to us, we would not allow it.",
    "But, sometimes, the world changes, and we must think how TzHaar must react.",
    "We use TokKul like you use gold. Only TokKul is the remainds of dead TzHaar.",
    "Not rock! Dead TzHaar! Trapped in each TokKul is dead TzHaar's memory. That's what make[sic] it sacred to us.",
    "If you[sic] in the mood to kill, you could go[sic] Fight Pit or Fight Cave. They both to the south-west[sic]. If you interested in TzHaar history, go west to library[sic]. Or maybe you visit shops for top quality TzHaar goods.",
    "When TzHaar die, our bodies compress into small smooth discs of obsidian called TokKul.",
    "You were able to fuse the memories in the TokKul with Ga'al-Xox, and give him purpose and power.",
    "Ga'al-Xox is new to this world. He now bears the memories of a thousand lifetimes. He is suffering through a great trial of transformation.",
    "He will endure, and emerge strengthened from his ordeal. He will learn that this is necessary.",
    "Ga'al-Xox endured a great pain in reforging, but that pain shall pass.",
    "It is far from cruel to a TzHaar. Each TzHaar must do their duty.",
    "A TzHaar with not purpose, and no memories to carry it out, cannot have honour. A TzHaar with no honour has no reason to exist.",
    "We still require the TokKul of two TzHaar champions.",
    "We still require the TokKul of two TzHaar champions.",
    "We still require the TokKul of TzHaar-Xil-Kal.",
    "TokKul must be whole. Yt'Haar must melt fragments and reforge champion's TokKul. Lava furnace is to south-east.",
    "We still require the TokKul of TzHaar-Xil-Kal.",
    "We still require three Ga'al to bear the memories of our great champions.",
    "We still require <#> more Ga'al to bear the memories of our great champions.",
    "You have done well, Yt'Haar. We are ready to enter the Elder Kiln. We shall meet you at the entrance.",
    "You are... TokHaar-Hok? Ga'al-Xox spoke of you. You speak for the TokHaar?",
    "I fear losing the TokKul of our fallen champions. What do you think we should do, Yt'Haar?",
    "Agreed. Should these Ga'al perish, there are many more available. Ga'al will likely consider it a merciful alternative to death in the Fight Pit.",
    "Yes, transformation of Ga'al-Xox was successful. These creatures shall follow his wake.",
    "Ga'al are aberrations – no place in TzHaar City. The Elder Kiln shall bestow value upon Ga'al by bearing the memories of their ancestors.",
    "And what then, JalYt? Shall TzHaar wait until last of us has perished - until none remain but the Ga'al? An alliance with the TokHaar is crucial to bestowing worth upon these weak, low creatures.",
    "Release! I am... free...",
    "No... how can this be? I am in the body of a... Ga'al!",
    "Please... Release me from this torment. Let me die. I beg you.",
    "I never died! All of us... every TzHaar who has ever lived... we suffer in agony. The pressure... the pain...",
    "Release us... dissolve our remains in the sacred lava. We call out to you from our obsidian prisons, but you cannot hear our silent screams.",
    "Thank... You...",
    "Let me die... please..."
  ],
  "TzHaar-Mej-Jeh": [
    "It is good that you have returned. We require your assistance.",
    "Our race is dying. No egg has hatched as TzHaar since you and Ga'al-Xox journeyed to the Kiln. Only Ga'al.",
    "We must take action. We must send more Ga'al to the Kiln. As you cleared the way, it should be safe for them now.",
    "Excellent. First, we must choose which of our fallen legends shall live on within the body of a Ga'al.",
    "I also nominate TzHaar-Ket-Teg, and the great hunter, TzHaar-Xil-Kal.",
    "Yt'Haar, this communication orb will help you locate the TokKul of our great champions. Recover their TokKul by any means necessary, and bring it to us.",
    "Finally, the Ga'al shall have value and purpose.",
    "Yt'Haar, this communication orb will help you locate the TokKul of TzHaar's great champions. Recover their TokKul whatever the cost, and bring it to us.",
    "Do you not recall your journey to the Elder Kiln with Ga'al-Xox? Do you not remember how we found a use for the Ga'al?",
    "Very well. TzHaar reproduce by laying eggs. We pass on our memories to our child through the egg.",
    "Our volcano city is becoming too cold to grow healthy eggs. They die before hatching, or are born as Ga'al - empty creatures with no memories.",
    "You helped me find a way to give Ga'al memories. It is old magic - dangerous. The power of the Elder Kiln, the font of creation, where the TokHaar dwell.",
    "You returned with Ga'al-Xox. The TokHaar had changed him, merged him the TokKul of TzHaar-Ket-Yit'tal, a mighty Fight Pit champion.",
    "You want to know more about TokKul-Zo?",
    "This ring has a piece of TokKul in it. When worn, it will guide your hand and make you better when fighting TzHaar, fire creatures and maybe even TokHaar.",
    "My magic taps into the memories in the ring, so you better[sic] at fighting like a TzHaar.",
    "The magic will fade after time. When this happens, return to me and I will recharge it for you...for a price.",
    "50,000 TokKul for a full recharge. Normally I would do it for free, but we need all the TokKul we can get, as we will soon be sending more Ga'al to the Kiln.",
    "Why do you feel bad?",
    "Spending the TokKul in shops means we have more TokKul to send to the Elder Kiln. TokKul has always been currency; this will not change.",
    "This ring is already fully charged. Don't waste your TokKul on it.",
    "Now we have the means to save our race from extinction. We will take TokKul and Ga'al to the Kiln, and TzHaar will live on in the bodies of Ga'al.",
    "We understand your reluctance, but this is the only way to restore the lost memories of fallen TzHaar.",
    "Our eggs do not work. If we do not do this, the TzHaar will be no more.",
    "It is cruel to leave TzHaar trapped in TokKul. We must free them!",
    "To bear TzHaar memories is to become TzHaar, become strong. These Ga'al cannot survive on their own.",
    "Excellent. You can hear me. I enchanted the orb with divination magic. We can use it to keep in contact.",
    "The spell's range is limited. You will not be able to contact me beyond the city's bounds.",
    "Within the orb is a small fragment of each of the missing champions. It is all we have been able to find.",
    "The orb will seek out the rest of the TokKul, reacting as you draw closer.",
    "Which champions' TokKul do you wish to seek first?",
    "Well done. You found the TokKul of TzHaar-Mej-Gek. Bring it to us in the plaza when you are ready.",
    "You have found the TokKul of TzHaar-Mej-Gek. Do you wish to search for a different target?",
    "Is it cold in here, or is it just me, TzHaar-Mej-Ak?",
    "Thank you, Yt'Haar.",
    "Thank you, but we already have the TokKul of TzHaar-Mej-Gek. Jeh: Do you wish to search for a different target?",
    "Well done, but TokKul must be whole. Melt fragments and reforge champion's TokKul in the lava furnace in south-east plaza.",
    "You have already found enough fragments of the TokKul of TzHaar-Ket-Teg to reforge him. Do you wish to search for a different target?",
    "TokKul must be whole. Yt'Haar must melt fragments and reforge champion's TokKul. Lava furnace is to south-east.",
    "Excellent. The TokKul is made whole. Bring it to us in the plaza when you are ready.",
    "You have found the TokKul of TzHaar-Ket-Teg. Do you wish to search for a different target?",
    "Thank you, Yt'Haar.",
    "Thank you, but we already have the TokKul of TzHaar-Ket-Teg. Do you wish to search for a different target?",
    "You must reforge the fragments in a lava furnace. There is one in the south-east plaza.",
    "Excellent. The TokKul is made whole. Bring it to us in the plaza when you are ready.",
    "Thank you, Yt'Haar.",
    "You have found all of the TokKul. Well done! Do you wish to search for a different target?",
    "You have found all of the TokKul. Well done! Do you wish to search for a different target?",
    "You have found all of the TokKul and enough Ga'al. Well done! Return to us in the plaza.",
    "Join you? No. We wish you to fuse the TokKul of our greatest champions with these Ga'al, as you did to Ga'al-Xox.",
    "Ga'al-Xox! What have you done? You have slain TzHaar-Mej-Ak on sacred ground!",
    "We do this to save the TzHaar from extinction, Ga'al-Xox. The TokKul of our ancestors shall-",
    "Pursue him, Yt'Haar. Use the communication orb to track down Ga'al-Xox. You must recover our champions' TokKul.",
    "Hurry, Yt'Haar. Pursue Ga'al-Xox, before he escapes with precious TokKul!",
    "You want to know more about TokKul-Zo? At a time like this?",
    "I sense the TokKul is directly ahead of you. Proceed north.",
    "Hurry. The trail is fading. Ga'al-Xox is fleeing at speed.",
    "The defensive wards have activated! Defeat these monsters. The gate mechanism will not function until the summoning sigils have deactivated.",
    "The gate appears to be sealed by a scale lock, similar to the one you encountered during your journey to the Elder Kiln.",
    "That gate required a tithe of TokJul. Perhaps this gate will yield to a different object...",
    "The architecture of this tunnel strongly resembles that of the caves leading to the Elder Kiln.",
    "Ga'al-Xox no doubt sealed the gate to slow your progress. Do not let him get away!",
    "Do you see that shelf of reading orbs near the gate? They may yield valuable information.",
    "Hurry, Yt'Haar. Pursue Ga'al-Xox, before he escapes with precious TokKul!",
    "The script on these reading orbs is ancient. The elements have worn away much of the original text.",
    "You have found an account of one of the first TzHaar to depart the Elder Kiln!",
    "According to the text, this tunnel is part of the original network they carved while seeking out a new home.",
    "The tunnel connects TzHaar City to something called the TzKot-Zo... a ring of living fire.",
    "Odd. I have no memory of this tunnel, or the TzKot-Zo.",
    "The gate mechanism requires that the statues are aligned in a particular orientation. Which caste is most effective against another?",
    "Well done. The gate is open. Pursue Ga'al-Xox before he escapes with the TokKul!",
    "Well done. The gate is open. Do not tarry. Pursue Ga'al-Xox before he escapes with the TokKul!",
    "Blast! Ga'al-Xox eluded us. Search the chamber for a way to open that gate.",
    "One of these reading orbs contains the record of a TzHaar-Hur architect. There is more information about the TzKot-Zo.",
    "He describes the TzKot-Zo as a circular conduit of lava. Both ends connect to the Elder Kiln, and sacred lava flows through the conduit in a clockwise direction.",
    "The TzHaar did not create this lava conduit – nor did the TokHaar. It is part of the ancient Kiln.",
    "The function of the lava conduit is to cycle the flow of sacred lava through the Elder Kiln, maintaining its temperature, purity, and fluidity.",
    "The crucible of lava in this room is a node of the conduit.",
    "These crucibles collect boiling lava until it overflows into a drainage canal.",
    "The conduit then carries the sacred lava into the next node in the circulatory system, until the treated lava is returned to the Elder Kiln.",
    "According to the schematics, sacred lava should be pouring from the statue head into the crucible.",
    "Perhaps we will find the cause of the blockage at the mouth of the conduit.",
    "The architecture of this chamber is unlike any I have seen outside the ancient Kiln!",
    "This is... sacred lava, from the Kiln! The TokHaar awaken. Defend yourself!",
    "The TokHaar arose from the residual sacred lava. They require the lava to construct a material form. Defeat them, and you will deplete the supply in the crucible.",
    "You fought well, Yt'Haar. Recover the champion's maul. It may be useful in your journey.",
    "The scale near the gate no doubt requires an object, like the other mechanisms.",
    "Do not tarry here. Pursue Ga'al-Xox!",
    "More blasted tunnels. They must go on for miles.",
    "The statues are a new addition. They must yield a valuable clue...",
    "Hurry. Venture deeper into the tunnel, and apprehend Ga'al-Xox.",
    "Hurry. Venture deeper into the tunnel, and apprehend Ga'al-Xox.",
    "Do you see that shelf of reading orbs near the gate? They may yield valuable information.",
    "Strange! These orbs are a collection of funeral rites.",
    "They are comforting words to be spoken over TokKul cast into the sacred lava, to ease the passing of TzHaar who have returned to stone.",
    "This makes no sense. If our ancestors melted down their dead in this way, how is it that we have inherited no memories of this ritual?",
    "Proceed with haste. Ga'al-Xox is getting away!",
    "This must be another node in the lava conduit. At this rate, we will soon reach the source...",
    "Do you see that shelf of reading orbs near the gate? They may yield valuable information.",
    "This document explains why we have encountered such strong defences en route to the mouth of the lava conduit.",
    "The ancient TzHaar vigilantly protected the conduit from outsiders, employing magical traps and wards.",
    "They were greatly concerned that the TokHaar might sabotage the source of the city's heat.",
    "They established my city in the cradle of the lava conduit, where they could remain outside of the ancient Elder Kiln, but still depend upon its heat to incubate TzHaar eggs.",
    "In the first centuries of establishing the city, there are frequent accounts of security patrols, and the tunnels were well maintained.",
    "The logs decrease in frequency over the passing years, until they cease altogether.",
    "How have the TzHaar forgotten such an important part of our history?",
    "This must be another node in the lava conduit. At this rate, we will soon reach the source...",
    "This crucible contains more sacred lava than the last chamber. Prepare to endure a longer battle!",
    "Well done. You vanquish the TokHaar that lingered here. Continune on your journey!",
    "My divination spell fades as you proceed deeper into the tunnel. I fear we shall not maintain contact for much longer.",
    "My divination spell fades as you proceed deeper into the tunnel. I fear we shall not maintain contact for much longer. I sense that Ga'al-Xox is close. Apprehend him, and recover the precious TokKul. He must be made to answer for his crimes...",
    "I cannot...divine your...location...too far...magic...weakening...",
    "Yt'Haar! Nurturing heat is pouring into the TzHaar City. TzHaar-Mej at birthing pool report that eggs are growing into healthy TzHaar. Is this your doing?",
    "TzHaar owe you great debt. What of Ga'al-Xox? Is he ready to answer for his crimes?",
    "Very well. I shall meet you in the Elder Kiln. I have many questions for TokHaar-Hok.",
    "I shall meet you in the Elder Kiln, Yt'Haar.",
    "Of course. The Ga'al are now a precious, finite resource. We promise to no longer sentence the Ga'al to death in the Fight Pit. They are too valuable as living vessels for our lost ancestors.",
    "When the last Ga'al has been put to profitable use, the TzHaar can put this worrisome time of change behind us.",
    "JalYt, do you agree to these terms?",
    "TzHaar-Mej-Ak... Does the Ga'al speak the truth? Are you back from the dead? Or are you only a memory?",
    "Yes! I shall do as you ask. We cannot use the trapped souls of our dead as currency.",
    "Though change does not come easily to the TzHaar, for the sake of our ancestors we must forge a different path.",
    "I solemnly vow to you - to both of you - that the TzHaar shall take responsibility for nurturing and training the Ga'al.",
    "We shall teach them the TzHaar language. We shall teach them our ways; of combat; of honour. The Ga'al will forge their own destinies.",
    "Fellow TzHaar... We have gathered this day to celebrate...",
    "...to honour deeds of this JalYt. This human, this outside has fought back against those that would threaten TzHaar society.",
    "(S)He has protected TzHaar with unceasing courage and boundless ingenuity.",
    "For long time, TzHaar have suffered terrible change. Our city has cooled, our previous eggs have died, or born different. TzHaar did not know why. TzHaar did not act until it was too late.",
    "JalYt took action. JalYt discovered threat at heart of our volcano home. Discovered old TzHaar, the TokHaar, that live in sacred Kiln.",
    "JalYt discovered plot to destroy TzHaar. JalYt discovered cause of birth of Ga'al.",
    "JalYt fought the TokHaar back to their Kiln. JalYt restored heat to TzHaar City. JalYt has proven (s)he is far more than mere JalYt.",
    "Henceforth, this JalYt is not outside. He shall henceforth be known as TzHaar-<Player>. Treat him/her as you would any TzHaar. Honour this great warrior, defender of TzHaar."
  ],
  "Player": [
    "Not right now.",
    "How does it do that?",
    "What's your price?",
    "Well, now that I know the TzHaar trapped in TokKul are in pain, it doesn't feel right.",
    "So, you're like a leader?",
    "So, what's your role?",
    "No, no. I don't want just any TokKul. I seek the TokKul of TzHaar-Mej-Gek.",
    "I'm not here to steal anything. I seek the TokKul of TzHaar-Mej-Gek.",
    "Your eggs are of no value to me. I seek the TokKul of TzHaar-Mej-Gek.",
    "No, no. I don't want just any TokKul. I seek the TokKul of TzHaar-Mej-Gek.",
    "What are you doing here?",
    "Are these all TzHaar eggs?",
    "I wouldn't steal your eggs!",
    "Fine.",
    "I need you to go to the plaza, Ga'al.",
    "What did TokHaar-Hok want you to do?",
    "On the count of three...",
    "One...",
    "Two...",
    "Ga'al Xox asked me to bring you to the Elder Kiln. He wishes to make amends.",
    "Ga'al-Xox? Are you still... What happened?",
    "The Ga'al are capable of learning new skills. Ga'al-Xox taught himself to speak by watching and learning.",
    "Think what more the Ga'al could learn in a nurturing environment.",
    "The Ga'al are capable of invention and ingenuity, given sufficient education.",
    "The TzHaar know only what is passed down from their ancestors. They have forgotten how to discover new ideas for themselves.",
    "Ga'al-Xox has fought by my side. He has battled you, and your kind.",
    "He has TzHaar-Ket-Yit'tal's memories, yes, but he has also learned from me, and from watching other TzHaar and surfacers fight. He has developed his own fighting style, and any Ga'al has the same potential.",
    "The Ga'al can flourish in cold environments, such as the surface world. They have the potential to leave TzHaar City, and open up diplomatic relations and trade routes.",
    "They could be your ambassadors."
  ],
  "Option 1": [
    "Why is it necessary to convert the Ga'al?",
    "Remind me.",
    "What does it do?",
    "I feel bad about using TokKul as currency now.",
    "Claim Yt'Haar title.",
    "Who are you?",
    "You use rocks as currency?",
    "But Ga'al-Xox returned in terrible pain!",
    "TokKul of TzHaar-Mej-Gek.",
    "Cold? You're standing next to a pool of lava!",
    "Wait. I seek the TokKul of TzHaar-Mej-Gek.",
    "That's the TokKul I'm looking for!",
    "What do you know about the Ga'al?",
    "You can trust me. I saved your city.",
    "Yes, the plaza. Quickly, please.",
    "We have to take the risk. Reforge the Ga'al in the Kiln.",
    "About this ring...",
    "Hand over the TokKul, Ga'al-Xox.",
    "Why did you run from me?",
    "The TzHaar will never allow it.",
    "I can't wait to battle the TokHaar.",
    "I can't wait to battle the TokHaar.",
    "They can learn."
  ],
  "Option 2": [
    "I remember.",
    "About this ring...",
    "Okay.",
    "Can you recharge it?",
    "Clear current title.",
    "What's TokKul?",
    "I see.",
    "Fusing your dead into the Ga'al is cruel and barbaric.",
    "TokKul of TzHaar-Key-Teg.",
    "TzHaar-Mej-Jeh's orb seems to recognise the TokKul.",
    "Wait. I require TokKul.",
    "I'm not here to steal anything.",
    "Who are you guarding them from?",
    "Fair enough.",
    "Go to the plaza. You'll be safe there.",
    "Ga'al-Xox survived. Hopefully these Ga'al will too. Proceed.",
    "I'd like to talk about titles.",
    "Ga'al-Xox! What are you doing?",
    "How did you know of this place?",
    "It will take more than words to convince the TzHaar-Mej.",
    "As long as it's not a waste of my time.",
    "As long as it's not a waste of my time.",
    "They can invent."
  ],
  "Option 3": [
    "I want to know what you hope to achieve.",
    "Let's talk about something else.",
    "I'd like to talk about titles.",
    "Leave.",
    "What's there to do here?",
    "Yes, this will give the Ga'al a meaningful purpose in TzHaar society.",
    "TokKul of TzhHaar-Xil-Kal.",
    "That's the TokKul of TzHaar-Mej-Gek. Give it to me.",
    "Your eggs are of no value to me.",
    "I'll be off then.",
    "You. Plaza. Now.",
    "This is wrong. The TzHaar would sacrifice the Ga'al for your own needs.",
    "Goodbye.",
    "You would not believe what I had to go through to find you...",
    "How do you feel about having killed TzHaar-Mej-Ak?",
    "Melt down the TokKul? Are you insane?",
    "I will consider it.",
    "I will consider it.",
    "They can fight."
  ],
  "Option 4": [
    "I have to be going.",
    "I'd like to talk about something else.",
    "I'll be going now.",
    "I only do this to rescue your dead from suffering in TokKul.",
    "Nearest Ga'al.",
    "I require TokKul.",
    "I don't trust TokHaar-Hok. We should return to the city.",
    "Why are you so opposed to the TzHaar?",
    "They can travel."
  ],
  "Note": [
    "Selecting any of the options causes the 2nd dialogue select to never appear again"
  ],
  "Option 5": [
    "I've heard enough...",
    "We should not return to the Elder Kiln. I don't trust the TokHaar.",
    "No.",
    "Farewell."
  ],
  "TzHaar-Mej-Het": [
    "The egg hatches. I hope this one will...",
    "Another Ga'al!",
    "Throw it in the Fight Pit with the others.",
    "I bombarded TzHaar-Xil-Ryl's egg with fire spells to battle the chill wind... I stood vigil. I nurtured his egg.",
    "Now all the memories that he carried through the centuries will die with him.",
    "TzHaar-Mej-Het's joints are freezing. TzHaar City not usually so cold.",
    "A JalYt. Your kind do not often stray near our birthing pools. Most fight in pit, cave, or kiln.",
    "If you are here to steal our eggs, turn back or perish.",
    "TzHaar City grows colder every day. Lava cools. More dead eggs in every batch. I heat the lava with magic. Does not help, but must try.",
    "JalYt distracts TzHaar-Mej-Het. Must tend to eggs... Must do my duty.",
    "TzHaar-Mej-Het helped a JalYt mage - charged his staff. JalYt gave TokKul. TzHaar-Mej-Het does not know why.",
    "Why do you want TokKul? TokKul is body of TzHaar ancestor.",
    "Never mind. Take TokKul. TzHaar-Mej-Het must tend to eggs. Must fight cold. More dead eggs in every batch.",
    "Bank is west of plaza...",
    "Bank is west of plaza...",
    "Why do you bother TzHaar-Mej-Het? Must tend to eggs. Must fight the cold.",
    "TzHaar City grows colder every day. I heat the eggs with magic, but lava pool too cold.",
    "TzHaar-Mej-Het does duty, but it is not enough. Eggs born dead, or hatch Ga'al.",
    "TzHaar-Mej-Het found TokKul. Did you drop it, JalYt?",
    "You have no room for TokKul of TozHaar-Mej-Gek, JalYt. You need to make room.",
    "TzHaar-Mej-Het found TokKul. Did you drop it, JalYt?"
  ],
  "TzHaar-Ket": [
    "Guarding eggs, Yt'Haar-Mej-<player>.",
    "Yes, TzHaar born from eggs work in this part of the city.",
    "Ga'al born from weak eggs and no memory. Ga'al not to be trusted.",
    "Lava creatures eat our eggs, TokTz-Ket-Dill crush them and JaylYt like you steal them for JalYt magic.",
    "JalYt have before. TzHaar-Ket must watch you carefully.",
    "Yes but[sic] you still JalYt."
  ],
  "Ga'al": [
    "Huh-guh?/Nguh?/Yuh?/Yuh? Nguh.",
    "Guh!/Huh-guh?/Yuh-guh?"
  ],
  "TokHaar-Hok": [
    "So, our wayward breathren have finally returned.",
    "Yes. We have adopted a form convenient for communicating with non-TokHaar.",
    "Are you ready to join us in the sacred lava, as our masters intended?",
    "Ah, yes. How is my little Ga'al?",
    "He lingers sometimes on the periphery between our Kiln and your wretched city. He seems to...regret his transformation.",
    "It will not work, TzHaar. These Ga'al... are too weak. Your greatest champions shall return to the sacred lava and become TokHaar. But you may proceed, if you wish.",
    "My little Ga'al. You disappoint us.",
    "You should not have drawn attention to the lava conduit. We sealed this chamber for good reason.",
    "If it is a fight you want, then a fight you shall have. We have longed for an opportunity to test this great human's mettle.",
    "Let battle commence.",
    "You have... bested us, human. You are truly a worthy adversary.",
    "We shall withdraw to the Elder Kiln...",
    "Welcome, human. You fought with great vigour and skill. It was an honour to spar with you.",
    "We learned much of your technique. We are eager to learn more.",
    "I shall forge this Ga'al a second time, on one condition...",
    "My minions shall evermore engage in glorious battle with this human, this surface dweller who vanquished us in combat.",
    "We shall learn this technique, hone our skills, and probe his defences for weakness.",
    "Excellent. There is much the TokHaar can learn from you, human.",
    "Now, TzHaar, witness the fate that awaits those that live outside the Elder Kiln.",
    "Are you ready to proceed, human? Do you agree to return to the arena where we fought, and do battle among our kind, from time to time?",
    "This Ga'al is far stronger than we had anticipated. To endure the forging not once, but twice...if only the aberrant TzHaar shared such strength of will.",
    "You have proven your point, my little Ga'al. You have suffered a long time for your ideals.",
    "Do you wish to return to the sacred lava? We can finally... end your suffering.",
    "Bah! Give me one reason that the Ga'al are worth saving."
  ],
  "Ga'al-Xox": [
    "'Sacred'? How dare you hide behind sanctimony... you who torture the innocent for your own selfish aims.",
    "No. No Ga'al shall endure the suffering you forced upon me, as long as I am alive to protect them.",
    "Wait! Let me explain...",
    "This outlet is the mouth of a circulation conduit intended to channel the sacred lava from the Kiln around the TzHaar City.",
    "The TokHaar shut off the conduit, and are responsible for the cooling of the volcano.",
    "Without the heat from the Kiln, TzHaar eggs cannot be incubated, and are born as Ga'al.",
    "If we can get the lava flowing again, the city will be hot enough for TzHaar eggs to be born healthy.",
    "Please, help me activate the mechanism.",
    "Wait! Let me explain...",
    "Please, help me activate the mechanism. I can't turn both of these valves without your help.",
    "I was... afraid. TzHaar do not attack TzHaar. I knew I would be destroyed for my crimes, and then none would remain to protect the Ga'al.",
    "So, I fled to the one place, other than the Kiln, where I might be able to access the sacred lava.",
    "Here, I can melt down this TokKul, and release the trapped TzHaar from their torment.",
    "TokHaar-Hok confided in me... he told me of the lava conduit, and how the TokHaar installed these valves to prevent the lava from flowing. He hoped to secure my aid.",
    "Nothing. He simply wanted to ensure I did not prevent the TzHaar from entering the Kiln.",
    "He told me to be patient, and await the end of the TzHaar. Then the Ga'al would be free to live their own lives.",
    "Ga'al are not TokHaar. We cannot afford the patience of immortality. Our immediate lives are threatened by the TzHaar. I had to defend my people.",
    "I regret my actions. Passion took hold of me, and I could not control my rage.",
    "TzHaar-Mej-Ak spoke of the Ga'al with such disregard... he was determined to force the suffering of TokKul upon them.",
    "I cannot bear the memory of the agony... to inflict such torture upon a voiceless innocent is abhorrent.",
    "So, I stopped him... the only way I could.",
    "Now, he knows the crushing agony of being trapped in TokKul...",
    "Please, help me release him from his suffering.",
    "I am not entirely opposed to the TzHaar... I only wish that they could see the Ga'al as more than aberrations, or disposable tools.",
    "I have to protect the Ga'al, until they are capable of protecting themselves.",
    "Perhaps if we turned both valves at the same time?",
    "What have I done? When we re-activated the lava flow, we released TokHaar-Hok from the Elder Kiln!",
    "You did it! You defeated TokHaar-Hok.",
    "You did it! You defeated TokHaar-Hok. The sacred lava is once again flowing from the Kiln. Soon, the city will be bathed in scorching heat.",
    "The TokKul... we must dissolve the TokKul in the sacred lava. It's the only way to release the suffering dead from their torment.",
    "The only way the TzHaar can understanding the suffering of the TokKul is to experience it for themselves.",
    "I know what must be done. Contact TzHaar-Mej-Jeh, and convince him to meet us in the Elder Kiln.",
    "Hurry, convince TzHaar-Mej-Jeh to meet us in the Elder Kiln.",
    "Can you believe this? After all that we have endured, TzHaar-Mej-Jeh still wishes to reforge the Ga'al as hosts for their dead TzHaar.",
    "Why must the TzHaar be so stubborn? You will not listen to me. You will not listen to TzHaar-Ket-Yit'tal, whose memories of the crushing torment of TokKul live inside me.",
    "Will you listen to TzHaar-Mej-Ak? Will you listen to one of your own caste, the TzHaar that died by my hand?",
    "I share your reluctance. The memory of TzHaar-Ket-Yit'tal's ordeal in TokKul is already more than I can bear. To experience TzHaar-Mej-Ak's suffering may utterly destroy me.",
    "I'm here. Barely. The pain... TzHaar-Mej-Ak has... suffered so...",
    "Are you... ...finally... ...convinced?",
    "But what of the...",
    "Hush.",
    "But what will become of the Ga'al? I long for relief, but... My work is... not yet finished.",
    "Thank you, TzHaar-Mej-Jeh. I am ready... to die.",
    "Before I... go... I want to thank you, human.",
    "You nurtured me where others thought me worthless. You fought for my kind, and I have learned much from you.",
    "The TzHaar have much to learn from humanity... of compassion, of respect. There are other ways to vanquish an enemy than by blade, mace, or staff.",
    "Whatever awaits us in the next life, beyond the confines of stone or flesh, I hope that we shall meet again. Goodbye, my friend."
  ],
  "Next area": [
    "Cutscene shows Xox heading through another gate."
  ],
  "(Audio": [
    "\"I cannot divine your present location. You have gone too far away. My magic is weakening. I can no longer help you.\")"
  ],
  "Your title has been changed to": [
    "TzHaar."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:The_Brink_of_Extinction?oldid=36068836’"
  ]
}