{
  "Player": [
    "Hello.",
    "Are you ok?",
    "Take care old monk.",
    "Hello there. What's wrong?",
    "Why can't you sleep?",
    "I suppose that's what kids do.",
    "Why would they steal a kid's blanket?",
    "Can I help at all?",
    "Do you know where the thieves went?",
    "Good luck finding the blanket.",
    "Sorry, I'm too busy to hear your problems!",
    "Hello.",
    "I'm afraid not.",
    "Yes! I've recovered it from the clutches of the evil thieves!",
    "Is there anything else I can help with?",
    "Oh! What party?",
    "Farewell!",
    "Hello, how are you?",
    "Ooh! What party?",
    "That's sweet!",
    "Who's Brother Cedric?",
    "I've got no time for that, sorry.",
    "Where should I look?",
    "Ok, I'll go and find him.",
    "' Can I come to the party?",
    "Enjoy it! I'll see you soon!",
    "Hello brother Omad.",
    "Not yet.",
    "Brother Cedric are you okay?",
    "Brother Omad needs the wine for the party.",
    "Are you okay?",
    "I'll see if I can get some.",
    "Hello brother Omad.",
    "Yes I've seen him, he's a bit drunk!",
    "Are you okay?",
    "Cedric! Here, drink! I have some water.",
    "No, I've helped enough monks today!",
    "Yes, I'd be happy to!",
    "Ok, I'll see what I can find.",
    "Hello again brother Omad.",
    "He's having a bit of trouble with his cart.",
    "Not yet, I'm afraid.",
    "Here you go!",
    "Ok! I'll see you later!",
    "Hi Omad, Brother Cedric is on his way!"
  ],
  "Brother Cedric": [
    "Honey, money, woman and wine!",
    "Yesshh...hic up...beautiful!",
    "La..di..da..hic..up!",
    "Yeesshhh, I'm very, very drunk..hic..up..",
    "Oh dear, oh dear, I knew I had to do something!",
    "Pleashh, find me a jug of water. Once I'm sober I'll 'elp you take the wine back.",
    "Hic up! Oh my head! I need a jug of water.",
    "Hic up! Oh my head! I need a jug of water.",
    "Good stuff, my head's spinning!",
    "Gulp...gulp!",
    "Aah! That's better!",
    "Now I just need to fix this cart and we can go party.",
    "Could you help?",
    "In that case I'd better drink more wine! It helps me think.",
    "Excellent, I just need some wood.",
    "Did you manage to get some wood?",
    "Did you manage to get some wood?",
    "Well done! Now I'll fix this cart. You head back to Brother Omad and tell him I'll be there soon."
  ],
  "Brother Omad": [
    "*yawn* ...oh, hello... yawn* I'm sorry! I'm just so tired! I haven't slept in a week!",
    "It's Brother Androe's son, with his constant 'Waaaaaah! Waaaaaaaah!' Androe said it's natural, but it's so annoying!",
    "He was fine, up until last week! Thieves broke in! They stole his favourite sleeping blanket!",
    "Now he won't rest until it's returned... ...and that means neither can I!",
    "Who knows? Young scallywags! You'll find hundreds of people in the marketplace, pilfering from the stalls while the owners' backs are turned.",
    "Would you? We won't be able to help you as we are peaceful men but we would be grateful for your help!",
    "They hide in a secret cave near the battlefield to the west. It's hidden under a ring of stones.",
    "Please bring back the blanket!",
    "*yawn*...oh, hello again...*yawn*",
    "Please tell me you have the blanket.",
    "I need some sleep!",
    "Really, that's excellent, well done! Maybe now I'll be able to get some sleep.",
    "I'm glad you asked, you see there's this party.",
    "Much better now I'm sleeping well! Now I can organise the party.",
    "Brother Androe's son's birthday party. He's going to be one year old!",
    "It's also a great excuse for a drink!",
    "We just need Brother Cedric to return with the wine.",
    "Cedric is a member of the order too. We sent him out three days ago to collect wine. But he didn't return!",
    "He most probably got drunk and lost in the forest!",
    "I don't suppose you could go look for him?",
    "Okay traveler, take care.",
    "Oh, he won't be far. He might've taken a wrong turn between here and Ardougne.",
    "Of course, but we need the wine first.",
    "Take care traveler. (ends conversation)",
    "Hello adventurer, have you found Brother Cedric?",
    "Well, keep looking, we need that wine!",
    "Hello adventurer, have you found Brother Cedric?",
    "Well, try your best to get him back here!",
    "Hello adventurer, where's Brother Cedric?",
    "Hmmm! Maybe you could help?",
    "Good! Good! Now we can party!",
    "I have little to repay you with, but I'd like to offer you some rune stones. But first, let's party!"
  ],
  "Monk": [
    "Peace brother",
    "*yawn*",
    "Can't wait for the party!"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Monk%27s_Friend?oldid=16604663’"
  ]
}