{
  "This page contains dialogue related to Recipe for Disaster": [
    "Freeing the Lumbridge Sage.The content below is copied verbatim from RuneScape and thus copyrighted by Jagex."
  ],
  "Player": [
    "How can I help the Lumbridge Sage?",
    "Yes, I'm sure I can make a cake.",
    "Sounds a bit weird though. What does it involve?",
    "Okay, thanks, I'll get right on it!",
    "Nah, leave him where he is.",
    "Hi, what do I have to do again to help the Lumbridge Sage?",
    "The Lumbridge Sage... I can't really remember what I did to save him.",
    "That crazy wizard at the wizards' tower? Was I not any more specific than that?",
    "Oh yeah... I remember now...",
    "Hi. I was wondering if you could help me?",
    "Well I do. I need to make something called a Cake of Guidance, and I was told that you could help me out.",
    "Erm, no, I don't think I did. I need to make that cake for the Lumbridge Sage. He's been frozen in time and needs help.",
    "Not a chocolate cake – a CAKE OF GUIDANCE.",
    "I have. So what do I need to do?",
    "What are the ingredients?",
    "So to the sane world, an egg, flour and milk. No problem, I'll be right back.",
    "...Thanks.",
    "Hi!",
    "What do I need again?",
    "Cake of guidance.",
    "I hope you know what you're doing.",
    "Hi!",
    "Yes, an egg!",
    "I can't believe you said that, so I will just pretend you didn't.",
    "Ok. Let's start!",
    "Maybe later.",
    "Erm, ok.",
    "That wasn't so bad. Now what?",
    "Dandy lino zadim!",
    "Hi!",
    "I've got some milk! Can we enchant it?",
    "Ok, I'm ready!",
    "Maybe later.",
    "Erm, ok.",
    "Now what?",
    "Skelly domy ralipo!",
    "You're making this up aren't you?",
    "Hi!",
    "I have obtained a pot of flour!",
    "Quiz me!",
    "Maybe later.",
    "Erm, ok.",
    "And that's it?",
    "Oh, of course...",
    "Spendy dum romeo!",
    "So I've enchanted all three ingredients now?",
    "Thank you.",
    "What should I be doing now?",
    "No I mean in regards to making the cake.",
    "I lost the flour!",
    "I lost the egg!",
    "Strange place to put it.",
    "I lost the milk!",
    "Thank you.",
    "I made the cake. Just need to go use it now! Thanks for your help!",
    "Who's Bill?",
    "I made the cake... but I lost it."
  ],
  "Fortuneteller": [
    "Well, what better way to help the Lumbridge Sage than a 'Cake of Guidance'. Would you like to help?",
    "Well, I'm not too familiar with the fine details, you'll have to go and speak with Traiborn in the Wizards' Tower. He'll know what you need.",
    "That's not very nice. You should have more compassion.",
    "Go have a word with Traiborn in the Wizards' Tower, he should be able to help you out with a Cake of Guidance!",
    "Good work adventurer, I've teleported them away to safety! You only have [number] council members left to protect!"
  ],
  "Cook": [
    "Oh, you told me that that crazy wizard in the wizards' tower helped you with that.",
    "No, not really. I think you might have mentioned the name Traiborn though.",
    "Did you want a reminder on any other of your brave exploits?"
  ],
  "Wizard Traiborn": [
    "You don't look like you have a problem.",
    "Mmmmm. Cake of Guidance. Yummy. Yum! Did you know they're imbued with knowledge and information itself? When eaten it will give anyone the guidance they need to get back on track. So you say you're a chef?",
    "Oh dear, it's a strange day when the Lumbridge Sage needs guidance. Don't worry, I shall help you make your chocolate cake.",
    "Make up your mind!",
    "You don't know? Deary me. You'll need to enchant three ingredients with your knowledge. Bring me the basic ingredients and I will help you with the enchantment.",
    "An eggy peggy, some floury woury and some milky wilky.",
    "Have a nice time!",
    "Brought any ingredients?",
    "I need you to bring me... An egg. A pot of flour. A bucket of milk. I will then enchant them for you so you can make your Chocolate cake!",
    "That's what I said.",
    "Of course. Take care, and don't talk to strangers!",
    "Brought any ingredients?",
    "Egg-cellent...",
    "Boo. Hiss. You're no fun. I will need your help for the enchantment – you must imbue it with knowledge itself. You must complete a quiz to enact the enchantment.",
    "OK. You will be presented with some people that you may have come across on your travels – it's up to you to recall their names. Guess three correctly without error and you will succeed in enchanting the egg.",
    "Name that person!",
    "Correct – and now the [second/third and final] character.",
    "Nope, that's not right, you'll have to start again.",
    "Okey dokey, watch out for evil cows.",
    "Congratulations!",
    "That's correct.",
    "Well, there is the case of the magic words of enchantment – repeat after me.",
    "Dandolino Zadribrim!",
    "Not quite, but it'll do. I will hold onto the Enchanted Egg for you until you need it.",
    "Brought any ingredients?",
    "Mmmm milk. By all means, you're going to have to complete a quiz first to bring forth guidance and enact the enchantment.",
    "OK. You must answer 3 general questions about our lands correctly without getting one wrong. You have as many chances as you need.",
    "Correct! Good job! [Two/One] more to go.",
    "That's not right. You'll have to start again.",
    "Okey dokey, watch out for evil cows.",
    "Correct! Well done. That's all three answered!",
    "That's correct.",
    "Repeat after me... Skalindom Ralinaplo.",
    "... Close enough. The milk has now been enchanted!",
    "How dare you! Now get the next ingredient! I will hold onto the Enchanted Milk for you until you need it.",
    "Brought any ingredients?",
    "So you want to enchant it now? You'll have to take active part by completing a little quiz to imbue the flour with knowledge and enact the enchantment.",
    "For enchanting this item you will be shown a selection of items, when you stop viewing this selection you'll have to answer three questions correctly in a row and then the flour will be enchanted with guidance.",
    "That's correct – onto the [second/third and final] set.",
    "That's not right. You'll have to start again.",
    "Okey dokey, watch out for evil cows.",
    "That's correct.",
    "You have to repeat the magic words of course!",
    "Splendidum romelno!",
    "We shall make a wizard of you yet. I will hold onto the enchanted flour for you until you need it.",
    "Indeed, best you go bake the cake! You can do it the same way as making an ordinary cake.",
    "Sleeping?",
    "Ah, bake it!",
    "Good job I have another to hand then isn't it!",
    "That's OK, I have another up my sleeve.",
    "Is it?",
    "What would you do without me? Here ya go.",
    "Wah hey! Good work Bill.",
    "Who knows!?",
    "Oopsy daisy! You'll have to make another one!"
  ],
  "v • d • eRS3 Recipe for Disaster": [
    "Freeing the Lumbridge SageA subquest of Recipe for DisasterNPCs"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Recipe_for_Disaster:_Freeing_the_Lumbridge_Sage?oldid=33950157’"
  ]
}