{
  "To start 'A Tail of Two Cats' you must have": [
    "A kitten or cat from Gertrude in Varrock."
  ],
  "Unferth": [
    "Hello, do you have a cat?",
    "Oh, hmm.",
    "Hello, I see you have a cat.",
    "I do! His name is Bob but I can't find him!",
    "I haven't seen him for a week! What am I to do?!",
    "Whaa...",
    "Would you? Oh that would be so great! I don't want to leave the house in case Bob comes back. He must be hungry by now!",
    "Huh?",
    "Well he usually comes back to me once a week. Usually a Monday.",
    "Hmph! Well, this week he hasn't come back for his food and I'm worried.",
    "I guess so. I've just had an idea!",
    "Do you want to help or not?",
    "Okay. My friend Hild is cleverer than me...",
    "This isn't funny!",
    "Where was I? Oh yes... My friend Hild might be able to locate where Bob is. She lives in a house just down the road, to the south-west.",
    "Please hurry!",
    "Hmph.",
    "Ugh...",
    "I don't feel so good...",
    "I think I need the Doctor...ugh...",
    "Just a Doctor... please hurry... I don't think I'll last long...",
    "No you're not! A Doctor wouldn't be holding that!",
    "I am so  glad to see you Doctor! I am not a well man!",
    "My back hurts!",
    "I think my arm is broken!",
    "Then there's my spleen!",
    "My liver has packed in!",
    "Is that it?! I'm much more ill than that!",
    "Doctor Please take this seriously! I demand treatment!",
    "Wow! What can I say... I feel special!",
    "I'm not sure...",
    "Wait! I feel something! Yes! I can feel the potion working... The pain has gone... I can walk on my leg... Doctor! I'm cured!",
    "Hello! Bob came home today! I'm so happy!",
    "Fat lot of use you were! He came home on his own!",
    "Of course I'm not wrong.",
    "Before you go, I found the strangest thing. There was a package left under the bed, it's addressed to you."
  ],
  "Player": [
    "I do but my cat is in a safe place.",
    "Indeed I do! Do you have a cat?",
    "Oh dear...",
    "Hmm... My cat is trying to say something but I'm not wearing the Amulet of Catspeak.",
    "I know puss, but he is in distress.",
    "Never mind.",
    "Good bye.",
    "Tell you what. I'll help you!",
    "Shh!",
    "Er... Where did you see Bob last?",
    "Wonder why on a Monday?",
    "So he could be anywhere?",
    "Puss!",
    "I said I would, didn't I?",
    "Hehe!",
    "Sorry!",
    "Okay. I'll go speak to her!",
    "Greetings Hild, I am trying to find Unferth's cat...",
    "Hmm... My cat is trying to say something but I'm not wearing the Amulet of Catspeak.",
    "What are you talking about?",
    "You understand what my cat is saying?!",
    "Er...",
    "Hello? I'm still here!",
    "Ah... good! He could be anywhere though!",
    "I don't have the death runes.",
    "I have the death runes with me now.",
    "Thanks!",
    "Not yet.",
    "I have the death runes with me now.",
    "Bob! I've found you at last!",
    "Don't start that again!",
    "Neite...now, I'm sure I've heard that name before...",
    "I'm starting to feel sick...",
    "The crazy cat lady?",
    "Do I look like a matchmaker?",
    "Hi Bob!",
    "Hello again Gertrude!",
    "Hmm... My cat is trying to say something but I'm not wearing the Amulet of Catspeak.",
    "He says he's fine.",
    "Death runes? No idea.... No, it's not that. I, erm...",
    "This is going to sound silly...",
    "Ok... Well... Do you know who Bob's parents are?",
    "No, it's erm... It needs to be taken to the vets, URGENTLY. For an emergency AMPUTATION!",
    "See, it just can't stop howling. Allergic to cat hair apparently. Anyway, you were talking about Bob's parents.",
    "Vaguely?",
    "Hmm... Gertrude, do you know anything of the legend, Robert the Strong?",
    "But...",
    "Hello Gertrude!",
    "Not yet.",
    "Hello Reldo.",
    "Hmm... My cat is trying to say something but I'm not wearing the Amulet of Catspeak.",
    "Ok, ok. I'm on it. Do you know anything about Robert the Strong?",
    "Dragonkin?",
    "Doesn't sound very believable.",
    "Thank you Reldo, you've been most... helpful. That was a nice tale for mothers to tell their children but I don't see how this helps Bob?",
    "I guess, but he's just a cat... right?",
    "Ok, ok! I get your point, after all I'm being dragged round Gielinor by... my cat!",
    "Ok! So you are saying that Robert the Strong is... is... Bob?!",
    "Let's go!",
    "Hi Bob!",
    "Not exactly...",
    "I thought this was stupid.",
    "Looks like there's nothing else we can do, puss.",
    "Well no... I was hypnotised!",
    "Sounds crazy... guess it might work!",
    "Good day.",
    "Sphinx, we need your help!",
    "Thank you! Bob is in love with Neite but we need to prove that he used to be Robert the Strong before she will have anything to do with him!",
    "He was a mighty hero!",
    "But Bob has no memory of this!",
    "Of course.",
    "Er... sure.",
    "OK, no problem Bob.",
    "Hi Unferth, I'm doing some ch...",
    "What?!",
    "Ah... OK.",
    "Never mind.",
    "What do I have to do for 'Tidy House'?",
    "What do I have to do for 'Warm Human'?",
    "What do I have to do for 'Feed Human'?",
    "What does Unferth eat?",
    "What do I have to do for 'Tidy Human'?",
    "What do I have to do for 'Tend Garden'?",
    "I've weeded the garden, now what?",
    "Hi Unferth, is there anything I can do for you?",
    "Oh dear! What's up?",
    "Shh!",
    "What Doctor is that?",
    "We can't let Bob see him like this!",
    "Good idea!",
    "Hello Apothecary, Unferth has fallen ill. Could you go and see him please?",
    "Hmm... My cat is trying to say something but I'm not wearing the Amulet of Catspeak.",
    "I'm beginning to agree with you! What can I do with Unferth?",
    "How do I make Unferth believe I am a Doctor or Nurse?",
    "Haha! I always wanted to be a Doctor!",
    "Good day Unferth, I am Doctor Player.",
    "Good day Unferth, I am Doctor Player.",
    "What seems to be the problem?",
    "Hmm... My cat is trying to say something but I'm not wearing the Amulet of Catspeak.",
    "No problem...",
    "We can...",
    "Your what...?",
    "All you need to do is take this potion.",
    "Hehe!",
    "Of course sir! The potion I have given you is the latest technology. It cures all known illnesses, and a few unknown ones. It's what we call in the trade a 'miracle cure'.",
    "Do you feel better?",
    "That's... great! Phew!",
    "Hi Bob! How's it hang... going?",
    "Phew!",
    "That would be fantastic! I heard you were very very wise indeed.",
    "OK, bamboozle me with your intelligence!",
    "Hi Unferth!",
    "That's good news!",
    "Er...",
    "You're not wrong.",
    "I'll be going now."
  ],
  "Cat": [
    "Meow.",
    "Meow, meow.",
    "What a wet blanket. Bob can look after himself.",
    "This guy gets on my nerves.",
    "Oh my, you win...a biscuit!",
    "Anyone would be cleverer!",
    "Meow, meow.",
    "Unferth's cat? Pfft! Unferth is Bob's human!",
    "Bob didn't come home this week.",
    "I don't think there is a problem, Bob is probably chasing females again.",
    "Hi Bob!",
    "The humans have been looking for you. They get worried too easily.",
    "What's up?",
    "Wow! He's got it bad - real bad! I never thought I'd see the day.",
    "Does Neite feel the same way about you?",
    "Don't you know who your parents are?",
    "Don't you have any memory of your parents?",
    "Player, let's go and talk to Gertrude; perhaps she knows who Bob's parents are.",
    "Come on! We can help Bob.",
    "Okay, Okay. This is becoming dangerous. If we don't do something, he will probably implode! We'll go to Gertrude and ask if she knows who your parents are.",
    "Meow.",
    "I'm fine, thanks.",
    "We don't have time for this - Bob could be in trouble! Tell her to get on with it.",
    "I do hope you're joking. These claws are real, you know; none of your bronze nonsense.",
    "Hang on, maybe this is something to do with the legend. Yes, it just might! Have you ever heard of Robert the Strong?",
    "Ask Gertrude if she knows anything.",
    "Good old Gertrude! Come on, lets[sic] go.",
    "I'll explain later.",
    "Come on, let's go.",
    "Meow.",
    "Go on, ask him.",
    "Don't you think it's odd that no one knows where Bob came from?",
    "I hoped that you would've realised that there's more to cats than humans believe!",
    "I wouldn't say dragged, let's call it a partnership.",
    "Let's ask Bob!",
    "We think you are, or used to be, Robert the Strong!",
    "Robert the Strong was a great hero. You have no memory of him?",
    "Does a black panther called Odysseus ring any bells?",
    "What about the dragonkin? A vicious race of bird-like creatures?",
    "I'm not done yet! Do you remember when you were hypnotised by the Devourer?",
    "Hehe! The Sphinx understood how, if you were hypnotised, it might be possible to access Bob's memories of Robert the Strong.",
    "Bye, for now Bob. We're going to speak to the Sphinx.",
    "Yes, please help.",
    "Robert the Strong was no ordinary human, though.",
    "Wow Bob! You really are Robert the Strong!",
    "Yes! When you were hypnotised you told us of when you defeated a dragonkin!",
    "Yes! How can Neite refuse you now?",
    "Sphinx, summon Neite, please!",
    "That can wait. Bob has been lovesick, so we have to tell Neite.",
    "Hi, Neite!",
    "Bob is Robert the Strong!",
    "The Sphinx hypnotised Bob. Bob told us about when he was Robert the Strong, fighting dragonkin.",
    "Hiss!",
    "Don't tell him you're doing his chores. Part of the cat-human relationship is to let them believe they are in control.",
    "You've finished that chore.",
    "There's only one source of warmth in the house, so I suggest you use it.",
    "There's a table with empty dishes on, I think they need filling.",
    "I've no idea; perhaps you can find out.",
    "You've finished that chore.",
    "You've finished that chore.",
    "Check the garden to see if anything needs tending.",
    "I'm sure there should be something growing in the garden.",
    "Well done, that's all the chores finished! Let's talk to Unferth to see if there's anything else we can do.",
    "Now what?",
    "Nothing, I bet.",
    "Snarl!",
    "I guess you're right, there is the Apothecary in Varrock.",
    "Meow.",
    "I never did like that guy.",
    "I have a few suggestions.",
    "Meow, meow.",
    "There's something wrong with his head.",
    "We could offer to bonk him on the head with a big hammer?",
    "Argh!",
    "Indeed. Bob should be back by now; let's go find him.",
    "This guy is unbelievable."
  ],
  "Hild": [
    "Greetings Adventurer, why have you come to me in my abode?",
    "Your cat speaks some truth, it is humans that misinterpret their relationship with cats.",
    "Indeed.",
    "Hmm. This is not like Bob, I wonder what could be the problem?",
    "I am sorry Player. I will help Unferth find Bob, he has been a friend of mine for many years.",
    "I see you have an Amulet of Catspeak. If you open the amulet up, you will see contained inside is a mechanism. If this is enchanted correctly it can be used to locate a cat, in our case Bob. If you bring me five death runes then I will be able to perform the enchantment for you.",
    "Come back to me when you have them.",
    "Good. Give me the amulet so that I may perform the enchantment.",
    "Using the enchanted amulet is easy; open up the amulet and you'll see a cat's face, use the whiskers to rotate the cat's nose. You'll see the nose move and the new direction highlighted. When the nose points in the direction that Bob is in, the eyes will light up and the mouth will open. You'll need to head in that direction and then check the direction again. If you are very close to Bob then the eyes and mouth will animate no matter which way the nose is pointing. That's all there is to it, good luck!",
    "Greetings Player, do you have the death runes so I can enchant your Amulet of Catspeak?",
    "Come back to me when you have them."
  ],
  "Bob": [
    "Hi there, son.",
    "Ah, I should've realised Unferth would miss me.",
    "Sigh. I can't believe it but I've fallen for Neite.",
    "What a beauty she is. It's the way the shimmer from the hot sand makes her eyes sparkle, the way she flicks her tail as she leaps gracefully across the pyramids, the way she cleans herself after a good rat. As you humans would say, she's the cat's whiskers. Oh, how I long to be curled up with her in front of a log fire and a big bowl of tuna. Menaphos would be a great place to start a family.",
    "I know, but there is something about her. The way she...well, it's everything! Oh, the hidden pain of love. Love lies not with the eyes but with the mind, and therefore is the winged Cupid painted blind.",
    "I haven't been home because I wanted to be alone.",
    "She said she has feelings for me, but would never get involved with anyone with no family or status.",
    "All I know is that Gertrude found me on her doorstep one day. She looked after me when I was a kitten.",
    "Nothing! The farthest back I can remember is Gertrude looking after me.",
    "Hmph. Oh Neite, my bounty is as boundless as the sea, my love as deep. The more I give to thee, the more I have, for both are infinite.",
    "Did you find out who my parents are?",
    "Robert the who?",
    "No, I'm afraid not.",
    "No...",
    "Nothing...",
    "Bye.",
    "What? What happened? I was eating a particularly nice piece of tuna.",
    "Oh, hi there Sphinx. Hi there, Player. What's going on?",
    "So, you buy this Robert the Strong stuff?",
    "Hey! I'm just this cat, you know?",
    "Sure, whatever.",
    "My name is Bob.",
    "I...I don't know.",
    "I see a big cat.",
    "I am in front of a dark tower. The cat is called Odysseus.",
    "My name is Robert. I am walking towards the tower.",
    "I am?",
    "I did?",
    "Really?",
    "So they tell me.",
    "Meew",
    "Neite! Of course, kitten. Hey, Player, could you do me a favour?",
    "Neite and I are going away for a few days. Could you look after Unferth for me while I'm away?",
    "I'll give you a list of what needs doing.",
    "Wonderful! Neite and I have been all over RuneScape! We 'borrowed' a magic carpet...",
    "Where do we turn here?",
    "You think?",
    "For what?",
    "What camel?",
    "Yeah, the old King and I go way back. Hey, old King! How's things?",
    "There, there. Could be worse.",
    "Mate! You need a new line of work.",
    "What camel?",
    "Do you want to drive?",
    "No, I know where I'm going.",
    "No.",
    "No!",
    "I'm the King of Gielinor!"
  ],
  "Gertrude": [
    "Welcome back adventurer! How is your cat?",
    "What can I do for you then? I hope it's not about death runes. I heard a terrible rumour you know.",
    "Come on, spit it out.",
    "Why, are you going to talk in a stupid accent? Go on, try me.",
    "Bob.... you mean the big tomcat who hangs around the Heroes' guild? No, I'm afraid I don't know a lot about him. People round here know I care for sick and abandoned animals, and one day I found a basket with a kitten inside it left on my doorstep. I brought him up as best I could and he soon learnt to take care of himself. He really was an amazing little thing. There was this one time when.....",
    "Crumbs! Your cat's quite noisy isn't it? Is everything OK?",
    "Oh was I... Oh yes, well, I'm afraid I don't know anything about them adventurer.",
    "No, sorry. If it's a legend, it's Reldo you need to talk to. He's in Varrock palace library, knows all about that kind of thing.",
    "Greetings adventurer, have you spoken to Reldo in the palace library about Robert the Strong?"
  ],
  "Reldo": [
    "Hello.",
    "Hmm... wow... let me see... there is a mention of him in one of my books on the history of Gielinor. Fourth Age... Popular Lore... Ah here we are, Robert the Strong! 'Not much is known about the hero called by the people of Asgarnia: Robert the Strong. Most folk tales describe him as being taller than the tallest human and far stronger than the strongest man. He wields a six foot tall longbow and travels with his faithful panther Odysseus. He is said to have had a personal crusade against the Dragonkin...'",
    "I'm coming to that. 'The stories tell of the Dragonkin being an intelligent race of bird like creatures that walked rather than used their wings. They are said to be immortal but cannot reproduce, because of this they became very afraid of death and shunned all other races. The Dragonkin made corrupted versions of themselves for protection, what we now know as dragons.' Well that's everything we know about him and that is from folk tales.",
    "Very little is known about this early part of Gielinorian history, but unlike many scholars, I believe that folk tales are based on events that actually happened. It is the way history has been passed down generations before we had a way of recording it."
  ],
  "Sphinx": [
    "What is it human?",
    "Very well, I see you have a close relationship with your cat, I will help you if I can. What is the problem?",
    "Slow down human! Bob has fallen in love? This I did not foresee! Who is this Robert the Strong that you speak of?",
    "Human myths interest me not.",
    "It is true that there is something about Bob... there is the mark of power on him, I have ignored it for too long.",
    "Then it is time for action! Come with me into the desert so we are not disturbed.",
    "Quiet please.... I shall summon Bob.",
    "Greetings Bob.",
    "I have brought you here to find out who you really are.",
    "I have long suspected that your appearance as an ordinary cat belies your true nature.",
    "Look into my eyes.",
    "You are now under my influence. Let's start with something simple. What is your name?",
    "Good. Are you or have you ever been called Robert the Strong?",
    "Think back to your earliest memories.",
    "Where are you now?",
    "What is your name?",
    "You are no longer under my influence.",
    "There are more important matters than match making.",
    "Very well! I shall summon Neite!",
    "For too long I have ignored the fact that there is a mark of power on Bob. Under my influence Bob was able to recall memories that had remained hidden until now. It proves he is, or was, Robert the Strong."
  ],
  "Robert the Strong": [
    "Come, Odysseus!",
    "Never!"
  ],
  "Dragonkin": [
    "Hesente!",
    "Crasortius!"
  ],
  "Neite": [
    "Oh furballs!",
    "Hello, to what do I owe this pleasure?",
    "What are you talking about?",
    "So you're supposed to be Robert the Strong?",
    "Hmph.",
    "Wow. Come here, you.",
    "(Neite whispers in Bob's ear.)",
    "North, I think.",
    "Yes. North. Slow down!",
    "That camel!",
    "Are you sure this is a good idea?",
    "I said left at the camel.",
    "You're too close to the pyramid!",
    "I think we're lost.",
    "Are we there yet?",
    "Are we there yet?"
  ],
  "Apothecary": [
    "That Unferth! Honestly, I have been to see him more times than my Mother's hair has fallen out!",
    "It's quite simple. Unferth is what we call a hypochondriac; he isn't ill but he thinks he is. All you need to do is convince him you are a Doctor or a Nurse and give him a potion to make him 'better'.",
    "Easy, make sure you are dressed in white robes and take one of these hats to wear.",
    "Then all you need to do is give him a vial of water and he'll take it thinking it's a cure potion."
  ],
  "King Black Dragon": [
    "Same as always: adventurers trying to kill me.",
    "I guess... one moment...",
    "See what I mean?"
  ],
  "R4ng3rNo0b889": [
    "Lolz die noob! The ranger gets killed"
  ],
  "Love Cats": [
    "Advice you want eh? Well, I could just enlighten you with a snippet of my vast knowledge.",
    "Well, I think I will let you decide that.",
    "Don't get distracted so easily! See, I'm distracting you right now!"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:A_Tail_of_Two_Cats?oldid=36120425’"
  ]
}