{
  "Player": [
    "Icthlarin! What happened here?",
    "I thought this was the Duel Arena?",
    "You came here to look for something?",
    "Het could revive souls? Isn't that a kind of necromancy?",
    "Where have you been?",
    "Did you find anyone?",
    "Who's Het?",
    "Is the relic still here?",
    "Can't you help?",
    "I've already cleared up the rubble, actually!",
    "There! That's all the rubble cleared. I should see what Icthlarin wants to do next.",
    "It's not quite done yet.",
    "It's all clear! The ruins are safe to traverse.",
    "Where should we start looking?",
    "What is that?",
    "What do you think is causing it?",
    "Not yet.",
    "That's all of them! I should go let Icthlarin know.",
    "I think the relic is inside the statue.",
    "What should I look out for?",
    "Understood.",
    "Not yet.",
    "Is this it?",
    "Will you take it to Seren?"
  ],
  "Icthlarin": [
    "I came here to find a relic that will aid us in the war against the Elder Gods. Some great disaster preceded me, and now I cannot reach it.",
    "Will you help me find it in the ruins?",
    "Very well. Return to me when you are ready.",
    "That's what it became known as, yes. Long before that, it was a great shrine dedicated to Het.",
    "I was not here to see the destruction, but those who witnessed it tell me the sand opened up and swallowed the arena whole.",
    "I've never seen anything like it - not around here...",
    "Yes. Seren's alliance against the Elder Gods is getting desperate.",
    "They are running out of forces to defend the cathedral, even resorting to necromancy to keep the lines replenished. I offered them my assistance, which brings me here.",
    "The Duel Arena, as you call it, is the site of Het's tomb. Many, many years ago, Het forged a sunstone from Tumeken's light to create an amulet.",
    "He enchanted it with some of his magic and it became known as his Eye - the Eye of Het. With it, he learned to revive the kinds of souls who wished to return to life.",
    "It hasn't been used for centuries but Seren has asked me to recover it. She wishes to find an alternative to Zamorak's necromancy, so she does not have to bring any more soldiers onto the field.",
    "I agreed on the condition that the Eye remains in my power. Before I could find it, through, the earthquake struck, leaving the ruins you see now.",
    "Not in the form you know.",
    "To drag a zombie from a grave and bind it to your service is a trivial abomination. Recalling a soul by it's own will and gifting it time to be free once more, if only temporarily... that is something else entirely.",
    "Harold disapproved, of course, but I convinced him that Het would not abuse the power. And he never did.",
    "Eventually, though, the risks grew too great. We agreed that the Eye could never be used again. So it was sealed away, and its memory forgotten.",
    "Seeking help from across the planes. Given the stakes of this war, we need all the help that can be mustered.",
    "I regret to say it, but no. None. But not for lack of trying, I assure you.",
    "The races who did not drive me away rarely believed me, and if I was believed, none wished to send their warriors away.",
    "How does one convince a distant world to follow a strange god into the unknown? Why would they believe that the universe is in danger? Why should they?",
    "I understand why they chose to stay, I truly do. But I fear what may happen because of it.",
    "You're not familiar? Het is part of my pantheon. One of the lesser gods.",
    "My... half-brother, of sorts, though not in a literal sense. Tumeken created us both.",
    "Tumeken, my father, made Het to stand for the strength and fortitude needed to survive the desert. He's quite popular with the Kharidians around here, understandably.",
    "It is hidden by old magic, but yes. I can sense it has not moved.",
    "It's in here somewhere, but the earthquake destabilised the ruins. We should make sure it's safe to explore before we go looking for the Eye.",
    "I saw a way into the ruins to the north of here. Go in and clear any fallen rubble you find. Once the structure has been made safe again, we can start our search.",
    "You're smaller than me, and far more nimble! I would only cause more rockfall.",
    "In any case, the survivors could do with some reassurance. I'm best placed to do that here.",
    "Ah, good work.",
    "How goes clearing the rubble?",
    "Keep at it. Once the ruins are secure we can start searching for the Eye.",
    "Excellent. Now we can start searching in earnest.",
    "The Eye was hidden inside Het's shrine, locked behind powerful wards. I think I can remember how to undo them, but first... take a look at that.",
    "Some sort of interference with the wards. Magical, by the feel of it.",
    "Hmm. Hard to say. Could be the wards reacting to the destruction...",
    "Or it could be some remnant of what caused the collapse. I'll need to find out more to know for sure.",
    "For now, I will work on understanding the wards. You find and close those rifts, to make sure they don't spread. Come back to me when you're done.",
    "Have you found all the rifts?",
    "Do you need any help?",
    "The first one is right there, just behind you.",
    "I believe the next one to the north-east of here, near the eastern wall.",
    "It's to the south-east of here, near the southern wall.",
    "I can sense it to the east of here, near the statue.",
    "Come back to me when you are done, then.",
    "The disturbances are cleared. Good.",
    "As I suspected. Come - let us investigate.",
    "Now is not the time for that, Player.",
    "I will attempt to undo the wards hiding the relic in Het's tomb.",
    "Be on your guard. I should be able to diffuse most of the defences without ill effect, but should anything slip by, I will need you to handle it.",
    "The wards will fight my interference, so look out for anything strange. Instabilities. Abnormalities. You're likely better versed in the terms for it than I. I will point them out if I see them.",
    "Are you ready?",
    "Then let us begin.",
    "Come back to me when you are.",
    "There, on my right!",
    "There's one on my left!",
    "Quickly, now - it's behind the statue!",
    "That's done it, Player! Come and take a look at this...",
    "The wards are cleared, Player.",
    "See if you can find the relic inside Het's tomb. I will stand guard while you search.",
    "Have you found the Eye?",
    "Keep searching. It should be inside Het's tomb somewhere.",
    "Yes!",
    "Beautiful, isn't it? That's a real sunstone, you know. Tumeken's light manifest. A source of very powerful magic.",
    "Despite the circumstances, it's good to find this again. I feared it might not have survived all those years hidden away.",
    "I will... but not quite yet. This destruction has worried me.",
    "I need to make sure the relic didn't cause it, somehow. I will keep it safe until I know for sure what happened here.",
    "Thank you, World Guardian. The ruins are yours to explore - who knows what else you might find?",
    "You need another space in your Backpack to take your rewards. Talk to me again when you have space.",
    "Thank you, World Guardian. The ruins are yours to explore - who knows what else you might find?"
  ],
  "You do not meet the requirements to start": [
    "'Eye of Get I (miniquest)'."
  ],
  "Rubble cleared": [
    "[number]/4"
  ],
  "Rifts closed": [
    "1/4Next rift to the north-east.",
    "2/4Next rift to the south.",
    "3/4Next rift to the north-west.",
    "4/4All rifts closed."
  ],
  "Rifts stabilised": [
    "[number]/3"
  ],
  "Congratulations! You have completed": [
    "'Eye of Het I' - Complete this quest."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Eye_of_Het_I?oldid=36198245’"
  ]
}