{
  "Veronica": [
    "Can you please help me? I'm in a terrible spot of trouble. My fiancé, Ernest, and I came upon this house. Seeing as we were a little lost, Ernest decided to go in and ask for directions. That was an hour ago...and that house looks spooky. Can you go and see if you can find him for me?",
    "Thank you, thank you. I'm very grateful. I think I spotted some lights flashing in one of the top floor windows, so you may want to head up there first.",
    "Oh. I'm so worried. I hope someone will help me soon.",
    "Have you found my sweetheart yet?",
    "Have you found my sweetheart yet?",
    "I know he’s not exactly brave, but I think you’re being a bit harsh.",
    "Eeeeeek! My poor darling! Why must these things happen to us?",
    "Well, be quick. I’m sure being a chicken can’t be good for him."
  ],
  "Player": [
    "No, not yet.",
    "Yes, he's a chicken.",
    "No, no, he’s been turned into an actual chicken by a mad scientist.",
    "I’m doing my best to turn him back.",
    "There's a sign on the door that says:",
    "So you know where he is?",
    "Ernest is a chicken? Are you sure?",
    "Ernest's fiancée. She probably doesn't want to marry a chicken.",
    "I think you'd better change him back.",
    "Well, I can look for them.",
    "Any clues?",
    "I'm afraid I don't have any of them yet.",
    "Why would I want to lock myself in a cage?",
    "There seems to be a pressure gauge in here...",
    "Ow!",
    "...and a lot of piranhas! I can't get the gauge out.",
    "There seems to be a pressure gauge in here...[sic]",
    "...and a lot of dead fish.",
    "I don't think I want to use that water any more.",
    "I'm afraid I don't have any of them yet.",
    "I've only got the rubber tube so far.",
    "I've only got the pressure gauge so far.",
    "I've only got the oil can so far.",
    "Okay, I'll go look for them.",
    "I've got the rubber tube and the pressure gauge.",
    "I've got the pressure gauge and the oil can.",
    "I've got the rubber tube and the oil can.",
    "Okay, I'll go look for it.",
    "A cash reward is always nice..."
  ],
  "Adventurers beware": [
    "Going in doesn't mean you'll come out again."
  ],
  "Professor Oddenstein": [
    "Be careful in here, there's lots of dangerous equipment.",
    "Ah, Ernest - top notch bloke - he's helping me with my experiments.",
    "He's that chicken over there.",
    "Oh, he isn't normally a chicken, or, at least, he wasn't until he helped me test my pouletmorph machine. It was originally going to be called a transmutation machine, but after testing it, pouletmorph seems more appropriate.",
    "Who's Veronica?",
    "Oh, I dunno. She could have free eggs for breakfast every morning.",
    "Umm... It's not so easy... My machine is broken, and this house has long been pestered by poltergeists. They seem to reap joy from hiding my belongings and, in this case, the vital parts to my machine.",
    "That would be a huge help. They'll be somewhere in the manor house or its grounds outside. I'm missing the pressure gauge and a rubber tube. They've also taken my oil can, which I'm going to need to get this thing started again.",
    "Well, I wouldn't be surprised if you found something in my IQ-testing room under the manor where I test my...creations. Oh, and if I were you, I'd stay away from the coffin in the basement. Even the poltergeists daren't go near it.",
    "Nothing at the moment...it's broken. It's meant to be a transmutation machine. It has also spent time as a time travel machine, a dramatic lightning generator, and a thing for generating monsters.",
    "No, I'm just one of the tenants. It belongs to the count who lives in the basement.",
    "Have you found anything yet?",
    "I need a rubber tube, a pressure gauge and a can of oil. Then your friend can stop being a chicken.",
    "Have you found anything yet?",
    "I need a rubber tube, a pressure gauge, and a can of oil. Then your friend can stop being a chicken.",
    "Have you found anything yet?",
    "It's a good start, but I'll need my pressure gauge and oil can too.",
    "It's a good start, but I'll need my oil can and rubber tube too.",
    "It's a good start, but I'll need my pressure gauge and rubber tube too.",
    "That's good, but I still need my oil can.",
    "That's good, but I still need my rubber tube.",
    "That's good, but I still need my pressure gauge.",
    "Have you found anything yet? Give 'em here then."
  ],
  "Ernest": [
    "Cluck!",
    "Thank you, [sir/m'lady]. It was dreadfully irritating being a chicken. How can *cluck* I ever thank you?",
    "Of course, of course. You may as well have these eggs and *cluck* feathers I mysteriously *bwark* found in my pockets."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Ernest_the_Chicken?oldid=35934432’"
  ]
}