{
  "Overseer Siv": [
    "Welcome to the command centre.",
    "Greetings, Your Grace. It's time we spoke further about Ungael.",
    "I understand. Please speak to me again when you have time.",
    "Aster and the Raptor escorted a team of archaeologists to the tomb north of the fort, to further excavate the ruins. I believe they are hoping to learn more about Ungael.",
    "They have been away for some time. Could you look into it?",
    "Thank you.",
    "And Your Grace...",
    "Keep an eye on Aster for me, please. They've been acting strangely since we held the king's banquet.",
    "Yes, well...",
    "It's understandable of course, given the delicate situation they've been put in.",
    "However, we need to ensure they do not pose a risk to the fort in their current state.",
    "You are welcome, Your Grace. The security of this fort is of the utmost importance.",
    "Perhaps, Your Grace. Nevertheless, it would be prudent to consider any potential security risk, and proceed with caution. Wouldn't you agree?",
    "Welcome to the command centre.",
    "Have you talked to Aster in the dragonkin tomb yet?",
    "I have commissioned a boat from the Fremennik people suitable for such an endeavor[sic]. It is docked within the grove.",
    "Given our supplies, I suggest a small, highly specialised team. Those who remain can defend the fort from any unwelcome guests.",
    "We will also need someone with combat experience.",
    "Sofía, perhaps?",
    "Additionally, I suggest you take Bill. His experience will be crucial in establishing a safe outpost.",
    "I wish you safe travels on your journey. Don't fret, the fort is safe in our hands.",
    "Be careful, Your Grace. There's no telling what may be waiting for you out there.",
    "Your Grace? What? How? We weren't expecting you back for-",
    "Should we send a messenger to Varrock for reinforcements?",
    "By V's grace, I will not back down from a fight.",
    "For Fort Forinthry!",
    "I'll have Sofia[sic] post additional guards upon the castle walls.",
    "Welcome to the command centre.",
    "Yes, I think I have something for you."
  ],
  "Player": [
    "I don't have time for this right now.",
    "That does sound worrisome. I'll see if I can find them.",
    "Yes, Siv?",
    "It's not every day your sister commits treason.",
    "I understand. I'll keep an eye on them. Thanks, Siv.",
    "Nonsense! Aster is doing fine.",
    "Yes, I suppose. I'll keep an eye on them.",
    "No, not yet. I'll get going now!",
    "What are you doing here?",
    "How have you been keeping, Aster?",
    "Is it safe for civilians to be here?",
    "Alright, I'll see what I can do.",
    "I'm working on it.",
    "This looks to be enough, I should return to Aster.",
    "I already have enough artefacts. I should return to Aster.",
    "I have, but the archaeologists must return to the guild. It isn't safe here.",
    "What does it say?",
    "You're reading it backwards. The island is called 'Ungael'.",
    "'Ungael'...Siv confirmed that was the name of the mystery island on the map.",
    "She said that the Fremennik people avoid it. That it is guarded by a ferocious dragon more powerful than Elvarg.",
    "What ever this weapon is, Zemouregal must be after it. perhaps[sic] it is connected to the dragon Siv spoke of.",
    "Very well.",
    "Wouldn't want to mess up my hard work, would I?",
    "Hi, Bill. Who's your friend here?",
    "A... pleasure to meet you, Bill Jr.",
    "Queen Ellamaria? Is it safe for you to reveal your face here?",
    "I don't believe we've had the chance to speak face-to-face like this since the incident with the dragonkin device.",
    "Can you tell me more about how you met king[sic] Roald?",
    "You wanted to publicly humiliate the king?",
    "What happened?",
    "That must have meant a lot.",
    "How does he feel about you staying at the fort?",
    "Have you considered what we discussed about revealing your identity?",
    "The Raptor's voice is strikingly different to your own. How does that work?",
    "Really?",
    "Let's skip the small talk. What did you bring me here to discuss?",
    "That's enough questions. What did you bring me here to discuss?",
    "I agree. It's time we send an expedition to Ungael and put a stop to his plan. I'll gather the fort staff in the townhall at once.",
    "I'll find them. See you at the fort.",
    "Aster? What are you doing here?",
    "Is there really nothing else you want to discuss?",
    "That grave behind you...is that where-",
    "...",
    "I'm here for you if you ever want to talk, you know?",
    "We will be embarking on an expedition to Ungael. I need you back at the fort to discuss preparations.",
    "Zemouregal is likely heading towards Ungael as we speak. If he were to get his hands on this weapon...",
    "He could destroy everything we've worked to build here.",
    "We will send an expedition to Ungael to establish an outpost and secure this weapon before Zemouregal can.",
    "Besides, the Raptor will be there to protect you.",
    "No, Princess, you can't come, it's too dangerous.",
    "I'll need you to protect Rodney and the others while I'm away. Think you can manage it?",
    "It's settled then. Aster, Bill, the Raptor and I will establish an outpost on Ungael[sic]",
    "I never doubted you for a second, Siv.",
    "Let's get going. There's no time to waste.",
    "Almost. I'll head to the boat when I'm ready.",
    "C'mon Bill, we need you.",
    "Perhaps it's time to give Bill Jr a test run?",
    "Or maybe even... prove your dad wrong?",
    "Thanks, Father.",
    "Thanks, Sofía.",
    "Thanks for taking a look, Oak.",
    "Understood. I'll be careful, Siv.",
    "I know, I know. I'll be careful.",
    "I'll try.",
    "I have no business using this right now.",
    "Ungael...",
    "Keep your weapons ready. There's no telling what-",
    "I should speak to the other expedition members before heading into the ruins.",
    "I can feel an ancient power emanating from the tower at the peak of the island. Necrotic power.",
    "You're welcome to remain by the boat if you'd prefer.",
    "Might be handy to have someone here to protect it, if more undead show up.",
    "There's no time for sightseeing. We need to get to the tower.",
    "There! Beneath the ice.",
    "Zemouregal...",
    "Seems we'll have to fight our way through.",
    "For Fort Forinthry!",
    "Necrotic energy is like any source of power, it can be used for both ill and good.",
    "I may be able to use my knowledge of Necromancy to disrupt the ritual.",
    "In doing so, I can siphon a portion of the energy released in order to empower us.",
    "It wasn't your fault. You couldn't have known what she had planned.",
    "Stay focused. We need to find a way off this island.",
    "It's true. You allowed her to manipulate you and jeopardised everything we have worked for.",
    "But the responsibility of stopping Zemouregal does not rest on your shoulders alone.",
    "Come, we should investigate the rest of these ruins. There must be something here.",
    "It doesn't seem to have enough magic to function at the moment. Maybe there's something nearby that will help.",
    "It doesn't seem to have enough magic to function at the moment. Maybe there's something nearby that will help.",
    "We need to take this risk. The fort is in danger.",
    "We need to warn the others.",
    "I'll explain later, Siv. Zemouregal is on his way, with an undead dragon at his command.",
    "However, we do have one saving grace. He doesn't know we've managed to return, we may yet have the element of surprise.",
    "There's no time. We'll have to make do with what we have.",
    "If there is anyone who wishes to leave, I won't hold it against you. Now is your chance.",
    "Thank you.",
    "We may not share blood, but we share a common goal. We want to see this fort succeed.",
    "Zemouregal. Vorkath. They fly in the face of that goal, and must be stopped.",
    "They aren't just a threat to us. They won't stop at the fort. If we fall, they will ravage Varrock. Then all of Misthalin. Perhaps even the kingdoms beyond.",
    "We WILL stop them. We have to!",
    "Just remember, you're not alone. We will face them together. And we WILL defeat them.",
    "For Fort Forinthry!",
    "I have no business using this right now.",
    "Yes, and you played no small part in that. Good job, Bill.",
    "I'm glad you have faith in us, Father.",
    "Understood. Ensure they have everything they need.",
    "Perfect, thank you Oak.",
    "Good idea. Extra ranged support will be handy in the coming days.",
    "I know. But we'll be ready.",
    "That sounds great, I'm famished!",
    "Looks like it was damaged when we escaped the island. Guess I'll have to make my own way back this time."
  ],
  "You do not meet the requirements to start": [
    "'Ancient Awakening'.",
    "'Ancient Awakening'."
  ],
  "Archaeologist": [
    "I heard some rumours, Aster. About your sister. Is it true that she was ex-",
    "You must be the [Title] of this region. It is an honor[sic] to meet you.",
    "That appears to be the case, at least.",
    "And if you can, keep an eye out for my fellow guild members.",
    "Whilst the tomb appears to be safe I have an uneasy feeling about this place.",
    "Ahhhhhh!",
    "Help me!",
    "I though it was safe here!",
    "Z-Zombie!",
    "'Safe as the Varrock Palace', they said...",
    "Thank Saradomin you were here!",
    "Thank you.",
    "That was a close one.",
    "The second we have deciphered this inscription we will return, I promise.",
    "Thank you for your assistance. We have almost-",
    "I think you're reading it backwards, Aster. The island is called 'Ungael'."
  ],
  "Aster": [
    "Let's not dwell on the past. The recent past, at least.",
    "We should instead be focusing on the remarkable ruins surrounding us, and what marvelous[sic] mysteries they might conceal!",
    "Ah, Your Grace! I did not anticipate that you would be joining us, though your presence is most appreciated, as always.",
    "I informed Mr Mordaut of the dragonkin ruins we had uncovered at our latest book club meet.",
    "He insisted on sending a team of archaeologists from the guild, led by yours truly.",
    "Who was behind the construction of this place? What purpose did it fulfill[sic]?",
    "What is the reasoning behind the myriad of skeletons scattered throughout these halls?",
    "These are the mysteries we seek to unravel! In doing so, Zemouregal's villainous machinations may be brought to light.",
    "Well enough...why do you ask?",
    "A lot has happened of late, but such tribulations pale in comparison to the excitement of archaeological adventure!",
    "Did she now? A tad overreaching, is that not? Though I suppose such is to be expected of our esteemed overseer.",
    "Deciphering the secrets of this tomb and stopping Zemouregal is my sole priority, I assure you.",
    "The undead swarming this tomb have long been dealt with.",
    "The Raptor is also present to provide protection, should we stumble into a perilous situation.",
    "While that is true, the overseer agreed that investigating this tomb is our upmost priority. Your assistance is both necessary and appreciated.",
    "We will unearth Zemouregal's plan. Quite literally, if it indeed lies here.",
    "Speaking of which-",
    "There is an abundance of artefacts to collect and review in these ruins.",
    "If you could gather around twenty or so, it would aid our efforts considerably.",
    "Have you procured the artefacts? We are on the cusp of a breakthrough.",
    "Have you procured the artefacts? We are on the cusp of a breakthrough.",
    "Eureka! I believe I have successfully translated the dragonkin text engraved into the map.",
    "It speaks of a deadly, ancient weapon, concealed beneath the permafrost of the forgotten island of...Leagnu!",
    "Ah, you are correct.",
    "I was not aware you were also capable of reading the Dragonkin language, Your Grace.",
    "Have you also been attending Mr Mordaut's lectures at the guild?",
    "A conversation for later, perhaps.",
    "Ah, you are correct. Clearly I need to attend more of Mr Mordaut's lectures on the subject.",
    "I shall escort the Archaeologists[sic] to Varrock. We can rendezvous at the fort to share our findings.",
    "Your Grace...what a pleasant surprise.",
    "What are you doing- ah, nevermind. It is unbecoming of oneself to answer a question with another question.",
    "Upon completing my task of escorting the archaeologists to Varrock I simply decided to enjoy the scenery of the river.",
    "The atmosphere is marvelous[sic], wouldn't you agree?",
    "No, there is not.",
    "I told you, there is nothing to discuss!",
    "...",
    "That outburst was indeed unacceptable. It shan't happen again, I promise.",
    "No, you have my deepest apologies. That outburst was unacceptable.",
    "You have my sincerest apologies. That outburst was unacceptable.",
    "I assume you did not come here to converse. Is there something you require of me?",
    "I-",
    "...",
    "Thank you, Your Grace.",
    "I assume you did not come here to converse. Is there something you require of me?",
    "Of course. I shall return at once.",
    "Once again, you have my deepest apologies.",
    "Let's return back to the fort.",
    "As you may know, I traveled[sic] to the dragonkin tomb beneath our very feet with a team of Varrockian archaeologists.",
    "We discovered that there is an ancient weapon on the island of Ungael.",
    "A weapon so powerful it has piqued Zemouregal's interest.",
    "I shall go, you'll have need of a dragonkin translator. Mr Mordaut has been saying that I need more field experience.",
    "Have you finished preparing for the journey yet, Your Grace?",
    "Very well. I shall meet you there.",
    "It's beautiful.",
    "Calculating the trajectory...",
    "For Fort Forinthry!",
    "For the duchy!",
    "High time I proved myself.",
    "I certainly hope this works!",
    "I shall dispose of this eyesore post-haste!",
    "This should illuminate the situation.",
    "Watch this, Your Grace!",
    "It appears Zemouregal has arrived ahead of us.",
    "So much history...this place is truly marvelous[sic].",
    "Remarkable...",
    "'Vorkath'...",
    "It shan't remain so for long. That malefactor appears to be reanimating its corpse.",
    "It bears the hallmarks of profane energy. Necrotic energy. Billowing up from the ritual beneath us.",
    "We failed...I failed. Zemouregal and the dragon are on their way to raze the fort. Our sole means of leaving this island has been obliterated.",
    "No! There has to be a way. I won't be the one responsible for ruining everything! Not again.",
    "I am so sorry. If I had simply uncovered the secrets of the tomb quicker, or spearheaded an expedition the moment we became aware of his plan...",
    "But this was my chance to find redemption! To make amends.",
    "It was my nepotistic recommendation of Bianca that put the king's life in jeopardy. That threatened the future of the duchy.",
    "I was the one responsible for bringing her into the fold and she betrayed us. Betrayed me.",
    "The worst part of it is, despite everything she did, I cannot help but mourn her.",
    "She was not merely my sister, she was my closest friend. My confidant. She would always be there for me, or so I thought.",
    "She played me like a fiddle, used my generosity for her own ends. And yet she claimed to care for me, until the very end.",
    "That may be true, but it was selfish of me to prioritise my family over the fort's security.",
    "I swear I shall do whatever it takes to save it from Zemouregal!",
    "Yes. You are right.",
    "I swear I shall do whatever it takes to save the fort from Zemouregal!",
    "Yes. You are right.",
    "Still, I swear I shall do whatever it takes to save it from Zemouregal!",
    "There must be a means of returning to the fort here. There MUST be!",
    "There is a device similar to this in the Varrock museum's dragonkin exhibition. I believe Mr Mordaut mentioned it was a means of archiving information.",
    "That artefact had deteriorated beyond repair. This one, however, appears to be in near-perfect condition.",
    "Imagine the knowledge it might contain.",
    "Translating his words should be within the realms of my ability. Bear with me just a moment...",
    "I suspect this 'master' is long gone.",
    "Thank Saradomin this place has been abandoned.",
    "What 'tomb' is it referring to, I wonder?",
    "This could be our means of leaving the island! How are the remains sent there?",
    "We should inspect the conduit.",
    "Well, here goes nothing!",
    "It did! We are but a stones[sic] throw away from the fort. I can scarcely believe it.",
    "I am in this until the very end, Your Grace. The fort shall not fall while I still draw breath.",
    "For Fort Forinthry!",
    "My families[sic] past is behind me, Your Grace. Thank you for helping me see that."
  ],
  "The Raptor": [
    "...",
    "I am not your personal bodyguard.",
    "Player, I must speak with you. Alone.",
    "Meet me in the Jolly Boar Inn, southwest of the fort. Second floor.",
    "I will go.",
    "...",
    "We're not alone.",
    "We must go there. Now.",
    "...",
    "Do it.",
    "...",
    "We will find a way back, and we will end him.",
    "...",
    "Agreed.",
    "For Fort Forinthry!",
    "...",
    "I am ready."
  ],
  "Artefacts collected": [
    "[number]/20",
    "[number]/20"
  ],
  "Bill": [
    "Oi oi, aren't planning on disappearing without seeing your old buddy Bill are you?",
    "'Scuse me, where are my manners? Player, this is Bill Jr. Bill Jr, this is Player.",
    "He's not quite drinking age yet... being two weeks old and all, but let's keep that our little secret. No need for the barkeep to know, aye?",
    "Created him to defend the fort, I did. Hope to be a better pa to him than mine ever was.",
    "You could say that. He was a hard man, my pa. A soldier through and through. Fought tooth and nail for Saradomin in the battle for Lumbridge.",
    "Didn't have much respect for us creative types. Thought every problem was a nail, and he was the hammer.",
    "He'd call me a coward. Weak. That I'd never amount to anything.",
    "But we'll show him, won't we, Junior?",
    "Blimey, is that the time? I'd better be off. People to see, planks to make...",
    "Sorry, Your Grace. I didn't mean to tell you my personal history.",
    "I should be off now, anyways. Goodbye, Your Grace.",
    "See you later, boss.",
    "M-me?! But what if Zemoroggie is there? I can't fight!",
    "I think I left my saw running, you'd better go without me.",
    "Okay... I'll do it. Thanks, Player.",
    "Not the word I'd use, but suit yourself.",
    "Atta boy!",
    "Blimey, watch that thing go.",
    "Do your pops proud, junior!",
    "Go for the eyes, buddy!",
    "I've got your back, buddy.",
    "Say hello to Bill Jr!",
    "This oughta do the trick.",
    "Watch yourself!",
    "Me? Go into that death trap? Are you bloody mad?",
    "On second thought, I'll stick with you three. Safety in numbers, and all that.",
    "D-did you see that? Must be my imagination.",
    "That's a bloody huge dragon. Least it's dead.",
    "What's that?",
    "We're trapped. We're gonna die here, aren't we?",
    "It ain't your fault, Aster.",
    "That's the spirit! We built that place together. It's our home.",
    "I aint[sic] letting some second-rate necromancer take that away from me.",
    "We have to find a way back. The fort needs us.",
    "This looks fancy. I wonder what it does.",
    "Hopefully a way off this bloody island.",
    "'Living weapon'? Is it talking about the dead dragon that was beneath the tower?",
    "Bless him, poor thing.",
    "Is this safe? What if we end up somewhere worse... Like inside a wall?",
    "Well? Did it work?",
    "No.",
    "I have worked far too hard on this fort to give it up like this.",
    "We've had murders, we've uncovered ancient mysteries, we've even dealt with an undead invasion right on our doorstep.",
    "No. This will not be the bloody end.",
    "This is my home. OUR home. We will show this miserable Zemouregal the strength of Fort Forinthry!",
    "For Fort Forinthry!",
    "I can't believe we made it back.",
    "Thanks, Your Grace. If only my pa could see me now."
  ],
  "Ellamaria": [
    "The Raptor is familiar with the owners of this inn.",
    "They know that when he comes here, he is not to be disturbed by the uninvited.",
    "Then you'd best make the most of it.",
    "If you have something you want to discuss, ask away.",
    "I'd snuck into one of the la-di-da parties at the palace, to publicly humiliate him.",
    "It was a time of chaos. Villages were raided by goblins. We were at war with Morytania...",
    "I lost people. My parents, when I was a child. Sam, my closest friend, around that time.",
    "The king cared little for our suffering, or so we thought.",
    "Indulging in tournaments and parlour games while we struggled. While Sam was bleeding out in the dirt.",
    "Hosting a gala just days after Sam's village was slaughtered was the final straw.",
    "I grabbed the fanciest dress I could find at Iffie's and marched into the palace like I had every right to be there.",
    "The guards tried to throw me out, but Roald stopped them.",
    "He listened. To my venting, my cursing. As I listed the atrocities I'd seen and the people I'd lost.",
    "When I was finished he asked me what he could do to set things right.",
    "It did.",
    "He was surrounded by sycophants. Advisors who concealed the extent of the crisis for their own benefit. It was the first time someone had challenged him.",
    "He hates it, being separated for so long. But he knows it is necessary. He was the one who originally proposed the idea of the Raptor, you know.",
    "A sacrifice he was more than willing to make to ensure I could keep slaying monsters.",
    "I have.",
    "There are benefits to anonymity. To having the Raptor's exploits separated from the crown.",
    "More than that, my accomplishments as the Raptor are not attributed by the masses to my husband or marriage. I do not take that for granted.",
    "As such, I have decided that the Raptor will remain as he always has. For now.",
    "That's just how I sound after I've had a few too many at the tavern.",
    "Hah! It's not far from the truth, but no.",
    "The Raptor's armour was hand-crafted by the renowned smith Linza. The helmet was later enchanted by Reldo to alter the voice of whomever wears it.",
    "We need to talk about Zemouregal.",
    "You of all people should know the threat he poses to Misthalin. You were the one who thwarted his plan to steal the shield of Arrav, after all.",
    "We may have fallen without your aid. I am forever grateful for your assistance.",
    "But I have no doubts that he plans to attack Varrock again.",
    "Without this 'ancient weapon' at his disposal, he just might succeed.",
    "We've wasted enough time digging in dusty crypts and meandering around the fort. We need to take action!",
    "You will need to fetch Aster first. While flawed, their knowledge of dragonkin history may prove useful.",
    "I suspect you will find them west of the champions' guild, near the bridge to Draynor Manor.",
    "Find Aster, then meet me at the fort."
  ],
  "The following text is transcluded from Transcript": [
    "Mysterious letter (Ancient Awakening)."
  ],
  "Rodney": [
    "Oh, darling. Was there anyone who didn't know?",
    "You'll be fine, dear. I have complete and utter faith in you!",
    "Good luck, dear. Make sure to come back in one piece.",
    "Are you sure, dear? Perhaps we could evacuate, look to regroup-",
    "I can't leave you all... You're everything to me. I won't be exiled from another home.",
    "For Fort Forinthry!",
    "I'll prepare a feast. We must be in tip top shape before they arrive!"
  ],
  "Guard captain Sofía": [
    "I must remain here, in case of further attacks. I cannot leave my guards without a captain.",
    "I will ensure that the boat is fully stocked with bows and ammunition, should the need to use them arise.",
    "No. There's no turning back now. We must avenge Cyrus.",
    "For Fort Forinthry!",
    "I will inform the guard. They must know of the risks. What they'll be facing."
  ],
  "Princess": [
    "*Determined barking*",
    "*Courageous barking*",
    "*Concerned barking*",
    "*Inspired barking*",
    "*bark*",
    "*Worried barking*"
  ],
  "Father Flint": [
    "I bless thee child, for ye are about to step foot into the eye of the storm.",
    "Aye. By the Gods, we will smite this heathen down.",
    "For Fort Forinthry!",
    "In times of war, we must all make peace with our maker."
  ],
  "Oak": [
    "It looks like the boat Siv commissioned is made with wood from the grove. The Fremennik did a great job. It's a fine vessel, Your Grace.",
    "My pleasure.",
    "After thousands of years, life is being restored to this land. It's beginning to heal... I cannot stand aside and let him take it from us.",
    "For Fort Forinthry!",
    "The treeline will provide adequate cover for our archers to hide in should we need it."
  ],
  "Duke": [
    ", Duchess: , or Dux:"
  ],
  "Zemouregal": [
    "Misthalin. A pitiful kingdom crippled by war and famine.",
    "Easy pickings - until that meddlesome fort sprung from the filth.",
    "This upstart [title] thinks they can scupper MY plans?",
    "I'll show them.",
    "I will awaken the ancient power that slumbers here, and it shall serve my will.",
    "Fort Forinthry will crumble and Misthalin will be mine for the taking!",
    "If they will not serve me in life...then they shall serve me in death!",
    "Stop them! They cannot be allowed to interfere with the ritual.",
    "The dragon WILL be mine!",
    "Just three minions? How cute. I command entire armies!",
    "Hahahaha!",
    "Still clinging on? Don't worry, it will all be over soon.",
    "Yes...YES! The ritual is almost complete.",
    "Mwahahaha!",
    "You are too late, [title].",
    "The dragon is mine.",
    "This island shall be your tomb.",
    "And nobody will be there to save your precious fort!"
  ],
  "Raptor": [
    "It's an ambush!",
    "...",
    "Behind me.",
    "Die!",
    "Pathetic.",
    "Useless.",
    "Weak."
  ],
  "Archivist": [
    "State your query.",
    "I am a magical construct created by Zorgoth, the master of this island, in his image.",
    "My role is simple: to answer questions and aid in the retrieval of archived information.",
    "This island is dedicated to the creation of the perfect living weapon.",
    "Said weapon will serve the master in his plight to eradicate the human infestation from this world.",
    "The dragon displayed beneath the tower is one of our hundreds of flawed creations. He was named 'Vorkath'.",
    "He was the closest the master came to perfection. Ideal muscle mass, imposing stature, powerful innate magical ability...",
    "But despite his great power he was meek. Docile.",
    "He would indulge in gentle physical contact and frivolous entertainment with his targets, instead of destroying them. Pathetic.",
    "The master hoped that this weakness would resolve itself once he reached maturity. It did not. Physical coercion proved...unsuccessful.",
    "As with all defects, he was destroyed. He was our greatest 'Vorkath'. Our greatest failure.",
    "His remains were too large to send to the tomb with the others, so they were displayed beneath the tower.",
    "Remains that are of no further value are sent to a tomb beneath Forinthry.",
    "There is a magical conduit within this room that can conjure a one-way portal to the tomb.",
    "As you wish.",
    "State your query.",
    "I am a magical construct created by Zorgoth, the master of this island, in his image.",
    "My role is simple: to answer questions and aid in the retrieval of archived information.",
    "This island is dedicated to the creation of the perfect living weapon.",
    "Said weapon will serve the master in his plight to eradicate the human infestation from this world.",
    "The dragon displayed beneath the tower is one of our hundreds of flawed creations. He was named 'Vorkath'.",
    "He was the closest the master came to perfection. Ideal muscle mass, imposing stature, powerful innate magical ability...",
    "But despite his great power he was meek. Docile.",
    "He would indulge in gentle physical contact and frivolous entertainment with his targets, instead of destroying them. Pathetic.",
    "The master hoped that this weakness would resolve itself once he reached maturity. It did not. Physical coercion proved...unsuccessful.",
    "As with all defects, he was destroyed. He was our greatest 'Vorkath'. Our greatest failure.",
    "His remains were too large to send to the tomb with the others, so they were displayed beneath the tower."
  ],
  "Congratulations! You have completed": [
    "'Ancient Awakening' - Complete this quest."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Ancient_Awakening?oldid=36229893’"
  ]
}