{
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "misc dialogue optionsYou can discuss this issue on the talk page or edit this page to improve it."
  ],
  "Zimberfizz": [
    "Wotcha guv'na!",
    "Best talk to his highness over there, 'fore he gets his knickers in a twist.",
    "'Ere matey, you got a mo' to chat about his highness over dere?",
    "Crackin'! Thing is, you see, his highness 'as been acting all funny-like.",
    "Too right, 'guv! He's been sneaking off in the middle of the night and coming back all sparkly.",
    "Yeah right! He's 'ardly one for the nightlife, matey.",
    "Well, I reckon he's up to summint. Summit evil!",
    "Well, that's his thing, ain't it? Evil this, evil that. He's gotta be up to summint!",
    "Oh no! Er, I mean, yes, master! At once!",
    "Gotcha!",
    "I said, 'Yes, master!'.",
    "Right, with him gone, we can get to work. Have a butchers in his tent and see if you can find anything tasty.",
    "Cor! Where you reckon it goes? Bet there's summint dead secret down there.",
    "Really? What's it like?",
    "Yeah, that sounds like his style. Did you find anything else out?",
    "Oh, I'm sure he won't go killin' you just like that. Why don't you go have a chat with him?",
    "Never know, he might let slip wot he's up to! Go on, what's the worst that could 'appen?",
    "Details! Minor details. Go on now, go see what he 'as to say fer himself.",
    "Blimey! Better get in there and get it sorted sharp-like, before we all end up brown bread!",
    "Oh, you absolute plum duff, you need me to spell it out for ya?",
    "Look, if he's got a secret lair down there, then he must be up to no good! You need to get in there and put a stop to whatever he's up to!",
    "Well, he's bound to say that, ain't he? Go on, have a poke around down there and see what he's really up to.",
    "Oh, fine, if you don't want to go adventuring down there then don't. No one's forcing you to.",
    "Just don't come crying to me when the world ends and it's all your fault for doing nothin'!",
    "Blimey! How did you get here?",
    "What's the last thing you remember?",
    "Crikey! Hang on, you don't look very dead to me.",
    "Wot? You've gone wrong in the head, matey. In any case, it seems the soul obelisk has taken a liking to you! I guess it didn't want you going too far.",
    "Wotcha guv'na!",
    "Really? Oh, I hope he ain't mad with me. You didn't make him too angry did you?",
    "Awwww, I bet he's gonna set me on fire again for putting you up to this.",
    "Why not?",
    "Sort of dead? You killed him?",
    "Not kill him!",
    "I never told you to go killing 'im now, did I! Just have a poke around, is all I said.",
    "Awww, I don't believe this! Now I'm going to have to clear up all the mess you made. Come on then, give us his head.",
    "You did say you killed him, didn't you?",
    "Then where's his head? You can't know he's really dead unless you cut his head off!",
    "That don't make it not true! Awww, this has all gone right pear-shaped. Come on you, I best see this for meself.",
    "Oh, alright then. I suppose you don't have to cut his head off. You know, in a way, I'm sorry to see the old fella go.",
    "Well he kept everything running up on the surface.",
    "Actually, come to think of it, he did! I guess I'm free now!",
    "I guess that makes me in charge of things upstairs. I should look the part if I'm gonna be running the place.",
    "What do ya think?",
    "Yeah! You sure know style when you see it, matey.",
    "Ha! You just don't know style when you see it, matey.",
    "Hey! Just because you got no style, don't mean you can take it out on others.",
    "So, what was the old fella up to down here anyway?",
    "Crikey!",
    "Woah, there! Let's not do anything hasty, like!",
    "It can't be all that bad! Not if we handle it proper, like! What's the deal down here anyway?",
    "Well, I could have told ya that. So, does it work?",
    "Crackin'! I'm sure there's some magicky types out there who'll pay through the nose for a bottle of this soul stuff!",
    "Course not, matey – just business-minded! We'll make a killing, so to speak.",
    "I know! Sounds too good to be true, don't it?"
  ],
  "Nomad": [
    "Hey! Talk to me if you want to know anything worth knowing.",
    "Hey! Get back to work, you!",
    "Right, take care of the battleground for a while. I have... matters to attend to.",
    "What did you say?",
    "Hmm.",
    "I do hope this isn't all that's left of you. I was at least hoping for a challenge.",
    "Is it my turn, now?",
    "Really? How unfortunate for you!",
    "Ha! Your prayers won't protect you from me, boy.",
    "Just where do you think you're going?",
    "Let's see how much punishment you can take!",
    "All too easy.",
    "Intriguing. Of all the assassins they could have sent, I would never have expected it to be you.",
    "Oh, really? Then how is it you come to be here?",
    "That nosy little... I'll deal with him later. As for you: turn around, leave and forget you were ever here. My work cannot suffer any more interruptions.",
    "Drop it. Leave NOW. If I ever see you down here again, I guarantee it will be the last mistake you ever make.",
    "Ha! Come then, assassin. If you can find me, perhaps you'll prove to be of some small amusement.",
    "The assassin approaches, but I wonder what compels you to seek death. Is it out of foolish loyalty to your master, or is it merely stupidity that brings you here to face me?",
    "I warned you about coming to find me, yet here you are!",
    "How touching! Very well, I suppose it won't hurt to alleviate your curiosity. Did you wonder where all the souls went from the battleground above?",
    "Really? I'm surprised. Few ever question their actions. Perhaps you are not as lost as I first thought.",
    "Just like all the other fools who battle with the promise of a petty rewards. Did you not stop to consider your actions even once? Few ever do; they are simply told to do something and follow blindly.",
    "Did you consider the source of my power? They are one and the same!",
    "Precisely! Why toil to attain power on your own when you can have thousands of others do it for you!",
    "Unnatural? I suppose it is, but the ends justify the means in this case.",
    "Oh let's just say that my former employer didn't take kindly to my resignation. No doubt he will come for me eventually, instead of sending petty lackeys and assassins. Preparations had to be made...preparations which you have rather unfortunately disrupted.",
    "Oh, I'm sure a clever adventurer like you has figured that out by now. If not, it's not a question that will trouble you for much longer.",
    "Yes, it is time for you to be leaving.",
    "You're not going anywhere.",
    "Yes, but not in that sense of the word. I can't have you telling others of what you've learnt.",
    "Ha! Don't worry - I'll go easy on you.",
    "So be it! Show no pity in your attacks, for you shall receive none in return.",
    "Then that makes two of us.",
    "I think not! You've already destroyed a great deal of my work in getting here. This constitutes a debt that must be repaid.",
    "Your soul!",
    "So be it, assassin! I will not have all I have worked for risked by the likes of you. Show no pity in your attacks, for you shall receive none in return.",
    "Ha! Finally some words of truth. Come then, tell me why you are really here.",
    "The assassin returns? Whomever preserved your life must delight in your suffering! Is it out of foolish loyalty to your master, or is it merely stupidity that brings you here to face me?",
    "We shall see.",
    "Let's make things interesting!",
    "You cannot hide from my wrath!",
    "Let's see how well your senses serve you.",
    "Let's see how much punishment you can take!",
    "Face me!",
    "You're tougher than I thought. Time to even things up.",
    "Enough! This. Ends. Now.",
    "You.. You have doomed this world."
  ],
  "Player": [
    "Hello there.",
    "Yes.",
    "You mean, more than normal?",
    "Maybe he's just been hitting some taverns?",
    "Hmm, so how do I fit into this?",
    "Evil?",
    "No.",
    "Hey! I think I can see a trapdoor hidden under the bedding in there.",
    "Hmm, maybe I could sneak down and investigate.",
    "I investigated Nomad's tent and he's got some sort of secret temple down there!",
    "Full of dead people, from the looks of things!",
    "Not really. Nomad saw me, so I came back up here before he killed me too!",
    "Have a chat with him?",
    "I could die!",
    "Whoa, now. I'm no assassin!",
    "Zimberfizz sent me here to see where you went.",
    "What work? What are you up to down here?",
    "Zimberfizz sent me here to see where you went.",
    "I never did like you. Time to die!",
    "I found Nomad under his tent; there's a whole ruined temple down there!",
    "Er, what?",
    "Well, yes, actually.",
    "He made it quite clear to me that I was not to go back in there.",
    "But why? Why can't we just leave him be?",
    "Well, that was fun, if somewhat pointless.",
    "Yes! The device looks to be out of order now!",
    "That looks like the last of them! The device has stopped working now.",
    "Yikes!",
    "The roots are protecting each other! Can't do much to them while they are grouped like this.",
    "Wow! I guess that's put this device out of commission.",
    "Are you alright?",
    "Who? Nomad? Do you know what he is up to down here?",
    "Master? Who's that then? What are you talking about?",
    "Rest now, brave knight.",
    "*sigh* There doesn't seem to be anything useful here. Hmm... what's this?",
    "It looks like there is something scrawled across the floor here. 'Only the pious'. I wonder what it could mean.",
    "Well, that seems to have broken something!",
    "This looks like it. Whatever Nomad is up to must be through here. If he's in there, he's not going to make this easy. This is going to be a fight to the death.",
    "I already told you, I'm not an assassin.",
    "I was just curious about what you've been up to, is all.",
    "Yes, actually.",
    "Not really, no.",
    "So, where do all the souls go?",
    "You mean the soul obelisk funnels all the souls from above into your throne here?",
    "Why do you need such power?",
    "That's unnatural! You can't carry on with this.",
    "How? How could they possibly justify this?",
    "Who is this former master of yours?",
    "I guess I'll be leaving now.",
    "I'll be going now.",
    "Okay then. Bye!",
    "But you said it was time for me to be leaving.",
    "This isn't happening.",
    "Fine! Bring it on!",
    "I've had enough of this.",
    "Fine, do what you like: I'm leaving.",
    "Fine, whatever. What's the price I have to pay?",
    "If this master wants you dead, I'm happy to oblige!",
    "Actually, yes: I really am quite stupid.",
    "I really don't know...",
    "Nomad! He killed me!",
    "It takes more than death to kill me.",
    "Good, because I have some unfinished business with Nomad.",
    "You will not defeat me this time!",
    "Aiiiiieeeee!",
    "I did it! I stopped Nomad!",
    "Well, sort of.",
    "I don't think he'll be doing that anytime soon.",
    "Well, he's sort of dead.",
    "Well, what was I supposed to do?",
    "Very funny.",
    "He didn't give me much choice in the matter.",
    "Head? Why would I have his head?",
    "Yes.",
    "That's disgusting.",
    "You see? Wasn't kidding, was I?",
    "Really?",
    "Didn't he make you do all the work, though?",
    "See, it's not all bad.",
    "Nice!",
    "Meh.",
    "You look ridiculous.",
    "It was an evil scheme all along. The whole of Soul Wars is a front to fuel his evil plans for power.",
    "We've got to put a stop to any more battles right now – tear the whole thing down at once.",
    "Anything hasty? It's all evil. EVIL!",
    "The soul obelisk isn't some ancient relic – it's a giant machine that Nomad built for harvesting souls.",
    "Of course it does!",
    "Bottle it and sell it? Are you mad?",
    "I can't believe what I'm hearing here."
  ],
  "Elite Dark Warrior": [
    "I'll show you a challenge, traitor!"
  ],
  "Elite Dark Mage": [
    "I didn't sign up for this!",
    "Gods save me!"
  ],
  "Elite Dark Ranger": [
    "Fool! The master will flay the flesh from your bones when he hears of this treachery.",
    "What? No! You can't do this to me!"
  ],
  "Knight": [
    "Hey! Over here.",
    "*cough, cough* I...I am done for. You must stop him, stop his treachery.",
    "The master was wise to send you, brother. Go now and finish our task. I have made the preparations. Bathe his infernal contraption in wave-upon-wave of flame.",
    "There is no need for pretence down here, brother. There is only death."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Nomad%27s_Requiem?oldid=35723319’"
  ]
}