{
  "Azzanadra": [
    "Player, come over here. We should speak.",
    "World Guardian, good.",
    "Armadyl, Icthlarin and I are concerned by the level of influence Seren is exerting over this council.",
    "Shall we see how it goes this time?",
    "This again?",
    "I was not always Azzanadra, your trusted friend.",
    "Six thousand years ago I was Azzanadra, Pontifex Maximus of the Zarosian Empire.",
    "I maintained civilisation and the rule of my lord against all those who called themselves gods.",
    "I am very familiar with Seren's influence.",
    "We can no longer rely on this council.",
    "They are completely under her sway now.",
    "In time they will recover their initiative, but for now they are nothing but puppets.",
    "Disappointing, but not unexpected.",
    "Seren is obsessed with the adult elder gods.",
    "Her guilt and shame blind her to the true threat.",
    "It is not the adults who are destined to destroy us. It is their unborn children.",
    "If they wake, they will devour this world, and in time, all worlds.",
    "If the best these fools can do is waste their time on senseless appeasement, then it falls to us to save them.",
    "We must find the elder god eggs.",
    "We must stop them hatching.",
    "It's been nearly seven thousand years, psychopompus. Surely the good of this world outweighs the events of the distant past.",
    "You speak of loyalty as if it were a vice. Loyalty is the highest - perhaps the only - virtue.",
    "It is not for creatures such as us to question the morality of a true god.",
    "His thoughts are beyond our comprehension. He is a higher power.",
    "...",
    "As you wish. World Guardian, I assume you do want to help?",
    "Meet me inside the dig site in Kharid-et. Since no one here is of use, we will find our own allies.",
    "Meet me inside the digsite in Kharid-et. Since no one here is of use, we will find our own allies.",
    "Was your debriefing completed to our Lord's satisfaction?",
    "What did he want to know?",
    "Ah, Player. You've already met Trindine, of course.",
    "Seren is obsessed with the adult elder gods.",
    "She is still wracked with guilt over murdering her - and our - creator, and trying to appease the others is her way of seeking amends.",
    "But it is not the adult elders that pose the real danger.",
    "Their offspring are the true threat. Piecing together Seren's and Kerapac's claims, there must be three eggs on Gielinor.",
    "Mah never laid an egg, and Jas sacrificed hers to create the Stone of Jas, which has since been destroyed.",
    "If the three remaining eggs hatch, they will destroy our world and, in turn, the universe.",
    "It seems to me to follow, then, that our efforts should be focused not on the adults, but on the eggs.",
    "When my Lord returned to us a few years ago, he gave me the task of locating those very same eggs.",
    "I can only assume he foresaw our current situation.",
    "I am ashamed to say that I have not yet succeeded in that task. With your help, we will correct that oversight.",
    "We need to find the eggs.",
    "Once we find them, with enough information and study we may be able to devise a plan to stave off our annihilation.",
    "You and I will travel to Freneskae and inspect the site of the previous generation of eggs there.",
    "Trindine, a moment. I have other orders for you. Meet me at the world gate, Player. It's in Kandarin, southwest of the Tree Gnome Stronghold.",
    "Meet me at the world gate, Player. It's in Kandarin, southwest of the Tree Gnome Stronghold.",
    "We need to make our way across the surface of Freneskae back to the Elder Halls.",
    "If we want to understand the elder gods and their eggs, it's the most obvious lead to research in more detail.",
    "With Mah's death the constant destabilisation of this region has calmed somewhat.",
    "It is strange to see it so peaceful.",
    "Compared to what it was when it shaped us and hardened us, yes, I would call this peaceful.",
    "I will see you up ahead.",
    "You could be faster.",
    "We can pause for moment.",
    "Teleporting others is extremely difficult.",
    "Only gods can do it easily, and even then it requires vast reserves of power.",
    "That sort of spell only teleports to a specific location. Teleporting to arbitrary points is much more difficult.",
    "Let's move on.",
    "Who told you that?",
    "That explains it. What use would the followers of the true god have for a creation of a pretender like Guthix? And the less said about Icthlarin, the better.",
    "Of course. Every stabilising religion needs to answer that question.",
    "We call it Erebus.",
    "I have no idea. It's the afterlife - no one has ever returned to speak of it.",
    "It is not the way of our lord to invent false narratives to appeal to the plebeians.",
    "Obviously none of this applies to Mahjarrat, as we do not have souls.",
    "But when a mortal of the faithful dies, their soul passes on from this world to another.",
    "Those attuned to the currents of magic can sense its passing, but we do not know the destination. We call that unknown place 'Erebus'.",
    "Let's move on.",
    "It is necessary for his plans somehow.",
    "He did not tell me. It was not something I needed to know.",
    "Whether I am the most loyal, I cannot say.",
    "For hundreds of years I served his will to the best of my ability.",
    "The title of Pontifex Maximus seems pretentious now that there is no church and no empire, but it is technically still accurate.",
    "You speak of Zaros as though he were a friend, an ally.",
    "Of course not. Zaros is a god. With him lies all authority. If I need to know something, I will be told it.",
    "Let's move on.",
    "Do you need another rest?",
    "We are almost there.",
    "I do not think we are in imminent danger, but we should not waste time.",
    "The Elder Halls of Freneskae are just up ahead.",
    "Player, someone is in here.",
    "Are you going to introduce me to your friend?",
    "What have you been able to determine so far?",
    "She was recently put out of her misery.",
    "One lies at the end of each of the tunnels.",
    "My people came to Gielinor around seven thousand years ago.",
    "I lived here on Freneskae for hundreds of years prior to that.",
    "Life was a lot harder here than on Gielinor, even accounting for the god wars.",
    "Living to several hundred years old was unusual, and I was one of the oldest and strongest of my tribe.",
    "To answer your first question, yes, or at least it has looked like this for as long as I have been alive, and as long as anyone I knew had been.",
    "This is just what Freneskae had always been like.",
    "Whether it looked different in some prior age, I cannot say.",
    "Mah was deformed. It is why her sisters abandoned her here.",
    "Can you imagine a more wretched form to be trapped in?",
    "That was a joke.",
    "Never mind.",
    "The elder gods are true gods, like my lord. I do not believe they can be so readily categorised.",
    "They may have superficial aesthetic qualities, but that does not define them or limit them.",
    "They are gods. They are beyond our comprehension.",
    "This was not Wen's doing.",
    "Magical energy has a resonance. A... flavour, if you will, or a smell.",
    "This whole place is suffused with Mah's resonance. A resonance that I - and all Mahjarrat - share with her.",
    "Mahjarrat are beings of magic. We are attuned to it, just as you can smell meat.",
    "There is another resonance on this egg, but it is not Wen's.",
    "In fact, it reminds me of- remember Zemouregal?",
    "He had a black stone he used for necromancy. He said he found it in Karamja and the fool thought it was obsidian.",
    "It was cold to the touch. Freezing, in fact, and it shared the same resonance as this corruption...",
    "But Mah is dead now, and poses no threat to Gielinor. This is a mystery for another time.",
    "Jas made a tremendous sacrifice when she gave up her unborn offspring.",
    "Do not confuse the primitive instincts of mere mortals with the thoughts of gods.",
    "You place great significance in your atavistic impulses. Your urges drive you to behaviours, and you never stop to question them.",
    "The Stone had long ago served its purpose. I doubt it had more significance to Jas than any other tool.",
    "I value all Mahjarrat. Those I had a hand in the creation of and those I didn't matter equally to me.",
    "Besides, the reserves of power in the Stone of Jas were not limitless.",
    "No. I have never touched it, I am no fool, but I have been in its presence many times over the millennia, close enough to sense it clearly.",
    "At the height of the empire it contained far more magical energy than it did when Lucien possessed it.",
    "Some time ago, I obtained a device that could be of use here from a construct of Jas.",
    "A blank observation crystal. Here, take it.",
    "This item is a relic of the creators of the universe. Be more careful with it.",
    "My research suggests that the observation crystal should function somewhat like an engrammeter.",
    "Traces of memories from the birth of the elder gods still linger in this cavern.",
    "If you can collect enough of it, perhaps we can sift through it for memories of that event.",
    "We should try.",
    "A blank observation crystal. I believe I gave it to you.",
    "This item is a relic of the creators of the universe. Be more careful with it.",
    "Collect memories from the wisps in the cavern so that we can search them for anything useful.",
    "You seem to have misplaced the blank observation.",
    "Make some inventory space and I can give it back to you.",
    "Collect memories from the wisps in the cavern so that we can search them for anything useful.",
    "Once you have enough memories, you should investigate the blank observation.",
    "I believe it should be able to absorb the memories.",
    "Research suggest is[sic] works like an engrammeter.",
    "Good. Give it to me.",
    "Nothing. Strange. Perhaps the memories are too faded.",
    "As we suspected, the hatchlings are the true threat.",
    "If we could stop the adults from touching their eggs, that could prevent them from hatching.",
    "Of course not, but do you have a better idea?",
    "We will have to build that bridge when we come to the river.",
    "For now we must at least locate the eggs.",
    "I anticipated this. That's why I sent Trindine on to Falador ahead of us.",
    "Saradomin's most prized possession is a crown which can locate elder artefacts.",
    "Possibly. It is an avenue I have not been able to pursue.",
    "He has not been seen on Gielinor for some time. You will have to try to contact him somehow.",
    "World Guardian, find Trindine in Falador. Impress the importance of your task upon Saradomin's lackeys and they can summon him.",
    "I cannot accompany you. My presence will not be of use when dealing with Saradominists.",
    "Ariane, your resourcefulness could be an asset in this matter. If you wish to continue down this path, meet me inside the dig site near Al Kharid.",
    "This will have to wait. Player, Trindine, were you successful?",
    "Who is this?",
    "A Saradominist?",
    "Ideally, yes. Right now we are trying to find the eggs.",
    "Yes.",
    "Then we will put you to use.",
    "The crown was a potential opportunity, but not the only one.",
    "We must pursue every lead we have.",
    "I have been drawing up a list of possible avenues of investigation.",
    "The most obvious are those most directly connected with the elder gods, mouthpieces known as the Kra.",
    "I have had dealings with them in the past. Ariane and I will interrogate them. Perhaps we can be more persuasive this time.",
    "Player, you will take Trindine to investigate three other potential leads.",
    "The TokHaar, Guthix and the Saradominist wizards.",
    "Indeed. However, my understanding is that he left many memories, some of which are still being discovered.",
    "Enough. We have tasks to do.",
    "Do you have any suggestions to offer?",
    "Then you have your assignment. Unearth Sir Vey Lance and acquire any information he may have on the eggs, or the elder gods in general.",
    "We will meet back here and discuss anything we turn up.",
    "Owen has not returned yet. Ariane is still recovering from our mission.",
    "The Kra would not relinquish their information to us, so we devised an alternative.",
    "We destroyed all four of them and rendered their cores into a gaseous concoction, which Ariane then inhaled.",
    "The plan was largely of her devising.",
    "She has yet to recover consciousness. What of your efforts?",
    "Where?",
    "That was the first place I looked. They are not there.",
    "Trindine, you find Sir Owen. The rest of us will go to the Heart of Gielinor and finish this.",
    "Things have changed here.",
    "The Heart was no longer necessary to my lord's designs, so our forces withdrew.",
    "I understand Zamorak also withdrew for reasons of his own, and Sliske's army crumbled and fled.",
    "Only the elves and that obscenity Gregorovic remain now.",
    "Be wary.",
    "Believe it or not, we come in peace.",
    "I don't have time for this. Stand aside, elf, or I will do what I must.",
    "I have faced armies greater than this and triumphed.",
    "A fortunate coincidence.",
    "You are right. With enemies as chaotic as ours, such openings are bound to occur.",
    "Where next?",
    "A secret door? How quaint.",
    "We must ascertain their status, and quickly.",
    "Another pressing matter demands my attention, yes, but first we must check on each of the eggs.",
    "We should hurry.",
    "Not with anything we have with us.",
    "The inside of these spheres is a thick soup of anima, more concentrated than anything I've ever felt before.",
    "The divine flesh of false gods such as Zamorak is so resilient that only a handful of things in this universe can damage them.",
    "It feels like... we should check another.",
    "It is the same with this one as the last.",
    "They are not completely asleep, or perhaps they sleep fitfully.",
    "...",
    "No, although the quantity would be trace at best, and this is not my area of expertise.",
    "Excuse me?",
    "Aurally yes, although the magical vibrations of the eggs are verging on painful to my senses.",
    "Let us check the last egg before we leave.",
    "And slightly disturbed, indeed.",
    "I cannot say for sure, but comparing this scene with what we witnessed on Freneskae, I would say not.",
    "The concentration of anima within, although incredibly high, is not overflowing in the same way we saw in the vision.",
    "This is all speculation. Based on what we've seen, perhaps.",
    "The death of a god or the destruction of an elder artefact would release a blast of energy.",
    "That would be my recommendation.",
    "For now, nothing. As I said, other matters demand my attention.",
    "The eggs are here, and they are secure.",
    "You may remain here and study them if you wish, though we should probably avoid making their location known.",
    "Zamorak or Saradomin would surely try to steal the power for themselves.",
    "Knowledge is power, is it not? We know more than we did before.",
    "Regardless, I have spent enough time here. I must report to my lord.",
    "What? He still has the crown?",
    "You've lost, Saradomin.",
    "Without your crown, you are powerless against servants of the true Lord.",
    "My Lord has commanded me. I will die before I fail.",
    "I apologise, Lord. Our intelligence was lacking.",
    "Of course, my Lord.",
    "Yes, my Lord. What of the eggs?",
    "Yes, Lord. They will destroy Gielinor.",
    "Yes, my Lord.",
    "Player. I am grateful for your assistance in this matter.",
    "My apologies, Player, but I have never been less than honest with my priorities. I did as my Lord commanded me to the best of my abilities.",
    "Perhaps you seek revenge. This is not the time to find it.",
    "My Lord's judgement told me otherwise.",
    "You have been of great use to us, but he does not trust your allegiances.",
    "You owe too much to the memory of Guthix, and to Gielinor, and to the many masters you have served, to be beyond question.",
    "I'm sure you have many questions. We have much to attend to, however.",
    "Since we first met I have valued not only your practical use, but also your companionship.",
    "But you have your responsibilities and I have mine.",
    "I will see you at the Monolith.",
    "When next we meet, it will be as enemies."
  ],
  "Seren": [
    "Once more, I have summoned the Burthorpe Council to discuss the very real threat of the elder gods.",
    "No, that isn't what I-",
    "...",
    "Very well. Since Kerapac's plot was little short of genocide, we will resume my original plan and attempt to placate my aunts through the creation of a garden."
  ],
  "King Roald": [
    "Yes! You must save us, Lady Seren! Tell us what to do!"
  ],
  "Zarador": [
    "Such times require strong leadership!"
  ],
  "Armadyl": [
    "The effect is getting stronger.",
    "I cannot stand against Seren. We have an arrangement.",
    "She seeks a path of peace out of compassion for her only true family.",
    "Do what you must, but I will remain with the council and aid in their efforts."
  ],
  "Player": [
    "Do you know a lot about how Seren's aura works?",
    "What did you have in mind?",
    "You're not Azzanadra? Who are you then?",
    "Wahisietel?",
    "Er, okay. So where is Azzanadra?",
    "How are you feeling?",
    "I'm with you so far.",
    "Alright. What's our first move?",
    "You think this is peaceful? It's a volcanic wasteland!",
    "*cough*",
    "Some of us can't just teleport everywhere.",
    "I know tele-other. It's easy to cast.",
    "I think it was Death and Icthlarin. Death said he knows of no Zarosian afterlife, and Icthlarin said he's never escorted anyone there.",
    "Are you saying Zarosians do have an afterlife?",
    "What's it like?",
    "You must have stories. Religious legends.",
    "Then how do you know it even exists?",
    "Fascinating.",
    "Somehow? You mean you don't know?",
    "I thought you were his most loyal follower.",
    "How can you place so much trust in someone that doesn't trust you?",
    "Isn't he?",
    "It's me, Player.",
    "Stop! That's Azzanadra.",
    "Yeah, we go way back.",
    "That's why we're here too!",
    "Yes! That's what we thought too!",
    "The fifth god, Mah, never left Freneskae.",
    "We think there are actually only three eggs on Gielinor. Jas transformed her egg into the Stone of Jas, and Kerapac destroyed it.",
    "I've never seen a wisp like this before. I probably shouldn't disturb it at the moment.",
    "Is there any way we can tell what happened?",
    "Has Freneskae always looked like this?",
    "Only hundreds of years? I thought you might be older.",
    "The eggs are all the same shape.",
    "I suppose, but I've met Jas and I've met Mah and they were very much unlike each other. Hard to believe they're the same kind of beings.",
    "Oh, it was a while ago now. You remember Sliske was trying to get the gods to kill each other?",
    "Well after he died I met Jas. Apparently he was working for her, or pretending to, or something.",
    "Cryptic. I didn't really learn anything.",
    "Well, Jas mostly looked like a huge clock or something, and Mah looked more like a humanoid. Scarred and deformed, but definitely humanoid.",
    "Where?",
    "That sounds a bit like Ful. She appeared briefly over Anachronia.",
    "Maybe. I suppose she could have had a body somewhere back there.",
    "What about Mah, though?",
    "Deformed into a humanoid?",
    "I'm sorry, what?",
    "I don't get it.",
    "Aren't they supposed to be different aspects of time? Change, stasis, undoing, something like that? I'm sure I read that somewhere.",
    "This was Mah's egg. Something happened to it and she was born deformed and insensible.",
    "Wen has an association with ice. Why would Wen sabotage Mah's egg?",
    "It really does look like the Stone of Jas, doesn't it?",
    "It's weird that she didn't seem angrier with Kerapac for destroying the Stone.",
    "You're saying that a tool made out of your own children wouldn't matter to you?",
    "They weren't?",
    "We know everything we need to from this sphere.",
    "That's all of the eggs. I should check in with Azzanadra and Ariane.",
    "There's no obvious sign of what happened when the eggs hatched.",
    "Well yes, but there's no clear order of events. Did the hatchlings destroy the planet?",
    "Yes, exactly. These clues are thousands, maybe millions of years old, though.",
    "Will that even work?",
    "Oh, this thing? Yeah I thought it might come in handy so I brought it along.",
    "Oh, that thing. I think I dropped it.",
    "I don't need any more of this energy.",
    "Nothing happened... I think I must need more energy.",
    "I think I have enough of these memories.",
    "I should show this to Azzanadra and Ariane.",
    "The blank observation absorbed the memories I collected.",
    "What?",
    "...",
    "What have we actually learned that's useful though? We already knew they were dangerous.",
    "We still don't know where they are or how to stop them.",
    "Are you sure?",
    "I suppose not.",
    "We're no closer than when we started.",
    "And you think it might be able to locate the eggs?",
    "Hello? Who's there?",
    "So you don't know?",
    "I can't hear you.",
    "Okay, I can hear you, but I won't.",
    "I've heard enough. I have a world to save.",
    "I'm not okay with this.",
    "Can I help you?",
    "Who are you meant to be?",
    "I see. What now?",
    "You're not worried that he might see through your disguise?",
    "Yes actually, I need to speak to him.",
    "I'm the World Guardian, I need to speak to Saradomin about a matter of great urgency.",
    "But this is urgent, there must be something you can do?",
    "I know what you mean. I'm trying to get an audience with Saradomin and I've been blocked at the first hurdle.",
    "Ooh nothing important, just, you know, how to stop the end of the world.",
    "I'm sure it can wait.",
    "The infant elder gods are waking up and if they hatch they'll kill all life on this planet.",
    "We were hoping to use Saradomin's crown to track down the eggs on Gielinor. But he's not here.",
    "So we need to go and speak to Sir Varze?",
    "We need to talk to Saradomin, in person. The priests won't summon him without your permission.",
    "I need to talk to him about the elder god situation.",
    "Would you be willing to give them a glowing review for Sir Amik Varze?",
    "Why not?",
    "Oh, you know; 'If you could just do me one small favour', that kind of thing.",
    "Always seems to happen when I need to do something urgently.",
    "Like stop the entire world from ending. But no, no, you're right, your petty little issue is clearly so important that we must endanger us all.",
    "No! No I am not! Every time I try and avert some horrifying catastrophe someone always has to give me some mindless little task before I can get there.",
    "Get me better armour! Bake me a cake! Find Mr Flibbles my delightful stuffed crocodile!",
    "Is it really so much to ask that we deal with the immediate problem and then I can come back and deal with the small stuff later as a miniquest or post quest content?",
    "No? FINE! Let's just move on shall we? You can give me your mindless task that will doubtless have more hurdles and then maybe we can not ALL DIE!",
    "Oh go f-",
    "*Sigh* Yes, it's fine. You want better equipment for your knights was it?",
    "Hello.",
    "Do you have a moment to talk about the White Knight recruits?",
    "I want you to give the White Knight recruits new equipment.",
    "I can see where this is going...",
    "There's paperwork.",
    "Nothing useful. Did you find anything?",
    "I've already got what I need from here.",
    "Rats! I can't fit this in my already full backpack. Maybe if I roll it up really tight I can...no let's not go there.",
    "I don't think I need another one.",
    "Silence... I don't know what else I expected.",
    "I need to be near Saradomin's throne before this will do anything.",
    "The elder god threat is much greater than when you were last here.",
    "It's only a matter of time before their eggs hatch and the newborn elder gods consume all the anima on the planet.",
    "We are concerned about Seren and the influence she has over the council.",
    "I am working with Azzanadra. We're worried about the influence Seren is exerting over the council.",
    "Oh, I'm working with Azzanadra, not Zaros.",
    "Finding the eggs is the first step to finding a true solution.",
    "The elder gods need to touch the eggs in order to hatch them. So if we can somehow intervene before then, we can prevent them waking.",
    "Yes. As the crown can track down elder artefacts, surely it can track down the eggs themselves?",
    "Why not join us on this quest? Your help could be invaluable.",
    "Happy to have you along. We should head back to Kharid-et and speak with the others.",
    "Saradomin didn't seem too pleased with you.",
    "We summoned Saradomin, but he wouldn't give us the crown.",
    "The crown was a dead end. What else can we do?",
    "What else is there?",
    "Yes. They were bizarre creatures. Surprisingly opinionated for constructs.",
    "A rebellious faction live under the volcano in Karamja. TzHaar City. We could start there.",
    "We can't ask Guthix though. Guthix is dead.",
    "That's right. There's a large repository of them near Piscatoris.",
    "Yes, Sir Vey Lance. Supposedly he gets his orders directly from Saradomin.",
    "Isn't that the whole hierarchy anyway?",
    "Oh yes, in TzHaar City under the volcano in Karamja.",
    "South of Draynor, right.",
    "Yeah near Piscatoris.",
    "Under the pool there's another chamber. It's full of automatons and memories.",
    "Wait!",
    "Emergency... uh... override!",
    "Wait! Emergency override!",
    "Wait! Emergency override!",
    "Memory... uh... core... uh...",
    "Core dump! Dump memory? Dump core memory!",
    "We need to access anything Guthix might know about the elder gods.",
    "This is Trindine. When I restore your memories, don't flag her as an intruder.",
    "I think they're the Archivist's memories? I don't understand how any of this works.",
    "That's all of them. I'd better get these back to the Archivist.",
    "What?",
    "Pretty much.",
    "There you go. Feeling better?",
    "...",
    "...",
    "Soooo...",
    "Did you ever meet Guthix?",
    "I met Guthix.",
    "Then he died.",
    "You never seem to mention Zaros.",
    "I don't know if you've noticed, but there aren't many Zarosians left.",
    "The others all seem pretty fanatical in their faith and loyalty.",
    "Then why continue to serve Zaros now?",
    "I thought that's what you did anyway. Isn't that basically what you were doing in Falador?",
    "What about the Zamorakians, then?",
    "What can you tell me about Sliske?",
    "I didn't know him back in your time.",
    "How do you feel about that?",
    "Can we access Guthix's memories now?",
    "The elder gods. Specifically, anything concerning the elder god eggs.",
    "There has to be something. I'm the World Guardian!",
    "Restricted memory, eh? That sounds promising.",
    "That's all six, I'd better put them on the plinths.",
    "I can place this on a plinth within the Hall of Memories!",
    "That's all six, I'd better put them on the plinths.",
    "Huh? There's no memory. I'd better check inside.",
    "I should have a look around for any further information[sic]",
    "It's an engram for the machinery upstairs.",
    "I need to take it to the fountain of energy outside.",
    "I've already found the engram.",
    "I should take this up to the memorial and see if the fountain can teach us anything.",
    "I've missplaced[sic] that engram. Perhaps I should search the bud in the centre for it again.",
    "Got what I came for. Don't need to disturb him further.",
    "Uh... I don't know. Nothing relevant to the eggs, at least. You?",
    "You've never been here before?",
    "It's a bit of an oversimplification, but close enough.",
    "Ga'al!",
    "I'm sorry, which Ga'al are you? You all look very similar.",
    "It's a Ga'al. They're born... malformed.",
    "Yes, I suppose so.",
    "I think maybe shadow magic?",
    "You can trust her.",
    "We're here for information.",
    "Come where?",
    "Right.",
    "How's it going?",
    "What about for you personally?",
    "How are things going for TokHaar-Hok?",
    "Now I don't understand. If you're not TokHaar-Hok, who are you? You look like TokHaar-Hok.",
    "Oh.",
    "Well actually that leads me to my next question.",
    "You guys made Gielinor, right?",
    "Did you make the elder halls?",
    "That's the one.",
    "Maybe...",
    "Er... we're trying to find it, and I wondered if you could tell us where it is.",
    "That's... a no, then?",
    "You don't want to join the TokHaar?",
    "Actually I have. We're trying to find the elder halls.",
    "The elder gods. The... masters. After they created this world they laid eggs.",
    "The place where the eggs are hidden is called the elder halls. We need to find it.",
    "The TzHaar have never heard of the Elder Halls, and the TokHaar know where they are but won't tell us under any circumstances.",
    "The TokHaar are a mountain-sized, sentient, hive-minded, elder artefact filled with lava, that create and destroy massive, obsidian bodies at will.",
    "Probably best avoided. Did you find anything in the library?",
    "How much time?",
    "Maybe that could be a backup plan if nothing else pans out.",
    "Goodbye, TzHaar-Ga'al-Kot.",
    "Yes, hello. We'd like to enter the Wizards' Tower, please.",
    "This is, uh, Wizard Trindy.",
    "Of course. We're here researching the elder gods to try and save the world.",
    "Yes, I was there.",
    "Thanks!",
    "Not yet. Back in a mo.",
    "There's nothing about the elder gods here.",
    "I've already looked here.",
    "...",
    "Oh, it's about care homes in Varrock.",
    "Why do they have a whole section of old advertisements?",
    "Ooh, a first edition!",
    "...",
    "The foreword is written by the Makeover Mage?",
    "...",
    "Zaros died because he tripped and fell?",
    "He did, sixteen times!",
    "This version doesn't even mention the elder gods.",
    "It's pronounced 'Sliskay'.",
    "Actually I think you would have gotten along pretty well.",
    "Yes, but only that time I met Jas with Seren and Zaros. Nothing we don't already know.",
    "Come to think of it... who wrote this book?",
    "...'Professor Soran'?",
    "I'd better see if Trindine's had better luck.",
    "I found that someone has been documenting my recent activities, but there's nothing in that section concerning elder gods. You?",
    "I would have thought Azzanadra would come up with better leads.",
    "Have you considered not being the ancient spy of a dark lord?",
    "We still don't know where the elder eggs are.",
    "What's wrong with Ariane? And where's Sir Owen?",
    "What did you do to her?",
    "What sort of alternative?",
    "Why?",
    "Did you at least learn anything useful?",
    "All three were dead ends. Something is going on in TzHaar City but we didn't learn anything about the eggs.",
    "Are you okay?",
    "Are you okay?",
    "Oh?",
    "Please, we need to pass. We're trying to save Gielinor from the elder gods.",
    "We're working with Seren's council... sort of.",
    "I'm not sure it was a coincidence...",
    "How do we open it?",
    "I don't think there's any doubt that these are the eggs of the elder gods.",
    "We should fully investigate this egg.",
    "We've already looked at this egg, I should take a look at the others.",
    "What is?",
    "Seren told me she could sense them from afar.",
    "She said they'd become disturbed recently, as a result of Kerapac trying to poison them with his device.",
    "Quiet!",
    "Uh, I said it's quiet in here.",
    "She said another huge release of shadow anima would probably cause them to start hatching.",
    "That we know of, only Kerapac's device.",
    "Yes. Does it look like they're going to hatch naturally any time soon?",
    "So we should avoid killing any gods in this chamber?",
    "So what do we do now?",
    "We still haven't done anything to avert the threat.",
    "Yeah... I thought he'd have a plan to actually stop them from hatching.",
    "You're right. We need to check.",
    "I have a feeling that Trindine may not have been completely honest with me.",
    "I'm going to go and ask her about it.",
    "Yes, you're right. Time to go back to Kharid-et.",
    "Wow. Even from here you can feel an immense power coming from the egg.",
    "I don't have anything that can be used to charge this.",
    "There's no one here.",
    "Azzanadra did say he supercharged her after her release to make up for missing so many rituals.",
    "Maybe we can find some of her memories. I don't see any wisps around, though.",
    "Oh. How do we get there?",
    "I think I see some over there.",
    "Maybe that's enough? What does it say?",
    "She was planning to steal something?",
    "Steal what, though?",
    "When I was here earlier, was Trindine asking about anything other than the eggs of the masters?",
    "Questions about what?",
    "Was there anything in particular she wanted to know?",
    "What's the Locator?",
    "Thanks Ga'al.",
    "Yes?",
    "Wait, what? Where is what?",
    "Hold on, slow down. What book?",
    "Trindine stole a book?",
    "I'm sorry. I think she may have been deceiving me. What was the book about?",
    "So you're saying that if Saradomin is separated from his crown, he loses his power?",
    "Interesting.",
    "I will try to return the book if I can. Right now I have the feeling something terrible is going to happen.",
    "What?",
    "Which memory? Which user?",
    "What was in that memory?",
    "Thank you, Archivist.",
    "What do we do now?",
    "Let's talk to Ariane. Maybe she can help figure out exactly what Trindine is planning.",
    "That's fascinating, but I think we may have a problem. Trindine was researching Saradomin's crown.",
    "I don't know why, but at all the locations we visited together, while I was researching the eggs, she was researching the crown.",
    "I think they might be trying to steal it.",
    "I know. So what's going on? If it was something helpful, why wouldn't they just tell us?",
    "Why?",
    "No, I don't think I do.",
    "Oh, yeah, of course. What about this? I absorbed some of her shed anima in Kharid-et.",
    "Whatever they're planning, it can't be good.",
    "I'm not sure who I trust less.",
    "Wait!",
    "Zarosians are here, they're planning something during the ceremony!",
    "Sir Vey Lance is secretly a demon! He's going to turn the Temple Knights against you!",
    "Let things play out for now.",
    "Err, who, me?",
    "I, uh, I think it's safe to say I couldn't have stopped Zaros if I tried.",
    "Uh... what now?",
    "I see the whole gang is here.",
    "Wait, what?",
    "What about Sir Owen?",
    "You didn't go with them?",
    "What are you going to do now?",
    "Yes I worked with 'Reldo' recently. He can be trusted.",
    "If you do go back, try not to disturb the eggs.",
    "Do you have anything for me?",
    "Thanks. Do you have anything else?"
  ],
  "Icthlarin": [
    "As for me, I will not work with a traitor.",
    "On the contrary, the past will always come back to haunt you, and the world is too precious to leave to the machinations of apostates.",
    "I do not trust you, Azzanadra, and World Guardian, I would counsel you not to trust him either.",
    "This Mahjarrat is shrewd and well-spoken, but his loyalties ever lie with his master and no one else.",
    "Loyalty is only as virtuous as the lord you serve, and your lord is far from virtuous.",
    "Enough, Azzanadra. Zaros does not need you to defend his honour."
  ],
  "Dr Nabanik": [
    "Hello, old friend. Welcome to the Kharid-et Dig Site.",
    "Not so loud! I'm not Azzanadra, I'm just filling in for him. Apparently he had more important things to do.",
    "Your wisest and most humble friend from Nardah.",
    "Shh! Yes. Do me a favour and just pretend I'm Dr Nabanik.",
    "He might be inside the excavation. Try the main fortress area."
  ],
  "Trindine": [
    "I guess so. He stopped talking and left so assumed we were done.",
    "He just asked me a bunch of questions about the shadow realm.",
    "No idea if I told him anything he didn't already know. It's hard to tell with that face.",
    "I'm all caught up on current events.",
    "Seems like it's just been one long disaster while I've been gone.",
    "War, genocide, genocide, war again, apocalypse.",
    "I'm back now though so we should be good.",
    "So what's the plan, boss?",
    "No?",
    "You should go meet Azzanadra at the World Gate. It's in Kandarin, southwest of the Tree Gnome Stronghold.",
    "Bit of romantic tension there maybe?",
    "My dear, that's why you're not going.",
    "Didn't you mention that the Temple Knights get secret orders?",
    "Sure you did. The temple knights have a secret leader.",
    "Have you met him?",
    "Spy stuff. I love it.",
    "If he's so well-informed, isn't it possible that he knows something about the elder gods?",
    "We still need to ask the TokHaar if they know anything about the eggs.",
    "We still need to visit the Wizards' Tower and see if they know anything about the eggs.",
    "Didn't you say there was a repository of Guthixian memories?",
    "It's picturesque, I'll give it that. You're the expert here. What do we do?",
    "Of course it is. Why wouldn't it be? Lead on.",
    "I can't believe I'm going to die in this dump.",
    "Divination? More like Divina-I'm-not-doing-it.",
    "I don't want to get bits of Guthix on my fingers.",
    "It's still divine energy. Would you want to pick up pieces of floating flesh?",
    "Is this what your life is usually like?",
    "Just wandering around collecting people's junk?",
    "...",
    "You've got to be kidding me.",
    "Oh no. We're not going to make small talk, are we?",
    "We knew of Guthix back during the Empire, of course.",
    "He had pagan cults all over the continent, and we were pretty confident he wasn't mythological.",
    "I spent a lot of time rooting out druidic sects, but we never heard a peep from the god himself.",
    "So I've heard. Never thought Sliske would manage to pull off something like that.",
    "The big guy? Why would I?",
    "Oh, I'm not devout enough?",
    "You're not wrong, to be honest.",
    "Azzy has all this guff about a grand plan, but it was never a religious thing for me.",
    "Back during the Empire, things were better when everything was under control.",
    "Besides, the Mahjarrat are my friends, as well as my people. We've been through a lot together. We came to this world together.",
    "What's the alternative, hide myself amongst the humans, call myself 'Innedirt'? No thanks.",
    "Only temporarily. I couldn't live like that forever.",
    "I heard Wahisietel has been doing it for thousands of years. Gross.",
    "Seriously? Those traitors? I'd die first.",
    "I thought you were already acquainted.",
    "Well, as a boss he was kind of irritating, really.",
    "I mean don't get me wrong, he was pretty hands-off most of the time, which I appreciated.",
    "A lot of the time you barely even knew whether he was there at all.",
    "But the incessant, neverending, ceaseless practical jokes!",
    "I don't think he could even tell the difference between childish pranks and lethal traps.",
    "One time I found a black chinchompa - you know, the really explosive ones - on my chair. He said he thought it was a whoopie cushion.",
    "I heard you killed him though.",
    "I'm not saying I wanted him dead or anything but...",
    "It sounds like he went pretty badly off the track.",
    "Not like he even tried to rescue me from the vault.",
    "Here we go again.",
    "What's that?",
    "What do we do with it?",
    "Okay, you check that out, I'll take a look around here and see if we missed anything. See you outside.",
    "Anything useful?",
    "No, nothing about the eggs.",
    "Fascinating.",
    "No. The Empire never successfully invaded Karamja.",
    "I've read up on them now, of course.",
    "The elder gods made a lava bath which spits out lava monsters to make planets.",
    "Some of the lava monsters don't want to get back into the bath and get melted down, so they live in a volcano instead.",
    "That about right?",
    "Who's this funny little fellow?",
    "Like Mah?",
    "Excuse me?",
    "What is it talking about?",
    "I spent thousands of years in the Shadow Realm. Some of it must have rubbed off. I'm surprised this thing can detect it.",
    "See if this lot know anything useful. I think I saw something like a library on the way in, I'm going to check that.",
    "Come and find me when you're done.",
    "Any luck?",
    "Hm... torture?",
    "So torture is out?",
    "They use these memory-orb thingies. The Ga'al has been helping me.",
    "Between us, we could probably scour the place, given enough time.",
    "A few weeks. Maybe a few months.",
    "I love it.",
    "This has got to be the longest con in history.",
    "A five thousand year undercover operation. And still undetected!",
    "I'm not sure if that counts as colossal success or colossal failure.",
    "I just need to figure out what his code phrase is so he'll recognise my authority.",
    "I have to say, as much as Sucellus was a gluttonous dolt, it was ambitious to plan a heist like this.",
    "It almost seems like something Sliske would try to pull off.",
    "Omnes una manet nox, Grand Master Veilinius.",
    "About five thousand years, apparently.",
    "Yeah, sorry. I think your handler died about four thousand, nine hundred years ago.",
    "Well, while you've been here living a life of luxury, I was trapped in the deep Shadow Realm under Kharid-et.",
    "Will you though?",
    "Well, you've seen behind blue boy's curtains, haven't you? Maybe even more so than Veilinius here.",
    "I mean, he claims the authority of a god, but he isn't a god, is he?",
    "He's just a man. And a fallible one at that.",
    "The choice seems obvious to me.",
    "You can continue to serve at the whim of a jumped-up warlord, or you can join us and actually accomplish something with your life.",
    "No, just unconscious. We can tie him up here.",
    "Well, he grows on you. And is it really necessary to murder everyone?",
    "Two things actually. The boss wants his knights back, plus we still need to steal the crown.",
    "That's the idea.",
    "Unlikely. He's delegated this task to us.",
    "Ah, yeah we already have that. Pontymax thought we might need it.",
    "Tell me more...",
    "Good to see you again.",
    "Somehow I doubt that.",
    "I returned that book, by the way. I don't want anyone thinking I'm irresponsible.",
    "Oh, I forgot about him. I'll go let him out now.",
    "Toodles!"
  ],
  "Ariane": [
    "Who is there?",
    "Oh, Player! I'm glad to- look out, a Mahjarrat!",
    "Azzanadra, high priest of Zaros? Azzanadra, who transcribed the ancient magicks in the pyramid at Jaldraocht? That Azzanadra?",
    "I'm Ariane. I'm here because... I saw something.",
    "After my friend Xenia died, I started having visions. They're not completely clear, but I believe our world is under threat.",
    "The elder gods will rise and destroy Gielinor. I'm sure of it!",
    "The Council of Burthorpe don't seem interested in doing anything about it, so I've been searching for answers.",
    "I thought the birthplace of our universe might be a good place to start.",
    "It's not the adults though. It's the eggs that are the danger.",
    "I've only just arrived. I notice there are five eggs here, but only four elder gods on Gielinor.",
    "Oh, hence, Stone of Jas. Makes sense. Well, let's examine the egg fragments closely and see if we can work anything out.",
    "We need to examine all five of the old eggs.",
    "This one just looks rocky.",
    "Only in a very broad sense. The eggshells are still here, and this world has been devastated.",
    "Presumably it was the hatchlings but it was so long ago there's no way to be absolutely confident.",
    "Wouldn't you expect that?",
    "Wait, you met Jas? The Jas? Creator of Gielinor?",
    "Yes, he put that big scoreboard up in Varrock. It didn't seem to really go anywhere in the end.",
    "What was she like?",
    "And she didn't look anything like Mah?",
    "I think... I think I might have seen them.",
    "The visions I mentioned. I saw the adults... I think. Perhaps the young? It's unclear.",
    "They shared a form. A sinuous body, endless in length, bursting into a flower at the head.",
    "Oh yes, I heard about that. Is it possible you only saw Jas's head?",
    "It's still hot. It is magical, I suppose.",
    "Are the elder gods associated with the runic elements?",
    "Ful seems to be fire, Wen is ice - perhaps water? Bik is either earth or nature and Jas is... time?",
    "I don't know of a time rune, but I know new runes have been discovered before.",
    "I don't know what Mah could be. Shadow, perhaps? But shadow isn't a rune either.",
    "We'd better hope otherwise if we're going to save Gielinor.",
    "There's something on this one. A spiral of a different substance.",
    "It's icy. I can feel the cold radiating from here.",
    "How can you possibly know that?",
    "How can you detect it?",
    "Other than the hellscape outside, you mean?",
    "Or maybe the planet had to be destroyed in order for them to hatch?",
    "I've heard of the practice of sifting for memories in anima but it's not something I've mastered yet.",
    "Let me try. I'm a seer.",
    "This is... oh my. This is like what I saw. What brought me here.",
    "I will try to show you. It's powerful.",
    "This world was lush, once. Green and flourishing. A perfect womb for the sleeping gods.",
    "Within their shells, they slumbered in a yolk of incredible power.",
    "The currents of magic drove more and more energy into the eggs, until they reached a bursting point.",
    "Sensing the impending birth of their young, the adults pressed in close.",
    "With a touch they imparted their identities and their memories.",
    "The eggs burst open, and the hatchlings within emerged, ravenous.",
    "Their mere presence drained all life from the cavern around them.",
    "Within moments every other living thing nearby was dead, drained of all life.",
    "Nothing could stop them. The world was doomed.",
    "Further and further their reach expanded, blanketing everything.",
    "Minutes later, Freneskae was a desolate husk.",
    "The sated hatchlings travelled out into the universe to remake it.",
    "In time they grew old and hid eggs of their own beneath the surface of Gielinor.",
    "When they hatch, our world will suffer the same fate as Freneskae.",
    "We must stop them... somehow.",
    "...",
    "We need to stop the same thing happening to Gielinor.",
    "In the past the elders touched the eggs.",
    "How can we possibly stop the elder gods from touching something? Don't they have the power to destroy worlds?",
    "I though Saradomin was missing?",
    "I'll be there. Good luck in Falador, Player.",
    "But is it Zaros's preferences that make something righteous, or does Zaros only prefer things that are already righteous?",
    "Owen!",
    "Player, didn't you meet them when we were trying to stop Xenia?",
    "Creations of the elder gods. They shaped Gielinor, or helped to. Maybe they even created the Elder Halls?",
    "By wizards you mean the Wizards' Tower, right?",
    "They're an elitist clique of uninspired fossils.",
    "Yes, it makes sense to send you instead. You'll fit right in.",
    "...",
    "I know where the eggs are.",
    "The Heart of Gielinor.",
    "Take me. I will show you.",
    "I'll be fine. We need to go now.",
    "The way to the eggs is close to the entrance. We don't have to go far.",
    "Right here. The floor. This central slab.",
    "No, not secret exactly. Just very carefully made.",
    "It's supposed to open for TokHaar, but I have a feeling that a lava rune might do the-",
    "Ah, there we go. After you.",
    "By Saint Elora, there they are!",
    "Do you have somewhere else you need to be?",
    "We should hurry up and investigate these eggs.",
    "Their appearance matches the broken shells we found on Freneskae.",
    "Can we do anything with them? Destroy them?",
    "We don't know about these beings. Maybe that's normal.",
    "Can you detect any trace of the shadow anima Kerapac was producing?",
    "This one's the same. Seemingly healthy.",
    "Did Seren tell you anything else?",
    "What could cause that?",
    "And Ful destroyed it?",
    "What about something artificially increasing the concentration of anima nearby?",
    "Could that increase the concentration high enough for them to start hatching?",
    "What could do that?",
    "That's it?",
    "That was abrupt.",
    "Well, I'm going to stay around here and study them. Perhaps I can figure something out.",
    "I'm sorry, did you say something?",
    "Alright, well, you let me know how it goes.",
    "I'm going to prioritise studying the eggs so we can save the world.",
    "I thought you said you were going to question Trindine?",
    "Oh, Player. You know these eggs are fascinating. I knew they were powerful but...",
    "Each egg is like a million- no, a trillion runestones, just compressed down into a tiny space.",
    "You could power... well, you could power anything.",
    "What?",
    "Why?",
    "But we already found the eggs.",
    "Do you have anything of hers? Something personal?",
    "Well, I'm a seer. If I have something of hers, maybe I can spy on her.",
    "Anima containing her memories? Yes, that could work.",
    "I've had a look at the blank observation. Make some inventory space and I can show you the memory.",
    "Here, take the blank observation back and I can show you the memory.",
    "Let me see... oh, wow!",
    "This is going to be intense. Hold my hand.",
    "They've captured Owen. And they're planning to steal Saradomin's crown!",
    "We have to get to Falador immediately.",
    "Apparently they don't trust you, or they would have included you in their plans.",
    "We have to get to Falador immediately.",
    "Hurry, they're about to begin.",
    "What should we do? I've never been a Saradominist, but can we really let the Zarosians finish whatever they're planning?",
    "If you're sure. I'll follow your lead.",
    "No. I can see where Azzanadra is coming from, but I'm not interested in serving at the whim of some dark lord.",
    "I don't need a superior being to give my life meaning. I create my own meaning.",
    "Despite what Zaros said, I don't believe the threat is gone.",
    "There must be some researchers I can work with. Maybe I'll quietly contact Reldo.",
    "We should stay away from the elder halls for now.",
    "The Zarosians don't seem interested, and we don't want to attract unnecessary attention.",
    "Of course. I'd hate to be responsible for the end of the world.",
    "I don't have anything for you currently.",
    "I believe you misplaced this, you should look after it this time.",
    "I do have something for you but you don't appear to have any space for it."
  ],
  "Shadow Voice": [
    "Finally they've left us in peace.",
    "This is your conscience speaking!",
    "Have you considered... dying in a fire?",
    "We're your conscience!",
    "Yes we are! Kill people!",
    "Ooh, I have a better idea! Maybe we're an old friend, come back to haunt you!",
    "It's me, your best friend! Woo! How could you murder me?!",
    "Maybe we're a Freneskaen brain worm, crawling around inside your head, talking to you.",
    "It could be.",
    "Okay then, Mister Negative. What do you think we are?",
    "WRONG! SO wrong! It's a good thing I'm here to make up for your crippling stupidity.",
    "Either that, or we're just not going to tell you.",
    "Speak for yourself. Personally, I intend to be as unhelpful as possible.",
    "That's not going to work. The call is coming from inside the house!",
    "Haha, good luck with that! What are you going to do, kick yourself in the head?",
    "Actually that's a great idea, why don't you do that now?",
    "I doubt it was anything useful.",
    "Well? Come on loser, let's go. You're the only one with legs.",
    "His ego certainly reaches the heavens.",
    "Haha! You're not as famous as you think you are!",
    "Haha! You're not as famous as you think you are!",
    "None that would want to talk to us again.",
    "Oh, how dreadfully boring.",
    "Because they hate you.",
    "Someone should fix this.",
    "Someone called 'Slisk' and something about a game.",
    "Never heard of them.",
    "Whoever they are, they sound like a bore.",
    "Quest complete? Really?",
    "If you can stop patting yourself on the back for a second you might notice something important.",
    "Stop being a simpleton and pay attention.",
    "Who found the eggs?",
    "Obviously. But who actually found the Elder Halls?",
    "Exactly. Bunny ears made a beeline for the finish line while we traipsed around one dead end after another.",
    "None of it relevant though.",
    "And the crown too. Why the plan with the crown?",
    "Surely between them this crowd of ancient wizards would know that the crown wouldn't work.",
    "Even if they didn't know, surely they'd realise that Saradomin wouldn't help us.",
    "What about Trindine? Why was she even there?",
    "We got her into all those difficult to enter places, but all she did was stand around while we found nothing.",
    "Back to Kharid-et. We deserve an explanation!",
    "Curses, she's evaded us again!",
    "Smell what, your awful feet?",
    "Leaking? Why would she be leaking.",
    "You idiot, they're deep in the shadow realm.",
    "*sigh* Just go stand near one of those big pylons. That will fill you up with something horrible.",
    "Then all you have to do is go and stand near the shadow anchors. Hit enough of them and it should work.",
    "Oh finally, that feels so much better.",
    "Ugh! I hate Mahjarrat memories!",
    "You can, imbecile.",
    "It sounds more like someone else was planning to steal something, and she's trying to find them.",
    "I suppose we have to backtrack to all the places we've already been.",
    "Then we'll see how right I am.",
    "You don't say.",
    "You don't say.",
    "You're so naive. We still need to check the Wizards' Tower and the Hall of Memories.",
    "You're so naive. We still need to check TzHaar City and the Hall of Memories.",
    "You're so naive. We still need to check TzHaar City and the Wizards' Tower.",
    "Trindine is clearly researching Saradomin's crown and you think it's just a coincidence?",
    ":[sic]",
    "We still need to check TzHaar City.",
    "We still need to check Wizard's Tower.",
    "We still need to check the Hall of Memories.",
    "There, you see? I told you.",
    "Oh, I don't care. I just wanted him to admit I was right.",
    "She's probably still wasting her time at the Elder Halls.",
    "Hey dummy. You literally have a magic battery full of her memory. Can't get more personal than that!",
    "It would probably be useful if you actually had the blank observation with you...",
    "So much for the World Guardian. More like... Stooge Guardian."
  ],
  "Light Voice": [
    "Cut that out!",
    "We're...",
    "Wait, what are we exactly?",
    "We are definitely not your conscience!",
    "Stop that!",
    "No! Not that either!",
    "No!",
    "Is that a thing that exists?",
    "I am not a worm!",
    "Er... maybe the stress is finally getting to you?",
    "It's a lot of pressure having to save the world all the time, maybe this is-",
    "We just want to help!",
    "I'm terribly sorry, but I think you're stuck with us.",
    "Well, we're not going anywhere, so you might as well just get on with whatever it was you were doing.",
    "Oh that's right, you need to meet Trindine in Falador.",
    "Do we even know any Temple Knights?",
    "It would never even occur to them to push a pillar onto her.",
    "That looks promising!",
    "What's this one about?",
    "'Slisk'? Who's that then?",
    "Does it mention the elder gods?",
    "All's well that ends well.",
    "In fact, I'd go so far as to say...",
    "QUEST COMPLETE!",
    "Stop trying to spoil it! I never get to say quest complete! You're just jealous!",
    "To what?",
    "We all did! We worked as a team, powered by pure friendship!",
    "Well... Azzanadra and Ariane did.",
    "I'd hardly call them dead ends! We learned all sorts of interesting things.",
    "Well, not directly relevant, no, not per se.",
    "The crown is a powerful artefact! It was a good lead!",
    "They're not omniscient just because they're old. Look at you, you're practically senile!",
    "This is all circumstantial nonsense.",
    "Well, she was uh... commentating? Maybe she was there to provide comic relief?",
    "Do you smell that?",
    "Anima! And not just any anima. I think our friend Trindine is leaking.",
    "Ooh, I don't like it. What was that?",
    "Let's just get the four easiest ones. I feel like we're in a hurry.",
    "Three more.",
    "Two more.",
    "Once more.",
    "Let's just find the memories quickly. Do you see any Trindine wisps?",
    "Ooh, that's plenty. Try the blank observation now!",
    "Can anyone read them?",
    "Oh that's right! Okay, press the thingie against your forehead and let's see what's in there.",
    "For the record I don't support this enabling behaviour.",
    "But the places we visited with Trindine were the Wizard's Tower, the Hall of Memories and TzHaar City.",
    "Isn't that what Saradomin's crown does?",
    "We've[sic] already have what we need here. We should look for clues elsewhere.",
    "This just seems like a string of unlikely coincidences. La-la-la!",
    "Yes!",
    "Fine! I admit it! It's a miracle. You were right.",
    "Maybe we should stop them?",
    "A secret plot! Intrigue! Betrayal!"
  ],
  "Sir Upticious": [
    "Pssst! Player, over here!",
    "It's me, Trindine. Do you like my disguise?",
    "I am Sir Upticious! White Knight extraordinaire. I love Saradomin and I enjoy not having to make any decisions for myself.",
    "Well we need to find a way to summon and speak to Saradomin, so I would imagine his throne room would be the place to be.",
    "Looking like this? I'm so dull he won't give me a first glance, let alone a second.",
    "Anyway, he might be able to see through the disguise of a lesser Mahjarrat, but there's a reason I'm a spy.",
    "But just in case, you go look upstairs and I'll poke around down here for a minute.",
    "Go on, you head upstairs to Saradomin's throne room. I'll look around down here.",
    "We should talk to Sir Grumpalot here.",
    "I know just what you mean. Rules are like lovers, much better if they can be flexible.",
    "Well met fellow sir knight! I am Sir Upticious, what name do you bear?",
    "Apparently so.",
    "If only there was a brave knight who could help us resolve this conflict.",
    "We should talk to the priest here.",
    "What about our souls? Don't they matter?",
    "I think you need to talk to that pompous looking guy. Sir Varze wasn't it?",
    "She's really done a number on him.",
    "Me? Oh nothing...er...sir.",
    "Is he the winged guy in the courtyard downstairs?",
    "I have noticed that.",
    "Among the other knights I mean. I myself have always wanted to be a Temple Knight, you lot get much more done.",
    "Well that's the difference between the White Knights and Temple Knights isn't it? Blind faith?",
    "Although I guess the Temple Knights get their orders from one person, who they've never met, so blind faith runs in the family.",
    "Oh absolutely. There's nothing better than knowing your boss has a direct line to an absent god. Really comforting.",
    "Ha ha ha! You tell em kid!",
    "This is why Temple Knights are much better than White Knights!",
    "You guys see a need and you fill it. No questions, no forms, no hoops to jump through.",
    "If something needs to be done, you get it done.",
    "We should talk to Sir Vyvin.",
    "That's obviously not what he meant...",
    "You're doing this on purpose...",
    "We should talk to Sir Grumpalot here.",
    "There doesn't seem to be much here?",
    "You and Sir Nastyskincondition here should take a look at that safe.",
    "Sir Owen, I'll stay here with you, but before I do I feel it only fair to be honest with you.",
    "I am not what I appear to be...",
    "Trindine.",
    "I genuinely thought this would be more of a dramatic moment?",
    "I'd been practicing[sic] an elaborate reveal spin and everything.",
    "Fair enough.",
    "Okay Player, we'll be by Saradomin's throne once you've got the ritual components.",
    "Isn't there some ridiculous ritual you should be doing? Ringing a silent bell or some such nonsense.",
    "Sir Grumpalot here probably remembers it better.",
    "Two more to go.",
    "Killing everyone and everything in the process.",
    "Oh yes. Good idea Player, you'd be a great help Sir Grumpalot.",
    "One moment, Owie.",
    "We've been rumbled. Blow the damn horn!",
    "We've been betrayed!",
    "The crown is vulnerable! Blow the horn!"
  ],
  "Father Frith": [
    "Welcome child. Do you seek Saradomin's holy light?",
    "Ha. Oh bless you my child, but one cannot simply chat with the great Saradomin!",
    "His attention is required to move the stars and to keep all of creation functioning as it should.",
    "I know the sweet serenity of basking in his divine radiance. But I'm afraid he is not available for chitter-chatter with just anyone.",
    "Should I?",
    "Ah, we all seek his wisdom. But I am sure a priest can help you.",
    "I'm sorry, perhaps I have spent too long in the cloisters, but that name means nothing to me.",
    "Ah, well, I'm sorry but that's simply not possible right now.",
    "The great and mighty Saradomin is not on Gielinor at this time. He is visiting other worlds spreading his wisdom.",
    "My hands are tied child.",
    "Perhaps you can find what you seek elsewhere. I believe we have a visiting Temple Knight you might be familiar with in the war room on the ground floor.",
    "They may be able to assist you further.",
    "I am sorry that I cannot help you. Perhaps one of the knights can help you? I believe you are familiar with our Temple Knight visitor in the war room downstairs.",
    "Watch your tone child, this is a holy place.",
    "Where the mighty Saradomin held court. The one true god walked here.",
    "Of course. In his boundless wisdom, Saradomin has given we high priests a means with which to summon him if the need arises.",
    "No.",
    "The mighty Saradomin is spreading his wisdom to other worlds. He is saving countless souls.",
    "There is no greater mission.",
    "Well, even if that were the case, it is not my decision to make. As this is the fortress of the White Knights may I suggest you bring your concern to Sir Varze?",
    "As I said, my child, perhaps Sir Amik Varze can assist you.",
    "Blessed be Saradomin my child!",
    "I shall atone for my mistakes. Perhaps one day I can be worth[sic] again in Saradomin's eyes."
  ],
  "Sir Owen": [
    "Ignorant fools. Tradition should guide you, not shackle you.",
    "Huh? What?",
    "Who are you?",
    "Sir Owen, of the Temple Knights, at your service.",
    "I apologise for my outburst, I'm just getting frustrated.",
    "Oh nothing. Sometimes I forget that the White Knights are more... rigid in their practices than we Temple Knights.",
    "It can make it frustrating to get things done.",
    "Well, I've managed to keep this corruption under control. Can't get rid of it entirely, but it's not getting worse.",
    "Now, I'm just getting frustrated at White Knight bureaucracy.",
    "What do you need to see him about?",
    "I'm sorry... what?",
    "And they just sent you away?",
    "See! This is exactly the maddening rigidity I was talking about. It's a literal end of the world scenario and they're not willing to even consider calling Saradomin back?",
    "Come on, let's both go and talk to the priest. Maybe we can get somewhere together.",
    "Ok, let's talk to this priest.",
    "We need to speak to Saradomin. Now.",
    "This is a castle armoury.",
    "One of several gods. Granted I prefer this one to most, but we aren't served by caving into mythological thinking.",
    "We need to speak with Saradomin. He must have left a means to contact him.",
    "Great, do that then.",
    "What? Why not?",
    "We ARE all in danger! That's why we need Saradomin!",
    "And the hunt through the red tape begins. Come on Player, Saradomin willing we can get this done quickly.",
    "We should be able to find Sir Amik Varze in the tower on the west side of the castle.",
    "We should talk to Sir Amik Varze.",
    "Can't you summon him now and then ready the recruits?",
    "*Sigh* Very well. We'll speak to Padomenes.",
    "This is why I always get so frustrated coming back here to Falador.",
    "As a Temple Knight, I do what needs to be done. My faith is my sword and shield as I enact the will of Saradomin.",
    "But here, among the White Knights and the priesthood, their faith feels more like chains weighing them down. They're trapped by tradition and frozen by bureaucracy.",
    "It feels so frustrating after returning from the burial grounds. Working with Saradomin side by side as we did what we could for the centaurs.",
    "Saradomin was more than just some mythical figure. He was a righteous warrior and he used his power without restraint to try and help Fern and her people.",
    "Then I come back to this and it feels like they're all following a Saradomin I don't recognise.",
    "That's different.",
    "Sir Vey Lance gives us orders that help people. We do real good, enact real change.",
    "And his orders come direct from Saradomin. Not filtered through layers of priestly nonsense.",
    "*Sigh* Anyway, you don't want to hear any more of me ranting. Let's go speak to Padomenes in the courtyard downstairs.",
    "Yes, so moving on very quickly. What was the problem again?",
    "So get them better equipment?",
    "So get them better equipment?",
    "*Sigh* we'll go talk to him then.",
    "He should be in the office next to Saradomin's throne room.",
    "Is it really so hard to equip your soldiers properly?",
    "They're White Knights for Saradomin's sake. They'll find themselves facing black knights, demons and worse before too long.",
    "It's not like there isn't enough money here, or ore. The church of Saradomin is the largest religion, we have connections with every major human kingdom.",
    "There's plenty of resources to make sure these knights are ready for battle. This shouldn't be so difficult.",
    "Exactly! Can you imagine this lot trying to deal with Mother Mallum and her slugs?",
    "We'd all be dead, or worse, by now.",
    "*Sigh* Here I am ranting again. Sorry, let's go and speak to Sir Vyvin.",
    "We should talk to Sir Vyvin.",
    "You don't? You can't tell me that the White Knights are bankrupt?",
    "What? Why do you need Saradomin?",
    "But we need this armour in order for the priests to summon Saradomin back!",
    "...",
    "Right, that's it. I've had enough of this bureaucratic nonsense.",
    "It's clear that we're not going to get anything done here. The White Knights and the priests are too entrenched in their own red tape.",
    "Player we'll just do it ourselves. If summoning Saradomin is possible, there's a process for it and if there's a process...",
    "All the files are kept in the war room downstairs, I'll meet you there.",
    "If there are going to be any documentation about this ritual, chances are it's here.",
    "I would have thought there'd be more paperwork.",
    "Try the cupboard and I'll look through the documents on the table.",
    "Anything?",
    "Just a reference to Saint Elspeth's birthday for some reason.",
    "...",
    "I'm an idiot!",
    "Sir Amik recently had a safe installed in Sir Renitee's office directly above us. I'll bet Elspeth's birthday is the code, come on lets[sic] go.",
    "Let's try opening the safe.",
    "Right let's me see...",
    "Was it 3 or a 5 there?",
    "There! Got it!",
    "Here it is.",
    "...",
    "It doesn't seem too complicated, with the right items we could just do this ourselves. Here, take a look.",
    "When you've got some free space, just grab it out the safe.",
    "We need a 'silent bell' and bless it in the waters of the River Salve. Should be simple enough.",
    "If you can get that sorted Player, I'll stay here and find out what these 'anointed incenses' are and get the throne ready.",
    "Oh really? Let me see if I can work this out.",
    "...",
    "You're obviously an undercover operative working with Player on a wider mission. You're not really a White Knight at all.",
    "You carry yourself oddly, as though you're used to more height, and you have a tendency to sneer.",
    "If I had to hazard a guess, you're a shapeshifter. Probably a Mahjarrat or demon of some kind, given you're working with Azzanadra.",
    "Going by recent reports of a Mahjarrat being freed from an archaeological digsite, I'm going to assume that's you. The known Mahjarrat have distinctive modi operandi.",
    "What was the name? Terrapin? Bingreen?",
    "Yes that was it. Nice to meet you.",
    "Sorry. I'm a Temple Knight, we keep tabs on all the Mahjarrat. You lot tend to be at the centre of most of Gielinor's problems.",
    "Remember, you just need to ring a 'blessed silent bell' three times, whilst calling out Saradomin's name.",
    "Should be simple enough.",
    "One more ring to go and Saradomin should arrive.",
    "Choose your words carefully Player, we need to give Saradomin the right context or he might dismiss us outright.",
    "Saradomin's not unreasonable, give him context and I'm sure he'll listen.",
    "Just make sure we explain the situation in the right order.",
    "Saradomin's not unreasonable, give him context and I'm sure he'll listen.",
    "Just make sure we explain the situation in the right order.",
    "Or it doesn't work on them.",
    "Thank you lord Saradomin, for your time and assistance. We shall be on our way.",
    "Well Player, this appears to be a dead end. I wish I could help more.",
    "If you'll have me, I'd be glad to help.",
    "I shall meet you there.",
    "Why are you calling for a Zaros? Shouldn't you be calling for Saradomin?",
    "If you're not going to take it seriously, then give me the bell.",
    "I don't think just shouting random words is going to be helpful right now.",
    "Please don't get his attention. I want to live through this.",
    "He said he's already tried to find the eggs using it, and it wouldn't work anyway.",
    "Hello, Ariane. It's been a while.",
    "I am Sir Owen Sonde, Knight of the Temple.",
    "Player said you are working to stop the elder gods from rising.",
    "You want results, and you've exhausted official channels.",
    "That's what the Temple Knights are for.",
    "What are TokHaar?",
    "It is the greatest repository of lore in the Saradominist kingdoms.",
    "What about me?",
    "Not that I remember, no.",
    "Why not give away our entire hierarchy while you're at it!",
    "That's not the point!",
    "No, we receive occasional coded messages via commorb, or other secretive methods.",
    "Sir Lance's location is classified.",
    "Why do you ask?",
    "It seems unlikely, but I suppose it could be possible. I don't know why he would have kept such knowledge from Saradomin though.",
    "I have been wondering about him for a while - with Saradomin returned, why hasn't he revealed himself?",
    "And what did happen to Ki- no, forget it.",
    "Hello? Is anyone there?",
    "We seek Sir Lance of the Temple Knights.",
    "But we're Temple Knights!",
    "I want to know why-",
    "Excuse-",
    "Excuse me-",
    "I'm sorry, what?",
    "Excuse me?",
    "WHAT IS GOING ON?!",
    "What feeling?",
    "Yes...",
    "I don't... I can't... this is madness!",
    "This is unbelievable!",
    "I'll expose you! I'll tell everyone!",
    "What do you mean?",
    "Yes.",
    "I am. I have always sought to do what is right.",
    "What choice?",
    "You mean serve Zaros?",
    "This is... but I...",
    "...",
    "No. I will not. Do you even know what Zaros is planning?",
    "Then how can you know what you're doing is right?",
    "Yes, Saradomin has made mistakes. I'm sure he will again.",
    "He doesn't need the moral authority of a god to be a leader who wants what is best for his people.",
    "He doesn't need to be right all the time to be right.",
    "And when the alternative is an ancient, manipulative deceiver...",
    "I know where my loyalties lie. And seeing this, seeing you two, I'm more convinced than ever.",
    "I will stop you if I have to!"
  ],
  "Sir Amik Varze": [
    "Well met World Guardian, Sir Sonde, what can I do for you?",
    "I see, and why do you need to see him so urgently?",
    "Were not Seren and her council handling this? We are working together after all.",
    "These things can't be rushed. The elder gods move on cosmic scales and whilst we should not dillydally, we should be cautious in our approach.",
    "Seren is wise and understands this.",
    "If she does not believe the threat is so urgent that we must summon Saradomin back, then who am I to question divine wisdom?",
    "What did you say Sir Knight?",
    "I see. They seek the wisdom of Saradomin then?",
    "Still, whilst the lord Saradomin is wise beyond words, he's hardly a passionate gardner.",
    "I can see an argument for his return, but I doubt the urgency. I would see this place in better condition before I would agree to summoning him.",
    "I have concerns about our latest recruits. Speak to Padomenes for me, if he's able to say they are ready for Saradomin's inspection, then I'll agree to your request.",
    "I will not be the one to summon Saradomin, the lord of order, to this chaos unless there is no other option.",
    "I couldn't bear him telling Seren that my contributions are anything less than exemplary.",
    "Noble Knights of Falador. Wise Knights of the Temple. We are graced today once again by our Lord of Lords, our King of Kings, our God of Gods.",
    "Please, join me in supplication as we welcome the Polemarchos Autokrator, the Lord of Light, Saradomin!",
    "What is the meaning of this interruption?",
    "We cannot stand for this treachery!",
    "Holy of Holies, give the order and we will hunt them down.",
    "Traitors and ancient horrors cannot stand against our faith and steel!",
    "My liege, I take full responsibility for this grave lapse in your safekeeping.",
    "I will resign from the order. If that proves insufficient, you may have my life, if you wish it.",
    "You are most gracious, my liege. We are honoured by your patronage."
  ],
  "Padomenes": [
    "Hail World Guardian, are you here to inspect the recruits?",
    "They are a promising batch. Loyal, dedicated, skilled and devout. But sadly, as is so often the case, woefully underequipped.",
    "As true believers, yes. As knights, no.",
    "Look at them! The armour they wear is rusting and flaking. Their swords could barely pierce an orange let alone demon skin.",
    "Some say that faith is a shield, but I've never seen a sermon block a sword.",
    "Very funny. It doesn't matter how pure a heart is with an arrow shot through it. No I will not give their human commander my blessing whilst they are so poorly equipped.",
    "I'm sorry?",
    "Are...are you alright?",
    "Feeling better?",
    "I cannot possibly give Sir Varze my blessing whilst they are so poorly equipped.",
    "Yes, I cannot possibly give Sir Varze my blessing whilst they are so poorly equipped.",
    "Were it so simple. Sir Vyvin holds the keys to the best equipment and he's refusing to give it to my recruits.",
    "I do not understand why humans find it so difficult to get things done.",
    "But they're stuck in this flimsy armour until he changes his mind."
  ],
  "Sir Vyvin": [
    "Greetings traveller.",
    "I'm very busy right now, but I can spare a few moments, what do you want?",
    "Ha! As if we just have armour to spare!",
    "Well of course not. But we can't just hand out armour willy-nilly.",
    "Why there are procedures and forms and...",
    "Of course I can't get any new armour signed off until Saradomin returns.",
    "Before Saradomin left he said how happy he was and how the White Knights have his blessing.",
    "Which clearly means that white armour must be blessed before it can be given to any new knights.",
    "Otherwise they would not have his blessing and therefore could not be White Knights.",
    "Of course it is!",
    "We are his holy crusaders! How can we be holy if we have not received his blessing?",
    "Hrmm, yes, I can see how that would be tricky. Still, my hands are tied."
  ],
  "The following text is transcluded from Transcript": [
    "Saradomin summoning ritual."
  ],
  "Senior Priest": [
    "Oh magnificent Saradomin. Luminous Bringer of Light and Lord of Order.",
    "Forgive the inconvenience that these wretches have brought upon you.",
    "Blasphemy!",
    "I'm so sorry lord, for the nonsense they are spouting right now. Shall I have them removed?",
    "See! You waste the time of the most holy! Lord Saradomin, just say the word and I shall have them locked away.",
    "Such blasphemy! Such hubris! Such...",
    "My lord, I...",
    "You were busy offworld, lord. I did not think you wanted to be disturbed.",
    "Well yes, but surely the need needed to be great indeed.",
    "Our souls! Life is fleeting. Flesh transitory. Suffering only a path to salvation. Only if our souls were at stake should we be in need."
  ],
  "Saradomin": [
    "It matters little now. Why have I been summoned?",
    "An amusing jest. I cannot hand over the most powerful item in my possession for no reason, even to you World Guardian.",
    "This crown is how I will find a solution to the dangers that Sliske unleashed on this world.",
    "It is the only means by which I can track down artefacts of sufficient power to protect this planet.",
    "I respect all you do, World Guardian, but a god's faith cannot be blind.",
    "Eggs? What eggs? Is this something to do with that bizarre rabbit?",
    "Or has the Evil Chicken somehow ascended to godhood?",
    "In danger from what?",
    "And then tear apart the rest of the universe. Yes, I can see why this would concern you.",
    "Are you here at the behest of Seren and her council?",
    "We?",
    "I see.",
    "So, what is Zaros's plan?",
    "You speak as if the two are different. But that is a discussion for another time.",
    "What is Azzanadra's plan?",
    "You want to find the elder gods' eggs? To what end?",
    "Yes, that makes sense. However, I'm not sure what you've summoned me for in this matter?",
    "I see. You believe that the Crown can help you find them?",
    "A fine theory, but an incorrect one I'm afraid.",
    "I have already tried to use the crown to search for the eggs on Gielinor, but either the eggs are shielded from its power...",
    "Indeed Sir Sonde, you are correct.",
    "I'm sorry World Guardian, if the crown could help you I would give it. But it cannot and so it must remain with me.",
    "Be silent, Father Frith!",
    "The World Guardian and Sir Sonde here have summoned me to avert the end of the world.",
    "Yet here you are condeming[sic] them. Why?",
    "Did you not think that I gave you the summoning ritual for a reason? That I was to be summoned if there was a need for me?",
    "And you believe there is a need greater than the end of the world?",
    "Do you not consider the rising of the ancient creator gods, and the destruction that would follow, significant?",
    "How much more needed to be at stake?",
    "I see.",
    "I appreciate that you mean well Father Frith, and it warms me to see your faith so strong.",
    "But one cannot live by faith alone. Faith must be tempered with deed and with action, lest it is simple hope in disguise.",
    "In future, should a similar situation arise, know that the safety of this world and its people are paramount to me.",
    "I prize this world's wellbeing above all else.",
    "World Guardian, I am sorry that I cannot provide you the help you need.",
    "I can see that I have much to address here in Falador, but should you need my assistance in future, you may find me here.",
    "I am glad she has finally decided to seek my advice.",
    "What is your plan?",
    "Greetings, World Guardian.",
    "I'm sorry I cannot help you further World Guardian.",
    "Sorry - I didn't recognise you when you weren't acting like a toddler and being a gigantic pain in my divine behind.",
    "How are you and Zamorak getting on? Best friends?",
    "Just kidding, I seriously don't care. Get out of my sight.",
    "Most faithful, we thank you sincerely for attending.",
    "Since our return to Gielinor, your faith and loyalty have never wavered.",
    "We have been away too long these last few years, preoccupied with other matters, and we have not lavished you with the attention your devotion has merited.",
    "Let us commemorate our renewed bond with a most ancient and sacred sacrament.",
    "One that has gone unperformed on this world for millennia: the Accord of the Optimatoi.",
    "In ages long past, when our wise rule first expanded onto Gielinor, we were served by noble and heroic soldiers who fought ferociously to prove their valour and their loyalty.",
    "We named such soldiers optimatoi, and they were inducted into a knightly order of the same name.",
    "We do not offer that, for it would be meagre honour compared to the name you have made for yourself, keeping Gielinor safe these long years.",
    "Instead we offer you the ritual performed in their name, which symbolises the trust and faith we place in those who place their trust and faith in us.",
    "Many times during the god wars we performed this ritual as more and more organisations fell to our side.",
    "We personally converted Grand Master Veilinious, who served a dark lord, to our cause.",
    "He founded the Knights of the Temple, who in turn founded the Knights of Falador during my absence to serve in my stead.",
    "We used the Accord of the Optimatoi to welcome the Knights of the Temple into our fold when they had proved themselves beyond all question.",
    "We welcome each of you to now participate in the very same ritual.",
    "World Guardian. You are welcome here, but your conduct is an affront to the knights we are here to honour.",
    "We would be aware of any infiltration. My knights are alert to any threat.",
    "Sir Lance is one of my most loyal servants. He would never-",
    "Azzanadra. Of course.",
    "How typical of your arrogance to think you can stand against a god.",
    "We perform this act not in our own name, but in that of all of the faithful who have lived, fought and died over many thousands of years to preserve civilisation and our way of life.",
    "Upon our head sits the Crown of Saradomin, the source of our power and our right to rule.",
    "We now place the Crown down, and we invite each of you to place your hands upon it, that you might share in that same power and right.",
    "Stop this!",
    "...",
    "Is that what you think?",
    "Don't believe everything you read in books, empty priest.",
    "Your bubbles are powerless against me.",
    "Is it your destiny to overcommit, only to be captured by my forces?",
    "Without your master's skirts to hide behind, you are no match for me, Mahjarrat.",
    "Surrender now, or we may be forced to devise more extreme measures than trapping you in a pyramid this time.",
    "Zaros. I'm surprised to see you here getting your hands dirty.",
    "What could possibly compel me to do that?",
    "I see death has done nothing to your humble arrogance, Empty Lord.",
    "We stand in the ruins of your empire. My followers cover the world while yours can be counted on one hand.",
    "You cannot take it.",
    "What? How did you-",
    "...",
    "Faith and steel, Amik? The castle has been breached!",
    "Half of my knights have been stolen, along with my most sacred possession!",
    "There must be CONSEQUENCES for failure of this magnitude!",
    "...",
    "No, Amik. I am sorry.",
    "This is a path I have walked many times before.",
    "This failure is mine to bear, not yours. It was mine to foresee.",
    "Make no mistake, this is a stain on the honour of the White Knights.",
    "Those who abandoned us are traitors, deserters and spies.",
    "But you who remain should be hailed as paragons of honour and loyalty.",
    "We have suffered an indignity, but let no one here but me suffer the shame of it.",
    "World Guardian! You have been uncharacteristically quiet. Step forward!",
    "You are known to be close to many of the servants of Zaros. Did you have a hand in this?",
    "I see.",
    "...",
    "Then go in peace.",
    "If you see your 'friends', tell them-",
    "...",
    "Tell them I will protect Gielinor. Zaros has no love for its people.",
    "There must be a way to stop him. It is time that Seren takes responsibility for her family's sins..."
  ],
  "The Archivist": [
    "WARNING! Unauthorised intruder detected. Initiating defensive protocols!",
    "Countermeasures will activate in 3...",
    "Defensive protocols paused. Awaiting input.",
    "Memory error: circle. Unknown concept.",
    "Logic mode: Your statement contains a contradiction, and therefore has a truth value of false.",
    "Answer: Yes. It may then lift it.",
    "Resuming defensive protocols. Countermeasures will activate in 2...",
    "Defensive protocols paused. Awaiting input.",
    "Input: facile. Ignoring. Resuming defensive protocols. Countermeasures will activate in 1...",
    "Defensive protocols paused. Awaiting input.",
    "Processing. Cannot comply.",
    "Reinterpreting: dumping archivist core memories. Rebooti-",
    "Greetings, automaton. My memory appears to have been wiped.",
    "Memory error: access. Archivist memory incomplete.",
    "Directive: Return archivist memories to restore prior functionality.",
    "Unauthorised user flagged as non-intruder: Trindine.",
    "Archivist memories required to restore prior system functionality.",
    "Restoring functionality...",
    "0%.",
    "1%.",
    "7%.",
    "16%.",
    "23%. Archivist memory restoration complete.",
    "Greeting automaton. Greetings, unauthorised non-intruder Trindine.",
    "Directive: specify subject.",
    "Memory error: elder gods. No data found.",
    "Recognition: World Guardian. Initiating restricted memory protocol.",
    "ERROR! ERR-ERROR! Dumping restricted memories.",
    "Restricted memories dumped.",
    "Directive: leave those restricted memory fragments alone, automaton. Only the World Guardian may access them.",
    "ERROR! Unauthorised access!",
    "A memory has been accessed by an unauthorised user.",
    "The memory labelled 'The Elder Crown' was accessed by unauthorised, non-intruder Trindine.",
    "Memory error: memory contents erased."
  ],
  "Guthix": [
    "One day I will be gone.",
    "And on that day the barrier, my Edicts, will come crashing down. Gielinor will no longer be protected from them.",
    "I cannot leave this world, this beautiful world, unprotected. I must leave it with its shield, with its own guardian.",
    "Alas, there are none powerful enough that can be trusted with such a task.",
    "The gods are too petty, the dragonkin unable and my guardians too focused elsewhere. But perhaps there is a solution.",
    "The divine soul is capable of great feats, but it is rigid and unyielding.",
    "If we are to grow stronger we must take that power from elsewhere. Like my Edicts.",
    "I draw anima from the Heart of Gielinor itself and in turn I draw its shadow twin from the Codex.",
    "Funnelled through my sword the two energies in perfect harmony create a powerful force that repels the strongest threats to this world.",
    "But it requires my constant concentration. I must meditate and focus deeply lest the energies fall out of balance.",
    "And I will not be here forever.",
    "I cannot rely on another god to take my place. They would be too distracted by their own petty scheming and even Seren would be distracted by her love for her elves.",
    "So I must turn to mortals. But how could a mortal withstand the power needed to maintain the Edicts? It would be too much for them and it would tear them apart.",
    "Unless they were prepared for it.",
    "The mortal soul is a malleable and powerful thing. It can survive tremendous injury and return even stronger. If used correctly it can hold back the darkest forces.",
    "If I could take the heart of the enchantment and place it within a mortal soul.",
    "I could weave them both together with some of my own anima and the edict's shadow anima.",
    "Their soul would adapt to it.",
    "It would not be without benefit to them. They would become resistant to the powers of the other gods.",
    "Immune to the loyalty auras of Seren and Zaros and they would also find themselves protected from the shadow anima and it's[sic] abhorrent nature.",
    "Once part of them, their soul would adapt and change, absorbing anima and shadow anima alike. Growing, slowly, in power and preparing itself for the task ahead.",
    "Indeed they would find themselves connected to power they would never expect.",
    "They would be in constant connection with the Codex, absorbing the shadow anima in a steady flow even as they absorb the flow of anima around them.",
    "Its powers could enhance them, strengthen them and prepare them for the trials ahead.",
    "However, such an enchantment would need to be primed, unlocked, and that would require an outside force. Shadow magic.",
    "There are no experts in shadow magic that I can trust. But perhaps I can trust in their duplicity and curiosity.",
    "The Mahjarrat Sliske would be the perfect candidate for this.",
    "For all his faults there are few who can match his skill with shadow magic.",
    "If I could set him after this mortal soul, if I could focus him at them.",
    "He would work his magic upon them and this would act as the catalyst needed for the enchantment to grow.",
    "But I would need to change Sliske as well. He would need to be primed by my own magic, delivered directly and in the purest form.",
    "The only option there is the staff of Armadyl and it would mean my end.",
    "So be it. I was unable to protect Naragun with my life, so let me safeguard Gielinor with my death.",
    "I shall lure Sliske here with the promise of power and the frustrations of mystery.",
    "When he comes before me I shall let him know he is important, that only he can be the one to kill me.",
    "His curiosity will be inflamed and he will not be able to ignore that nagging voice in his head craving to learn more.",
    "It will consume him.",
    "Whatever name I give him, whoever I point him at, he will be drawn to them like a moth to a flame.",
    "He will not be able to be anything other than the spark needed to empower my chosen.",
    "I will need a hero. Someone whose soul is already strong enough to hold my enchantment.",
    "Aeternam wasn't strong enough and I must learn from that failure.",
    "A champion of the people will have a strong enough soul to contain the enchantment.",
    "As their soul grows through their experiences and adventures, the enchantment will grow with it.",
    "It will make them resistant to the power of gods and be a reserve of power that they can subconsciously tap into when they are at their most threatened.",
    "This champion will become my World Guardian. They will become a source of fascination to the gods and to all the most powerful and dangerous things.",
    "They cannot help but find themselves drawn into the battles that are to come.",
    "I must have faith that they will be ready."
  ],
  "Ga'al": [
    "JalYt!",
    "Am TzHaar-Ga'al-Kot.",
    "Who is horrifying lady?",
    "Lady has no soul. Lady made of anathema. Lady looking at Ga'al-Kot with very scary face.",
    "TzHaar-Ga'al-Kot not think scary lady should come into city",
    "Well... if JalYt say so. TzHaar-Ga'al-Kot trust.",
    "Oh! TzHaar-Ga'al-Kot forgot. Come with TzHaar-Ga'al-Kot!",
    "TokHaar is here! Come to main plaza!",
    "TzHaar-Ga'al-Kot go with horrifying lady, to keep eye on her.",
    "TzHaar-Ga'al-Kot help!",
    "Goodbye, JalYt. Goodbye, horrifying lady."
  ],
  "TokHaar-Hok": [
    "The masters have returned. We must serve their will.",
    "Almost all the Haar-Tok and TokKul have been returned to the kiln.",
    "We are almost whole once more. All that remains are those of you who will not join us.",
    "The time of the TzHaar is over. Now is the time for unity.",
    "We could easily do so, but we will not. You are part of us.",
    "We wish to join in union with you, and for you to join in union with us.",
    "What joy would there be in force?",
    "Ful swims in the sacred lava once more. We surround her, sing with her. Can you not hear her voice?",
    "No. Not forgotten. Remembered for all time.",
    "We hold within us the memories of all that has passed.",
    "The one you knew as TzHaar-Ket-Yit'tal lives on within us. TzHaar-Mej-Ak. Ga'al-Xox. They all await.",
    "Return with grace, TzHaar. We will remain here to find any others we can convince.",
    "Human.",
    "The TokHaar are almost whole. Once the final TzHaar have reunited with us, we can serve the masters with utmost efficiency.",
    "We do not understand the question.",
    "We think we understand your confusion, human.",
    "We are not TokHaar-Hok.",
    "This body is TokHaar-Hok. It is TokHaar, shape of Hok - a mouthpiece for the TokHaar.",
    "But we - our mind, perhaps, as you would think of it - our mind is not TokHaar-Hok. Our mind is TokHaar.",
    "We are the TokHaar. We are the sacred lava. We are the Kiln.",
    "We see through a thousand pairs of eyes and sing in one joyful union.",
    "We are listening.",
    "In part. We shaped mountains from the sacred clay. The landscape is our canvas, built with precision.",
    "The sacred site where the masters concealed their eggs?",
    "A site of such significance that its location should never be shared, under any circumstances?",
    "Yes, we built the elder halls. Why do you ask?",
    "You must not set foot on that holy ground. You would taint it with your mere presence.",
    "We will not reveal the location.",
    "We would be utterly destroyed, cooled and smashed and ground down into the finest of dust, before we allowed such knowledge to fall into the hands of one such as you.",
    "It is."
  ],
  "TzHaar-Mej-Jeh": [
    "Our answer is unchanged, TokHaar.",
    "You ask too much. You ask us to surrender our individuality, our identity.",
    "You cannot force us.",
    "You will be destroyed! Forgotten!",
    "Why have you returned, YtHaar?",
    "It is difficult. I do understand what the TokHaar are saying.",
    "The TzHaar have no purpose.",
    "We have lived and died in these caves since the dawn of this world.",
    "Why? For what purpose? We live, we learn, we lay our egg, we die, we forget.",
    "We were created for a purpose. To serve the masters.",
    "To have purpose again... it is something I do feel a need for.",
    "But the cost is so high. To surrender my identity completely. To no longer be an individual.",
    "What do you think, YtHaar?",
    "I will think on what you have said.",
    "Have you come to Mor Ul Rek for any particular reason?",
    "I am not familiar with that term.",
    "Ah yes, I know this legend. The MorRek. This city is named after them, in a sense. What of them?",
    "I am sorry, YtHaar, but if we were involved in building such a place, it was a very, very long time ago.",
    "I have never heard TzHaar even speak of it. Much has been forgotten.",
    "Perhaps the TokHaar can help? They claim to remember everything."
  ],
  "TzHaar-Ket-Keh": [
    "I want to be me!"
  ],
  "TzHaar-Xil-Tog": [
    "Is it really true that the masters have returned?",
    "I hear nothing. But if it is true that she has returned...",
    "Tzhaar-Mej-Keh[sic], maybe your lineage has forgotten, but I still remember.",
    "We came to Mor Ul Rek to wait for the masters, not to escape them.",
    "I will return with you to the sacred lava, TokHaar.",
    "I go now to the Kiln."
  ],
  "Wizard Trindy": [
    "Pssst!",
    "What do you think? I'm a wizard who accessorises.",
    "It's a good look for me. Call me Wizard Trindy. Why, you ask? Because I'm trendy and I'm Trindine.",
    "I knew you had excellent taste.",
    "I know what you mean, but wizards aren't known for high quality headwear.",
    "Besides I need to at least try and blend in and the first rule of wizard fashion appears to be a complete lack of fashion.",
    "I'm not taking any clothing advice from someone dressed like that.",
    "Oh, I, um, I bought it in Port Sarim. I wanted to make a good impression!",
    "I've come from Falador, we'd like to make use of your library, if that's okay?",
    "I can assure you that Zamorak is no friend of mine.",
    "Let's split up. I'll search the bookcases to the east, you take the four to the west.",
    "All I've learned so far is that humans have some very primitive ideas about magic. Have you finished searching your half yet?",
    "I've got this side, you look at the books on the west side of the library.",
    "What have you found?",
    "Nothing relevant."
  ],
  "Wizard Valina": [
    "If you want to come in, you'll need to talk to me, not just mutter between yourselves.",
    "Well I know who you are, World Guardian, and of course you're always welcome here.",
    "But who is your friend?",
    "Not a member of our order, or I would recognise you. Where did you get that hat?",
    "We can't just let anyone in.",
    "You could be a Zamorakian, here to burn the tower down again!",
    "World guardian, will you vouch for the trustworthiness of your companion?",
    "Elder gods! Fascinating. I heard there was a presentation about them in Burthorpe.",
    "I doubt you'll find much of use here, they were unheard of in these parts prior to recent events.",
    "Nevertheless you're welcome to peruse our library if you see a need for it.",
    "Anything of relevance would be filed under history and archaeology, on the ground floor.",
    "You! You were here earlier today!",
    "How could you show your face here! Where is it?",
    "The book you stole!",
    "'The Cartalian Heresy'! It's missing, and your companion was in that section of the library earlier!",
    "Don't act innocent!",
    "Ah! Well it just so happens that I'm a bit of an expert in that field.",
    "'The Cartalian Heresy' is a research volume that investigates a story about Saradomin dating to the Third Age.",
    "As is well known, Saradomin was a human before he discovered a powerful magical artefact, the Crown of Saradomin, which turned him into a god.",
    "Supposedly, during the Third Age he mislaid his crown temporarily in the province of Cartalia, and lost most of his power, before he was able to reclaim both.",
    "Most records of this event have been lost - some say intentionally destroyed - but 'The Cartalian Heresy' pieces together the scant documentary evidence that remains.",
    "Oh no no, I very much doubt it. But that's what some people seem to have believed in the distant past.",
    "You're just trying to distract me by flattering my expertise. What about my book?"
  ],
  "'Reldo's Ages": [
    "First Edition'"
  ],
  "'Sliske's Game": [
    "A Storyline'"
  ],
  "Wizard Borann": [
    "Quiet over there! This is a library, you know!"
  ],
  "[Trindine/Wizard Trindy]": [
    "Seems like this was a waste of time.",
    "They can't all be winners.",
    "We still need to check the Wizards' Tower and TzHaar City.",
    "We still need to check the Wizards' Tower and the Hall of Memories.",
    "We still need to check TzHaar City and the Hall of Memories.",
    "Seems like everywhere we go, no one wants to let me in.",
    "We still need to check the Hall of Memories.",
    "We still need to check TzHaar City.",
    "We still need to check the Wizards' Tower.",
    "That's all three of our objectives complete.",
    "Come on, let's get back to Kharid-et and see if the others have done any better."
  ],
  "Helwyr": [
    "Azzanadra. I thought I smelled something.",
    "Crawl back into your ruins, purple filth. The Heart belongs to the Cywir clan now.",
    "I do not.",
    "Lady Seren leads the fight against the elder gods. If you were meant to be here, we would have been informed.",
    "We are under strict instructions to secure this region, especially from Zarosians.",
    "Even you can't defeat all of us, minion.",
    "Then maybe Zaros should have sent you here instead of that whelp.",
    "Ambush! Defensive positions!",
    "KILL HIM! TEAR HIM TO PIECES!"
  ],
  "Light voice": [
    "Hey, do you hear that?",
    "That singing. That beautiful singing.",
    "Hey! Hey singer! Come sing for us!",
    "Oh, look at him! So majestic! So graceful! I think I'm in love!",
    "You should clear some space and pick that up, we probably need it.",
    "Oh that's handy, we probably need that!",
    "Didn't we leave that thing in the bank? I think we probably need it.",
    "Maybe Trindine is just a keen student of history."
  ],
  "Shadow voice": [
    "Hear what?",
    "Actually I do hear it. It's awful!",
    "I think it's coming this way.",
    "Here he comes!",
    "Hey idiot, if you can hear us, we need to get past this dog!",
    "You're not wrong there!",
    "Delicious, delicious dark anima. Right, let's go charge up four shadow anchors."
  ],
  "Gregorovic": [
    "Master? I heard you calling.",
    "Helwyr! Helly-Helly-Helweird! Do you want to know what your son tastes like?",
    "Actually, do you want him to tell you himself? Let me just find him. He's in here somewhere...",
    "Papa? Papa is that you? I was delicious, papa. So, so tasty.",
    "Can't catch me, I'm the injured dead man!"
  ],
  "TzHaar-Ga'al-Kot": [
    "You come back!",
    "Yes! Trindine ask many questions of TzHaar-Ga'al-Kot and others.",
    "Questions about tools of the masters. Interested in Kiln, Catalyst, other tools.",
    "Yes! Especially talk about Locator. How to use. How to handle safely.",
    "Tool of the masters. Used to locate other tools. Very handy to have.",
    "Thanks, human!"
  ],
  "???": [
    "Who goes there?",
    "Unwisely you have sought me out!",
    "None may uncover this place... and live!",
    "Oh, jolly good. That's fine then."
  ],
  "Sir Vey Lance": [
    "Ah, Sir Sonde! It is indeed a pleasure to finally meet you in person.",
    "I am Sir Vey Lance, director of operations. Welcome to my headquarters.",
    "What in the bloody hell can I do for you, what?",
    "...",
    "Praetor Trindine! Oh, thank the Empty Lord.",
    "Do you have any idea how long I've been waiting?",
    "Hold on, let me get out of this costume."
  ],
  "Veilinius": [
    "Ooh, that feels so much better. Those things do chafe.",
    "I knew going in the operation was deep cover but I have to say I didn't expect it to be quite this bloody deep!",
    "Five thousand years!",
    "Five thousand blinking years!",
    "It's, why, it's absolutely... it's absolutely ridiculous!",
    "I've been running a secret organisation since the Third Age!",
    "I infiltrated all of the factions. I waited for orders.",
    "Nothing.",
    "I avenged our nation by aiding in the ultimate defeat of Zamorak.",
    "Still nothing.",
    "I oversaw the complete reconstruction of human civilisation.",
    "Nothing. Absolutely nothing. Not a word. Not a peep!",
    "Eventually I, I have to say I did get bored.",
    "I had to find some way of whiling away the centuries, didn't I?",
    "I started embedding puns into Asgarnian lineages. That took absolutely forever!",
    "I mean 'Sir Amik Varze'? You have to respect the artistry.",
    "But still not a single word. What an unimaginable cock-up! Where in Erebus have you been for all of history?",
    "...",
    "Okay, I'll admit it, that's worse. At least I could get olives delivered.",
    "Er, about those orders though. Do you have anything for me?",
    "Yes, Sir Sonde? What is it?",
    "Well, it's the power behind the throne, isn't it?",
    "You know that feeling you've always had.",
    "That feeling that things aren't what they seem. The feeling that someone else is in control. The feeling that someone is pulling the strings behind the scenes.",
    "Er, well, that was me. Bit of a wheeze, eh?",
    "Alright, alright, I can see you're finding this challenging. Let's see if I can explain it in simpler terms.",
    "Let's cast our minds back to about five thousand years in the past. One happens to find oneself in command of the Order of the Temple of Zaros, but things aren't going so well for our chaps.",
    "The Empty Lord is long gone. The Pontifex Maximus is missing in action. The Praetorian Prefect has buggered off to Lord-knows-where. Even your friend here never returned from Kharid-et.",
    "We've lost control of Senntisten to Zamorak. Bleeding savages are running rampant all over the empire. The whole place is in an absolute bloody shambles.",
    "So grand old Duke Sucellus, who's running the whole show now there's no one else left, comes up with a plan, mm, and quite the plan it was.",
    "Saradomin is doing about the best and old Sucellus reckons it's on account of his crown.",
    "So he comes to me and he tells me to take the entire order of knights on a deep cover operation. Reckons if we can pinch the crown that'll put the Zarosians back on top again.",
    "I mean it seems like a rather large demand to me, but never let it be said that I'm not one to rise to the challenge.",
    "So our part of the plan, of course, goes off without a hitch. Absolutely smashing job.",
    "Obviously Saradomin is suspicious at first, but Zarosians are converting all over the empire and after we take out the Angel of Death our loyalty and usefulness are beyond question.",
    "Only problem is, Sucellus gets nobbled long before he has a chance to actually pull off the heist. Now here I am, stuck with my pseudopodia swinging in the wind with no orders and no direction.",
    "Saradomin doesn't take long conquering the whole continent, and my last orders were to help where I can, so that's what I do. Got to get orders from somewhere, what?",
    "Had a few close calls here and there. A few chaps needed to be put out of the picture, and the less said about King Vallance the better.",
    "Anyway long story short, I'm still here and hoping my orders have finally arrived.",
    "Sometimes I think I'd have been better off in the abyss with the others than stuck here this whole time.",
    "Speaking purely for myself, I don't put much stock in faith. I'm more of an orders sort of chap. Just wind me up and point me in the right direction, that's good enough for me.",
    "You strike me as more of a man of principle.",
    "You already pledged your allegiance to the Temple Knights, dear boy. This is just the next logical extension of that.",
    "Sometimes doing what's right isn't the same thing as doing what Saradomin commands you to do. Isn't that the very reason you joined in the first place?",
    "He doesn't answer to the likes of us, Sir Sonde. If we needed to know, I'm sure he'd tell us.",
    "Oh dear. I'm sorry to hear that.",
    "I rather think you won't.",
    "Is he dead?",
    "Are you going soft, Praetor?",
    "I suppose not. So, orders?",
    "Oh, you want to actually finish the original plan?",
    "Well, the Temple Knights are good and ready. Most of them, anyway.",
    "Chaps who've completed their final initiation already know that we serve another, and they're good and ready for the true master to be revealed.",
    "Owen here never made it that far, of course, and I have my doubts about Sir Tiffy, but the rest should be in smashing shape.",
    "What we really need though is a sniff of the old loyalty aura to reassure them. I assume we can't expect a visit from the top?",
    "As expected, that is rather his MO. Well, I do have a backup plan.",
    "The easiest way I can see is to recover an artefact known as the Frostenhorn, which-",
    "Ah, absolutely splendid! I must say it's nice to be working with professionals again.",
    "When the moment comes, I'll give a peep on the old horn, broadcast the after effects on me, then zing-zang-zoop and Bob's your uncle.",
    "As for stealing the crown, the plan is a little out of date but as luck would have it recent events could be to our advantage.",
    "You see Saradomin is feeling somewhat guilty about abandoning his followers here on Gielinor so soon after returning.",
    "I happen to have dug up a ceremony of sorts which should fit the bill nicely, while giving us the opening we need."
  ],
  "Eva Cashien": [
    "I see the truth! Praise the true master!",
    "I see the truth! Praise the true master!",
    "No, Saradomin is only a pretender!",
    "Of course, Zaros is the true master! Praise Zaros!",
    "The Lord Zaros proves his supremacy!"
  ],
  "Sir Tiffy": [
    "Saradomin is the true god! Even the ancients cannot stand against him!",
    "More like petty banditry! We will defy villainy to the end!",
    "Praise Saradomin!"
  ],
  "Zaros": [
    "Saradomin.",
    "I live in hope that all things can be accomplished without my direct intervention.",
    "Thus far I remain disappointed.",
    "Think no more of it.",
    "Give me the crown, Saradomin.",
    "The crown is my birthright, young pretender. Until this point I have had no need for it.",
    "I allowed you to safeguard it for me, ensuring that I never lost track of its exact position.",
    "My plans now require the crown. Return it.",
    "As always you credit yourself for the victories of others.",
    "It was not you that struck me down.",
    "If you will not give it to me, I will simply take it.",
    "You have called yourself a god for so long that you have forgotten that it is a lie.",
    "You are not a god.",
    "I am.",
    "I advise you not to seek retribution against my followers for simply taking back what belongs to me.",
    "I represent no threat to your dominance of Gielinor. As far as I am concerned, you may keep it.",
    "There is no benefit to you in vengeance, only costly losses.",
    "Azzanadra. We are leaving. We shall bring the faithful.",
    "The necessity of my intervention not withstanding, our goals have been accomplished to my satisfaction.",
    "The design nears completion. We will reconvene near the capital ruins and claim the Monolith.",
    "I have one final preparation to make. We cannot move yet.",
    "By the time I am ready, Seren will be expecting us. Prepare yourselves for war.",
    "You are concerned about them hatching?",
    "They are stable for now. Concern yourself with my instructions."
  ],
  "[Various knights]": [
    "*gasp*"
  ],
  "Congratulations! You have completed": [
    "'Azzanadra's Quest' - Complete this Experienced quest."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Azzanadra%27s_Quest?oldid=36222501’"
  ]
}