{
  "Player": [
    "Hi there. It looks like your cart has broken down. Do you need any help?",
    "I hope you can. Good luck.",
    "Can I help you?",
    "General Khazard?",
    "I'll try my best to return your family.",
    "Hello Lady Servil.",
    "Hello.",
    "I suppose I am.",
    "I'm visiting friends in the cells.",
    "Hello.",
    "Hello?",
    "I was wondering...",
    "Really? That's fascinating.",
    "I see. Well, thanks anyway.",
    "Hello. What are you doing here?",
    "Hmmm...",
    "I think that would be a good idea, you need to sleep.",
    "And have a bath.",
    "Hello.",
    "This door appears to be locked.",
    "Hello.",
    "Me? No, no one.",
    "Hello.",
    "Yeah, I'm one of the new lot. The General always seems to be recruiting.",
    "Thanks, I'll be careful.",
    "Hello.",
    "Was it the armour that gave it away?",
    "Yes, yes, we're guards.",
    "Yes, I better go. There's plenty to do and lots of things to be guarding.",
    "Hello.",
    "Hello Lady Servil.",
    "I've managed to get a guard's uniform. Hopefully I can infiltrate the arena.",
    "Hello.",
    "Long live General Khazard!",
    "You could say that.",
    "Two-hundred-year-old maniac master. Got it, loud and clear.",
    "This door appears to be locked.",
    "Hello.",
    "I apologise, I stumbled in here by mistake.",
    "You have no right to tell me where I can and cannot go.",
    "Do either of you know a Justin or Sammy Servil?",
    "Do either of you know a Justin or Sammy Servil?",
    "Do you know a Justin or Sammy Servil in this arena?",
    "Do you know a Justin or Sammy Servil in this arena?",
    "Do you know a Justin or Sammy Servil?",
    "I've been sent here to rescue Sir Servil and his son.",
    "Do you know a Justin or Sammy Servil?",
    "Hello.",
    "Shhh. This uniform is a disguise;",
    "I'm here to help you and your father escape, but I need your help. Do you know where they keep the keys?",
    "Which guard?",
    "Right, I'll look for him. Don't lose heart – I'll be back.",
    "Long live General Khazard!",
    "Hard stuff that Khali brew. Tastes great though, doesn't it?",
    "Yessir!",
    "Lady Servil, I have managed to infiltrate General Khazard's arena.",
    "I'm working on it.",
    "Hello.",
    "I'll have a beer, please.",
    "I'd like a Khali brew please.",
    "Got any news?",
    "Hello again.",
    "Do you still fancy a drink? I just happen to have a bottle of the good stuff on me.",
    "Go on... you've worked hard all day. A quick sip will be just enough to keep you going.",
    "No, of course not. Don't worry, it's just a quick pick-me-up. You'll be fine.",
    "Are you alright?",
    "Good idea, I'll look after the prisoners.",
    "No problem, I'll keep them in line.",
    "You don't mind if I look after these keys?",
    "I'll take that as a no.",
    "Hello, how's the job?",
    "Hi. Er, I lost the keys.",
    "I don't want to attract too much attention by freeing all the prisoners. I need to find Sammy and he's not in this cell.",
    "Sammy! Look, I have the keys.",
    "Okay, we'd better hurry.",
    "Sammy, where's your father?",
    "Come on Sammy, we have to get out of here.",
    "Lady Servil sent me to rescue you and your son. Come on, we have to get you out of here.",
    "They belong to nobody.",
    "What do you mean?",
    "Are you okay, stranger?",
    "I'm afraid so.",
    "How long have you been here?",
    "Don't give up.",
    "Don't worry, I'll get us out of here.",
    "Hello.",
    "Come on, we only have to fight a creature called Bouncer now.",
    "You agreed to let the Servils go if I stayed to fight.",
    "Hello.",
    "Hello there.",
    "We'll see about that!",
    "Lady Servil.",
    "Didn't I kill you?",
    "Hello.",
    "He tried, but I killed him. You are safe now.",
    "Err, hello.",
    "Err, hello, fellow guard.",
    "Hello.",
    "Hello again.",
    "Are you okay?",
    "Hello Lady Servil.",
    "You're more than welcome.",
    "That's right, son, you should do as your father says. Anyway, I should go now, have a safe journey home. And you, young lad, work hard and stay out of trouble - at least until you're a little older.",
    "Hiya kiddo! You're looking a lot happier now.",
    "I was rather enjoying it, actually.",
    "I'm sure you will be. You showed a lot of bravery in the arena, young lad. If you work hard to complete your squire training, you'll be a worthy knight. Trust me, I can tell these things.",
    "I'm glad I could help. Have a good journey home and farewell."
  ],
  "Lady Servil": [
    "*sob* Oh I don't care about the cart. *sob* If only Justin were here, he'd fix it. My poor Justin! *sob* *sniffle* And Sammy! *sob* He's only a child. *sob* How could anyone be so inhumane? *wail* My poor boy! *sob* I've got to find them. *sob*",
    "Would you, please? I'm Lady Servil, and my husband is Sir Servil. We were travelling north with our son Sammy when we were ambushed by General Khazard's men.",
    "He has been victimising my family ever since we declined to hand over our lands. Now he's kidnapped my husband and son to fight in his Fight Arena to the south of here. I hate to think what he'll do to them. They're not warriors and won't survive against the creatures of the arena! The General is a sick and twisted individual.",
    "Please do. My family can reward you for your troubles. I'll be waiting here for you.",
    "Brave traveller, please bring back my family.",
    "Have you had any luck with freeing my family?",
    "Please, hurry.",
    "And my family?",
    "Please, hurry.",
    "You're alive! I thought Khazard's men had taken you. My son and husband are safe and sound, as you can see! Without you they would certainly be dead. I am truly grateful for your service. All I can offer in return is a small amount of material wealth. Please take these coins as a sign of my gratitude.",
    "Oh, hello my dear. Thanks again for everything.",
    "Sammy, calm down. Player doesn't need to hear everything he/she did. He/she was there when it happened, remember."
  ],
  "Local": [
    "Hello, stranger. Are you new to these parts?",
    "What's your business?",
    "Visiting, that's funny. Only Khazard Guards are allowed to see prisoners. Unless you know where to get hold of some Khazard armour, you won't be visiting anyone.",
    "I heard the Servil family are fighting soon. Should be very entertaining.",
    "Hey, you're the guy from the arena! How'd you get out?",
    "You're the guy who beat Bouncer! Amazing! That makes you a champion to many, but you'd better get out of here while you still can. General Khazard liked that brute and will be after you.",
    "Sadly, you can't kill what is already dead. He's probably still out there, somewhere."
  ],
  "Khazard Guard": [
    "Get off our land, stranger.",
    "*BURRRRRP*",
    "*sigh*...*yawn*",
    "*SNORE*",
    "I want the finest wines available to humanity. I want them here, and I want them now.",
    "Shoooow mee the waaay to go home!",
    "I'm tired and I wanna go to bed.",
    "This area is restricted! Leave now and don't come back.",
    "Yeah, it's to prevent people like you bothering us. Get out of here.You steal the armour",
    "Despicable, thieving scum - that was good armour. Did you see anyone round here, soldier?",
    "Hmmmm.",
    "Can I help you, stranger? Oh, you're a guard as well. Didn't recognise you.",
    "So true. Welcome to the team. Don't let any strangers in - the general hates strangers. Oh, and a piece of advice... if the general looks angry, stay away from him - he has a bit of a temper. There have been... accidents before.",
    "Hi. Are you a guard as well?",
    "Of course! We're guards.",
    "Well, back to work then.",
    "I've never seen you around here before.",
    "Erm...yes. Soldier, I take it you're new around here?",
    "Well, General Khazard is already long-lived. He's been leading his army for two hundred years at least. Remember he is your master, he is a maniac, and he is always watching. Got that, newbie?",
    "Nice observation, guard. You could have asked to be let in like any normal person.",
    "This area is restricted. Leave now! OUT! And don't come back.",
    "Well, don't just stand there - get out of here!",
    "Fair enough. Let's do this the hard way.",
    "Where do you think you're going? Only General Khazard decides who fights in the arena. Get out of here.",
    "The General seems to have taken a liking to you. He'd normally kill imposters like you without a second thought.",
    "Right, you – move it. Get out there!",
    "You're the one who beat the General! You must pay the price!",
    "Die, traitor!",
    "It's you! I don't believe it. You beat the General! You are a traitor to the uniform!",
    "Die, traitor!",
    "You're him/her! The one who beat the General! Begone!"
  ],
  "Joe": [
    "If we did, why would we tell you, guard?",
    "I spit on Khazard's grave, and all who do his bidding.",
    "I have heard of those who you speak, but I fear it may be too late.",
    "You're a brave man. If the guards get you, you'll be in here next."
  ],
  "Kelvin": [
    "Until our last breath, our every action will be against Khazard. Never will we help you.",
    "It is said that Khazard has a personal vendetta against those two. Their time is therefore short."
  ],
  "Slave Fighter": [
    "Please, leave me alone.",
    "I've not met anybody in here by that name."
  ],
  "Hengrad": [
    "You're not a real guard. I've been in here long enough to know that. What's your business?",
    "I've seen them in here, although they don't look up to much. My advice is to leave before you end up in a cell too.",
    "I've seen them in here, although they don't look up to much. My advice is to leave before you end up in a cell too.",
    "I'm fine, thanks. So, Khazard's got his hand on you too?",
    "If you're lucky, you may last as long as me.",
    "I've been in Khazard's prisons ever since I can remember. I was a child when his men kidnapped me. My whole life as been spent killing and fighting, all in the hope that, one day, I might escape.",
    "Thanks friend. Wait... Shhh, the guard is coming. Looks like you'll be going into the arena. Good luck, friend.",
    "I don't know how you managed to escape the arena, but you may not be as lucky next time. Get out of here while you can."
  ],
  "Sammy Servil": [
    "Please, [sir/madam], don't hurt me.",
    "The guard always keeps hold of them.",
    "The bald, fat, lazy guard with a goatee. He's the one who usually locks up.",
    "Wow! Please set me free so we can find my dad. I overheard a guard talking. I think they've taken him to the arena.",
    "I'll run ahead.",
    "Quick, help him! That beast will kill him. He's too old to fight.",
    "Please, you must help my father. He doesn't stand a chance against the likes of that ogre.",
    "Thanks, traveller. I'm sorry that you too are a subject of this arena.",
    "No, you don't have to fight him! Come with us, [Player]!",
    "Yeah, you were ace. I wanna be jus' like you.",
    "Daaad, studying's so boooooooring! I wanna hit things.",
    "Thank you, mister/madam. I saw you fighting in the arena. You were brilliant! You were like POW! and then you got hit, but you were like too hard and didn't care and then you like hit him again and KERPLOW! Then the big scary dog came out, but you weren't scared and you like smacked him as well, and then you...",
    "Yeah, but mum... Player was so cool. He/she was like BAM! BASH! SPLAT! When I grow up, I wanna be a hero as well.",
    "Yeah! I'm gonna be the bravest knight in the world! After you, of course.",
    "See ya!"
  ],
  "Gerald": [
    "Erm, yes... quite right. Have you come to laugh at the fighting slaves? I used to really enjoy it but, after a while, they became quite boring. To be honest, now I've locked them up, all I want is a decent drink. Mind you, too much Khali brew and I fall asleep.",
    "Well, yes. Between you and me, I find it hard to turn down a nice cold bottle of Khali brew from the bar. Mmmm, yes. Ahem! Well, yes, enough chit-chat – back to work, guard.",
    "Hey! You're not a Khazard Guard! This area is restricted - leave now! OUT! And don't come back.",
    "Bored, bored, bored. You'd think suffering and slaughter would be more entertaining. The slaves hardly make any effort to make the fights fun. Selfish, the lot of them.",
    "No, no I really shouldn't. Not while I'm on duty.",
    "Well, I have had a hard day. Oh, go on.",
    "Blimey! This stuff is pretty good. It isn't Khali brew, is it?",
    "That is some gooood stuff. Yeah... wooh yeah!",
    "Yeesshh, hiccup! Oooh, maybe I should relax for a while.",
    "Yesh, yesh that shounds reasonable. Here *hiccup* take the keysh. Any trouble you give... you give 'em a good beating.",
    "Hhmmmgh.",
    "Pleash, leave me alone. I'm sure the wallsh never used to shway this much.",
    "What? You're foolish... an' I'm drunk. Bah! Take my spare set.",
    "Hhmmmgh!",
    "Go away. Thish areas resh...restricted. We don't like strangersh, 'specially ones who shway. Oooh!"
  ],
  "Angor": [
    "Hi, what can I get you? We have a range of quality brews.",
    "There you go, that's two gold coins.",
    "There you go, that's five gold coins. I suggest lying down before you drink it. That way, you have less distance to collapse.",
    "If you want to see the action around here, you should visit the famous Fight Arena. I've seen some grand battles in my time: ogres, goblins, even dragons have fought there. Sometimes you have to feel sorry for the slaves sent in there."
  ],
  "Khazard Ogre": [
    "Hooman go SPLAT!"
  ],
  "General Khazard": [
    "Out of the way, guard! I don't tolerate disruption when I'm watching slaves being slaughtered!",
    "An intruder! I shall let this ogre take care of you.",
    "Haha! Well done, well done. That was rather entertaining. I am the great General Khazard and the two men you just 'saved' are my property.",
    "Well, I suppose we could make some arrangement for their freedom.",
    "I'll let them go, but you must stay and fight for me. You'll make me double the gold if you manage to last a few fights. Guards! Take him to the cells.",
    "How dare you speak to me? You are a slave of this arena now.",
    "Not bad, not bad at all. I think you need a tougher challenge. Time for my puppy. Guards! Guards! Bring on Bouncer!",
    "Nooooo! Bouncer! How dare you? For his sake you'll suffer, traveller. Prepare to meet your maker.",
    "Indeed. You shall see that I am not cowardly enough to make false promises. They may go. You, however, have caused me much trouble today. You will remain here so that I may have the pleasure of killing you myself.",
    "Pale in comparison to the might of General Khazard!",
    "You killed my pet and you still dare to speak to me?",
    "You shall die for your insolence.",
    "You cannot harm me! I shall not be beaten!",
    "Mwahaha! Behold the power of the Mahjarrat! DIE, puny human!",
    "DIIIIIIIEE!",
    "Noooooo!",
    "In the last two hundred years, I have seen such terrible happiness and joy. Now, it is my turn to cover this land in darkness. One day you shall see: All will quake upon hearing my name.",
    "You might not believe it, young one, but you can't kill me."
  ],
  "Justin Servil": [
    "I'm too old to fight. I'm afraid you'll have to kill that ogre by yourself.",
    "You saved both my life and that of my son. I am eternally in your debt, brave traveller.",
    "You've incurred the anger of Khazard himself. He won't let any of us go easily.",
    "You may laugh, but the name of the General's 'pet' is feared by many in this land.",
    "Thank you again, Player. You have saved me and my boy from an awful fate.",
    "If you do well in your studies and work hard, maybe you will be.",
    "I'm sure Player studied hard when he was younger.",
    "Thank you again, Player. You have saved my family and given young Sammy here a new hero."
  ],
  "From above you hear a voice": [
    "'Ladies and gentlemen! Let today's first fight commence: the outsider, [Player], and everyone's favourite scorpion.'",
    "'Ladies and gentlemen! Let today's second round of battle is about to commence: the outsider, [Player], and Bouncer.'"
  ],
  "Slave fighter": [
    "What did I do to deserve this?",
    "Why am I here?",
    "You're not safe here. Leave while you can."
  ],
  "Joe/Kelvin": [
    "Get away, get away. One day I'll have my revenge and I'll have all your heads.",
    "Spare me your fake pity. I spit on Khazard's grave and all who do his bidding.",
    "You're not safe here, traveller. Leave while you still can.",
    "You're a brave one. If the guards get you, you'll be in here next."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Fight_Arena?oldid=36142951’"
  ]
}