{
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "dialogue with people after retrieving the items in the cave, dialogue with Vargas about returning him to his human form, speaking to Freygerd's brother, misc dialogueYou can discuss this issue on the talk page or edit this page to improve it."
  ],
  "Player": [
    "Hello!",
    "Depends what it is.",
    "Yes, I can help with that.",
    "I'll get right on it.",
    "Sorry, I don't have time.",
    "Greetings! I come with a special message. Manni of Rellekka is planning a grant feast for Chieftain Brundt's birthday, and I'm here to invite you.",
    "Really? You can't go?",
    "Well, I'll go and speak to him then.",
    "Your Majesty, I have a message from Manni of Rellekka. He is planning a feast for Chieftain Brundt's birthday, and we'd be honoured if you were present.",
    "So, that's a 'no' then?",
    "I'll see what I can do.",
    "Hello!",
    "Not good. Apparently, King Vargas and Mawnis Burowgar are annoyed at the Chieftain for something that happened to them all.",
    "Give up? No, wait, I've got it: drink!",
    "Sounds like hard work.",
    "About your birthday feast...",
    "He was, but I'm having trouble getting guests to come. Do you know why King Vargas of Miscellania and Mawnis Burowgar of Neitiznot might be annoyed with you?",
    "Wait a moment: are you saying that King Vargas was a yeti, even then?",
    "The Fishing Guild?",
    "No sir.",
    "So, is there anything I can do to help?",
    "Why is the tablet so important? How many are there supposed to be?",
    "It must say something really exciting, then. What does the prophecy say so far?",
    "Missing? How? And why does it matter what the last one says, if you don't have the message from the first four?",
    "I'll see if I can work it out. Do you know where the cave is? I might have a look there.",
    "Chieftain Brundt has been telling me about an adventure you and he had a long time ago.",
    "Well, can you tell me the truth?",
    "Please? Perhaps I can help.",
    "So, where is Nial?",
    "Right.",
    "Yes, I see why you're angry. If you don't mind me asking, once you were cursed and turned into a yeti, how long did the transformation take?",
    "It must be terrible.",
    "I understand Asleif did everything she could to help.",
    "Hmm. Anyway, I've got some of the cave directions from Chieftain Brundt. Can you add anything to them?",
    "Chieftain Brundt told me some of what happened.",
    "I spoke to King Vargas. His version of the story was very different.",
    "Well, he...uh...forgot about your brother-in-law.",
    "The Chieftain has given me what he recalls of the directions to the cave. Do you remember anything else?",
    "Thanks, I'll bear that in mind.",
    "Freygerd? Freygerd of Neitiznot?",
    "Mawnis sent me. I've been investigating and I know what happened to Nial.",
    "Good old Gjuki. What's he done now?",
    "Don't worry, I've stood up to him before. I'll have a word.",
    "Actually, yes I have. I hear you're threatening Freygerd with an emigration tax.",
    "You don't understand do you? Your kingdom lacks prosperity because you tax citizens into the ground.",
    "Read my lips: no new taxes!",
    "Thank you, and I suggest you-",
    "Fair enough.",
    "I've spoken to King Gjuki. You don't have to pay the emigration tax.",
    "I thought you'd be more excited about leaving the island.",
    "I found Nial and ended his torment. I brought back his throwing axe for you.",
    "So, would you feel better about leaving now?",
    "I've spoken to your sister. Her mind is at rest and she's planning to move back to Neitiznot.",
    "I've found the mountain daughter's herb pouch in the cave. It might be useful.",
    "She died, not long after you came back from the cave. Perhaps that doesn't matter. A man in a bear suit killed her.",
    "Yeah, I know. After the man in the bear suit killed her, she haunted the mountain-top lake.",
    "Perhaps. I helped her to find peace, so I don't know.",
    "Not really. To cross the islands I'll need a plank, and, hopefully, there's still a pole in the goat pen on the way up the mountain.",
    "Don't worry. I've found rarer things in my time. I'll be back as soon as I can.",
    "Asleif? Asleif? Sorry to bother you, but I need your help. Asleif? Oh, well, I did put her to rest.",
    "Ah, Asleif, thank goodness you're here. I can see you! I...I'm pretty sure I couldn't see you before.",
    "That's amazing! It's good that I found you. I was worried that you might have, you know, moved on.",
    "What must I do to prove myself worthy?",
    "King Vargas of Miscellania has turned into a yeti, as Nial Swiftfling did. He and I were hoping that you could cure him.",
    "I have it here.",
    "So, what should I do with the pouch?",
    "I have this diamond root. Are you sure this is going to work? After all, you couldn't save Nial.",
    "I spoke to him. He doesn't remember you helping him.",
    "That's a shame. I have the diamond root, though. What should I do with it?",
    "Enchant it? I thought your tribe was against that.",
    "Your Majesty, I have the cure!",
    "I wonder what I should do with Asleif's herb pouch.",
    "That seems fair.",
    "So, you'll go the feast?",
    "I suppose not.",
    "I killed the beast!",
    "Perhaps. Have a look at this rune.",
    "I found it in the ice cave where you fought the creature. I think it's evidence that someone else was there.",
    "Is there a chance that you've forgotten?",
    "I know this bit. Could we skip on to the new part?",
    "Yes, that's a bit better, thank you.",
    "She's Asleif, daughter of Hamal. She's eager to help and, eventually, she persuades you to let her. Is that about it?",
    "I can't believe you fell for that. 'No, Chief, I wouldn't dream of crafting runes.' I wouldn't be surprise if she was from Lunar Isle.",
    "So, what do you intend to do?",
    "You are very welcome. I will tell Manni that you're going to the feast.",
    "Hello!",
    "All in a day's work, Manni.",
    "Cheers!",
    "Sorry. Skål!",
    "Skål!",
    "I found this astral rune. DO you know who it might belong to?",
    "What's it worth?",
    "Fine. If it's the same story I've heard from Chieftain Brundt, Mawnis the Burgher and King Vargas, I'm more interested in the bits they don't remember. I want the truth.",
    "Point taken. Do you want to tell me the story or not?",
    "Is that the tablet everyone is going on about, just lying on the floor?",
    "How do you remember this bit? You weren't there.",
    "Yes, of course you can.",
    "About your rune..."
  ],
  "Manni the Reveller": [
    "Hey! It's [Fremennik Name]! Let me buy you a drink. Listen. I need help with something very hush-hush. Are you the [man/woman] for the job?",
    "Well, it's the Chieftain's birthday soon and I'm organising a surprise feast for him. All I need you to do is invite a couple of people. Can you help me?",
    "Marvellous. Now, Brundt is an old friend of Mawnis Burowgar of Neitiznot and King Vargas of Miscellania. If you could invite them to the feast, that would be great. Come back if you have any problems.",
    "Ah, [Fremennik Name], there you are! How did you get on with the invitations?",
    "They won't come? That's no good! Well, you know what a decent Fremennik reveller does in the face of adversity.",
    "True, true. I was going for staring adversity down and conquering it.",
    "Perhaps, but it's worth it. Listen, I don't think it's worth keeping this a secret any more. Speak to Brundt and see what he says.",
    "Don't tell me – I heard all about it! Not only are you a fine drinker, [Fremennik Name], but you're the master of organising feasts!",
    "I want you to have this old book. It's been in my family for ages, but it's all about fighting, so it's not like I'll read it. Let's get this party started!"
  ],
  "Mawnis Burowgar": [
    "I can't go.",
    "Ah, you're entering a world of trouble there, [Fremennik Name]. I can tell you now that I'm not going, and, if you were planning to talk to King Vargas, you won't get anywhere with him either. He still blames the Chieftain for what happened to him. Brundt will enlighten you, if you want to know why.",
    "Really? I wonder how much the old man remembers. Let me tell you a story.",
    "We had found the home of a foul ice beast.",
    "It was one of the few times that we agreed with Prince Vargas. So, we returned and ran. That is why I won't go. I barely heard from him since, and, each time, it's been to chase after that troublesome tablet. Nial and I only went in the first place because I wanted to help Brundt with his quest, now he thinks I stole his treasure!",
    "Let me guess: he's forgotten large elements of it and inflated his own role.",
    "Of course he did. How could he have all the attention with someone like Nial around? King Vargas was proud, even before that fur addled his brain. Can I help with anything else?",
    "Certainly. I'll write them down for you. Please find something that will put my dear sister's mind at rest.",
    "Take care, [Fremennik Name].",
    "That's excellent news! I think I'll go to the feast after all.",
    "Skål!",
    "Skål!"
  ],
  "King Vargas": [
    "Brundt's birthday, you say? I'd rather be turned into something even more ridiculous!",
    "If it weren't for Brundt and his seer, I'd still be human and adventuring. I wouldn't go to his feast, even if I could fit through those doors. You can give up on Mawnis too; he hasn't forgiven Brundt for what happened that day. Brundt should be made to apologise.",
    "He'll have forgotten the truth.",
    "To be honest, I'd rather forget.",
    "Very well. Listen to me...",
    "We had journeyed to the bottom of an ice cave, where a terrible creature had its lair.",
    "Was that the one from Jatizso? I don't remember, I think he got himself killed somewhere.",
    "Do you see now? Brundt is obsessed with his stupid tablet while I'm stuck looking like this!",
    "I fought and suffered with it for years, but, eventually, even I was forced to succumb. A lesser man would have given up long before I.",
    "It is! I've had to turn back every design for a throne, and, whenever I ask about widening the doorways, they just mutter about 'supporting walls'.",
    "Really? I don't remember that.",
    "Certainly. This pen you made is really handy, you know.",
    "While you're out, see if you can find a way to turn me back.",
    "Well, I don't know anything about herbs. Where is that girl these days?",
    "A main in a bear suit?",
    "So, you can find her there?",
    "Is it easy to get there?",
    "I'd give you a plank, but I don't have one handy. Sorry.",
    "Marvellous! Let me have it.",
    "This is fantastic! I'm human again! You are a hero above heroes, and I'm proud to have you as Regent!",
    "Give it to me! I can keep it to remember her by, I owe her that much.",
    "Just try to stop me! After that, I'm out adventuring again. There's nothing to worry about with you taking care of the place.",
    "Skål!",
    "Skål!"
  ],
  "Brundt the Chieftain": [
    "A birthday feast? I knew Manni was up to something!",
    "Yes, I know why. It's the same reason I'm angry with them – well, one of them, at least. Let me explain.",
    "It happened fifteen years ago, when I was young and foolish. We were gathering an adventuring party...",
    "You're right! I remember now – he was still a human like the rest of us.",
    "We were defeated. To this day I don't know how we escaped, but there we were, outside the Fishing Guild.",
    "Are you interrupting me?",
    "Well, I'll be happy when I know who took the tablet.",
    "There were five, and this was the last one we had to find.",
    "I don't know. The others went missing before Peer managed to restore them and complete the prophecy.",
    "It doesn't matter how they went missing. What matters is that a supposed 'friend' stole the last prophecy tablet and has lied to me about it ever since! There will be no feasting until I know who it was.",
    "You'd do that? I can't remember exactly where it is, so you might have to ask the others for directions.",
    "Good luck, [Fremennik Name].",
    "That's wonderful! Have you worked out who has the tablet?",
    "I don't remember anyone else being there.",
    "That would make sense. I always wondered how we got to the Fishing Guild.",
    "I remember!",
    "It was fifteen years ago, when I was young and foolish. We were gathering an adventuring party...",
    "Right, yes. I forget how the young people of today tend not to appreciate tales. Hold on... Mawnis. Nial. Is that better? Asleif is about to arrive.",
    "Hold! Who goes there?",
    "I have never known someone of so little patience. I will skip ahead.",
    "Well, I see that now! At the time it was- Oh, I don't need to justify myself to you.",
    "I must make amends with my friends. Thank you, [Fremennik Name], you've done me a great favour.",
    "Skål!",
    "Not 'cheers', [Fremennik Name], you're a Fremennik! Say 'Skål!'!",
    "Skål!"
  ],
  "Young Brundt": [
    "Glad you made it!",
    "Don't forget why we're here. We need to find that last tablet, so Peer can complete the text of the prophecy.",
    "Not to worry, we wouldn't have left without you.",
    "You have kin on Jatizso? Is this the one your sister ran off to marry?",
    "Hold! Who goes there?",
    "I am. It will be perilous, you may not want to come.",
    "Your clan? Are you of Hamal's people – the ones who came from the mountains near here?",
    "This changes things. Your father will not appreciate you being here and, honestly, nor should I.",
    "Fine, you are welcome to join us. Let's not waste any more time standing around here.",
    "Well, that was a disaster. Who has the tablet?",
    "Vargas, you milksop. Be quiet! I'm sorry, Mawnis. I mean nothing against your brother. It's just that the whole endeavour was for naught if we've lost that tablet.",
    "Come on, help me!",
    "Glad you made it!",
    "Fine, you are welcome to join us. Let's not waste any more time standing around here.",
    "Who are you? What do you mean by delaying us?",
    "Well, I do not like it. Answer me this, mage: do you craft runes?",
    "Very well. I suppose we could have you along and see how it goes. Come, let's get a move on.",
    "Come on, help me!",
    "What happened?",
    "I saw you take the tablet! Give it to me, witch.",
    "How dare you!",
    "Memories? What do you mean?",
    "Well, that was a disaster. Who has the tablet?"
  ],
  "Prince Vargas": [
    "Wouldn't miss it, friend. Always eager to face danger and slay its minions.",
    "Of course, to stand by when adventure beckons is no mark of a hero!",
    "Aaarrgghhhh!",
    "Will you two stop arguing? I'm dying or worse from this forsaken curse, and all you can do is bicker about your own problems!",
    "This is your fault, Brundt. I hope you never find your prize: let that be payment for the suffering you've caused.",
    "Not to fear, fair maiden. I, Vargas the Warrior-Prince, will vanquish it.",
    "Argh, I am cursed! I feel the foul magic spreading through me – but I must be resolute!",
    "Argh, I am cursed! It hurts, it hurts!",
    "Brundt, the foe is too powerful, we must flee.",
    "Wouldn't miss it, friend. Always eager to face danger and slay its minions.",
    "Brundt, the foe is too powerful, we must flee!"
  ],
  "Young Mawnis": [
    "Hail! I thought I had missed you. The seas have been terrible.",
    "Allow me to introduce my kinsman, Nial Swiftfling of Jatizso. There is nobody better with a throwing axe.",
    "The tablet? My kinsman loses his mind in a cave and you're worried about a piece of stone?",
    "Clearly none of us have it, unless you plan to accuse us of hiding it.",
    "You suffer the curse, but you can't spare a thought for my sister whose partner was already consumed by it. You, Brundt, you'd have me down as a thief! I'll take no more of this.",
    "I think a little landed on Vargas.",
    "I cannot! He is my kin!",
    "I cannot! He is my kin!",
    "Brundt, let her have it. There are more important things going on.",
    "The tablet? My kinsmen loses his in a cave somewhere and you're worried about a piece of stone?"
  ],
  "Nial Swiftfling": [
    "That is I. It's an honour, Brundt Chieftainsen.",
    "Stay back, Asleif.",
    "That does it!",
    "Yes, now you mention it, I do feel a little bit odd, like I'm- Arghhh!"
  ],
  "Asleif Hamalsdotter": [
    "Good day, Brundt of Rellekka. I hear you're gathering adventurers.",
    "That's exactly why I want to come. Fighters should never travel without a healer, and I am the best herbalist of my clan.",
    "My name is Asleif. Hamal is my father.",
    "Brundt, sir, you need my help. I have the skill and ingredients for many kinds of food and potions. My father does not know I am here, nor my betrothed. I just want to do some good with my skills before I am married.",
    "Calm, everyone; I need to concentrate. Your Highness, this may hurt a little.",
    "What is that thing?",
    "Oh, Vargas. Thank goodness you're here to protect us!",
    "What is that thing?",
    "Nial, be careful! It could be poisonous! Is anyone hurt?",
    "Nial, are you all right? You look a little unsteady.",
    "I don't think he's kin to anyone any more. He seems quite out of his mind.",
    "A friendly voice summons me from my slumber. Greetings, [Fremennik Name], can I help you?",
    "You didn't know what to look for before. Now you see what you expect to see.",
    "I could have done – and I have you to thank for that – but I have found a different kind of peace as the spirit of this lake. I pass my time in pleasant slumber, waiting until someone worthy needs my help.",
    "You have done more than enough in the past. How can I help you?",
    "That would be difficult. I was unable to save Nial, as you know, but I have learned a great deal since then. We shall try. I'll need my herb pouch; I think I lost it in the fight with the ice creature.",
    "Very good.",
    "Open it. Inside you should find some diamond root. You must be careful not to lose this root; there may be more in the pouch, but it is extinct now.",
    "I didn't have enough time. King Vargas is different: he was only splashed by the cursed spit and I began caring for him almost straight away. I'm sure there is something that could have saved him. Oh, I just can't remember.",
    "King Vargas has always been like that. He only remembers what suits him.",
    "I've awoken the spring on my island – fill a vial with water from it, then add clean irit. Next, grind the root with pestle and mortar, using magic to enchant it as though it were diamond jewellery.",
    "My father's tribe certainly are, but years as a ghost, then a lake spirit, have made me more open to such things. Enough about magic. Add the ground root to the irit mixture, then add some hair from a yeti. When you have finished the potion, take it to King Vargas.",
    "Good day, Brundt of Rellekka. I hear you're gathering adventurers.",
    "Brundt, sir, you need my help. I have the skill and ingredients for many kinds of food and potions. My father does not know I am here, nor my betrothed. I just want to do some good with my skills before I am married.",
    "A mage? I cannot work with a mage!",
    "My father will never accept such an argument.",
    "No, I suppose I cannot argue against it. I understand the benefits that magic can bring.",
    "I don't think he's kin to anyone any more. He seems quite out of his mind."
  ],
  "Hunting expert": [
    "Stop! It's dangerous down there. I keep seeing adventurers going down there and never coming back."
  ],
  "Freygerd": [
    "Not so loud! I used to be Freygerd of Neitiznot, but I moved here to be with my love years ago.",
    "I don't want to talk about it. I have too much stress dealing with the King.",
    "I asked if I could move away to live closer to my brother, but the King said I was liable for his new emigration tax. I just can't afford it.",
    "Thank you so much.",
    "I would be, but for years now I've been growing more worried about Nial. Ever since Mawnis told me that he'd turned into a yeti, I've been imagining him stuck in a cave somewhere, raging and driven out of his mind. It is too terrible.",
    "Oh, thank you! Now I know that he's at peace. He loved that axe; although, he did have a stack of them.",
    "Yes, thank you, [Fremennik Name]. Send regards to my brother if you see him before I do."
  ],
  "King Gjuki Sorvott IV": [
    "You again? You've got a nerve. I suppose you're here to tell me how to run my kingdom again.",
    "Of course. If I let my subjects leave, I need a means of reclaiming the lost tax revenue.",
    "You can't come in here and tell me what to do! I refuse to listen to another single word.",
    "Very well! If it'll make you leave me alone. I'll give Freygerd special dispensation.",
    "Don't push your luck, trouble-maker."
  ],
  "Mysterious Mage": [
    "Wait!",
    "I'm here to offer my services. To travel without a mage would be... unwise.",
    "Of course you can, dear. I know how your people feel about the over-reliance on tools and tricks. I can assure you that magic is not trick; it is instead a skill that I have perfected over a lifetime.",
    "Do you accept the argument? You have already said that your father does not know you are here.",
    "Hmm... No, of course not. Runecrafting is for the gods, not mortals.",
    "Hold on.",
    "I teleported us out. The yeti was about to kill us all.",
    "Please don't threaten me, Brundt of Rellekka, I don't want to hurt you. I'm keeping the tablet because I don't think you are ready for it.",
    "Thank you, Mawnis. I'm sorry for your loss. I'm sorry for you too, your Highness. I'm not sure this will help, but it won't hurt to try.",
    "Now, if you'll all excuse me, I have to be off. I will clear your memories before I go, however."
  ],
  "Baba Yaga": [
    "You found my lucky rune! May I have it back?",
    "Oh, aren't you the mercenary? Give me the rune and we'll see what you gain. First, I wish to tell you a story.",
    "Ah, you want the truth. If the others don't remember, what makes you think that I can? Who's to say that I even know the truth?",
    "Certainly, I do.",
    "They'd got themselves into something they couldn't handle.",
    "Yes. Vargas had put it down, moaning about how heavy it was.",
    "So, I teleported them away.",
    "We escaped to the Fishing Guild. I dare say you know the spell.",
    "I don't remember this, but you've heard about it. I can read minds, remember?",
    "Since you know the rest, I think we can stop there. Now you know as much as I do. Well, not as much as I do, of course, but now you know something, at least.",
    "Listen to me while I'm talking, dear.",
    "Please try to concentrate."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Glorious_Memories?oldid=35357756’"
  ]
}