{
  "Xenia": [
    "I'm glad you've come by. I need some help.",
    "Some cultists of Zamorak have gone into the catacombs with a prisoner. I don't know what they're planning, but I'm pretty sure it's not a tea party. There are three of them, and I'm not as young as I was the last time I was here. I don't want to go down there without backup.",
    "I knew you would! We've got no time to lose. You head down the stairs, and I'll follow.",
    "Very wise. I got into a lot of trouble in my youth by rushing in without knowing a situation.",
    "Lumbridge is a Saradominist town, but there will always be some people drawn to worship Zamorak. They must have found some ritual that they think will give them power over other people.",
    "A young woman named Ilona. She had just left Lumbridge to apprentice at the Wizards' Tower. They grabbed her on the road. Without training she didn't have a chance.",
    "The catacombs of Lumbridge Church. The dead of Lumbridge have been buried there since...well, for about forty years now.",
    "The cultists all have weapons, and you'll be able to keep them if we succeed. This adventure will also help to train your combat skills.",
    "So, will you help me, adventurer?",
    "My name's Xenia. I'm an adventurer. I'm one of the old guard, I suppose. I helped found the Champions' Guild, and I've done a fair few quests in my time. Now I'm starting to get a bit old for action, which is why I need your help.",
    "Oh, I have my ways. I get the feeling that you're one to watch; you could be quite the hero some day.",
    "Who doesn't know who you are? You're a legend even in the Legends' Guild! It's an honour to meet you, Player.",
    "Old Doctor Harlow told me about you. I hear you've taken up his vampyre-slaying mantle and finally put Count Draynor down. Good job.",
    "Father Aereck told me it was you who put that old ghost in the graveyard here to rest. You sound like you're quite the adventurer.",
    "When you're ready, head down into the catacombs and I'll follow.",
    "Hey! I want to talk to you!",
    "Looks like there's a guard in the room ahead. I think we should be able to overpower him. Speak to me if you have any questions.",
    "There's a guard in the room ahead. Together we should be able to take him out.",
    "It looks like the cultist has a bow. The best way to deal with someone with a ranged weapon is to get close to them and attack with melee.",
    "It's something Zamorakian cults do sometimes; a way of swearing loyalty to their leader. A blood pact doesn't have real magical power, but that kind of thing can have great power over a person if they believe strongly enough.",
    "Ah... It looks like I'm too old for this after all. You'll have to do the rest without me. I've no doubt you're a skilled warrior, but I think I can help you make more of your talents. I'll follow you, but I'll stay out of combat. Return to me if you're wounded. I have some food to share. The first cultist is using a ranged weapon. You should wield a melee weapon to be most effective against him.",
    "Wield a melee weapon, then either run straight at him or make your way around the room so that he can't get a clear shot.",
    "There's not much to tell. Just run up and attack. You don't even need a weapon - you can use your fists. Melee combat is strong against rangers. Avoid magic users, though.",
    "Don't worry about me. I've survived worse wounds than this. I'm going to hang back from combat, but I'll be here to give you advice if you need it. I'm sure you can beat these cultists on your own.",
    "I'll follow you, but I'll stay out of combat. Return to me if you're wounded. I have some food to share.",
    "You're lightly wounded. Here, have some food...",
    "You're lightly wounded. You should eat some of the food you're carrying.",
    "You're badly wounded! You should eat some of the food you're carrying.",
    "The first cultist is using a ranged weapon. You should wield a melee weapon to be most effective against him.",
    "It's a pity you had to kill that man...but I'm not questioning your judgment.",
    "I don't think that cultist will be any more trouble. I'm glad you didn't have to kill him.",
    "I think the second cultist was using magic. You should use a ranged weapon to defeat magic-users. Ask me if you need any help.",
    "The first cultist is defeated, but not dead. I'll leave it up to you to how to deal with him.",
    "You'll need to pick up the bow and equip it before you can attack the second cultist.",
    "You'll need to equip the bow before you can attack the second cultist.",
    "You're holding the bow right. You should be able to attack the second cultist without any trouble.",
    "I see you've brought your own ranged weapon. I'll assume you know how to use it!",
    "In order to use ranged combat, you'll need to wield a ranged weapon. For most weapons you'll also need ammunition, but if you use a chargebow you'll always be able to fire low power magical arrows. After that it's easy; just attack your enemy. Ranged combat is good against magic users. It's not so good against melee fighters, since projectiles have trouble getting through heavy armour.",
    "Well done! You'll need to open the gates to reach the other gallery. There should be a winch nearby.",
    "I heard you killed the second cultist. It's a pity it had to come to that...but I'm not questioning your judgment.",
    "The second cultist came past me on her way out. I don't think she'll be any more trouble. I'm glad you didn't have to kill her.",
    "I heard you killed the second cultist. It's a pity it had to come to that...but I'm not questioning your judgment.",
    "The second cultist came past me on her way out. I don't think she'll be any more trouble. I'm glad you didn't have to kill her.",
    "I think the third cultist was a melee fighter. Magic is the best thing to use against melee fighters. Speak to me if you need any help.",
    "I think you'll need to get across to the other gallery. There should be a winch that opens the gates so you can walk across.",
    "You'll need to deal with the second cultist. You should be able to get to the other side of the gallery now that you've opened the gate.",
    "You should wield the cultist's staff. That will mean you have a supply of air runes in order to cast the spell Air Strike.",
    "You're holding the staff correctly, so you can cast the spell Air Strike.",
    "I see you've brought your own magic weapon, but you need to choose which spell to cast.",
    "Magic is based on runes. The runes contain magical power, and you can cast spells by combining them in specific ways. It's like cooking: the runes are ingredients, and a spell is a recipe. Some magical staves act as an infinite supply of a certain type of rune. For example, casting Air Strike normally requires an air rune, but if you're holding an Air staff you can cast it for free. Magic is very useful against melee fighters. Watch out for rangers, though; arrows go straight through mage robes.",
    "Dragith Nurn? I was hoping he wouldn't come into this. Listen...I met Dragith Nurn once. I was just starting out as an adventurer, and he was an old man. I discovered his secret... Dragith Nurn was a wizard. He studied at the Wizards' Tower, but he also studied the dark art, necromancy, on his own. He had a secret magical workshop beneath Lumbridge. He would steal bodies from the graveyard and perform experiments on them. Necromancy was like an addiction for him. When I met him he was very troubled; very conflicted. I convinced him to put an end to it all. He couldn't destroy all the undead he had created - not permanently - so he trapped them all in the lower level of his workshop and sealed it off. He converted the upper level into these catacombs. Everyone thinks Dragith Nurn is buried here in this tomb, but he isn't. He built the tomb to hide the entrance to the lower level. Dragith Nurn is still down there. He knew that when he died he would rise again as a monster, so he sealed himself in with his creatures.",
    "The last cultist is a melee fighter, so you should prepare to cast a magic spell before you attack him. Come back here and I can help you.",
    "If you've defeated the last cultist, you'll need to decide how to deal with him. Once you've done that, release the prisoner and we can get out of here.",
    "You've defeated the last cultist, but you still need to untie their prisoner. She's downstairs.",
    "Well, adventurer, it looks like you have prevailed. You should keep the cultists' weapons as a reward.",
    "I took the liberty of retrieving the weapons you missed.",
    "Is there anything you want to ask before you go to seek out new adventures?",
    "Farewell, adventurer.",
    "The cultists' ritual opened up the lower level of the catacombs, which is swarming with undead creatures. If you want to practice your combat skills, you could go down there. Alternatively, if you explore the world I'm sure you'll find other quests you can do.",
    "Very perceptive, adventurer. I was wounded, but not as badly as I looked. I took the opportunity to see how you would fare.",
    "I was prepared to step in and rescue her if you failed, but I won't always be that ready. That's why I had to do this. The world needs heroes. I was a hero, once, but I'm not getting any younger. I need to make sure the new generation has its own heroes.",
    "You're a born adventurer. I can practically smell it on you. People like you have a habit of coming back from things that would kill an ordinary person.",
    "Very well indeed. You're a hero. You're exactly the sort of person the world needs. I'm glad I met you.",
    "Reese managed to complete the ritual with his own death. He's opened the staircase to the nest of undead creatures in the lower level of the catacombs. Without a necromancer to control them, the creatures won't leave the tomb. I'll warn Father Aereck not to let people go down there. You're an adventurer, though. If you want to, you can venture into the tomb and fight the creatures.",
    "Hello again, adventurer.",
    "Very perceptive, adventurer. I was wounded, but not as badly as I looked. I took the opportunity to see how you would fare.",
    "I was prepared to step in and rescue her if you failed, but I won't always be that ready. That's why I had to do this. The world needs heroes. I was a hero, once, but I'm not getting any younger. I need to make sure the new generation has its own heroes.",
    "You're a born adventurer. I can practically smell it on you. People like you have a habit of coming back from things that would kill an ordinary person.",
    "Very well indeed. You're a hero. You're exactly the sort of person the world needs. I'm glad I met you.",
    "Reese managed to complete the ritual with his own death. He's opened the staircase to the nest of undead creatures in the lower level of the catacombs. Without a necromancer to control them, the creatures won't leave the tomb. I'll warn Father Aereck not to let people go down there. You're an adventurer, though. If you want to, you can venture into the tomb and fight the creatures.",
    "It's something Zamorakian cults do sometimes; a way of swearing loyalty to their leader. A blood pact doesn't have real magical power, but that kind of thing can have great power over a person if they believe strongly enough.",
    "Dragith Nurn was a wizard. He studied at the Wizards' Tower, but he also studied the dark art, necromancy, on his own. He had a secret magical workshop beneath Lumbridge. He would steal bodies from the graveyard and perform experiments on them. Necromancy was like an addiction for him. When I met him he was very troubled; very conflicted. I convinced him to put an end to it all. He couldn't destroy all the undead he had created - not permanently - so he trapped them all in the lower level of his workshop and sealed it off. He converted the upper level into these catacombs. Everyone thinks Dragith Nurn is buried here in this tomb, but he isn't. He built the tomb to hide the entrance to the lower level. Dragith Nurn is still down there. He knew that when he died he would rise again as a monster, so he sealed himself in with his creatures.",
    "Yes, one of my contacts in the Champions' Guild found them and returned them to me.",
    "Farewell, adventurer."
  ],
  "Reese": [
    "Come on, Kayle! We don't have forever.",
    "We made a blood pact, Kayle! The three of us are in this all the way.",
    "Yes! The blood pact! You read the book!",
    "Shut up! Kayle, you stay here. Guard the door. You, come on.",
    "The potion is complete. Where are they? The whole group should be present.",
    "Shut up! Who are you? What are you doing here?",
    "This will be your tomb, adventurer. The blood pact will prevail!",
    "Maybe you can take her place as the sacrifice, adventurer. Stand and fight!",
    "They were weak. Zamorak will turn his face from them - but he will smile on me when I offer him your blood!",
    "They were weak. Zamorak will turn his face from them - but he will smile on me when I offer him your blood!",
    "They were weak. Zamorak will turn his face from them - but he will smile on me when I offer him your blood!",
    "This will be your tomb, adventurer. The blood pact will prevail!",
    "You've beaten me, adventurer. Now strike the final blow! End the blood pact in this tomb.",
    "Ask your questions.",
    "I am Reese! Warrior of Zamorak and leader of the blood pact!",
    "Faithful servants of Zamorak! We bound ourselves together in the great god's service with the blood pact!",
    "End the weak god Saradomin's dominance over Lumbridge! With the blood pact, and the power of the tomb of Dragith Nurn, we would send an army of the dead to claim this town for Zamorak!",
    "Then finish me! End the blood pact in this tomb.",
    "No! There must be a death! The blood pact must be complete!",
    "No! There must be a death! The blood pact must be complete!"
  ],
  "Kayle": [
    "Look, Reese; are you sure about this? There must be some other way we can...",
    "Yes, but...",
    "Are - are you going to kill me?",
    "Y-yes! I'll tell you anything!",
    "I- My name's Kayle. I'm a ranger. Well, I'd been practising the chargebow... I guess I wasn't as good as I'd thought.",
    "Reese is the leader. All this, the blood pact, it was his idea. He doesn't know magic but he's a strong fighter. Caitlin is a wizard. She was a student at the Wizards' Tower, but she left. She wanted to study dark magic.",
    "I - I don't really know! Honestly! Listen...Reese used to be an acolyte at the church here. He discovered something about these catacombs; I don't know what. Something about how they were built, I think. Caitlin was a student at the Wizards' Tower. She found something too, in the ruins of the old tower, from back when Zamorakian wizards used it. Caitlin and Reese put what they'd found together. They said they'd discovered a ritual they could perform, something that could give them power over life and death. We made a blood pact, the three of us. So that we'd be in it together, whatever happened. Then we kidnapped Ilona. She was another apprentice from the Wizards' Tower, someone Caitlin had known there. Reese and Caitlin are going down there to perform the ritual. I don't - I don't know what it involves.",
    "The blood pact! We'd made a blood pact, and Reese said that bound me to him. It meant I had to do anything he said. He...he said he could curse me.",
    "Are - are you going to kill me now?"
  ],
  "Caitlin": [
    "Do we have to take this idiot?",
    "What are you waiting for? Finish me!",
    "What?",
    "I am the wizard Caitlin.",
    "Reese used to be an acolyte at Lumbridge Church. He and I came up with this whole idea.",
    "Kayle's just some idiot Reese roped into helping us. I heard you let him go. It's more than he deserved. He's useless.",
    "Kayle was just some idiot Reese roped into helping us. I heard you killed him and I can't say I mind. If I'd had my way we'd have used him as the sacrifice.",
    "Idiot hero! You don't even know what this place is, do you? This is the tomb of Dragith Nurn! Dragith Nurn was a necromancer. He lived in Lumbridge decades ago. He kept his necromancy secret. Everyone thought he was just a wealthy nobleman and wizard. He paid for these catacombs to be built, and he's interred here in a special tomb. I was a student at the Wizards' Tower. I discovered the note Dragith Nurn had made while he was a wizard there. Reese was an acolyte here at the church. He learned that Dragith Nurn was buried here. The body of a necromancer contains powerful magic. We learned we could perform a ritual on his tomb to unlock the secrets of his work. We would have gained mastery over life and death!",
    "All right. Now finish me!"
  ],
  "Ilona": [
    "Let me go! I didn't make any blood pact with-",
    "Let me go, you-",
    "Thank Saradomin! He's insane! He's going to kill me!",
    "Help! Untie me so we can get out of here!",
    "Thank the gods. We're out. I thought I was going to die down there. You saved my life, whoever you are. Thank you."
  ],
  "​Xenia": [
    "You're badly wounded! Eat some food, quickly...",
    "I want to give you an experience lamp. Speak to me again when you have space to take it."
  ],
  "Wizard Ilona": [
    "Adventurer! It's good to see you again!",
    "I passed my apprenticeship! I'm a wizard now.",
    "I'm studying stun and bind spells. If I get into a fight again, I want to be able to disable enemies without killing them, like you did with those cultists.",
    "I’m studying elemental battle spells. I’m not a violent person, but…after you had to kill those cultists to rescue me, it made me realise I have to be able to defend myself.",
    "You don't remember me? I suppose you must rescue lots of girls from evil cultists. I can't expect you to remember them all.",
    "Hello again, adventurer.",
    "Reese managed to complete the ritual with his own death. He's opened the staircase to the nest of undead creatures in the lower level of the catacombs. Without a necromancer to control them, the creatures won't leave the tomb. I'll warn Father Aereck not to let people go down there. You're an adventurer, though. If you want to, you can venture into the tomb and fight the creatures.",
    "Very perceptive, adventurer. I was wounded, but not as badly as I looked. I took the opportunity to see how you would fare.[sic]",
    "I was prepared to step in and rescue her if you failed, but I won't always be that ready. That's why I had to do this. The world needs heroes. I was a hero, once, but I'm not getting any younger. I need to make sure the new generation has its own heroes.[sic]",
    "You're a born adventurer. I can practically smell it on you. People like you have a habit of coming back from things that would kill an ordinary person.[sic]",
    "Very well indeed. You're a hero. You're exactly the sort of person the world needs. I'm glad I met you.[sic]",
    "It's something Zamorakian cults do sometimes; a way of swearing loyalty to their leader. A blood pact doesn't have real magical power, but that kind of thing can have great power over a person if they believe strongly enough.",
    "Dragith Nurn was a wizard. He studied at the Wizards' Tower, but he also studied the dark art, necromancy, on his own. He had a secret magical workshop beneath Lumbridge. He would steal bodies from the graveyard and perform experiments on them. Necromancy was like an addiction for him. When Xenia met him he was very troubled; very conflicted. She convinced him to put an end to it all. He couldn't destroy all the undead he had created - not permanently - so he trapped them all in the lower level of his workshop and sealed it off. He converted the upper level into these catacombs. Everyone thinks Dragith Nurn is buried here in this tomb, but he isn't. He built the tomb to hide the entrance to the lower level. Dragith Nurn is still down there. He knew that when he died he would rise again as a monster, so he sealed himself in with his creatures.",
    "Yes, one of my contacts in the Champions' Guild found them and returned them to me.",
    "Farewell, adventurer."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:The_Blood_Pact?oldid=36209251’"
  ]
}