{
  "Gideon Bede": [
    "In the name of Saradomin, I beseech you - assist me! I have come to this place seeking a dangerous fugitive. He has stolen a formidable demonic tome; one that could spell the end of this entire city. Help me to stop him - please!",
    "You'll help? Praise Saradomin! I knew you looked righteous! We don't have much time, so listen carefully. I am pursuing Denath, a dangerous and unstable wizard. Denath infiltrated Edgeville monastery and stole a tome of demonology from my order. The book was once used to summon Delrith, an ancient demon, from the Infernal Dimensions. Delrith has the power to demolish cities, and is impervious to all forms of attack, save one - the holy sword Silverlight. Silverlight rests in the crypt beneath this very church, watched over by the spirits of its former owners. I've tracked Denath to this city, but I lost his trail. While I hunt him down, I need you to retrieve the sword; should Delrith return to this world, Silverlight shall be our only salvation! Climb down the trapdoor to the south to enter the crypt beneath this church, and retrieve Silverlight.",
    "I am Gideon Bede, an occult scholar and caretaker of Edgeville Monastery's modest library. Abbot Langley entrusted the tome of demonology to me. It is my fault that Denath now has it. Though I could not hope to best Denath in battle, it is my duty to try and stop him.",
    "Denath is a mad man who claims to worship Zamorak. Denath revels in destruction, and is blinded by his lust for power. He would call forth a demon that could just as easily kill him and everyone in Varrock as do his bidding. Denath is insane, and to be approached very cautiously.",
    "Delrith is an ancient and powerful demon. This is not the first time he has entered our world. 150 years ago, a legendary hero battled Delrith, and banished him back to Infernus.",
    "Silverlight is the only weapon that can harm Delrith, and is interred within the crypt beneath this very church. We must secure Silverlight in case the worst should come to pass!",
    "I tried, but the holy sword is guarded by the spirits of the dead - three brave souls that wielded Silverlight in life. I faced the spirits' trials, but was judged unworthy. I am but an academic. I cannot stop Denath without your help, hero.",
    "Alas, then all is lost, and Varrock shall burn...",
    "Climb down the trapdoor to the south to enter the crypt beneath this church, and retrieve Silverlight.",
    "Take care, hero. This place is likely crawling with Denath's fanatics.",
    "I know. It was returned to me. This time, take better care of it.",
    "Take care, hero. I fear our greatest challenge is yet to come.",
    "Not now, adventurer! We must stop Denath!",
    "That takes care of them! Let's move on!",
    "Is there no end to these extremists? Quickly, we must press on.",
    "That's the last of them. Hurry; find Denath before it's too late!",
    "Denath! Stop!",
    "No!",
    "I hope you brought Silverlight, hero! Steel yourself!",
    "Saradomin; shield us!",
    "Aaaaah!",
    "I must rest to shield us again!",
    "Hero! Slay Delrith, now!",
    "He's charging another attack!",
    "Hero, to me!",
    "Saradomin; shield us!",
    "Aaaaah!",
    "Delrith is defeated, but this place is coming apart! Let's get out of here!",
    "Well done, hero. Your actions saved not only myself, but all of Varrock, from being turned to smouldering ash by Delrith!",
    "Return when you have space for five items, and I will reward you for your help!",
    "Here - you've certainly earned this!",
    "I know. It was returned to me. This time, take better care of it.",
    "I'm relieved that barrier I conjured actually worked. I never imagined I might have to protect us from a real demon! Farewell, my friend. Saradomin watch over you."
  ],
  "Player": [
    "Why have you not already retrieved Silverlight?",
    "I shouldn't go about breaking into church basements uninvited.",
    "THAT!",
    "That's it?",
    "How can I do that? There's no way across, and it's a long way down!",
    "Aaaaaaaaaaah!",
    "There it is...Silverlight. Finally!",
    "I already claimed Silverlight. No reason to go back down there.",
    "I shouldn't go about breaking into church basements uninvited.",
    "I lost Silverlight...",
    "I lost Silverlight...",
    "I already claimed Silverlight. No reason to go back down there.",
    "I've slain Delrith. I don't need to go back down here."
  ],
  "Spirit of the Body": [
    "Welcome.",
    "If you wish to wield Silverlight, you must pass the three trials.",
    "We are the guardians of this place.",
    "What...",
    "Ha...",
    "The Trial of the Body will show you have the strength to properly wield Silverlight. A powerful weapon can easily be wrested from weak arms.",
    "The Trial of the Body is to clean up these bones.",
    "Don't underestimate the trial...",
    "...manual labour can be hard work.",
    "There are still some bones for you to clean up!",
    "You have completed the trial. I will wait for you in Silverlight's chamber.",
    "You passed the Trial of the Body; you have proven you have the strength to wield Silverlight."
  ],
  "Spirit of Faith": [
    "Welcome.",
    "The Trial of the Body, in the west.The Trial of Faith, in the north.The Trial of the Mind, in the east.",
    "We are the spirits of three who wielded Silverlight.",
    "...is...",
    "...ha...",
    "The Trial of Faith demonstrates that you believe in the power of the gods to guide you. Without faith, Silverlight will be powerless in your hands.",
    "The Trial of Faith is simple. You must cross this chasm.",
    "I will tell you the path you must walk. Do not believe your eyes; each step you take will be a step of faith.",
    "Step out into the chasm from the step behind me.",
    "Have faith. Continue on your path.",
    "You have completed the trial. I will wait for you in Silverlight's chamber. You will not fall on your way back. Walk where you please, for your faith is strong.",
    "You passed the Trial of Faith; the gods smile upon you and will guide the blade in your hands. You are worthy to wield Silverlight. Farewell, hero."
  ],
  "Spirit of the Mind": [
    "Welcome.",
    "Seek us there when you are ready.",
    "We protect the holy sword.",
    "...creepy?",
    "...ha!",
    "The Trial of the Mind will prove that you are focused on your task, and understand what lies ahead of you. You cannot be trusted with Silverlight if your mind is clouded.",
    "Why are you in this place?",
    "And what is Silverlight?",
    "I cannot prove that there is not such a group. However, your answer falls short.",
    "Incorrect.",
    "Why do you require a sword that slays demons?",
    "Wanting for the sake of wanting is shameful and ignoble. Incorrect.",
    "Who is this demon?",
    "And who sends you to claim Silverlight and fight Delrith?",
    "That is incorrect.",
    "Incorrect. Denath attempts to summon Delrith.",
    "Your mind is focused. The Trial of Mind[sic] is complete.",
    "You have completed the trial. I will wait for you in Silverlight's chamber.",
    "That is not correct.",
    "Incorrect.",
    "Silverlight yields not to the vain.",
    "Stealing the earthly possessions of the dead is not a purpose worthy of wielding Silverlight.",
    "As...nice as that is for you, it is not the answer I seek.",
    "You passed the Trial of the Mind; you have proven your mind unclouded and clear."
  ],
  "Spirit of the Faith": [
    "Step into the chasm.",
    "Step north.",
    "Step north.",
    "Step east.",
    "Step east.",
    "Step north.",
    "Step north.",
    "Step north.",
    "Step west.",
    "Step west.",
    "Step south.",
    "Step west.",
    "Step west.",
    "Step north.",
    "Step north.",
    "Step north."
  ],
  "Spirit of the [Body/Mind/Faith]": [
    "You have completed my trial. Visit the other spirits, and complete theirs."
  ],
  "Cultists": [
    "Carlem...",
    "Aber...",
    "Camerinthum...",
    "Purchai...",
    "Gabindo..."
  ],
  "Denath": [
    "Arise, O mighty Delrith. Bring destruction to this soft weak city!",
    "Well, well! If it isn't Gideon Bede. I'm surprised you had the nerve to pursue me.",
    "You should have stayed in Edgeville, bookworm! You're already too late. BEHOLD!",
    "Diabolica fratri; with cleansing fire, I break the seal that binds thee!",
    "Hahaha! The demon is unbound! I'd love to stay and witness your annihilation, but I'd best be far away when Delrith incinerates Varrock. Farewell!"
  ],
  "Delrith": [
    "I'm free!",
    "This world will burn!",
    "Starting with you!",
    "What?",
    "PREPARE TO BE INCINERATED!",
    "NOOOOOO!"
  ],
  "Congratulations! You have completed": [
    "'Demon Slayer' - Complete this Novice quest."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Demon_Slayer?oldid=35385136’"
  ]
}