{
  "Olaf Hradson": [
    "Who is that? Identify yourself!",
    "Nothing... Just carving these horribly broken pieces of driftwood. In the middle of nowhere. In damp clothing.",
    "Wait! Would you do me a favour?",
    "Look, you see that heap of driftwood over there? That is my ship, and all that is left of my one shot at making my ancestors proud of me. My family have always been great explorers and seafarers, and I recently set off on my maiden voyage. However, a big storm – yes, a huge storm in fact – blew my ship onto the rocks. Three times. I've been sitting here ever since, trying to think of a way to make my family proud, and if you will help me... I think I have a way.",
    "Thank you! I don't have much apart from my carvings, some driftwood and the map that I was following when I had my little... accident. If you help me out, then I'll gladly hand it over.",
    "Well, I have a little food left, although it's a little briny. If you take a couple of carvings to my wife and son in the village over the hill and tell them that I sent you with them from a distant island, then I can wait out here for a week or so before returning.",
    "Well, none of these are any good. I'll need some fresh wood from a decent tree. When I was swimming for my life I saw an odd-looking windswept tree to the east of here, up that cliff. Could you bring me some of that wood so I can work it?",
    "Yes... great eyes... they run in the family.",
    "Bah, well if you aren't going to help, do me a favour and jump off that cliff!",
    "So... Got the logs for me yet?",
    "Still cold. Still damp. 'Bout average, really.",
    "Wonderful! I'll carve them up now.",
    "Done!",
    "Yep! This is for my wife, Ingrid. I'm sure she will love it. Tell her it's tribal or something.",
    "And this one is for my son, Volf. Kids love planks in my experience. Tell him I said hello.",
    "Yes. Hurry back! And don't forget the story: I'm not here. I'm someplace far away.",
    "So how did my wife like her carving?",
    "Useless! Here: I carved a few more while you were gone - give her this one and be quick about it!",
    "Well, hurry up and give it to her then!",
    "Did my son like his present? I'll bet he was thrilled.",
    "Gah! Are you doing this deliberately now? Here, have another - and try not to lose this one!",
    "Well, take your time over it, why don't you.",
    "So...cold...need...fire.",
    "I won't...go...anywhere. I don't...care if I...freeze. I'd rather...die...than suffer...the shame. Just get the...fire burning. Use...these.",
    "Too...cold...to...hear...whining.",
    "Well, here, have another load. And get it right this time. I can feel...my life slipping away...cough, cough. Splutter.",
    "Ahhhhhhhh... Much better.",
    "Well, okay... but could I have a little of that food first? I've had nothing but seaweed and biscuits for the past week.",
    "Oh... That was a banquet compared to the stuff I've been living off. Look, I have a bit of a confession. I think that the map may well be cursed.",
    "Look, I'm sorry, okay. Remember that I followed this map and ended up on the rocks. It may be nothing, after all, but I think you should be very careful if you go looking for the treasure. Well, regardless, you've more than earned this map. It was the last one my grandfather, Sven the Helmsman, ever made. It is supposed to show the location of one of his stashes of treasure, but I have never been able to decipher the strange, runic inscriptions that point the way. I wish you luck!",
    "I'll sit here and practice carving. If you pass this way again, I'll be glad if you drop my next load of work off with my family. That or bring me some food before I starve. Whichever.",
    "Okay, okay, I was only asking. Well, regardless, you've more than earned this map. It was the last one my grandfather, Sven the Helmsman, ever made. It supposed to show the location of one of his stashes of treasure, but I have never been able to decipher the strange, runic inscriptions that point the way. I wish you luck!",
    "I'll sit here and practice carving. If you pass this way again, I'll be glad if you drop my next load of work off with my family. That or bring me some food before I starve. Whichever.",
    "Hey! I'm trying to carve and you're standing in my light! Move it!",
    "You lost the treasured map of Sven the Helmsman? How dare you! You'd best take better care of this one, or else!"
  ],
  "Player": [
    "It's me, [Player]. What are you doing out here?",
    "Okay... Well, have a nice day.",
    "What kind of favour?",
    "Okay. I'll help you out.",
    "So what is your plan?",
    "Alright, hand me over the carvings and I'll be on my way.",
    "Wow, you must have pretty good eyes to be able to see a single tree from the water during a heavy storm.",
    "Possibly later, when you don't smell so damp.",
    "Not yet. I just popped back to see how you were doing.",
    "Olaf, I cut some logs from the tree. Here's the wood.",
    "That's it?",
    "Sure...",
    "Alright. They live in Rellekka, right?",
    "I don't know... I may have accidentially lost it.",
    "I don't know... I still have to give it to her.",
    "I don't know... I may have accidentially lost it.",
    "I'll bet he will be... As soon as I go and give it to him.",
    "Excuse me, but are you Ingrid? The same Ingrid that is married to Olaf Hradson?",
    "I am a friend of your husband. He sent me here with a gift for you. An expensive, exotic gift from the far-flung and tropical shores of the Island of Obscurity.",
    "Certainly! Here it is. He sends his best wishes along with it.",
    "It's tribal! Very tribal! I watched the natives carve it myself.",
    "Oh, thank you! Enjoy your Obscurian Tribal Artifact(tm)[sic]. It has a million-and-one uses!",
    "Well, not at the moment. I seem to have mislaid it.",
    "Volf? Son of Olaf Hradson?",
    "No, but I do know your father. He sent me with a present for you from, err... From the Island of Obscurity.",
    "Right here. Enjoy!",
    "Very valuable. Have a nice time!",
    "Thanks! Enjoy your new... thing!",
    "Well, I'm sure it's around here somewhere. I'll get back to you later when I find where I left it.",
    "Olaf, are you all right?",
    "I delivered your carvings as you asked. Your family would like to see you again. Here, let me get you to the village before you freeze to death.",
    "Well at least give me the map like you promised!",
    "So... very... cold. Almost cold enough to tear up an old map with my fevered shivering. Cough, cough.",
    "Hey, Olaf. I dropped those slimy planks you gave me. Sorry, they were just too slippery to hold on to.",
    "Well, I'm glad you're happy. Can I have that map now?",
    "Alright, here, have some food. Now give me the map.",
    "What? All this running about for a cursed map! Couldn't you have made this little revelation before I fed you?",
    "Well, thanks. What will you do now?",
    "Not a chance.",
    "Well, thanks. What will you do now?",
    "Olaf, I seem to have lost your map, can I have another?"
  ],
  "Ingrid Hradson": [
    "Yes I am. Why do you ask?",
    "How wonderful! I assumed from the way the big oaf always referred to the rigging as 'big strings' that he couldn't navigate his way out of a soggy paper bag. So, can I see the gift he sent?",
    "I see. It looks like a log with 'Olaf was here' carved in it.",
    "Well, since you have come such a long way, you can have this. I baked it this morning, so it's still nice and fresh.",
    "Oh my... I was a little doubtful that you were telling the truth, but since you've lost something valuable, you must be a friend of my husbands. Come and see me again when you manage to keep a hold of it you poor, poor man."
  ],
  "Volf Olafson": [
    "Yes. Do I know you?",
    "Oh! That was fast! He only set off recently, and I was wondering how he was doing. So, where is this gift?",
    "What is it?",
    "Wait! Here, take this. I was going to have it for my lunch, but I suppose you can have it in payment."
  ],
  "Ulfric": [
    "Slay... outlander... intruder!"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Olaf%27s_Quest?oldid=35980648’"
  ]
}