{
  "Player": [
    "Hello there.",
    "I follow the path of Saradomin, Strength through wisdom.",
    "I come seeking challenges and quests.",
    "Ok I lied, I don't support Saradomin. I'm only here for dastardly evil purposes.",
    "I could ask the same of you.",
    "I serve only Zamorak. Strength through chaos.",
    "What is this quest of which you speak?",
    "I doubt that.",
    "Fine, I didn't want to talk to you either.",
    "My beliefs are in accord with the teachings of Guthix. Balance is power.",
    "And what sort of purpose would that be?",
    "I can make my own choices, who are you to dispute them?",
    "I have no particular allegiance.",
    "Then I shall leave you to your business.",
    "Why, what are you doing?",
    "I hope it goes well. Goodbye.",
    "What quest is that then?",
    "How can an abandoned mine be dangerous?",
    "Is there any other way into the mines?",
    "Where is the second entrance to the mines?",
    "How can you be discreet with THAT star emblazoned on your robes?",
    "Even so, you're not exactly keeping quiet about your allegiance are you?",
    "Is that much consolation when you get chopped up into little pieces?",
    "I can't see anyone behind you.",
    "You're right, I was wrong to doubt Saradomin.",
    "You're nuts, goodbye.",
    "Please? I'll be very careful with it.",
    "And you think you'll be safer in the mine than me?",
    "I'll trade for it.",
    "Pretty pretty please?",
    "I didn't want that key anyway.",
    "Why was everyone in the mines slaughtered? Surely, it wasn't their fault that the crystals formed?",
    "I must be going now, good luck on your quest.",
    "Hello there.",
    "Can you explain the history of these mines again?",
    "Hello there.",
    "Can you explain the history of these mines again?",
    "What the...?",
    "I've done it. I've managed to recreate the salve amulet that you spoke of.",
    "Correction, the key was in your possession.",
    "Ok, I've finished with it now anyway.",
    "Er...you're welcome?",
    "What powers does the salve amulet have?",
    "Thanks for the tip."
  ],
  "Zealot": [
    "State thy allegiance stranger.",
    "Ah, a wise choice my friend. But if you truly follow Saradomin, what brings you to these evil lands?",
    "A noble cause indeed. One that I can sympathise with, for I myself am upon a quest. One that will allow Saradomin to be glorified even in these dark lands.",
    "Then leave me, I have no time to listen to your poisonous tongue.",
    "Saradomin has granted you wisdom. The evil creatures of this land are cunning and you are right to question anyone's purposes here. I am upon a quest. One that will allow Saradomin to be glorified even in these dark lands.",
    "Then begone. Normally I would strike you down in an instant, but for now I have no time. I am on a quest of the utmost importance.",
    "It is no concern of yours, but rest assured it will help in crushing you and those others who serve your vile master.",
    "I would expect nothing less of you, misguided as you already are.",
    "Fear not fiend, even though I may leave you be, you shall not escape justice at the hands of the righteous.",
    "A wishy washy set of beliefs. You should follow Saradomin and find a real purpose in your life.",
    "To further the glory of Saradomin of course. Take myself, I am upon a quest that will allow Saradomin to be glorified even in these dark lands.",
    "I look only to help those who are misguided.",
    "Then your life is without reason or direction. I would talk to you further on this matter, but for now my attentions must be elsewhere.",
    "I shall pray that Saradomin grants you the wisdom to see through your folly.",
    "I am upon a quest. One that will allow Saradomin to be glorified even in these dark lands.",
    "Goodbye, and may Saradomin give you strength through wisdom.",
    "Well, below the very ground you stand upon lies an intricate network on tunnels that make up the abandoned Mort Ridge mines. These mines used to be a valuable resource to the inhabitants of Morytania.",
    "As with many things, this changed when Misthalin was finally able to push the minions of Morytania back, and Saradomin himself blessed the river Salve. The mines are also the site where the legendary artefact, the salve amulet, was thought to have been carved from the crystals that grow in the lower levels of the mine. These crystals are thought to be formed by the blessed water of the river Salve as it percolates through the rocks to the lower levels of the mine. It is not known what happened to the salve amulet, but it is generally believed that by encapsulating within it some of the goodness of Saradomin himself, it afforded the bearer power over evil. Saradomin has entrusted me alone with the task of regaining access to the mines, whatever the dangers.",
    "Because these mines are said to be haunted. The crystals and the ridge used to be protected by Zamorak's mage. Treus Dayth. Dayth failed and fell during an incursion by Saradominists, who then made it into the mines and were able to remove a shard of crystal. Zamorak, furious at his mage, condemned Dayth's soul indefinitely to an existence of turmoil in the mines. Dayth's soul is bound to prevent the crystals from ever being reached again. Further, Zamorak's then ruler upon the land ordered the slaughter of anyone within the mines and that the mines be sealed.",
    "Indeed I have found hope that this may be so. By making discreet inquiries I have been led to believe that a second entrance may exist into the mines. Further, I have come into possession of a key that will apparently afford entrance to the lower levels of the mines once inside.",
    "Of this I am not yet sure. From what I have been able to gather, it was not originally built for humans to enter by. Where it may be, I am still endeavoring to find out.",
    "Saradomin watches over me, I am not troubled by those who are not meant to notice.",
    "Saradomin will protect me. Even if I should fall there are many behind me who would stand in my place.",
    "I would rather be cut into little pieces whilst proclaiming the goodness of Saradomin than hiding my faith.",
    "Although you may not realise it, Saradomin works quietly in many people, such is the folly of looking with your eyes and not your heart.",
    "Let not your faith in Saradomin falter, for all else is insignificant.",
    "I'm afraid my task can be entrusted to nobody else. Saradomin has asked me alone to do this. I cannot take the slightest risk of losing this key. The stakes are too high.",
    "You know not what you deal with. There is evil in that mine and, whatever your assurances, I cannot risk you falling to the creatures within.",
    "Of course I'll be safe, my faith in Saradomin protects me.",
    "Saradomin provides for my every need. There is nothing you could offer me.",
    "Saradomin grant me patience. The answer is no.",
    "Witness the goodness of Saradomin, that he has granted you the wisdom to see our positions in perspective.",
    "Although the amulet was lost, it is my hope that if I can make into the mines I can craft another.",
    "It is said that some of the workers in the mines, merely from being in the presence of these crystals, found themselves bestowed with the love of Saradomin. The advantage to our cause was considered too great by some within Morytania. They set about mercilessly and brutally killed everyone in the mines rather than risk losing them to us. Such is the treachery of the servants of evil, that they even destroy their own kind without a moments thought. The mines are now rumoured to be haunted by the souls of all those brutally and needlessly killed.",
    "You should believe not in luck, but in the protection of Saradomin. Farewell.",
    "Hello again. I'm afraid I'm rather preoccupied. What was it you wanted?",
    "Hello again. I'm afraid I'm rather preoccupied. What was it you wanted?",
    "That hardly seems likely. There is no way you could have made it to the bottom of the mines without the key which is in my possession.",
    "My key, where is it? You stole it? Return that key to me now!",
    "Good, maybe all is not lost, despite your apparent lack of common sense.",
    "From what I have heard they would be put to best use in the slaying of the evil undead, the zombies and skeletons that walk this land."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Haunted_Mine?oldid=35697019’"
  ]
}