{
  "Zimberfizz": [
    "Wotcha guv'na!",
    "While you're 'ere, boss, mind takin' a butchers at somethin' for me?",
    "The soul obelisk is goin' all strange on me. Mind 'avin a look at it?",
    "Cheers! Just look 'round the throne room. 'Ave a good poke about and see if you can see why it's goin' funny.",
    "Fine, it wasn't anythin' serious anyway.",
    "Wotcha guv'na!",
    "What's up with the soul obelisk then?",
    "Well, when you do know let me know and we'll get it fixed.",
    "Search me, boss. Just have a look 'round. If you see anything odd shout it out and I'll come see.",
    "Looks like we got a magic leak somewhere. Maybe the obelisk is on the blink?",
    "Search me, boss. Keep looking.",
    "I know the feel of that magic. 'E's back!",
    "Looks pretty fresh too. Maybe you dropped it when you were fightin' Nomad?",
    "Search me, boss. Keep looking.",
    "I seen those before, when 'Is 'Ighness was talkin' to 'Is friends!",
    "Well, from here it looks fine. Must be a trick of the light.",
    "Search me, boss. Keep looking.",
    "There's magic buildin' up. It's 'im!",
    "Is that what that is? Urgh, nasty stuff.",
    "Search me, boss. Keep looking.",
    "But that's what 'Is 'Ighness was messin' with!",
    "Those can't be new; they look familiar.",
    "Search me, boss. Keep looking.",
    "That ain't right! Those are 'is footprints!"
  ],
  "Player": [
    "What do you mean?",
    "Sure, I'll take a look now.",
    "Will do!",
    "Sorry, I don't have time for that.",
    "I don't know.",
    "So what's wrong?",
    "There seems to be strange energy filling the air here. How peculiar.",
    "I wonder what it means?",
    "You mean...",
    "This looks like a chunk of green crystal. What could it mean?",
    "I wonder what it means?",
    "You mean...",
    "From this angle the throne seems to be shimmering like it is bathed in magical energies.",
    "I wonder what it means?",
    "You mean...",
    "How strange; there seems to be Underworld goo leaking out of the floor here.",
    "I wonder what it means?",
    "You mean...",
    "Oh no! These footprints indicate that someone has been here recently!",
    "I wonder what it means?",
    "You mean...",
    "What is going on?",
    "So what do we do?",
    "Of what?",
    "I know them. They were abducting people. I thought they were all trapped?",
    "What allies do we have?",
    "Can you tell me about the generic afterlife?",
    "Where do followers of Saradomin go?",
    "Where do the followers of Zamorak go?",
    "Where do the followers of Armadyl go?",
    "Where do the followers of Bandos go?",
    "Where do the followers of Zaros go?",
    "Where do the followers of Brassica Prime go?",
    "I was expecting something a bit more profound.",
    "Point taken.",
    "Where do the followers of Seren go?",
    "That's a depressing outlook.",
    "Astrid? But you're dead...which is a redundant statement given we're in the afterlife.",
    "Brand! But you're...I was going to say you're dead, but that's redundant in the afterlife.",
    "Yes, I'd love to.",
    "Lovely poem Brand, really lovely.",
    "That didn't even rhyme...and what rhythm was that meant to be?",
    "Erm, no thanks... we have more pre...",
    "Not yet.",
    "[Jessika/Korasi]! You're alive!",
    "Sorry?",
    "Ok. So you've just given up?",
    "Hrmm, so what you need is a reason to fight. I'll look around.",
    "Hrmm, so what you need is a reason to fight. I'll look around.",
    "I'm not [Jessika/Korasi].",
    "I remember her name. Her name is Jessika, I fought with her against the pest queen.",
    "I remember her name. Her name is Captain Korasi, of the Void Knights.",
    "My name is Player. I am the World Guardian.",
    "I am...",
    "Wizard Grayzag? But you're dead...and probably dismembered. Tortured at the very least.",
    "Wizard Grayzag? But you're...well...I assume dead. The temple knights were rather vague.",
    "Wizard Grayzag? But you're dead, the Void Knights executed you.",
    "Wizard Grayzag? But you're locked away. You're not dead.",
    "You got what you deserved.",
    "I'm not afraid of you!",
    "[Korasi/Jessika]?",
    "Why?",
    "I'll do what I can for her.",
    "Sounds good to me. I need your help, can you meet me at the bridge over the river Noumenon?",
    "Xenia, I am so happy to see you.",
    "Xenia. I had hoped never to have to see you again.",
    "Ow? That's it, ow? No fighting back, no retort? Come on Xenia, you've had this coming.",
    "Yes, you're Xenia. Do you know who you are?",
    "Hrmm. Did you hide your memories Xenia?",
    "Well that's a start I suppose.",
    "Hazelmere! It's good to see you again.",
    "Huh?",
    "I'll see if I can find pieces of you shall I?",
    "Er...that certainly does sound unpleasant?",
    "Well Guthix did make me the World Guardian.",
    "This is really weird.",
    "Ok, I'm on it.",
    "I...",
    "I...",
    "Bluster bubble...",
    "...evil scheme. You're right.",
    "I think that's everyone. I should go and check on [Princess Astrid/Prince Brand].",
    "Nomad?",
    "Where am I? This looks like Yu'biusk, but it feels different.",
    "Zanik?",
    "Zanik, are you all right? I thought they killed you!",
    "Yes, it's me. Where are we? I was in the underworld, and now I'm on Yu'biusk.",
    "What?",
    "But why are you here? You led the goblins into Yu'biusk as the new leader of the Bandosians.",
    "But what is all this?",
    "Zanik, I'm so sorry to hear that... I'm not going to let this happen any more, Zanik. I will help save you and your friends!",
    "You know I had to do that. If you had lived the Bandosians would have continued attacking your people and wiped them out.",
    "But what is all this?",
    "I'm so sorry, Zanik. If I hadn't done that the Bandosians would have murdered your people. It was a terrible choice but one I had to make.",
    "You were dying. I know this is horrible to say, but I chose to lose one life over hundreds.",
    "Zanik, you know that I had to do that to uphold the ideals of Bandos.",
    "You know what, Zanik, I am sick of people telling me I am insane to follow Bandos. Bandos represented strength. The strength I gained following his ideal helped me save your people. The strength I gained from following him helped me save the world more than once. Yes, he is dead, but his message remains. It echoed loud and clear when Armadyl took up his mace; the strong rule and the weak fall. If I am insane it is because, rather than use my strengths for myself all the time, I use it to shield the weak. Maybe in doing so I am trying to justify the mountain of bodies I have climbed to get this strong. Maybe I do it because it pits me against stronger foes. Who knows? All I know is that I am sick to my back teeth of hearing that being Bandosian is terrible from someone whose entire race would be rotting in their graves if I hadn't chosen to use my strength to protect them.",
    "I know. And maybe one day I will truly be a monster. But that day is not today.",
    "Zanik, snap out of it, this isn't real!",
    "This is the afterlife. You are NOT a Bandosian! You don't belong here, it must be some sort of illusionary punishment the other Bandosians created.",
    "I thought about what you said and you need to listen to me, Zanik. This may be real, but you know what else is real? The fact that Bandos is dead. He can't keep you here! You just need to be strong and reject this to escape with me.",
    "Remember what I said, Zanik? Bandos is dead. All that is left are his followers and you've driven them off. By resisting you've grown stronger, can't you feel it? You've broken free.",
    "You took this burden on yourself, Zanik. You can put it down now.",
    "Of course, Zanik. Let's go.",
    "Yes?",
    "I will.",
    "What?",
    "Nothing. Uh, sure. I will.",
    "Poor [Astrid/Brand]...",
    "Did you not want to go to the afterlife? Isn't it supposed to be restful and pleasant?",
    "I mean...well you are still dead. You're not alive again or anything.",
    "Nope, never died.",
    "Well it's not proper death, I never go to the Underworld...well, until now.",
    "I meant the passing on to the afterlife thing.",
    "Warmongering psychopath, I agree.",
    "It won't be for long. Nomad has a device there which is stealing all the souls of the Underworld. We're not sure what he's doing with it, but whatever it is it can not be good.",
    "Glad to hear it.",
    "Well Xenia was threatening to remove all the magic from the world and thus stop the elder gods waking up.",
    "She was trying to remove the anima mundi from the world. Thusly destroying all magic and who knows what other side effects.",
    "She's learned about the elder gods and wanted to keep them asleep.",
    "Oh, you know, massive super powerful entities that are sleeping at the heart of Gielinor ready to erupt forth and destroy everything in the process.",
    "Ok when I put it that way I can kinda understand why Xenia might have done anything to stop them...",
    "You won't. I promise.",
    "I will rip those crystals out of your flesh one by one until you scream the answers to me.",
    "With all those big crystals magically empowering you, I wonder how much blood you really need. Shall we find out?",
    "Come to think of it, you don't need all of your fingers. I could just snap one or two, see how you look.",
    "Do crystals melt or burn? I can start a fire and find out. Do you want to find out, or do you want to answer my questions?",
    "You're obsessed with divinity. I'm going to make you pray for mercy and let's see if you answer.",
    "Tell you what. I'm tired of being the nice guy here. You won't talk? Let's give you a reason not to talk. Let's see how well you keep silent once I start plucking those teeth from your mouth, one by one. Talk! TALK! I've got all day and I'm pretty sure I can keep you alive that long, though I'll make you wish I didn't.",
    "No, I'm going to make him talk, he's going to scream every little secret to me. EVERYTHING!",
    "Relax, it's ok, you're not around the order any more. You can tell us what you really think, we won't tell anyone.",
    "Look, we can get this over with quickly. You'll be free to go and get back to your life. Just answer a few simple questions.",
    "We're all adults here. Let's just calm down, take a deep breath and let's talk about this like rational human beings.",
    "Are you comfortable enough there? Anything we can do to make you feel more at ease? This doesn't have to be unpleasant.",
    "Look, we don't have to be enemies. We want the same thing. A same[sic] and prosperous Gielinor.",
    "Here, let's take a moment to relax and recover a bit. There's no need for this to be entirely unpleasant.",
    "Ok Septimus, you'll talk, or we'll make you talk!",
    "Wh...wh...what happened to good cop Zanik?",
    "You know...I'll be nice, you'll be nasty.",
    "...",
    "You know, be nice to them, whilst I'm nasty.",
    "Now then Septimus, we have much to discuss...",
    "Oh Guthix...I'm the bad guy? I'm such a terrible person. *Incomprehensible blubbering*",
    "What?",
    "I think that's all the information we need. Now... what to do with you...",
    "Ok Septimus, you're free to go. Take this chance to make better choices.",
    "End of the line Septimus, end of the line.",
    "That's enough materials. I should return to the HQ to build the battering ram.",
    "Nomad has taken a lot from us. Our homes, our friends and he even threatens our immortal souls. He wants to leave us broken and defeated. He wants us to be afraid. But we are NOT afraid! He expected us to stand alone. Instead we stand united! Heroes from some of the greatest stories. Legends who have slain monsters from our deepest nightmares. And brave adventurers that have beaten back the gods themselves. Even Death himself fights by our side! None of us fight alone. We fight together and against such a force Nomad doesn't stand a chance. Now, we bring the fight to him. Now we see how much pain HE can take!",
    "Ok, what now?",
    "Yeah...they...er...kinda made one.",
    "I cannot let you do this Nomad. It's too much.",
    "And Nomad. I'll take him, can you guys handle that thing?",
    "You too. All of you.",
    "Yeah you've said all that before and it seemed to turn out alright.",
    "There's been enough death today. Nomad, I'm giving you a reprieve. But it's only a temporary one.",
    "Nomad, your crimes are too great. You cannot be allowed to live.",
    "Come on. We didn't do this alone. We should go and speak to the others before we go.",
    "What now?",
    "What will you do now?",
    "Good luck, goodbye Korasi.",
    "Goodbye Hazelmere.",
    "So am I still a monster?",
    "Goodbye Zanik.",
    "Wasn't that destroyed in the explosion?",
    "I probably don't want to plan a siege against the Underworld now that Nomad has been defeated.",
    "What about evil people? Do they go somewhere...different?",
    "Like Zanik?",
    "Is any of that left?",
    "But what about the human followers?",
    "Goodbye."
  ],
  "Icthlarin": [
    "Where did they even come from? It's madness, why would he do such a thing?",
    "But to come here and...",
    "A pity that these are not better circumstances for us to meet again my friend.",
    "Worse. He has brought the soul obelisk with him. He is absorbing all of the souls that come to the Underworld. Every guard slain, every imp slaughtered, every innocent life lost. All absorbed by the obelisk.",
    "But still far too many get through. We need to stop this. I feel them. Each soul consumed by the obelisk. Shredded and reformed for some terrible purpose that I cannot see. It cannot be allowed to stand.",
    "We'll need allies. He has an entire army.",
    "We have set up a headquarters at the bridge over the river Noumenon. Head through the doors and we'll begin preparations.",
    "I'm sorry about Zimberfizz, but we can save others if we defeat Nomad.",
    "Death is the one with the strategic plan. Speak to him.",
    "He wasn't always...this. He was born with a powerful soul. It shone so bright that even in life I felt it. But then, like all bright things, it became tarnished and clouded. I took his parents to their afterlife, filled with grief that they had orphaned their only child. Had circumstances been in his favour he could have become a great hero for this world. But grief and loss corrupted him and he turned against everything. His soul has gone dark then, beyond my perception. I am ashamed to say that I simply forgot about him. But whatever choices he made in that time, they turned him into the monster he is now. Make no mistake. He chose this path. He has had decades to change his fate, but he has always returned to this. Now he torments and destroys countless souls to feed his own ambition. It is terrible to see potential wasted, but far worse to see it perverted into true evil.",
    "There are too many to count and even I haven't glimpsed them all, but I know of some. Of which would you like to know?",
    "Each person has their own beliefs of where they should end up and that is where they go. But for some, they cling to their lives so hard that they are unable to find their peace. For these there is a place where worldly attachments slowly drift away and they forget why they hold on so dearly. When they are ready, when they are no longer tethered to the world, they can move on. It may seem an unpleasant place, but in truth it is a kindness to them. When our time comes, we should embrace what lies beyond.",
    "Though he is sometimes more governed by ego than reason, the followers of Saradomin generally try to be good to one another. The result is a world of quiet contemplation and perpetual bliss. A place of light and music. There is no conflict here. No disagreements or discrimination. Only endless bliss.",
    "To some, yes. But some people, perhaps including yourself, thrive on conflict.",
    "There are many who would disagree. Some would happily close their eyes and never have to care again.",
    "Our afterlives are shaped by the souls of those who travel them. The followers of Zamorak are creatures of chaos and conflict. Theirs is a world filled with constant power plays and courtly intrigue. A great throne room with an empty throne. But those who claim the throne soon learn there is another throne above them, and another above that. An eternal struggle for power amongst those who are no longer subject to death. I hear that they rather enjoy themselves.",
    "For those who follow Armadyl, community and justice are the most important things in their lives. Their afterlife is a great sphere with a diamond star at the centre. Their world is on the inside of this sphere. Each person there lives the life of each other person. Passing on mantle of self from one to the next. It is a world where everyone walks in the shoes of everyone else and so there is a profound sense of togetherness. Albeit perhaps at the loss of one's self.",
    "It will surprise you little that even in death the Bandosian warriors march to war. Immortal soldiers slay one another, only to be reborn again ready to try once more for glory. They battle over the ruins of worlds long since burned to ash and they fight simply because they can.",
    "Of that I do not know. I have yet to take one to the Underworld. It is something that vexes me greatly.",
    "They're vegetables...they go back to the earth, or are digested.",
    "Why? I mean...he's a magic cabbage...",
    "Theirs is a world of harmonious song, where each soul is a symphony amongst a choir. Truly beautiful, but as enigmatic as the elves themselves. There is a power to that song that eludes me.",
    "I am sorry for your loss Player. But I swear, we will have vengeance.",
    "Look at it, my fortress defiled by that madman.",
    "Wait, what? No there isn't. It's my fortress, I would know.",
    "How dare they! The insolence! The outrage! I will...",
    "We know from the bridge that Nomad isn't just going to let us past, so we're going to need to keep the ram from being destroyed. World guardian, you know our strengths and weaknesses by now. Just tell us where you need us and we will follow.",
    "That's it, we're in. Time to take Nomad down!",
    "My fortress...once a place to welcome souls and help them pass on to somewhere better. Now befouled by Nomad. And he is using it to build that...thing. That mockery of divinity. An insult named Gielinor.",
    "But that's insane, you cannot seriously believe this abomination is a good thing? That's madness!",
    "Very well, I'll tackle the head of the beast. Though it may look like my old friend...",
    "...I will relish its destruction.",
    "No. All these souls endangered by this creature. I need to prevent that thing from absorbing them. Perhaps I can use its own power against it. I may need to fight it at its own game.",
    "By which you mean you.",
    "Countless souls, shredded into pieces and stitched together into that...that...thing. How dare you try and claim, even for a moment, that this scheme is anything other than unutterably evil.",
    "Reveal yourself Sliske. We all know it's you.",
    "What are you doing here Sliske?",
    "No one should have the power of that stone Sliske, you know that.",
    "Sliske...one day I will have the delight of smashing his bones to pieces and scattering them to the winds.",
    "It's over my friend, there are no more battles to plan this day.",
    "Once more you continue to impress me Player. Facing gods, dragonkin and now storming the Underworld itself. To many you are a walking legend, a storm that will change the face of the world. It is my great honour that I can think of you as a friend. But this is not goodbye Player. We will meet again, I am certain of this.",
    "Wait. Before you go there is one thing that we should resolve.",
    "Whilst Nomad may be defeated, the obelisk at Soul Wars still remains a very real danger.",
    "As long as the obelisk remains, there is a danger that someone might learn how to harness it again.",
    "The obelisk is too dangerous to leave unguarded. We will need to appoint a caretaker. It is within my power to grant one soul here a reprieve, albeit a temporary one. A few years, that's all. Still, a few moments can be an eternity if used correctly. So a few years does not seem unreasonable. Sadly I can grant such a boon only to one of you. I'd like to offer it to you Zanik.",
    "Your life was never yours to live. The machinations of Bandos took your destiny from you and warped it for his own ends.",
    "After all the souls I could not save here, I would like to redress at least one of fate's cruelties.",
    "Then it is settled. Zanik, you will come back with us to Soul Wars. You will have only a few years, use them well.",
    "If that is what you wish, I will abide my[sic] it.",
    "Very well then, we are done here. It is time to return to the world of the living.",
    "It's over my friend, there are no more battles to plan this day."
  ],
  "Death": [
    "Does he really need a motive? He's a madman who feeds on the souls of others.",
    "Wait. We have a guest. I wondered how long it would be until you showed up Player.",
    "Nomad. He has brought an army to the Underworld and has seized Icthlarin's fortress.",
    "Icthlarin is using considerable power to try and shield as many souls as possible.",
    "We fight. I am tired of waiting for Nomad to slip up so he can meet the fate he has long deserved. We take the fight to him. We take back Icthlarin's fortress and we kill Nomad once and for all.",
    "Religious fanatics. Members of something they call the True Order of Ascension.",
    "Evidently not all of them.",
    "None, yet, but I believe you'll be able to find some through here...",
    "Head through the door to the Underworld, we can discuss more there.",
    "Behold, the river Noumenon. Here is where souls would normally be guided over to Icthlarin's fortress to move on to their afterlife. Unfortunately Nomad has taken control of this fortress and is absorbing all the souls into his obelisk. This cannot be allowed to stand. We need to gather allies from their afterlives. The boats to our north will bring you to the people you need. These souls are lost, trapped in their afterlives. They will need you to free them from their plight. Each of them is known to you, but now is the time to set aside old rivalries. Once we have our allies, we can prepare to attack the fortress itself.",
    "He is a walking wound on the world. A nightmare that should not be. He may think himself noble, perhaps even heroic, but he is evil in the truest sense of the word. The souls he steals now are warped, twisted and ultimately consumed. They get no afterlife, no rest. He has eluded me for too long. His crimes have grown unforgiveable.[sic] I will revel as I finally reap his soul.",
    "I know very little about what lies beyond those gates. Icthlarin knows more.",
    "Lonely. But rewarding. Few can say their work has as much meaning as I, but no one ever wants to see Death.",
    "Thank you. That is kind of you. But you are a unique case I fear. The thought is eternally appreciated though.",
    "It is always difficult facing one's mortality and I am the embodiment of that. A reminder that everything must come to an end eventually.",
    "For some time I would agree. I was never a gregarious person, I liked my solitude. But eternity is such a very long time and time changes all things. Mountains are worn down to pebbles, oceans run dry and stars go dark eventually. Everything changes.",
    "I am Death, depressing is somewhat my forte.",
    "I have had friends of course. Even lovers, don't ask, but in the end I have been forced to reap their souls. You cannot know the pain of seeing someone you love pass on to a place you will never know. But then again, I prevent them from being trapped on this world. Change can be terrifying and unbearable, but it can also be wonderful and uplifting. I facilitate the ultimate change to everyone on this world. The transition from one world to the next. Few can say their life has such absolute purpose.",
    "You have allies, good, we can begin. Come speak to me and we'll move to the next phase of the plan.",
    "Now that we have our army.[sic] We can move on to the next phase. Whilst you were away we had a bit of a breakthrough. We've captured Legio Septimus, the head of the True Order of Ascension. Now we need to find out what they know. Xenia and Zanik have already agreed to assist you with the interrogation. Do not let them rattle you Player. Torture is never the right way to gather information. Use the war table to begin the interrogation.",
    "We have learned as much as we are going to learn from Legio Septimus. We should move on to the next phase.",
    "We have learned as much as we are going to learn from Legio Septimus. We should move on to the next phase.",
    "Now that we have our intel, we will need to construct a battering ram. When you're ready, use the table to determine which allies will help you gather the materials.",
    "A true one, perhaps not, certainly I sense no great intellect there. But power...there is definitely power there. Terrible and unfathomable. This abomination cannot be a force for good, Player, if it needs so many to suffer.",
    "You should build the battering ram first. There's a good construction spot just by the bridge down there.",
    "Now that you have the materials, yhou should construct the battering ram. There's a good spot by the bridge to build it.",
    "That's it, we can now break through Nomad's defences.",
    "We are about to lead the fight to Nomad himself. I am told now is the time for speeches. I am not a man of many words, so Player, will you do the honour?",
    "Or you can storm the front gates if you want Nomad to befoul his britches in terror.",
    "Do you feel that Icthlarin? I sense the power of Nomad's creation. Nomad...what have you done?",
    "Agreed, but all the more dangerous for it. Player we must destroy this...construct.",
    "Good plan. I will try to cut away the souls that empower it.",
    "Then we are ready. Player, good luck.",
    "If I'm going to cut any souls loose from that thing, I am going to need to bring it closer to me. If I can enrage it sufficiently, I might be able to bring a hand within range of my scythe. Then I can release some souls from it, weakening it significantly.",
    "The gods may represent a threat, but your plan created a very real, unavoidable disaster.",
    "I will attend, if only to take it from you.",
    "I won't need much time to change that opinion, I assure you.",
    "Perhaps Player is showing you mercy, but you have lived long enough. I will have your soul.",
    "He has taken my quarry from me again. Nomad's soul will be mine. Soon.",
    "You're right of course.",
    "Say your goodbyes Player and come speak to me again. I'll take you home then.",
    "Have you said your goodbyes Player? It is likely you will never see these people again. It is rare that we get to say such goodbyes, fate has given you an opportunity you should not squander.",
    "Very well...",
    "It was, and yet it has returned. It seems there is something more to that device than first we thought.",
    "Then his death became yours. You weren't even allowed to die according to your own path. You died ultimately because he failed.",
    "What would you like to know?",
    "That is a difficult and long question. He was just a man. One who fell on hard times during his youth and yet he fought to overcome them. Not surprisingly he was the epitome of the Zamorakian philosophy, strength from personal strife. At some point he encountered a powerful sorceror who taught him the secrets of soul sorcery. From there his life fell from my lists and he became...shrouded from me. Understand that the time of everyone's death is known to me. Just as easily as you know your name. Those deaths can change, they move around as the threads of fate are rewoven by our actions... But one day Nomad's death was just...gone. True immortality is given by destiny, or by ascension. What Nomad had achieved was impossible. Worse, as his name fell from my lists other deaths suddenly move forwards in their schedule. So many lives, so many souls, all to extend the life of one madman. From there I would expect you know as well as I. He used the Soul obelisk to empower himself and even to cheat death at your hands. Then he stormed Sliske's vault with you and other Zamorakians. Finally we faced him together in the Underworld where he created...that thing.",
    "I wouldn't know any more than you, though I would offer this thought. Perhaps he had more than one. We know someone trained him, but they clearly parted ways, perhaps long before you met him. A man like Nomad will take advantage of many situations and pretending subservience to someone would offer him many opportunities. But then this is all just conjecture, perhaps he did have one master, but who that could be I could not say.",
    "What would you like to know?",
    "There is one single Underworld for all of Gielinor. This is not to be confused with the afterlife. To my knowledge each world has its own Underworld, which is separate to the Gielinor Underworld. Here, the souls of the departed enter the Underworld and are escorted to their afterlives by Icthlarin. Whilst there is but one Underworld, there are many afterlives available. Most are based on the personal beliefs of the soul. Though some can be more...insidious and draw in souls regardless. Each is as different and wonderous as the next, but mostly people go where they expect to go.",
    "Evil is subjective and few villains think of themselves as such. Those do not end up in any place of eternal torture or similar. Still, those who believe themselves a true monster, who expect to spend their afterlife miserably...they get what they expect.",
    "Is it not? Is death not sufficient a punishment for a villain? Must their transient crime be punished eternally? Death is the great equalizer. Both king and pauper are treated equally. Same goes for villains and heroes.",
    "Each of them does well, or as well as possible considering. Korasi has taken it upon herself to guard the entrance to the Underworld, in case of any side effects to Nomad's...experiment. Hazelmere has returned to the afterlife and passed on to whatever place is his to pass on to. He is happy to have done so Player, do not mourn him a second time. Xenia has chosen to wait before passing on, helping to guide lost souls to their afterlife, whilst Icthlarin repairs the damage Nomad did.",
    "Few people ask to be brought here. Head through the portal to return.",
    "These are not really my areas of expertise I'm afraid. I would carry people to the Underworld but it was Icthlarin that took them to their afterlives. Still I suppose I can answer a few questions.",
    "Such a simple question, but with answers more complicated than any of us really know. The full workings of the Underworld and afterlives are known only perhaps to ancient Cthonic death gods. Assuming such beings even exist, I have never seen one. Heard whispers and rumours, yes, but never proof. What little I know is this; there is one Underworld per world. Gielinor's Underworld is separate from say Tarddiad or Freneskae. But whilst there is but one Underworld, there are many afterlives. Perhaps as many as there are people, or at least as many as there are beliefs. The afterlives are places of pure spirit, or will, and they are shaped by their inhabitants and their unconscious expectations. An evil man, believing himself good, might end up in a paradise whereas a good woman wracked with terrible guilt over a harmless crime... She might end up in the realm of torment that she believes she deserves, though likely not permenantly. Everyone reaches a point where they feel their penance sufficient. Ultimately, you end up where you expect to be going. With a few notable exceptions...",
    "Yes. Some people affect other lives so strongly that they snare themselves in their beliefs and destinies. Zanik was one such person. So it was the will, hatred and fervent belief of countless Bandos worshippers that snared her soul upon her demise. Not to mention the remnants of Bandos himself.",
    "Perhaps mercifully, no. Bandos is gone forever now. As a god he has no afterlife, he has simply...gone.",
    "Armadyl preached the concept of community; of everyone understanding their neighbour rather than fighting them. It is my understanding that the Armadylean afterlife reflects this concept. Icthlarin mentioned a great world spread around the outside of a vast diamond star. A plane of perpetual light and room for everyone who has ever died. Community here is built by each of them stepping into the lives of another. Living the existence of a neighbour, then their neighbours' neighbour. On and on until everyone has been everyone else. Only then, it is believed, will everyone truly understand one another. A noble ideal perhaps, but also perhaps a naive one as each of us is unique, so there can be no true understanding.",
    "I believe you are familiar with this afterlife. It's simple enough, a constant battlefield. The strong crush the weak, day after day, year after year. A never-ending bloodbath. Largely what you might expect for a religion obsessed with hitting people.",
    "I imagine that the afterlife of a Brassican follower is mostly something to do with regrowth, given most of his followers are vegetables.",
    "I genuinely have no idea. There are few who would really put the fate of their soul in such a deity.",
    "I believe you're familiar with this afterlife as well. The soul of a Guthixian is scrubbed clean and then it is moved on elsewhere. To where I could not say, but none have returned so I would presume it's a nice place to be.",
    "I imagine it will surprise you little to realise that the followers of a god of hedonism enjoy a rather...rambunctious afterlife. Excesses of all kinds are celebrated in this simian paradise. I imagine few could tell you much about it though... Mostly because they'd likely be far too intoxicated.",
    "Those who follow Saradomin believe they deserve only bliss in their eternal afterlives and such they receive. There are no disagreements, no differences of opinion, no dissent. It is a plane of pure calm rapture. In the simplest terms I can see how this would be appealing, but applied across eternity such a notion worries me.",
    "The afterlife of the elves is...unique. I couldn't begin to fully fathom it. I know it involves music of some kind and ever building towards a great harmony... But beyond that, like the elves themselves, there is only mystery.",
    "There have been no deaths of true Sliske worshippers that I am aware of. He preaches no afterlife, so perhaps they get none. But then who knows?",
    "Icthlarin mentioned a world of never-ending intrigue. A court where everyone strives for the crown. Only to learn that there is an even more desireable crown above that and then above that and so on. Power plays and schemes measured against eternity.",
    "Given that most of Zaros's remaining followers are either still alive or are denied an afterlife themselves this afterlife is unknown to me. I do vaguely remember something to do with an empire that extended even beyond death, but that memory is faded and fleeting.",
    "Honestly? I do not know. Certainly it seems possible to cross from one afterlife to another. But beyond that, I could not say.",
    "Farewell my friend."
  ],
  "[Astrid/Brand]": [
    "Darling! Darling! Hello!",
    "Have you found any of the allies here?",
    "Well I think you should get to that. We can catch up later, when we're out of this place.",
    "I'm good darling, all the better for seeing you again.",
    "Hrmm. I've seen that poor guy. He keeps appearing all over the place spouting nonsense. I wonder if he can point out where he'll appear next.",
    "Oh her? She seems to be filled with doubt, seems like you might have to fight her battles for her my darling.",
    "Some people can never let go of their regrets, perhaps you can help her do that? I bet she has them just locked away around here somewhere. Look for things like chests or locked rooms or something.",
    "Goodbye, my beloved.",
    "You did it, you found them all. Come on, we should head back to the headquarters at the river.",
    "Darling? Who are you talking to?",
    "Goodbye...my lo..."
  ],
  "WARNING": [
    "Items dropped here will be spirited away by lost souls if you leave or die. Certain situations may force you to leave."
  ],
  "Astrid": [
    "Hello my beloved. It is so good to see you again.",
    "I know dear. I died a warrior, so I died a good death. I hope you didn't mourn me for too long. I want you to have lived a full and happy life without me. But enough of that. I have crossed afterlives to find you here. I want to help. I learned about Nomad's attack and I knew you'd be here to stop him. So I scouted this afterlife for you. This place is only part of an afterlife. It's a place people go when they're not quite ready to pass on yet. But you forget yourself here. Your memories just sort of slip away from you. It's tragic. There are three souls here that I think would be invaluable in your fight against Nomad. I think you probably know them already. If you can help them remember who they are, then I'm sure they'll help. I'll wait here in case you need any help or advice, but this is something I think you need to do alone."
  ],
  "Brand": [
    "Hello my beloved. It is so good to see you again.",
    "Yes. I have waited for so long to see you that I composed a poem, do you want to hear it?",
    "In the underworld, illuminated by ghost light. Breathless memories dance betwixt Death's heartless embrace. In restless tomorrow I find endless longing. For delicious cake.",
    "Yes I know, I impress even myself. Being dead has left me focus far more on my creative talents.",
    "Yes I know, I impress even myself. Being dead has left me focus far more on my creative talents.",
    "In the underworld, illuminated by ghost light. Breathless memories dance betwixt Death's heartless embrace. In restless tomorrow I find endless longing. For delicious cake.",
    "But enough of that. I have crossed afterlives to find you here. I want to help. I learned about Nomad's attack and I knew you'd be here to stop him. So I scouted this afterlife for you. This place is only part of an afterlife. It's a place people go when they're not quite ready to pass on yet. But you forget yourself here. Your memories just sort of slip away from you. It's tragic. There are three souls here that I think would be invaluable in your fight against Nomad. I think you probably know them already. If you can help them remember who they are, then I'm sure they'll help. I'll wait here in case you need any help or advice, but this is something I think you need to do alone."
  ],
  "[Jessika/Korasi]": [
    "For what good it's worth.",
    "What's the point? I have no reason to do anything. I may as well just stand here and fade away.",
    "Why not? There's no reason to fight for who I am is there.",
    "[Jessika/Korasi].",
    "Then I won't fail!",
    "I'll deal with you then, not now.",
    "I cannot protect everyone, but I can fight to protect those I can. But I won't hide in fear because there might be consequences.",
    "Oh...I remember...I remember everything. By Guthix I was a bit pathetic wasn't I? The afterlife does strange things to you Player, let's...er...let's keep all this between us, ok?",
    "Yes, I can do that. I'll see you there.",
    "Honestly, I worry about the grand scheme of things. There's a balance to life and death, this could damage that."
  ],
  "Jessika/Korasi": [
    "I have no reason to fight to remember myself, so why bother?"
  ],
  "Wizard Grayzag": [
    "I shall have revenge! I shall have all the power!",
    "None shall stand against me!",
    "I will crush them all beneath my boot!",
    "Ahahahahaaaa, I will destroy them all!",
    "Ahahahaa! [Jessika/Korasi], we meet again!",
    "Of course not. You're a nobody, worthless. Why remember your name? No one else will!",
    "Yet you still cannot admit that name for yourself. Pathetic.",
    "Oh you can hide behind whatever mask you want [Jessika/Korasi], but you are hiding.",
    "Oh...I see...so you are.",
    "Ok [Jessika/Korasi]. You are so blind, you don't see me for what I am.",
    "Oh [Jessika/Korasi]. You still don't acknowledge me for who I really am. Perhaps I should take on a new face.",
    "Do you know me for what I am now?",
    "You are still limited in your imagination. No wonder why I will always win.",
    "Yes, now you see.",
    "You are still limited in your imagination. No wonder why I will always win.",
    "As do we all, in the end.",
    "Of course you are. You won't even take off your mask [Jessika/Korasi].",
    "Of course you are, you don't even know what I am."
  ],
  "Pest Queen": [
    "BWAHAHAHAHAHAHAHAHAAA!"
  ],
  "Wizard Grayzag transforms into a Jessika-like figure": [
    "Innocent's Suffering"
  ],
  "Innocent's Suffering": [
    "Aren't you? You should be. I am what happens when you fail.",
    "But you will. One day. It is inevitable. Just one mistake, once, is all it takes.",
    "But I'll be there, people will suffer."
  ],
  "Acceptance": [
    "Good.",
    "I would give you a piece of [Jessika/Korasi]'s memory, but you have no space to take it. I will hold on to it until you have some space free.",
    "Take this and find the other half. It is with someone who will always watch over her.",
    "Go, make her whole again."
  ],
  "[Korasi/Jessika]": [
    "Yes and no. I am a memory of [Korasi/Jessika], the [Korasi/Jessika] that [Jessika/Korasi] remembers. She makes me haunt her here, so I can watch her from this tower. Always just a little out of reach.",
    "So she can pretend to forget me. But she will never really let me go. So she puts me here, just out of reach. But she leaves me with a piece of herself so we are never really apart.",
    "I would give you a piece of her memory, but you hav eno space to take it. I will hold on to it until you have some space free."
  ],
  "Korasi/Jessika": [
    "I know. Please, make her whole again. Tell her...tell her I'm ok."
  ],
  "Xenia": [
    "Ow.",
    "Xenia? Is...is that my name?",
    "No. Don't make me remember. I did terrible things, I should be forgotten.",
    "I couldn't bear to see the terrible things I did. I locked those horrible stories away.",
    "I hid my guilt and shameful memories. Locked them away where no one can find them.",
    "Ah, me again. Forgive me Player, I know now that I was wrong with my plans to stop the elder gods. I was so sure that it had to be done and so resolute that no one should have to suffer the blame but me. I have relied on myself for so long, I have forgotten how to take the counsel of others. But we can talk about this later. I know why you're here and I know I can help. I will meet you at the bridge, we can talk further then.",
    "Thank you for getting me out of there, it was not the most pleasant of experiences.",
    "But of course. I am happy to help. Death and Icthlarin have filled me in on the situation. It sounds dire indeed.",
    "It is good to see you again. I wish we could have parted on better circumstances before. For what it's worth I am sorry for not being more trusting before. I am not, at heart, a trusting person and it's difficult for me to be open.",
    "It pains me that you feel that way. I realise that our last meeting was not my finest moment. In hindsight I see how I was misled and that I should have trusted in my friends more. It's difficult, I'm not a trusting person. I hope that you feel that I got sufficient punishment for my betrayal. Though death appears to lack that poetic finality that justice requires. Still, I hope that my aid here will offer some slight penance for my actions.",
    "This Nomad's actions are terrible indeed and I confess the crime mirrors my own, albeit far more extreme. He must be stopped, just as I understand now that I had to be stopped in my actions. I will do what I can to help you with this Player.",
    "Meddling got me in trouble before, as you remember, I will leave the tactical planning to Harold...sorry, Death.",
    "I know a little of Nomad, he's cropped up on my information network a few times. A strange man. His family died when he was young and he appears to have spent the early parts of his life fighting for survival. A life like that can twist a person, make them hate the world, even subconsciously. The man we have now is a monster that thinks himself a hero. I believe he genuinely thinks that he is somehow the hero of this scene. I can relate to that delusion. To that idea that you alone can save the world by doing something that no one else is willing to do. And just as my solution was the wrong one, Nomad's current plan is even worse. You cannot, must not, show mercy. You cannot reason with this. You have no choice but to terminate with absolute prejudice. Be certain that he will be thinking the same.",
    "What is the point of looking back on that. It was a time of great pain for me. Shame, guilt and regret. No, we are much better off focusing on the course ahead. We should[sic] be looking back on where we have been.",
    "To what end?",
    "Ah, yes, so you feel that I deserve further chastisement. That death and my suffering in the afterlife are insufficient? How would you like me to atone? Shall I cast myself into the river? Or perhaps allow Nomad to consume my soul? Would these acts be enough? I have paid my dues for my mistakes. I know now they were misguided and I know that I should have come to my friends for help. But it is done. I am here now to try and make amends for what I have done and I risk my immortal soul to do so. I hope that is enough. If not then once this is done, you need never see me again. I will understand.",
    "Ha haha he ha ha. I'm sorry, that question rather threw me off guard. Am I happy to have died? No, there's always more I could have done. But am I ok? No and yes. My death was a culmination of mistakes that I will have to bear for eternity, but I can at least start to rest. Knowing that the afterlife is real, it means I now know that I have a chance to see loved ones again. When you are as old as I am and live the life I lived, you lose a lot of people you care about along the way. I rather look forward to a reunion. A chance to apologise to some and to simply hold some others. So in that regard, yes Player, I'm ok. Thank you for asking.",
    "Bad cop?",
    "Seems like a bit of a waste of time to me, but fine. Now then, let's have a pleasant little chat about fingers...",
    "And then finally a dash of salt to really finish it all off.",
    "Good cop?",
    "I can do that I suppose.",
    "You can tell, because of the mud on the feet.",
    "I might be a bit good at being the good cop, sorry.",
    "He has many secrets. We need to break his spirit just enough to learn them.",
    "We need to get the ram to the fortresse entrance and let it get to work.",
    "Well, thanks to our friend Septimus we know there's a shortcut into the fortress.",
    "Yes yes; divine retribution, souls cast into the eternal nightmare, etcetera etcetera. We have bigger things to deal with now. As I was saying; there is a shortcut into the castle. Some of us can sneak in and take on Nomad whilst the others distract him at the gate.",
    "Quite. It's up to you Player, the secret passage is off to the east if you want to use that. Otherwise we just lead the ram to the entrance and let it get to work.",
    "Well that's settled then. He's insane.",
    "Together, yes. I can't fight a god, but I can handle Nomad's army quite nicely. I'll deal with the zealots on the ground floor; draw their attention away from the rest of you.",
    "A room full of ascension soldiers and only little old me to fight them. I should probably break my arm or something, make it a fair fight. I need to keep their attention focused on me, so that they don't discover the others.",
    "Oh stop it. I've been in your shoes, but even I wasn't as deluded as you are now.",
    "Everyone, stop. Let it sink in. We've won. Nomad is defeated. His grip on the souls removed. We have prevented the rise of a new, terrifying, deity. Sliske thrives on chaos, he wants us to feel this is a defeat, but it is far from it.",
    "You did good there Player, I'm proud of you.",
    "It is kind of you to say so Player and it means a lot to me.",
    "You're welcome, but it is a simple recognition of your skill and success.",
    "No. I imagine not.",
    "I still have much to atone for and so I shall stay behind, here, in the Underworld. I will help remove any remaining members of the order and any lingering after effects of Nomad's scheme. And then, perhaps, when I have done enough, I will move on to a new adventure. Goodbye Player, I am only sorry I will not see more of your legend unfold.",
    "There are forces out there, ancient and dangerous, that have yet to reveal themselves. Not discounting the dangers that we already know of. Imagine what Sliske, Zamorak or Zemouregal could do with such power. Then there are the people who would use it to 'do good'. Imagine such a device in the hands of...say...Ariane. Or even myself. The danger is undeniable.",
    "I for one think it's a great idea. No offence to everyone else, but Zanik would have been my choice.",
    "Burning one's bridges is the fastest way to damn oneself, remember that.",
    "Hello again my friend, it's good to see you.",
    "So what brings you to the Underworld?",
    "After everything? You still feel that way?",
    "Very well, I will not bother you further.",
    "There have been a few after effects of Nomad's scheme.",
    "Some of the order still remain. I've dealt with those that have come out of hiding, but I'm sure there are more.",
    "Let's not. My death and what led up to it were not my proudest moments.",
    "I had many more years alive than dead and many adventures that are far more interesting.",
    "An individual can be deadlier than an army when they have the right tools...",
    "I lost a good friend that day. But he died how he lived...on fire.",
    "Before our falling out, I would play some little pranks on dear Ariane.",
    "...wandering around Lumbridge with only three palm leaves and a rubber duck to her name.",
    "She never saw that one coming. Ha hahaha ha haa!",
    "It all began with a kiss...",
    "...but by that point it was too late, they were married.",
    "You should have seen the look on the Duke's face, priceless.",
    "It was the deadliest battle I've ever fought...",
    "I barely escaped with my life. That warrior woman fought with unmatched fury.",
    "Her helm was made of such strange rusted yellow metal, like it had never seen daylight...",
    "One cannot always be the hero...",
    "The fire died down eventually. No life was lost, but the damage done would never heal.",
    "Seven wizards, twelve knights and five archers...and me with just a spoon...",
    "...you wouldn't believe that legs can bend like that...and they can't.",
    "Crunch...snap and then a most satisfying pop...",
    "So a few of us had this little bet...",
    "You wouldn't believe how difficult that was to clean off!",
    "Some secrets should be left buried...",
    "As the tomb door closed, we saw a bony claw lift from the sarcophagus and an eerie whistling noise, like lungs made of stone, filled the cavern.",
    "Needless to say we ran and collapsed the cavern entrance.",
    "There are some truly evil people out there. One man took advantage of those at their lowest...",
    "He expected death or torture, instead we showed everyone how weak he was. How feeble. How pathetic.",
    "He couldn't intimidate anyone after that, his power over people washed away...unlike the tar and feathers.",
    "I suppose you really want to know what I discovered there, rather than a description of the environment.",
    "I found an entity, ancient and knowledgeable. It knew things about worlds we have never dreamed of.",
    "How they were snuffed out, destroyed, shattered. By beings so ancient and so utterly uncaring.",
    "The Abyss was formed from those dead worlds and from pieces of creation that had been rendered apart.",
    "And then it showed me what our world would become. It knew that Gielinor was next.",
    "Seeing that... Knowing that... I had to do something.",
    "Goodbye Player."
  ],
  "Shame": [
    "You manipulated people, convinced friends and allies to do terrible things.",
    "Your mother died alone and abandoned because you were too busy to see her.",
    "Your father died slaughtered in battle.",
    "You spent your youth in wild excess and let everyone you love down.",
    "No one was sad that you died.",
    "No one mourned you.",
    "Everybody hates you and is glad you're not there any more.",
    "Xenia; the manipulative. Xenia; the betrayer.",
    "You couldn't even die a success."
  ],
  "Guilt": [
    "You betrayed your friends and murdered a man, all because of your own arrogance.",
    "You turned on your friends, because you listened to a monster you knew nothing about."
  ],
  "Hazelmere": [
    "Well of course it's unpleasant. You try having this conversation spread randomly across the moments.",
    "Though thinking about it, you probably are. Look, I'm spread out all over the place. I'll try and point out where I next am...was...urgh, will be?",
    "I have no idea what that means, but it's an impressive sounding title at least. Look I hate to ask you to go off on some laborious fetch quest, but I don't suppose you could do me a favour could you? You remember I had a gift with seeing the future? A wonderful side effect of my connection to the anima mundi?",
    "One part of me is thirty seconds into the future, another is ten seconds into the past.",
    "Ah, hello Player, you look oddly healthy for this place. Adventuring has suited you well. There's a definite power about you.",
    "Well it appears that there is a small side effect of that when one dies. It appears that I've been sort of, well, scattered around this place. It's as though I've been split apart and different parts of me have been placed in a different time to others.",
    "Please do. They could be all over the place, but find and talk to them to establish a chronological order and I will be terribly grateful.",
    "Try living it.",
    "Oh, thank the stars for that. I can finally think linearly again. I'll tell you, non-Euclidean realities are not fun, not fun at all. I swear there were strange dogs staring out at me from various angles. Most unpleasant. But that's enough of that, you saved me and I know exactly what you're going to say.",
    "...womble flip. I know, I was in the future remember.",
    "You need me to help your fight against Nomad. I will of course aid you. Anyone stealing souls trying to enter the afterlife deserves a good hard kick up the...",
    "Wonderful. I shall meet you at the bridge over the river Noumenon then.",
    "Well that was a weird situation to be in. It seems there are distinct disadvantages to seeing the future. Regardless it's nice to view time from a linear perspective again. I would have liked to come back to a more pleasant time though, this Nomad character sounds like a complete wa...",
    "Well there's no point talking about it, let's get down to business.",
    "Nomad is clearly a madman. He must be stopped. There's really no point saying any more on the subject.",
    "Well it wasn't the afterlife I was expecting. I think my meddling with the anima mundi had some side effects. I was sent to Limbo to be disconnected from my mortal anchors, as I expected, but I was instead spread out over various different times. Deeply weird, I can tell you. Hopefully now I can return properly to the Anima Mundi to be reborn. I think I'd like to be a cat for a bit, they have all the fun.",
    "Is there really any point dwelling on the matter? I died, it hurt, I didn't get better. Let's focus on what needs to be done instead shall we?",
    "Well, that was quite the adventure. Fanatical armies, powerful sorcerors and even a nightmarish god to deal with. And perhaps the best thing about it all? I hadn't seen any of that coming. It is a strange thing knowing ones[sic] future, it is nice to feel surprise again. Thank you my good friend, for letting me know what that feels like. One last time.",
    "Goodbye.",
    "I'm not sure I could live another life, better that the youngsters get a chance at life again I think.",
    "Goodbye."
  ],
  "Nomad": [
    "Oh how sickeningly sweet. Even death won't keep two young lovers apart.",
    "They care so very deeply for you. They see only the good, none of the evil. I wonder, do you feel the same? Does your heart beat in time with theirs?",
    "I see. It will break you when you have to leave them again. That prolonged, agonising goodbye as you realise you will never meet again.",
    "How cold. How cruel. Even in death they fought to be by your side and yet they are nothing to you? I thought you were meant to be the hero? But I see that their presence pains you so.",
    "Worry not my friend, I will save you that drawn out suffering...",
    "I will take your pain away.",
    "How fragile the heart is. Tell me Player will such pain destroy you or empower you? Until we meet again.",
    "I have created salvation for the people of Gielinor and given it their namesake. A bulwark against the machinations of the gods. A god, forged from the amalgamation of all the souls of Gielinor. Mindless and obedient to those who can master it. A god that desires no worship, no penance, no subjugation. A god that serves the people, not the other way around.",
    "No! Serving the gods is madness. Letting them tear Gielinor apart is madness! This is our only hope!",
    "Then do as you must Player. Let's see how much pain you can take!",
    "So Player, must I humiliate you again?",
    "Feel the power of Gielinor!",
    "You cannot win, Player. You stand above a god but you are beneath it. Gielinor, smite them!",
    "Let's up the ante shall we?",
    "Feel the power of Gielinor!",
    "Can you handle my wrath![sic]",
    "Your mercy has been your undoing. You should have thrown the spear.",
    "Stop hiding you worm.",
    "You cannot win, Player. You stand above a god but you are beneath it. Gielinor, smite them!",
    "I never was a fan of an even playing field.",
    "Feel the power of Gielinor!",
    "Can you handle my wrath![sic]",
    "I wonder if your senses can help you this time.",
    "Your mercy has been your undoing. You should have thrown the spear.",
    "Stop hiding you worm.",
    "You cannot win, Player. You stand above a god but you are beneath it. Gielinor, smite them!",
    "What! How are you more powerful?",
    "This. Ends. NOW!",
    "No! NO! Do you even know what you've done? You've doomed us all, you've doomed the world.",
    "Don't you see? We would have had a power strong enough to protect us from the gods. With a god controlled by mortals...",
    "Who else? None of you have the will to do what must be done, none of you have the...",
    "Ha! What does it matter anyway? Congratulations, you've stopped me. I applaud you, really I do. Now nothing can stop your masters from crushing this world, our people, into dust.",
    "Are you really so ignorant? So deluded into thinking yourself a hero that you can't even see the strings? This whole game, the dance of the gods, it revolves around you. You're the game piece that they all play with. Did a gathering of gods really have to wait for the arrival of one mortal to get started? There's a reason that all of these stories focus on you. Can't you see it? It's all a game to them and...",
    "Kill me, I am not afraid of death.",
    "Mercy. After everything?",
    "Nooooooooooo!",
    "Do it."
  ],
  "Zanik": [
    "No! Keep back!",
    "Please, just leave us alone!",
    "No! Stop!",
    "Player? Is it really you?",
    "This is still the underworld. This is...my punishment.",
    "When we defied Bandos his loyal dead set aside this corner of his afterlife. All this for me and my friends.",
    "It didn't last, Player. I wasn't lying when I said I felt refreshed being there. But, it didn't stay like that for long. Within days I was ailing again. I don't even remember dying. I just sort of...fell and woke up here.",
    "I could have been strong; I could have been the strongest, but I, we, chose to defy Bandos. Now his 'loyal' servants come here when they want to relax with a little entertainment. The lowliest of them come here to have a place where there is someone even they can oppress and kill. They kill me and the other cave goblins. They take our bones as trophies. The skulls of me and my people are used as currency in the battlegrounds of Bandosian 'heaven'. And then we are brought right back so they can do it all over again!",
    "And then you killed me, and I ended up here. Tormented and attacked constantly!",
    "That doesn't make it any easier. Do you know how long I have been here, Player? Forever! Time flows strangely here. Sometimes the Bandosians show me things; me meeting you, our adventures. All that hope at lo...potential that you cut down. Yes, you had your reasons, but they still hurt me, Player! I wasn't your enemy! I was never your enemy, just as I thought you were never mine!",
    "You're insane! Bandos was dead! How can you think that justifies killing me and subjecting me to this?",
    "You're a monster! Bandos represents tyranny, murder, the slaughter of innocents! I saw exactly what he stood for, not this idealized nonsense you are spouting. And! You! Killed! Me!",
    "Here they come now!",
    "No, Player, it is real. That's the point.",
    "No, Player! You don't get it. This is real, all of it. Those are the souls of real cave goblins. People I knew. I am really letting them down. They are really getting killed and maimed over and over again because of me. This. Is. Real. There are more coming. No time to talk...",
    "Player, that is a beautiful sentiment. But if I'm not here then these Bandosians will butcher the souls of my friends. Sometimes they ignore them and just take turns murdering me. And you being here will make it worse. The only time I have ever beaten them back they just sent more warriors. Here they come again. It is good to see you but...you should go.",
    "They're gone. They're really gone! I can always feel when more of them are going to arrive but now there is nothing. What is this?",
    "But I had to rely on you again. I can't escape needing your help even in death...",
    "Wait, why haven't you said any of this before? All you have told me up until now is how I have failed and disappointed you.",
    "But...",
    "I never realised...",
    "Thank you, thank you all so much... Player, thank you too. I guess it is time for one last adventure, right?",
    "Thank you for getting me out of there. It felt like I had been there so long that I forgot what not being there was like. Even here, on just a bridge, staring towards a fortress of souls currently under the control of a madman, it's peaceful.",
    "Don't worry, we'll figure it out. One more grand adventure I think.",
    "Quite the group you've gotten here. I can't begin to imagine the adventures you've been on. Even Xenia's here! Wait? Xenia died?",
    "Ariane? Seriously? She never struck me as the murdering type.",
    "The elder what now? Being dead puts you so out of the loop.",
    "Really? I mean I know she was a bit of a meddler, but she deserved to die?",
    "Wow...why?",
    "What are the elder gods?",
    "...",
    "I'm sure it must have been. Still, she's a shrewd and cunning warrior, so at least we have her here now.",
    "With all these allies I think we can now finally give that Nomad twit what for. Just let me know what missions you want me to undertake with you and I'm there.",
    "Hello Player.",
    "We need to break that Legio, get as much information from him as possible. I've been a leader before, not an inquisitor, but I'm there if you need me.",
    "My small frame gives me the edge over some of our other allies when it comes to stealth. I'm pretty good with a crossbow, if I do say so myself. I'm also not afraid of the dangers ahead, because nothing can be worse than where I've just been.",
    "Do we have to? It was horrible.",
    "Against my will my soul was tied to Bandos. When he was killed that death followed back to me. It clawed at me, the last remnants of Bandos trying to survive by killing me. But, ironically, he wasn't strong enough to survive. But the damage had been done. I was dying, I knew that when we last met. When I left for Yu'biusk for a while it seemed like I was doing better. But that, as it turned out, just wasn't the case. I'm not even sure when I died, or how, I just sort of woke up in that nightmare and couldn't get out. Until you rescued me of course.",
    "When he made me the Chosen Commander, Bandos linked our spirits together. In doing so it meant that when I died it was the belief of his followers that sealed my fate, rather than my own beliefs. The moment I entered the Underworld, I was dragged straight to that terrible place.",
    "Forever. Time doesn't work like it does on Gielinor. It was as if I had always been there and always would be. I think...I think some of me is still there, fighting that impossible endless fight. I can feel myself being pulled back to it even now. I will not go back there. I won't. Please tell me I won't.",
    "They seem to be a good bunch. The gnome's a bit stand offish, but the rest of them seem to be good guys. It's certainly nice to have Death and the god of the Underworld on my side at least.",
    "Player, no, stop! STOP!",
    "No, not like this. Not like this. You've crossed a line and I cannot let you do this. Kill him or let him go, but that's it, this is over.",
    "You want me to be the bad cop? Erm...ok. Oy...er...you... Tell us what we want to know!",
    "AND THEN I'LL WEAR IT AS A HAT!",
    "Ok I can do that.",
    "Don't worry, I'll try to keep them from hurting you too much...though they are a bit bigger than me so I'm not sure how much help I can actually be.",
    "AND THEY WON'T FIND THE BODY FOR WEEKS!",
    "Oops, sorry, I got carried away.",
    "None I'm afraid. This...interrogation business is not really my forte.",
    "You go on ahead, we'll stay back and hold them off.",
    "So that's two gods we've defeated together? That must be a record surely? It was a good adventure to be our last Player. It was good to see you again.",
    "No. Not today. Bandos is wrong and his beliefs are dangerous, but perhaps if his followers were more like you... It's not Bandos that gives you that power, or his philosophy, but you and your interpretation of it. If the Bandosians were more like you, perhaps there would be fewer monsters.",
    "Goodbye, my friend.",
    "Me? But the others deserve it so much more.",
    "But what about the rest of you? It would feel wrong to leave you here.",
    "Player, what do you think?",
    "Thank you Player. I think I will. I will guard the soul obelisk and look after Soul Wars. I shall make sure that no one can utilise that power again.",
    "I intend to. Thank you Player, you truly are a good friend.",
    "You're...you're right of course. My time is done, it's arrogant of me to want more than is my due. Thank you Icthlarin for your kind offer, but no one should defy the laws of nature as blatantly as that.",
    "It is."
  ],
  "Spirit Marauder": [
    "Begging again, traitor? Pathetic!",
    "All right you little runts. Make it easy and I'll make it quick..."
  ],
  "Cave goblin": [
    "Zanik! They are hurting us! Save us, Zanik!",
    "Zanik, it hurts!",
    "Zanik, protect us!",
    "Zanik, stop being so weak!",
    "Zanik, why are you letting them hurt us?",
    "There's no shame in that, Zanik. Player is your friend, after all.",
    "You need to let us go, Zanik. Don't you see? We were forced by the magic of this place to say those things. Did we feel them sometimes? Yes. We were being punished for what you did and that hurt us, so very badly. But without the power of this place we would not have said them. We saw you were doing your best to help us, even if it hurt you.",
    "No, Zanik. This place was made to hurt you. Bandosian belief put us here to hurt you. You have broken the spell now. In the end this punishment is for you. If you leave we'll be free. The Bandosian spirits only really came here to punish us because you were here.",
    "Player?",
    "I'm so glad you could save Zanik. She never deserved this, and I am glad you managed to get her out. Take care of her.",
    "Do you really think you can save them, Player? You can't. There is a grinding darkness against which your soul shall be lathed. And this is Xau-Tak.",
    "I said 'I'm so glad you could save Zanik. She never deserved this, and I am glad you managed to get her out. Take care of her.' Why do you look so shocked?"
  ],
  "Jessika": [
    "Phew, it's good to be out of there. I could feel myself just sort of slipping away. It wasn't pleasant.",
    "Maybe. I have no evidence to suggest that it would, or evidence to suggest otherwise for that matter. Frankly I'd rather not be dead, it seems like the better solution.",
    "I know that. I do. But at least now I can prepare myself a bit better, see if I can pass on without the disturbing drifting away part.",
    "I can say with categorical certainty that Nomad absolutely must be stopped. Whatever he's doing, it will have disastrous consequences if it's not stopped. It may already have disastrous consequences. Who knows what harm ripping countless souls out from their destined afterlife could have. Actually that's a good point, someone will need to keep an eye on this after it's all done. Hah, do you know, you might just have led me to my true calling. Ha ha ha.",
    "Haven't you died before? I thought adventurers got brought back from death somehow, but still technically died?",
    "I'm sorry to have doubted you.",
    "Death is, well it's not as traumatic as you'd expect. At least not for me. Don't get me wrong, it hurt like you wouldn't believe and I could never forgive Grayzag for what he did, but it wasn't endless torment or anything. I sort of fell over, then I got up from my body and saw Death waiting patiently for me. He cut a strange tether to my body and then he led me to the river. That was a harrowing experience. Several of us crowding together staring across a bridge filled with monsters and a god there to light our way. Icthlarin defended us from the devouring beasts and then led us through these great doors and then...well then I sort of found myself in what looked like Lumbridge. I didn't want to go through, I wanted to stay. I had so much to do. So much more to say to...well, to people I care about. So I sort of just...waited and then that place just started making me forget things and drift away. I would not recommend it.",
    "It's actually oddly disappointing seeing it for real. The idea of a life after death always felt like it should be something more imagined than clarified. Still, the scientist in me is glad to be able to categorically answer one of the most defining questions in human history. Albeit to a very small audience.",
    "I think you were there for what I would consider the defining part of my life. The whole pest problem. I still believe that the poor creatures themselves aren't evil, just controlled by a malign influence.",
    "Wow...we did it. I mean I knew we would, but still... Wow. I am glad I got to be part of this adventure.",
    "Now? I will stay here while I think and observe. There may be repercussions for Nomad's scheme and I will look for them. Research doesn't have to stop just because you're dead. But still, I doubt we'll see each other again. It has been good to see you again. Goodbye.",
    "Hello again Player, it's good to see you.",
    "The Underworld is fascinating, so much to learn about it. What it means to be dead, that kind of thing.",
    "On top of that I am keeping an eye out for any damage that Nomad's scheme may have caused.",
    "I find it unlikely to think that such catastrophic damage to sould and the Underworld wouldn't cause lasting damage.",
    "But so far it seems fairly secure...and frankly that worries me.",
    "Because life is never that simple. You can't upset the natural order without there being consequences.",
    "If they're not obvious, it means that they're subtle. Hidden. Some terrible unpleasantness worming its way through the fundament of creation.",
    "But there are consequences, make no mistake of that.",
    "What more is there to say? There's no justifications to his actions, they were about as evil as you get.",
    "To create the monster he took the immortal part of innocent people.",
    "He twisted them, tortured them and ultimately he destroyed them.",
    "Even those that made it to their afterlives would have been the barest fragment of themselves.",
    "Even the void pests weren't that monstrous.",
    "I didn't like dying. It left me with too many things unfinished.",
    "Too many questions left without answers. Too many promises left unfulfilled.",
    "Too many things that should have been said, but weren't...",
    "But then death is a new beginning as well apparently. Think about it, death is not an end.",
    "Let that settle in. Death is demonstrably not the final stage of our experiences, but that more lies beyond.",
    "It poses so many new questions. Are we bound to only one afterlife, or can we move?",
    "Can we return to life via some form of reincarnation?",
    "In many ways I feel strangely alive now that I'm dead. Odd really.",
    "Goodbye my friend."
  ],
  "Korasi": [
    "Death has filled me in on the situation. I can't believe someone would actually do that. To actually use the souls of sentient beings as some sort of power source for their own ends. It's abhorrent. But worst is that as far as I can tell, this Nomad somehow thinks they're in the right for doing that. It takes a lot of work to become that delusional.",
    "I think Nomad needs to be stopped, by any means necessary. What he's doing must be harming the fundamental structure of reality, there must be a reason that souls go to the afterlife and if he's stopping that... Well, let's face it, there's going to be consequences.",
    "I was torn apart by pest drones. Fairly unpleasant probably sums it up well.",
    "That I can respect. Death collected me after my death and took me to the bridge, where a number of others waited. There Icthlarin marched us in formation past the assorted monsters, which he held at bay. It was well organised and flawlessly executed. I can get behind someone with that sort of precision.",
    "I can't tell you much. Where I went was a place where only those not quite ready to move on get to go. I wasn't ready to be dead you understand. I had so much work to do and so many things to say to people. I just couldn't let go. So I ended up in Limbo and that place began to strip away the memories that were chaining me to my old life. Not a particularly pleasant experience I must say.",
    "I don't know. Perhaps I'll finally move on. Or perhaps I'll hang around here to help deal with the inevitable consequences of Nomad's actions.",
    "AHA! We did it. We beat Nomad and his soldiers. It's good to feel the thrill of battle again.",
    "I will do what I always did, I will protect people. There are still some Ascension nutjobs to clear up. And who knows what Nomad's scheme has done to the afterlife. They'll need me, for a while. And then, once that's all done, I can move on again. It will be good to have a rest.",
    "Goodbye my friend.",
    "Hello Player. What brings you back to this lonely bridge?",
    "Being predictable I imagine. The stoic warrior standing firm against the darkness.",
    "Sounds heroic when I say it like that, but in truth I think I'm just waiting.",
    "I may be dead, but I'm not quite ready to admit that yet. So I think I'm waiting for a reason to take that next step.",
    "For the moment I'm dealing with any left over Order of Ascension zealots.",
    "More than you'd think, but not enough to be a real threat... yet.",
    "Perhaps if they were organised, but fortunately they seem to have lost any capacity for rational thought.",
    "Possibly as a result of their abomino-deity's destruction.",
    "They're not really anything you should worry about though.",
    "They're not really anything you should worry about though."
  ],
  "Legio Septimus": [
    "Release me. You dare to lay a hand on me? On this flesh that is soon to be divine? Your imperfection offends and disgusts me and each moment you remain near me is a step further I am from perfection. Release me or kill me, but do not pollute the air with your nauseous banality any longer.",
    "We are as the ant to the dragon, you are beneath me. I will tell you nothing.",
    "The pebble cannot break the mountain, you will get nothing from me.",
    "I will tell you nothing. You believe nothing and soon you'll be nothing.",
    "I will tell you nothing. You are faithless and incapable of vision.",
    "You'll get nothing from me. You're an insect trying to understand the stars.",
    "Too many limbs; they move like scraping on the walls on the ceilings under the floors.",
    "Please...just let me rest for a moment... I'm so tired, please I can't answer anything. Just let me sleep.",
    "Kill me, please. Just kill me.",
    "*Spits* Do your worst 'World Guardian'. I'm not afraid of you. You think you're worthy of knowing the designs of the messiah? You're nothing but a bully pretending they're important. I'll give nothing to you.",
    "I can see the beginning of understanding upon your brow, but you still have your mind closed to the truth. I don't think you could comprehend the messiah's plan.",
    "It is beyond your comprehension!",
    "In the fortress, obviously. I mean you know that already, surely?",
    "It is a noble and glorious plan my friend. With the death of Guthix our world has become empty and without meaning. People go about their lives only offering lip service to the gods that care nothing for their followers. Saradomin, who demands only fealty. Zamorak, who leads us all astray. Only Guthix really cared, only Guthix understood us. Which is where Nomad came to us with his great promise of salvation. A god, a god of our own design. A god who understands all of us because they are made from all of us. The souls of Gielinor fused into our one true protector! The god who is Gielinor, who is his followers! WHO WILL STAND AGAINST THE TYRANNY OF THE OTHER GODS? WHO WILL MAKE GIELINOR WHOLE AGAIN?",
    "Please. Stop. Don't hurt me. I'll tell you...I'll tell you...just please, no more. The souls... Nomad is not destroying them, he is...giving them a purpose...the most noble of purposes. They are becoming more than mere mortal souls passing on. They are being forged into a new protector of Gielinor, a new god. This god will wipe clean the stain of corruption on the world. He will make it a haven for the faithful and cast out those warped with sin. I will be raised up in his council, whereas you will be nothing more than a stain on his boot. Oh how I will laugh at your suffering.",
    "He has no master fool. He is Nomad! He is the future!",
    "I will tell you nothing worm. That you even think you can face him is an insult.",
    "I know you yearn to tear him down, but he does not stand alone. Legions of faithful soldiers protect him. Even now they patrol his fortress, ready to cut you down like the dog you are.",
    "He is the messiah, he needs no bodyguards or guardians, but the faithful will flock to him as his shield, needed or not. The devoted faithful constantly patrol the fortress grounds, you will never get past them.",
    "I see it... I see it my friend...there...in your eyes. You see the truth, you see the beauty of Nomad's mission! Ah, I see, but you cannot betray your feelings to your allies. They would not understand, small as they are. Come closer my friend, I shall whisper a secret to you. There is a secret way inside the fortress. To the east of the entrance lies a cavern, in which a passageway lies hidden. When the patrols are distracted, find your way inside and make your way to a new beginning.",
    "You can't! He will crush you into the dust, he will scatter your soul across the cosmos. You cannot hope to win!",
    "Why would you want to destroy him? He is the god that we need, the god that will protect us. He will be Gielinor incarnate.",
    "Ah, I see it in your eyes, that light of realisation. The desire to know more about the god you know is the true future. He will be a god born from the essence, thoughts, dreams, needs, desires and flaws of all those souls that have died. A glorious gestalt of the blessed chosen ones. It will be a god that truly understands what Gielinor needs, because he will feel that need also! No longer a god that demands fealty for nothing in return, but a god that provides and loves us, because he IS us. Isn't it wonderful!",
    "I...no, I will tell you nothing.",
    "The Order itself has grown weak and foolish. They cling to the crystals in the monastery and do not think beyond such limited dreams. The True Order embraces a new doctrine. A new dogma. A path to true and absolute ascension. Nomad will show us the way!",
    "Your tiny mind cannot begin to fathom the glory of our great mission. I pity you for even trying.",
    "Nomad came to us with a new vision; of a god that would serve the people and not the other way around. He taught us of the limitless potential of the human soul and how we can use it to forge a new form of ascension. He is our messiah! He is the future of all Gielinor!",
    "You...you don't frighten me. I...I am a legio. I am beyond your pathetic mewling.",
    "You've made so many boasts but I see no sign that you will act on them. Keep your bluster, I do not fear you.",
    "Words, nothing but words. Why should I fear your mindless prattle? Show me what a monster you truly are and then tell me you're the hero here.",
    "Hmm, could it be? Could it be that you have the potential to truly see, the potential to be ascended? Perhaps, perhaps there is a chance to bring you into the fold after all.",
    "We've done this dance. I see the potential in you, but are you ready to face it?",
    "You...you do me a kindness. I wonder...is there potential in you?",
    "...",
    "Yes, the thirteenth moon stands ascendant. It is the shadow glass that starts the call.",
    "Hmm? Oh I didn't say anything.",
    "We're just tiny squares of light being born and destroyed by a thunderstorm in a metal box.",
    "This...isn't...really...happening.",
    "I'm so tired, please I can't answer anything. Just let me sleep.",
    "I die...I die and I ascend. Thank you, for this gift Player. I will see you again soon...",
    "Our time will come mortal. Our time will come.",
    "Death is not the end, it is merely an alternate route to the same destination."
  ],
  "Icthalarin": [
    "He's building an abomination. A horrible combination of the tortured souls he's absorbed. My sister at least had the good grace to devour her souls...but this...this thing. It's far worse. I can feel them. Each soul that gets fused to that monstrosity. Their terrible, unbearable agony and then the sudden silence as they are shredded apart. This is not a god. It's an affront to the natural order of creation."
  ],
  "[First ally]": [
    "We need to gather enough wood and metal to build a decent sized battering ram. That shifty looking tree over there looks like it should provide enough wood and the rocks here can be mined for metal. What do you want me to do?",
    "We have enough materials, let's head back and build the battering ram."
  ],
  "[Second ally]": [
    "What do you want me to do?"
  ],
  "Voice of Nomad": [
    "I wondered how long it would take for you to show up here, in the Underworld. Alive of course, just to be special.",
    "Don't worry, you're not going mad. I am speaking only to you, no one else can hear me.",
    "How, you ask? It's quite simple really, I am speaking to your soul.",
    "The obelisk calls to it, but you are quite safe for now. Your pet god has seen to that.",
    "But here we are again. Must we play the role of 'dastardly villain' and 'selfless hero' once more?",
    "Is that the lie you tell yourself?",
    "That you're the hero? That you've changed the world for the better?",
    "Because it is a lie.",
    "Because of you Guthix died. Do you remember? You let them all in to his resting place.",
    "It was your hubris that allowed Sliske to slay him. You know that don't you?",
    "It is because of you that the gods have returned. To threaten us all.",
    "They flooded in to our world in droves. Each of them giving orders, imposing their idea of order.",
    "I saw what my master had become and I destroyed him. I saved the world from his madness.",
    "But you...you have so many masters. Do you even realise you're a servant?",
    "Yes I know. You want to deny me, you feel you are in charge. It is a comforting lie I'm sure.",
    "But you are here on the word of gods, both alive and dead.",
    "You have been told that I am dangerous. That my plan is madness and it is, it's also our only hope.",
    "My fortress stands in opposition to the gods. To all the gods.",
    "I will be the shield for Gielinor, protecting the world from their arrogant machinations.",
    "No matter what the cost, I will pay it. Because to not do so would be far far worse.",
    "So build your siege weapons and storm my gates.",
    "I wish that when you reach my gates it is as a friend, as someone who knows my way is the only way.",
    "But I am no fool, Player. I know that when we meet again you will give me no choice.",
    "When we meet again, it will be the day you die. I am sorry, but there really is no other way.",
    "So farewell Player, I look forward to devouring your soul. I imagine it will be exquisite.",
    "So, finally you step forward and challenge me directly.",
    "I see you have your army, warriors ripped from their afterlives to serve you.",
    "The old woman, who tried to destroy your world.",
    "The goblin, too weak to fight her own battles.",
    "The eldery[sic] gnome, enslaved by destiny.",
    "These are your soldiers? You are more desperate than I thought.",
    "Why do you not surrender? My force[sic] are clearly superior. My power unassailable.",
    "And even if you do break down these walls, do you think even for a moment that you can face what lies beyond?",
    "I have harnessed the power of all the souls in the underworld. Each life, each death, mine.",
    "Can you even comprehend that power? I can change the destiny of Gielinor with that power. I can set it free.",
    "I can also crush you like an insect, as seems to be your wish.",
    "It seems you insist on coming inside. Very well, I am a gracious host, I welcome you.",
    "Come Player, bring your impotent godling and whatever other allies you need to protect you.",
    "I will show you my power and the power of that which I have created.",
    "I have created a force of such power that the gods themselves will tremble before it.",
    "It wears the face of an old friend of yours, Player, so you will have something familiar to be destroyed by.",
    "I'd tell you to say your last prayers, but the time of the gods is over. Now is the time of mortals.",
    "So come Player. Let this be our final battle."
  ],
  "[Zanik and Jessika/Korasi]": [
    "FOR GIELINOR!"
  ],
  "[Ally]": [
    "Where do you want me to go?",
    "On my way."
  ],
  "[Player]": [
    "Face me you imposter!"
  ],
  "Mysterious voice": [
    "Mwaha ha ha ha ha ha ha ha! Bravo! Bravo! A most splendid display."
  ],
  "Sliske": [
    "Oh, if you insist!",
    "Oh Iccy, still not a fan of the theatrical?",
    "Oh isn't that obvious? I'm here with an invitation.",
    "Harold, my good friend. Because you so beautifully murdered the countless souls amalgamated into the new god Gielinor.[sic] I hereby invite you to attend my grand summit and compete for the Stone of Jas.",
    "As good a motivation as any I suppose.",
    "Iccy, I never thought you had it in you. The way you slaughtered the new god Gielinor. Scattering all those souls into nothingness. I must say I am impressed. You were already invited, but now you're doing well, kudos to you.",
    "So win the competition and then get rid of it, I'm sure you wouldn't use it yourself... Would you Iccy?",
    "But oh, I have one more invite to extend. Player, my dear dear friend. I am proud to offer you an invite to my grand competition!",
    "Why? Because you defeated Nomad here, a being of remarkable power. I think such a feat is worthy of recognition, don't you?",
    "But that's irrelevant. It doesn't matter whether you want it or not. The invite is given.",
    "Yes! That's the spirit. Someone who really wants to play the game.",
    "For defeating Nomad, you will stand shoulder to shoulder with the gods themselves. And you'll all compete for the most fantastic of prizes, the Stone of Jas! Oh but first there's one final thing left...isn't there? Nomad. What will you do with him? He obviously won't stop his wicked, wicked schemes. So the question is...live or die?",
    "Ha ha. Delightful. But are you really willing to add more mindless death to this? Perhaps imprisonment? Or a fine? I mean is his crime really so great? He's a hero really, right?",
    "Perhaps you will my friend, perhaps. But not, I think, today!",
    "Quite right. Who needs mercy? So entirely overrated in my opinion. I mean does it really help anyone do you suppose? Does a dragon change its scales because of a single kind act? Who cares! Now I'll even do you a little favour...",
    "And clear up that pesky corpse.",
    "Ha ha ha ha!",
    "Well then, 'til we meet again Player. As always, it's been a delight."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Nomad%27s_Elegy?oldid=36120108’"
  ]
}