{
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "dialogue with customs sergeant when not looking the part, dialogue with Brass Hand Harry without the letter of introduction, other file names in the Rock Island Prison archive, misc dialogueYou can discuss this issue on the talk page or edit this page to improve it."
  ],
  "Player": [
    "Bill, I have to ask you something about Rabid Jack.",
    "I'll say it all I like, until I get an explanation as to who he is.",
    "Oh, come on! So far, I've run into his lackeys twice, and I get the feeling he'll keep coming back until I stop him! Can't you see that telling me might save lives?",
    "Who can I ask, then?",
    "Killed him? Can't you just tell me what I want to know?",
    "Great. Well, will this Young Ralph be able to tell me what I need to know?",
    "And is his location a secret too?",
    "Great! So, when are visiting hours?",
    "That's what they think! I have to get to the bottom of this, and if getting locked up is the only way to do it, then so be it.",
    "Thanks. I'm sure, with my acting skills, I'll be able to get arrested in no time.",
    "See! It'll be a doddle.",
    "So, can you at least hint at what is going on?",
    "Excuse me.",
    "I'm a mighty pirate.",
    "...and I've come to be arrested.",
    "That's me!",
    "Well, I am.",
    "I am! Arr! Shiver the mainsails! Splice the gunwalls, cap'n!",
    "Awww. I'd best get dressed up like a pirate, so he believes me next time.",
    "Well, of course!",
    "Heard about it? I was there!",
    "Is this a trick? That ship was sunk!",
    "That's one of your ships!",
    "Yes, that's right, I served on her.",
    "That's what I keep telling you!",
    "Great!",
    "Errr. Great blistering barracudas! I've been caught.",
    "Don't try and fool me...she sank.",
    "I'm a reaving corsair.",
    "I'm a plundering scallywag.",
    "Heard about it? I was there!",
    "Curses. There has to be something around here I can use to outsmart him.",
    "Is this a trick? That ship was sunk!",
    "Not likely, I served on that fine pirate vessel.",
    "That's what I keep telling you!",
    "Great!",
    "Errr. Great blistering barracudas! I've been caught.",
    "She gave a good account against your Customs tub.",
    "Curses. There has to be something around here I can use to outsmart him.",
    "That's one of your ships!",
    "Curses. There has to be something around here I can use to outsmart him.",
    "Okay, okay, I'll store everything.",
    "That's the last of it.",
    "This one here?",
    "Err, alright.",
    "Who, me?",
    "Err, yes?",
    "Hey, you!",
    "Hey! Can't you hear me?",
    "Look, are you Young Ralph? I need to talk to you.",
    "Deaf? How am I supposed to make him turn around? I'll have to find some way to make him look over at me. I'm sure my natural ingenuity will help me to make something out of the things at hand.",
    "I still need to find a way to attract his attention. Come on [Player], time to break out the old ingenuity.",
    "Hmm, I wonder if I can get some writing implements from the guard. At the very least I can get the items necessary to draw up some plans. Guard!",
    "I want to write out a confession.",
    "Yes, the mighty walls of this bastion are so escape-proof that I'd have no means to leave otherwise.",
    "No, I'll not confess! I'll die first.",
    "I suppose I should write something.",
    "You'll not get anything from me!",
    "I don't think there is anything else I can add to this.",
    "Here is my confession.",
    "That's what she said!",
    "Guard! I need more paper.",
    "I think there is a prisoner in a lower cell trying to communicate with me. Now, I'm no expert on codes, but I'll give this a try.",
    "I wonder if they understood.",
    "Err, looks like my rudimentary tapping skills might have caused a faux-pas!",
    "A piece of pipe would come in very handy, if I think about it.",
    "I can't get this open.",
    "Really?",
    "Hey, guard! I'm hungry.",
    "Hey, guard! Give me some of that stew.",
    "I demand stew! Give me some food! This is cruel and unusual punishment.",
    "Gah! That's hot!",
    "I wonder what I can do with this.",
    "I think I've got everything I need from that heap for now.",
    "Seagulls are noisy birds. I wonder if I could use it to disrupt the guard's picnic.",
    "I'd better not attract the guards, or they will see how I used the shirt to lure the seagull.",
    "I'm sure that rehearsing what I wrote on the note has some value but, since Ralph is deaf, I have no need to say it out loud. And why am I talking to this seagull?",
    "I'm sure that this sticky paper will come in handy. I wonder if there is anything I can use this bottle for.",
    "Hmmmm. The glass of this bottle is pretty think around the bottom, I wonder...",
    "You know, I could fight my way to freedom with this broken bottle, or try something else. Something less stupid.",
    "While it ruins the instrument, I'm sure I can find a use for it.",
    "Hmmm, it doesn't seem to quite fit properly.",
    "Well, now I've made this, I can use it to...um... do something?",
    "Steady...",
    "Gotcha!",
    "Well, now that I have this seagull in a tube, I can use it to attract Young Ralph's attention.",
    "I love it when a plan comes together.",
    "Can you hear me?",
    "What was that? I can't hear you.",
    "How did you hear that, then?",
    "So long as you can understand me.",
    "Okay, okay.",
    "(Yes! I've been sent to find you. I have to ask you about... Rabid Jack.)",
    "(You have to help me, Ralph! I have to know who he is, and Bill Teach told me you were the only person that could help.)",
    "(The what?)",
    "(No, all they did was tell me to come see you.)",
    "(And who were they?)",
    "(I'm sorry, but Hector is dead.)",
    "(Yes, he is.)",
    "(I've come such a long way. Will you not give me a hint as to who he is?)",
    "(Right. Well, I'll get these marks and come right back.)",
    "(Not yet.)",
    "I've been to see Young Ralph, and now I need your mark.",
    "What?",
    "Okay, what do you want me to do?",
    "Well, thanks.",
    "Is that it?",
    "I suppose so.",
    "What is it?",
    "Not too good. I have not spoken to Mufassah yet.",
    "Well, how am I supposed to find a pirate with a gimpy leg? That's a terrifying needle-haystack scenario.",
    "Well, that will make it easier to track him down.",
    "Are you 50 Ships Mufassah?",
    "I'm not here to mock you. I merely wanted to meet the man who owns the Idol of Many Heads. It's a real honour!",
    "Yeah! I mean, you are him, aren't you?",
    "Wow! I'd love to see this idol of yours.",
    "Yes! Where do I sign up?",
    "Huzzah! Now, about that idol.",
    "What do you mean?",
    "What?",
    "Sorry, Captain, I have to go ash my hair.",
    "No, thanks.",
    "Sorry, but I can't scrub anything for you.",
    "My entire family was wiped out by a bloodthirsty pack of scrubbing brush-themed bandits. I can't even look at a scrubbing brush without having terrible flashbacks. The bristles! The bristles!",
    "I can't.",
    "My entire ADOPTED family was sucked into a bilge pump and killed.",
    "It's true! It was a very big, very lethal bilge pump.",
    "Would I lie to you?",
    "I know where the Idol of Many Heads is!",
    "Right here in my hands!",
    "Thanks, Bill. I appreciate that.",
    "Sorry, I have a swab allergy.",
    "Hey! I work hard. It's not my fault you happen to keep assigning me tasks I can't complete on medical and/or emotional grounds.",
    "I have cannonio-loadio-phobia.",
    "I faint if I see needles.",
    "With my bad back?",
    "My doctor says I can't, after the last time.",
    "My kitten was killed by a giant rabid mess when I was a child, you monster!",
    "I have too many things to do.",
    "Hey! You asked me to join and I joined. If you had a nice, easy, well-paying job I could do.",
    "I'm sure I will. I'd best tighten my laces now to prevent excess boot-trembling.",
    "Harry, I have a letter of introduction from Bill Teach.",
    "I need to get your mark.",
    "I'm not sure what you heard, but I am confident that Rabid Jack is behind it.",
    "Okay, I'm sorry!",
    "Well, I am pretty good at Smithing. Why do you ask?",
    "Here is the hand, Harry.",
    "Here is the mark I made, Harry.",
    "Thank you.",
    "No, I'm here about Rabid Jack.",
    "I've come for your mark to take to Young Ralph. Will you let me have it?",
    "Great!",
    "Oh, for crying out loud!",
    "I'm sorry. It's just that this is a lot of effort when all I'm trying to do is help.",
    "That doesn't sound too hard.",
    "Great.",
    "Err, sure.",
    "Not just yet.",
    "Okay, I'll just flat-out ask for some 'rum'. That might make him think there's a demand for it.",
    "I'll have a shot of Braindeath's finest 'rum' please!",
    "Err. I'll have a shot of Braindeath's finest 'rum', please? Although, I'd settle for you not looking at me like you're going to kill me.",
    "No! I just like the stuff. Honestly!",
    "Well, yeah.",
    "That's dashed inconvenient. Could you order some in for me?",
    "Oh, alright.",
    "How many people would need to ask?",
    "Oh, really...",
    "Excuse me, sir. Do you have any Braindeath 'rum' today?",
    "Drat!",
    "I suppose I should take this off before I try to trick him again. Oh, well.",
    "I'll have a drink – and you have one too!",
    "Excuse me, sir. Do you have any Braindeath 'rum' today?",
    "I'll have a drink... and you have one too!",
    "I'll have a drink... and you have one too!",
    "I'll have a drink... and you have one too!",
    "I'll have a drink... and you have one too!",
    "I'll have a drink... and you have one too!",
    "I'll have a drink... and you have one too!",
    "Oh, okay. Well, you stay right there until you feel better.",
    "'Ello, guvn'r, you got ant Braindeath 'rum'?",
    "Cor blimey, that's all sixes and sevens, and no mistake. I'll come back later to see if you've got some in, then.",
    "G'day mate. I'm looking fer the old Braindeath 'rum'.",
    "Stone the crows! I'll have to pop in later to see if you've got any then, mate.",
    "Excuse me, dear sir. Would you be having have any Braindeath 'rum' today?",
    "Well, now you are knowing. I will be coming back later, when you might have some in.",
    "I say, old chap. I feel like a spot of Braindeath 'rum'. Do you have any?",
    "Good show! I'll finish my constitutional and come back to see if you have some later.",
    "Excuse me, sir. Do you have any Braindeath 'rum' today?",
    "Well, now you know better. I'll return later to see if you've stocked up.",
    "Is there enough demand for you to get some in?",
    "I think that's my cue to leave and get changed.",
    "Hey, there. Have you got any-",
    "How do you mean?",
    "Sure, I'll take a note to him.",
    "With such fabulous wealth on offer, you won't see me for dust.",
    "I managed to convince him of the demand, and he made an order for some of your 'rum'.",
    "Here it is.",
    "Thanks. I assure you I'll do everything in my power to solve this mystery, Captain.",
    "It goes well. I'm just getting to the bottom of this mystery.",
    "Really? Which parts are the saddest?",
    "Not really.",
    "Yes.",
    "Err, thanks.",
    "That's okay.",
    "Gulp!",
    "How's things?",
    "Wow! It must have been one of those marketing peaks you hear about.",
    "Oh, okay.",
    "How community-minded of you.",
    "Sorry. Not right now.",
    "It goes well. I've even collected the tiny reward the barman promised for my services.",
    "Now, if only it had been more than 20 gold.",
    "Frank, did Hector ever tell you anything about...Rabid Jack?",
    "I'll take that as a yes. I need to get your mark to take to Young Ralph. Can I have it?",
    "I already told Young Ralph that Hector was dead, and he agreed to take your mark.",
    "What?",
    "More proof! He ordered the attack on Harmony Monastery! Wait a second... If I get you a letter from the head of the terrorised monks, would that be enough?",
    "Okay, wait right here.",
    "I'll have it for you in a moment.",
    "Brother Tranquility! I have a favour to ask.",
    "I need you to write a letter to a friend about what happened. You see, I am going to find out who this Rabid Jack person is and they need more proof that he was behind it.",
    "What?",
    "No, of course not. I just hope that will be enough proof for him.",
    "Thanks.",
    "I still have to deliver it. Fingers crossed!",
    "Frank! Here's the letter.",
    "I hate those buts and I cannot lie...",
    "Well, what sort of proof do you want? I mean, this person seems to have left very few traces. Only me, Tranquility and Captain Donnie- Wait a sec, a plan occurs to me! How about this: if I were to get you proof from one of his captains, would that work?",
    "Right, I'll be aback with proof in a moment.",
    "I have a cunning plan involving a pirate costume, a drunken zombie and a side order of sneaky shenanigans!",
    "Arr, Cap'n! I'm here to review the orders.",
    "I guess I'll have to dress a little more like a pirate.",
    "Aye, Cap'n. Just fished me out of the ocean, so they did. Yes, I'm going to need to see the orders so I can help out and pull my weight.",
    "Thanks Cap. But the bottom half – I can't read this.",
    "I can't take this to Frank. You didn't make a copy of these, did you?",
    "Not much of one?",
    "That will do. Wait, how do you accidentally carve several lines of text into someone's leg?",
    "On that note, I leave.",
    "What?",
    "How dare you suggest such a thing!",
    "I was going to blow my nose on it. I have allergies.",
    "It's for a skin condition.",
    "Well, for your information, Mr. Smarty-peg, I happen to have a skin condition that needs charcoal to treat – one that I'm very sensitive about. It's called Hydro...endo...cardio...spatula...it is...syndrome.",
    "Yes! So, here I was, lamenting my allergies and hoping to find someplace private to apply my charcoal, and I HAPPEN to trip over. As there was nothing to steady myself on, both my hands HAPPENED to grab your leg...in a rubbing motion. CLEARLY I should have just hurled myself to the ground rather than support myself, eh?",
    "Oh, don't you 'sorry' me! Good day to you, sir!",
    "Arr, Cap'n!",
    "Will these plans do, Frank?",
    "Thanks. I am getting the feeling I will need it.",
    "Oh come on! I'm sure he can't measure up to some of the things I've faced.",
    "I'm going to need to get training.",
    "Izzy. I was wondering if I could have your mark.",
    "Yes, I need to speak to Young Ralph.",
    "I don't know what's going on, but I think Rabid Jack is behind it.",
    "This is very important!",
    "Yes, that's how I learned about the marks.",
    "That's how you're talking to me now.",
    "Okay. I'll be back as soon as I can.",
    "I still have to get the brooch back.",
    "With awesome daring and courage.",
    "Okay, okay, keep your cap on!",
    "Hello in there! I'm here to get some evidence.",
    "Hello there.",
    "I need the personal effects of Wanda the Fish.",
    "Oh, I seem to have forgotten it.",
    "Here it is.",
    "I think this is the right file. [Same answer for all]",
    "I already have a file. I don't need another.",
    "Izzy, I have the brooch.",
    "Not a problem. I just hope I can get to the bottom of this soon.",
    "How are you holding up, Izzy?",
    "No problem. Glad to help.",
    "With awesome daring and courage. Say, do you have a folder or something? I wrote out a confession and have evidence of the many, many crimes that I think your superiors will want to see.",
    "Here you go.",
    "Sure, let's get going.",
    "(Yes, sort of.)",
    "(I have smuggled them onto the island, but they are up in the locker room. I'll be back with them shortly.)",
    "Can I get the file on [Player], please?",
    "Nice day, isn't it?",
    "Do you?",
    "(Here they are.)",
    "You did what?",
    "Wow. Where were you?",
    "But now he's back.",
    "(Do you want me to help you to escape?).",
    "(That does make sense. I suppose I'll come by to visit you when I can, Ralph.)",
    "Thanks Bill!",
    "Now that I know what this is all about, what should I do?",
    "I can't accept that. He could cause some real trouble next time.",
    "How are things, Harry?",
    "I'm sure, once I know what is going on, I'll be able to sort things out.",
    "Thanks!",
    "What?",
    "This parrot is dead!",
    "Look, this parrot is dead. I'm not going to get dragged into some pantomime over its being asleep, or something.",
    "What do you mean by that?",
    "Tell me!",
    "How upset?",
    "I think I saw it move! Good polly. Pretty bird.",
    "So, where is Achmed now?",
    "Just fine, thanks.",
    "Hiya! I'm just taking polly for a walk.",
    "No it isn't. If it was dead, then Achmed the Brutally Violent would get 'upset', and that would never do.",
    "Nothing you need to concern yourself with.",
    "Yet."
  ],
  "Bill Teach": [
    "Quiet there, [lad/lass]! Don't say that sea-devil's name.",
    "Yer a hard one alright, [Player], but you'll not get that story out of me.",
    "Aye, that I can, but 'tis not my place to tell ye.",
    "The man that killed him – Young Ralph.",
    "I want te [lad/lass], but we all- we all swore an oath not te tell anyone about This Albatross and That Butcher.",
    "Aye, he will. But ye'll have te get te him first.",
    "No, no! He's had himself locked up protective-like in the Customs and Excise prison! 'Tis the big rock off the coast of Karamja. Ye can't miss it, even with a two-cannon broadside.",
    "Quarter-past never, 'til half-past sometime. The only way to get into prison is fer piracy, and there ain't no way back.",
    "Aye [lad/lass], these be strange times, and I wish ye luck. Yer best bet is te go te the Office in Rimmington and see if ye can get yerself arrested there.",
    "Yer performance as a pirate is pretty criminal, I'll allow that.",
    "I wish I could, but an oath is an oath. All I can say is yer better off goin' to the Rimmington Customs Office and trying te see Young Ralph there.",
    "Okay [lad/lass], but before I can give it to ye, ye'll need t' do a little errand for me.",
    "'Tis purely symbolic. To give ye my mark, I'll need ye to do a little task. Nothing too serious, mind.",
    "Simple: there is a pirate in port called 50 Ships Mufassah. He's almost as bad a pirate as you.",
    "He's got an idol called the Idol of Many Heads, which is pretty much the only piece of treasure he hasn't lost, buried someplace obvious or sold fer 'rum'. If you bring it back to me, I'll give you my mark.",
    "Aye, that's all. See, nothing t' get worked up over, just a little task to satisfy tradition.",
    "While yer collectin' our marks, ye'll need this.",
    "'Tis a letter of introduction to Brass Hand Harry. He's a little old-fashioned and won't talk to anyone that ain't been vouched fer yet.",
    "How's the treasure-huntin'?",
    "Well he's not too hard te pin down. I hear he's moving slowly since he busted his leg.",
    "He just broke it, ye lummox. He's on crutches!",
    "Fer most people, aye.",
    "Where?",
    "See, nice and simple! Here is my mark, [Player], and I wish ye luck with this little endeavour.",
    "Give up Jack, yer finished.",
    "Jack!",
    "Here, take this. I found it up by yon black rock on the hill. I think it be magical. There was also a dead mole in there, thrashin' around like it were alive. I shook it out and it burrowed away. I never seen anything like it in all my days. I'm sure it'll be worth some money.",
    "Arr, fer all yer runnin' around I thought it'd be a little recompense.",
    "I don't know. I suppose we wait te see what he does next.",
    "Well, I'm sure ye'll come up with somethin'."
  ],
  "There is a note pinned here": [
    "Congratulations to the crew of The Saucy Wench. Last week, they successfully sank The Gnome's Promise, and carried out a boarding of The Reaver, off the coast of Port Khazard, although the latter managed to disengage. Drinks are on us, lads!"
  ],
  "Customs officer": [
    "Hey! Nobody stores anything in there unless they are under arrest."
  ],
  "Customs Sergeant": [
    "Zzzzzzzzzzzzzzzzzzz.",
    "This had better be important.",
    "Huh? What? Who?",
    "Oh, it's you. The ['mighty pirate'/'plundering scallywag'/'reaving corsair'].",
    "Pull the other one-it's got bells on. You don't even look like a pirate.",
    "Yeah, whatever.",
    "Zzzzzzzzzzzzzzzzzzz.",
    "Well, well, a mighty pirate, eh? You certainly look the part.",
    "Okay then, [Mr/Mrs] 'mighty pirate', if you are a pirate, you'll no doubt have heard about how our forces boarded The Saucy Wench.",
    "Okay, you got me! Well, if you know that, you must have served on The [Reaver/Gnome's Promise], right?",
    "You ARE a pirate!",
    "I'm arresting you under Article 4 of Maritime Law! It's prison for you.",
    "What?",
    "There'll be a promotion in this for me! Now, put all of your belongings into that locker as evidence. I can't transport you if you have anything that might help you escape. It will all go into the bank. We can ask the bankers to list all of the items they think are stolen, ready for your trial.",
    "Okay then, [Mr/Mrs] 'mighty pirate', if you are a pirate, you'll no doubt have heard about how our forces boarded The Gnome's Promise.",
    "Close, but not quite! Nice disguise, but you can't talk the talk.",
    "Lucky guess. Well, The Saucy Wench sent it down to the bottom nice and easy.",
    "You ARE a pirate!",
    "I'm arresting you under Article 4 of Maritime Law! It's prison for you.",
    "What?",
    "There'll be a promotion in this for me! Now, put all of your belongings into that locker as evidence. I can't transport you if you have anything that might help you escape. It will all go into the bank. We can ask the bankers to list all of the items they think are stolen, ready for your trial.",
    "Close, but not quite! Nice disguise, but you can't talk the talk.",
    "Close, but not quite! Nice disguise, but you can't talk the talk.",
    "I said store ALL of it, prisoner.",
    "Let's see how chirpy you are when Heavy-Handed Harry has had a go at you. Now, let's put you in the cage where you belong, pirate.",
    "You? How did you escape?",
    "Store all of that no-doubt stolen gear, so I can send you back where you belong.",
    "Right, let's see if you can get out this time.",
    "You? How did you escape?",
    "Err, okay. Here you are. Now, put it all in nice and neat, so we can get you back to prison where you belong.",
    "Now, store everything you have in the locker and come back to see me.",
    "Are you ready to go now that you've confessed?",
    "Right, let's see if you can get out this time."
  ],
  "Heavy-Handed Harry": [
    "Hahahahahahahaha! Your pirating days are over, scum! Nobody escapes from the Rock. Nobody escapes from Heavy-Handed Harry! Now, get in your cage, you animal.",
    "Yes, and double-time it, maggot.",
    "You turn my stomach, you filth. Let's see how long you last before the grinding prison life breaks you.",
    "Of course! It's the tiniest cell in the building. They don't call me 'Heavy-Handed Harry' for nothing.",
    "What do you mean? Nobody can escape from the Rock.",
    "Who is in charge here?",
    "well, I run the tightest prison there ever was. No one escapes!",
    "So what if there is a hole! The water around here is infested with sharks, crabs, mogres and those little fish that rip you something rotten! Besides, I'm in charge here and what I say goes! Hey, maggot!",
    "I ORDER you to not escape! If you escape, then I'll slap you in solitary faster than you can blink! Is that understood?",
    "There, see, [he/she] knows who's in charge here.",
    "Stop undermining my authority!",
    "Ah, delegation: the key to success. Come on, let's get [his/her] paperwork done.",
    "Stop wasting your breath! He's as deaf as a post.",
    "What do you want now?",
    "Hah! Broken already? Well, we'll get you all you need. There you go. Now, write fast – it may shave some time off your sentence.",
    "That's what they all say.",
    "We're already getting a lot of unwanted noise.",
    "Hah! Toss it through the bars and I'll take a look, prisoner.",
    "Mumble mumble mumble. What? You sick little monkey! I should have you flogged!",
    "Oh I feel ill. I should dump you in solitary for what you did, filth – but I don't want to touch you!",
    "You've used that lot up confessing already? Wow! Here, keep going.",
    "Oh dear, the hinges must be stuck. We'll get someone to look at that.",
    "No! Now stop rattling those bars or I'll come in there and rattle you!",
    "Shut your whiny yap-hole, prisoner! You're disturbing my lunch.",
    "You'll get fed when I say you get fed and not before!",
    "You want stew? Here, have some.",
    "Eat up, loudmouth. That's all you're going to get.",
    "Stop shouting you two, or you're off to solitary. Both of you."
  ],
  "Customs Officer": [
    "Errr, boss, are you really going to put [him/her] in there?",
    "But it's a little-",
    "Insecure?",
    "But there is a big hole-",
    "You are, boss.",
    "Yes, boss, but the hole-",
    "Have you been taking your pills, boss? I mean, I'm not implying anything, but the doctor did say-",
    "Okay, okay. Look, why don't you go up to your office and let me handle all of this?",
    "Right, Harry."
  ],
  "Young Ralph": [
    "Aaaaaaaargh!",
    "Mumblemumblemumble!",
    "I said 'No I can't! Ten years firing a cannon will do that to ye!'",
    "I didn't. I read yer flappin' lips.",
    "Are ye gonna tell me why yer firing seagulls near my head?",
    "You didn't say his name! Curse his hide t' the deeps and back.",
    "I came here to forget 'Im, and here ye are. Have you the captains' marks?",
    "When This Albatross was sunk right and true, the Cap'ins swore on Gentleman Mallard's compass that they'd never speak of this again, and charged me with keepin' the secret. None of them will tell ye, but they will let me tell ye if yer a pirate, right and true. They did give ye the marks, right?",
    "They likely thought I'd get soft in me old age and tell ye what happened without, but I remember the oath, and there's no way I can tell ye without the marks. Well, I'll tell ye the tale but ye'll need t' get the marks of the Cap'ins that were there that black day.",
    "Cap'n Braindeath, Izzy No-Beard, Bill Teach, Brass Hand Harry and One-Eyed Hector.",
    "'Tis a shame. Is his boatswain, Frank, still alive?",
    "He'll do. I knew him well enough to take his mark on this matter.",
    "No. 'Tis a superstition amongst those that were there that even sayin' his name be an ill omen.",
    "Aye, I see ye've got the guest suite there. Best room in the house.",
    "Have ye the Cap'ns marks?",
    "Aye, then ye'll have te wait te hear my tale.",
    "Have ye the Cap'ns marks?",
    "Eh? How's that work?",
    "Arr, yer a smart one alright. I'll get meself in a tale-tellin' frame o' mind.",
    "Have ye the Cap'ns marks?",
    "Harken ye well, [Player], for this is not a tale fer multiple tellin's. Back in the day, Rabid Jack were the captain of The Scourge. He were a black-hearted one and no mistake. He got greedy fer power and booty, and saught te take over Mos le'Harmless with his cronies. He brought his fleet te the port and laid it te siege, only te be repulsed. In his rage he renamed his ship This Albatross, sayin' that it would be a curse upon us all. Then, he and his corsairs sailed the seas, reavin' and plunderin' and burnin' anythin' they couldn't carry. The Customs Office, who we had a bit of an accord with, turned against us and hunted us down like dogs, tarrin' us all with that swine's brush. So, we did the only thing we could do.",
    "We hunted down that mad dog and put him down, [Player]. To the south of Harmony, there is a number of islands we call the Cursed Archipelago. They be filled with wicked magicks and evil spirits, and that dog had taken his fleet and made camp there without them touchin' him. He thought us too afeared to follow, and he was wrong. We caught him at anchor and...",
    "I was on Harry's ship at that point.",
    "I see 'im, 'Arry! I see the dog!",
    "...we had te put the rest of his crew te the sword, and scuttle the ships. They fought like the lash of Jack wer on their backs, even though he was dead and gone. We never found the body, mind, and none that went divin' fer it ever came back to the surface. So, we swore to never speak of the butcher and his black deeds, for if his name were to be a curse te us, we thought it best te forget it and let it rot on the ocean floor with his cursed bones.",
    "I hope yer wrong, [Player], I truly do. Now, fer better or worse, yer know the tale of Rabid Jack, Captain of This Albatross.",
    "If what yer sayin' is true, and that sea-devil is back, then this is the safest place te be.",
    "Aye. I'll be seein' ye, [Player]."
  ],
  "Brass Hand Harry": [
    "Hmmm, let me see that.",
    "Mr. Teach says you are a good pirate, [Player], and a friend of Mr. Teach is a friend of mine.",
    "My mark? Then I take it that the rumour I heard about 'rum' interruption was true?",
    "Listen, [Player]: a word of advice. If you say that name around me again, I'll have you stuffed down a cannon and fired at a brick wall!",
    "Well, regardless, I can't really help you, as I can't sign anything with this hand. I would normally just print my palm on a piece of paper, but Smith is behind on spares and I don't want to ruin this one. How handy are you with a hammer?",
    "Well, I have a handful of old hands that you can cobble together into a spare. Then you can use that to make my mark. There you go. They should come apart quite easily. You will need a hammer and 2 rolls of bronze wire to put it back together again.",
    "That was quick. Here is the ink pad and paper I generally use.",
    "Hmmm. Let me take a look at that.",
    "That'll do, [Player]. Young Ralph will certainly take that as my mark. I wish you well on getting it to him.",
    "Passable, [Player]. Although I'm still worried about the recent events.",
    "I have been asking after you, and it seems you have a reputation for doing so. I wish you luck, [Player]."
  ],
  "Captain Braindeath": [
    "Come back fer more 'rum', eh?",
    "Don't say the name!",
    "Of course, [lad/lass].",
    "But ye'll have te do somethin' fer me first.",
    "Hey! 'Tis the law of the sea that a Cap'n can't give his mark t'someone they don't trust 100%. If it were anything else ye wanted, I might make ye go all over the world and back fer me.",
    "I know ye are. Well, all ye've gotta do is get the barman in the Rusty Anchor te sell my 'rum' and ye'll have my mark.",
    "Aye. 'Cept he said he'd rather eat a sack o' gravel than stock my stuff. But yer a clever one. Ye'll find a way te make him think there is a demand fer the stuff.",
    "This'll need some sneakin' and I got a big bag of disguises ye can use. I'm sure they'll come in handy on a sneaky mission like this.",
    "Have ye been to see the barman again?",
    "Well, take yer time. Ye'll need te think of a cunnin' plan te get that stubborn old mule te pay up.",
    "I knew ye'd be able t' do it! Let's see his order, then.",
    "And here's my mark.",
    "Aye. If anyone can do this, I think it'll be you, [lad/lass].",
    "So, how goes it, [Player]?",
    "Arr, 'tis a sad tale indeed.",
    "De I look that easy te trick, [Player]?",
    "So, how goes it, [Player]?",
    "'Tis good to see ye turnin' a profit fer all yer work."
  ],
  "Bartender": [
    "Hello there! What can I get you today?",
    "I'm sorry, what did you say?",
    "Did that scraggly waste of skin put you up to this?",
    "You LIKE that drain-cleaner?",
    "It takes all sorts, I suppose. Anyway, we don't sell that stuff here.",
    "At the prices that bug-eyed vulture charges? Not just for you!",
    "If a few other people wanted it, I'd buy some in, but not just for one person.",
    "Five would do it.",
    "Are you joking? I'd have to be totally drunk to fall for that pathetic disguise!",
    "Nice try, though.",
    "That's very kind of you. Cheers!",
    "Thass very kind of you. Cheers!",
    "Thass very kind of you. Cheersh!",
    "Thass very *hic* kind of you. Cheersh!",
    "Thatss verrrry *hic* kind of you. Cheersh!",
    "I can' have another. I'm a lil'...tired. Why, I alms't din' recognise you there!",
    "Shure. I must have a cold or something, 'cos I feel very unsteady.",
    "What? Braindeath 'rum'? No, we don't. Sorry, I didn't think there was much demand.",
    "What? Braindeath 'rum'? No, we don't. Sorry, I didn't think there was much demand.",
    "What? Braindeath 'rum'? No, we don't. Sorry, I didn't think there was much demand.",
    "What? Braindeath 'rum'? No, we don't. Sorry, I didn't think there was much demand.",
    "What? Braindeath 'rum'? No, we don't. Sorry, I didn't think there was much demand.",
    "Oooh my head. I never realised that there was such a call for that swill.",
    "Yeah, although I'll need to see the [man/woman] who asked me first, as I owe them an apology. Oh, I need something to wake up...",
    "'rum'? No, not right now, but maybe you can solve that.",
    "I've got a note here for Captain Braindeath, if you can find him. I want to stock that dog-dribble he sells. Who'd have thought there were so many people around here without a sense of taste or danger.",
    "There is 20 gold in it for you, if you hurry.",
    "Have you taken that order to Braindeath yet?",
    "That's great! Here's the gold I promised you.",
    "Well, I'm sure that swill will be arriving soon, if you want to kill yourself with it.",
    "Oh no, I insist.",
    "Not good! The demand for Braindeath's drain-scouring solution has dropped completely off.",
    "Whatever it is, I'm now in a 10-year contract to stock that old jackal's noxious swill. You wouldn't want some, would you?",
    "Thanks! I know it's wrong to take advantage of your crippling addiction to this dangerous substance, but I have a bar to run."
  ],
  "Redbeard Frank": [
    "How do you know that name?",
    "Hector told me that a day would come when his mark was needed on this matter. Now he's dead, I suppose I could mark in his place.",
    "Well, that's good and all, but the thing is-",
    "Well, I don't really think I can just hand over my mark without more proof.",
    "I'd have to see it myself, but I suppose so.",
    "How's that letter coming?",
    "This certainly makes for an interesting reading, but-",
    "This Tranquility fella says that he did not see...him...with his own eyes. I'm sorry, [Player], but I need better proof than this.",
    "If you could do that, then I'd be a firm believer.",
    "How do you plan to get this proof?",
    "Sounds like fun. I'll let you be off, then!",
    "That's the devil's mark all right! I'm sorry I held ye up in this matter, but I had to be sure! This is a bad business, [Player]. Here, take my mark and I wish ye luck!",
    "If even half of what I heard about this scurvy knave be true, then yer in fer a world of hurts, [Player].",
    "Oh, I wouldn't rest on yer laurels. Not fer a moment."
  ],
  "Brother Tranquility": [
    "Really? Well, I'll be glad to help repay your good works.",
    "Well, I can write you a letter, but I cannot tell a lie and say that I saw Rabid Jack, or even that he was definitely behind it.",
    "Well, it's the truth! Not only did I never see Rabid Jack in person, but I only heard his name briefly mentioned in connection to the whole affair. You wouldn't ask me to lie, would you [Player]?",
    "Here you go.",
    "Was that letter any use?",
    "Saradomin guide your steps, [Player]."
  ],
  "Captain Donnie": [
    "The what now? Who be ye? Yer not one of my men! Away with ye!",
    "Yer a fresh'un, alright. Orders, did ye say?",
    "Arr! Ye do me cold heart proud, [laddie/lassie]. Keep good hold on em, you hear! Them's a secret.",
    "Aye, they did get a little damp while we were comin' ashore.",
    "What? No! Not much of one, anyway.",
    "I might of[sic] accidentally tripped and carved them into Luke's leg.",
    "'Tis a long story! See, I was drinkin' rubbin' alcohol mixed with gunpowder and cinnamon-",
    "Have ye read them plans, then?",
    "Good, [lad/lass]. Now, come join me for a quick drink."
  ],
  "Cap'n Izzy No-Beard": [
    "My mark? But that means-",
    "What's happened?",
    "Don't say his name!",
    "See! Look, if ye think that...he...is back, then I can give ye my mark, but ye'll have te perform a task for me.",
    "I know, which is why it'll just be something easy. Ye've been to the customs prison, right?",
    "Did ye stay in the cell with no back wall?",
    "Well, here is yer task: my friend, Wanda the Fish, died in the prison, and they will have stored her belongin's there. If ye can bring me the brooch she wore, then ye can have my mark. There be a set of lockpicks in the mattress, which will allow ye t' escape into the prison and get to the storage area.",
    "Ye shouldn't say his name by the way; it's bad luck!",
    "How is it going?",
    "I wish ye luck with it. I know it's frustratin', but I need to know ye're up to the task before I give ye my mark.",
    "Thank ye, [Player]. This brooch means a lot to me. Ye can have my mark.",
    "Oh, just thinking about Wanda is all. Thank ye again for getting' the brooch.",
    "No, Lizzie! Get back!",
    "Yer a monster, Jack, and ye'll never see the sunset!",
    "He's dead, ye butcher. Give it up! Mallard will take yer surrender, but I won't.",
    "Stay where ye are, Jack!"
  ],
  "Parrot": [
    "Awwwk! Albatross! Albatross! Awk! Lives to the sea, me hearties. Awk!",
    "Awk! This Albatross! Lives aplenty! Awk!"
  ],
  "Locker Guard": [
    "Okay, come on in."
  ],
  "Locker Officer": [
    "Hi. How can I help you?",
    "Yes. A tragic case of food poisoning. Do you have the file number?",
    "That's okay. It's got to be in the cabinets somewhere.",
    "Everything seems to be in order. Here are all the personal effects.",
    "Sure, I hadn't got around to filing it yet. Have fun!",
    "I suppose so. IF you like sitting on an island in the middle of nowhere, staring at the walls.",
    "The saddest thing is – yes."
  ],
  "Captain Rabid Jack": [
    "Repel! Repel them ye useless sons o' swine! Drive them bilge-drinking swabs over the rail, blast yer lazy hides!",
    "Useless! These lily-livered wastrels are nothin' te me. NOTHIN'!",
    "Dead?",
    "Dead ye say? We'll see who dies this day, ya filthy wretches!",
    "On yer feet, filth. Mr. Giles, flog that man fer not fightin'.",
    "Flog him anyway! Flog him 'till his back be worn away or the lash breaks! Live or dead, I will not be defied by these lackluster sluggards! I'm Rabid Jack, by god! I will be obeyed!",
    "Giles! Giles!",
    "Surrender? Surrender, ye say! I'll not surrender to the likes of ye.",
    "What's all this talk o' dead and finished? Don't ye know me? The sea knows me, and I've given lives aplenty to her. She'll not let me die now – or ever!",
    "Mark this, and mark it well. Ye might break my body but my will is a fist and it will choke ye yet! I will be the albatross around yer necks, the curse upon yer lips. Ye're all dead. All of ye. And it'll be me that makes ye lie down and accept it."
  ],
  "Bosun Giles": [
    "Cap'n! They've taken the hold! The Barbarous be burning stern to stern! Yon Inebriated be scuttled and the Hangman be dead in the water!",
    "But Cap'n – he's dead.",
    "Look out, Cap'n."
  ],
  "Lizzie": [
    "Yer dead, Jack!",
    "Arrrgh!"
  ],
  "Brass Handed Harry": [
    "Give him hell, lad! Fire!"
  ],
  "Disclaimer": [
    "No members of the Customs and Excise office were seriously harmed during the making of this quest*. Support your local Customs Office! In the meantime, here are some kittens."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Rocking_Out?oldid=36209775’"
  ]
}