{
  "Waylan": [
    "...wending through the willows...",
    "...Lucille...so ashamed...I can't stop walking...",
    "...Lucille... I wish I could remember what you look like...",
    "Thank you -",
    "I couldn't be more in your debt.",
    "Never touching the sauce again, that's for sure."
  ],
  "Sleeping man [ground floor]": [
    "...ears to pour their course..."
  ],
  "Sleeping man [first floor, north]": [
    "...dirge of cricket legs..."
  ],
  "Sleeping man [first floor, middle]": [
    "...woodsman cups his ear..."
  ],
  "Sleeping man [first floor, south]": [
    "...wispish as the breeze..."
  ],
  "Lucille": [
    "Wake up, Waylan. Wake up! Come on, you great drunken oaf. This isn't funny.",
    "No. Everything is not okay. I can't wake any of these men up. They keep muttering things - strangely similar things - as though they're all sharing the same dream. Makes no sense.",
    "No, I can't. I can't wake any of them up. They just lie there. They keep muttering things - strangely similar things - as though they're all sharing the same dream.",
    "I've heard rumours of men affected like this. Lulled into sleep by a strange force, never to awaken again. They just lie there, empty, as though their soul just upped and left somewhere. I don't know what to do. That's my husband there; my Waylan. I don't know what I'd do without him.",
    "Well, I ain't going to turn you down. Anything to get my Waylan back. I should warn you, though; a warrior named the Raptor came here before you and 'offered' to help. He terrified me. I'm not ashamed to admit it. I...gave him a Restless Sleep potion; an old recipe I learned from a witch some time ago. She said it would let me 'visit the world of dreams' - whatever that means. He drank it and then seemed to fade away to somewhere else. You'll need to drink it as well if you want to catch up with him. I'm not afraid to say that I fear the Raptor. You hear stories about him. His solution for a problem is to destroy everything linked to it. That's not who I want saving my husband. Protect my Waylan, would you? I know he's a drunkard, but he's MY drunkard.",
    "I understand.",
    "You'll need this if you want to follow the Raptor and Waylan. If it has the effect I think it will, you'll enter some kind of dream world. Then make sure you get to Waylan before the Raptor does.",
    "Back so soon? Everything alright?",
    "You must still be sleepy. You were following the Raptor and bringing back my Waylan. Go get my drunkard for me, would you?",
    "You already have the potion. You don't need any more.",
    "Careful now: this stuff can be dangerous.",
    "I cannot thank you enough. Waylan's a little groggy, but that's no different after a normal night's drinking.",
    "Quiet, Waylan. The adventurer doesn't need to hear your drunken ramblings. We're in your debt. And you can be sure that I won't let him drink ever again.",
    "Oh! Hello again.",
    "We're doing fine. I can't thank you enough for rescuing Waylan.",
    "It is a little worrying to realise that there's an enormous dragon underneath the village.",
    "I dread to think what would happen if she decided to break free.",
    "Thankfully, no. I don't mind telling you that the Raptor terrifies me."
  ],
  "You have unlocked a new music track": [
    "Song from the Depths.",
    "Something is Wrong.",
    "Belly of the Beast.🎵",
    "Awoken.🎼"
  ],
  "Dreaming Soul (#1)": [
    "...I heard her first...stay away from her..."
  ],
  "Dreaming Soul (#2)": [
    "...hear the beauty in her voice..."
  ],
  "Haunting Voice": [
    "This story starts under the sea, in the home of my sisters. In that home, I found moments to sing. But I knew, if my sisters heard me, they would roll up some kelp and force it into my mouth. So, I learned to sing quietly. One night, my sisters were out hunting. I swam from my home and came upon a village on the edge of the sea. There were so many people on the docks, working and talking, but they could not see me in the dark water. So, I sang to them...",
    "Come to me, my men. Gather to hear my story.",
    "So, I sang an old mermaid song, and the men on the docks listened.",
    "'Flyfish drift on the northern wind;'",
    "'Goldfish bask in the western sun;'",
    "So, I sang an old mermaid song, and the men on the docks listened.",
    "'Flyfish drift on the northern wind;'",
    "'Goldfish bask in the western sun;'",
    "'From southward seas the catfish cries;'",
    "'From the east the hammerheads drum.'",
    "'From southward seas the catfish cries;'",
    "'From the east the hammerheads drum.'",
    "The sailors on the dock heard my song, and I could see the adoration on their faces. I drank it all in. But then they stepped into the sea. None of the men made an effort to swim, and they drowned. I lifted the dead bodies back onto the land. I could barely swim home with the sorrow. My sisters taunted me. Even the town changed its name to Witchaven, as if to remind me of what I had done.",
    "I knew I should mourn those men. But I could only think of their adoring looks and the effect they had on me.",
    "So, I swam for the town again. This time, I climbed onto the land and sang for the men of the fields.",
    "There was no water to drown in, and they looked at me with such love...",
    "But then the men saw one another. They became jealous.",
    "And they fought. They hacked at each other, beating flesh and bones with rocks.",
    "As I learned new songs, I found I could affect men in other ways.",
    "One song allowed me to attract the souls of dreaming men. They would love me, even as they slept.",
    "Night or day, I was surrounded by those who loved me, and I loved them back.",
    "I found myself walking the world, sharing the love of dreaming souls.",
    "It was overpowering. It came so easy to me. But, one day, I came across a soul that would not love me.",
    "A furious soul. It burned with rejection, fear, and hatred. It ignored me.",
    "I approached the furious soul. It screamed as if on fire. I tried to soothe it with song, but still it seethed.",
    "So, I cried a tear, and the water extinguished the fire.",
    "I approached the furious soul. It screamed as if on fire. I tried to soothe it with song, but still it seethed. So, I cried a tear, and the water extinguished the fire.",
    "Although it didn't rage any more, the soul had burned down, as if only a spark. I gave it the breath of life, keeping its heart pumping and alive.",
    "Although it didn't rage anymore, the soul had burned down, as if only a spark. I gave it the breath of life, keeping its heart pumping and alive.",
    "The soul was weak. So, I gave it some of the energy I had gathered. I allowed it to regrow.",
    "The soul was weak. So, I gave it some of the energy I had gathered. I allowed it to regrow.",
    "The soul felt new growth and purpose. But it needed time to become strong.",
    "The soul felt new growth and purpose. But it needed time to become strong.",
    "It grew stronger than any soul I have ever encountered. It was so powerful, so overwhelming.",
    "It grew stronger than any soul I have ever encountered. It was so powerful, so overwhelming.",
    "And then there was darkness. My story ended and another began.",
    "But that story is for another time.",
    "All that is left is to repeat the story again.",
    "...",
    "Come to me, my men. Gather to hear my story.",
    "This tale starts under the sea, in the home of my sisters."
  ],
  "The Raptor": [
    "Keep talking, witch. Makes it easier to find you.",
    "...",
    "Grr...",
    "If you're here to stop me, then you have a problem. And that problem is standing in front of you.",
    "Heh. It's too late to save Waylan.",
    "Keeping an eye on me is easy. Try to stop me and you die.",
    "Only thing left to do is kill HER. Keep your distance. Don't try to stop me.",
    "I guess this is the end of the line. No one could make that jump and survive. It would be foolish to even try. Heh.",
    "Found you. I'm going to put an end to your witchcraft. Time to die.",
    "Innocent? Hah! I've seen the bodies.",
    "Doesn't matter. You are still a monster.",
    "Killing her is the only way to stop this happening again.",
    "Grr.",
    "Fine. You get us out of here, and I'll let you live a bit longer.",
    "But I'll be keeping an eye on you.",
    "Heh. Will take more than dragonfire to get rid of me.",
    "You did fairly well. There will be no more dead villagers. And I have a new target. It'll take great strength to break the dragon's neck.",
    "But I will do it.",
    "For the best. Power like that can be too dangerous.",
    "Not me. You should go. Let her know what happened. Here, take this. It was the Siren's.",
    "She won't have any use for it. White Knights say you can get more in the cave. Don't care for them, myself. I prefer my flail.",
    "Hmph. Talk to me when you can carry it."
  ],
  "Dreaming soul": [
    "...My body is is yours forever....",
    "...If any of you touch her.. I'll kill you..."
  ],
  "Waylan's soul": [
    "...why I can't go back... why must I keep going forward?..."
  ],
  "Dreaming Soul": [
    "...I see you looking at her!... I'll have your head!...",
    "...I no longer want my body... take it... take it.."
  ],
  "The Siren": [
    "Stop! You can't be here! This is our island. You need to get back on your ship. She doesn't like trespassers, you'll make her angry.",
    "What are you talking about? Look around you: the waves lapping at the shore; the soft, soft sand.",
    "The old woman, you'd better leave before she finds you. She'll send you right back on your boat.",
    "How can I believe you, trespasser? Still, I will humour you. I will sing the Waking Song. Then we'll see who is dreaming. 'Drop dream's ballast and rise to air. Shed its darkness for morning glare.'",
    "'Let the sun...'",
    "...Gods!...",
    "No! No, this can't be!",
    "What infernal place is this? What has been done to me? Who is responsible for this horror?",
    "Wait, I remember. I was swimming in some caves, I found a soul that was so alone...",
    "Then... it ate me!",
    "Gods. I wake up from a dream to return to a nightmare. No, it's better to see the world as it really is. Even if I am trapped in this thing.",
    "No, I... oh no... my song. I thought I was just on my island, I had no idea. The old lady, the dragon... she must have been using me to lure them here. That's why she kept making me sing. I know it's only a small means of reparations, but my Waking Song has sent the other souls back to their bodies.",
    "If you can let me out, I might be able to repay the favour and help you escape.",
    "I understand your hesitation, but I don't think there's any other way out.",
    "I know an introduction won't help things, but my name is Remora."
  ],
  "Remora": [
    "When I was eaten by the dragon, I wore a necklace of some power. It should be able to help us get us out of this nightmare.",
    "No... please. It isn't my fault.",
    "No! This has all been an accident, I swear. I had no idea.",
    "That's right. If we can find my necklace then I can teleport us out.",
    "All you have to do is get me out of here and it's yours.",
    "I understand. Grab my crossbow from the floor. It should burst the cyst and release me.",
    "Be ready; I imagine that bursting it will not make the dragon happy."
  ],
  "Player": [
    "Maybe... Anyway, we should talk to Lucille."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Song_from_the_Depths?oldid=36229996’"
  ]
}