{
  "Sigmund": [
    "Can I help you?",
    "There was recently some damage to the castle cellar. Part of the wall has collapsed. The Duke insists that it was an earthquake, but I think some kind of monsters are to blame. Would you like to help investigate?",
    "You should ask other people around the town if they saw anything.",
    "I'm the Duke's advisor.",
    "I only advise the Duke. But if you want to make yourself useful, there are evil goblins to slay on the other side of the river.",
    "Can I help you?",
    "A goblin? This validates my suspicion! We should tell the Duke!",
    "Yes your grace, but if there is any possibility that this is a goblin incursion then we should take that possibility very seriously!",
    "Your grace, this is the adventurer who defeated the dragon Elvarg. I think you should listen to [him/her].",
    "Can I help you?",
    "See, it was goblins! You should tell the Duke.",
    "It is unknown to me, your grace. But the fact it is there is enough to prove Father Aereck's story. It must have been dropped by a goblin as it fled.",
    "Then it must have been stolen!",
    "That doesn't matter! You said yourself that goblins couldn't have made that, so they must have stolen it from somewhere. Horrible, thieving goblins have broken into our cellar! We must retaliate immediately! First we should wipe out the goblins east of the river, then we can march on the goblin village to the north-west...",
    "Can I help you?",
    "I don't see how there can be any more doubt. You should tell the Duke at once!",
    "What more proof do we need? Nasty, smelly goblins have been living under our feet all this time! We must crush them at once!",
    "Can I help you?",
    "You should tell the Duke about anything you have learned.",
    "And I suppose you believe them, goblin-lover?",
    "Can I help you?",
    "The priceless Lumbridge Silverware! It comes out only on special occasions. It was kept in storage in the cellar, but now the goblins have stolen it.",
    "That doesn't matter. You'll never find it, because the goblins took it. So you can't stop the war!",
    "Can I help you?",
    "What? Well, so what if I am? It's not a crime.",
    "Of...of course not! The goblins must have, um, dropped the silverware as they ran away.",
    "But don't you see it was for the best? For goblins to be living under our feet like this... ugh. It doesn't matter how civilized they are: all sub-human species must be wiped out!",
    "Prattle on, goblin. Soon you will be destroyed!"
  ],
  "Player": [
    "Do you have any quests for me?",
    "Who are you?",
    "Can you give me any advice then?",
    "What happened in the cellar?",
    "Do you know what happened in the cellar?",
    "Do you know why?",
    "Do you know what happened in the castle cellar?",
    "Do you know what happened in the castle cellar?",
    "Do you know what happened in the castle cellar?",
    "Do you know what happened in the castle cellar?",
    "Do you know what happened in the cellar?",
    "Well, part of the wall has collapsed.",
    "Well, yes, that's what I'm doing.",
    "Do you know what happened in the castle cellar?",
    "Do you know what happened in the castle cellar?",
    "I believe you.",
    "Father Aereck says he saw something in the cellar. Like a goblin with big eyes.",
    "Father Aereck says he saw something in the cellar. Like a goblin with big eyes.",
    "I think we should at least investigate.",
    "I dug through the rubble in the cellar and found a tunnel!",
    "I dug through the rubble in the cellar and found a tunnel! On the ground I found this brooch.",
    "What can you tell me about this brooch?",
    "In a cave beneath Lumbridge.",
    "A goblin might have dropped it.",
    "'A History of the Goblin Race'. This must be the goblin book I was looking for.",
    "Hey... The symbol of the 'Dorgeshuun' tribe looks just like the symbol on the brooch I found.",
    "Have you ever heard of the Dorgeshuun?",
    "Make up your minds!",
    "Do you want me to decide for you again?",
    "It doesn't really matter. What happened to them?",
    "Who were they fighting again?",
    "Well either way they refused to fight.",
    "Why were there punished again?",
    "So do goblins make their own tunnels?",
    "Well I found a brooch underground, and I looked up the symbol and it was the symbol of the Dorgeshuun.",
    "So why is the Dorgeshuun tribe underground?",
    "Wait, you say YOU won the big wars?",
    "Well why not show me both greetings?",
    "Thanks.",
    "What kind of god would punish them for refusing to fight?",
    "I spoke to the goblin generals in the Goblin Village. They told me about an ancient goblin tribe that went to live underground.",
    "I spoke to the goblin generals in the goblin village. They told me about an ancient goblin tribe that went to live underground.",
    "Did you break in to the castle cellar?",
    "I've made contact with the cave goblins...",
    "I've made contact with the cave goblins. They say they were following a seam and broke into the cellar by mistake.",
    "Well, they seemed friendlier than most goblins, and nothing was taken from the cellar.",
    "Tell me about the silverware that was stolen.",
    "So why did no one notice earlier?",
    "Sigmund must be a member of the Humans Against Monsters cult!",
    "You're a H.A.M member, aren't you?",
    "Did you know Sigmund is a member of HAM?",
    "I found the missing silverware in the HAM cave!",
    "What was I doing again?",
    "I, er, lost the treaty.",
    "I have a peace treaty from the Duke of Lumbridge.",
    "No. As long as you stick to the terms of this treaty there will be no conflict. The Duke of Lumbridge wants to meet your ruler to sign it.",
    "Your grace, I present Ur-tag, headman of the Dorgeshuun."
  ],
  "Duke Horacio": [
    "The wall collapsed because of an earthquake. I'm waiting for a team of builders to come and repair it.",
    "Yes, he mentioned that to me. But I think he was imagining things. Goblins live in natural caves but everyone knows they don't have the wit to make their own tunnels.",
    "Hmm, very well. I give you permission to investigate this mystery. If there is a blocked tunnel then perhaps you should try to un-block it.",
    "I've never seen anything like that before. It doesn't come from Lumbridge. What do you think, Sigmund?",
    "I've never heard of a goblin wearing something so well- crafted.",
    "But it wasn't stolen from us. Where could it be from?",
    "I will not commit troops until I have proof that goblins are behind this. Player, please find out what you can about this brooch. The librarian in Varrock might be able to help identify the symbol.",
    "Hmm, perhaps you are right. I will send word to the army to prepare for an underground assault. Player, I would still like you to find out more about this tribe. It cannot hurt to know one's enemy.",
    "Actually, something was taken. Sigmund has informed me that some of the castle silverware is missing from the cellar. Unless it is returned, I am afraid I will have no option but war.",
    "Hmm, I had suspected it. But however much I disapprove of the HAM movement it's not actually illegal. I'll keep an eye on him. though.",
    "Sigmund! Is this your doing?",
    "Don't lie to me! I knew you were a HAM member but I didn't think you would stoop to this. You are dismissed from my service.",
    "That's enough! Get out of my castle now!",
    "I see I was ill-advised. Unless there is an act of aggression by the cave goblins there is no need for war.",
    "You were taking the peace treaty to the cave goblins.",
    "*sigh* All right, here's another copy.",
    "Welcome, Ur-tag. I am sorry that your race came under suspicion. I assure you that the warmongering element has been dealt with.",
    "No, let it stay. It can be a route of commerce between our lands. Player, Lumbridge is in your debt. Please accept this ring as a token of my thanks. It is enchanted to save you in your hour of need."
  ],
  "(Note": [
    "one of these people witnessed the disturbance; the following dialogue is what they say if they did not.)"
  ],
  "[Man/Woman]": [
    "Yes. Part of the wall collapsed.",
    "Well that's a different question. No, I don't."
  ],
  "Cook": [
    "Oh no, it's terrible, isn't it? There was rock dust everywhere, it got on all my ingredients!"
  ],
  "Hans": [
    "Hello. What are you doing here?",
    "The wall collapsed. I had to spend all day clearing it up! The Duke says it was an earthquake."
  ],
  "Father Aereck": [
    "It's a shame, isn't it? The castle is even older than this church, and so it's terrible that it would be damaged, even if it's only the cellar."
  ],
  "Bob": [
    "No. But we should find whoever is responsible and slay them! With an axe!"
  ],
  "[Lachtopher/Victoria]": [
    "No. What happened in the cellar?",
    "Good heavens! You'd better find out what happened!",
    "Good! I know we're safe in your hands."
  ],
  "Donie": [
    "Hello there, can I help you?",
    "I heard the wall collapsed or something. I don't know why. Perhaps you could get to the bottom of this mystery!"
  ],
  "[Witness]": [
    "Last night I was in the kitchen and I heard a noise from the cellar. I opened the trapdoor and saw a creature dart into a hole in the wall. It looked a bit like a goblin, but it had big bulging eyes. It wasn't wearing armour, but it had this odd helmet with a light on it. The tunnel was too dark for me to follow it, so I went to tell the Duke. But when we went down to the cellar the hole had been blocked up, and no one believes me.",
    "Thank you, Player! If you can convince the Duke I'm telling the truth then we can get to the bottom of this mystery."
  ],
  "Reldo": [
    "I've never seen that symbol before. Where did you find it?",
    "Very odd. Have you any idea how it got there?",
    "I've never heard of a goblin carrying a brooch like this. But just a minute... The other day I filed a book about ancient goblin tribes. It's somewhere at the west end of the library, I think. Maybe that will be of some use."
  ],
  "General Bentnoze": [
    "Dorgeshuun? That old goblin legend. Lost tribe.",
    "No no, he send them to fight tall people with biting blades, that what I hear.",
    "It was tall people! That what old storyteller say!",
    "You stupid!",
    "That most stupid idea yet. If it happen it either happen one way or the other. You can't just decide which.",
    "That silly. No goblin ever say that.",
    "They lose battle, that why god punish them.",
    "No no, they losing so they run away, and Big High War-God punish them for running away.",
    "No no, it was tall people.",
    "Anyway then Big High War-God punish them. He turn their insides to stone.",
    "Not as silly as green armour! What happen then?",
    "That not punishment! Caves nice and cool.",
    "No, it because they refuse to fight night before battle.",
    "What? Make our own tunnels?",
    "That not look like goblin brooch.",
    "Well if it Dorgeshuun tribe they not know who won big wars. You should greet them with goblin victory dance!",
    "Doing bow make you look like a wimp.",
    "Only if they wimpy tribes! Goblin salute strong!",
    "They punished by Big High War-God.",
    "Well we must have done! We goblins! Goblins always win!",
    "It was goblins I say!",
    "Bye then.",
    "Shh! Must not question Big High War-God!"
  ],
  "General Wartface": [
    "In time of much-war there many tribes. Big High War-God send Dorgesh tribe to fight beardy-short-people in mountains.",
    "It was beardy-short-people, that how legend go.",
    "No, beardy-short-people. That how legend always go, stupid.",
    "Yeah even goblins know that.",
    "Well, they say, 'We not want to fight,' so god punish them.",
    "What happen then?",
    "Ha ha! If they lost battle they all be dead!",
    "It was beardy-short-people in mountains.",
    "Yeah I suppose so.",
    "Ha ha ha! That silly!",
    "He put them inside stone! Big hole open in ground and they all go into cave.",
    "But then he close cave so they not get out! You not want to stay in cave all the time.",
    "It because they run away from fight.",
    "We hadn't thought of that.",
    "Goblins not wear jewellery.",
    "No no, you greet them with goblin tribal bow.",
    "It how tribes greet each other in old days.",
    "Actually we not know who won.",
    "That good idea. Watch.",
    "No, because he much bigger than us."
  ],
  "Mistag": [
    "Who...who are you? How did you get in here? Help! A surface-dweller this deep in our mines? We will all be destroyed!",
    "A human knows ancient greeting? Perhaps you are friend after all! Greetings, friend. I am sorry I panicked when I saw you. Our legends tell of the surface as a place of horror and violence, where the gods forced us to fight in terrible battles. When I saw a surface-dweller appear I was afraid it was a return to the old days!",
    "It was an accident. We were following a seam of iron and suddenly we found ourselves in a room! We blocked up our tunnel behind us and ran back here. Then we did what cave goblins always do when there is a problem: we hid and hoped it would go away. We meant no harm! Please tell the ruler of the above- people that we want to make peace.",
    "Hello, friend?",
    "A peace treaty? Then you will not invade?",
    "I will summon Ur-tag, our headman, at once."
  ],
  "Duke horacio": [
    "This peace treaty specifies the border between Lumbridge and the Cave Goblin realm. Please take it to the cave goblins and tell them I would like to meet with their leader to sign it."
  ],
  "Ur-tag": [
    "I apologize for the damage to your cellar. I will send workers to repair the hole.",
    "I too thank you. Accept the freedom of the Dorgeshuun mines. These are strange times. I never dreamed that I would see the surface, still less that I would be on friendly terms with its people."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:The_Lost_Tribe?oldid=34189504’"
  ]
}