{
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "Missing parts of non-esential dialogue dialogue. Marked below.You can discuss this issue on the talk page or edit this page to improve it."
  ],
  "Player": [
    "Hello, Kennith. How are you doing today?",
    "You don't sound so sure.",
    "Doesn't everyone act weird in Witchaven? You know, what with most of the population being possessed by sea slugs.",
    "Really, that doesn't sound good at all.",
    "Sure thing.",
    "Not right now, Kennith.",
    "Hello again.",
    "No, not yet, I'm sorry. Actually, can you remind me where they are?",
    "Ah, yes, I think so.",
    "Hello again, Kent. Do you know anything about the new sea slug activity going on below Witchaven?",
    "Don't worry, I'll soon find out what's going on.",
    "Hello. What's going on here then?",
    "Working?",
    "A surprise? Can I see it?",
    "Are you sure?",
    "Nope, not me. That was... someone else.",
    "Can I come in yet? I'd really like to see this 'work'.",
    "That was close!",
    "If looks like there is something going on under the shrine but the villagers wouldn't let me into the mines.",
    "Well, yes, now that you mention it, there was a rockfall. Thankfull, it missed me.",
    "I'm not sure that will do any good. The villagers were pretty adamant that I wasn't allowed in.",
    "Excuse me? I thought you were concerned about the sea slugs? Don't you have any ideas what to do next?",
    "Erm, no, sorry. I don't know where they are. Erm, I guess I'll see you around Kennith.",
    "Hello again. Have you had any more ideas about the sea slugs?",
    "No, I haven't seen them anywhere. If I do, I'll tell them you're looking for them.",
    "Hello, you two, what's up?",
    "I'm pleased to hear it. Did you know Kennith is looking for you?",
    "Yes, Kennith is...wonderful.",
    "Hey, Kennith.",
    "I think they just need some time away from the house at the moment.",
    "Erm...maybe... Well, if I see them, I'll tell them that you were asking after them.",
    "Hello, Kent.",
    "Really? I know there's a bit of a sea slug problem, but Witchaven always seemed a nice enough place to me.",
    "He does seem a little demanding, but he;s been through a lot for someone so young, I guess he's just very needy.",
    "I think you're getting a bit carried away, Kent. Sure, Kennith might be a bit of a handful, but he can't be that bad! Anyway, lets move on from Kennith for a second - what has all this got to do with the sea slugs?",
    "Well, we wouldn't want you upsetting Kennith. Okay, leave it with me; I'll go and check that she's alright.",
    "Hi again. Sorry, but can you remind what you wanted me to do?",
    "Ah yes, that was it.",
    "Hi, Kennith. Do you know where Kimberly lives? I'm trying to find her.",
    "I'm just checking up on her. With all this sea slug activity around, it makes sense to make sure that she's okay.",
    "Thanks, that's all I needed to know. I'll see you later.",
    "Hello? Kimberly...are you okay?",
    "I'm Player; I've been sent to help you. So,  please, tell me what's wrong.",
    "Where are your parents?",
    "Don't be scared, Kimberly, I'm here to protect you. Nothing's getting you without going through me first.",
    "Of course I will.",
    "Not right now.",
    "Come on Kimberly, we've got to get out of here!",
    "Ah...well...I'm not to sure about that.",
    "Let me get this straight. You want me to use myself as bait to lure a group of angry, sea-slug possessed villagers into the church in order to 'save' them?",
    "What was it I had to do again?",
    "Okay, I've got them all locked in the church.",
    "No thank you. I'm just in the process of trying to protect Kimberly from hordes of angry villagers.",
    "Wonderful?",
    "Yes, it is terrible. I'd better get to the bottom of this before they eat her or something.",
    "Okay, I've locked them all up in the church.",
    "Not yet. I'm just waiting for Kimberly to get here - she's got something to ask you.",
    "It's very important, Kennith. Now, behave yourself and wait for her to arrive.",
    "Go ahead and ask him.",
    "Indisposed?",
    "Aren't you worried?",
    "Ignore him. Don't worry, I'll get rid of the villagers.",
    "Have you got any idea why all of this is happening, Kennith?",
    "Stop it, both of you! I think there are slightly more important things at hand here.",
    "Okay, I've locked them all up in the church.",
    "Are you alright staying here, Kennith? Maybe you should come with us to Ezekial's place.",
    "Let me explain to Ezekial what's happening.",
    "Hi, Ezekial. Look, we may have a bit of a problem... Strange things are afoot in Witchaven.",
    "Be quiet, Ezekial, you're not helping matters. Now, what do you know about what is going on?",
    "Ignore him, Kimberly. Ezekial, listen to me: do you know of any way to get into the mines?",
    "That would be excellent. I'll catch up with you once I've settled Kimberly down.",
    "Are you okay to be left alone, here, Kimberly?",
    "You are a very brave girl, Kimberly. I'll come back as soon as I can.",
    "Hi, Ezekial. Have you had any luck in talking to these two guards?",
    "Hello, again.",
    "Aye, my sister. It is a tragic affliction. Maybe if I saw the work I could escape my torment for a moment.",
    "Okay, you've the sea slug expert. What's our next move?",
    "Do you have any advice?",
    "Hello again. What are you doing down here? Did you know Kennith is looking for you?",
    "I'm sure he is, but that's not all that important right now. The sea slugs are up to something; do you two have any idea what is going on?",
    "Shouldn't you be looking after Kennith, though? He's all alone in the house!",
    "Oh, please don't start all that again. It's been very nice talking to you two, but we have to be going now.",
    "So, how am I supposed to get through this next section?",
    "Very impressive, Ezekial, but I have got to ask; where did you learn all of this stuff? I thought you were just a humble seller of bait.",
    "Any advice as to how I'm going to get through this next section, Ezekial?",
    "Hi!",
    "Erm... Make what stop?",
    "You wouldn't have a daughter named Kimberly by any chance?",
    "Oh yes, she's fine. We left her at Ezekial. You locked the door, didn't you, Ezekial?",
    "See? She's going to be fine. Now, let's get out of here.",
    "He's just a child, Katherine - he needs protection. I'll go see if I can find him; you guys, er, stay here and let me take care of the heroics.",
    "Hello, you two. Do you have any idea where Kennith is right now?",
    "Please don't start all that again.",
    "I'll take that as a 'No', then, shall I??",
    "Yes...Kennith. I guess I'll go and find him myself.",
    "Erm...Kennith? What are you doing here?",
    "That's a coincidence -  I was just coming to find you too.",
    "I'm sorry? I really don't know what you're talking about.",
    "How on RuneScape are all of those things connected?",
    "Please don't tell me this is about the train that she lost! You kidnapped her parents, enslaved the villagers, tried to collapse her house...all over a toy train?",
    "Stand back, Ezekial. I don't know what he's going to do next!",
    "You knew about that?",
    "Yes, I think you're right - it's the only things that can stop him.",
    "Kimberly, you have to tell me where you lost Kennith's toy train! Think!",
    "I want to, Kimberly, but you're going to have to think where you lost that train.",
    "Okay, that's good! Anything more specific?",
    "Excellent, Kimberly! You're a very brave girl. Just stay brave a little longer while I go and find the train.",
    "Any ideas, Ezekial?",
    "Hello.",
    "Yes, erm, he's just nearby actually, but I really think you would be best to stay here.",
    "Kennith actually said for you to stay here. He told me to tell you.",
    "Good. Kennith will be pleased. I'll tell him that you've been very good.",
    "That's right! He'll be delighted. okay, you two, I need to go and attend to something for Kennith. I'll see you soon.",
    "Hello again.",
    "Oh, yes, she's...err...fine. Just playing with Kennith.",
    "No, they're both fine. Look, it's been nice talking, but I'm in a bit of a hurry. I need to stop Kenni- erm...stop some bad things from happening.",
    "Greetings, sister. May I enter?",
    "Aye, I did, but the work calls me back.",
    "I found the train, Ezekial!",
    "I have the train, Kimberly!",
    "Key, Kennith! 'Toy' with this!",
    "Kimberly, can you leave us alone for a moment, please? Your parents are just a few chambers away - go to them.",
    "Erm...Kennith? Can you hear me Kennith?",
    "Leave him for a moment, Kent. He's been through a lot, but he's quiet now, and I'd prefer it if he stayed that way for now.",
    "It's alright, Kent, these things happen. How were you to know that your son could become an egomaniacal monster over a lost toy.",
    "What are you going to do about it?",
    "Sounds like a wise move. Well, good luck. I'm sure our paths will cross once more.",
    "What did you just say, Kennith?",
    "I don't know how I would have done it without you Ezekial.",
    "How are Clive, Katherine, and Kimberly doing?",
    "They might have a point... At least this particular ordeal is over.",
    "I suppose you're right, but we don't seem to be able to finish them off.",
    "Okay, Ezekial. If I get any more rubium I'll bring i only to you. Can you tell me what your plan is, though?",
    "Kill me?",
    "Fair enough. Well, I will come and see you the next time I come across some rubium."
  ],
  "Kennith": [
    "Hello, Player. I'm okay...I guess.",
    "Well, I don't know. It's just that the villagers are acting weird again.",
    "Well, yes, but they are being MORE weird that usual. They seem to be digging under the shrine to the west of town again, but the Slug Queen's lair.",
    "I'm really worries, especialy after what happened to me on the Fishing Platform. Will you go and have a look to see what they're doing?",
    "Thank you, Player. I just know I'm going to be safe with you looking after me.",
    "Awww... Well, I guess I'll just fend for myself and hope they don't come to take me away again.",
    "Hi! Have you been to investigate what the villagers are up to yet?",
    "Of course! If you go into the shrine to the west of Witchaven you'll find yourself in a chamber. There's a hidden door there that you opened last time, when you were looking for the Slug Queen, remember?",
    "Really? That's interesting. Were there any surprises? An accident, maybe?",
    "Oh, yes, I'm thankful too. It would have been terrible if you were squished flat. Like a pancake. Maybe you should go back down there to investigate more? I'm sure there won't be any more accidents.",
    "That's sad. Oh well, it doesn't matter. It's been nice talking to you again, Player. Have you seen my parents anywhere? I'm bored, I NEED them here now to play with me.",
    "Sorry, I don't know what to do. Perhaps you should go and find another adventure. Now, tell me: have you seen my mum and dad?",
    "Bye!",
    "No, stop going on about the sea slugs. Have you seen my parents anywhere? I'm bored.",
    "Oh, hello, Player. Have you seen my mum and dad yet?",
    "What? Away from here? AWAY FROM THEIR SON?",
    "What do you want HER for? She's horrid! A horrid little girl.",
    "FINE! Go see your beloved Kimberly! She lives in the house at the north of Witchaven.",
    "Oh, hello, Player. Have you gone back into the mines yet? I really think you should.",
    "You are NOT bringing that horrible monster over here!",
    "What do you want?",
    "No, I haven't seen them anywhere. Stop being such a wimp and look after yourself. My own parents are erm...indisposed, but you don't see me crying about it.",
    "They've disappeared, just like Kimberly's.",
    "No, because I'm not a silly little wimp like she is.",
    "You are such a wimp!",
    "I have no idea; no sir. Kimberly is such a wimp though - they're only silly villagers!",
    "Are too!",
    "No, I'm fine here! You just run along with your little friend.",
    "Ah, Player, I've been looking for you.",
    "You've interfered with my plans long enough. Now, it is time for us to end this.",
    "Oh, come on! Put that tiny brain of yours to work. I'm talking about you helping Kimberly, nosing around these mines, stopping the excavation...INTERFERING!",
    "I want her out! Kimberly must leave Witchaven! SHE MUST LEAVE! So, I harnessed the weak minds and wills of the possessed villagers to do my bidding.",
    "It has everything to do with the train! That vile little monster lost my favourite toy and now she will pay!",
    "So, you want to help Kimberly, do you? Let's see you help her out of this!",
    "Choo! Choo!",
    "The Queen is coming for you, Player."
  ],
  "KenT": [
    "No, I'm sorry, I don't know anything about that...only that Kennith is quite preoccupied by it all. I really hope there's nothing sinister going on, but the villagers are acting very strange.",
    "Oh, really? That's excellent news. I feel better already, knowing that you are on the case."
  ],
  "Villager": [
    "We are working.",
    "Working...preparing a surprise.",
    "You may not enter. The work must be a surprise for the outsiders.",
    "Did you not kill our prince?",
    "Please leave us.",
    "Please leave. Our work is not yet complete.",
    "Let us in, Kimberly...",
    "Kimberly... Kimberly... Kimberly...",
    "Come out to play, Kimberly...",
    "Let's have some fun...",
    "Leave this place!",
    "We'll get you!",
    "We will hurt you!",
    "This isn't your fight!",
    "You're not wanted!",
    "Nobody can protect you...",
    "We make satisfactory progress. The work moves forward.",
    "Did he not kill the prince?",
    "He does not appear waxen enough to be our kin.",
    "Aye, it is glorious work that we do. Please enter.",
    "Did you not just leave?",
    "It is glorious work. You may enter."
  ],
  "Kent": [
    "We're fine!",
    "Kennith? Oh, really? Player...have you noticed what a....wonderful son our Kennith is?",
    "We're glad  you agree. I'm sorry, Player, but I nned to be going...somewhere. Maybe I'll see you later.",
    "Oh, hi, Player. Thanks for coming. I'm sorry for running off earlier - you must have thought it rather odd, but it's difficult to talk openly in Witchaven.",
    "Well, it's not that - I just didn't want to disturb Kennith. He has quite a temper at times and he doesn't like us talking to other people too much. Bringing up such a...talented child can be something of a challenge, especially if you live in Witchaven.",
    "Yes, that's right, Player. That's exactly the right word. He is demanding. Wonderful, but demanding. That's why I had to take him to the Fishing Platform that time - he was just so demanding. Sometimes its just too hard for Caroline to cope when I'm away.",
    "Ah, well, nothing directly, but with all this new slug activity I am worries about a little girl in the village called Kimberly. She and Kennith became friends when her family moved to Witchaven, but then one day she lost his favorite toy train and now Kennith is obsessed with getting revenge. He would get quite...upset if I went to check on her, so I was wondering if you could go and make sure she is safe?",
    "Thank you, Player. I am, once more, indebted to you.",
    "Getting forgetful are you, Player? All I wanted you to do was to go and check up on a little girl called Kimberly who lives in Witchaven.",
    "Kennith?",
    "Player, you are so full of hate. THe villagers are doing great work. It is important that we all help.",
    "Kennith!",
    "Kennith is the best son ever!",
    "Hello!",
    "No! We must come and see Kennith, our wonderful son!",
    "Kennith will be pleased with us.",
    "Oh, Kennith! There you are! We were worried sick!",
    "Ah, I assume you've been our saviour once more? I don't know how things could have gone so terribly wrong. Kennith was just so powerful; We couldn't control him.",
    "I could see the signs. We can't let it happen again, though.",
    "We'll have to do what we intended all along: take Kennith back out to the Fishing Platform, Bailey knows how to deal with tricky situations and I think he might be good for Kennith.",
    "Thank you again, Player. We must go now, but you'll always be a hero to all of us, here, in Witchaven.",
    "I'm sure he's just tired; I'm going to take him home. Thank you, once more, Player."
  ],
  "Caroline": [
    "Everything is fine!",
    "So wonderful!",
    "Kennith!",
    "Isn't he wonderful?",
    "Kennith!",
    "Kennith!",
    "Kennith!",
    "Have you see our wonderful son anywhere?",
    "Oh, well, if that's what Kennith wants.",
    "Yes. Pleased."
  ],
  "Kimberly": [
    "W-w-who are you?",
    "Ah... The villagers keep k-k-knocking on the windows and chanting my name! I'm really scared!",
    "I d-d-don't know, I haven't seen them for a few hours. They said they were going out to meet the neighbours. There were also noises under the house - banging, digging - there must be m-m-monsters down there!",
    "Thank you! Actually, if you really mean it, will you come with me around Witchaven while I look for my parents?",
    "Oh, you're my hero! Okay, let's go! Wait...what's that noise...? There's something outside!",
    "Oh. Okay then... I'll just wait here and see if my parents come back.",
    "ACK! I'm scared! Can you get them to go away first?",
    "I know! Lock them in the church! The power of Saradomin is the only thing that can save their souls!",
    "Yes! And I'm not moving until you do.",
    "Lure them to the church and lock them in! The power of Saradomin is the only thing that can save their souls!",
    "No you have not, you big liar! They're still out there... I can hear them!",
    "Well done! I feel much braver now. Let's go to Kennith's house first to see if he has seen my parents.",
    "Come on! I'm sure Kennith will know where my parents are.",
    "Well, my parents have disappeared, so I was wondering if your might have seen them anywhere.",
    "Player! Player! Erm, do you hear something outside?",
    "Oh no, they're back! Can you get rid of them again? Please?",
    "I am not a wimp!",
    "Thank you, Player, you're my hero! Let's leave this horrid little boy and go see Ezekial. Maybe he's seen my parents.",
    "Hurry up! We've got to find Ezekial - he is our only hope.",
    "Okay, Player...",
    "My mum and dad have disappeared too!",
    "B-b-brutal? What will they do to them?",
    "Under my house?",
    "I'm scared...but you and Ezekial are the only ones who can find out what the villagers are doing down in those caves - so you have to go.",
    "Thank you, Player. Good luck!",
    "Oh, Player, please save me! It hurts!",
    "It was definitely in Witchaven.",
    "I think I was near Ezekial's house.",
    "I think I was playing around Mayor Hobb's house.",
    "Okay, Player, but please be quick!",
    "Then give it to Kennith! Hurry!",
    "Oh, Player, you're my hero! I won't forget what you've done for me."
  ],
  "Ezekial Lovecraft": [
    "Oh, hello, Player. It's nice to see you again. What can I do for you? Would you like some bait?",
    "How wonderful!",
    "Wait, not wonderful... The other one... Erm, terrible. Yes, that's it, how terrible!",
    "Very wise, but, pray, come back soon.",
    "Ah, yes. I have noticed things aren't quite as idyllic as they usually are in this lovely little town. Are you referring to the new slug activity?",
    "Oh my, that is terrible. Every child needs someone to care for them. I hope for everyone's sake that the slugs don't have them - they can be quite brutal...",
    "Not an awful lot; just that there is renewed mining work in  the shrine. If I'm not mistaken these new caverns lead right under little Kimberly's house.",
    "Absolutely! I could get you in - the slugs treat me as one of their own, after all. If you would like I can go ahead and talk to them.",
    "Yes, they seem quite receptive. You talk to them and I'll jump in if I think you need any help.",
    "Ahem, he means: Greetings, sister. How goes the work?",
    "Pray, may we see the glorious progress for ourselves?",
    "No. There are many others in this world that look similar - same hair, same clothes, same face. This one is our brother.",
    "An unfortunate deformation.",
    "Oh, Player, no one's ever called me an 'expert' before. You've made me very happy. Hang on, I'll go and have a look.",
    "Oh dear, this looks tricky. I don't think we can both go through - you're younger and fitter than me, Player, so I suggest you make your way through the next cavern and try to find a way to unlock the metal door over there. It's not going to be easy, though.",
    "Yes, it looks to me like those minecarts are high enough for you to crouch behind. I would recommend you use them as cover to hide from the villagers. It also looks like there is some weakness in the cavern's eastern wall, I've seen walls like it before - in my experience there is bound to be a tunnel behind some part of it, I know you're skilled in prospecting, so study the east wall until you find a section that is weak, then knock a hole in it with a pickaxe and escape through. Be careful, though! I don't think the villagers will take to kindly to seeing you in there.",
    "Thank you for letting me through. Now, let's move on to the next area - we need to find out what the sea slugs are up to.",
    "Kennith?",
    "Goodbye!",
    "This is tricky... very tricky. We know that slugs are not very fond of heat... What I suggest is that you look for an element called rubium in the walls of the cave. Prospect the red patches in the walls and you should find some. The interesting thing about rubium is that it reacts with water and, unless I'm very much mistaken, those are steam vents in the floor. So, what you need to do is mine some rubium and place a piece in each of those steam vents. It should cause a reaction and increase the temperature in the cavern, eventually overwhelming the villagers and making them collapse.",
    "Appearances can be deceptive... I have had many adventures in my time and seen many things.",
    "Oh, this should be easy for you. There is certain to be a rich source of rubium in these cave walls. Just find some and place it in each of the steam vents - that should be more than sufficient to knock the villagers out.",
    "Who are you?",
    "Ah...I...I think so.",
    "Player, there is something very bad going on here; strange forces are at work. You must go and check on the children! We know Kimberly is relatively safe, but what about Kennith?",
    "Go now; find Kennith, I'll stay here and tend to these poor sods.",
    "What's going on in... Oh my!",
    "Why has he got Kimberly? Is this still about that toy train?",
    "Everyone in Witchaven does! He was very upset, but this...this is madness! Player, you're going to have to find that train.",
    "You must find Kennith's toy train. That was the source of all his anger, so it can surely be the only thing that will pacify him.",
    "Very good. Now, give it to Kennith. Perhaps it will calm him down a little.",
    "Thank you, Player, but you did all the hard work.",
    "Not so good I'm afraid - they're refusing to leave the mines. Clive and Katherine are adamant that Witchaven isn't a safe place to raise a family.",
    "I wish I could believe that, but I don't think all this happened at the whim of a small, power-crazed child. There is something fundamentally wrong in Witchaven and it won't be addressed until the sea slugs are dealt with, once and for all.",
    "Well, maybe we can, I have a plan, but I need to stockpile rubium to carry it out. If you manage to collect any more rubium, come see me in my shop - I'll happily buy it off you. Be warned: as you've seen, it's dangerous stuff, so don't give it to anyone else.",
    "I could tell you, but then I would have to kill you.",
    "Kill you? No! I could never kill you, Player. You're my only friend. Anyway, you will see what I'm planning soon enough... Just be patient."
  ],
  "Katherine": [
    "MAKE IT STOP!",
    "The voices! Can you not hear them? THE VOICES! They're saying 'You must leave'; over and over!",
    "Yes! Is she okay? We're so worried!",
    "Did you say Kennith? Forget that nasty little brute, he's always bullying poor Kimberly.",
    "What's going on? We heard horrible noises!",
    "Didn't that yellow man say that Kennith was responsible for all of this? Is he hurting Kimberly?"
  ],
  "Clive": [
    "PLEASE!",
    "I'm Clive, and this is my wife, Katherine. Please help us - the villagers imprisoned us down here.",
    "We wish we could, but we're trapped down here! I can't control my body, it's like we're puppets!",
    "PLEASE! Is Kimberly okay?"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Kennith%27s_Concerns?oldid=33465608’"
  ]
}