{
  "Spirit [Girl]": [
    "...with...",
    "...Woo...",
    "...",
    "Father...trying to...but...need...help...",
    "...Beast is...souls...am very...must...so that...speak...will explain...",
    "...Later...the village...west...here...mountains...",
    "...come with...speak...there...",
    "...",
    "...",
    "...Wooo...woo wooo...wooo...",
    "...Woo wooo...woo...woo...",
    "...",
    "...village...the west...come...",
    "...With...",
    "...",
    "...Once...little village...come here...play...friends...we're here...from the...presence...devouring my...getting...need...help me...broken...",
    "...You...me strengthen...",
    "...The Beast...stuck...weak, broken...to wash...clean in...eternity...please fill...barrel...means of...",
    "Thank...",
    "...",
    "...Hungry...been in...years...miss the...good meal...snack...something...",
    "Please...something...anything...want to...taste of...",
    "Thank..",
    "...",
    "...Washed...but I...unclean...old rags...covered...stench of death...some new...wardrobe...can't get...",
    "...I need...",
    "Thank...have no...appreciate...help...",
    "...",
    "...Starting...stronger...there is...unbeating...doll...with me...behind after...in the...it back...stuck...horrid plant...",
    "...You...it back...",
    "Thank...this...be able...again...",
    "...",
    "...Plant...away...wait until...gone...doll...",
    "...Wait and...disappears...",
    "Thank you so much for your help!",
    "Yes, and it's all thanks to you. You helped restore my soul enough so that I can once again communicate.",
    "Sadly, no...this was just the beginning. But this is not the place to talk. Please, come with me back to the farm and I will explain in more detail.",
    "Thank you. By the way, my name is Summer."
  ],
  "Player": [
    "Hello?",
    "Can you hear me?",
    "Hmm, it doesn't seem like I can talk to her while she's stuck behind this barrier. The other ghost put it up around her, so maybe he can take it away again?",
    "Hello.",
    "Can you hear me?",
    "This Amulet of Ghostspeak doesn't seem to do any good here. It's as if he can't hear me at all.",
    "Hmm, I think he's actually trying to communicate with me using these gestures. He keeps shrugging to me, but he doesn't really seem indifferent or anything. He seems to want some kind of response from me.",
    "What's going on here?",
    "Who needs help? You? Your father? I don't understand any of this.",
    "I'm sorry, but I still don't understand.",
    "A village to the west, by some mountains?",
    "Okay, I will come with you to the village you're talking about.",
    "I have some things to do first.",
    "Can you take me back, please?",
    "Never mind.",
    "What's going on here?",
    "I'm sorry, but I can't understand you.",
    "What did you want me to do again??",
    "Okay, I will come with you to the village you're talking about.",
    "I have some things to do first.",
    "What is this place?",
    "This is all very confusing, but I think the most important thing right now is that I need to help you with something?",
    "What should we do now?",
    "Something about being stuck, a beast, washing something, and this barrel? I will do my best to figure out how to help you.",
    "I'll go see what I can do.",
    "Wow, that's strange. When I emptied the barrel in the real world, it filled up in here.",
    "What should we do now?",
    "Are you hungry? I would try to get you something to eat, but I seem to be very limited in how I can interact with this world.",
    "Okay, I will try to figure something out. There must be something around here you could eat.",
    "What should we do now?",
    "You need something out of this wardrobe?",
    "Okay, I may be able to help you out.",
    "What should we do now?",
    "I'm assuming you're talking about this dead, overgrown limpwurt plant and the doll that's stuck under it?",
    "You want me to get it back for you? I should be able to help you with that.",
    "What should we do now?",
    "We should just wait?",
    "Okay, I'll wait.",
    "Woah! You can talk?",
    "Oh, so that's what this was all about?",
    "Okay, I'll come along.",
    "It's nice to meet you, Summer. My name is Player. Now let's head back to the farm.",
    "I have some things to do, I'll come by later.",
    "Hello.",
    "Hmm. Not in a mood to talk, eh?",
    "I'm wearing an Amulet of Ghostspeak, you can talk to me.",
    "Oh, I see how it is. Could you at least tell me what's going on here?",
    "Hmm. He can clearly see me, but doesn't seem to be able to hear me at all. Maybe those gestures these two were doing to each other was their way of communicating?",
    "Who are you?",
    "That's horrible! You're just a little girl!",
    "Who would do such a thing?",
    "What exactly is going on here?",
    "...I...I am speechless...",
    "There must be something you can do? You can't let this go on!",
    "Of course, I will help you.",
    "So what can I do?",
    "If it's true what you say – that the Beast has been living off of your souls for hundreds of years – then it can't require much in ways of feeding. I know a bit about spirits and summoning myself, and concentrated energy from a completely fresh soul should be overwhelming to it. If the discs function the way Jallek thinks they do, then it might work.",
    "So, where are these discs?",
    "I see. Where can I find this altar?",
    "I'm sorry, but this sounds too dangerous.",
    "Fine, I will help.",
    "No, I can't help.",
    "Can you take me back?",
    "Actually, I have to go.",
    "Yes, I have.",
    "No, I'm leaving again.",
    "How do I do that?",
    "Eh...what does an altar eat?",
    "Hmm. Alright.",
    "Oh, okay.",
    "Okay, I'll do that.",
    "What should I do now?",
    "I must bring them souls?",
    "That doesn't sound right. In order to help you free your souls, I must give up others?",
    "No, I won't do it.",
    "Okay, I will do it.",
    "I better get to work, then.",
    "I will see what I can do with them.",
    "What was it I had to do again?",
    "Okay, I think I understand.",
    "Well, that takes care of that little problem.",
    "For now? What do you mean? He looks pretty trapped. And you can talk – that's got to be a good sign.",
    "I...I...was trying to help.",
    "Oh, Summer, I'm sorry. I did all I could, but seem to have only made things worse.",
    "I am so sorry, Summer. I had no idea I would only make things worse.",
    "I still feel bad, though. Is there anything I can do to make things better for you and your family?",
    "Thank-",
    "What is it, Summer? What is going on?"
  ],
  "Summer Bonde": [
    "Thank you for coming, Player.",
    "My name is Summer Bonde and I used to live here with my parents, Jennica and Erik, and the two farmhands, Jallek and Meranek. My mother died and the rest of us were murdered a long time ago – that's when we got stuck here.",
    "Yes, I had just turned six.",
    "I don't know who they were – a group of men. My memories are little more than a chaotic mess and I can hardly remember it anymore. My existence now is far worse than anything they could have done...",
    "Since we were murdered many hundreds of years ago, we have been stuck here with the Beast. As the world has decayed around us, our spirits have lived on in constant agony, as the Beast slowly sucks the power of life out of us.",
    "It refuses to let us go, and as we grow weaker, the pain only gets worse. The elders tell me it's growing stronger and stronger, and I fear the worst.",
    "I know, that is why I brought you here. My family and I are far too weak to go against the Beast. But you, Player, you are still strong, you still have your soul intact! Please, can you help us?",
    "Thank you so much.",
    "Many years ago, Jallek discovered a series of discs just outside the farm. He says that they can channel and concentrate the energy of newly summoned souls. He talked about how it could be used to imprison spirits in a strong surge of energy, so maybe we can use it against the Beast?",
    "This is great! We must get to work, then.",
    "They are hidden and asleep. We must first use the altar to awaken them.",
    "Follow me.",
    "Please, Player, you are our last hope. I can't take the pain anymore...",
    "Alright. Please don't be gone for long: we need your help.",
    "Have you come back to help, Player?",
    "Oh...",
    "You must wake the discs, Player.",
    "Can't you feel its hunger? The altar must feed.",
    "It eats the remains of those who have had the fortune to die...",
    "Well done, Player! The discs are awake now!",
    "Jallek said that the discs need newly summoned souls to work. You must bring them what they need, Player, and use the energy on the Beast.",
    "Yes, in order for you to use the discs' energy on the Beast, you must give up a spirit to them.",
    "The discs only need to borrow their energy to work. Please, Player, you must do this. We're so close...so close to finally being rid of the pain...",
    "Then all hope is lost...",
    "Have you tried activating the discs yet?",
    "The discs need newly summoned souls, so you must bring them what they want and give it to them so that they can harness the energy. This is the energy that the disc will use against the Beast.",
    "Player, you must activate the disc when the beast is also standing on it. Try luring it over with the soul.",
    "Player, you must give up the spirit to the disc before the Beast devours it, otherwise the energy is lost. But make sure that the Beast is still close enough to be hit by the disc's power!",
    "Don't listen to them, Player, you have strengthened our souls – the Beast may grow even more powerful, but so have we. It is better for us to fight it and lose than to exist in this realm forever.",
    "But at least we have tried! Unlike you, Player did not accept our situation, but tried to do something about it!",
    "We have waited for hundreds of years! We can't go on like this!",
    "You weren't always like this, Jallek! You also wanted to fight it!",
    "But we are stronger now, maybe strong enough to take it on!",
    "Argh! Why can't you understand that we must do something?",
    "No, Player, don't listen to them. They should not accept the agony they're in. You did better than they ever could have.",
    "Not right now, but I am sure we will need your bravery again. Here, take this ring. It once belonged to my mother, Jennica, but, since my death, it has gained a special connection with this realm. When I brought you with me, we passed through a portal connecting the realms. By operating this ring, you can use these portals without my help. It will only work where the connection is already very strong, though. While wearing it, you will also gain a closer connection to spirits in general, and you will find that the revenants who haunt these lands will be a bit more generous in what they leave behind.",
    "Oh no...",
    "Player, you must..."
  ],
  "Erik Bonde": [
    "...We...",
    "You see, the Beast has fed on our souls for hundreds of years... but our spirits were not strong...not like yours. The Beast could survive, but it took all this time for it to grow so powerful.",
    "Summer, I know you had good intentions but this really didn't do us any good. Our souls may be stronger for now, but only for as long as the Beast is trapped here. There is nothing we can do to it now and it will get loose-",
    "We have tried in the past and we have failed. You know this as well as we do. We had to remain patient and wait for an opportu-",
    "I'm sorry, dear, but we are too weak against the Beast. We can't do anything but wait, lest our situation becomes even more unbearable.",
    "Summer, please. What is done is done, and we will have to endure the consequences. But Player must still leave, or it will become worse."
  ],
  "Meranek Thanatos": [
    "We... thank you... brave adventurer. You... have lifted a burden. For now.",
    "Your presence here can only feed it. The Beast will rapidly become more powerful with every moment you stay here. We are grateful to you for your efforts, but your presence is endangering us all."
  ],
  "Jallek Lenkin": [
    "Unfortunately, things are not... that simple. Yes, we are strengthened, but your foolhardy desire to help a young girl could well have... unforeseen consequences.",
    "We understand...but please, if only for Summer's sake, leave this place. We already live in constant agony and now it will only get worse.",
    "Your father is right, Summer. We may have waited for hundreds of years, but only so that we could avoid another failure. A failure like this.",
    "That is true. But we have tried before and failed. I have realised that we must be patient if we ever want to leave this place.",
    "Only for as long as the Beast is trapped. As soon as it gets loose, it will start draining us yet again. And since it's now even more powerful, our torment will only be worse.",
    "Yes. Player, we do appreciate that you have tried to help us, but sadly, it was in vain. You must leave now."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Spirit_of_Summer?oldid=33527334’"
  ]
}