{
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "missing dialogue with clay golem, high priest of scarbarasYou can discuss this issue on the talk page or edit this page to improve it."
  ],
  "High Priest": [
    "Good day, [Player].",
    "I have grave news for you.",
    "Oh no, nothing like that. I have a corpse for you to identify. It came over from Menaphos for funeral preparation in the traditional fashion.",
    "No, no, it's not like that! In this case it's someone I think you might know. A strange-looking woman.",
    "It looks like it was once blonde rather than red, but has recently been dyed black. So, not a local, but someone who wanted to look like a local. More to the point, we found a note on the body saying...",
    "...saying to talk to you before embalming. In this heat, you're lucky we didn't just start without you. You should go upstairs and see if you recognise the corpse.",
    "Well, I'm shocked at your Scabarite-like habit of denying the existence of problems, but how can I help you otherwise?",
    "I haven't heard anything more since my people returned. Ask them, if you're curious about Menaphos.",
    "Good day, [Player].",
    "I'll meet you upstairs. I'd prefer not to keep this corpse waiting any longer.",
    "Here is the young lady whose corpse you are supposed to see. Go closer and see if you can identify her. If we know her name, Icthlarin's blessings will come to her faster.",
    "I was afraid that might be the case. I suppose we should start the embalming process with all haste. Until it is complete we can't be sure that her spirit is at rest. Indeed, I have a feeling as if her spirit could be in some great anguish.",
    "I wouldn't have thought so. The process of embalming is extremely grisly. I will have to replace her internal organs with herbs, spices, and resin. It's certainly not a job for an amateur. I'll start with the brain...",
    "It's a disaster! Icthlarin promotes peaceful death.",
    "I'll be defrocked for promoting revivification! Woe is me!",
    "I'm not sure what that means but it sounds promising.",
    "Why couldn't you just be dead? The youth of today are always causing trouble.",
    "I can tell when I'm not wanted. I shall leave you two to your delightful reunion.",
    "Good day, [Player].",
    "Did you talk with that odd woman?",
    "I'm pleased that she realises my importance.",
    "Good, good. But why would I be upset? I pride myself on my humility and pleasant nature.",
    "I heard from some so-called archaeologists who were investigating to the east that there might be Scabarites. I have no qualms about you sending them to Icthlarin's deathly care. However...",
    "I must remind you, before you do so, that the Scabaras religion has a very useful, specific reason for existence. Should you run into the High Priest of Scabaras, try to pacify him rather than just brutally slaying him. I'm sure that this is all just some sort of misunderstanding and that we can eventually have peace.",
    "Well, anyway, those archaeologists headed east. I'd leave in that direction if I were you.",
    "Good day, [Player].",
    "How can I help you?",
    "Excellent! This is good news, indeed.",
    "Hmm, I will teach you how to make an enchanted water tiara, by using water runes with a water tiara it will protect you from the fierce desert heat, as you have protected the desert from the fierce Scabarites.",
    "Good day, [Player].",
    "How can I help you?",
    "Of course. We Menaphites are believers in many gods. I, in my position as head priest of Icthlarin, still give praise to Tumeken and Elidinis each day at this very altar.",
    "No need for thanks. Sadly, this view isn't taken by all Menaphite sects.",
    "It seems that your foray into the depths has stabilised the situation below. In my prayers, Icthlarin has expressed his pleasure.",
    "You misunderstand the way in which the desert deities interact with us mortals. Icthlarin has blessed us with a peaceful afterlife, thus we serve him loyally. It is not our place to pester him with outside influences.",
    "Have you not learned anything from the trouble with Scabaras. He was influenced to act in this world and disaster befell him and his followers, and all those who came into contact with them.",
    "The Devourer is different. Her place is to interact with us poor mortals, or at least it is now. She has changed, and for the worse. We here are grateful that Scabaras did not fall so far and so permanently as the Devourer.",
    "I have taught you how to make an enchanted water tiara, by using water runes with a water tiara. This will protect you from the fierce desert heat, as you have protected the desert from the fierce Scabarites.",
    "It is, indeed, that simple. Though, you will use up any and all water runes you try to combine the tiara with. You should also note that you can only have one such enchanted water tiara at a time and that you require at least level 50 in both Magic and Runecrafting to create such a tiara.",
    "You will discover that by destroying your enchanted tiara, the enchantment will fade. This will free your water runes for whatever other purposes you might have.",
    "I haven't heard anything more since my people returned. Ask them, if you're curious about Menaphos.",
    "You already have a lantern; greed isn't good, you know.",
    "I'm afraid you have benefitted all you can from these lamps.",
    "Certainly, though try to be more careful with this one."
  ],
  "Player": [
    "Greetings, cleric.",
    "What news? Sophanem and Menaphos are to be reunited at last?",
    "What? I haven't killed anyone! Well, no one important... ...not recently, anyway... ...at least, I think... Err...",
    "With red hair?",
    "Saying?",
    "Can't we talk about happier things?",
    "Is it okay if I pray at your altar?",
    "How are things?",
    "Is there anything I can do for you?",
    "Any word from Menaphos and the slaves?",
    "Could I have another lamp?",
    "Greetings, cleric.",
    "Are you sure I should know her? She doesn't look at all familiar, to be honest.",
    "Is there anything I could do to help?",
    "It's a miracle! She lives!",
    "But this young lady can go on to enjoy a rich and fulfilling life.",
    "You are the High Priest. Just exert your religious prerogatives on your minions.",
    "Maisa?",
    "I know it's an obvious question, Maisa, but what is going on here? Why were you dead? And... did you have to be so rude to the priest?",
    "Why are you here?",
    "Yes?",
    "Ask away.",
    "How does that help us to gain revenge?",
    "I see. So, you want me to look into these tunnels?",
    "Now, that's the sort of task I can relate to.",
    "Why did you pretend to be dead?",
    "I suppose his job makes him plenty of enemies.",
    "Up to no good, you say?",
    "How did you get here?",
    "What has been going on since we last met?",
    "No news as to when Menaphos might be opened up?",
    "What do you say, though?",
    "I suppose I won't carry on asking about current affairs, then.",
    "Actually, I don't have any more questions.",
    "Greetings, cleric.",
    "I did, and she suggested I talk to you about the mission she gave me.",
    "Well, it's certainly the case she didn't want to upset you.",
    "Well, would you object if I were to slay a bunch of Scabarites to the east?",
    "What's the catch?",
    "I'll be sure to take into account your naively optimistic reading of the situation.",
    "Hello.",
    "I'm [Player]. What are you doing all the way out here?",
    "So, why are you down here and not up there?",
    "How on RuneScape did you get down the cliff face, then?",
    "I'll see what I can do.",
    "Hello, Simon.",
    "How's it going?",
    "No, I haven't.",
    "I will. Goodbye, Simon.",
    "I'm just exploring, really. I've been asked to find a way into the areas beneath this region. Perhaps you could help?",
    "Wily folks cannot outsmart me. What is it you need?",
    "I've had dealings with this sort before, feel free to test me.",
    "I'm not quite ready for this test, whatever it might be.",
    "What exactly is it he wants again?",
    "Well, the golden Agility Pyramid artefact and the ten gold objects from Pyramid Plunder are obvious enough, but what about the bronze antiquities?",
    "Distress?",
    "Is there any other way?",
    "So, I just hand the items to you?",
    "So, what should I do if I lose the crate?",
    "Indeed, I am.",
    "Not really. I just wanted to say 'Hello', which I now have.",
    "I'd like to talk a bit about archaeology.",
    "Some archaeologists asked me to deliver some artefacts to you.",
    "I'd like to supply some gold objects from Pyramid Plunder.",
    "I'd like to supply a golden Agility Pyramid artefact.",
    "I'd like to supply a crate of bronze antiquities.",
    "I've nothing to give you right now, but I have some questions.",
    "What do you know of other archaeologists in this area?",
    "Dodgy?",
    "Why would Varrock stop the money?",
    "Quite. I have some more questions.",
    "Who are you selling all these items to?",
    "Slippery?",
    "So, who do you sell to now?",
    "I have some more questions.",
    "What do you know of underground areas to the east?",
    "So the Scabarites are new arrivals there?",
    "Cash for what? There's nothing to spend it on out here in the middle of nowhere?",
    "I have some more questions.",
    "Actually, I'd like to change the subject back to business matters.",
    "Glad to be of service.",
    "Err, right.",
    "About that little job you mentioned...",
    "No, I haven't.",
    "I'd rather talk about your fine artefacts a bit more, on behalf of a... friend.",
    "My, umm, business associate, Simon Templeton would like to inspect some of your artefacts.",
    "I'm sure he's a reformed man, now. All he wants to do is have a look.",
    "I'm not sure which is more irritating: running out of drinking water all the time or being subjected to this humour.",
    "Taking your loot will be heaps more pleasurable after suffering through that pun.",
    "About that little job you mentioned...",
    "I talked to the mummy in Sophanem.",
    "No good news, for sure. Wait. What? She? I always assumed it was a man under those bandages.",
    "That joke stinks worse than those bronze 'antiques' I delivered to you.",
    "And the mummy has more loot plundered and ends up even more miserable. I see your cunning plan. It also makes me wonder, would your client for those artefacts be anything to do with a bank, by any chance?",
    "I have some more questions.",
    "Actually, I'd like to discuss business matters.",
    "Indeed. He supplied me with a receipt for the transaction. Here it is.",
    "Okay, what now?",
    "What materials and which denizens?",
    "No, I don't seem to have it yet.",
    "Indeed, I have performed an amazing selection of tasks for you. Hint, hint.",
    "That's great!",
    "But what is the key for?",
    "Fascinating, professor, but why haven't you used that key?",
    "Hello there, golem.",
    "I can't be sure about anyone else, but I am certainly alive. What is this place?",
    "I must admit that I haven't heard of it before. What is in these stores?",
    "That sounds about right for Scabarites. They like their peace and quiet. So, how can I get through?",
    "Sounds simple enough.",
    "I would like information on some of these levers.",
    "The room with the narrow walkway.",
    "The empty room with the huge lever.",
    "The room with the huge scarab.",
    "The lever near the mysterious box.",
    "I'll deal with this later.",
    "I want more details of what lies beyond the doors.",
    "Moving obstacles?",
    "I'm not exactly engineered, but I suppose I'm tough and all that.",
    "I am ready for you to operate the levers.",
    "I'd like the empty room with the huge lever set to the highest power level.",
    "I'd like the room with the huge scarab set to the second highest power level.",
    "I'd like the room with the narrow walkway set to the second lowest power level.",
    "That leaves the room with the mysterious box set to the lowest power level.",
    "I'll deal with this later.",
    "I'll deal with this later.",
    "Hello there, golem.",
    "Hello there, golem.",
    "So, you can't offer any more useful information?",
    "I see.",
    "Prepare yourself, creature of evil. I am here to vanquish you!",
    "I'm not here to contemplate. I'm here to slay!",
    "I do not fear your pathetic beetle-brained magics.",
    "Your scabby battle skills are no match for mine.",
    "You couldn't shoot an ogre from two paces, you biological impossibility.",
    "In that case, I shall not fight you. I bow to your superiority.",
    "Why did you cease your contemplation?",
    "Conversion, eh? Let's hear your persuasive tongue, err, mandibles in action, then.",
    "I sense the hand of the Devourer in this. Am I correct?",
    "I do not fear your pathetic beetle-brained magics.",
    "Your scabby battle skills are no match for mine.",
    "you couldn't shoot an ogre from two paces, you biological impossibility.",
    "In that case, I shall not fight you. I bow to your superiority.",
    "Holy? This place has a stench of unholiness. It's worse than the dung.",
    "By all the deities, what is going on here?",
    "I sense the hand of the Devourer in this. Am I correct?",
    "Sounds like the Devourer dragged you into heresy for her own ends.",
    "In that case, I shall not fight you. I bow to your superiority.",
    "I'm getting a terrible feeling of deja vu. Am I going as insane as the High Priest?",
    "I am here for vengeance! Kaleef died, and now so shall you.",
    "Don't you remember? We were just talking before you assaulted me?",
    "You seem to be rather confused. Can you think clearly now?",
    "Is that it?",
    "Wait, one last thing. What can you tell me of the ways of Scabaras?",
    "Do you have any insight to share with me?",
    "Is that it?",
    "I have penetrated deeply into the cave system and discovered a temple inhabited by the High Priest of Scabaras!",
    "Greetings, cleric.",
    "I met with the High Priest of Scabaras, fought him, talked with him and made him see sense. He has vowed that the followers of Scabaras will no longer be a cause for alarm in Sophanem.",
    "Since Maisa isn't here, might you be able to give me some sort of reward instead?",
    "Greetings, cleric.",
    "Is it okay if I pray at your altar?",
    "Thanks, you've a very enlightened approach to this.",
    "How are things?",
    "You can talk with Icthlarin? Can you ask him anything you want?",
    "He won't help you directly, then? That makes him just the same as the deities bound by Guthix's laws.",
    "Point taken, I suppose, but what about the Devourer?",
    "Can you tell me again about this enchanted water tiara?",
    "So, I just use some water runes on a water tiara?",
    "And if I want the water runes back?",
    "Any word from Menaphos and the slaves?",
    "Could I have another lamp?"
  ],
  "Maisa": [
    "Uuurgh... Don't pull my brain out... I still need it.",
    "Would you two argue more quietly. I'm not feeling so good here.",
    "Can't you just let me recover? Those cadavaberries aren't exactly good for the digestion. Plus, I have a terrible headache, my clothes have been ruined and this priest is gibbering like a loon.",
    "Excuse my vagueness, but I have just awoken from a drug-induced stupor. Could you limit yourself to one question at a time?",
    "Well, you know that my partner, Kaleef, was slain below the city by those foul Scabaras creatures.",
    "Since then, I have been researching how to take my revenge upon the. I think I may have a lead or two, now. Unfortunately, I have other jobs to do, so I have to ask you a favour.",
    "I have learned that there is a quite extensive tunnel system above the area we investigated, though quite why this is, I am not sure. What I do know is that the entrances near here have been sealed up for ages, probably because of the Scabarites.",
    "Not in the slightest. What may be useful is that I have also discovered there are tunnels leading from the east coast of the desert into those below Sophanem.",
    "Oh, yes! Then kill anything that looks even a tiny bit like a beetle!",
    "I suppose you should talk to the High Priest of Icthlarin first, though I wouldn't want to cause too much of a diplomatic incident. I don't want my job to be harder than it is already.",
    "Well, as you know, passage between the cities is still rather restricted and I'm not exactly keen to be searched, prodded or investigated too closely. Our mutual friend's agents aren't exactly popular here.",
    "More his personality. He sent Kaleef to his doom without a single qualm. He's up to far more bad than good. I sometimes regret having made my vows to the service of Al Kharid.",
    "I'm still loyal to Al Kharid, if not the big 'O', so I'll not speak any more. In fact, it is better you forget even what little I said.",
    "I pretended to be dead by using a cavadaberry[sic] potion.",
    "Not much that I can tell you, in reality.",
    "Well, some say that the Pharaoh is intending to make the town more self-sufficient, which might be a sign that he is aiming for more, rather than less isolation in future.",
    "I say what I'm told to say, which in this case is very little indeed."
  ],
  "Simon Templeton": [
    "G'day, mate. I'm Simon. Simon Templeton. Who are you?",
    "I've been contracted to retrieve artefacts from the top of this magnificent pyramid.",
    "Well, it's me back... an old injury I picked up in Sophanem has come back to haunt me. I was working for Varrock Museum, but the gold they gave me wasn't even enough to pay for the carpet rides, let alone any decent equipment. But that was a long time ago... I can't even lift a chisel right now. There's no way I can climb all the way up there.",
    "That's what set off the injury. I was fine before I scrabbled down that pesky slope. It will be a while before I can climb back up again. I must be getting old. Hang on a second. You look like you're pretty agile and up for a challenge. How about you retrieve them for me? I'll tell you what. I'll give you 1,000 for every artefact you get for me.",
    "Good on ya, mate!",
    "G'day, [Player].",
    "Got any Agility Pyramid artefacts for me?",
    "Try harder, mate! It won't be long till some other critter turns up and snatches them out from under your eyes.",
    "Bye, cobber.",
    "Shoot away, sport.",
    "Righto. Thought they'd never be able to fill that order. Not the brightest knives in the old armoury. You have not yet supplied the ten gold objects from Pyramid Plunder in Sophanem, the golden Agility Pyramid artefact is still required and the crate of 6 ancient bronze plateskirts is still missing.",
    "They're all a bit dodgy, if ya gets me drift.",
    "Them blokes in Varrock just put out the call for researchers, half trained 'em then ran out of cash. Left a load of folks about as angry as a barrel o' crocs. Young, angry and poor makes a fella dodgy.",
    "They made all them fancy doodahs in the museum, for one. Bet they didn't come cheap. Then there's some island expedition they were planning – reckon that sucked up a load of cash, too. Anyways, it does mean more folks willing to sell – so silver linings, eh?",
    "Shoot away, sport.",
    "Well, it's not that Osman – I can tell ya that much. Don't be having dealings with him; he's a slippery customer.",
    "He was always after documents – new, old, fake, authentic. Claimed it didn't matter to him. Was obvious that royal history was what got him all excited, though. Now, what's a man like him wanting with that sort of information? He's not some fancy librarian, just some sort of lackey. He musta guessed I was onto something, so he cut me out cold.",
    "Are you daft or what? I'm a middleman, a fixer – if I tell you that I'll be cutting me own throat. We'll talk about other stuff.",
    "Shoot away, sport.",
    "A bit of this, a bit of that. Those ruins are older than Sophanem and Menaphos, for sure. Pulled some documents out before them creepy crawlies took over.",
    "Seems so, but don't ask me why. All that research stuff is ancient history to me, now... if ya pardon me pun I'm just gathering cash and that's it.",
    "C'mon, sport. You know me better than to stick your snout where it might end up sliced off. Ask no questions, hear no lies.",
    "Shoot away, sport.",
    "Thanks, mate! You have not yet supplied the ten gold objects from Pyramid Plunder in Sophanem, the golden Agility Pyramid artefact is in my possession and the crate of 6 ancient bronze plateskirts is still missing.",
    "Thanks, mate! You supplied the ten gold objects from Pyramid Plunder in Sophanem, the golden Agility Pyramid artefact is in my possession and the crate of 6 ancient bronze plateskirts is still missing.",
    "Thanks, mate!",
    "Great! Now, I have everything I need for me latest deal. Here's a receipt so you can tell those ne'erdowells you done the business.",
    "Nice fakes, too. They'll fool the customer...but don't try it again, eh?",
    "I have another little job for you if you're willing. Just come and talk to me about the artefacts when you get the chance.",
    "I can't remember whether I asked you to do this yet – mind like a sieve, I have – but have you ever talked to the Pyramid Plunder mummy in Sophanem about me?",
    "Well, that's what you can do for me. Ask him if he'll let me have a quick shufty at some of his relics. I think I may be able to cut him a deal.",
    "I take it she was no use. You look as dismal as a croc with toothache.",
    "Was your mummy a man? He, he, he.",
    "Jokes aside, you've been a good sport. As a favour, from now on, I'm willing to take bank certificates of any objects you get from that miserable mummy's Pyramid Plunder. Well, any but the gold ones, that is – you might be tempted to take stuff if there's a profit involved, as we both know.",
    "Curiosity... Cats... Need I say more?",
    "Shoot away, sport."
  ],
  "Lead archaeologist Abigail": [
    "Greetings, wanderer. Is there any particular reason you have come to visit our humble camp?",
    "Hmm, well, we might be able to help. Even though your appearance isn't quite that of a professional researcher, we have need of someone to perform some business with a wily dealer in artefacts. In return, we'll help you out.",
    "We need you to talk to a certain Simon Templeton but, first, we require you to prove your mathematical competence.",
    "As a general rule, always round down to the nearest whole number. So, 17 divided by 0 would equal 1 in this trial. Firstly, tell me which is the largest of these three numbers. If there is more than one possible answer, just tell me one of them.",
    "Incorrect, incorrect. When you're ready, we'll have to start again.",
    "Great, great. The final answer was [number]. I wonder if it has any significance... I'll give you a few minutes to relax, then we can deal with the matter of Mr. Templeton.",
    "Hello there, Player. So, you are ready to head off to Templeton for us. Good, good.",
    "He wants 6 ancient bronze plateskirts.",
    "Also, you still need to deliver one golden artefact from the top of the Agility Pyramid and ten gold objects from Pyramid Plunder in Sophanem.",
    "These are more of an issue, but we have a plan. You take modern bronze items, distress them, then pass them on to Simon as antiques.",
    "It's the technical term for making a new object look older. You can do it with some camel dung. Just rub it into the object while under the hot desert sun and it'll be done in no time.",
    "We could distress the items for you; however, we are not skilled enough to do it quickly, so this would take some time.",
    "My assistant will supply you with a crate when you have space. Either distress the items and add them to the crate yourself, or fill it with new bronze items and hand it to my assistant, along with a bucket of dung.",
    "Here, take this crate. Either distress the items and add them to the crate yourself or, if you can't do it yourself, just add the new items to the crate instead. My assistant can then distress the crate of new items for you, but it will take some time and you will also have to give him a bucket of dung.",
    "It seems you've obtained a crate. Either distress the items and add them to the crate yourself, or fill it with new bronze items and hand it to my assistant along with a bucket of dung.",
    "I'll not think very highly of you, for one, but if you need another crate, just ask my assistant for a replacement.",
    "It seems you have found Simon Templeton and dealt with business matters. Or maybe you lost all the trade items, were waylaid by bandits or suffered from some other mishap?",
    "Excellent, excellent. Our finances are at least secure now. I just need a little more information from you.",
    "We just need some research materials to be going on with, which are almost certainly possessed by the local denizens.",
    "Just gather four bits of information from the local area and copy them into this nice journal. Killing anything other than crocodiles should do it – so, mummies, zombies and skeletons.",
    "Have you gathered that research material we were after?",
    "It vexes me to say this, but hard luck. Come back with it and we can deal like businessmen.",
    "Great! It seems you have gathered some initial research materials.",
    "Excellent, excellent. I can reward you with a summary of our theories on the area and a key.",
    "It was manufactured after research upon a locked door in the ruins to the north. Every indication we have is that the door leads down into the tunnels you are seeking. I must warn you that entering these ancient tunnels is likely to expose you to who knows what ancient diseases, hostile creatures and, very likely, death of a most distressing nature.",
    "Oh, and valuable loot and information, of course. Yes, heaps of loot. Here's the key.",
    "Frankly, I'm a coward. I am after knowledge, not a ghastly death recorded on a makeshift grave. Here is the key. May it bring you fame, glory or whatever.",
    "Hello again. Have you any news of the underground areas?",
    "You found the High Priest of Scabaras? No doubt, this has significantly increased your knowledge.",
    "Sadly, you'll need a few more entries in your notebook before I can reward you. Our customer is very specific regarding his needs."
  ],
  "To distress objects": [
    "you will need a Crafting level of at least 60, be under the hot sun of the desert and have some camel dung."
  ],
  "Assistant archaeologist Kerner": [
    "Hello there. Are you here regarding crates for storing antiquities?",
    "Here you are. My boss will tell you what to do with it. I'm just here for the dull work, it seems.",
    "You already have one. You've no need for another."
  ],
  "Guardian mummy": [
    "Oh, really. What exactly is it you want to know?",
    "What? His effrontery knows no ends. Did he inform you that the last time he was here he tried to make off with some of my bandages? He claimed they were useful in some sort of cure for his injuries.",
    "Never. He'd sell his own mummy for a profit. Tell him that if he ever comes back here, he'll be wearing my bandages alright... around his neck... tightly!",
    "One might call it dry humour..."
  ],
  "Clay golem": [
    "Greetings. It has been some time since I saw a real human. I thought, perhaps, you were all dead.",
    "This is the entrance to the storehouses of Ullek, not that I expect Ullek exists any more.",
    "At the moment, an infestiation of not-human humans. They have altered the locking mechanism on the doors here. It is hard for anyone, even them, to get in or out.",
    "If you stoke up the furnace opposite I will be able to allocate power to each of the four levers in the next rooms. If you can pull all of these levers in short succession, then the doors should open.",
    "Well, if you are ready to begin, you could ask me to allocate power. I can allocate the most power to start with, then less, then less still, until the fourth lever will have very little power allocated at all.",
    "In past days, the mechanisms were somewhat more reliable.",
    "Which lever are you interested in?",
    "Applying power here will cleanse the greasy pipe with a jet of steam, making it simpler to cross to the lever. The more power, the more steam and the simpler it becomes. I imagine Agility will be useful here.",
    "Applying power here will loosen the lever mechanism, making it easier to operate. The more power I apply here, the easier it will be to pull the lever. I imagine Strength will be useful here.",
    "Applying power here will cause steam to damage the huge scarab guarding this room. You must then follow up and defeat the creature. If you defeat it but leave this area before pulling all four levers, another scarab guardian will take its place. I imagine combat skills will be useful here.",
    "I'm not really sure what is going on here, but I suspect that the more power I apply, the longer the mechanism will be active for. This was added by the current inhabitants, so I know no more. The creature who added it did seem as if he were a stealthy, skulking sort, so I imagine Thieving will be useful here.",
    "Storage rooms and a huge cesspit. At least, that was the case several hundred years ago. Now, I couldn't say for sure; although, with the way the mechanical systems have been altered, I would logically deduce that there might be moving obstacles as well.",
    "Large bits of metal combined with toxins and plague sources. Nothing to worry about if you are as well engineered as me.",
    "I'd say you have a 1 percent chance of suffering some vile fate, but that may be acceptable to you.",
    "I'm afraid that you'll need to stoke the fire.",
    "Note that if you don't finish setting the power levels all in one go, you'll have to restoke the furnace.",
    "Very well. Where should I apply the most power?",
    "Hello again. Do you wish to attempt this trial or do you have other questions?",
    "I see you have activated the doors. Now, my purpose is fulfilled.",
    "I was not programmed to have any further function."
  ],
  "High Priest of Scabaras": [
    "Aha, a potential convert. Welcome to this holy place of contemplation.",
    "I was expectant of this reaction. You will perish by my magic, battle prowess and skill with projectiles. I am superior in every form of combat, from my years of solitary meditation.",
    "Your soft skin with be pierced by my chitin.",
    "You may follow Scabaras by taking a vow not to indulge in conversations. Unless you are converting or slaying the one with whom you converse. Now, convert or be slain.",
    "You dare equate the smell of dung with stench? Your vile blasphemies shall be punished!",
    "The Church of Scabaras is taking a more active approach with its beliefs. Our long-term solitude will be improved by short-term contact, and purging, of those who do not follow our ways.",
    "I have discussed this with her representative, yes, and sage advice was given. Advice that I should destroy you before you sought to drag me into your world of interaction.",
    "I am the High Priest of Scabaras! Accusing me of heresy is... is heresy!",
    "A wise decision. Turn to the ways of Scabaras and you shall have power.",
    "I care not for this Kaleef; I will defend myself!",
    "Aha, a potential convert. Welcome to this holy place of contemplation.",
    "Not that I remember. I can't see why I would forget such a thing, though. Aren't you some sort of outsider? Are you sure you are not here to be converted?",
    "What happened? Why am I here? These questions are not rhetorical.",
    "It does seem to be coming back. Be assured, we followers of Scabaras will not bother you further. Be warned, though, that we will still defend our nest if attacked.",
    "You may tell the High Priest of Icthlarin that we vow this by Scabaras. Now, as my religion dictates, I must be alone.",
    "Be assured, we followers of Scabaras will not bother you further. Be warned, though, that we will still defend our nest if attacked.",
    "You may tell the High Priest of Icthlarin that we vow this by Scabaras. Now, as my religion dictates, I must be alone."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Dealing_with_Scabaras?oldid=36119904’"
  ]
}