{
  "Larry": [
    "Ah, good. I knew you'd hear my mental anguish and come help me! The penguins are beginning their invasion! The time to act is now!",
    "The other zookeepers put me in this jacket to 'protect myself'. Ha! They're the ones who need protection. I'll explain everything if you promise to help me. You're the only one I can trust; will you help me?",
    "Keep your voice down! The other zookeepers don't know I've escaped from my cage. I'm going to hide out here, while you get proof that I'm not crazy!",
    "Listen to me! I went on holiday to do some fishing. My therapist said it would calm my nerves. Anyway, while I was fishing, a GIANT penguin surfaced out of the water. I ran away to alert the local authorities, of course, but by the time I returned with reinforcements, the penguin was gone. They handed me over to the zookeepers, and that's how I ended up in this jacket.",
    "I was at the coast of Witchaven. The atmosphere there is so calming.",
    "They're not crazy! I felt right at home there. I feel the locals and I connected on many levels.",
    "Besides, slugs aren't a threat, penguins are!",
    "What are you muttering about slugs for? We're dealing with a REAL penguin threat here!",
    "WAIT! Before you go, can you scratch my nose? It's been driving me insane. But not literally.",
    "What are you doing here? Go to Witchaven and prove I'm not crazy!",
    "Of course I wasn't kidding! I don't have a sense of humour. It was the scariest thing I've ever witnessed. It beached on the shore, then righted itself and walked towards me. I ran awa... I mean, I went for backup, so I don't know what happened to it after that.",
    "It moved a great deal like your penguin suit. I think they've taken that technology and modified it to make a giant submersible penguin. A pengmersible, if you will.",
    "It doesn't matter what it's called. Can you prove to the zookeepers it was there?",
    "You have to believe me, Chief. Listen to him, he went to Witchaven and found conclusive evidence that peng... that something happened there.",
    "SEE! I told you they were up to something, and now you've seen proof and you have to believe me. I think we should take action against those penguins in the zoo first, Chief; you know I've been saying for years that they're spies and they are a danger to the community...",
    "Okay, [Player], just let me slip into something more comfortable and we'll be on our way. Aah, that's better. Now I can scratch my own nose. We must go to the Iceberg and discover what the penguins are up to. We need to gather information about this giant underwater penguin.",
    "I have an errand I need to run first. You've travelled there enough to do it on your own now. Just take the boat from Rellekka. Remember, it's near the rock crabs. Oh, I nearly forgot! Remember to bring your penguin suit with you. What good will you be as a spy if you're not dressed for it?",
    "Let's begin our espionage. I hope you brought your penguin suit with you?",
    "Good. Then we can begin. Your mission is a vital one. Now that we know we're dealing with some sort of submersible vessel, we need as much information about it as you can find. But, most importantly, we need to know how to stop it.",
    "What good could come of the penguins having a submarine? No, our first priority is to disable it, then perhaps destroy it. To summarise, in case you weren't paying attention while spouting your penguin sympathies: We need to know where the submarine is, how to board it, and how to sabotage it.",
    "Improvise! Explore and ask questions. I'm sure you'll find it out somehow. Now, are you ready to be a penguin?",
    "Well, you'd better go retrieve it then, shouldn't you?",
    "I know it couldn't have been easy for you. But sometimes these things must be done for the greater good. Now you just need to find out how to sabotage the sub and where its last known location was. I don't suppose the captured penguin knew?",
    "Try speaking to penguins around the base. Find out what the gossip is, you may be able to piece together useful information from that.",
    "Fascinating. The penguins are getting more aggressive and resourceful.",
    "What could they want? They're dwarves, so I suppose they might want beer. I would, if I was kidnapped by penguins.",
    "No, I can't cast the spell from that distance. I can't maintain it for more than one person, anyway. Dwarves are pretty short. They're not as small as penguins, though – I don't see how wearing a penguin suit would disguise them enough to escape.",
    "Well, who am I to stop them from trying to escape? Since they're larger than your average penguin, you'll need more silk than usual. In fact, I think you'll need about eight silk pieces in total. But you won't need the clockwork inside the suit, so you won't need to make it at your house. Just take the eight silk, four wooden planks, a needle and thread to the dwarves. Then you can show them how to make a suit.",
    "Well, let's get on with it, then. Are you ready to be a penguin?",
    "How are we doing? Have you found out more about the submarine?",
    "Yes, but now the most important part: Where is the submarine? You need to find out its last known location. You said the KGP agent told you they could track the sub's location. They must be receiving transmissions somehow, and that means there will be a paper trail.",
    "That's always a possibility. The penguins would double-cross each other, but they may have other devices that simply send coordinates to them. For all I know, they're tracking us. It's a risk we have to take, doing this line of work. You need to find out where the penguins are getting their information about the submarine. Maybe that rather ill spoken penguin would know. You know, the one who made you that fake ID, what was his name? Poodle?",
    "Well, let's get on with it, then. Are you ready to be a penguin?",
    "How much in debt? A couple of thousand coins shouldn't be hard to work off.",
    "Really? Well, it's for the benefit of everyone, if we manage to stop this submarine. Besides, maybe it won't be so bad. Now, go find out where the submarine is. Well, let's get on with it, then. Are you ready to be a penguin?",
    "Really? Let me see it!",
    "Ha ha! We've got them now. But we must hurry, we can't miss this chance at getting on the submarine. Make sure you bring everything you'll need on the submarine, and meet me on the coast east of Yanille!",
    "Well we're not going any where till I see it! How do I know you didn't find the location of their next shipment of fish or something?",
    "Well, now you embark on an exciting adventure. Enclosed spaces, surrounded by enemies, trapped under hundreds of feet of water. No, I don't envy you one bit.",
    "That's what I'm here for! To remind you of the impending doom you face! Now then, do you have everything you need?",
    "Good, good. I'm, um, going to hide when you do the call. I don't want to see that... I mean, be seen. Yes, I don't want to be seen by it and give away your secret. We'd better get you into that penguin suit. Are you ready?",
    "Maybe there's something different. Did the captive penguin look different in any way?",
    "Mumble mumble mumble MUMBLE!"
  ],
  "Player": [
    "Larry, what are you doing in that jacket? What's going on?",
    "Okay, I'll help you. Although I think this jacket suits you. It brings out the colour in your eyes.",
    "I'm not sure proof of that exists, Larry.",
    "Where were you when this happened? Maybe I could investigate the area and see if there's any physical proof of the penguin. Or any other witnesses.",
    "You went on holiday to Witchaven? Larry, they're all crazy there! There's some weird breed of slug and...",
    "You went on holiday to Witchaven? Not exactly a holiday hot spot. I dealt with this slug problem they had, not long ago...",
    "If you say so, Larry. I'll go investigate and see if I can find a way to prove you're not insane.",
    "No.",
    "Alright, already. I'm going, I'm going.",
    "This is a massive footprint! It's got three claws... I think it's a penguin-like footprint. Larry wasn't kidding when he said a 'giant' penguin. I better go tell Larry that I've found proof he isn't crazy!",
    "I need to tell Larry what I've found here. Maybe it will convince the zookeepers to release him.",
    "Hello there.",
    "This is going to sound rather peculiar, but have you seen any penguins around? In particular, a rather large penguin?",
    "About the penguin...",
    "I think not.",
    "I know this sounds odd, but have you seen a gigantic penguin around here?",
    "The penguin? No, I can't. That's why I'm asking if YOU saw it.",
    "What light?",
    "Oh, you mean the sunlight.",
    "A friend of mine was here on holiday a little while ago. He used to be a zookeeper in Ardougne. He said he saw something truly odd, I don't suppose you know.",
    "About the penguin...",
    "I think not.",
    "Err, no. Never mind, I don't need anything. What was I thinking? I need to talk to Larry first.",
    "No, I said hairy. Monkeys are hairy.",
    "I've seen a footprint! It's huge, you weren't kidding when you said a 'giant' penguin.",
    "What could it be? It can't be alive, there aren't any penguins that size.",
    "Otherwise known as a submarine, Larry?",
    "Excuse me? You're going to cage him? He doesn't deserve to be caged!",
    "He's not crazy! He really did see a gigantic penguin in Witchaven, and if you had even taken a second to check out his story you would already know that.",
    "Larry, I don't think right now is the time to gloat. How about you get out of that jacket, and then we'll talk penguins. Okay?",
    "Okay, I'll meet you at the boat.",
    "No problem, I have it with me.",
    "Hmm, I better dig it out. Hope I can remember where I stored it!",
    "What are you doing here?",
    "Hello? You're not very well hidden, you know.",
    "Fine, be that way.",
    "Of course I did.",
    "Shouldn't we find out what they're planning to do with it, before we learn how to stop it?",
    "How do you expect me to find all that out? They're not just going to tell me!",
    "Alright, I guess so. Penguin time!",
    "No.",
    "Umm, I didn't bring it with me.",
    "Uh, what am I being trained in?",
    "Yes, I am.",
    "Comrade, I'd like to hear your side of the story.",
    "That doesn't sound like trust. That sounds like you're disposable. He sent you here and will abandon you.",
    "Your captain must trust you a great deal. You're so trustworthy you're worth coming back for.",
    "Or he will come back for you and will be caught, all because you didn't help us. You will be his downfall.",
    "He's betraying everything the penguins have worked for.",
    "Your captain is a traitor.",
    "What leader could possibly be greater than the Pescaling?",
    "Sounds like you swallowed a little too much sea water.",
    "The sea may control your Captain, but he controls your life. He sent you here to take his punishment for being a traitor. Even if he does come back for you, you will suffer greatly for his misdeeds.",
    "The KGP must make an example of you. All because your captain wasn't brave enough to come himself.",
    "But your life will be destroyed in the process.",
    "Where will he strike?",
    "Why not unite all penguins to The Sea, first?",
    "Wouldn't it be better to spread the word of The Sea to all penguins, first?",
    "Strength is demonstrated through unity, according to penguin doctrine.",
    "He's not unifying you. He's dividing you, and an iceberg divided will melt twice as fast.",
    "He's only demonstrating his impatience. He'll bring all humans down upon penguins and they'll be destroyed.",
    "Oh, really? They do a pretty good job of destroying themselves, what will happen when they focus all their strength against you?",
    "But, according to the KGP, the submarine can be tracked. It's only a matter of time till[sic] he's found.",
    "If he comes to rescue you, he'll be captured.",
    "But you said he'd come back for you. If he does that, the KGP will apprehend him.",
    "Perhaps he's clever, but a submarine is rather conspicuous. Face it, he's not coming for you, it's too dangerous for him.",
    "The submarine will have to surface at some point.",
    "Why can't he be found? The submarine will have to surface at some pont.",
    "So, there is a secret signal. Thanks for confirming that. Why don't you go ahead and tell us what it is?",
    "You know what the signal is, and will have to do it to be rescued.",
    "But you obviously know what the signal is. You'll have to do it once he comes to rescue you, so you can board. The KGP will be waiting eagerly to see what you do.",
    "'Our sacrifice'? Only you appear to be making the sacrifice. Your captain and shipmates are safely hidden on the submarine, while you will be imprisoned here.",
    "Yes, I'm sure he spent a great deal of time pondering which minion to get rid of. What were you, a cook's assistant? Messenger?",
    "So it's no great loss to the sub that you're gone.",
    "The KGP will never allow anyone to know what you have done.",
    "No, I'm not ready yet.",
    "I'll do my best. But I must know how to board the submarine if I am to help him at all.",
    "Thank you, comrade, you did the right thing. Now I know how to call the submarine; I better note it down.",
    "The KGP seems busy with the prisoner. I think I can risk it.",
    "What's the dance I need to do to enter the submarine, shipmate?",
    "I finished interrogating the penguin. I've found out how to call the submarine and how to signal to be let on board.",
    "No, he'd been captured a while ago, I'm sure the sub has moved on since then.",
    "I'll see what I can do.",
    "I need to get into the War Room!",
    "Are you saying I should hit him over the head and knock him out?",
    "How can I be sure that'd make him fall asleep? He might just arrest me for being a nuisance.",
    "That seems like a pretty thin idea, but I don't have any other options.",
    "Yeah, I'll go do that.",
    "So... guarding. Must be a pretty tiring job, eh?",
    "But you must have those days when you'd really like a nap. Up late the night before, didn't get to have any tea. Yep, must make you pretty tired.",
    "By sundown? That's amazing. How do you do it? You must have a routine that helps you get to sleep.",
    "That sounds really peaceful. No wonder you feel so well rested!",
    "Oh. I see. Well, I'll be toddling off now. Hope you sleep well!",
    "I spoke to the guard and found out what makes him sleepy... but also what doesn't make him sleepy. I think I have enough information now.",
    "Yes, that sounds great! Let's go make the guard narcoleptic!",
    "No, I want to tweak some of the words.",
    "What makes you sleepy, again?",
    "And a one, and a two, and a three.",
    "We'd better give it a rest, boys.",
    "He's asleep! Yes, we did it! Looks like he'll be out for hours. Still, I better hurry and get into the War Room.",
    "I don't understand, what are you doing here?",
    "But I'm not a penguin! I'm a spy. I need to speak to you.",
    "If I get out of the suit now, when I leave this room, I'll be kicked off of the Iceberg.",
    "Okay, here goes nothing.",
    "I am a spy... but I don't want to prove it right now.",
    "See! I am a spy. I built this penguin suit and this guy, Larry, shrinks me with magic so I can fit inside. Now, will you tell me what you're doing here? This doesn't seem like a normal environment for dwarves.",
    "So what exactly did you create?",
    "So it was you! That submarine is terrorising the coasts and is threatening to destroy major ports! I'm trying to gather enough information to stop it. Since you built it, you should know how to disable it. Could you teach me?",
    "I'll need to speak to Larry first, I don't know if he can cast his spell far enough for you to get in the suit.",
    "I haven't spoken to Larry yet.",
    "I found out who made the submarine. The penguins have kidnapped some dwarves and forced them to design and build the submarine.",
    "I think the dwarves are the key to learning how to disable the sub, but they won't help me unless I give them something in return.",
    "They want penguin suits, so they can escape. I can make more, but can you cast the spell from this distance?",
    "They were insistent on having the suits, or they wouldn't help me.",
    "Okay, I think I can manage that, I better get started gathering those supplies.",
    "Okay, I have all the supplies to give to the dwarves.",
    "Hi, I'm back.",
    "Okay, here goes nothing.",
    "I spoke to Larry. He can't cast the spell on you to shrink you into the suit. You're too big to fit into the suit just as it is.",
    "No, I'm just saying penguins are smaller than you. Even you must be able to see that!",
    "I can show you how to make penguin suits, but you'll be much bigger than the penguins. Still, it might give you a chance to escape.",
    "I have all the supplies we need. Now, let me give them to you and then I'll instruct you on making the suits.",
    "Right let's get started. First: lay out the silk...",
    "Oh, I know a thing or two about bellows. See, there was this ogre who had me inflate frogs...",
    "I did it! That should disable the submarine.",
    "I've lost the toolbox you gave me. Could I have another?",
    "Yes.",
    "No, thanks.",
    "Well, I now know how to call the submarine, thanks to the interrogation. I also received a toolbox from the dwarves and they instructed me on disabling the submarine. Overall, we're making good progress.",
    "How do you think they're tracking it? Do they have a spy on the submarine?",
    "I think you mean Noodle. I haven't seen him around, but I suppose it'd be worth talking to him. He was part of the black market.",
    "Alright, I guess so. Penguin time!",
    "No.",
    "Oh, just some espionage here; some interrogation there.",
    "I need to find out the location of the submarine that's gone rogue. I was hoping you might have contacts on the inside.",
    "I'm... trying to impress the Pescaling by finding it on my own. But I need more information.",
    "Are you going to ask for really obscure items that will send me halfway across the world to get them, again?",
    "What kind of favour are we talking about? You're not going to drag me off at some point to find you more tar are you?",
    "Yes. I'll make that deal with you.",
    "That's great, Noodle. Thanks for the help!",
    "No.",
    "I've lost the ID card you gave me. Could I have another?",
    "Can you tell me where the information on the submarine is kept again?",
    "I spoke to Noodle, and got the ID... but at a price. I am now in debt to the Fettuccine Mafia.",
    "Not a money debt, a debt of honour. They can call on me to do whatever they want to repay this debt.",
    "Dang, they took the telegram off me.",
    "Good things the penguins made copies of the telegram.",
    "I found a telegram with the location of the submarine.",
    "I don't seem to have it with me.",
    "Gee, thanks, Larry. You're really great for my morale.",
    "I have everything I need. Now I just need to call the submarine! The prisoner said I needed to blow the conch and then do a signal to let the submarine know I want to board.",
    "Alright, I guess so. Penguin time!",
    "No.",
    "*Whew, that was right! Two more moves to do. If I get those right, he should speak to me.*",
    "*I just need to do one more move and I'll have gotten the greeting right.*",
    "I don't think that was the right signal. The submarine is leaving...",
    "I don't understand. I did the signal right! Why is the submarine leaving?",
    "Yes, sir. I've come to report.",
    "No... no, really sir. I delivered your message to HQ and now I'm reporting back to you.",
    "I don't know what you mean, sir.",
    "Okay, you're right. How could you know my purpose? How do you know why I'm here?",
    "Sir, I've returned from the mission you sent me on. I successfully delivered your message to HQ and came back.",
    "I suppose it depends on what the truth is.",
    "How can you possibly know that?",
    "That sounds a bit crazy.",
    "That doesn't make sense.",
    "Don't you mean see?",
    "You, uh, see yourself?",
    "That was a slug on his head! No wonder he's gone mad... Aww, they took my toolbox. How am I going to disable the sub now?",
    "They seem to be storing spare hats and other weird things on this hatstand. I wonder if there's anything useful.",
    "I did it! That should disable the submarine. There goes the engine. Land ho!",
    "Yes! I did it, I disabled the submarine. Larry? This doesn't look like Yanille. Where are we? Larry? Ugh, I can't see anything in this suit.",
    "What? Where did you come from? What did you do to Larry?",
    "But not everything went according to your plans! The dwarves helped me. It's just too bad you caught up with us so quickly, or we would have gotten away with it.",
    "But...",
    "But how could you? Why would the dwarves join forces with the penguins? Can't you see it won't benefit you in the long run?",
    "Don't worry, Larry! I'll get off this island and rescue you! I swear it.",
    "That's right; you tell him, Larry! I'll make sure the penguins' evil plans never come to fruition.",
    "They've gone. How am I going to get out of here?",
    "What are you doing here?",
    "Look, I know you're a polar bear. Will you just talk to me?",
    "In snow! You can't see a polar bear when they're in snow! We're on a tropical island!",
    "What are you doing here? Why are you dressed like a tree?",
    "Who is this 'we' you referred to? Are you working with the penguins?",
    "Why didn't Larry tell me?",
    "What will happen to him? Where have they taken him?",
    "We should go after them! We can rescue him before...",
    "Well, this is an interesting way to travel...",
    "Uh, what happened? Why are you in that cage?",
    "What's going to happen? I can't believe I helped those blasted penguins."
  ],
  "Witchaven Villager": [
    "Well, hello there...",
    "Welcome to our little village.",
    "Pray, stay awhile",
    "Are you with us?",
    "Can you see it?",
    "The light, the hot bright light.",
    "It is all around us. Scalding, burning, blinding light.",
    "Sunlight...",
    "Soon now... So soon...",
    "We are all family here...",
    "Join our family..."
  ],
  "Chief Zookeeper": [
    "Can I help you, sir?",
    "What was that? Did you say 'Larry'?",
    "Hmph. Very well.",
    "There you are! You shouldn't be talking to members of the public! Don't make me put you back in the monkey cage, Larry.",
    "It's Larry, he's crazy. He's a danger to himself and to the public. He's always lying about penguins and conspiracies. I'd hoped the jacket would keep him out of trouble, but obviously with people like you encouraging him, he's escaped!",
    "I don't have time to scamper all over RuneScape checking out Larry's stories. Don't you have better things to do with your time?",
    "Okay, Larry, but this is the last time. If there is proof that something happened, then I'll let you out, but I don't want you handing around the Zoo anymore. You're giving the place a bad name. But if there isn't proof – well, I'm afraid you know what I'll have to do...",
    "Well, I have never seen a footprint like that. I can't deny that something happened here. Although the citizens of this town didn't seem... quite right. They may have been up to something. Still, a deal is a deal. You're free to go, Larry.",
    "Larry!",
    "Yes, take him away! Feed him to the penguins, for all I care."
  ],
  "Polar bear": [
    "...",
    "...",
    "Grrrrrrrr."
  ],
  "PIng/Pong": [
    "Dude, now is not a good time. The creative vibes are upon us."
  ],
  "KGP Agent": [
    "Here for more training, are we? Good, good. You should speak to the KGP Interrogator. Move along. Move along.",
    "Not really. I find it stimulating, getting to yell at people.",
    "I am in bed by sundown, sleep the whole night, and I avoid caffeinated drinks. I want to grow another two inches. So, no – I don't feel like having nap.[sic]",
    "Well, I do, actually. I drink some warm cocoa, kiss my chicklings goodnight and wrap my feathers in a green blanket. Then I have pleasant dreams about the big blue sea and squirrels playfully running around on the coast.",
    "It's not always that pleasant. Those terrible bards play music all night and, even though I hate the taste, I have to drink coffee the next day to stay awake. Then I have nightmares the next night about bears coming at me with their claws and then sharks chomping and making the sea go red. That's why I arrest those bards all the time, so I can get a good night's sleep!",
    "What do you want?",
    "Alright, that's enough racket. I'm tired of hearing this. It'll give me nightmares!"
  ],
  "KGP Interrogator": [
    "Where have you been, trainee? We should have started this interrogation hours ago! I won't abide lateness in my students.",
    "Forgetful, too? It's outrageous I'm expected to train such penguins! I am teaching you the art of interrogation. It's a delicate art, full of finesse and shouting. I hope you have not forgotten our previous lessons on the steps of interrogating. We shall find out soon enough, as this is your first practical exam. Are you ready?",
    "Good show. Now, let's begin. Our subject today was once a loyal comrade. He was a shipmate on our new submarine. We lost contact a while ago, and he suddenly appeared on our doorstep with a message. The captain of the submarine told us, 'No more waiting. The time to strike is now. A higher power commands it.' We can track where the submarine is, but every time we try to make contact it disappears. We believe there is some sort of code or signal to board the sub. You may question this penguin and attempt to find out the signal. It will require trickery, so be careful how hard you press him and how you answer his statements. Try to shake his confidence. You may proceed.",
    "Very well. I can't teach an unwilling student. Speak to me when you are ready.",
    "Hmm, that didn't seem to have much effect on him. Try a different tact.",
    "Be careful, trainee. I think you may be pushing him too far. You don't want to work him into a state.",
    "That's enough, trainee. You've worked him into a state. Take a break while I calm him down and we'll try again.",
    "Hmm, you're getting somewhere. But you need to shake his confidence more!",
    "Good, good. You're making progress. Keep pressing him.",
    "Keep going, he's very close to breaking. A few more tough questions and I think you'll have him, comrade.",
    "He's nearly broken! One more push and I think we'll get the information we need.",
    "Well done, comrade. I'll take over from here. You passed your test with flying colours. Fascinating, what he said about the horn of the sea and the dance. I wonder if any of it has to do with the strange shell he was carrying. Ah, which reminds me, comrade. Don't disturb the prisoner's belongings on the crate there. They are evidence in the case against him and are now property of the Pescaling."
  ],
  "Captured penguin": [
    "My captain trusted me above all other shipmates, to deliver his message to the Pescaling. Though my captain loves all penguins, he's found a greater leader than the Pescaling. My captain will bring unity to all creatures of the sea by destroying the humans. Nothing can be done to stop him, because they'll never be able to find him. We took the submarine to benefit all penguinkind. Our sacrifice will be remembered.",
    "My captain trusted me above all other shipmates, to deliver his message to the Pescaling.",
    "You do not know of what you speak. We are all his sons, and he will not abandon me.",
    "Yes, yes he will come back. And then we will all celebrate his victory.",
    "No... no, that will not happen. I, I will not betray him.",
    "Though my captain loves all penguins, he's found a greater leader than the Pescaling.",
    "It's not betrayal. What he does, he does for all of us.",
    "Some call them traitors, others call them fighters of what is right. Perhaps your perspective is wrong.",
    "Our leader controls all. Our leader is The Sea. It is eternal and far more powerful than the Pescaling.",
    "Do not mock me. I am one with the sea, and it will punish you for your humour.",
    "But, why? Am I not still a comrade? I brought good news! News of our imminent victory.",
    "...",
    "My captain will bring unity to all creatures of the sea by destroying the humans.",
    "It is a small price to pay for the greater good.",
    "Why would I tell you that? Even if I did know, I would not tell you.",
    "His demonstration of our strength will spread the word more quickly.",
    "But...he is loyal to the doctrine. He will bring unity through strength!",
    "Humans are not clever enough to destroy us.",
    "I'm...I'm sure the Captain has considered this. He must have.",
    "Nothing can be done to stop him, because they'll never be able to find him.",
    "Tracked, perhaps. But captured, no. My Captain is too clever to be captured.",
    "I'm sure he can manage to come get me without being caught. He is clever.",
    "The submarine will surface, but you don't know how to signal it correctly to board it.",
    "No.",
    "Then I will sacrifice myself and not give away the signal. My Captain is more important than me.",
    "We took the submarine to benefit all penguinkind. Our sacrifice will be remembered.",
    "It was an honour to be chosen. He did not make the choice lightly, he told me.",
    "Cabin cleaner.",
    "...",
    "Then the unity of the penguins was already broken. We cannot have secrets between each other if we are equal.",
    "I will never tell you anything! NEVER!",
    "Enough! I can't take it anymore. I do not wish to betray my Captain, but perhaps he has chosen the wrong course. You must save him, no harm must come to him!",
    "You must call him with the horn of the sea. Then you must dance the dance of the sea. Dance with a [Emote 1]. Then groove with a [Emote 2]. Finish with a [Emote 3].",
    "You must call him with the horn of the sea. Then you must dance the dance of the sea. Dance with a [Emote 1]. Then groove with a [Emote 2]. Finish with a [Emote 3]."
  ],
  "Ping": [
    "Maybe you should talk to the guard. If the dude's in a good mood he might let you through.",
    "No way, dude! That's totally bad karma. I meant you should sing him a lullaby or something.",
    "Gnarly, bro. We'll read our song to you and then you can fill in the blank spots with the words you got from the guard. Rockhopper peeenguin, on the ice crop, when the ice breaks, your body will drop. The next line, we need a word. It goes: 'Something' will come circling, watching your fall,",
    "Great word! The next line needs a word too: and down will come penguin, 'things' and all.",
    "Next line: rockhopper peeenguin, in the 'something' sea.",
    "Here's another one: 'things' are approaching, they want you for tea,",
    "Almost done with the song: you can defeat these terrible foes, with your secret weapon: a 'something' on the nose.",
    "Okay, this is the last bit we need help with: rockhopper penguin, king of the sea, you are way cooler than 'they' could be.",
    "Those are all the words we need. Let's rock out! Rockhopper penguin, on the ice crop, when the ice breaks, your body will drop. Chicklings will come circling, watching you fall, And down will come penguin, squirrels and all. Rockhopper penguin, in the blue sea. Bears are approaching, they want you for tea, You can defeat these terrible foes with your secret weapon: a kiss on the nose. Rockhopper penguin, king of the sea, you are way cooler than sharks ever could be. How's that sound, dude? Are you happy with it?",
    "We're right behind you, dude. Lead the way and we'll be your back-up.",
    "Rockhopper penguin, on the ice crop, when the ice breaks, your body will drop. Chicklings will come circling, watching you fall, And down will come penguin, squirrels and all. Rockhopper penguin, in the blue sea. Bears are approaching, they want you for tea, You can defeat these terrible foes with your secret weapon: a kiss on the nose. Rockhopper penguin, king of the sea, you are way cooler than sharks ever could be."
  ],
  "Pong": [
    "He's never in a good mood, man. He'd only let you through if he was unconscious, like asleep.",
    "I know! We've got this, like, almost done song. If you found out what makes him sleepy, we could sing about it. That'd make him fall asleep for sure."
  ],
  "PinG/Pong": [
    "Yo, man, have you talked to the guard? Find out what makes him sleepy, and we'll try to write a song for you."
  ],
  "Medwin": [
    "The work we're doing can't be rushed, no matter what your penguin schedule is.",
    "Before you ask: No, the Pescaling can't make any more changes to the design! We're too far along for that.",
    "Stop pestering us! How are we supposed to work when you penguins barge in every few minutes?",
    "Can't you see I'm busy? You penguins are all alike, no manners.",
    "Haven't you been listening? I don't have anything to say to you, penguin!",
    "Ha ha. Like I'm going to fall for that one. If you're a spy, prove it.",
    "Impressive. A suit to make you look like a penguin... What we're doing here? We're prisoners who were kidnapped and forced to work for the penguins. The penguins managed to build a large clockwork penguin, similar to your suit there, but they wanted something more versatile. Somehow they heard that we dwarves are skilled engineers.",
    "We created a submarine.",
    "Why would we do that? If we help you disable it, they'll just make us build another one. There's nothing in it for us. If you brought us one of those penguin suits for each of us, then we can discuss training you. With those suits, we could escape from here.",
    "Well then, have you brough us anything worthwhile?",
    "We're working as fast as we can. If you penguins keep interrupting we'll make no progress.",
    "Is that you, spy? Get out of that suit, it's too creepy talking to you like this.",
    "Well then, have you brought us anything worthwhile?",
    "You calling me tall, human? I resent being called tall!",
    "I suppose. Well, if you won't give us suits, we won't help you.",
    "Yes, yes. That sounds fine. Bigger suits will be fine. If they haven't noticed you walking around in that disaster of a disguise, they won't notice us. We'll need you to supply us with the equipment to make the suits since we can't leave here.",
    "You are a skilled instructor, human. I'm impressed with the simplicity of the design. Now it is my turn to instruct you. Let's begin your training: First you'll need tools.",
    "This box contains all the tools you will need to disable the submarine. Disabling it will redirect the submarine to a safe port and force it to rise out of the water. What you do from there is up to you. I'll walk you through it now, then you will do it once on your own to show you understand. Here we go. This is the engine panel that controls the submarine. With a few simple modifications you can disable the submarine. Use the wrench to open the wire box cover. Cut the green and red wires with the wirecutters. This will cut off the command room from the engine. Use the spare wire to rewire the green wire to the red wire. Now you've re-routed control to the engine room. Wrap the tape around the raw ends. Pump air into the pipes until it's getting near red. The submarine will need some air pressure to manoeuvre to your new destination.",
    "Did I say there was talking? I don't think so. Now pay attention. Turn the wheel, but watch the gauge. Stop once it's green – the arrow will point straight up. If you don't stop, you'll have to pump the bellows again. Pull the lever, and the submarine will start on its new course. Just sit back and the sub will do the rest. Right, now you give it a go. Just use this panel here and try to do everything in the right order.",
    "Where did you wander off to? You left before I could give you your toolbox and explain how to disable the submarine.",
    "You humans are so flighty. Keep better track of this one!",
    "Well, you managed to disable a pretend submarine. Maybe there's hope for you yet. You can practise again, any time you want. Just use the panel. Or, if you're feeling a bit thick, I can take you through the steps again."
  ],
  "Noodle": [
    "Wotcha! Wa' u bin up to?",
    "Wozza. Wacha need from me, then?",
    "Aye, I do. Wha' you need to kno' tha' for?",
    "Oi, I see. Yas did me a gud deal last time. I s'pose I'd be willin to deal agin. I dun wan' much fur the info...",
    "Nah, I dun need noffin like tha'. I'll mak' it eazy on ya. If I tell ye me info, ya owe the Fettuccine Mafia one favour. Me bruva, Alfredo, can call on yous whenevah he wants. Still wanna deal?",
    "Nah, nuffin like dat. We won't call ya in onnit unless yer in de Motherland. Thas whure de Family iz based. I'm jus doin' deals on the outpost. We dun got no one in the human world to do deals, yet.",
    "Reet. I kno' whure the info on the sub is kept. Thur's a room full a cubes wif penguins wanderin' round. They keep the info in the back-right room. I's can git u a ID to git in, bu' dunna cross thur paths. Yous get caught din. Nobod' supozedt to go in thur, but the guard's a bit thick.",
    "Propa! 'hen here's yur ID. Ya dinna git it from me.",
    "Oi, you be mor' carful next time.",
    "Thur's a room full a cubes wif penguins wanderin' round. They keep info in the back-right room. Use yer ID to git in, bu' dunna cross thur paths. Yous git caught din. Nobod' supozed to go in thur, but the guard's a bit thick."
  ],
  "Trainee KGP Agent": [
    "No ID, no entry. Only authorised personnel beyond this point.",
    "Wait a moment, I need to see your ID.",
    "You are permitted to pass, comrade.",
    "Greetings, comrade. I see you're very dedicated to your position. I feel the same way. When they told me I was being rpomoted I just couldn't get my feathers to lay straight for a week. But you don't want to hear that."
  ],
  "Penguin": [
    "Welcome back, sea-brother/sister! The Captain wishes to speak with you.",
    "We didn't expect to see you again. Report to the Captain for debriefing.",
    "About time you got back. Report to the Captain immediately!",
    "I see you survived the trip back to the Iceberg. Better see the Captain before you return to work.",
    "Ah, you've returned. There's lots of work to be done, but you need to see the Captain first.",
    "Hey, don't touch that! You need to report to the Captain before you can resume work.",
    "The sea is a mighty ally.",
    "Why aren't you at your station? There's work to be done.",
    "Get back to your work, shipmate!",
    "Long live the Captain!",
    "If only the rest of our comrades back home could see us now. They, too, would join the sea."
  ],
  "Captain Marlin": [
    "So, you've come to see me.",
    "No, you've come to destroy me.",
    "You came back all the way from the Iceberg, just to report? No, you are here to fulfill your mission.",
    "You were approached; perhaps because you're insignificant and merely their errand boy, or perhaps because they underestimate you, and you are very important. You were to carry out this task of vital importance: to save everyone... to save yourself. That is why you're here, isn't it? There's no point in lying about it. Honesty is a virtue, isn't that what we're taught?",
    "How much truth can you handle?",
    "How true. The truth that you don't seem to be able to handle, nor speak of, is that you were sent here to wreck my plans. Who sent you, doesn't really matter.",
    "You would have fooled any soldier who'd merely spent time in the water. I have not merely spent time in it, I have become one with it.",
    "No, it's not crazy. My thinking is crystal clear. Everyone else is mad. Did you even stop to consider why? Why you were sent to stop me? Did you ponder if what you were doing was right, or if what I was doing was wrong? Did anything you've done even make sense? Look outside that window. You can look, but you don't understand. The sea is always at war, it is terrible and beautiful in its battles. So terrible, that at times you cannot look at it, not through your own eyes. That is what I have learned to do. I have learned to see the sea, and the world, with new eyes.",
    "Sense! Of course it doesn't make sense to you. Your senses are dull. They are dulled with the lies and orders that you follow without thinking. For too long, penguins have been the servants of the landed. We have been dominated by humans, by polar bears, by those who could never compete with us once we are in the sea. Our Pescaling is obsessed with dominating them, even adopting their tactics of war. But to truly succeed and begin anew, we must become one with the sea. We must harness its power and become a force of nature. Only then will we wipe out the wrongs done to us. You were sent here to destroy me, but you don't even know me. You will never sea.",
    "No. For you cannot sea nor see. Every night I dream that I slither along the edge of a knife. At times I am certain I shall fall, but I still slither. At the end of the dream I see myself. Do you know what I see?",
    "No, I see... That we are all but slugs. Slugs, the lowliest and highest of life forms, all at once. I am a slug, and one day, you and all your kind will be as well. My men have already begun their journey, though they have taken to wearing fish on their heads, but it is a start. Then, all penguins will join us and together we will bring the world to the mercy of the sea. I grow tired of your presence. Your mission has failed, but as we are on our way to complete our mission, I can't take the time to dispose of you as I would like. So, you will enjoy some time in the brig. Guards!"
  ],
  "Pescaling Pax": [
    "I'm afraid Larry can't speak to you just now. A gag is preventing him.",
    "One question at a time, please. I'll start with 'Where did you come from?' I can't resist enlightening your puny brain. After our last encounter, when I took that clever suit of yours, we have been hard at work. We constructed this submarine, and had great plans for what we could do with it. But the captain went a bit mad and stole the submarine. Fortunately, I realised that you and your intrepid explorer friend here were sniffing around again. I decided to let you do all the leg work for us, and track down the submarine.",
    "You humans are naïve. Do you really think I'd let you speak to my top researchers if I wasn't sure they were loyal to me?",
    "I'm growing bored. Say your last goodbyes to your explorer friend. We'll be taking him to the Motherland for a long interrogation session. You, on the other hand, will meet your fate here, on this deserted island. I hope you enjoy your slow death.",
    "I love the empty threats of humans. Time to go. So long, [Player]. It's been fun manipulating you."
  ],
  "Penguin (dwarf)": [
    "Yes, you were rather gullible. We even got these suits out of the deal! It was a simple matter of telling you we were teaching you to disable the submarine, when really you were simply recalibrating the end destination. You told it to come to this deserted island, where we've been awaiting your arrival.",
    "Not all dwarves have joined with us. Our small group fractured from our main party, the Red Axe. We got tired of waiting for our great leader to strike against you humans. The penguins are much more eager to achieve their world domination."
  ],
  "Chuck": [
    "Woooosh. *Trees can't talk.*",
    "But... I'm in disguise, you can't see a polar bear in disguise.",
    "Hmmm... we may need to have a meeting about that.",
    "A palm tree, to be exact. I'm here because we've been tracking your and Larry's movements. We knew you were about to make a breakthrough and wanted to be standing by.",
    "Those plebeians? I think not! I'm Chuck and I'm from the PBJ. We've been working with Larry to stop these insane penguins from taking over the world.",
    "For your safety. Larry was trying to protect us and you. As long as we weren't connected, the penguins wouldn't be interested in you. But, Larry said should anything happen to him, we should trust you and work with you to make things right. He says you're the only one he trusts.",
    "The penguins know their outpost is no longer secure, so they won't take him there. They'll take him to the Motherland and interrogate him. But don't worry about him. He expected this to happen eventually and will use it to his advantage. Larry is very, very clever.",
    "No! You are not ready to go to the Motherland, and neither are we. It is not something to approach unprepared. What we must do now is pool our resources and wait for the right moment. And our first plan of action is to get off this blastedly hot island...",
    "Ah, this is a much more comfortable place to speak.",
    "This is my new assignment. I am to take over Larry's post at the zoo until he returns. I will be keeping an eye on the penguins from here.",
    "Don't regret it! All is not lost. With Larry on the inside, we may finally have the advantage we need. Chin up, my human friend, things are always darkest before the end."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Hunt_for_Red_Raktuber?oldid=36224470’"
  ]
}