{
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "Dialogue for not having enough money to rebuy lost items, and formattingYou can discuss this issue on the talk page or edit this page to improve it."
  ],
  "Player": [
    "Tell me about this antiques business.",
    "Is there anything else interesting to do around here?",
    "Nothing. I was just wondering if there was anything else to do?",
    "You want me to do you a favour?",
    "An adventurer of my calibre, isn't that overkill.",
    "What are you going to give me if I do it?",
    "Nah thanks, I've got bigger fish to fry.",
    "Okay, see you in a tick!",
    "I'll get going then!",
    "Where do I meet this jungle forester?",
    "Hmm, sorry, not interested.",
    "What was I supposed to do again?",
    "I've forgotten what to do, can you remind me",
    "This is taking longer than I expected!",
    "Is there an easier way of getting this exotic wood?",
    "Everyone is asking me to do them favours now! It seems like I've opened the floodgates!",
    "Ok, thanks.",
    "I need to talk to you about red mahogany.",
    "Ok, I'll take your hatchet to get it sharpened.",
    "Why should I take it to Captain Shanks?",
    "Where is Captain Shanks?",
    "Ok, thanks.",
    "What did you want me to do again?",
    "Oh, yes... Ok! No, I'm sure that nothing bad has happened to it, I mean, you gave it to me, I'm really dependable!",
    "What am I supposed to do again?",
    "Who is it that I'm supposed to meet?",
    "Do you really actually need that hatchet?",
    "Ok, thanks.",
    "I've lost your unsharpened hatchet, I need a new one.",
    "Ok, I promiste to be more careful.",
    "Actually I have a favour to ask.",
    "I have a hatchet from the jungle forester, I wonder if you could nip into Brian's Axes in Port Sarim and get it sharpened for the jungle forester.",
    "But... I was only meant to do a small favour for Yanni Salika... I don't want to go to Port Sarim!",
    "Actually I have a favour to ask.",
    "Do you sharpen hatchets?",
    "But... what?",
    "It sound serious!",
    "Look, can you sharpen this cursed hatchet or what?",
    "Oh, so you want a favour doing as well?",
    "What?",
    "Is there anyone else who can sharpen this hatchet?",
    "Ok, ok, I'll do it! I'll go and see Aggie. [Once Brian has asked for a favour]",
    "Ok, thanks.",
    "You know what! You're absolutely right! I must have dropped it or left it somewhere.",
    "What did you want me to do again?",
    "Oh, right, yes, sorry, I forgot..",
    "Could I ask you about being a character witness?",
    "'Jimmy the Chisel' – what kind of name is that?",
    "What do you mean missing?",
    "Do you have any idea where he might be?",
    "Let me guess, you're going to ask me to do you a favour?",
    "Hmm, I seem to have heard that one before. Go on then, what do you want me to do?",
    "No way... I've had enough of doing favours for people.",
    "Oh. Ok, I'll see if I can find Jimmy.",
    "Ok, thanks.",
    "Hey who are you?",
    "I'm Player, and I've come to release you...Aggie sent me.",
    "Well, I thought I'd try a more diplomatic solution first...do you know who I have to talk to?",
    "Ok, I'll try that.",
    "I'm looking for Jimmy the Chisel.",
    "Huh. It sounds like you're forcing him to join you!",
    "Well, I have to return him to his employer, she's very worried about him, so if you could just hand him over... I'll be getting out of your way.",
    "And I suppose you need me to do you a favour?",
    "Ok, just exactly what is it that you want me to do?",
    "No way... go do your own dirty work!",
    "Ok, Jimmy has to be worth more than a few scrawny chickens!",
    "I'm back.",
    "What did you want me to do again?",
    "Can't you just release Jimmy the Chisel?",
    "Err...not exactly!",
    "I don't think I can do this.",
    "Ok, thanks.",
    "Hiya...you're Jimmy aren't you?",
    "I've made a deal with Johanhus...I need to go sort out some chickens to secure your release.",
    "Yeah...me too...anyway, I'll be back as soon as I've got the deal sorted.",
    "I need to talk to you about Jimmy.",
    "He's being kept prisoner by a bunch of fanatics and I need to organise a delivery of a month's supply of chickens to secure his release.",
    "Yes, it's pretty bad... but keep calm, I'm going to help.",
    "None at all?",
    "Well, can't you just give me some chickens?",
    "Well, do you know someone who does have a month's supply?",
    "What did you suggest I do again?",
    "Ok, I'll go and see him then.",
    "Sorry for the intrusion, but this is quite urgent. Jimmy the Chisel is being held by fanatics. They won't release him until they get a month's supply of chickens.",
    "I've already talked to Fred but he says he doesn't have a month's supply of chickens. Is there any way that you could help?",
    "That's exactly what I said...",
    "What do you propose?",
    "I had a feeling you might!",
    "No way, I'm fed up with this wild goose chase!",
    "Oh, ok! I guess it's not that much further to Varrock!",
    "What am I meant to be doing again?",
    "Ah yes...I remember now.",
    "I'm back from talking to Seth!",
    "He said he would help us...I have to go to Varrock to get some chicken cages made up!",
    "Hi, I need to talk to you about chicken cages! Seth Groats has asked me to come and see you!",
    "But I don't have three steel bars at the moment!",
    "Ok, well I have three steel bars here, you can have these.",
    "Oh dear, you don't sound too well?",
    "Well that's a shame because I really need your help to make some chicken cages!",
    "Oh, I see, you need me to do you a favour?",
    "Oh, no not another favour, I just can't do another one!",
    "Ok, I guess one good turn deserves another.",
    "Well, hopefully, I'll be right back, but you never know. It might take longer!",
    "What was I supposed to be doing?",
    "I am the Apothecary. I have potions to brew. Do you need anything specific?",
    "Horvik is ill. I need breathing salts and herbal tincture.",
    "Wow that was surprisingly easy! Fantastic, thanks very much.",
    "Oh... but... what about the breathing salts...",
    "Ok...",
    "That's ok, just hand over the breathing salts.",
    "I just knew this wasn't going to be easy! So you can't get any more breathing salts?",
    "Where would you get one of those from?",
    "Where could I do that?",
    "Oh, no way am I going to the Barbarian Village!",
    "Oh, ok, I guess it's not that far to the Barbarian Village.",
    "Horvik is ill, I need breathing salts.",
    "Oh yes... where am I going to get a new pot?",
    "What was I supposed to be doing again?",
    "Oh, yes right!",
    "I've lost that herbal tincture you gave me!",
    "Hey there... I need an air tight pot just as soon as you can make one!",
    "It's a matter of some urgency that I have an airtight container just as soon as possible!",
    "Oh, sorry, I didn't think... what's the problem?",
    "Loan shark? Hammerspike? What are you talking about?",
    "But I need an airtight pot... to store breathing salts in.",
    "Ok, I'll deal with Hammerspike!",
    "Yes, I'll go and have a chat with him, perhaps we can sort something out.",
    "That's not a pretty picture you're painting, but don't worry, I'll be careful. Now, where do I find this Hammerspike?",
    "No, sorry, no more blooming favours for anyone!",
    "Hey there...I'm back...",
    "Not exactly, can you tell me what I'm supposed to do again?",
    "I'm looking for Hammerspike.",
    "What're you doing here?",
    "Who do you work for?",
    "Ok, thanks.",
    "I'm [Player] and I want to talk to you about a friend of mine, Tassie Slipcast. She says you're putting the screws on her for some loan she had from you. Is this true?",
    "Well, I've come to change the deal.",
    "Er... er... not exactly... why can't you just leave her alone? I mean, make a nice gesture, I'm asking you as a favour... please?",
    "Can't you just leave Tassie alone?",
    "Oh, come on... do something nice for Tassie.",
    "Oh, come on... do something nice for a Tassie. Think about how hard she's working!",
    "Yeah, come on give her a break.",
    "I can understand that... you have a lot on your mind. Go on, make a change... it'll do you good! There must be something else that you wanted to do at least once in your life.",
    "Have you always been a gangster?",
    "Have you always been a gangster? Wasn't there anything else that you wanted to do instead? Come on, tell me what you want to do... I'm listening.",
    "Ok, that sounds good.",
    "I don't think they take dwarven gangsters as initiates.",
    "Ok, another favour... I think I can manage that.",
    "Ok, thanks.",
    "What was it that I was supposed to do for you?",
    "Are you taking any new initiates?",
    "How does someone become an initiate?",
    "Seems pretty straight forward!",
    "Do you accept dwarves?",
    "A dwarf I know wants to become an initiate.",
    "Not you as well?",
    "Well, that seems simple enough.",
    "Are you mad?",
    "I've been asked to do a lot of favours recently.",
    "Yep, it's a deal.",
    "Yep, it's a deal. Tell me the recipe for this potion.",
    "Mmm, sounds delicious! What's it called?",
    "Can I drink it?",
    "Great! And thanks.",
    "But I can drink it though.",
    "Ok, I think I understand.",
    "Nope, it's not a deal!",
    "Ok, thanks.",
    "What did you need me to do again?",
    "Oh yes, right, thanks!",
    "How do i make the potion again?",
    "Ok yes, right, thanks.",
    "Ok, thanks.",
    "Sanfew asked me to come and talk to you.",
    "I have a special potion here for you from Sanfew!",
    "Yes, he's quite considerate that way... you know, thinking of people. In fact, he was thinking that you may be able to help him with another little 'helping' situation that involves ogres.",
    "More like 'super-over-grown-gnomes' if you ask me! Or 'overgrown humans'!",
    "Sanfew wants to bring the word of Guthix to those ogres, though I've no idea if ogres have the mental ability to grasp druidic concepts.",
    "Well, he wants to know if he can organise a glider ride down there.",
    "Ok, good luck with that.",
    "TRASH? What the devil are you talking about? Why do I have to get it?",
    "What do you want me to do?",
    "What is T.R.A.S.H?",
    "Where can I get this from?",
    "Great! So I get to talk T.R.A.S.H with shopkeepers!",
    "Ok, I'll go and get you some T.R.A.S.H.",
    "No, sorry, I can't do it right now.",
    "How was that potion?",
    "What am I supposed to be doing again?",
    "I need to talk T.R.A.S.H to you.",
    "Yes, of course. There's a Gnome on White Wolf mountain who needs some T.R.A.S.H... for his glider... do you have some?",
    "Well, I'm sort of doing him a favour.",
    "How totally unpredictable!",
    "Yeah, I've heard of that before! Go on... tell me anyway.",
    "Well, I can understand that.",
    "Yes. Ok, I'll do it!",
    "No way... I've had enough of this wild goose chase.",
    "What did you want me to do again?",
    "Hi, can you give me a weather forecast?",
    "Great! So can I assume you've been really pro-active and compiled an up-to-date one for me?",
    "So, in your case, you have the power of foresight, but you're too lazy to act on it?",
    "Who is this girl that you're concerned about?",
    "Where is this girl?",
    "Do you have any ideas where that might be? I mean, it's pretty vague isn't it?",
    "What do you think needs to be done?",
    "I'm sorry but I can't help.",
    "What can I do to help?",
    "So, let me get this right. You want me to start poking my nose into a lot of caves where some creatures might be?",
    "Risking my neck for some tomboy who thinks she's got what it takes to be a real adventurer?",
    "Yes. Ok, I'll do it.",
    "No, sorry, I can't do it right now. Or maybe ever!",
    "What did you need me to do again?",
    "I need you to start checking nearby caves looking for our missing Petra. The caves are probably home to some creature or creatures. Check around the vicincity[sic]. The impressions are coming from a south westerly direction. Don't go further east than you are already, no further south than Ardougne and no further west than the combat training camp.",
    "I need to talk to you about a girl stuck in some rock!",
    "Hey! Not so fast! I've seen a young girl encased in rock, a note in her belt led me to you.",
    "What the demonikin are you talking about?",
    "No way am I going to Port Khazard for you!",
    "Oh! Ok, one more 'small favour' isn't going to kill me... I hope!",
    "What? Are you saying I have to travel a thousand miles?",
    "What did you want me to do again?",
    "Hello there. Wizard Cromperty sent me to get some iron oxide, do you have some?",
    "Rust? What do you mean? How much does it cost?",
    "Groan!!",
    "So, let me get this straight.",
    "You want me to traipse ALL the way down past the ogre city with some flea infested mattress, to some hermit ogre who can't shoot a chompy bird to save his life, so that you'll give me a pot of rust?",
    "Ok, I'll do it!",
    "Sorry, I just don't want to do it.",
    "Erm, what was I supposed to be doing again?",
    "Erm, I've lost the mattress... do you have another one I can get refilled?",
    "Ok, here's 100 coins for another mattress...",
    "I'm not paying you 100 coins for that stinky mattress.",
    "Ok, then I won't.",
    "Great!",
    "GLADLY!",
    "I need to talk to you about a mattress!",
    "Can you fill this mattress with feathers?",
    "What's going on around here?",
    "What can I do about that?",
    "Ok, I'll see what I can do.",
    "Ok, thanks.",
    "What did you want me to do again?",
    "Hello there, what are you working on?",
    "What purpose will that serve?",
    "Is there anything I can do?",
    "Rantz said I should come and help you finish this project.",
    "Yes, I'll take a look at them.",
    "We'll see!",
    "Sorry my friend, but I've got other things to attend to.",
    "Ok, thanks.",
    "What was it you wanted me to do again?",
    "I need a new gem to fix the lights.",
    "Ok, here's 500 gold, I'll buy one.",
    "No way am I paying that much.",
    "I've fixed all the lights!",
    "I know one Ogre who'll be very pleased about that!",
    "Hey there, how's it going?",
    "Hey there, how's it going?",
    "Ok, I've helped that Gnome, he shouldn't bother you anymore.",
    "But I don't have the stodgy mattress anymore...I'll have to get another one.",
    "Great, I think Tindel will get a good night's rest on this.",
    "I've lost that filled mattress you gave me!",
    "Ok, I'll give you 200 bright pretties.",
    "No way am I giving you 200 bright pretties.",
    "I have the mattress!",
    "What should I do now?",
    "I've lost the iron oxide, can I have some more?",
    "Ok, I'll buy it.",
    "No way am I paying 200 coins for a bottle of rust!",
    "I have that iron oxide you asked for!",
    "What should I do now?",
    "I need another animate rock spell.",
    "No way...I'm cleaning up your mess, you should be grateful!",
    "Ok, here you go!",
    "Grrrrr!",
    "Um nahi listic duroo-rah!",
    "Whoa! That was a bit of a misfire.",
    "And this doesn't look good!",
    "Um nahi listic durooo-rah!",
    "Oh, not so long... I don't think...",
    "I mean... that is... I'm not so sure... at all... in fact.",
    "Well, actually, I think that some of the people at the Seers Village are worried about you. That's how I came to find you here. Phantuwti sent me.",
    "No problem... I'll probably see you back at the Seers Village.",
    "I've released Petra, she should have returned.",
    "So can I have the weather report now please?",
    "Listen you... just give me the blooming weather report!",
    "Why can't you get a clear picture?",
    "You're making me angry! I did you a favour, now pay up!",
    "Which special Seers tools do you mean?",
    "What do you mean, 'special combination of items'?",
    "You're talking about a weather vane aren't you?",
    "You can't predict the weather because your weather vane is broken... that's it isn't it? Holy Saradomin breath... you can't even predict the weather, you need a weather vane!",
    "Ok, show me where this weather vane is... I want to look at it.",
    "I may be able to fix it and then you can give me a weather report... come on, let's go!",
    "Just show me it!",
    "You're talking in riddles, just give me a straight answer!",
    "This isn't allegory though, you're just avoiding my questions!",
    "How hard can it be to predict the weather?",
    "Ok, what's it going to take to get a weather report?",
    "No, sorry, it doesn't help at all, I need a weather report and I need it now...so hand it over!",
    "Ok, thanks.",
    "You're just a fake... you can't predict the weather!",
    "You should get out more!",
    "What's it going to take for you to give me that weather report?",
    "Ok, thanks.",
    "I've done my part of the deal, now hand over that weather report.",
    "I'll run you through if you don't give me that weather report.",
    "Ok, thanks.",
    "Hey, I'm fixing the weather vane!",
    "I've fixed the weather vane!",
    "Hi again, what should I do now?",
    "I've lost the weather report.",
    "Thanks!",
    "I have the weather report for you.",
    "Thanks!",
    "Hey there, did you get your T.R.A.S.H? Arhein said that he'd send one of his associates up with it.",
    "Ok then... thanks I will!",
    "Hi there! The Gnome Pilot has agreed to take you to see the ogres!",
    "Yep and with good news... your life is about to change for the better. I've persuaded Sanfew to take you in as an initiate!",
    "Ok, you promise me that you won't bother Tassie anymore and I'll leave you alone.",
    "I'll be ready for you whenever you want to take a shot Hammerspike... I'm not afraid of you! You're just a bully who can't fight his own battles.",
    "Hey there, Hammerspike won't be bothering you anymore!",
    "Well you could make me an airtight pot!",
    "Hey there! I have an air-tight pot for you!",
    "What should I do now?",
    "Oh yes, you're right!",
    "I've lost the breathing salts you gave me, can I have some more please?",
    "Hey there! I have an air-tight pot for you!",
    "Hey there! I have an air-tight pot for you!",
    "But I don't have an airtight pot.",
    "I have the tincture and the breathing salts.",
    "I have the five pigeon cages you asked for!",
    "Here they are! I've got all five!",
    "I have some chicken cages!",
    "Don't worry about Jimmy. His release is imminent!",
    "You're in luck, I've managed to swing that chicken deal for you.",
    "Thanks for the offer, but I'm sort of in the middle of something currently.",
    "Hold on! Aren't you forgetting something?",
    "You said that you would release Jimmy! Are you going to keep your word or am I going to have to get angry?",
    "Good... I have things to do and I've had enough of people messing me about.",
    "Very well...but if you're lying, I'll be back and I won't be happy!",
    "Good news! Jimmy has been released by those fanatical HAM people! He said he was on his way back here!",
    "I've returned with good news. Aggie has agreed to be your character witness!",
    "What's that?",
    "Well... what's going to happen now?",
    "You have got to be kidding!",
    "Hey, how's it going?",
    "I've lost that sharpened hatchet you gave me? Can I get another one please?",
    "Good news, I have your sharpened hatchet!",
    "Yep, here it is... at long last!",
    "Why you ungrateful...",
    "Hi again, thanks for the red mahogany.",
    "I've lost that red mahogany you gave me!",
    "But I do not have 200 gold!",
    "Ok, here's 200 gold for some red mahogany.",
    "I won't pay you 200 gold for a piece of wood!",
    "Here's the red mahogany you asked for.",
    "Wait, that's it?",
    "What! I've traipsed halfway around Gielinor...",
    "I've negotiated with fanatics, dwarven gangsters and arrogant gnomes.",
    "I've fixed ancient weather vanes and gnomish landing lights and fought supernatural rock monsters...",
    "I've filled stodgy mattresses with feathers, made pot lids to help cure an ailing metal-smith... and that's all the thanks I get? Thanks!",
    "Raarrrhhhh!",
    "What is it?",
    "A key ring? That's it?",
    "Groan! Yeah, so did everyone else!"
  ],
  "Yanni Salika": [
    "You sound a bit bored of Shilo Village... what's wrong?",
    "Well, if you're bored, you could do me a small favour and nip to see the jungle forester. I need a piece of red mahogany to resurface an antique wardrobe.",
    "Well, if you've got nothing better to do... I mean, you looked bored.",
    "Cooolll! Sorry your most amazingness, didn't realise you were too above it all to do someone a favour!",
    "Give you? I don't think you heard me... I asked for a favour! It means that I'll 'owe you one' when you need something doing. That's what a favour is!",
    "Fair enough! Hope it all goes well... but, you know, you looked bored so I just thought I'd suggest it.",
    "Great, nice of you to do it for me.",
    "That'd be helpful!",
    "Oh, sorry, I thought you knew the area. You'll find a jungle forester in between the southern edge of Shilo Village and the Kharazi Jungle.",
    "They're always trying to find ways into that place.",
    "I hear that some old timer from the Legends Guild keeps sending new recruits down there... only Zamorak knows why.",
    "What do you mean?",
    "Tsk... It's only a little job bwana, I ask you to do me one small favour! Go to the jungle forester and get me a piece of red mahogany. It can't be that difficult can it?",
    "You're telling me bwana, I was supposed to have this wardrobe finished before now! Hurry it up will you, I don't have all day!",
    "Huh! You make it sound like a major undertaking! I should ahve just done it myself!",
    "Well, can't you just do my favour and forget about theirs?",
    "Well, that's absolutely wonderful my friend! Many thanks!",
    "Well... what were you expecting? I mean, it took you so long I could have gone and got it myself!",
    "Well, you didn't have to go to so much trouble...",
    "Look, I can see that you're quite upset about this... so here, have this.",
    "It's a key ring, you can store some of your most valuable keys on it... helps to keep things organised! It goes on your toolbelt!",
    "Well, I only asked you to do me one small favour...",
    "Oh... ok, I guess I could offer you these lamps... I'm not sure what they're worth, but you can have them."
  ],
  "Jungle forester": [
    "Oh, yes, well I can get you a piece but I need my hatchet sharpening... Do me a small favour would you and take it to Captain Shanks for me won't you?",
    "Great, here you go! If you could ask the Captain to pop it into Brian's Axes for resharpening when he's next in Port Sarim, that would be really helpful.",
    "He's the Captain of the 'Lady of the Waves', he goes to Port Sarim quite often. Could you ask the Captain to drop the hatchet in at Brian's Axes the next time he's in Port Sarim? I'm sure he won't mind!",
    "Wow, you're really not from around here are you? The Captain is to the west of here, follow the northern edge of the Kharazi Jungle, he's usually on board his ship!",
    "I gave you my blunt hatchet to give to Captain Shanks. I was hoping that he would be able to pop into Brian's Axes in Port Sarim to get it sharpened. I do hope nothing bad has happened to my hatchet, I am very partial to it!",
    "Take the blunt hatchet to Captain Shanks and ask him to take it to Brian's Axes.",
    "Well, yes, actually. It's my favourite! I've been training with that hatchet since I started my profession as a jungle forester.",
    "I know, another jungle forester found it and returned it to me. Here, take it again and this time don't lose it!",
    "Ah Great!",
    "Yeah, you've been a while... I mean, I could have just gone and done it myself! It probably wouldn't have taken so long.",
    "Hang on a minute... there's no need to get so angry... here's that red mahogany you wanted.",
    "Ok, thanks for getting my hatchet sharpened for me!",
    "No problem, one good turn deserves another as far as I'm concerned!",
    "Well, I can get you another piece but you're going to ahve to pay for my time...200 gp I work for.",
    "Sorry friend, I know you did me a small favour, but I have to earn a crust too!",
    "Many thanks my friend!",
    "Well, suit yourself, I can always find other customers."
  ],
  "Jungle Forester": [
    "You're supposed to take the hatchet to Captain Shanks and ask him to take it[sic] Brian's Axes in Port Sarim. I'm sure he won't mind."
  ],
  "Captain Shanks": [
    "A favour you say... hmmm. What is it?",
    "Darned cheek! I have a tight ship to run, my friend, and I'll thank you to not take advantage of my good generosity. I have a far superior solution to your problem.",
    "Take a ride with me to Port Sarim and take the hatchet to Brian yourself!",
    "Well... the choice is yours! Do like me and never do favours... you'll find yourself in a lot less bother I can assure you!",
    "I've said no already... now move along... I have a tight ship to run."
  ],
  "Brian": [
    "You know what, normally I do... but...",
    "But I'm a bit preoccupied at the moment. I'm worried that my friend is going to spend the rest of the year behind bars!",
    "Yeah, it is, but it shouldn't be. It was only a harmless pub brawl but he got caught up in it and they just jailed everyone.",
    "Except he says he's going to run away to the wilderness if he's found guilty and you know what blood-hungry scum inhabit those realms.",
    "Well, I'd like to, I really would, but I wouldn't be able to concentrate while worrying about my friend so much. I tell you want. If you could do me just one small favour, I promise to help you!",
    "Well, yes, if you wouldn't mind? Aggie the witch is a family friend and she's a pillar of the local community.",
    "I know, you wouldn't think it would you! Could you ask her if she'll act as a character witness for my friend?",
    "Oh, please. It would mean such a lot to me! Just ask Aggie if she'll be a character witness for my friend. She only lives in Draynor Village. It'll only take you a few minutes!",
    "Hmm, well you could try your luck in Lumbridge at Bob's Axes, though I've no clue if he offers this kind of service.",
    "He always seemed very focused on selling axes to blood-hungry killers keen to explore the wilderness.",
    "Oh, great, that would be really helpful! Here, give me the hatchet for safe keeping and I'll get it sharpened as soon as she agrees to help.",
    "You don't have any blunt hatchets on you!",
    "Well, come back if you need any help with it, we may be able to work something out.",
    "Go talk to Aggie and ask her if she'll be a character witness for my friend before he finds himself in jail with less than savoury people... or worse, he runs off to the wilderness!",
    "So it seems!",
    "Well, I wish I could be more happy, but I've just had some bad news.",
    "Well, it seems that my friend was even more desperate than I had originally realised. He's gone to hide away from the authorities in the wilderness... what a lunatic!",
    "I've heard that he's wandered into the lava maze in the most dangerous part of the wilderness!",
    "Well, I was wondering if you could do me just one small favour? Please could you go and fetch him back again for me?",
    "Well... yes... I was... actually!",
    "Here you go, here's your hatchet! And very many thanks for your help and a good laugh! You should have seen your face! Oh what a picture!",
    "Ok thanks. My friend passes on his gratitude for asking Aggie to be a character witness.",
    "Sure, here, you go."
  ],
  "Aggie": [
    "Not at the minute I'm afraid... I'm really worried! My new apprentice 'Jimmy the Chisel' has gone missing!",
    "It's sort of like a 'street name'... it's a new fad [Player]... perhaps you've seen it around? Anyway, it's not his name I'm concerned with, it's his whereabouts that worries me!",
    "Well, I sent him to Lumbridge to get some supplies and he hasn't come back! He left about two days ago and I've seen neither hide nor hair of him in all that time.",
    "Not really, I mean, not for definite. But I did hear old Ned talking about some strange activity in that old mine on the other side of the bridge in Lumbridge.",
    "It's probably nothing... but it would aid my old mind a lot to know that he was safe. I can't leave here until he returns. What if he's had an accident and needs some emergency magical attention?",
    "Would you my dear, it would only be a small favour... one small favour, that's all I ask.",
    "Could you go and check out that abandoned mine and see if there's anything odd going on. Just check to see if there's any sign of young Jimmy.",
    "Why you big meanie! He could be dead for all you know!",
    "Oh, thanks ever so much... I do appreciate it! Good Luck!",
    "Yes! He's just returned! I'll happily be a character witness for Brian now! Please let him know that I'll help his friend however I can."
  ],
  "PLAYER": [
    "What am I supposed to be doing?",
    "What am I supposed to be doing?",
    "Where am I supposed to look?",
    "What am I doing this for?",
    "Ok, thanks.",
    "Hello again.",
    "Thanks!",
    "What did you want me to do again?",
    "I only have [amount of cages].",
    "What should I do now?",
    "Oh, yes...I remember now.",
    "I've lost [amount lost] of the chicken cages!",
    "Ok, I'll pay, here's the pigeon cage(s) and [cost of cages] gold.",
    "Many thanks.",
    "No way I am paying for that!",
    "But I don't have [amount lost] pigeon cages..."
  ],
  "AGGIE": [
    "Well, I had hoped that you would go and look for 'Jimmy the Chisel'...but it looks like you've had other 'more important' things to do!",
    "Well, I had hoped that you would go and look for 'Jimmy the Chisel'...but it looks like you've had other 'more important' things to do!",
    "I don't know where he is! But I suggest that you check out that abandoned mine in Lumbridge, you know, the on[sic] the other side of the bridge! Doesn't look like anyone's been using it for years!",
    "Oh, I don't know, you mumbled something about 'witnesses', I just can't think straight worrying so much about poor little Jimmy. He could be lying somewhere in a pool of his blood, crying out for help... oooh, it's too much for me to bear."
  ],
  "Jimmy the Chisel": [
    "I'm Jimmy...Jimmy the Chisel...who are you?",
    "So...are you gonna bust me out of here then... Jail break! Great, how exciting.",
    "Oh, pity... well, you could speak to Johanhus...I think he's the leader.",
    "That's right.",
    "Blimey...the price of my neck for a few chickens...I'd say that was worth it...",
    "Great...many thanks."
  ],
  "Johanhus Ulsbrecht": [
    "Ah yes, he'll be joining our ranks very soon, I feel. He's still quite young and strong, but he will see the error of his ways before too long.",
    "Not at all... he just needs some time to think about things... we've given him all the time he needs in the cage back there.",
    "I'm afraid I can't do that... he has value to us... he's related to a farmer named Fred who lives near here. We need to arrange some things with this 'Brother Fred' so that my people down here can eat.",
    "Well, actually, now that you mention it... It would be a real help to us if you could organise some chickens in exchange for young Jimmy's release.",
    "Go to Brother Fred the Farmer and tell him that we have young Brother Jimmy. Tell him that we're not going to let him free until he agrees to send us a month's supply of chickens.",
    "Now, now Player, I'm a little disappointed in you! Can't you see that this is merely a business transaction? Come back and see me when you change your mind!",
    "That's exactly right! Do this for us and we'll let Brother Jimmy go!",
    "Welcome back Brother Player, how are your negotiations going with Brother Fred?",
    "Oh for the love of Saradomin...it's not too difficult! Go to Brother Fred and ask him to supply a month's worth of chickens in return for Brother Jimmy's freedom!",
    "Yes, of course... why didn't you ask earlier? Is that all you wanted? Huh! Of course, you do have the chickens don't you?",
    "Go get them then!",
    "That's a shame, because Brother Jimmy is getting older every day! His employer isn't going to be too pleased if you don't do something soon.",
    "Hmmm. Congratulations on your achievement, your help will ensure the success of our venture and we can surely take our efforts forward. Tell me, won't you consider joining our calling?",
    "Right... well please consider it an open offer... Ok then... thanks and goodbye.",
    "What? Sorry? Please calm down!",
    "Oh my dear friend... please... there's not need to get so upset...of course we're going to release Jimmy. Oh dear, you do take things a bit seriously don't you?",
    "Ok. I understand...please don't worry. I'll release Brother Jimmy now! Tell his employer that he'll be there shortly."
  ],
  "Fred the Farmer": [
    "What's the problem with Jimmy?",
    "Oh dear, oh dear, this is terrible. Terrible!",
    "I've no idea what to do!",
    "Well, no actually, I'm just a farmer. I've no idea how to deal with fanatics!",
    "Normally I'd say yes, but I just don't have enough for a month's supply.",
    "Seth does. Seth Groats. He's another farmer over yonder at the other farm. Over the river and on the way to Varrock, he has loads of chickens.",
    "Have you been to see Seth Groats yet? He's over at the other farm on the way to Varrock!",
    "And what did he say?",
    "Well, that's great...good old Seth!",
    "Oh, that's wonderful...many thanks for your help...just wonderful."
  ],
  "Seth Groats": [
    "Hello there stranger, what's the meaning of this intrusion? A farmer's hovel is his castle!",
    "A month's supply eh! Well, I was going to take them to market and just concentrate on the cows, but I reckon that little Jimmy's neck is worth a few scrawny chickens, don't you?",
    "Well. Ok then. We need to get this organised. First off, we need to get some proper cages to get them chickens transported. I've never normally transported chickens in such large quantities before.",
    "We'll need to get them some proper cages, but I have nothing like that here. You'll have to go and see my friend Horvik in Varrock. He's a pretty well known metal-smith and he's done me a few favours in the past. I'm afraid that I'll have to ask a small favour of you as well, my friend.",
    "Could you get three bars of steel and take them to Horvik, that's what I owe him for a previous job that he did for me.",
    "I understand... Poor old Jimmy, locked in that cage... Forever!",
    "Many thanks! Remember, you need to take him three steel bars.",
    "You need to get three bars of steel and take them to Horvik in Varrock, ask him if he can make some chicken cages so that we can transport these chickens to those fanatics and release poor Jimmy.",
    "How are those chicken cages coming along?",
    "Well that's great! Well done! You can go and talk to those fanatics now and tell them that they'll get their chickens and they can let little Jimmy the Chisel go! Once again, thanks for your help.",
    "How are those chicken cages coming along?",
    "Well, I need at least five! Combe back when you've got that many!",
    "Thanks for getting us those chicken cages...you can go and talk to those fanatics now and get Jimmy released."
  ],
  "Horvik": [
    "Hmmm, Seth eh! He's a good friend, but he still owes me three steel bars for a plough I fixed. I'm sorry but I need to have that paid off first before I can do any more work for him.",
    "I'm sorry to be so harsh, but I have to ensure the debt is paid before I do any more work for Seth.",
    "Ok then! Great... tell me a little more about these chicken cages... Cough Cough Cough!",
    "No, I'm not actually, I'm quite ill!",
    "I'm sorry, but the most I can manage today is simple trading... however, if I was to get some medicine say, I could be persuaded to do you a small favour!",
    "Well, just one small favour... and then I'll do you a small favour.",
    "Well, I'm sorry about that...but I just can't work when I'm feeling so ill.",
    "Well that's jolly decent of you my friend. I need some medicine, could you get me some herbal tincture and breathing salts, that should solve my ailments!",
    "That's great! However, I must warn you. It'll be a lot easier for me to simply adjust some existing pigeon cages. If you could get me five or so of those, that would help a lot.",
    "But first things first, bring me the medicine!",
    "Please can you get me some medicine? I need herbal tincture and a pot of breathing salts. Also, get me five or so of those pigeon cages that they have over in Ardougne so that I can convert them into chicken cages.",
    "Great! Let's have a look at them then!",
    "Wonderful! That's just great! I just need the pigeon cages now.",
    "Great stuff... let's have them here then! Ah, I can turn my hand to a bit of woodworking on these, great, I do it as a hobby.",
    "There you go then! There's your chicken cages!"
  ],
  "Apothecary": [
    "No problem!",
    "There you go! There's your herbal tincture!",
    "No problem, pleased to help.",
    "Oh, yes, breathing salts... erm, just let me look around, I'm sure I have some around here.",
    "Yep, here they are...",
    "Oh blimey... I've dropped the pot and smashed it!",
    "Oh no, you don't understand. They're ruined. They're supposed to be kept in an airtight container and this was my last one.",
    "I can't order any more until I have a new airtight container. And they were a top selling item as well.",
    "No, I can... I can order plenty, but they'll lose their effectiveness. I need an airtight pot to keep them in.",
    "I've no idea really, this pot was a family heirloom. I guess you'd have to get a new one made?",
    "You could try Tassie Slipcast over at the Barbarian Village. She's a potter there and may be able to make one. But mind, it has to be air tight.",
    "I understand...they're all barbarians over there.",
    "Wonderful, I'd really appreciate it!",
    "Yes, I know, but I smashed the pot which held them remember!",
    "Go and see Tassie Slipcast in the Barbarian Village about making an airtight pot for me to store my breathing salts in, then you can take some for Horvik.",
    "No problem, I'll just rustle up another one for you.",
    "Wonderful, let me see!",
    "Huzzah! You have an airtight pot! Wonderful! Ok, let me get some breathing salts into this thing for you!",
    "That's great! Many thanks friend... here's your breathing salts!",
    "You mentioned something about Horvik, weren't you supposed to take those breathing salts and that herbal tincture to him?",
    "Hmmm, it'll cost you another airtight pot, plus 200 gold! I don't have time for people who don't look after stuff I give them.",
    "Thanks for your custom.",
    "Well then, you can't have more breathing salts can you!"
  ],
  "Tassie Slipcast": [
    "I beg your pardon!",
    "Who on earth do you think you are coming in here demanding an airtight pot... Can't you see that I have my own worries to think about?",
    "Well, if you must know, I'm working all the hours that Saradomin sends, I have to in order to make enough money to pay that loan shark Hammerspike!",
    "I took over this abandoned pottery place with a loan from Hammerspike. He's demanding payment and I can barely just make the interest payments.",
    "I'm working as hard as I can but I'll never pay the loan off at this rate!",
    "Well, that may be, but I have a rush order for a top paying customer that's going to keep Hammerspike off my back for a bit.",
    "If you really want that pot, you're going to have to deal with Hammerspike in the dwarven mines!",
    "Really, you will?",
    "Well, that would be really great... I just hope he doesn't grind you into flour to make his bread, he's one of the most ruthless gangsters in the area.",
    "Beware, his guards are incredibly loyal, they'll slit their own throats to protect him!",
    "He's in the dwarven mines somewhere, not sure exactly where though.",
    "Oh, well that's a real shame, I was hoping you could have sorted out that Hammerspike for me once and for all!",
    "So I see. What's the problem? Did you sort out Hammerspike?",
    "Go talk to Hammerspike in the Dwarven mines and see if you can get him to leave me alone...I won't be able to make you the airtight pot else.",
    "Really! Fantastic! Oh, I'm so grateful! Thanks so much! How ever can I repay you?",
    "I'll do better than that! I'll show you how to make an airtight pot! First of all, you'll need some clay... here's some I have spare!",
    "Now, while pots are quite easy to make, lids are a bit different. They have to be quite precise to fit the pot exactly, which is why you have to be quite experienced to make them.",
    "Ok then, just use it on the wheel over there!",
    "Please feel free to use the pottery wheel, I won't be using it all the time. Put your pots in the kiln when you've made one. And make sure you tidy up after yourself!"
  ],
  "Dwarf gang member": [
    "Yeah... whada you want?",
    "Well, he's around here somewhere, just use your eyes, I'm sure you'll get there one day.",
    "Well, as if it's any of your business, I'm an associate of Hammerspike. He's a great dwarf you know. You could learn a lot from a dwarf like him.",
    "I have an ongoing contract with Hammerspike, when he gives the word, the hammer starts flying.",
    "Ha ha ha ha! Good one boss, I can't believe [he/she] fell for that!"
  ],
  "Hammerspike Stoutbeard": [
    "And who da heck are you?",
    "And what if it is? Tassie got into an arrangement that is mutually beneficial, as far as I understood it, she was happy with the deal.",
    "Oh, so you wanna give me something for leaving Tassie alone?",
    "Where would I be if I just left all of my 'customers' alone? Some people just need a little extra 'encouragement' to make the best out of life... I'm just helping them along.",
    "Well... now that you come to mention it, I guess I have been a little hard on the girl.",
    "And I guess I am quite stressed about things, what with so much to think about recently.",
    "Hmm, yes, yes you're right... I did want to do something, something I noticed recently, but you'll laugh if I tell you... nah, it's silly.",
    "Well, I was just thinking the other day that I'm feeling sort of unfulfilled in my life.",
    "I'd like to get rid of all this anger and frustration that my current lifestyle brings and so something relaxing... like those druids, I mean, all day sitting around, looking at herbs and wearing robes and stuff.",
    "Yeah, yeah, I really want to be a druid... so... go and see the druid leader, I think Sanfew is his name, and persuade him to take me as an initiate. Do me this one small favour and I'll leave Tassie alone.",
    "Whatever... I guess Tassie's gonna be working hard for a bit longer yet then!",
    "Good... I mean great! Come back when Sanfew has agreed to take me as an initiate!",
    "And what's wrong now?",
    "Go and talk to Sanfew and get him to accept me as a druid initiate!",
    "Oh, it's you! Back are you then?",
    "Ha, ha ha ha! How funny is that! I've gone and changed my mind now! I've decided that I make a far better gangster than I ever would a druid!",
    "My men are going to deal with you!",
    "Attack!",
    "Well... sure if you're not full of surprises then... I guess I'll have to either hire more men to try and kill you or forget Tassie's loan.",
    "Ok then, fair enough... I'll leave her alone... but I'm going to deal with you personally one of these days!",
    "You looking at me? I don't see nobody else here!"
  ],
  "Sanfew": [
    "Hmmm, are you considering yourself?",
    "Hmm, it's quite a straight-forward process. A person, perhaps like yourself, comes along to me and asks. We test your knowledge of Herblore and see if you can fit in with the rest of us. If you pass, then we let you become an initiate.",
    "Dwarves? Well now, that's a mighty interesting question... Just because we haven't before, doesn't mean to say that we shouldn't.",
    "Oh yes? Well, that's interesting. Let me think for a moment. Hmmm... yes, actually, I don't mind taking him on, so long as you can do me just one small favour. Well, two actually.",
    "Stop interrupting me, I haven't told you about these favours!",
    "There's a poor little gnome up on White Wolf mountain. I wondered if you could take him a warming potion. I have the recipe here!",
    "In addition...",
    "I've long wished to take a trip down to see those ogres to the south of Yanille, and bring the word of Guthix to them. I was hoping you might organise this trip with the gnome pilot up there on White Wolf mountain.",
    "Well, perhaps a bit... but it's never stopped you doing things for me before.",
    "Well, that's the life of an adventurer. Is it a deal, or not?",
    "All you need to do is add clean harralander to a vial, then add clean marrentill. It'll warm that poor fellow up a treat!",
    "We call it 'Guthix Rest'.",
    "If you want!",
    "But you'll have to make another one for the gnome.",
    "Yes, but you'll have to make another one for the gnome.",
    "Well, that's a shame. I was looking forward to visiting the ogres... Perhaps someday I will.",
    "Make a Guthix Rest potion for the gnome and persuade him to take me to the ogre area, down to the south!",
    "All you need to do is add clean harralander to a vial, then add clean marrentill.",
    "He's agreed to take me? Well, that's wonderful! Many thanks.",
    "Please tell that dwarf that he's welcome to come here and train to be an initiate."
  ],
  "Captain Bleemadge": [
    "Brr, blimey it's cold up here! Wish I had something nice to drink to chase away these chills!",
    "Ohhh! Many thanks! Brrr, blimey it's cold up here!",
    "Blimey, it was certainly jolly decent of that old stick Sanfew to get you to make me that potion. Wow! It really does chase away the chills!",
    "Ogres!",
    "Hmmm, well I guess they're just like overgrown gnomes when you think about it!",
    "Quite! Anyway, go on! What was Sanfew after?",
    "Yes, quite, but who amongst us does? I know I'm often confused by that beardy bunch of yakking druids.",
    "Hmm, interesting! I know that the elders want to extend the network of glider routes, and I did hear that the Feldip Hills were being considered. I don't know why it hasn't opened up yet though.",
    "If I'm going to transport that yakking druid down to the ogres I'll want to make it in record time so I'll need some lighter kit.",
    "There's a chap called Arhein in Catherby and I've heard that his special interest in ships has helped him to produce lightweight but strengthened ropes. I'm in need of some T.R.A.S.H.! And I need you to get it for me.",
    "I'm talking about the next generation of lightweight ropes. Triple Redundant Aero Super Hawser... T.R.A.S.H. I'll transport your yakking druid if you can get me some T.R.A.S.H!",
    "And you have to get it because I have to stay here with this gilder. Is it a deal?",
    "Go to Arhein and ask him for some T.R.A.S.H...",
    "T.R.A.S.H is a short way of saying, 'Triple Redundant Aero Super Hawser', it's a technical term that we gnomes like to use when specifying lightweight rope.",
    "Go and talk to a chap called Arhein in Catherby, he's developed it so he'll know exactly what you're talking about.",
    "Wonderful, my friend, wonderful!",
    "Well, that's a bit of a shame...I was looking forward to upgrading my glider!",
    "It was delicious, thanks!",
    "Go to Arhein in Catherby and get some T.R.A.S.H... that's a short name for Triple Redundant Aero Super Hawser... and then bring it back to me!",
    "Oh yes, thanks... I've already installed it. I should go like the wind now! Tell Sanfew, that yakking old druid, I'll be happy to take him to the ogre area now... and yourself, of course, if you should like to go."
  ],
  "Arhein": [
    "Oh yes, well it won't be the first time... but just so I'm sure can you explain what you mean?",
    "Well, I've done a lot of research into Triple Redundant Aero Super Hawsers and it seems to have paid off, but answer me this one question. Why are you asking me about this rather than the Gnome?",
    "Hmm, really, is that so? Well, I do have some Triple Redundant Aero Super Hawser and I'll let you have some if you do me just one small favour.",
    "No, this really is a quick thing and shouldn't take you longer than a few minutes.",
    "I'm funding a rather expensive trade run to Brimhaven soon, and I want to be sure that the weather isn't going to change and cause my ships any trouble.",
    "The last thing I need is a load of goods going straight to the bottom of the ocean.",
    "I just need you to pop along to Seers Village and ask those philosophers of foresight for a weather report. I believe a new seer there called Phantuwti can help you.",
    "That's great, many thanks.",
    "Go to Seers Village and ask the new chap there, Phantuwti, for a weather report...then I'll give you the Triple Redundnt Aero Super Hawser.",
    "Fantastic... let's see it!",
    "Wonderful... well the weather report is slightly unspecific, but I feel much better anyway for getting it. Hopefully now the Seers will take some responsibility if my ships go down to the bottom of the ocean.",
    "I'll get one of my associates to take some T.R.A.S.H to your Gnome Gilder Pilot friend on White Wolf mountain. Once again, many thanks for your help."
  ],
  "Phantuwti Fanstuwi Farsight": [
    "Hmm, somehow I knew you were going to ask me that... strange... life is so predictable when you have the power of foresight.",
    "Alas my presumptuous friend, the power of foresight and the impulse to act is quite similar to the interplay between intelligence and wisdom.",
    "One might have intelligence enough to realise that cakes are bad for us, but we may not have the wisdom to stop cramming that delicious-looking fatty cream cake into our salivating mouth.",
    "Not exactly lazy... but unable. My attention has been focused on the fate of a local girl whose association with a certain wizard has landed her between a rock and a hard place.",
    "The girl's name is Petra, she's a very... energetic youngster, always wanted to travel and have adventures. When she turned seventeen she set off to earn herself fame and fortune.",
    "It looks like she's ended up in a bit of a dead end position...",
    "It's quite difficult to pinpoint exactly where she is, but apparently she's in some sort of cavern structure.",
    "We sense that there are other beings around her, smelly creatures, and some sort of presence watching over her.",
    "Well, we believe it may be some sort of nearby cave, it can't be very far away as the impressions we get are quite strong. We believe the cave is a home for some sort of creature or creatures.",
    "Well, it would be nice to locate her... if possible. Then we may be able to work out what to do when we can see what sort of state she's in.",
    "Well, that's a bit of shame, I have to say... we all miss our Petra!",
    "Do you think you could do me a small favour? Check around the vicinity. The impressions are coming from a south westerly direction.",
    "Don't go further east than you are already, no further south than Ardougne and no further west than the combat training camp.",
    "Well, I wouldn't have put it quite that way...",
    "Great! I just knew you'd agree to help!",
    "I knew you wouldn't help...oh well, perhaps some day you'll surprise me.",
    "Hi there, yes she has actually! Well done, you're a true hero!",
    "I wish I could but it's just been so difficult to get a clear image of the future at the moment. You know... we're all so relieved that Petra has returned and all that.",
    "Er... no, I can't, I told you, I can't get a clear picture. Nope, sorry, the conditions are just not quite right.",
    "Well, it's complicated, the special Seers tools that help us predict the weather are not aligned properly...",
    "I'm not making you angry, you're doing that all on your own! I just don't have a weather report to give you!",
    "I can't help that, you should be more understanding and less forceful, then I might be persuaded to give you the weather report.",
    "Well, we use a special combination of items which are used to gauge current weather movements and we're able to predict future weather patterns from these. Of course, it's strongly linked to the Seers' foresight ability.",
    "Well, let me think now... There's a copper eye, a rotating thing, and some pointy direction thingies. It's all highly scientific – and of course mystical – in a very magical 'foresight' sort of way.",
    "Er... maybe... I may be talking about that...",
    "Erm, well... err...",
    "What for?",
    "Oh, very well... but you'll need to be a specialist to fix this weather vane, it was made by some of the most experienced...",
    "Ok, ok, it's up on the roof...",
    "Since when has any Seer ever given you a straight answer... the power of knowing the future and the visions we see have to be wrapped in allegory so that the truth can slowly be accepted by the listener.",
    "How can you be sure? Are you so sure of what you just asked me? And am I really avoiding your questions by asking you lots of other questions? Answer me that huh!",
    "Anyway, we need a special combination of items before we can truly have foreknowledge of the weather.",
    "Quite hard actually. I mean, you're still waiting for me to do it aren't you and I've told you time and again that I can't... right now... but that normally it's actually quite an easy thing for me to do.",
    "Hmm, well, you can come back in several months and see if we can do one for you...does that help?",
    "Why... how dare you... I've never been so insulted in my life.",
    "Well, nothing in fact, as I can't give you a weather report. I'm sorry, but that's just the way it is.",
    "I would really like to, please believe me, I would, but I just can't.",
    "Well, that's not very nice... I mean, I'm a nice guy and I thought you were nice too! Why would you want to run me through? I mean, it's only a weather report.",
    "It doesn't make sense to get angry about something so trivial.",
    "Fantastic, come and let me know when you've finished.",
    "Oh, thanks so much... you can't believe how helpful it is to get accurate predictions on the weather... we Seers are almost blind without it.",
    "There you go... a weather report as asked for... I hope it helps you!",
    "I've no clue my friend, you mentioned something about Arhein, but your plans might ahve changed in the meantime.",
    "Well, I knew you were going to say that! Here you go...have another one!"
  ],
  "Wizard Cromperty": [
    "Eh!",
    "What? I have no clue what you're talking about! Now, please excuse me! I need to get back to my experiments!",
    "Oh dear, it's such a bother getting them back out of the rock walls and I do loathe the trip to Port Khazard for the components.",
    "Well, it's not the first time someone's been teleported into a rock face, just the slightest miscalculation and bang... they're in the wall!",
    "It's fairly straightforward to cast a spell and fish them out again – but it requires a spell component from a chap in Port Khazard.",
    "I don't suppose you could do me a small favour could you?",
    "Just one small favour? Pop along to Port Khazard and get some iron oxide, it's a component of the spell.",
    "Oh dear, what a shame...I just don't have time to deal with this now...she's safe where she is for now, and I'm sure I'll get to it sooner or later.",
    "Waaahaaay! Great! I'd never suspect you'd be so helpful!",
    "You need to talk to a chap called Tindel Merchant in Port Khazard, he's sort of like an antiques dealer.",
    "Well, off you go then! A journey of a thousand miles starts with the first step and all that!",
    "Of course not... you silly... just... you know... the sooner you start the sooner you can get back... that's all I was saying.",
    "Go to Port Khazard and get me some iron oxide from Tindel Marchant.",
    "Great! Just what I needed! Now I need to give you a spell scroll to help bring Petra back again.",
    "Just cast this in the room, it should have her out of that rock in a jiffy! Good luck with your exploits... now, where was I with that wranklin severance device...",
    "Well, I thought you were going to use that spell I gave you to free Petra from the rock face?",
    "I suspected that you might...you can have one, but it will cost you 100 gold pieces.",
    "Well, I did give you the last one for free...you're not getting another one for free, even if it is my mess that you're trying to clear up! You shouldn't be so careless to leave things lying around!",
    "Thanks...try not to lose it this time."
  ],
  "Tindel Merchant": [
    "As a matter of fact, I do! However, it's the last in stock and I'm not likely to get more for a while so it's highly prized amongst the wizards at the moment.",
    "It's not easy to get so much rust together, even if I do come across it more often than most people with cleaning these rusty swords up!",
    "Yes, iron oxide is more commonly referred to as rust. As for a price, hmmm... well... let me think now... I could give it to you for the price of...",
    "One small favour!",
    "I need a nice mattress to sleep on! I haven't had a decent night's sleep in an ice-age... could you take this stodgy mattress down to Rantz in the ogre area and ask him to fill it with prime chompy bird feathers please?",
    "Well, er, I wouldn't have said it quite that way...",
    "Great, many thanks indeed! Here's the mattress!",
    "Well, that's a shame, but come back and see me if you change your mind.",
    "Take that stodgy mattress down to Rantz the ogre and get him to stuff it with prime chompy bird feathers. I want it to be the most luxurious mattress in the whole of Gielinor. I work so hard, I need a good night's sleep! You wouldn't believe some of the shoddy stuff some people try to palm off onto me! I have to be sharp to catch them out and make sure I can make a living.",
    "Yes, but I had to pay for this myself so you'd better pay me for losing my last one...it cost 100 gold!",
    "Ok, thanks a lot, here's the mattress!",
    "Well, don't expect your iron oxide any time soon then!",
    "Good!",
    "Get out!",
    "Grrrr!",
    "Great! Let's have a look then.",
    "Great! Here's the iron oxide I promised you!",
    "Didn't you need to take that bottle of rust to someone?",
    "Ok, but I'm going to have to charge you I'm afraid, 200 coins.",
    "Suit yourself...I have plenty of other customers."
  ],
  "Rantz": [
    "You's creature shuvs flapper sack in Rantz face, making Rantz very upset.",
    "Der's no flappers to get cos da little guy scares dem away wiv his banging. He's making da man flapper 'come-down-place' and it's takin' ages and ages.",
    "Da chompies don't come no more since he's banging all da time.",
    "Da little guy, he's making da man flapper 'come-down-place'... so deyz more of yous creatures coming to see Rantz... but he's takin ages to do it.",
    "You's can help da little guy, he's over der near da ogre city... he's stuck wiv sumfing, making da man flapper 'come-down-place'. Me's not doin' no chompy hunting wiv dat noise going on.",
    "Dat would be da good fing... den me's help wiv da flufsies sack.",
    "Yous creature, go see little guy and help wiv da man flapper 'come-down-place'...den Rantz helps yous creature wiv da fluffsies sack.",
    "Yous creature dun a gud fing... Rantz give yous creature da fluffsies sack now...",
    "De're yous goes creature... da fluffsies sack is full now.",
    "Yous creature needs to bring me da saggy fluffsies sack to full wiv da chompy flufsies!",
    "It cost you dis many bright pretties to do dis again, yous den be more careful wiv my work next time round.",
    "De're yous goes creature... da fluffsies sack is full now.",
    "Den yous no get da fluffsies sack..."
  ],
  "Gnormadium Avlafrim": [
    "Hello! Don't get in the way around here, we've got a lot of work to do!",
    "Well, it's quite exciting... we're extending the glider network to include the Feldip Hills so that people can come and look at these curious ogres.",
    "They are impressive creatures aren't they... quite mystified they are by the technology we gnomes have invented.",
    "Well, people will be able to visit this area once construction has finished by using the most advanced network of glider routes in the whole of RuneScape... in fact... the only network of glider routes!",
    "Not really, I'm afraid, it's probably all far too technical for someone like you.",
    "RANTZ! GULP! Well, that would be nice actually! We are having some problems with getting the landing lights to work... do you think you could take a look at them?",
    "I expect that it's far too complex for you, but hey, you may be able to do something!",
    "Ok then... well, just pop over and let me know if you're not sure what you're doing... I'm sure that I'll just have to fix it myself anyway. If you need any materials, just pop over.",
    "Yes, well I expected it might be a bit too complex for you...we Gnomes lead the way you know with technical things like this...world leaders you might say.",
    "Go and take a look at those landing lights and see if you can get them to work would you...they've been as dull as an ogre conversation since we started working here.  Come back and tell me if you actually manage to get them fixed.",
    "Hello! Don't get in the way around here, we've got a lot of work to do!",
    "Well, it's going to cost 500 gold for a new one.",
    "Hmm. That seems a tad unlikely to me, but let's flick the switch here and see, shall we?!",
    "I don't believe it... you fixed it! Well done... Well done... we can pack up now and leave these ogres in peace.",
    "No thanks... you've helped enough by fixing those lights!",
    "Great thanks now that you've fixed the landing lights...I must admit, I was surprised you managed to pull that off. Are you sure you don't have any gnomish ancestors? Your insight into technical things is quite amazing for a human?"
  ],
  "Petra Fiyed": [
    "Oh thank goodness you released me... how long have I been stuck in that gloomy wall?",
    "Well, at least I'm ok... thanks to you! Last time I get involved with that Cromperty lunatic... in fact I have some words to say to that man!",
    "Oh, right, yes, well I guess I'd better go back there and let them all know that I'm safe then. Ok, thanks... I'll be off now and once again thanks for your help."
  ],
  "ARHEIN": [
    "Many thanks for bringing me the weather report, one of my associates has taken some T.R.A.S.H to your Gnome Glider Pilot friend on White Wolf mountain. Once again, many thanks for your help."
  ],
  "Dwarf gang member [1]": [
    "Rahhhhh!"
  ],
  "Dwarf gang member [2]": [
    "Rahhhhh!"
  ],
  "Dwarf gang member [3]": [
    "Rahhhhh!"
  ],
  "HORVIK": [
    "I need you to get me five pigeon cages, apperantly you can get them from Ardougne. When I have them, I can convert them into chicken cages for you.",
    "Well come back when you have 5, that should be enough for old Seth.",
    "Didn't you say you had to take those chicken cages to Seth Groats for some reason?",
    "Well, Ok, I'm going to need [amount lost] more pigeon cages to convert them, plus some money for my time, say 100 gold per cage?",
    "There you go then!",
    "Suit yourself then!",
    "Sorry, but you'll have to get some so that I can convert them."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:One_Small_Favour?oldid=36067064’"
  ]
}