{
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "additional dialogue optionsYou can discuss this issue on the talk page or edit this page to improve it."
  ],
  "TzHaar-Xil-Tog": [
    "What you want, [Title]-[Caste]-Player?",
    "I tell you what happened! Big creature dug tunnels under TzHaar city and TzHaar-Xil-Tog will kill it!",
    "We are strong enough!",
    "You big champion. You save TzHaar from TokHaar.",
    "Leave fate of city in hands of JalYt?",
    "Fine, but make sure you kill TokTz-Ket-Dill, too, so it does not dig more tunnels.",
    "Are you not [Title]-[Caste]?",
    "That what you are...you tough and strong, no?",
    "That what you are...you agile and quick, no?",
    "That what you are...you user of mystic powers, no?",
    "That what you are...you skilled at making things, no?",
    "And you are JalYt no longer. You are TzHaar now.",
    "Then you [Title]-[Caste]!",
    "Poor JalYt.",
    "I am TzHaar-Xil, one of the hunters for the city. We battle volcanic monsters and provide food and supplies for all TzHaar. There are also the wise TzHaar-Mej who guide us, the mighty TzHaar-Ket who guard us, and the skilled TzHaar-Hur who craft our homes and tools.",
    "Well, then. There is no problem.",
    "Whatever you say, JalYt!",
    "Then it is an honour to speak with you, TzHaar-[Caste]-Player. You great and powerful TzHaar, and defender of our city.",
    "I heard you are modest, TzHaar-[Caste]-Player. No need. Revel in our praise. You deserve all honour.",
    "Are tunnels fixed and TokTz-Ket-Dill killed?",
    "TzHaar-Xil-Tog is impressed, [Title]-[Caste]-Player. I did not take you for a hunter."
  ],
  "Player": [
    "What has happened here?",
    "A...TokTz-Ket...Dill, eh? I met some of those on my journey to the Kiln. Big claws, stone plate armour? Right?",
    "A...TokTz-Ket...Dill, eh? A big lava monster?",
    "You mean...an armadillo? In the volcano?",
    "Haha. I always thought TzHaar ate rocks.",
    "I see. Well, why don't you just clear the rubble, then? You look strong enough for the job.",
    "Can't you just fill the tunnels with rocks or something?",
    "Hmm. Maybe I'm small enough to fit through? And I'm more than capable when it comes to constructing things, so I should be able to repair the tunnels, as well.",
    "I defeated the leader of the TokHaar. A mere TokTz-Ket-Dill should be no match for me.",
    "Alright, I can do that.",
    "Oh, that's a shame. Well, I hope it works out for you.",
    "Well, yes, I suppose I am...",
    "Nothing.",
    "I'm here to help stabilise the tunnels under the city and kill the beast that dug them. The TzHaar over there told me to talk to you as you're the guard of the tunnel entrance.",
    "I've already saved your city once, you know. All that business with the Ga'al and the TokHaar? That was me. Plus, I'm small enough to get through the crack.",
    "But I'm the only one small enough to get through the crack.",
    "I'm very good at Construction and could easily repair a few tunnels.",
    "Hmm. Alright, what do I need?",
    "What? Could you say that in...you know, non-TzHaar?",
    "I'm sure I could get what I need, but I don't understand what the words mean.",
    "But then how will I be able to help you?",
    "Nothing.",
    "I don't understand this list. I recognise the symbols as numbers I found in an old journal, but I don't understand the words.",
    "I don't understand this list. It has some weird symbols on it and words in TzHaar.",
    "Nothing.",
    "Sorry, but could you tell me again where you got these...uh...\"books\" from?",
    "I've got this list of various items I need to gather, but there are a bunch of weird characters and words I can't understand. TzHaar-Ket-Grol wasn't very helpful in translating, so he sent me here to study.",
    "Yes, it is. So, would you help me?",
    "Alright, and where is the JalYt section?",
    "Er...it looks to me like that bookcase is filled with ashes.",
    "But...they are actual ashes, not books.",
    "Okay, let's call them books. So...how do you read them? I mean, they're ash- er, books.",
    "But that's not what we use. We use books. Paper. And we write on it.",
    "Ah, I think I understand now. The books must've been burnt when they were brought into the volcano.",
    "No, I mean...er...nevermind. Anyway, maybe you know what these words mean?",
    "Fine. Well, can you at least tell me where you got the book from? Whoever wrote them must know.",
    "Alright, thank you.",
    "A TzHaar library, eh? I didn't know the TzHaar had libraries. Or knew how to read, for that matter.",
    "How come the bookcases in the back are full of ashes?",
    "How are you supposed to read ashes?",
    "Alright...well, I'm off now. Bye.",
    "No, thanks.",
    "Hello, Reldo. I've just been in the library down in the TzHaar city where I found the ashes of a book-",
    "Oh no, not at all. The heat from the volcano caused them to burn and the TzHaar simply think that the ashes are what we humans read.",
    "Anyway, one of the books apparently contained a dictionary of some sort. I have a couple of words and characters in TzHaar that I need translating. The TzHaar librarian couldn't help me, so I figured I'd go to the person who sent them the books – namely you.",
    "Alright, I'll get looking then. Thank you.",
    "Hello, Reldo. Could you remind me where I could find that book on the TzHaar language?",
    "Alright, thank you.",
    "I read this book that told me a bit about the TzHaar language, so I know what to bring now.",
    "First, I need a pickaxe.",
    "Some oak planks. I need to have a TzHaar treat them to make them resistant to fire.",
    "Finally, I need some blocks of stone. The kind you use come from your own mines, so that's where I should get them as well.",
    "Alright, thank you.",
    "Nothing at all.",
    "I've forgot what I was supposed to do now.",
    "Nothing.",
    "Can I go in here?",
    "What are you guarding here?",
    "How come? Is there some sort of top secret project going on beyond this tunnel?",
    "Ah, I see.",
    "Nothing at all.",
    "Can you treat these oak planks for me? I need them to be fire-resistant before I can start repairing the tunnels.",
    "Here you go.",
    "I've changed my mind.",
    "No, not yet.",
    "Who are you?",
    "It doesn't seem to be the most active place to guard.",
    "Haha. Boring job and ungrateful clients. That's just wonderful.",
    "I see. So if I ever want the gossip, I should come to you then?",
    "I'll keep that in mind, thank you.",
    "No, thanks.",
    "Who are you?",
    "Did you say...play writer?",
    "I didn't know the TzHaar did theatre...",
    "I see. Well, good luck with that.",
    "How come you're just standing around here when everyone else is busy mining?",
    "Then maybe you could teach me magma mining?",
    "That sounds rather pointless.",
    "You are the only TzHaar I've ever met who has even mentioned TzHaar plays.",
    "Can you teach me magma mining?",
    "I'm sure they will.",
    "You have fun, then.",
    "Oh, alright.",
    "I've been told I have to learn how to safely mine through magma, and I also need access to your mines here to get some rocks for a repair. Maybe you could teach me?",
    "But you don't look very busy and one of the TzHaar guards told me I should come here to learn.",
    "But it's very important! I need to learn so that I can enter the tunnels below the city and repair the damage caused by some big rodent. If I don't, the tunnels risk collapsing, destroying the TzHaar city!",
    "The entrance into the tunnels is too narrow for a TzHaar to get through, that's why they asked me to do it.",
    "But of course you want something for your trouble...",
    "Alright, what do you need? Four buckets and a piece of clay? Five iron ore and a rare feather from a long lost species of birds? Any dangerous beasts in trap-filled dungeons you need slaying?",
    "Hmm. And how do you suggest we go about doing that? Convincing ANYONE that theatre can be good is a challenge. I don't think convincing a TzHaar will be any easier.",
    "No! No! Not like that.",
    "Okay, so what is the plot of the story?",
    "Doesn't sound too bad, I suppose. I'll see what I can do.",
    "What if I pay you? I could probably scrape together some TokKul to make it worth your trouble.",
    "Oh no! Not like that at all. But alright, if you don't want TokKul, maybe I can help you out with something?",
    "Fine, I'll go somewhere else.",
    "No, I'm fine, thanks.",
    "Could you give me some hints on how to make them all happy with the play?",
    "Alright, I'll keep that in mind. Thank you.",
    "Could you tell me about the miners' relations? Who likes who, and so on.",
    "I've changed my mind. I don't want to know about any of them.",
    "Could you tell me what the miners' current moods are?",
    "No, thanks.",
    "It was going well for a while, but I seem to have made some changes to the plot that were highly unpopular.",
    "Alright, I will start working from there again.",
    "What is the current plot of the story?",
    "I think the plot could do with some changes.",
    "I don't think anyone should get killed. All the villain should do is rob or the play might send across the wrong signals.",
    "How about this? The second human this evil TzHaar attacks is a strong warrior. It could be someone who's been training with the Void Knights for months! Anyway, so the TzHaar attacks another human and the human pulls out an abyssal whip and defeats the TzHaar.",
    "What? Have you been outside of the mines recently? Humans are very capable fighters.",
    "Maybe unprovoked violence from a TzHaar isn't the best way to start the story. What if the humans who get killed were killed in self defence? Then this first kill could spark a hunger in the TzHaar, which drives him to commit more crimes.",
    "It may not be a good idea to pit the TzHaar directly against each other. What if the crimes are only directed at humans? The play could show how the TzHaar act together to stop the criminal in order to keep the peace with the other races.",
    "I think the TzHaar would find it more interesting if it was only about them and didn't have any humans involved.",
    "I've got good news, TzHaar-Hur-Brekt. All the miners are happy with the plot now, so we can move on and start handing out the roles.",
    "I've still got some stuff to do.",
    "Hmm. I'll talk to TzHaar-Hur-Brekt and see what I can do.",
    "Why don't you like theatre?",
    "But something good can always come out of it. A play could very well take up real issues and demonstrate them in a safe and educational way.",
    "I should probably try to find an overall storyline that more of them are at least somewhat comfortable with before I start trying to make small changes.",
    "How can I make the story better for you?",
    "Nevermind, then.",
    "Nevermind, then.",
    "What if the rich character in the story is a TzHaar-Hur? When the criminal robs it, it discovers its identity and uncovers its reign of terror.",
    "Hmm. Maybe this wasn't too good after all.",
    "So you want one of the characters to be a TzHaar-Hur? How about the TzHaar who gets assaulted in its home? It could have been because the criminal wanted to get its hands on the TzHaar-Hur's fine creations.",
    "I don't know how to.",
    "Nevermind",
    "Hmm. I'll talk to TzHaar-Hur-Brekt and see what I can do.",
    "Why don't you like theatre?",
    "But as far as I understand, mining isn't part of your caste role, either?",
    "I should probably try to find an overall storyline that more of them are at least somewhat comfortable with before I start trying to make small changes.",
    "How can I make the story better for you?",
    "What if one of the characters is a TzHaar-Mej, but, even though it is an organiser and leader, it is not sure of who the criminal is?",
    "Alright, I'll see if I can think of something else.",
    "What if one of the characters is a TzHaar-Mej who is aware of the whole situation, even who the criminal is, but for some reason keeps it to himself?",
    "Thank you. We're geting somewhere now.",
    "I can't think of anything.",
    "Okay, no more changes.",
    "What if the whole thing was just a plot staged by a mastermind TzHaar-Mej who wanted to test the loyalty of the local TzHaar?",
    "What if all the crimes are planned by an evil TzHaar-Xil and the TzHaar-Mej are unaware of it because the TzHaar-Xil has been a good TzHaar up until this point?",
    "Hmm. Fine, I will see if I can think of something else.",
    "I can't think of anything.",
    "No, thanks.",
    "Hmm. I'll talk to TzHaar-Hur-Brekt and see what I can do.",
    "Why don't you like theatre?",
    "What is it that makes the Fight Pit exciting?",
    "I should probably try to find an overall storyline that more of them are at least somewhat comfortable with before I start trying to make small changes.",
    "How can I make the story better for you?",
    "Oh yeah, I'd already talked to you about that.",
    "What if we make the smart and stealthy criminal a TzHaar-Xil?",
    "Alright, that's great. We're really getting somewhere now. I should talk to TzHaar-Hur-Brekt about this.",
    "No, sorry, but I don't think there is room for a TzHaar-Xil among the characters.",
    "What if the criminal is a TzHaar-Xil who does what it does to prove their superiority? As a result, the TzHaar-Xil could be recognised as the military leaders of the TzHaar.",
    "Glad I could be of help, but the others don't seem too happy about this.",
    "What if the criminal is a TzHaar-Ket? It would show that they don't have as much self-control as they'd like to think.",
    "Oh. Well, I will try to think of something else, then.",
    "Sorry, but I can't think of anything to fix that.",
    "Nevermind.",
    "Hmm. I'll talk to it and see what I can do.",
    "Why don't you like theatre?",
    "But then your role doesn't include mining?",
    "But then why can't you play or watch theatre when you get old?",
    "Why is it stupid, then? Surely, it can at least be entertaining.",
    "How can I make the story better for you?",
    "I should probably try to find an overall storyline that more of them are at least somewhat comfortable with before I start trying to make small changes.",
    "How can I make the story better for you?",
    "Alright.",
    "What if one of the characters is a TzHaar-ket who is aware of the whole situation, even who the criminal is, but decides not to stop it for some reason?",
    "Alright, I guess that makes sense. I'll see if I can come up with something else.",
    "What if a TzHaar-Ket discovers who the criminal is, and then captures and punishes it?",
    "Sorry, but I can't think of anything that would change that.",
    "No, thanks.",
    "The story TzHaar-Hur-Brekt has written is about a TzHaar called TokTz-Ket-Ek-Mack who has gone against TzHaar society and becomes a criminal. Its crime wave starts when a human visits the TzHaar city and ends up killed, and then the events escalate from there. TokTz-Ket-Ek-Mack starts stealing from other TzHaar, kills another human visitor, and even assaults TzHaar in their homes. This smart criminal always manages to evade the arm of the law and never gets caught. The play is meant to show how chaotic life would be if the TzHaar didn't follow their rules. So, what do you think about it?",
    "Hmm. I guess I need to talk to TzHaar-Hur-Brekt about some changes, then.",
    "TzHaar-Hur-Brekt and I have made some changes, and the story is now about a TzHaar called TokTz-Ket-Ek-Mack who has gone against the TzHaar society and becomes a criminal. Its crime wave starts when a human visits the TzHaar city and TokTz-Ket-Ek-Mack robs him. It continues to rob humans but also other TzHaar, and even assaults TzHaar in their homes, but it never gets caught. Nobody is killed in the story, but it still shows how bad life would be if there weren't for the rules the TzHaar follow. So what do you think about it?",
    "Hmm. I guess I need to talk to TzHaar-Hur-Brekt about some changes, then.",
    "TzHaar-Hur-Brekt and I have made some changes, and the story is now about a TzHaar called TokTz-Ket-Ek-Mack who has gone against the TzHaar society and becomes a criminal. It all starts when a human visitor attacks it and it kills the human in self-defence. This triggers a spark in TokTz-Ket-Ek-Mack, and it likes the rush. It starts stealing from other TzHaar, kills another human in self-defence, and assaults a TzHaar in its home, yet it never gets caught. The play is meant to show how chaotic life would be if the TzHaar didn't follow their rules. So, what do you think about it?",
    "Alright, we're getting somewhere now. Most of you seem to be willing to at least work with this. I can probably make some small adjustments and even TzHaar-Hur-Klag will be satisfied.",
    "TzHaar-Hur-Brekt and I have made some changes, and the story is now about a TzHaar called TokTz-Ket-Ek-Mack who has gone against the TzHaar society and becomes a criminal. It all starts when TokTz-Ket-Ek-Mack kills a human visitor to the TzHaar city. This gives it a rush and it likes the feeling. It kills, steals from and assaults several other humans throughout the story, but is never caught. It shows how out of control the TzHaar could go if it weren't for the rules. So what do you think about it?",
    "Hmmm. If only TzHaar-Xil-Mor is willing to work with this, I probably need to talk some more to TzHaar-Hur-Brekt about it.",
    "TzHaar-Hur-Brekt and I have made some changes, and the story is now about a TzHaar called TokTz-Ket-Ek-Mack who has gone against the TzHaar society and becomes a criminal. Its crime wave starts when it kills another TzHaar, and then the events escalate from there. TokTz-Ket-Ek-Mack starts stealing from, killing, and assaulting TzHaar in their homes, but never gets caught. The play is meant to show how chaotic life would be if the TzHaar didn't follow their rules. So, what do you think about it?",
    "TzHaar-Ket-Jok and TzHaar-Xil-Mor seem to be able to at least work with me on this story, but that's not enough. I need to talk to TzHaar-Hur-Brekt again.",
    "We're really getting somewhere now. The TzHaar who gets assaulted in its home should be a TzHaar-Hur. The rich TzHaar should be a TzHaar-Mej who is at least somewhat aware of what is going on but decides not to do anything about it for some reason. And the criminal is a TzHaar-Xil. I think we need to make just a few more changes before everyone is pleased now.",
    "We should decide an ending.",
    "I think it would be a bad idea to let one TzHaar complmetely outsmart all others. It doesn't have to get caught, but what if its plans are at least foiled?",
    "I don't think it would be too good to have one TzHaar outsmart all the rest. What if the others work together and eventually capture the criminal through joint efforts?",
    "I don't think it's good that one TzHaar outsmarts all the others and gets away with it flawlessly. I think such severe actions deserve a severe punishment, so it should get caught and killed.",
    "Nevermind, I've got nothing.",
    "Nothing quite yet. I need to take care of some more things first.",
    "It was going well for a while, but I seem to have made some changes to the plot that were highly unpopular.",
    "I think the ending could do with some changes.",
    "I don't know, sorry. I will have to give it some thought.",
    "What is the current plot of the story?",
    "I think the ending could do with some changes.",
    "I've got good news, TzHaar-Hur-Brekt. All the miners are happy with the plot now, so we can move on and start handing out the roles.",
    "I've still got some stuff to do.",
    "Why don't you like theatre?",
    "TzHaar-Hur-Brekt and I have made some changes, and the story is now about a TzHaar-Xil called TokTz-Ket-Ek-Mack who has gone against the TzHaar society and becomes a criminal. It all starts when a human visitor attacks it and it kills the human in self-defence. This triggers a spark in TokTz-Ket-Ek-Mack, and it like the rush. It steals from a TzHaar-Mej, kills another human in self-defence, and assaults a TzHaar-Hur in its home. However, the actual goals of the TzHaar-Xil's plans are constantly being foiled. So, what do you think about it?",
    "Okay, everyone except for TzHaar-Xil-Mor seems entirely pleased with this story. I can work with that.",
    "TzHaar-Hur-Brekt and I have made some changes, and the story is now about a TzHaar-Xil called TokTz-Ket-Ek-Mack who has gone against the TzHaar society and becomes a criminal. It all starts when a human visitor attacks it and it kills the human in self-defence. This triggers a spark in TokTz-Ket-Ek-Mack, and it likes the rush. It steals from a TzHaar-Mej, kills another human in self-defence, and assaults a TzHaar-Hur in its home. But, eventually it is caught through joint efforts of the other TzHaar in the city. So, what do you think about it?",
    "Hmm. Only TzHaar-Ket-Jok and TzHaar-Hur-Klag seems to like this idea. I should talk to TzHaar-Hur-Brekt again.",
    "How can I make the story better for you?",
    "Fine, I don't have to change more.",
    "What if the criminal is a TzHaar-Xil who does what it does to prove their superiority? As a result, the TzHaar-Xil could be recognised as the military leaders of the TzHaar.",
    "Glad I could be of help, but the others don't seem to happy about this.",
    "What if the criminal's plans are just occasionally foiled? It would still gain from it.",
    "Alright, that's great. Everyone seems to be happy with the story now, so I should talk to TzHaar-Hur-Brekt.",
    "Sorry, but I can't think of anything to fix that.",
    "Nevermind.",
    "What is the plot?",
    "What is the current plot of the story?",
    "We should change the ending.",
    "' They are happy with the plot.",
    "I've got good news, TzHaar-Hur-Brekt. All the miners are happy with the plot now, so we can move on and start handing out the roles.",
    "What are the roles?",
    "Alright, I'll get back to work then.",
    "I've still got some stuff to do.",
    "Could you give me some hints?",
    "Could you give me some hints on how to make them all happy with the play?",
    "Alright, I'll keep that in mind. Thank you.",
    "Could you tell me about the miner's relations?",
    "What are their current moods?",
    "Could you tell me what the miners' current moods are?",
    "No, thanks.",
    "You will play the role...",
    "...TokTz-Ket-Ek-Mack.",
    "You will play the role of TokTz-Ket-Ek-Mack.",
    "What do you think of your current role?",
    "What is your current role and what do you think about it?",
    "We should modify your current role.",
    "We should make some changes to your current role. Maybe we can make it better?",
    "You will play the role...",
    "...KetKul-Schmul.",
    "You will play the role of Ketkul-Schmul.",
    "What do you think of your current role?",
    "What is your current role and what do you think about it?",
    "We should modify your current role.",
    "We should make some changes to your current role. Maybe we can make it better?",
    "You will play the role...",
    "...JalYt-Jenny.",
    "You will play the role of JalYt-Jenny.",
    "What do you think of your current role?",
    "What is your current role and what do you think about it?",
    "Okay, I will see what I can do.",
    "We should modify your current role.",
    "We should make some changes to your current role. Maybe we can make it better?",
    "What is we make it TzHaar instead?",
    "But it would at least be by another TzHaar-Xil.",
    "What if you survive the attack?",
    "Fine, then.",
    "You will play the role...",
    "...TzHaar-Hur.",
    "You will play the role of the TzHaar-Hur.",
    "What do you think of your current role?",
    "What is your current role and what do you think about it?",
    "Okay, I will see what I can do.",
    "We should modify your current role.",
    "We should make some changes to your current role. Maybe we can make it better?",
    "What if you avoid the attacker?",
    "What if the TzHaar-Hur you play discovers and avoids the attacker?",
    "What if you go down fighting?",
    "What if you at least put up a good fight before you get defeated?",
    "Then I don't know.",
    "Sorry, but then I don't know.",
    "Oh, nothing at all.",
    "That was it.",
    "Oh, nothing.",
    "*Something about modifying it to be a Mej conspiracy to test loyalty of the TzHaar.*",
    "You will play the role of KetKul-Schmul.",
    "You will play the role...",
    "What do you think of your current role?",
    "We should make some changes to your current role. Maybe we can make it better?",
    "Well, what if it tricks TokTz-Ket-Ek-Mack and it only manages to get away with a small sum of TokKul?",
    "That was it.",
    "What do you think of your current role?",
    "We should modify your current role.",
    "Oh, nothing.",
    "You will play the role of JalYt-Jenny.",
    "You will play the role...",
    "What do you think of your current role?",
    "We should make some changes to your current role. Maybe we can make it better?",
    "Yeah, I can do that.",
    "Ugh. Sure, I guess so.",
    "No, we can't have that. But I can let you at least survive the attack.",
    "That was it.",
    "What do you think of your current role?",
    "We should modify your current role.",
    "That was it.",
    "You will play the role of the TzHaar-Hur.",
    "Hmm?",
    "You will play the role...",
    "What do you think of your current role?",
    "We should make some changes to your current role. Maybe we can make it better?",
    "Why not? It's a TzHaar-Hur, it suits you perfectly. I even made the role just because you wanted it.",
    "Hm. What if you don't get assaulted then? TokTz-Ket-Ek-Mack can break into your home, but doesn't have to assault you, just look for some items.",
    "Eh, I guess so.",
    "No, you can't.",
    "That was it.",
    "What do you think of your current role?",
    "We should modify your current role.",
    "That was it.",
    "What are the roles?",
    "Yes, all roles have been given out.",
    "Yeah, all of the roles have been given out now.",
    "I don't have to be involved in that, do I? I have a feeling it...eh...won't run as smoothly as it should.",
    "Thank you very much, now I can finally mine these rocks and then get into the tunnels to start repairing.",
    "Not yet.",
    "I know how to mine through magma now.",
    "TzHaar-Hur-Brekt has taught me how to safely mine through magma now, so I should be able to enter the tunnels.",
    "Yeah, I found it kind of odd, as well. Anyway, can I enter the tunnels now?",
    "How do I repair the tunnels?",
    "You wouldn't happen to have some tips on how to repair the tunnels? I want to be sure I don't make it any worse.",
    "Alright, that's good to know.",
    "Nothing.",
    "Nevermind, it was nothing.",
    "Have you seen a big armadillo?",
    "Have you seen a big arma- uh...TokTz-Ket-Dill around here? The one who dug all the tunnels under the city.",
    "Yeah, that's what I'm here for. So where did it go?",
    "Hmm. So it's basically trapped in a corner? Why haven't you killed it yourself?",
    "I see. Well, I better go and take care of it myself.",
    "What did you call me?",
    "What's a \"JalYt-Hur\"?",
    "Well, yes I suppose I am...",
    "What are you then?",
    "Thanks for explaining it.",
    "I guess so...",
    "No, I'm not!",
    "No, I'm fine, thanks.",
    "No, I'm fine, thanks.",
    "Yes, the TokTz-Ket-Dill is dead now and I have repaired all the damage it caused.",
    "How is the play coming along?",
    "How is the play coming along, TzHaar-Hur-Brekt?",
    "Yeah, I'd love to.",
    "Not right now.",
    "Although it does sound very interesting. I'm not sure if I have time right now.",
    "Alright, I'll do that.",
    "What did you call me?",
    "What's a \"JalYt-Hur\"?",
    "Well, yes I suppose I am...",
    "What are you then?",
    "Thanks for explaining it.",
    "I guess so...",
    "No, I'm not!",
    "Um... it was different.",
    "Yes, definitely. How long did you say you've been rehearsing it?",
    "Oh, of course. Any less wouldn't have been acceptable.",
    "And the actors were just...outstanding. Anyway, I should be going now."
  ],
  "TzHaar-Mej-Malk": [
    "Yes, TokTz-Ket-Dill dug tunnels under city and now the whole city is in danger.",
    "That right.",
    "A four-legged creature with big claws, covered in stone plate armour. It walks when the lava sphere in the sky is not visible and digs lots of tunnels.",
    "There are many creatures in volcano. One is the TokTz-Ket-Dill. TzHaar hunt them for food.",
    "Why would we eat rocks? We eat flesh like you JalYt.",
    "I am afraid it is not that simple, [Title]-[Caste]-Player. If we mine, we risk another collapse. TokTz-Ket-Dill's tunnels are very unstable and run right under TzHaar city.",
    "We need to stabilise tunnels so that they do not cave in and ruin our city. But we need to get into them first. The only entrance we have found is too small for TzHaar to get into. We dare not make it bigger or tunnels might collapse.",
    "Yes, TzHaar-Xil-Tog. We trust TzHaar-[Caste]-Player.",
    "We do not have much choice, TzHaar-Xil-Tog.",
    "Thank you, [Title]-[Caste]-Player. Go speak to TzHaar-Ket-Grol, it directly south of here then a little bit to the west. It guards entrance to tunnel. Come back to us when you have repaired tunnels and killed TokTz-Ket-Dill.",
    "That is very good news, JalYt. You have done TzHaar a great favour."
  ],
  "TzHaar-Hur-Frok": [
    "Many TzHaar-Hur are trapped behind this collapse thanks to TokTz-Ket-Dill's tunnels!",
    "And TzHaar-Hur-Frok is very good miner.",
    "And we cannot leave TzHaar-Hur trapped.",
    "Are tunnels fixed and TzHaar-Hur safe yet?",
    "Yes, hand them over and I can take care of it.",
    "Yes, very impressive. And you saved the TzHaar-Hur. Well done."
  ],
  "TzHaar-Ket-Grol": [
    "What you want, JalYt?",
    "They asked JalYt to help? We cannot leave safety of TzHaar city in hands of JalYt!",
    "Forgive TzHaar-Ket-Grol. JalYt is tiny and soft. Can probably squeeze through crack easily. But what does great champion know about building things?",
    "Yes. JalYt is tiny and soft. Can probably squeeze through crack easily. But what do you know about things like these?",
    "Bah. Hur is nothing without its tools. TzHaar-Ket-Grol cannot possibly let JalYt enter unless JalYt is prepared.",
    "First of all, you need strong Tok-Xil-Im, Tok-Ket-Hurt, and TokJal-Hurt.",
    "If JalYt will work with TzHaar, JalYt will use TzHaar tools!",
    "We already speak JalYt language to keep you tourists happy, we will not change names for you, too!",
    "TzHaar-Ket-Grol knew JalYt would be no help! I will write you list of items and how many you could need. I have not been into tunnels so I, of course, do not know exact numbers. You might need less.",
    "There you go. Before JalYt works with TzHaar, I suggest you go north-west through city, past Plaza, to TzHaar library and learn how to read TzHaar.",
    "What you want, JalYt?",
    "JalYt should go to library to learn how to read TzHaar symbols.",
    "Weird symbols are TzHaar! JalYt should stop insults and go to library to learn how to read.",
    "What you want, JalYt?",
    "Good, tell me.",
    "No, that is not right! Come back when you have studied.",
    "No, that is not right! Come back when you have studied.",
    "No, that is not right! Come back when you have studied.",
    "No, that is not right! Come back when you have studied.",
    "Yes, go on.",
    "No, that is not right! Come back when you have studied.",
    "No, that is not right! Come back when you have studied.",
    "No, that is not right! Come back when you have studied.",
    "No, that is not right! Come back when you have studied.",
    "Yes, very good. TzHaar-Hur-Frok can treat planks. And last items JalYt need?",
    "Correct. [Title]-[Caste]-Player surprises TzHaar-Ket-Grol. I did not think you would learn TzHaar. And yes, now you need to go to TzHaar mines to east. There you must have a TzHaar teach you how to safely mine magma. Tunnels will be very unstable and we cannot let you in if you do not have experience. When you know this, you can get the rocks. I will tell TzHaar-Ket-Rok that you are allowed to enter TzHaar mine.",
    "No, that is not right! Come back when you have studied.",
    "What you want, JalYt?",
    "Go to TzHaar mine and learn to mine magma. Then get Tok-Ket-Hurt and come back here.",
    "What you want, JalYt?",
    "Yes, TzHaar-Ket-Grol has heard. And TzHaar-Hur-Brekt will put up play? That is strange.",
    "Yes, you may.",
    "Useless JalYt. Fine, TzHaar-Ket-Grol can give you hints. Different damages require different materials to repair. In cramped spaces, JalYt should only ever repair with pillars if damage is very bad. Otherwise use planks. In open spaces, JalYt should only ever repair with planks if the damage is very light. Otherwise use pillars."
  ],
  "TzHaar-Mej-Lor": [
    "Welcome to TzHaar library, [Title]-[Caste]-Player. Can TzHaar-Mej-Lor, Lord of TzHaar Library, help you?",
    "Yes, we got them from Lord of Library in JalYt town to north-east. I think you call it Varrock.",
    "JalYt has come to right place. I am Library Lord, so I am here to help. Is the language TzHaar?",
    "I told you, I am Lord of Library, of course I can help. The book you look for is in JalYt section.",
    "At the far back, of course. You can see shelves right down this corridor.",
    "Yes, ashes is what TzHaar call them, but this library is for tourists who visit TzHaar city, so we call them books.",
    "JalYt can stop politeness, we can call them books.",
    "JalYt is weird. We do not yet know how to read your type of books. TzHaar use hard rock to carve text on, we are not used to your type of text.",
    "JalYt must be confused. We asked for books, and this is what we got.",
    "Ashes do not burn. Crazy JalYt.",
    "TzHaar-Mej-Lor is Lord of Library, not teacher! Read your JalYt book and you will find out!",
    "Yes, we got them from the Lord of the Library in your city to the north-east. Varrock, I think you call it.",
    "TzHaar have a very good language, [Title]-[Caste]-Player. We always have known how to carve and read but we have not always had library. It was idea we got when JalYt started to visit TzHaar city. You seem very lost and very misplaced in our culture. Yes, you crowd the Fight Pit which is good entertainment to watch, but you know nothing. So to make city easier for JalYt to understand, we set up library and got books for you. But you do not seem to want to learn. Almost only TzHaar visit library now. The few JalYt who do come here always ask about ashes and never about books. You seem to be obsessed with ashes.",
    "Yes, TzHaar call them ashes. We did not bring them here for TzHaar. They are for JalYt who visit the city, so you can read and learn about TzHaar.",
    "They are JalYt books, you should know. I am TzHaar, we read on stone.",
    "Foolish JalYt.",
    "I am TzHaar-Mej, one of the mystics of this city. The TzHaar-Mej guide the TzHaar when change is necessary, and tend to TzHaar eggs to ensure they are hot and healthy. TzHaar-Mej are keepers of knowledge and magic. There are also the mighty TzHaar-Ket who guard us, the swift TzHaar-Xil who hunt for our food, and the skilled TzHaar-Hur who craft our homes and tools."
  ],
  "Reldo": [
    "They burned the books I sent them?",
    "Oh. Haha! That's quite comical.",
    "Ah, that must be the TzHaar Tourist Guide. I didn't write it myself, but I do indeed have a copy of it. It should be in one of the bookcases here in the library. I'm afraid I don't know exactly which one it's in though, but I'm sure it won't be too hard to find.",
    "Of course. It's the TzHaar Tourist Guide. It should be somewhere in the library. I'm not sure exactly where, but if you have a look around, I'm sure you will find it."
  ],
  "TzHaar-Ket-Rok": [
    "What you want, JalYt?",
    "Yes, go ahead. TzHaar-Ket-Grol told me you have permission.",
    "None of JalYt's business.",
    "No, it is an area to mine."
  ],
  "TzHaar-Ket-Lurk": [
    "You need help, [Title]-[Caste]-Player?",
    "I am TzHaar-Ket-Lurk. I am guard of the mines.",
    "JalYt is right, it is not. All they ever do is mine and they say they do not need any help, that they can handle themselves. But those TzHaar are as old as the crater and may fall apart if they had to fight.",
    "It is not too bad. They always squabble so I have entertainment. They claim to be most unique TzHaar ever to walk the magma, but I know them inside out by now.",
    "Yes, JalYt, if you have any questions, just ask.",
    "No, JalYt. I am TzHaar-Ket, one of the guardians of our city. There are also the wise TzHaar-Mej who guide us, the swift TzHaar-Xil who hunt for our food, and the skilled TzHaar-Hur who craft our homes and tools.",
    "TzHaar-Hur-Brekt want you to set up story? Need any information?",
    "Of course. First thing to think about is that you do not give any of them too good changes. If you make TzHaar-Ket-Jok too happy, TzHaar-Xil-Mor and TzHaar-Mej-Kol will probably be mad. If you make TzHaar-Xil-Mor too happy, TzHaar-Ket-Jok will be mad. If you make TzHaar-Mej-Kol too happy, TzHaar-Xil-Mor and TzHaar-Hur-Klag will be mad. If you make TzHaar-Hur-Klag too happy, TzHaar-Mej-Kol will be mad. So only give them just enough. If something goes wrong, try to talk to TzHaar-Hur-Brekt.",
    "You are welcome, JalYt. Need more information?",
    "Of course, JalYt. It is a bit confusing but I will do my best. Who you want to know about?",
    "TzHaar-Hur-Klag thinks both TzHaar-Ket-Jok and TzHaar-Xil-Mor are okay. It thinks TzHaar-Ket are important to city, which we are, and it thinks TzHaar-Xil are a bit too bloodthirsty but perform their duties well, which is also true. It is not very fond of TzHaar-Mej-Kol. It thinks the TzHaar-Mej act like they better than other TzHaar. TzHaar-Hur-Klag tries to be the leader of the mines but TzHaar-Mej-Kol does not like that and tries to take role from it. Need more information?",
    "TzHaar-Ket-Jok thinks highly of all TzHaar-Hur and has great respect for them. It does not think TzHaar-Hur-Klag is exception to that. It does not feel same about TzHaar-Xil. It thinks they are too aggressive and trouble makers and always need to be watched over or they will break peace. It seems to have mixed opinions about TzHaar-Mej. It thinks they are good organisers, but that they think too much of themselves and would never make it alone. Need more information?",
    "TzHaar-Mej-Kol thinks poorly of everyone. It thinks TzHaar-Ket are good for guards, but that they are stupid. Which we are not! It also thinks TzHaar-Xil are valuable, but dangerous if not kept in check. It tries to manipulate them into behave. It really does not like TzHaar-Hur-Klag. TzHaar-Hur-Klag is TzHaar-Hur so it wants to be leader of mines, which TzHaar-Mej-Kol does not like. TzHaar-Mej-Kol wants to be in charge and hates TzHaar-Hur-Klag for dare to challenge it. Need more information?",
    "TzHaar-Xil-Mor is very selfish. It does not like TzHaar-Ket-Jok because it gets all credit because it is strong. TzHaar-Xil-Mor thinks TzHaar-Xil are just as good at combat. It also thinks TzHaar-Mej-Kol is too full of itself, but otherwise likes TzHaar-Mej. Like TzHaar-Ket-Jok, it also has lots of respect for the TzHaar-Hur. Need more information?",
    "As far as TzHaar-Ket-Lurk can tell, they seem to be happy. You need any more information, JalYt?",
    "TzHaar-Mej-Kol got very mad when you made good deal with TzHaar-Hur-Klag. They do not like each other very much. You need any more information, JalYt?",
    "TzHaar-Xil-Mor did not look too happy when you made good deal with TzHaar-Mej-Kol. TzHaar-Hur-Klag got mad when you did what TzHaar-Mej-Kol wanted. You need any more information, JalYt?",
    "TzHaar-Ket-Jok does not seem to be happy. You were probably too nice to TzHaar-Xil-Mor. Making good change for TzHaar-Xil-Mor made TzHaar-Mej-Kol mad. You need any more information, JalYt?",
    "TzHaar-Xil-Mor seemed to get mad when you made good deal with TzHaar-Ket-Jok. TzHaar-Mej-Kol did not like that you made TzHaar-Ket-Jok seem to be smartest. You need any more information, JalYt?",
    "You need to give roles to the miners? Maybe I can help.",
    "Of course. First thing to think about is that you do not give any of them too good changes. If you make TzHaar-Ket-Jok too happy, TzHaar-Xil-Mor and TzHaar-Mej-Kol will probably be mad. If you make TzHaar-Xil-Mor too happy, TzHaar-Ket-Jok will be mad. If you make TzHaar-Mej-Kol too happy, TzHaar-Xil-Mor and TzHaar-Hur-Klag will be mad. If you make TzHaar-Hur-Klag too happy, TzHaar Mej-Kol will be mad. So only give them just enough. If something goes wrong, try to talk to TzHaar-Hur-Brekt.",
    "You are welcome JalYt. Need more information?",
    "As far as TzHaar-Ket-Lurk can tell, they seem to be happy. You need any  more information, JalYt?"
  ],
  "TzHaar-Hur-Brekt": [
    "You need help, [Title]-[Caste]-Player?",
    "I am TzHaar-Hur-Brekt, one of finest TzHaar-Hur and also great play writer!",
    "Yes, JalYt-[Caste]-Player. When I not work I write amazing plays for TzHaar. The best plays ever!",
    "We do not. All the other TzHaar think TzHaar-Hur-Brekt is crazy because I write theatre and poetry. Not good entertainment, they say. They want real violence like Fight Pit. But I think theatre can be good for TzHaar. You learn something and it is fun to watch.",
    "Thank you. Can TzHaar-Hur-Brekt be of further assistance?",
    "I am the miner trainer of the old TzHaar who come here. I just do not have much to do because TzHaar already know how to mine.",
    "No! It is a great honour. It gives me time to work on my fantastic plays.",
    "They are still fantastic and some day TzHaar will appreciate TzHaar-Hur-Brekt's work!",
    "TzHaar-Hur-Brekt is not teacher for JalYt. TzHaar-Hur-Brekt is teacher for TzHaar.",
    "TzHaar-Ket are not in charge of who to train to mine, TzHaar-Hur-Brekt is, so TzHaar-Hur-Brekt decides who gets to learn.",
    "That does sound important. Too important for a JalYt to do.",
    "JalYt makes a good point. TzHaar-Hur-Brekt may be able to help you.",
    "Now that you mention it, TzHaar-Hur-Brekt could use JalYt's help.",
    "[Title]-[Caste]-Player is weird. No, TzHaar-Hur-Brekt needs JalYt to help convince other four TzHaar miners in here that theatre is good, and I need them to star in my play.",
    "JalYt thinks TzHaar-Hur-Brekt's play is stupid?",
    "Good. First, JalYt and TzHaar-Hur-Brekt need to come up with good plot that suits other TzHaar miners. When they happy with plot, we give them roles.",
    "It is a dramatic tale of a TzHaar called TokTz-Ket-Ek-Mack who has turned against TzHaar society. TokTz-Ket-Ek-Mack starts a wave of crime with murder of a JalYt. Then TokTz-Ket-Ek-Mack starts do more crime. Steals from other TzHaar, kills more JalYt, and attacks TzHaar in its own home. And it is never caught! It tells how life without TzHaar rules becomes chaotic and full of misery.",
    "By scrape, JalYt means to kill TzHaar for it?",
    "I am TzHaar-Hur, one of the crafters for this city. We craft tools and sculptures, and carve homes for the TzHaar. There are also the wise TzHaar-Mej who guide us, the mighty TzHaar-Ket who guard us, and the swift TzHaar-Xil who hunt for our food.",
    "How is work going, [Title]-[Caste]-Player?",
    "Okay, we will go back to last story that seemed accepted. TokTz-Ket-Ek-Mack only kills the JalYt in self defence, and it steals from and assaults TzHaar.",
    "It is a dramatic tale of a TzHaar called TokTz-Ket-Ek-Mack who has turned against TzHaar society. TokTz-Ket-Ek-Mack starts a wave of crime with murder of a JalYt. Then TokTz-Ket-Ek-Mack starts do more crime. Steals from other TzHaar, kills more JalYt, and attacks TzHaar in its own home. And it is never caught! It tells how life without TzHaar rules becomes chaotic and full of misery.",
    "It is a dramatic tale of a TzHaar called TokTz-Ket-Ek-Mack who has turned against TzHaar society. It starts with TokTz-Ket-Ek-Mack starts a wave of crime by robbing a JalYt. Then TokTz-Ket-Ek-Mack starts do more crime. It steals from more JalYt and even TzHaar, and then breaks into home of another TzHaar. And it is never caught! No one dies but it shows how chaotic life in TzHaar city can be without rules.",
    "It is a dramatic tale of a TzHaar called TokTz-Ket-Ek-Mack who has turned against TzHaar society. It starts with TokTz-Ket-Ek-Mack attacked by JalYt and kills JalYt in self defence. TokTz-Ket-Ek-Mack likes the feeling and starts do more crime. Steals from other TzHaar, kills another JalYt attacker, and then breaks into home and assaults another TzHaar. And it is never caught! It shows how a TzHaar can spiral downwards if it lacks rules and discipline.",
    "It is a dramatic tale of a TzHaar called TokTz-Ket-Ek-Mack who has turned against society. TokTz-Ket-Ek-Mack starts a wave of crime with murder of a JalYt. Then TokTz-Ket-Ek-Mack starts do more crime. Steals from and kills more JalYt, and leaves TzHaar city to break into homes of other JalYt. And it is never caught! It shows how TzHaar must have rules and live peacefully so that other races don't get harmed.",
    "It is a dramatic tale of a TzHaar called TokTz-Ket-Ek-Mack who has turned against TzHaar society. TokTz-Ket-Ek-Mack starts a wave of crime with murder of one of its own kind. Then TokTz-Ket-Ek-Mack starts do more crime. It steals from and kills more TzHaar, and attacks TzHaar in its own home. And it is never caught! It tells how life without TzHaar rules becomes chaotic and full of misery.",
    "Hmm. What do you suggest, [Title]-[Caste]-Player?",
    "Hmm. But that would be very little action. I guess JalYt has a point, though. Fine, TokTz-Ket-Ek-Mack only robs. No one gets killed.",
    "That is a horrible idea! TzHaar are much too powerful for JalYt. Especially for Void Knight products!",
    "Not bad idea, [Title]-[Caste]-Player. TzHaar always have been peaceful. We only fight on equal terms or self defence. Yes, TzHaar-Hur-Brekt likes idea.",
    "Hmm. Not really what TzHaar-Hur-Brekt had in mind, but it could work. Yes, that change okay.",
    "JalYt makes good point. Only TzHaar are involved.",
    "Hmph! They are not happy with it at all! TzHaar-Hur-Brekt will not help you unless you convince them.",
    "How is work going, [Title]-[Caste]-Player?",
    "That is great news, [Title]-[Caste]-Player. What do you think we should do now?",
    "Hmm. What do you suggest, [Title]-[Caste]-Player?",
    "Good idea, [Title]-[Caste]-Player. That is better than first idea.",
    "Yes, very good idea. It shows how TzHaar are strong when we work together.",
    "Hmm. I am not sure, but I can give it a try.",
    "Okay, what do you think we should do?",
    "Hmm. What do you suggest, [Title]-[Caste]-Player?",
    "It is a dramatic tale of a TzHaar-Xil casually called TokTz-Ket-Ek-Mack who has turned against TzHaar society. It starts with TokTz-Ket-Ek-Mack attacked by JalYt and kills JalYt in self defence. TokTz-Ket-Ek-Mack likes the feeling and starts do more crime. Steals from a TzHaar-Mej, kills another JalYt attacker, and then breaks into home and assaults a TzHaar-Hur. However, TokTz-Ket-Ek-Mack's plans always end up foiled by various TzHaar.",
    "It is a dramatic tale of a TzHaar-Xil casually called TokTz-Ket-Ek-Mack who has turned against TzHaar society. It starts with TokTz-Ket-Ek-Mack attacked by JalYt and kills JalYt in self defence. TokTz-Ket-Ek-Mack likes the feeling and starts do more crime. Steals from a TzHaar-Mej, kills another JalYt attacker, and then breaks into home and assaults a TzHaar-Hur. But, eventually, TokTz-Ket-Ek-Mack is killed for its crimes.",
    "It is a dramatic tale of a TzHaar-Xil casually called TokTz-Ket-Ek-Mack who has turned against TzHaar society. It starts with TokTz-Ket-Ek-Mack attacked by JalYt and kills JalYt in self defence. TokTz-Ket-Ek-Mack likes the feeling and starts do more crime. Steals from a TzHaar-Mej, kills another JalYt attacker, and then breaks into home and assaults a TzHaar-Hur. But, eventually, TokTz-Ket-Ek-Mack is caught through joint efforts of the city's TzHaar.",
    "Hmph! They are not happy with it at all! TzHaar-Hur-Brekt will not help you unless you convince them.",
    "Hmph! They are not happy with it at all! TzHaar-Hur-Brekt will not help you unless you convince them.",
    "How is work going, [Title]-[Caste]-Player?",
    "It is a dramatic tale of a TzHaar-Xil casually called TokTz-Ket-Ek-Mack who has turned against TzHaar society. It starts with TokTz-Ket-Ek-Mack attacked by JalYt and kills JalYt in self defence. TokTz-Ket-Ek-Mack likes the feeling and starts to do more crime. Steals from a TzHaar-Mej, kills another JalYt attacker, and then breaks into home and assaults a TzHaar-Hur. However, TokTz-Ket-Ek-Mack's plans always end up foiled by various TzHaar.",
    "That is great! Then you can start to give out roles.",
    "The first character is TokTz-Ket-Ek-Mack, the TzHaar-Xil criminal. The second character is KetKul-Schmul, the rich TzHaar-Mej who gets robbed by TokTz-Ket-Ek-Mack. The third character is JalYt-Jenny, the JalYt who gets killed in self defence. The fourth character is the TzHaar-Hur who gets assaulted in its home.",
    "How is work going, [Title]-[Caste]-Player? Have you given out roles yet?",
    "Good work, JalYt. Are they happy with roles?",
    "Very good work, JalYt! Now I can start rehearsal.",
    "No, JalYt has done what it promised. TzHaar-Hur-Brekt can train you now.",
    "You need help, [Title]-[Caste]-Player.",
    "It is done now! We have not yet shown it to rest of TzHaar, but since you helped with it, maybe you want to see it?",
    "That is okay, [Title]-[Caste]-Player. Just come talk to me again when you have time.",
    "Are you not JalYt-Hur?",
    "Welcome, [Title]-[Caste]-Player, to this exclusive preview of ThreeTokKul Opera! It is written by TzHaar-Hur-Brekt and in the roles you will see TzHaar-Xil-Mor as TokTz-Ket-Ek-Mack, TzHaar-Mej-Kol in role of KetKul-Schmul, TzHaar-Ket-Jok in role of TzHaar-Ket-Jenny, and TzHaar-Hur-Klag in role of TzHaar-Hur-Klag. Make yourself comfortable, JalYt, and enjoy the performance.",
    "And KetKul-Schmul stays gone",
    "And so do some rich TzHaar",
    "And some of its TokKul has TokTz-Ket-Ek-Mack",
    "On whom they cannot pin anything",
    "TzHaar-Ket-Jenny was found",
    "With a TokTz-Ket-Ek in its chest",
    "And on the solid magma walks TokTz-Ket-Ek-Mack",
    "Who knows nothing about all this",
    "And then they both shut up!",
    "And the very old and wise TzHaar-Hur-Klag",
    "Whose name everyone knows",
    "Woke up and was not feeling its best",
    "TokTz-Ket-Ek-Mack, what was your price?",
    "The end.",
    "The end!",
    "So what do you think, [Title]-[Caste]-Player?",
    "Yes, this is TzHaar theatre. Probably different from what JalYt is used to.",
    "For very long. I wanted to get everything just right.",
    "That is how TzHaar-Hur-Brekt always thinks when it writes plays.",
    "Goodbye, [Title]-[Caste]-Player."
  ],
  "TzHaar-Hut-Brekt": [
    "No! Horrible idea!"
  ],
  "TzHaar-Ket-Jok": [
    "I am not happy! Plot is horrible!",
    "This play just gets worse and worse.",
    "Leaving TzHaar-Xil in charge is nothing but disaster! TzHaar-Ket-Jok refuses to discuss unless TzHaar-Hur-Brekt changes this.",
    "Because I am TzHaar-Ket. My role is to guard TzHaar city, not play or watch theatre.",
    "When TzHaar get old, TzHaar mine. That is how it has always been!",
    "Because that is not how it has always been and it is stupid!",
    "It has nothing to do with TzHaar at all. At least mine is part of TzHaar society. What else do you want to bother TzHaar-Ket-Jok with?",
    "JalYt has no memory? You already made great change, you do not have to change more.",
    "Anything else?",
    "It is TzHaar-Ket's job to keep peace and should not be unaware of what happens.",
    "Horrible idea! A TzHaar-Ket would never do such a thing. If we know who criminal is, we stop criminal's plans.",
    "Good! Now what else do you want?",
    "Yes, that is great idea. TzHaar-Ket-Jok really likes it.",
    "You only say so because you did not think of it. So, what else can TzHaar-Ket-Jok do for you, JalYt?",
    "Bah, no good. Was there anything else?",
    "Awful! No TzHaar-Ket would ever let any other TzHaar attack other races unprovoked and break our peace.",
    "That's terrible! No TzHaar-Ket would ever let any other TzHaar do such things and risk our peace. Even if it only steals. TzHaar would not be trusted anymore.",
    "Hm. It is far from good, but it is better than before. At least it does not kill JalYt unprovoked.",
    "Awful! No TzHaar-Ket would ever let any other TzHaar attack other races unprovoked and break our peace.",
    "At least peace with other races is not broken, but TzHaar-Ket should still catch criminal.",
    "I am not happy. Plot is horrible!",
    "Yes, TzHaar-Ket-Jok likes that.",
    "TzHaar-Ket-Jok think it is pretty good.",
    "This play just gets worse and worse.",
    "Can I help you, [Title]-[Caste]-Player?",
    "A puny JalYt? That is not good at all. What else you want from me?",
    "TzHaar-Ket-Jok cannot play JalYt. Make JalYt-jenny a strong TzHaar-Ket and I will be happy.",
    "Good. And I want to defeat the TzHaar-Xil when it attacks me.",
    "Hm. Fine, I guess that is good enough. What else you want?",
    "TzHaar-Ket-Jok is happy with role.",
    "But completely unharmed!",
    "Because it is afraid of mighty TzHaar-Ket-Jenny!",
    "TzHaar-Ket-Jenny challenges you!",
    "It is not!",
    "Why does TokTz-Ket-Ek-Mack get TokKul?",
    "Do not make TzHaar-Ket-Jenny club you down!"
  ],
  "TzHaar-Xil-Mor": [
    "TzHaar-Xil-Mor does not like it! It is bad entertainment and bad for TzHaar!",
    "TzHaar-Hur are very good at craft weapons! TzHaar-Mej need to learn its place.",
    "This play is disgusting! TzHaar-Xil-Mor did not think it could be worse than TzHaar-Hur-Brekt's first idea, but you have proven me wrong.",
    "What do you want, [Title]-[Caste]-Player?",
    "Because it is stupid and not good! Fight Pit, that is good.",
    "Because different opponents' different skills to hunt down their prey makes it fun to watch. And it is made for TzHaar-Xil. Theatre is made for no one. Anything else you want to know?",
    "Stupid JalYt, you already made change! TokTz-Ket-Ek-Mack is TzHaar-Xil now. That is good.",
    "Yes, you had. Anything else?",
    "If there is a TzHaar-Hur and TzHaar-Mej in play, there should also be a TzHaar-Xil!",
    "Yes, that would be good. Shows that TzHaar-Xil are not to be underestimated and taken for granted.",
    "That is unfair! If there is no more you want, leave!",
    "You could show how great TzHaar-Xil are, that we are not just weak version of TzHaar-Ket.",
    "That is really good idea, [Title]-[Caste]-Player. Finally a good reason for theatre.",
    "Do not mind them. Anything else you want?",
    "No, that is bad idea. The criminal is smart not to get caught, a TzHaar-Ket is not!",
    "Good. Anything else you want to bother TzHaar-Xil-Mor with?",
    "Fine. That is it?",
    "Can I help you, [Title]-[Caste]-Player?",
    "TzHaar-Ket-Jok is probably only one who likes it!",
    "Pathetic! The TzHaar-Xil would never allow themselves to be pushed around like that!",
    "Pathetic! The TzHaar-Xil would never allow themselves to be pushed around like that. Especially not by a coward who cannot even finish the hunt.",
    "I can understand why TokTz-Ket-Ek-Mack would not tolerate JalYt like that. TzHaar-Xil-Mor would do the same! But it is still not really good.",
    "Too little TzHaar involved, but better than first story.",
    "Good with no JalYt and focus is on TzHaar, but a TzHaar-Xil would never be pushed around like that.",
    "TzHaar-Xil-Mor does not like it! It is bad entertainment and bad for TzHaar!",
    "TzHaar-Xil-Mor does not like it! It is bad entertainment and bad for TzHaar!",
    "What you want, [Title]-[Caste]-Player?",
    "TzHaar-Xil-Mor is not entirely pleased with TzHaar-Xil's plans always getting foiled. Makes TzHaar-Xil look stupid.",
    "That story makes TzHaar-Xil look like it does not know what it is doing! TzHaar-Xil's purpose is stealth and hunt and we are good at it.",
    "Stupid JalYt, you already made change!",
    "Good. Anything else?",
    "Now everything TzHaar-Xil does fails, that is not good!",
    "That is really good idea, [Title]-[Caste]-Player. Finally a good reason for theatre.",
    "Do not mind them. Anything else you want?",
    "Yes, that would be good.",
    "Fine. That is it?",
    "What do you want now, [Title]-[Caste]-Player?",
    "That is good. Anything else you want?",
    "That is good. TzHaar-Xil-Mor will be rich and powerful!",
    "Ignore TzHaar-Mej-Kol, [Title]-[Caste]-Player. Role is fine. You want anything else?",
    "It is KetKul-Schmul, and I like it. You want anything else, [Title]-[Caste]-Player?",
    "You want TzHaar-Xil-Mor to play JalYt? That is absurd! If you do not want anything else, you can go now.",
    "It does not matter! You have given out horrible roles and TzHaar-Xil-Mor refuses to be part of the play unless you change them.",
    "Good! You want anything else?",
    "At least you cannot make it worse. JalYt-Jenny is horrible.",
    "TzHaar-Xil-Mor would get killed!",
    "TzHaar-Xil-Mor is best TzHaar-Xil alive. I cannot lose!",
    "Still bad.",
    "You want anything else? If not, you can go now.",
    "And be weak and get attacked? Bah...if you do not have better ideas, leave.",
    "You have given out horrible roles and TzHaar-Xil-Mor refuses to be part of play unless you change them.",
    "Good! You want anything else?",
    "TzHaar-Xil-Mor cannot play someone who gets defeated!",
    "Okay, I guess that is fine. You want anything else?",
    "No, that is still bad!",
    "What else you want?",
    "Yes, TzHaar-Xil-Mor is happy with roles.",
    "Tremble in my presence, JalYt!",
    "TokTz-Ket-Ek-Mack is far too smart!",
    "TokTz-Ket-Ek-Mack fears no prey!",
    "TzHaar-Ket-Jenny is dead!",
    "Price for what?",
    "Price for what? TokTz-Ket-Ek-Mack is no merchant!"
  ],
  "TzHaar-Mej-Kol": [
    "That is not truth! JalYt cannot be trusted even with this.",
    "As if TzHaar-Hur-Klag has not been fed enough power as it is!",
    "The play is horrible! TzHaar-Mej-Kol refuse to even discuss it unless JalYt change it right now!",
    "You need help, [Title]-[Caste]-Player?",
    "Because it is a distraction to TzHaar. Each caste has its own duties, theatre is not one of them.",
    "No, but TzHaar-Hur mine and other TzHaar are not distracted by it so it does not hurt if old TzHaar do it when they are too old to fulfil their caste duties. Was there anything else you wanted?",
    "If one TzHaar in play can be a TzHaar-Hur, then one should also be TzHaar-Mej.",
    "I have already told you, a TzHaar-Mej would never let TzHaar society go out of control like that.",
    "That is good. Did you want anything else?",
    "Hmm. As a test, maybe? Yes, TzHaar-Mej-Kol is fine with that.",
    "Yes. Anything else?",
    "I figured. Is JalYt done now or is there anything else?",
    "TzHaar-Mej-Kol already think story is good, why does JalYt want to change?",
    "Good. JalYt wants anything else?",
    "TzHaar-Mej-Kol is not play writer, you think of something.",
    "Yes, TzHaar-Mej-Kol is very happy with that idea. Good work, JalYt.",
    "This is not everything! We are very capable of our duties, and we stick to them, unlike you TzHaar-Hur!",
    "You do not know what you talk about, either of you! Now, was there anything else you wanted, JalYt?",
    "Not a good idea. TzHaar-Xil are kept very much in check by TzHaar-Mej. We have had years of experience how to keep them under control and they could not do anything like that without the TzHaar-Mej know about it.",
    "That is good. Did you want any more of TzHaar-Mej's valuable advice?",
    "I figured. Is JalYt done now or is there anything else?",
    "That is horrible!",
    "Yes, idea is stupid!",
    "Horrible! Such an unbalanced society cannot possibly be the result of a TzHaar-Mej's organisation.",
    "Such an unbalanced society cannot possibly be the result of a TzHaar-Mej's organisation, regardless of whether JalYt dies or not.",
    "TzHaar-Mej-Kol agrees with TzHaar-Ket-Jok. It is still horrible because no TzHaar-Mej would be part of such unorganised society, but at least our peace with other races is not broken.",
    "Horrible! Such an unbalanced society cannot possibly be the result of a TzHaar-Mej's organisation.",
    "That is horrible! A TzHaar-Mej would never allow such unbalance to happen in TzHaar society.",
    "That is not the truth! JalYt cannot be trusted with even this.",
    "TzHaar-Mej-Kol is also okay with story.",
    "That is horrible! TzHaar should not work together like that, we have specific caste roles that we should follow.",
    "That is horrible.",
    "That is completely out of line!",
    "You need help, [Title]-[Caste]-Player?",
    "Sure, let the TzHaar-Mej get robbed! How else will you try to ruin my day?",
    "TzHaar-Mej-Kol cannot get robbed by criminal. KetKul-Schmul is supposed to be aware of situation, how can it get robbed?",
    "Yes, that would work. Good idea, JalYt. Was there anything else?",
    "Roles are fine with TzHaar-Mej-Kol.",
    "Or so it wants them to believe!",
    "But far from it all!",
    "KetKul-Schmul wants TokKul!"
  ],
  "TzHaar-Hur-Klag": [
    "No, it is a bad story. TzHaar-Hur-Klag does not like.",
    "The TzHaar-Mej already thinks they are better than all other TzHaar. This play is an insult! I will not discuss until it is changed.",
    "What you want, [Title]-[Caste]-Player? I heard you agreed to help TzHaar-Hur-Brekt set up a play.",
    "What you want, [Title]-[Caste]-Player?",
    "It is based on fantasy and applied with fantasy. Not real issues or real challenges. It is pointless to TzHaar.",
    "TzHaar-Hur-Klag does not see how that could happen. No TzHaar caste is made for theatre. Was there anything else?",
    "But the story is really good now.",
    "Good. That was it?",
    "But JalYt has already made change.",
    "Good. That was it?",
    "There are not even any TzHaar-Hur in play! Make that happen first.",
    "That shows TzHaar-Hur is both successful and intelligent. Good idea, [Title]-[Caste]-Player.",
    "You are just mad because TzHaar-Hur are more intelligent than TzHaar-Mej! Get over it!",
    "Do not mind TzHaar-Mej-Kol, it is never pleased unless it gets exactly what it wants. Now, was there anything else?",
    "Not happy about TzHaar-Hur to be portrayed as weak, but it is good that we get recognised for our work. Anything else?",
    "Fine. That is it, then?",
    "That is NOT good work! TzHaar-Mej cannot control everything!",
    "It disgusts me! That is in no way an accurate depiction of TzHaar society. A TzHaar-Hur would have no place in it at all.",
    "That is in no way an accurate depiction of TzHaar society. A TzHaar-Hur would have no place in it at all.",
    "It disgusts me! That is in no way an accurate depiction of TzHaar society. A TzHaar-Hur would have no place in it at all.",
    "It disgusts me! That is in no way an accurate depiction of TzHaar society. A TzHaar-Hur would have no place in it at all.",
    "No, it is a bad story. TzHaar-Hur-Klag does not like.",
    "TzHaar-Hur-Klag likes it.",
    "Well, TzHaar-Hur-Klag think it is good.",
    "What you want now, [Title]-[Caste]-Player?",
    "Of course, you cannot possibly let TzHaar-Hur-Klag be anything special!",
    "What?",
    "TzHaar-Hur-Klag cannot play this role!",
    "Yes, but TzHaar-Hur-Klag is not normal TzHaar-Hur. TzHaar-Hur-Klag would not get robbed and beaten like this.",
    "Okay, and the great TzHaar-Hur can be called TzHaar-Hur-Klag?",
    "Good, then I am happy with it. TzHaar-Hur-Klag who only gets disturbed, not beaten. Anything else you wanted?",
    "Yes, roles are just fine with TzHaar-Hur-Klag.",
    "For its fine craftsmanship!",
    "But it feels better now!",
    "There are not enough TzHaar-Hur in this play!"
  ],
  "TzHaaHur-Klag": [
    "It disgusts me! That is in no way an accurate depiction of TzHaar society. A TzHaar-Hur would have no place in it at all."
  ],
  "TokTz-Xil-More": [
    "It is TokTz-Ek-Mack. TzHaar-Xil-Mor likes that role. Anything else you wanted?",
    "Current role is good. No need to change. Anything else?",
    "Current role is good. No need to change. Anything else?"
  ],
  "TzHaar-Hur": [
    "You need help, [Title]-[Caste]-Player?",
    "Yes, it has passed by here. It should be killed, it almost destroyed city!",
    "It has its home in small cave just north from here. It went in there.",
    "Do I look like TzHaar-Xil to you? TzHaar-Hur do not hunt or kill, we craft and mine.",
    "Good luck, JalYt.",
    "Are you not JalYt-Hur?",
    "That what you are...you skilled at making things, no?",
    "Then you JalYt-Hur!",
    "Not so, JalYt. I am TzHaar-Hur, one of the crafters for this city. There are also the wise TzHaar-Mej who guide us, the mighty TzHaar-Ket who guards us, and the swift TzHaar-Xil who hunt for our food.",
    "Whatever you say, JalYt!",
    "That what you are...you skilled at making things, no?",
    "Then you JalYt-Hur!",
    "Not so, JalYt. I am TzHaar-Hur, one of the crafters for this city. There are also the wise TzHaar-Mej who guide us, the mighty TzHaar-Ket who guards us, and the swift TzHaar-Xil who hunt for our food.",
    "Whatever you say, JalYt!"
  ],
  "Tzaar-Hur": [
    "Well, then. There is not problem.",
    "Well, then. There is not problem."
  ],
  "Option 1": [
    "Yes."
  ],
  "Option 2": [
    "No."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:TokTz-Ket-Dill?oldid=36141470’"
  ]
}