{
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "Denying being a human when talking to the three wise monkeys, more monkey colonist dialogue, dialogue with different levels of ice spells, talking to ali without the ring of charos, misc dialogue optionsYou can discuss this issue on the talk page or edit this page to improve it."
  ],
  "Player": [
    "Hello, Leela.",
    "How do you know about that?",
    "Touché.",
    "Sure, let's go.",
    "Er – right. You want me to leave?",
    "Oh, okay.",
    "Sorry, I'm busy at the moment.",
    "You called?",
    "My pleasure. Leela said that you might be able to help Osman in his important work.",
    "Your Majesty?",
    "The Scabarites attacked Sophanem. They believed that they had made contact with Scabaras and were acting on his command, only they were wrong. It wasn't Scabaras, it was...",
    "Yes, Amascut – or the Devourer, as she is now known – deceived the Scabarites and led them to war. No doubt she wanted to burn Sophanem to the ground.",
    "Always, Your Majesty.",
    "Can I talk about the Scabarites?",
    "Why do you think the Devourer used the Scabarites to attack?",
    "Ah right, yes, I forgot.",
    "But...",
    "So, [Player] meant to hurt the Scabarites?",
    "Can I be of service?",
    "What happened to you?",
    "What happened to the servant?",
    "That's awful.",
    "Where are you going with this?",
    "I think that some work with Ali Morrisane's carpet overseers.",
    "Then I don't know. I suppose they must have died out.",
    "What's the big deal? Why are the desert monkeys so crucial?",
    "Can we talk about something else?",
    "I have nothing more to say.",
    "I think I've done enough already.",
    "Does Osman know you're here?",
    "What do you think of the Pharaoh Queen?",
    "By proud you mean stubborn, right?",
    "I'm unable to find any monkeys that seem suitable.",
    "I think I've learnt enough about Apmeken. I think I understand why these monkeys are so important.",
    "Yes, I think I understand why the desert monkeys are essential.",
    "Can we talk about monkeys?",
    "I'm working on bringing the monkeys back to the desert.",
    "Did you say 'bananaman'?",
    "Are you okay?",
    "Excuse me.",
    "*Cough* Excuse me!",
    "I'm trying to take some of our kind back to the desert-",
    "Some chimp told me that they used to, but they all die – err – left. There's this goddess called-",
    "Er, right. How do you know about her?",
    "Well...",
    "Okay, okay. Please don't overreact. I'm a human.",
    "Are you done?",
    "I have a greegree that lets me take on the form of a monkey, and I've been using it to travel around the island unhindered.",
    "What is it?",
    "What, really?",
    "Oh, right, well, my intentions were good. I was just trying to help your king.",
    "I can't while he's watching.",
    "I'm not a human. I'm just a well-travelled monkey.",
    "Why are those gorillas standing to attention?",
    "What's that song about?",
    "I can't while he's watching.",
    "I think I've gotten rid of that guard.",
    "Finished?",
    "Yes, I knew that.",
    "The monkey head.",
    "The baboon head.",
    "Fine, fine. Let's hear it.",
    "Down a burrow.",
    "Up a tree.",
    "Next to a sleeping tiger.",
    "On the monkey's shoulder.",
    "I can see I'm chasing a dead-end here. I'm going.",
    "What?",
    "Wasting my time was a test?",
    "You'll come with me?",
    "The ape head.",
    "The lion's head. Rarrrgh!",
    "No, not yet.",
    "I'm looking for some fellow monkeys to repopulate the Kharidian Desert.",
    "To build the greatest monkey colony ever!",
    "No, no! It needs to be in the desert.",
    "Erm, to build a stronghold. To create a bastion of monkey power in the center of the desert! The camels will fear you, Your Majesty.",
    "The desert has lots of fine goods to trade.",
    "Sand!",
    "Camels from Pollnivneach.",
    "Magic carpets from Al Kharid.",
    "Spices.",
    "Scimitars from Al Kharid.",
    "Choc ices from Nardah.",
    "It's a chocolatey, creamy treat that tastes cold in any weather.",
    "Oh, it is.",
    "Uh-huh.",
    "Right, yeah.",
    "Of cour- well, er, no, it's sort of rectang-",
    "I mean, well, it could be?",
    "Sandals.",
    "Gems from Al Kharid.",
    "Really? Where?",
    "Kebabs from Pollnivneach.",
    "Spicy meat wrapped in a flatbread.",
    "No, I think it's erm...camel?",
    "Granite from the west of the desert.",
    "No, it's a chalky sort of rock.",
    "Actually, I have no idea.",
    "To appease the great desert goddess Apmeken.",
    "But-",
    "I'm not sure, really.",
    "I haven't managed to procure one yet.",
    "Good day! I'd like to commission a special kind of choc ice.",
    "I'm not after one of your usual choc ices. I'd like a less 'conventional' one, one shaped like a chimp.",
    "If I told you, you wouldn't believe me.",
    "Deal!",
    "No, I don't make a habit of walking around with monkey-shaped ice cream moulds.",
    "Well, I have this amulet mould. It's in the shape of a monkey's head.",
    "Is there a problem?",
    "That doesn't sound good.",
    "Why shouldn't I teleport?",
    "Okay, so don't teleport and then it won't melt?",
    "What?",
    "No deal.",
    "I don't have any spells suitable for freezing this at the moment.",
    "That should keep it frozen for a bit longer. It won't last forever though.",
    "I've brought you a chimp ice fit for a monkey-king, Your Majesty.",
    "Here you go.",
    "Yes, Your Majesty.",
    "That's very generous.",
    "Er, Your Highness?",
    "Can I have the monkeys?",
    "A barrel of monkeys? How convenient. Better pick up those three wise old monkeys.",
    "I'm working on it, Your Majesty.",
    "Yes! He gave me this barrel of monkeys.",
    "What's the matter with him?",
    "Iwazaru, do you want to stay here?",
    "What's the matter, then?",
    "Where in the desert do we need to go?",
    "Huh?",
    "Where are we meant to go?",
    "Where are we meant to go?",
    "Why do you insist in talking in riddles?",
    "Well, if you guys are settled, I'll be going.",
    "Is that sarcasm?",
    "Ah, it was sarcasm.",
    "Really? Carpets don't seem much quicker than running, if you ask me.",
    "So, you want me to get you on the carpet network?",
    "I'm interested in setting up a new magic carpet route.",
    "Excuse me?",
    "- But -",
    "(Persuade) It can't hurt to tell me why not.",
    "Have you tried to retrieve the goods?",
    "So, they're lost to the desert?",
    "What?",
    "(Persuade) Come on you can tell me...",
    "Ava?",
    "(Persuade) I don't suppose you have one of those metal crates handy?",
    "Thank you, Ali. You've been uncharacteristically obliging.",
    "What route did the carpet take?",
    "(Persuade) Oh, go on, how could I start a network to rival your own: the amazing, entrepreneurial Ali Morrisane?",
    "Camel-shaped rock? You're just like those crazy monkeys! It looks more like an elephant to me.",
    "Would you hire me to find your goods?",
    "That's not a bad idea.",
    "Nothing.",
    "How were you planning to retrieve the goods again?",
    "(Persuade) Please? I'm sure it was a plan as cunning as you are clever.",
    "Goodbye, Ali.",
    "Hello, Ava. I need to find a way of detecting metal crates buried underground. Could my device be upgraded to do that?",
    "Woah! Sorry, you just seem quite matter-of-fact. I thought I'd be direct.",
    "Well...er...I...",
    "Huh?",
    "But then you, you said...oh...never mind. I give up.",
    "No, sorry.",
    "Yes, I've got it here.",
    "Here you go.",
    "So, how are-",
    "I found the crate. The alerter is a great success!",
    "Thanks, Ava, you've been very helpful.",
    "I've managed to procure some magic rugs for you. It wasn't easy.",
    "I've got you on the carpet network. All's good now?",
    "Wow! There's a stroke of luck.",
    "I've got to do what's written here?",
    "Am I done?",
    "Right, I've built your stalls and a tent. I've traipsed halfway across the desert to find you a carpet. Please say I'm done!",
    "What are monkey knives?",
    "They sound fierce. How am I meant to steal from them?",
    "Right, I'll get on with it.",
    "Where can I find those monkey knives?",
    "Yes, but where?",
    "They sound fierce. How am I meant to steal from them?",
    "Right, I'll get on with it.",
    "What now? Slippers made from kebbit-hide? A parasol stolen from the king of Varrock? A tree grown from the sweat of the Chaos Elemental?",
    "What, really?",
    "Is there anything else I can do for you?",
    "Strangely.",
    "Osman doesn't seem happy with you.",
    "So, you're staying?",
    "Nice turn of phrase!",
    "I've established the monkey colony, Your Majesty.",
    "Hey, where's my reward?",
    "Is something wrong?",
    "Hmmm, a dead monkey. How on earth am I meant to speak to that?",
    "Hello?",
    "What happened here?",
    "But you're... Oh, they killed everyone? Even the three wise monkeys?",
    "Why didn't they kill the wise monkeys?",
    "Who took them?",
    "I must try to rescue them.",
    "W-w-what are you?",
    "Not without Iwazaru.",
    "You're going to die here.",
    "Woah, what's going on here?",
    "Iwazaru! Are you alright?",
    "Have you managed to track down the others?",
    "Thanks.",
    "What is going on here?",
    "Mizaru, are you alright?",
    "I've managed to rescue Iwazaru, but I haven't found Kikazaru yet.",
    "I'm going to need my cramulet or monkeyspeak amulet to speak with him.",
    "What's going on here? What were those things? You and your brothers aren't...Apmeken?",
    "The priests say that Amascut isn't evil; they say that destruction is very necessary.",
    "How terrible! So, that's how you lost your sight? And your brothers their speech and hearing?",
    "How did you find out about all this? How do you know about Apmeken's feud with Amascut, about the curse? You're only a monkey!",
    "You're not as stupid as you pretend to be.",
    "What?",
    "Where's Apmeken now?",
    "Why did you return to the desert? Did you know that monsters would still be here?",
    "Any luck tracking down Kikazaru?",
    "I'll check out Uzer and see what I can find.",
    "This place still gives me the shivers.",
    "...",
    "I need to know what's been happening here.",
    "Well, yes...",
    "Why didn't you tell me? I could have helped more than I did.",
    "That was my choice to make.",
    "And what of Apmeken?",
    "My god, a goddess!",
    "It is an honour...",
    "What's the deal with these three? Most of the time they seem as mad as jackals, but other times they act pretty smart.",
    "So, what will become of them? What of you?",
    "Shall we get back to rebuilding this colony?",
    "Hey.",
    "What will you do now?",
    "Er-",
    "Gah-",
    "I thought you said the king cursed your senses.",
    "Are you going to tell me what that monkey song is about?",
    "Bye.",
    "The Devourer stole her senses and created monsters from them, unleashing them on the desert monkeys.",
    "The colony I set up was massacred by the monsters, but I was able to speak with one of the dead monkeys-",
    "Oh, I have these amulets, and, through some hitherto dormant magical ability, I was able to join them together.",
    "The dead monkey tracked down the monsters, and I was able to destroy them to restore Apmeken's senses.",
    "I have questions about the Scabarites.",
    "Can we talk about Apmeken?",
    "I don't understand.",
    "I spoke to Apmeken after restoring her. She didn't act as I had expected.",
    "Jex and the wise monkeys spoke of her as mischievous and cunning, but she seemed almost sombre.",
    "Can I be of service?",
    "Can we talk about something else?",
    "I have nothing more to say.",
    "You mentioned adding other amulets to my cramulet?",
    "Hello, Jex.",
    "Could you tell me more about the minor gods?",
    "Could you tell me more about Apmeken?",
    "What makes you think that?"
  ],
  "Leela": [
    "Hello, [Player], this is a happy coincidence. Or perhaps providence. I was just about to make the trip to the mastaba, east of Uzer, to pay homage to the Pharaoh Queen. I wonder whether you would like to join me? I am sure she'd like to hear of your clash with the Scabarites.",
    "How could a daughter of Osman not know?",
    "Quite. So, are you coming or not?",
    "Then let us be on our way.",
    "Your Majesty, it is an honour to finally meet you.",
    "Those monkeys are imported from Karamja. They are not native to the desert.",
    "I have been talking with Senliten. I fear things are far worse in the desert than we could have suspected.",
    "No. I wasn't meant to make contact with Senliten until directed, but he must learn that I am his daughter, not his slave.",
    "Senliten? She is remarkable, but I find myself constantly holding my tongue. She's easily offended and painfully proud.",
    "Ha! Perhaps, but don't let her hear you say that.",
    "I can't help you with that. The monkeys from Karamja are reportedly cruel and stupid. I wouldn't waste my time with them.",
    "Let me walk you to the mastaba's entrance, after you walked me all the way here, it seems only fair to return the favour.",
    "You ask so much but say so little. I am not an agent who will follow you blindly anymore.",
    "Only because you do not tell me why it is important! I told you I was done with your spy games. I have found my own path, my own important work to do.",
    "No.",
    "Advice he rarely needs, I can assure you.",
    "I have been talking with Senliten. I fear things are far worse in the desert than we could have suspected.",
    "How is your task fairing?",
    "Is that not always the way?",
    "I don't think Osman is ever 'happy' with anyone.",
    "He is not my master. Sometimes he is too wrapped up in his world of espionage and betrayal to see the desert for the sand.",
    "Thanks.",
    "How is that possible?",
    "Perhaps the magic of the desert aided its champion? You may be able to add additional amulets in a similar fashion. What happened next?",
    "I have been talking with Senliten. I fear things are far worse in the desert than we could ever have suspected.",
    "A cramulet? Ah, you are a wit. Well, I assume that, if you can combine two speech amulets together, you can add another. I would give it a go.",
    "Senliten's words still ring in my ear, [Player]. You've achieved much, but this is just the start. I hope I am wrong, but who knows what evil Amascut has spawned?"
  ],
  "Senliten": [
    "Leela, [Player], welcome.",
    "Leela, you may call me Senliten. [Player] went to some length to retrieve my name; it would be a poor gesture if we did not make good use of it. [Player], if you would excuse us, Leela and I have much to talk about.",
    "I will call you when I have need of you. If you would just step outside for a moment to grant us some privacy.",
    "[Player].",
    "Greetings, [Player].",
    "I thank you again for reinstating the sanctuary of my tomb and awakening me from my death.",
    "Osman? Yes, I hope to help him; however, my first loyalty has and always shall be to my kingdom. So much has changed. These are not the lands I remember. Leela tells me that the fertile lands river lands have crumbled into dust and sand, that the forests have been uprooted by the sun, that my once-great empire has fallen to treachery. These changes are nothing but scant warnings of what is to come, if I have read the signs correctly.",
    "Leela says you encountered followers of the ancient sect of Scabaras. Expand on this.",
    "Amascut?",
    "That is certainly one conclusion we could draw. This is worrying. [Player], these are dark times for the Kharidian Empire. Should I need your aid, could I count upon you?",
    "Most noble, [Player].",
    "Certainly.",
    "Why, you uttered the answer from your own lips. She wanted to 'burn Sophanem to the ground'.",
    "Ah, you are sceptical. Good, yes, very good. I see why Leela respects you. The Scabarites of my day were mainly scholars and intellectuals – the sky, retiring types. They were not warriors that could be used to overthrow a city. Perhaps they have changed... You have to see: they gave up their isolation. There is importance in this. Isolation is the one ideal a Scabarite holds above everything else. Know this: in the attack, the Scabarites lost more than their enemies.",
    "Perhaps, perhaps. Let us hope, since the alternative is...surely not...",
    "Perhaps, but first let me tell you a story. My memories have only recently returned to me, and it is an indulgence to share them with someone. When I was a young girl, no older than three or four years old, I played in the great pine forests of the eastern Kharidian Empire. A servant watched over me; she was elderly, and I was young and nimble. I evaded her and headed deep into the forest. I remember feeling happy and free, that was the first time I had been alone. For a Pharaoh, solitude is a gift, one we relish greatly but are granted very rarely. As I delved deeper, I heard distant shrieks, and my revelry turned quickly to fear. I started to cry and sat upon the dirt. I knew then of death. I saw it in the jaws of a jackal as it approached. Suddenly, there was a rustle in the trees above, and out dropped a dozen monkeys. They formed a circle about me and bared their teeth at the jackal. To my shock, the jackal turned and ran. In that forest, the jackal feared the monkey, for the monkey fought as one group. The monkeys were friendly animals, kind enough to save a little girl, and through friendship they found strength.",
    "The monkeys brought me to the edge of the forest and waited till I was found by my father's men. They fell to their knees and worshipped the monkeys like gods.",
    "She returned to the palace and informed the guards of what had happened. After I was found, they led her out into the hotlands and chained her to a stake. They left her to die in the heat. She was so old, I doubt she lived long.",
    "She had failed in her duties and put my life at risk. Her punishment was to be expected. I imagine she went to her death willingly – the shame would have been great.",
    "The forests are gone and the desert monkeys have no home nor shade to keep out of the heat. Where do they live now?",
    "You say that with too little concern. In my time, the monkey was a sacred creature, revered like the cat. I need your help, [Player]. You must return the sacred monkeys to the desert.",
    "I see you do not connect this with the goddess Apmeken? Go to the city of Sophanem: Leela tells me that the Sphinx sill abides there. She and a local priest called Jex know much about minor deities. Discover all there is to know about a goddess called Apmeken. Doing so will illuminate the importance of the desert monkey.",
    "Certainly.",
    "Greetings, [Player]. Have you learnt all you can about Apmeken from Jex and the Sphinx?",
    "Good. Apmeken was once a monkey, turned into a deity by Tumeken, father of the Kharidian lands. Monkeys are her symbol, her greatest supporters and her mortal embodiment. Of all the gods, Apmeken is the most humble She is a hard goddess to offend, but, for the Kharidian people to have averted their eyes while her monkeys died – that is an affront to her honour! Leela tells me that the desert is a cruel, harsh and unfriendly place. My descendants turned their back on the goddess of friendship, so what else could they expect? The monkeys must be reintroduced to the desert. Not as pets, but as free creatures. They must be wild, playful and hardy. I must ask that you do this for me. I cannot leave this tomb yet, and I need Leela to act as my eyes and ears.",
    "Greetings, [Player].",
    "Certainly. How goes your task?",
    "I am pleased you are taking this seriously.",
    "Greetings, [Player].",
    "Very good! This will surely appeas-",
    "Something is not right. Return to the colony, quick.",
    "Greetings, [Player]. Well done, [Player]. Even here, I can feel Apmeken's grace returning to the desert. Tell me, if you can, what happened to her?",
    "Amascut stole her senses? Sometimes I wonder if the Devourer is beyond redemption. I have rarely heard of crueller or more disrespectful acts. How did you manage to restore Apmeken?",
    "You have done well. Thank you for this service; let it not be said that one's Queen is not generous.",
    "Greetings, [Player].",
    "Apmeken is only the beginning. In restoring her, you have done the desert a great service, but there is still more to be done. Amascut's deeds, I fear, are widespread. No doubt her actions have bred more evil.",
    "The actions of gods are mirrored in the mortal realm. Amascut's actions heralded an era of cruelty, and mortals have adopted her unseemly behaviour towards sentient beings. We must tread carefully, for we do not have just Amascut to contend with. Those who have benefitted from her storm of destruction will try to stop us.",
    "How so?",
    "Interesting. Gods suffer and feel pleasure as you do; their feelings are infinitely refined, but the general sentiments are one and the same. She had a harrowing experience that will leave its mark. In time, we may see a return to form. Let us hope.",
    "For now, no. I have hired the services of a spy in the north. Once he has gathered more information, we will know more of what needs to be done."
  ],
  "Monkey Guard": [
    "You're being watched. The king is suspicious of these three, so he has sent me – his bananaman – to keep an eye on them and report any suspicious acts.",
    "No, I said he sent his best banana to keep a banana on them and to report any suspicious bananas.",
    "Banana?",
    "Yum, yum, yum.",
    "Who loves bananas? I do! I do!",
    "*Gulp* Gerr'off. Go away!"
  ],
  "Mizaru": [
    "Born from an egg on a mountain top. The punkiest monkey that ever popped-",
    "What!",
    "What are you jabbering about? 'The desert.' Monkeys don't live in the desert! Ha! Everymonkey knows that.",
    "Apmeken!",
    "Us? How do YOU know about her?",
    "Apmeken is a human god!",
    "There!",
    "OVERREACT!",
    "Psst. We too have a secret.",
    "I'm actually a banker from Lumbridge, Iwazaru's a baker from Varrock and Kikazaru is a knight of Falador. We've also been using greegrees to disguise ourselves.",
    "No! That would be an incredibly underhand and deceptive thing to do.",
    "Hmmm...show us your human form and then we'll decide whether you're trustworthy or not.",
    "Then get rid of him!",
    "Rubbish! Monkeys don't travel. That's such a human response.",
    "Oh, they're just doing drills. I hope they stop soon, as it's rather disconcerting.",
    "Yes, ol' banana-breath over there is the worst. The king sent him to watch us.",
    "I forget.",
    "Show us your human form. I want to see if you have a face we can trust.",
    "Then get rid of him!",
    "Well, come on then, show us what you've got!",
    "OVERREACT!",
    "Disguise yourself! Quick, quick, quick!",
    "...Apmeken...after all this time...tricking us no doubt...Apmeken...",
    "You say you know of Apmeken, but how can we trust you? You could be sent here by our nemesis to trick us!",
    "Gerroff me! Right, we'll settle this and see how much you really know about her. Apmeken changes her head depending on her mood-",
    "Oh, really? Well, what head does she show when she's feeling like being a joker?",
    "Yeah, she got lucky. Hmmph. So, you're a smarty pants? Reckon you're clued up on the goddess? Well, a real follower of Apmeken would enjoy a good riddle.",
    "A stupid squirrel came upon a monkey and foolishly challenged him. 'Oh wise and agile monkey, despite your speed and wit, there's one place where I can be, where you shall never sit.' The wise monkey accepts, his eyes alight. Oh, where did that stupid squirrel sit?",
    "Silly squirrel thought he was so clever, with his bushy tail, but cunning monkey said: 'You said there was ONE place where I cannot be but you can, yet there are TWO. Care to see?' The curious little squirrel nodded. And the monkey gobbled him up!",
    "Wait!",
    "It was a test!",
    "No! No! It was all a cunning assessment, a battle of wits! Let us tally the results, divide by twelve, multiply by seven, add the remainder to the power of four...why, you passed with flying colours!",
    "Er, well, yes, fine. We'll come, then.",
    "Has the king agreed to form a colony in the desert?",
    "Has the king agreed to form a colony in the desert?",
    "Excellent, we'll hop on in.",
    "Nothing, nothing. Let's go.",
    "Come on, come on. Let's get in that barrel.",
    "Between the camel's humps!",
    "Where are we?",
    "We're not in the desert, that's for sure. Try heading to the desert, you great big banana!",
    "No, no, no! This doesn't look right.",
    "A bird's-eye view could help to find the desert's mountain camel.",
    "Build a colony between the mountain camel's humps. It's simple, dungbrain!",
    "Settled? Settled? Oh, yes, settled. Life's a picnic.",
    "How are we supposed to do anything in this flea-bitten hellhole?",
    "If you aren't on the carpet network, you're nothing around here. No tourists, no trade, nuthink!",
    "Pfffffffffffffffft!",
    "Speak to Ali Morrisane. He's the man in the know when it comes to carpets!",
    "Not a bad job!",
    "Yes, yes! You'd be amazed by the number of tourists who've swamped here to see this pile of rocks! Apparently, the rubble has great geological importance.",
    "I was being sarcastic, nimwots! No one is going to come and see a bunch of rocks. No tourists, no money; no money, no bananas; no bananas, no monkeys!",
    "You might as well have drawn a big target on us and fired a catapult! Humans love gems! A lot! How are we meant-",
    "[Player] probably wants that.",
    "No, I think that's it.",
    "Sure, that's it. Thanks for all the help.",
    "No, no, we'll be fine.",
    "Help! Help! (No amulet: Ook Ook! Ook. Ook. Ook. Ah Uh Ah!)",
    "Oh! Is that you, [Player]? 'Bout time you showed up! My brothers – are they alright?",
    "Ook Ook! Ah Uh Ah! Ah! Ah Ah!",
    "Apmeken? Us? No. We're sputtering idiots. No, no – I suppose I should start from the beginning. A long time ago, when I was still a young chimp – longer ago than you may think – there were two goddesses: Apmeken, the goddess of friendship, and Amascut, the goddess of evil and destruction.",
    "Pfft! Priests? Priests are paid to lie; we monkeys said it as we saw it, and, believe me, we saw evil. Over the centuries, it was said that Amascut kept away from Apmeken. Amascut considered her too weak and insignificant to deal with. However, unbeknownst to Amascut, Apmeken and some of the lesser deities worked to bring peace to the long-warring desert. Slowly, they patched the ill-feeling between Al Kharid and Menaphos. Fifty years ago, the progressive young Pharaoh of Menaphos proposed an alliance of Al Kharid, in the hopes of bringing prosperity to the desert. He was a worshipper of Apmeken. Amascut was furious. Without war there could be no destruction on the scale that she desired. She cursed the pharaoh and hunted down Apmeken. They fought a battle in the dunes of the desert. It did not last long; Apmeken was no fighter. Amascut could not destroy the lesser god, but she could curse her, so she stole Apmeken's sight, hearing, and speech. Perhaps we were caught in the boundaries of the curse, or perhaps we suffered in sympathy; I don't know, but many of us desert monkeys lost our senses.",
    "Yes, but Amascut was not satisfied with merely incapacitating us. She took Apmeken's stolen senses and, from them, forged three foul creatures – Leeuni, Ayuni and Eruni – setting them upon the monkey population. Perhaps, if we'd had our senses, more of us would have survived. My brothers and I were able to escape by helping one another. After travelling to Karamja, we heard about Ape Atoll and set off for it. As far as I know, we were the only ones to survive the massacre.",
    "Yes, but a very old monkey!",
    "Heh! And you're not as ugly as you look.",
    "Heh heh heh!",
    "That really is the question, isn't it? Shame I have no answer to it.",
    "Hmm, ah, well... Rescue my brother, then we'll talk more about that. I'd offer to help, but I'm more likely to lop your head off than the enemy's.",
    "You need to find Kikazaru.",
    "We had always meant to return. The desert was our real home, but our life in Ape Atoll had become comfortable. We had plenty of scope for mischief, what with the influx of half-witted gnomes. If you hadn't mentioned Apmeken, perhaps we would have never returned, but everything fell into place. It seemed that, finally, there were humans who cared; humans who would help us build a colony. With a colony, we could forge alliances with the locals, arm our guards and prepare to battle Amascut's monsters. We would have hunted them down, if needs be. Once they were destroyed, we were sure Apmeken would be restored. The monsters struck as soon as you left...",
    "Iwazaru wanted to, but we felt we couldn't risk it. If we awakened those creatures, innocent humans could have been killed. If you had known that, you may not have taken the risk.",
    "Search me, [he/she]'s gone nutty.",
    "I blame the heat.",
    "Hey, crazy!",
    "The punkiest monkey that ever popped-",
    "A singer and a swinger, a wildcat!",
    "Expand our empire till it consumes the desert, then rain death and destruction upon your people.",
    "A thousand years of darkness awaits these lands.",
    "Ha! Ha! Ha! Nah, we'll probably just catch a tan and slurp chimp ices.",
    "And you believed us?",
    "Maybe, some day.",
    "See ya later, crocodile."
  ],
  "Kikazaru": [
    "What is it, hairy?",
    "What? What did [he/she] say?",
    "Oh. What!",
    "Human? Where?",
    "By Curious George, [he/she]'s a human!",
    "Did she get it right?",
    "We'll need more monkeys! You'll need to go to the king.",
    "Not now, Iwazaru! Go to the king, [Player]. You will need to convince him. Hmmm, say you want to start a colony in the desert; that should do it!",
    "Quiet down!",
    "Certainly doesn't sound right, either.",
    "Perfect!",
    "Let me handles this! Now, what's going on?",
    "Ah, I see. Yes, we need monkey knives. Seeing that you caused this mess, you'll need to sort it out. If you don't, we'll be knifed in our sleep.",
    "They're knives wielded by the fearsome monkey knife fighters.",
    "They're the king's best, and will notice any sleight of hand. I'd punch 'em and pickpocket 'em while they're unconscious. You'll need to have a lot of strength to knock one of them out – more than a little monkey or human could muster.",
    "Monkey knives! We need monkey knives!",
    "Monkey knives!",
    "Ah, right: only Ape Atoll's monkey knife fighters carry them. You'll need to punch and rob them to bring at least six back.",
    "Son of a chimp! Well done! I'll hand them out.",
    "Apmeken would be proud!",
    "Well done, well done!",
    "I suppose you'll want to know what's been happening here?",
    "No? I really think you ought to. Come to the colony with me, and we'll explain all there.",
    "Who is [he/she] talking to?",
    "[He/She]'s cracked up.",
    "It's like nothing changed.",
    "Born from an egg on a mountain top,",
    "Bouncing 'round the desert in a bowler hat,",
    "Is the human saying something stupid again?",
    "In a while, alligator."
  ],
  "Iwazaru": [
    "Grrhhm! (Iwazaru looks shocked.)",
    "(Iwazaru points at himself and somehow conveys the desert by pretending to be a cactus.)",
    "(Iwazaru whacks Mizaru on the side of his head.)",
    "(Iwazaru mimes a rather unflattering impersonation of a human.)",
    "Mmmph! (Iwazaru points dramatically at you.)",
    "(Iwazaru nods.)",
    "Iwazaru shakes his head.",
    "Mmm! Mmmmmhmm.",
    "(Iwazaru cuffs Mizaru's ear and presses a finger to his mouth.)",
    "(Iwazaru nods furiously.)",
    "(Iwazaru conveys what's happening to Kikazaru.)",
    "Prrhhmm! (Iwazaru pulls at Kikazaru's ear.)",
    "Rarrghh! Raaagggh! (Iwazaru thumps Kikazaru on the side of the head and pretends to be a monster.)",
    "(Iwazaru beats his fists on the ground.)",
    "(Iwazaru shakes his head.)",
    "(Iwazaru shrugs.)",
    "Grrhmmph! (Iwazaru does some complex monkey sign language that you don't understand.)",
    "(Iwazaru cuffs Mizaru around the back of the head.)",
    "(Iwazaru pushes Mizaru out of the way and hands you a book.)",
    "(Iwazaru nods.)",
    "(Iwazaru looks around.) (Iwazaru nods happily.)",
    "(Iwazaru explains something in rapid, almost dizzying sign language.)",
    "(Iwazaru quickly translates.)",
    "(Iwazaru punches Kikazaru and translates by pretending to carry a sack of loot.)",
    "(Iwazaru cuffs Kikazaru to get his attention, and rather enthusiastically makes a stabbing gesture.)",
    "Prrrhmmm! Pffffhrrrrm! (Iwazaru is trying to tell you something.)",
    "(Iwazaru makes some strange signals.)",
    "Mmmm mmmm mmm!",
    "Mmmm! Mmmm!",
    "(Iwazaru waves at you.)",
    "(Iwazaru waves at you.}",
    "Mmm! Mmm!",
    "(Iwazaru nods.)",
    "(Iwazaru nods.)"
  ],
  "Awowogei": [
    "Hello diplomat. Is there anything I can do for you?",
    "Hello, stranger. What can I do for you?",
    "That's human territory! Why would I want to send my monkeys there?",
    "A colony? What a fantastic idea! We'll build it on Karamja.",
    "The desert? That dead place? Why would we want to build it there?",
    "Colonies are built for trade. What would we trade with the desert? Sand? Oo-oo-oo-ah-ah-ah!",
    "Ha! Name one.",
    "Bwa-hah-hah! Baw-ha-ho!",
    "Those sand-spitters? No thanks!",
    "A carpet should stay where it is, not move about.",
    "Spices? Hot hot hot! No thanks.",
    "Scimitars? We have scimitars already! You want us to trade scimitars for scimitars? You're pretty stupid, for a monkey.",
    "A choc ice? What's that?",
    "Sounds delicious.",
    "All chocolatey and creamy...",
    "...and cold on a hot day...",
    "...and in the shape of a monkey.",
    "Pfft!",
    "Bring me a choc ice shaped like a monkey. If it's as good as you say it is, we can talk business.",
    "Bwa-ha-hah! Baw-ha-ho!",
    "Gems? Coloured stones? Why would we want them? We've got heaps of them!",
    "Never you mind!",
    "What's a kebab?",
    "Oooh, is it squirrel meat?",
    "Yuck!",
    "Oooh, like the crab?",
    "Why would anyone want that?",
    "How dare you mention that false monkey-god's name!",
    "Arrest that monkey!",
    "Where's my choc ice?",
    "Hurry! Another monkey offered to bring me a 'corn dog' if I built a colony in Lumbridge. Oo-oo-ah-ah-ah!",
    "Let me see, let me see!",
    "Mmmmm. Mmmmm *gulp* mmmm. This is superb! This could rival even a stuffed snake. These can only be made in the Kharidian Desert?",
    "Then you shall have your colony!",
    "Yes, yes, I shall have more of these. Then for every meal! We shall run the desert dry of these tasty little snackerels.",
    "Yes?",
    "How is the colony fairing? I expect my first shipment of chimp ices soon."
  ],
  "Uwogo": [
    "Karamja would be perfect, Your Majesty.",
    "Oh, good one, Your Majesty.",
    "*Chortles*",
    "*Chortles*",
    "*Chortles*",
    "*Chortles*"
  ],
  "Rokuh": [
    "Ah, so you've heard of my legendary choc ices! You shall have one in the smallest of seconds, for the meagre price of this: of only one hundred gold coins.",
    "Shaped like a chimp? Whatever for?",
    "Ah, a particularly particular customer, I'm guessing. I have known many eccentrics in my time. They're people of exacting standards and deep wallets, yes? I shall make you a *chuckles* chimp ice for 1,000 coins.",
    "Excellent! Excellent! I will need a mould in which to set the iced chocolate. Do you have such an item?",
    "Neither do I, friend. I suggest you procure one so that I can make your chimpish treat.",
    "That will do perfectly. Hand it over.",
    "Ah, well, hmm, yes... Here's your chimp ice!",
    "No problem at all, my dear friend – no problem at all. Well, perhaps there's but the smallest of problems: a gnat-sized one, you understand. The magic that keeps the ice frozen seems to be escaping out from the unconventional shape. It appears that a rectangular shape is far superior at containing magic than a monkey shape.",
    "Do not worry yourself! As I said, it is but the smallest of problems. As long as you refrain from teleporting while holding it, all will be fine, I'm sure.",
    "Such a surge of matter-disrupting magic will likely melt your chimp ice to a puddle, my friend.",
    "Of course, of course. Well, perhaps not...",
    "Well, the magic is seeping out, my friend. You'll have to think of a way to keep that tasty treat frozen. Now, set off, my friend, before you find that your choc ice is a puddle of chocolate."
  ],
  "Monkey": [
    "Let us out!"
  ],
  "Ali Morrisane": [
    "Hello [Player]. How's the adventuring going?",
    "No, no, no.",
    "I've lost enough money trying to set up new carpet routes. Not interested-",
    "You won't persuade me on this one.",
    "Hmmph. Well, I've lost money trying to set up a carpet route to the pyramid north of Menaphos; after all, a lot of traffic is going that way. We transported a carpet from Al Kharid but it got caught in a sandstorm. Most of the goods fell off and my dear cousin, Alex the Brave, barely escaped the storm with his life.",
    "We had a look, but the sandstorm seems to have covered them up.",
    "Perhaps, unless...",
    "It's nothing.",
    "The goods were kept in five large metal crates. I've heard tales of a young scientist in Draynor who has done amazing things with undead chickens and magnets.",
    "Ah, you know of her! I intended to have her build me a device that could detect metal underground. Only, I don't have the time to travel to Draynor, let alone search the desert. I suppose I'll have to hire someone.",
    "Of course. Here you go, my friend.",
    "I will not say! You plan to retrieve the goods for yourself and start your own carpet network! You've shown your hand already, friend.",
    "I suppose there's no harm in telling you, you're just interested, that's all. The carpet set off from Al Kharid, headed south, and was blown off course and went west around the Desert Mining Camp. My cousin, Alex, was forced to crash land between the Desert Mining Camp and the Bedabin Camp, north of that strange camel-shaped crop of rock. The crates should be somewhere in that region.",
    "Monkeys? Elephants? Are you feeling alright, friend? You haven't been in the sun too long, have you?",
    "No. You'd only find the rugs and use them for yourself.",
    "What?",
    "Ha! And let you find them? I think not! I will not say.",
    "Well, it was certainly a cunning plan. I was going to contact Ava, a scientist in Draynor Manor who has been working with devices that attract metal. I was going to have her make a device to find the goods lost in the desert."
  ],
  "Ava": [
    "'Oh, hello Ava can you do this? Can you upgrade that?' What happened to 'How are you today, Ava?' or 'Gee, Ava, what's up in your life?'",
    "Oh, I'm matter-of-fact, am I? You sure know how to compliment a girl, don't you?",
    "I think it should be possible.",
    "I should be able to upgrade the accumulator. You just asked? Remember?",
    "Oh, I love to see you flustered. I'll only need to make a minor adjustment. Do you have the accumulator on you?",
    "No, of course not. Why bring the device you want modifying? Go and get it. If you've lost it, I can sell you a replacement.",
    "Excellent, and I'll need a sample metal crate. It must be exactly the same as the crates you're searching for, in order to adjust the sensitivity correctly. Do you have one on you?",
    "Good [boy/girl].",
    "Shhh.",
    "Almost there.",
    "There, all done. Behold: Ava's alterter! It will only detect metal crates of the exact size and metal grade of the sample crate. As always, ensure you aren't wearing metal armour when operating it. When you're in close proximity to a crate, the undead chicken will start screeching, so you'll know that you're close. The more it screeches, the closer you are. Dig when you think you've found it. In addition to this new feature, it will continue to retrieve your arrows and can scavenge for metal in the same manner as the accumulator. All that remains now is to test it. Two seconds.",
    "I've hidden that crate in the grounds of the mansion. Get a spade and see if you can find it, then report back to me.",
    "Glad to hear it.",
    "Oh, stop gushing. I can never get a word in edgeways with your pleasantries and inexhaustible flowery prose."
  ],
  "Osman": [
    "I expressly ordered you to return to Draynor!",
    "I ask only for what must be done. Else, Al Kharid will fall to the tyrant of Menaphos. We must stay vigilant. You, Leela, must be constantly ready. The plan needs to go ahead. You don't realise how important this is!",
    "Oh, yes, I've heard all about your 'important work'. The wildlife sanctuary in the desert? My friends find it most amusing.",
    "Do you think it's funny to see your father ridiculed, as his daughter wastes time playing with monkeys?",
    "Enough! I sense we are not alone. Ah! I should have known! The chief monkey [him/her]self! If you will all forgive me, I have real work to do. Leela, when you are ready to put aside this foolishness, you know how to contact me."
  ],
  "Pharaoh Queen": [
    "Do not argue here.",
    "Osman, if only you could look less at the ways of man and more at the ways of monkeys...",
    "Your father should watch his tongue, Leela."
  ],
  "Dead monkey": [
    "Oooo-wooo-ooo!",
    "Ook-ook! Ah-cha-cha!",
    "We couldn't stop them... they were too strong.",
    "Three masked murderers came...slaughtered the camp. I survived...I don't know how...",
    "No, they still live, carried off by the butchers. Iwazaru was taken to the smokey depths beneath Pollnivneach...where the banshees squeal. There he will surely be devoured. I don't know where they took the others.",
    "The desert monkeys? They escaped these murders...long...long...ago...",
    "Three masked butchers...fragments of gods...scourge of my people.",
    "The one who took Iwazaru is a dangerous foe. Do not fight him from afar, embrace his snapping teeth and deadly grip. You are not like other humans. I will track down the others...to help you...in your quest for...death.",
    "You saved Iwazaru. Now I have a friend...even if he is a little uncommunicative. Thank you.",
    "I followed Mizaru's tracks deep underground. The butcher dragged him through caves full of giant bugs...even past a bug queen. Unless you are determined to die...be warned: the creature who took Mizaru is fearsome with her fists. Stay your distance but do not hide...for she will...find you.",
    "Mizaru is safe, but he ignores me, just like Iwazaru.",
    "I followed his scent to Uzer, but the trail ended there. I am sorry that I can be of no more help.",
    "It will hear your approach. You cannot hide from it. Death awaits you."
  ],
  "Leeuni": [
    "My sisters and I thank you for returning the monkeys to us.",
    "We cracked their little heads and sucked innards from their ruptured necks.",
    "I am Leeuni, formed from the lips of a goddess. Now, leave.",
    "Very well. I shall feast upon your guts.",
    "Stop hiding those lips from me.",
    "Rraaagh!",
    "No, no, just one more bite. Just one...more..."
  ],
  "Apmeken": [
    "From my lips she plucked my words and moulded them into Leeuni. I could no longer reassure the desert people, so they turned distrustful and fought with one another.",
    "From my eyes she chipped my sight, which bore Ayuni. I could no longer watch over the desert people; without my watchful gaze, they turned to darkness, crime and hate.",
    "From my ears she stole all sound and crafted Eruni. I could no longer hear the voices of the desert people, and we became isolated from one another. Soon, the desert people became deaf to each other's pleas. Reason and mercy left these lands.",
    "Your deeds restored my senses, [Player].",
    "When I lost my senses, I turned my back on the desert. I was incapacitated, and the slaughter of my beloved monkeys robbed me of my heart. I could not hear their cries, nor see the bloodshed, but I could sense every corpse on the desert's sands. I closed their eyes and wished that Icthlarin would take them. But I was wrong to turn my back on these lands. Incapacitated though I was, my wounds weren't so different from these three monkeys, yet the way we coped was worlds apart.",
    "Knowledge is a quality, but it is always accompanied by worry and fear. Whereas, bathing in the sun is problem-free. Understand that and you understand them. Together they were able to overcome their difficulties, something I had not been able to. When Amascut took my senses, I turned away from my people, but these three turned the other way.",
    "I shall not return their senses. To do so would be an insult to what they have accomplished. As for me, I shall return to my duties as a goddess. Things are much worse here than I could ever have guessed. If needs be, I shall battle Amascut myself. Thank you, [Player], for all you have done."
  ],
  "Ayuni": [
    "Iiii see you are persistant. My siiister's tongue only served to sliiip her up. Iiii shall not be defeated quite so easiiily.",
    "Iiii can see into your soul. Iiii see your fear, your lack of confiiidence. Giiive up, my dear. Giiive up.",
    "Come iiinto the liiight and play.",
    "Iiiiii diiid not forsee thiiiis.",
    "Iiiiii am free..."
  ],
  "Eruni": [
    "I hear that my sisters failed to crush you, Champion of Filthy Apes, but you will not defeat me! This is a place of magic: a realm that I can bend to my will.",
    "Do you hear that? It is the sound of defeat.",
    "Ah. Defeated by a mortal..."
  ],
  "Jex": [
    "Hello, [Player]. Jex rubs his head tenderly.",
    "Something tells me that you might know more than I. I've sensed a change in the heavens, albeit a small one, and I can't help thinking it has something to do with you.",
    "Not many people come here, and, of those few that do, only a few care to mention Apmeken. I feel her sunny smile shining upon the desert, and I am convinced you are responsible for that. I thank you."
  ],
  "Monkey colonist": [
    "They said we were going to the dessert! Where's my banana split?",
    "The camels are watching us!",
    "I never knew there were so many hairless apes in the world.",
    "I guess the desert isn't too bad. At least I'm catching some sun."
  ],
  "Unarmed monkey guard": [
    "I'm watching you, hairless ape."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Do_No_Evil?oldid=35978234’"
  ]
}