{
  "Kaqemeex": [
    "What brings you to our holy monument? I sense the hand of Guthix in your arrival. Maybe you can help me with something.",
    "I have a worthwhile quest for you, actually. I have heard you have been quite instrumental in helping hold back the troll invasion.",
    "I have a worthwhile quest for you, actually. You have about you the air of a wandering hero, and I sense you can aid us.",
    "You are aware, are you not, that we worship Guthix; the god of balance?",
    "Guthix is the oldest and most powerful god in Gielinor. His existence is vital to this world. He is the god of balance, and nature. He exists in the trees and the flowers; the water and the rocks. He is everywhere. His purpose is to ensure balance in everything in this world and, as such, we worship him.",
    "Well, anyway, we wish to contribute our strength to those soldiers who are fighting to protect us. However, Guthix sits in balance on the matter. All the omens show that he favours neither side more than the other, because on a global scale the trolls' chaos and disorder are relatively minor.",
    "In Taverley there is a herbalist, Sanfew. He is researching a potion we can offer to Guthix to bring our plight to his attention. The trolls represent disorder. For us it os a major, immediate imbalance of the elements of harmony. But we need to call upon Guthix to right it will all haste. The potion is specifically called the ointment of imbalance. If it is applied to the stone it will call Guthix's attention to our plight. Once he sees the chaos the trolls have brought, he will turn his power against them, and our star will once more be in the ascendant. I would ask you hero, to go and help Sanfew with whatever he requests. With your help I am sure we can create the potion and perform the ritual.",
    "I will not try and change your mind adventurer. Some day when you have matured you may reconsider your position. We will wait until then.",
    "Excellent. Go to the last house on this side of the riverbank to the south of Taverley and speak to Sanfew who is working on the potion for the ritual. He knows what is required to complete it thanks to his studies.",
    "We are the druids of Guthix. We worship our god at our famous stone circle.",
    "We druids do not believe in the concept of a 'head priest' as such. We are all equally skilled and of equal importance in the eyes of Guthix.",
    "While it may be confusing to the uninitiated like yourself, it works quite well in practice. Consider the mighty oak tree...",
    "Exactly. The tree is strong only because the rains replenish it and the earth nourishes it. If the earth was dry, it would not grow, and in turn would not support the insects, the birds, the squirrels...",
    "Well...in a way you are right...as the felling of the trees opens space for fresh growth. I feel this description is getting a little away from me. In the end, if I issue an order it will be obeyed only if my peers feel that it is a worthy order to follow.",
    "I am the druid Kaqemeex. Holder of the skill cape of Herblore.",
    "No...My name is Kaqemeex. Ka-Q-e-ME-ex. The emphasis is on the 'q' and the 'me'. I can't understand how so many people get that wrong. Tell me, why are you trying not to laugh?",
    "The woods are in bloom; maybe you have hay fever. I think we have a potion for that somewhere.",
    "Guthix is the oldest and most powerful god in Gielinor. His existence is vital to this world. He is the god of balance, and nature. He exists in the trees, and the flowers, the water and the rocks. He is everywhere. His purpose is to ensure balance in everything in this world, and as such we worship him.",
    "Goodbye adventurer. I forsee we shall meet again.",
    "What, personally? No, of course I didn't. However, our forefathers did. The first druids of Guthix built many stone circles across these lands over eight hundred years ago. Unfortunately, we only know of two remaining, and of those only one is usable by us.",
    "Hello again. To continue in your quest you will need to speak to my fellow druid Sanfew in his house to the south of Taverley.",
    "Guthix, lord of balance, hear us! In the name of all beasts and plants, from the humblest mouse to the mightiest of dragons. From the tiniest blade of grass to the tallest oak...",
    "Well forgive me for trying to add a little gravity to the moment.",
    "Accept our sacrifice, Guthix; witness our devotion!",
    "I feel that our prayers have been answered. Guthix's will has turned against the trolls!",
    "Don't forget, these notes must be exchanged at a bank for real items before you can use them in your Herblore studies.",
    "Welcome back to our circle. Tell me, how are you progressing with your Herblore?",
    "That is good to hear.",
    "I feel it has. The hand of Guthix is upon the land now, and in time he will turn the tide to favour us again.",
    "These things will happen at the allotted pace. A year seems as but a moment to Guthix.",
    "I am unsure what you expected. Did you think we would perform the ritual and Guthix would leap out of the sky and beat the trolls personally?",
    "I find your grasp of theology to be a little tenuous. I suggest you study the mysteries of the gods and seek wisdom through meditation."
  ],
  "Player": [
    "How can I help with this?",
    "No, that doesn't sound very interesting.",
    "Ok, I will try and help.",
    "Will do.",
    "But doesnt[sic] that make things confusing? How do you get anything done?",
    "The oak tree?",
    "The lumberjacks?",
    "Cakemix? Your name is Cakemix?",
    "Thanks!",
    "I brought the stone fish you asked for.",
    "The...whole fish?",
    "Yes, here you go.",
    "How long do you think that will take?",
    "A year? You mean I went running around to gather all those items when it could be a year until anything happens?",
    "Well..."
  ],
  "Sanfew": [
    "What can I do for you young 'un?",
    "Have you now? Well, aren't I the lucky one? You may be good at bashin' trolls, young 'un, but this will take a little more thinking for you to get done. I've got a list of things I need you to retrieve for the potion. Don't you go worrying about mixing it up, just leave that to me. Now, let me see, what was it I needed again? Oh, I remember. I need you to get me a vial of 'untainted living water'.",
    "Here, I'll even give you a vial as you seem to be lackin' one.",
    "After that, you can get me some wandering wyrmwood. And while you are by the lake, you can catch me a stone fish and get some of the scales.",
    "It is said that there is a spring of living water. I've heard some trolls have gone and mucked about with it. But what we need is untainted by whatever modern hokum they have brought. Just take a vial and fill it up from that water source. That's all you need from there.",
    "Well I heard there is a patch of land on the southern shore of the lake to the south of Taverley where the ground is so fertile the plants can get up and walk. You can't really miss it because of...you know...all the plants walking around. Wait until one of the gets up and walks off, then pluck some leaves off it. If you try it when it is still planted it will not work, as if it has to be from wandering, wandering wyrmwood.",
    "The magic in the lake to the south of Taverley makes stone fish appear from time to time. The pebbles at the bottom of the lake just up and start swimming about, and before you know it, they've turned into a fish. They love gold, so go down there and bait a hook with a gold coin and you'll be sure to catch one. I don't need the whole thing, just scrape off some of the scales with a chisel and let it go free again.",
    "Well thank you very much! So nice to see some polite young people around for a change.",
    "Well, we all make mistakes sometimes.",
    "Did you bring me the required ingredients for the potion?",
    "Trouble with your memory eh young 'un? I blame all that loud music and fancy dancin' you lot get up to. I need you to get me a vial of 'untainted living water' from down in the enchanted cave.",
    "You can get me some wandering wyrmwood from down by the lake to the south of Taverley. They grow down to the south of the lake, in a tangle of other weeds. It's where the water's power is strongest. I need you to catch me a stone fish from the lake to the south of here and get some of the scales. Last I heard, there was a spot where those fish liked to congregate, over to the west of the lake.",
    "Good, good. Guthix be with you.",
    "Did you bring me the required ingredients for the potion?",
    "Now, did I ask for the whole fish, or the scales?",
    "...No. I just need some scales. Chip some off with a chisel and let that poor fish go!",
    "That's the stuff!",
    "Well, now I think about it, you've got it all for me! Right. Let's get this potion sorted then.",
    "There we go. Now, take this back to Kaqemeex at the stone circle and we'll be fixed up and ready!",
    "What are you gabbling about, young Kaqemeex? The ritual just calls for you pouring the Ointment[sic] on the stone. Are you trying to put us all to sleep?",
    "Well, did it work?",
    "Well, this calls for a celebration! Where's the mead?"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Druidic_Ritual?oldid=36212727’"
  ]
}