{
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "Dialogue with Hamal after Brundt asks for the rock back, Dialogue with Hamal before getting and before eating the White pearl fruit, Ragnar's last part dialogue, additional dialogue optionsYou can discuss this issue on the talk page or edit this page to improve it."
  ],
  "Guard": [
    "You stay right there, outerlander.",
    "I said stay there, outerlander! You're not welcome in our camp.",
    "Our camp, outerlander, and we don't want any trouble there.",
    "What do you have there, outerlander? It's not our rock, is it?",
    "Alright, you be on your way then.",
    "Go, outerlander, and do not hurry back.",
    "I suppose I might as well let you pass now, since I can't seem to stop you anyway. Just remember that I'm watching you."
  ],
  "Player": [
    "Don't worry, I'm not an outerlander, I am [Fremennik Name], a Fremennik!",
    "Why, what's beyond here?",
    "And my name is [Fremennik Name], honourable chieftain.",
    "Actually I'm a Fremennik. [If The Fremennik Trials has been completed]",
    "Why is everyone being so hostile to me?",
    "So, what are you lot all doing up here in the mountains?",
    "And you haven't even seen what he did to his house!",
    "So why are you still here?",
    "And?",
    "A damsel in distress! I will search for her!",
    "You don't need to employ me! Just let me look for her.",
    "Great! I'll be back with her soon. Just wait here.",
    "I'm sorry to hear that.",
    "Maybe the trolls got her?",
    "Oh, I'll stop talking to you then.",
    "I'm looking for a quest. Do you have any for me?",
    "Okay, I know the drill, where do I sign up for the trials to join your tribe?",
    "Who?",
    "Do you have any idea where she might be?",
    "So... do you have any idea where she might be now?",
    "But... you don't actually have any idea where she is right at the moment?",
    "What do you mean, my kind?",
    "Er... yes, hello?",
    "I think I'm going mad.",
    "Hello! Who are you! And where for that matter?",
    "Well, I suppose that answered both questions then.",
    "Wait, you're Asleif? I think I was looking for you! Where are you hiding?",
    "But I thought you said you were Asleif?",
    "I think I'd better lie down.",
    "So what exactly do you want from me?",
    "Er, I don't think they like the idea of me helping them.",
    "All right, that sounds like something I can do.",
    "Yes?",
    "I'll get right on it. So, let's see, peace with Rellekka, and a new supply of food.",
    "I'm not really a farmer.",
    "I'm not really a diplomat.",
    "Don't tell me, there's an anthem involved? (If Throne of Miscellania has been completed)",
    "I have found your daughter!",
    "Well, er, she is dead.",
    "Never mind.",
    "About the people of Rellekka... Why do you hate them so much?",
    "But don't you basically believe in the same things?",
    "So you've never considered, say, making peace with them?",
    "Great! Well, that was easy.",
    "Shall I go looking for him as well then?",
    "About your food supplies... From what I understand you're starting to run out?",
    "Er, I just happened to overhear it.",
    "Can I help you with finding a new supply of food?",
    "Have you spoken to the representative from the mountain camp yet?",
    "Are you, by any chance, Svidi? Sent by Hamal to talk to Brundt and the council of Rellekka?",
    "Yes, but Hamal asked me to rescue you from a Rellekka prison. What are you doing here?",
    "Why, can't you find the way?",
    "Why not?",
    "Nonsense. I'm an outerlander and I haven't killed you either!",
    "Aren't you supposed to be a ferocious warrior?",
    "Can't I persuade you to go in there somehow?",
    "Do you want me to go in with you as your bodyguard?",
    "What if I get you some kind of guarantee of safe passage from the village? Will that do?",
    "The chieftain from the mountain camp has sent a representative to Rellekka!",
    "Well, that's the problem, he doesn't dare to come into Rellekka. He's afraid he's going to get hurt.",
    "That's what I thought. He says he wants a guarantee of safety.",
    "Ancient rock? What did it do?",
    "Did it contain vast magical powers?",
    "Did it give the owner unimaginable strength?",
    "Was it the eternal prison of an immortal demon?",
    "Did it look pretty?",
    "So what did it mean?",
    "And is that true?",
    "No, of course not! See? It's a completely different rock, it's much smaller.",
    "I brought you back your rock!",
    "Well, it's not the whole rock, it's part of the rock... I split it in two.",
    "Can I have that guarantee of safe passage, then, to give to the representative?",
    "Brundt gave me the guarantee of safe passage to give to you!",
    "Here you go.",
    "Great!",
    "How goes the goat herding?",
    "Well, I'm trying to find a new supply of food for your people. Any ideas on where to start?",
    "Yes...?",
    "What's the name of that fruit?",
    "Any ideas on where to find some?",
    "I'll see what I can find.",
    "Never mind.",
    "About the people of Rellekka...",
    "I did it, I persuaded Brundt to speak to your representative!",
    "Well, yeah, I need to talk to you about that...",
    "About your food supplies...",
    "I've found this seed that may be of interest to you.",
    "It's the seed of the White Pearl fruit. It grows on White Wolf Mountain, even in the snow. With luck, you'll be able to grow it here as well.",
    "Hey, ehm... Asleif spirit thing? Hello?",
    "I did what you asked me to! I improved the relations between Rellekka and the mountain camp, and I found a new supply of food!",
    "So do you have any other quests for me, perhaps with some bigger rewards?",
    "How do I do that, exactly? I don't think I'll be able to get him down to this little island.",
    "Hamal, I'm sorry, but your daughter is dead.",
    "Ehm, none really...",
    "Errr... hello?",
    "It's just me, [Fremennik Name/Player], no one special.",
    "How... exactly do I do that?",
    "Time to go, see you later!",
    "You mean a sacrifice? Are you some kind of god?",
    "I seek your advice, oh great one!",
    "I seek the cowardly murderer of a young lady of a nearby clan of mountain people. Do you know where I can find this person?",
    "You look like you escaped from a fairground!",
    "You look like a man in a bearsuit!",
    "I said, you look like a man wearing a bearsuit!",
    "I just said you looked like a man wearing a bearsuit, I didn't know you were! So what are you doing here, pretending to be a god?",
    "And do you leave them alone as well?",
    "Did you kill a young lady, by the lake? Just recently?",
    "Oh, never mind then, that can't be the person I'm looking for. I'll be off.",
    "Can I see that corpse? I'd like to make sure of something.",
    "Yes, she does match the description I was given, it is her after all!",
    "I demand that you hand the body over to me! I must return them to her father!",
    "I humbly request to be given the remains, so I can return them to her father.",
    "I will kill you myself!",
    "Never mind then, I'd better leave.",
    "I think you're completely mad!",
    "Walking around in your silly bearsuit, killing innocent people.",
    "Never mind.",
    "It's me, of whom many legends are sung.",
    "Slumber? You didn't seem to be sleeping.",
    "I found the man who murdered Asleif! He was in a cave just by the pool, but I killed him!",
    "But she's been missing for more than ten years!",
    "Look, here, I even have her corpse!",
    "Er, yeah, right... sure.",
    "Do you know there is a strange bear like thing in a cave near the pool?",
    "Only the cave is hidden behind some trees, you se- What, you mean you know that already?",
    "But he's not a god!",
    "But he killed your daughter!",
    "And why didn't you tell me your daughter's been missing for years?",
    "But but but... He's not a god! He's a man in a bearsuit! And he killed your daughter! And why didn't you tell me she's been missing for more than ten years?",
    "Well... I've only gone and killed him, haven't I?",
    "I also found your daughter. The bearman killed her.",
    "Of course.",
    "Yes, it's true.",
    "I will.",
    "I won't.",
    "I... erm...",
    "Errr...",
    "I will.",
    "So I need to bury her with one of her possessions, and build a cairn on top made out of rocks. So where do I get another one of her possessions?",
    "Uh huh. Well, Hamal asked me to bury her with some of her possessions. But he doesn't have any anymore. Do you have anything that may help?",
    "Thank you. I will make sure she's given a proper burial now.",
    "You've been waiting to give it to her all that time?",
    "You've been waiting to give it to her all that time?",
    "But that's ridiculous! Don't you ever go out and have some fun? What is wrong with you people!",
    "Ahem... errr...",
    "I lost the necklace you gave me."
  ],
  "Hamal the Chieftain": [
    "Greetings, outerlander, I am Hamal. I am the chieftain of this tribe.",
    "Ah, an outerlander with manners. So tell me what you want from us.",
    "We are a solitary group, outerlander, and have little experience or interest in outside contact. It is also our custom not to talk to outerlanders without my sanction. And I see no reason to sanction it for you.",
    "We left Rellekka because we wanted to live closer to nature. We feel that the people of Rellekka have grown complacent and rely too much on their tools rather than their skill. And while they share our view of the sanctity of the runestones, they still employ and actively use magic. Their Seer is an affront to the gods!",
    "What?",
    "Anyway. We do not recognise the council of Rellekka and want nothing more to do with them. We live on rock and stone now, pure and hard. We move on to another part of the mountain slope when the rough land cannot sustain us anymore. That said, we have tarried at this location for too long and should be moving on.",
    "For one thing, this side of the mountain is mostly free from the menace of the trolls and the delvings of the deformed dwarves.",
    "Well, you see... My daughter has gone missing. We have been looking for her and cannot go on without her.",
    "Haha, you have spirit, [Fremennik Name/Player]. But we do not employ outerlanders.",
    "Hmmm. That seems acceptable to me. Very well, I will allow you to look for her. I will instruct my people to let you roam about the area freely, and give limited consent to them to talk to you.",
    "Oh, I'll be waiting here alright.",
    "We do not employ outerlanders.",
    "And we certainly don't let them join us!",
    "Where is she? Tell me, outerlander!",
    "Do not play games with me. I gave you leave to walk about our camp, not to trick us.",
    "We do not hate them, outerlander, but we do not approve of their ways either.",
    "It is true that our beliefs are not all that different, but we have a different way of applying them, a stricter way.",
    "We are not at war with them, outerlander, but we try to ignore each other. But I must admit that I have, in fact, sent out a representative to Rellekka to talk about improving relations and perhaps setting up a basic trade route. My daughter was always asking me to do that, and now that she is not here right now, I thought perhaps it was the right thing to do.",
    "Unfortunately we have not heard from Svidi, our representative, for a few days. I would not be surprised if those ignorants in Rellekka are holding him captive.",
    "Do as you wish, outerlander.",
    "Where did you get that idea from, outerlander?",
    "There is some truth to it, yes. If it were not for my missing daughter, we would have moved on already, and finding food would be easier again for a while.",
    "I would be interested to see how you would manage that, outerlander. But if you insist on trying, go ahead.",
    "What is it, outerlander?",
    "Indeed, outerlander, and how did you accomplish that without giving him our rock?",
    "Worry not, you made a wise decision, and your boldness is impressive. It does not matter, after all, how large the rock is, or what its shape is. And perhaps the two halves of the rock will have extra symbolism now, representing the two halves of the Fremennik culture. I understand that Svidi's meeting with Brundt went quite well. I must thank you for your assistance, outerlander.",
    "Interesting, what is it?",
    "This is a great gift, [Fremennik Name/Player], which I humbly accept.",
    "I told you before not to say such things. What proof of it do you have anyway?",
    "Then do not say it again. I appreciate what you've done for us already, but don't try our patience.",
    "Yes, it is the Kendal.",
    "Of course. We planted the trees there ourselves many years ago. It is unwise to come too close to a god, so we made sure no one would go there anymore.",
    "Fourteen years, to be exact. And I didn't say otherwise, did I? As for the Kendal, what proof have you of these serious accusations?",
    "You have? Then we made an enormous mistake. As did he. Impersonating a god bears the highest penalty imaginable, but I did not think that kind of justice would be delivered by the hand of an outerlander.",
    "So it is true then, after all? Let me see her body please.",
    "Yes, I see it is her. So it is also true that you spoke to her spirit at the pool?",
    "Then she must be buried there, on the island at the center of the pool... to bring peace to her spirit. This is a most unusual situation, but will you bury her, [Fremennik Name/Player]?",
    "Then please listen closely. If she is given a proper burial, she is to be buried with some of her possessions. I see she's still wearing her dress, so you will need one more item. When she has been buried, you must build a cairn on top. It is our tradition to build these cairns in the shape of our longboats that we use when we need to cross the seas. You can use rocks for this purpose, about five or so should be enough. Only then are the burial rites complete.",
    "Asleif had little possessions in life and none that have survived the years. I do not know where you might find such a thing, but perhaps Ragnar does, out by the pool."
  ],
  "Ragnar": [
    "So, you are the outerlander whom Hamal said would look for Asleif.",
    "You don't even know her name!",
    "I am sorry outerlander, I have not spoken with your kind for a long time and I'm not feeling so well. You see, I was set to marry Asleif, the most beautiful woman ever to grace this world.",
    "She used to come here every day, you know, whenever our camp was set up in the vicinity. She would come to sing, her voice reflecting on the mountains and falling into the pool like sparkling silver. Sometimes I think I can hear her singing, but when I follow the sound around the pool I just end up here again.",
    "We were supposed to meet here, at the tree by the pool. I think if I wait long enough maybe she will show up again.",
    "If I knew I wouldn't be standing here, would I?",
    "Do not say such things, outlander! She is not dead, merely missing. She will show up again... yes, yes, I'm sure of it.",
    "Yes, I know... well, that doesn't mean she can't still come back, right?",
    "I do not want to see any of the corpses you're carrying around with you! Begone!",
    "I heard the news from Hamal, outerlander. Alas, I have known this had to be so for a long time, but Hamal just didn't want to listen.",
    "I'm not altogether sure... I do have one thing that may be appropriate. I was going to give her a necklace, when we were supposed to meet here many years ago. I still have it, and since it was a gift for Asleif, technically it's hers. Take it, outerlander, and bury it with her. It will be my parting gift.",
    "Oh yes... she is my only love, you see, and will be so forever.",
    "I do not expect you to understand such things. But perhaps you will find your own love one day, and then you will remember these words.",
    "What is it?",
    "How lucky, then, that I had a spare one for her in case I lost one of them myself. Try not to lose it again now, outerlander."
  ],
  "Chieftain Brundt": [
    "We have not seen one of their people in a great many years, certainly not recently.",
    "That is intriguing news, [Fremennik Name], but we have not seen him yet.",
    "Very unusual, outerlander, but we have not seen him yet.",
    "What? He's not much of a warrior, is he?",
    "I will meet with this man on one condition, [Fremennik Name/outerlander]. When their group split off from Rellekka, they stole one of the ancient relics of the Fremennik. Our ancient rock.",
    "Do?",
    "Amusing, [Fremennik Name], but as a Fremennik yourself you know better than that.",
    "No, no, no. Little do you understand our ways, outerlander.",
    "Amusing, [Fremennik Name], but as a Fremennik yourself you know better than that.",
    "Amusing, [Fremennik Name], but as a Fremennik yourself you know better than that.",
    "Hmm, not especially I think...",
    "The rock was just that, a rock. It had no special properties and was in essence no different from any other rock.",
    "It symbolised our refusal to use the runestones for ourselves, instead relying on our own abilities. The people you speak of took the stone with them when the left for the mountains. They claimed their way of living was more pure and closer to nature.",
    "Maybe, but where's the harm in a bit of feasting from time to time? In any case, before the council and I meet with anyone from their camp, they will have to give our rock back.",
    "Really? Let me see! This rock seems smaller than our bard made it out to be.",
    "You truly have the Fremennik spirit in you, [Fremennik Name]!",
    "You are unusually insightful for an outerlander!",
    "Yes, we are satisfied with sharing the rock. I'll meet with this representative and will inform the council to join us here in the long hall.",
    "Although I see that Manni is already here.",
    "Oh yes, here it is."
  ],
  "Svidi": [
    "Maybe... who is asking? You're an outerlander, aren't you?",
    "I haven't actually been in Rellekka yet...",
    "Well, I'm not actually sure if I should go in there, you see.",
    "I've always been told that the people of Rellekka are ignorants, almost as bad as other outerlanders. I think they might kill me if I go there.",
    "Yes, but you're on your own, they have a whole village. So I don't want to go in there, but I don't want to go back to the camp and tell Hamal that I didn't dare to go to Rellekka either.",
    "I won't go in there unless I know it's safe.",
    "You? But you're an outerlander! You'd probably lead me to a cave to kill me yourself!",
    "Hmmmm... Yes, that will do.",
    "Let me see that, I want to be sure it's authentic.",
    "Hmmm... Okay, this looks valid enough. I'll go and talk to Brundt."
  ],
  "Jokul": [
    "It goes, outerlander... Times are hard here at the moment. We've been here for too long and there is not much food left, or places where I can take my goats.",
    "If only it were so easy! That being said...",
    "I have heard there is a certain kind of fruit... that will grow even here, in the mountains.",
    "It is called the White Pearl, named after its white appearance.",
    "I do not know. I believe it grows mainly in the mountains, and it can grow in even the most difficult circumstances. We cannot move on until we find the chieftain's daughter, and we do not generally move far inland. But perhaps you can search for it."
  ],
  "The Kendal": [
    "Who dares to disturb my slumber?",
    "Have you come, then, to pay your respects?",
    "With your blood, mortal!",
    "Go now, mortal, but I'll be watching you!",
    "I am the guardian of the mountain, the god of the northern lands. I move the earth and control the skies. I am the Kendal!",
    "I am not here to answer questions of such trivial nature! Go now before doom befalls you, mortal!",
    "I would not say such things if I were you, mortal!",
    "What did you say, mortal?",
    "How did you figure that out? How did you know?",
    "Ah, the people that live in the mountains here, they are a superstitious lot. They fear few things, but magic and gods they're scared to death of. So I took on the guise of one of their legends. It's a good way of being left alone.",
    "Ah, you're referring to the skeletons you see here? Yes, I did. Most of the time, at least. When there was no troll to be ambushed, and I had to eat...",
    "Recently? Oh no, the entrance you came through has been blocked off for a good many years now. I've only seen trolls and the occasional stray dwarf since then, until you came along. But yes, more than ten years ago, I did kill someone like that.",
    "She is just over there, in the centre, with the dress. I did not eat her after I killed her, she was too beautiful for that. I felt sorry for killing her, but by then it was already too late.",
    "You demand nothing! You may have uncovered my disguise, but my claws can still tear you apart at will! I will not allow you to leave!",
    "I cannot do that. If they knew I wasn't a god, and if her father knew I killed his daughter, the whole tribe would come in here at once and I'd be finished.",
    "I'm afraid I can't allow you to leave either. You cannot tell anyone about me.",
    "And how is that very much different from you, walking around in silly suits of armour, killing everything that moves?",
    "You are brave, to come into my cave and say a thing like that!",
    "Do not mock me, mortal!"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Mountain_Daughter?oldid=35743433’"
  ]
}