{
  "Guildmaster": [
    "You have not proved yourself worthy to enter here yet.",
    "Greetings bold adventurer. Welcome to the guild of Champions.",
    "Greetings!",
    "This is the Champions' Guild. Only adventurers who have proved themselves worthy by gaining influence from quests are allowed in here.",
    "Aha! Yes! A mighty and perilous quest fit only for the most powerful champions! And, at the end of it, you will earn the right to wear the legendary rune platebody!",
    "You'll have to speak to Oziach, the maker of rune armour. He sets the quests that champions must complete in order to wear it. Oziach lives in a hut, by the cliffs to the west of Edgeville. He can be a little...odd...sometimes, though.",
    "Very well. Return when are ready.[sic]",
    "Greetings!",
    "You're already on a quest for me, if I recall correctly. Have you talked to Oziach yet?",
    "Well, he's the only one who can grant you the right to wear rune platemail. He lives in a hut, by the cliffs west of Edgeville.",
    "Greetings!",
    "Oh? What did he tell you to do?",
    "The dragon of Crandor?",
    "Goodness, he hasn't given you an easy job, has he?",
    "Thirty years ago, Crandor was a thriving community with a great tradition of mages and adventurers. Many Crandorians even earned the right to be part of the Champions' Guild! One of their adventurers went too far, however. He descended into the volcano in the centre of Crandor and woke the dragon Elvarg. He must have fought valiantly against the dragon because they say that, to this day, she has a scar down her side, but the dragon still won the fight. She emerged and laid waste to the whole of Crandor with her fire breath! Some refugees managed to escape in fishing boats. They landed on the coast, north of Rimmington, and set up camp but the dragon followed them and burned the camp to the ground. Out of all of the people of Crandor there were only three survivors: a trio of wizards who used magic to escape. Their names were Thalzar, Lozar and Melzar.",
    "If you're serious about taking on Elvarg, first you'll need to get to Crandor. The island is surrounded by dangerous reefs, so you'll need a ship capable of getting through them and a map to show you the way. When you reach Crandor, you'll also need some kind of protection against the dragon's breath.",
    "Only one map exists that shows the route through the reefs of Crandor. The map was split into three pieces by Melzar, Thalzar and Lozar, the wizards who escaped form the dragon. Each of them took one piece.",
    "Melzar built a castle on the site of the Crandorian refugee camp, north of Rimmington. He's locked himself in there and no one's seen him for years. The inside of his castle is like a maze, and is populated by undead monsters. Maybe, if you could get all the way through the maze, you could find his piece of the map.",
    "Adventurers sometimes go in there to prove themselves, so I can give you this key to Melzar's Maze.",
    "Thalzar was the most paranoid of the three wizards. He hid his map piece and took the secret of its location to his grave. I don't think you'd be able to find out where it is by ordinary means. You'll need to talk to the Oracle on Ice Mountain.",
    "A few weeks ago, I'd have told you to speak to Lozar herself, in her house across the river from Lumbridge. Unfortunately, goblin raiders killed her and stole everything. One of the goblins from the Goblin Village probably has the map piece now.",
    "Even if you find the right route, only a ship made to the old crandorian design would be able to navigate through the reefs to the island. If there's still one in existence, it's probably in Port Sarim. Then, of course, you'll need to find a captain willing to sail to Crandor, and I'm not sure where you'd find one of them!",
    "That part shouldn't be too difficult, actually. I believe the Duke of Lumbridge has a special shield in his armoury that is enchanted against dragon's breath.",
    "Greetings!",
    "Greetings!",
    "Really? That's amazing! You are a true hero. There's no way that Oziach can refuse to sell you rune platemail now. You should tell him at once!"
  ],
  "Player": [
    "What is this place?",
    "Can I have a quest?",
    "So, what is this quest?",
    "On second thoughts, a mighty and perilous quest fit only for the most powerful champions isn't something I want to commit to at the moment. Maybe later.",
    "Can I have a quest?",
    "No, not yet.",
    "Okay, I'll go and talk to him.",
    "Good day to you.",
    "Can you sell me a rune platebody?",
    "The Guildmaster of the Champions' Guild told me.",
    "I thought you were going to give me a quest.",
    "A dragon, that sounds like fun!",
    "But how can I defeat the dragon?",
    "I may be a champion, but I don't think I'm, up to dragon-killing yet.",
    "That's a pity. I'm not a hero.",
    "I am a master detective.",
    "I'm not your friend.",
    "Yes, it's a very nice day.",
    "Good day to you.",
    "Um... no.",
    "I talked to Oziach and he gave me a quest.",
    "Defeat the dragon of Crandor.",
    "Um, yes...",
    "What's so special about this dragon?",
    "How can I find the route to Crandor?",
    "Where is Melzar's map piece?",
    "Where is Thalzar's map piece?",
    "Where is Lozar's map piece?",
    "Where can I find the right ship?",
    "How can I protect myself from the dragon's breath?",
    "Okay, I'll get going!",
    "About my quest to kill the dragon...",
    "Why is everyone so scared of this dragon?",
    "I seek a shield that will protect me from dragonbreath.",
    "I seek a piece of the map to the island of Crandor.",
    "I've heard that one of your number has got hold of part of a map.",
    "Where would he be?",
    "I believe you've got piece of a map that I need.[sic]",
    "I'm not going to do anything for you. Forget it.",
    "I suppose I could pay you for the map piece. Say, 500 coins?",
    "You must be joking! Forget it.",
    "Where did you get the map piece from?",
    "Uh... Hahaha.",
    "What are you in for?",
    "Well, did the stuff belong to you?",
    "Well, that would be why then.",
    "Sorry, thought this was a zoo.",
    "Can you help me get to Crandor Island?",
    "Yes, that's right. I've got to go there and kill the dragon for this quest I'm doing.",
    "Thanks, but I'll be fine!",
    "I'd rather go to Crandor Isle.",
    "Do you know when she will be seaworthy?",
    "Would you take me to Crandor when she's ready?",
    "Yes. Ha ha ha!",
    "No. I want to go to Crandor.",
    "Why is she damaged?",
    "I'd like to buy her.",
    "Yep, sounds good.",
    "I'm not paying that much for a broken boat!",
    "Ah well, never mind.",
    "So, what needs fixing on the ship?",
    "But you said it needed fix-",
    "What are you going to do now you don't have a ship?",
    "Can I board the ship now?",
    "I'm ready to go back on shore.",
    "I'd like to inspect her some more.",
    "Can you sail this ship to Crandor?",
    "Where can I find a captain?",
    "You're a sailor? Could you take me to the island of Crandor?",
    "To the island of Crandor.",
    "Well, I don't actually have a ship yet.",
    "It's the Lady Lumbridge, in Port Sarim.",
    "Yes, good point. I'd better go and fix her up.",
    "I fixed her up!",
    "Uh...yeah...about that. I don't actually have a map on me.",
    "The map's in the bank. I'll have to go and get it.",
    "Here you go.",
    "Will you take me to Crandor now, then?",
    "Uh...yeah...about that. I don't actually have a map on me.",
    "The map's in the bank. I'll have to go and get it.",
    "Here you go.",
    "Yes, let's go!",
    "No, I'm not quite ready yet.",
    "How much longer until we reach Crandor?",
    "Did you see that?",
    "I thought I saw something up above us.",
    "Look! Land ahead!",
    "Don't worry about that. I found a secret passage in the dragon's lair that leads off the island!",
    "I killed the dragon!",
    "Good day to you.",
    "Yes, I have!",
    "I have its head here.",
    "Can I buy a rune platebody now please?",
    "Now you mention it, I found a secret door that led into a cave inside Karamja volcano.",
    "Hey, that's my ship!",
    "It has Lady Lumbridge painted out and 'Klarense's Cruiser' painted over it!"
  ],
  "Oziach": [
    "Aye, 'tis a fair day my friend.",
    "So, how does thee know I 'ave some?",
    "Yes, I suppose he would, wouldn't he? He's always sending you fancy-pants 'heroes' up to bother me. Telling me I'll give them a quest or sommat like that. Well, I'm not going to let just anyone wear my rune platemail. It's only for heroes. So leave me alone.",
    "*Sigh* All right, I'll give ye a quest. I'll let ye wear my rune platemail if ye... Slay the dragon of Crandor!",
    "Hah, yes, you are a typical reckless adventurer, aren't you? Now go kill the dragon and get out of my face.",
    "Go talk to the Guildmaster in the Champions' Guild. He'll help ye out if yer so keen on doing a quest. I'm not going to be handholding any adventurers.",
    "Yes, I can understand that. Yer a coward.",
    "Aye, I ken tell!",
    "Well, however you found out about it, I'm not going to let just anyone wear my rune platemail. It's only for heroes. So leave me alone.",
    "I'm surprised if you're anyone's friend with those kind of manners.",
    "Aye, may the gods walk by yer side. Now leave me alone.",
    "Have ye slayed that dragon yet?",
    "Be off with ye then.",
    "Have ye slayed that dragon yet?",
    "You actually did it? I underestimated ye, adventurer. I apologise. Yer a true hero, and I'd be happy to sell ye rune platebodies."
  ],
  "Duke Horacio": [
    "Greetings. Welcome to my castle.",
    "A knight going on a dragon quest, hmm? What dragon do you intend to slay?",
    "Elvarg? Are you sure?",
    "Well, you're a braver adventurer than I!",
    "Back in my father's day, Crandor was an important city-state. Politically, it was as important as Falador or Varrock and its ships traded with every port. But, one day, when I was little, all contact was lost. The trading ships and the diplomatic envoys just stopped coming. I remember my father being very scared. He posted lookouts on the roof to warn if the dragon was approaching. All the city rulers worried that Elvarg would devastate the whole continent.",
    "That's a relief. I would hate to see such a promising adventurer cut down in [his/her] prime.",
    "If you really think you're up to it then perhaps you are the one who can kill this dragon.",
    "Take care out there. If you kill it... If you kill it, for Saradomin's sake make sure it's really dead!",
    "Very wise. There are some monsters that are best left alone.",
    "I don't have an infinite supply of these shields, you know. I'll only give one for a truly worthy cause.",
    "Greetings. Welcome to my castle.",
    "What, another one? You adventurers do like to stockpile, don't you... any particular dragon in mind?"
  ],
  "The wardrobe is full of scorched and broken objects": [
    "clothes, tools and children's toys. Each is labelled with a scrawled number. You don't see anything of value or use."
  ],
  "The following text is transcluded from Transcript": [
    "Melzar's notes."
  ],
  "...I have nearly perfected the formula": [
    "I can now conjure ghosts that persist for several hours. I am sure I can soon make them permanent..."
  ],
  "...Note to self": [
    "must stop thinking about cabbages..."
  ],
  "Ghost (#1)": [
    "Oh my gods, the dragon is coming back!",
    "Quickly, run!",
    "Children, run quickly!",
    "Aaaah!",
    "WOOOOO!"
  ],
  "Ghost (#2)": [
    "On the horizon! Do you see it?",
    "Put that fire out!",
    "Get the women and children to the boats!",
    "Aaaah!",
    "WOOO woooo wooo WOOOO!"
  ],
  "Ghost (#3)": [
    "Mummy! Where are you?",
    "Mummy, are we safe now?",
    "Eeeek!",
    "EIEEEEE!",
    "WOOOOO!"
  ],
  "Ghost (#4)": [
    "Someone help me! I'm trapped!",
    "I don't want to die like this!",
    "Oh no!",
    "Aaah!",
    "Wooo wooo woooooooo!"
  ],
  "Ghost (#5)": [
    "We're all doomed.",
    "It's hopeless. We're all going to die!",
    "Come on, you monster! Just finish me!",
    "AAARGH!",
    "Woooo!"
  ],
  "Melzar the Mad": [
    "By the power of custard!",
    "Feel the wrath of my feet!",
    "Leave me alone, I need to feed my pet rock.",
    "Let me drink my tea in peace."
  ],
  "Oracle": [
    "The map's behind a door below,but entering is rather tough.This is what you need to know:You must use the following stuff.First, a drink used by a mage.Next, some worm string, changed to sheet.Then, a small crustacean cage.Last, a bowl that's not seen heat."
  ],
  "As you open the chest, you notice an inscription on the lid": [
    "Here I rest the map to my beloved home. To whoever finds it, I beg of you, let it be. I was honour-bound not to destroy the map piece, but I have used all my magical skill to keep it from being recovered. This map leads to the lair of the beast that destroyed my home, devoured my family, and burned to a cinder all that I love. But revenge would not benefit me now, and to disturb this beast is to risk bringing its wrath down upon another land. I cannot stop you from taking this map piece now, but think on this: if you can slay the Dragon of Crandor, you are a greater hero now than my land ever produced. There is no shame in backing out now."
  ],
  "General Bentnoze": [
    "You here about archaeologies?",
    "Aha, that'd be Wormbrain.",
    "Wormbrain he steals too much. He got caught. Now he lives in Port Sarim town jail."
  ],
  "General Wartface": [
    "About our artefact collections?"
  ],
  "Wormbrain": [
    "Whut you want?",
    "So? Why should I be giving it to you? What you do for Wormbrain?",
    "Be dat way then.",
    "Ha! Me in here and you out dere. You not get map piece.",
    "Me not stoopid, it worth at least 10,000 coins!",
    "Fine, you not get map piece.",
    "Fank you very much! Now me can bribe da guards, hehehe.",
    "We rob house of stupid wizard. She very old, not put up much fight at all. Hahaha!",
    "Her house full of pictures of a city on island and old pictures of people. Me not recognise island. Me find map piece. Me not know what it is, but it in locked box so me figure it important. But, by the time me get box open, other goblins gone. Then me not run fast enough and guards catch me. But now you want map piece so must be special! What you do for me to get it?",
    "Me not sure. Me pick some stuff up and take it away.",
    "Umm...no.",
    "Oh, right."
  ],
  "Ahab": [
    "Arrr, matey!",
    "Arrr, matey, ye canna be serious! That be the home of Elvarg the Dragon!",
    "I canna help ye. And right sorry I be to see a fine young [laddie/lassie] like yerself go off to yer doom.",
    "Arrr..."
  ],
  "Captain Tobias/Seaman Thresnor/Seaman Lorris": [
    "Do you want to go on a trip to Karamja?",
    "No I need to stay alive, I have a wife and family to support."
  ],
  "Klarense": [
    "So, are you interested in buying a ship? Now, I'll be straight with you: She's not quite seaworthy right now, but give her a bit of work and she'll be the nippiest ship this side of Port Khazard.",
    "No, not really. Port Sarim's shipbuilders aren't very efficient so it could be quite a while.",
    "Crandor? You're joking, right?",
    "Crandor's not something we sailors joke about. You can't sail from here to Catherby, or Entrana, or Ardougne without going past that accursed island. You can't get to close to it because of the reefs, but you can always see it. Sometimes you can see a dark shape in the sky, circling the island. That's when you have to sail on as quick as you can and pray it's not hungry. Every year, more ships are lost to that dragon.",
    "Then you must be crazy. That island is surrounded by reefs that would rip this ship to shreds. Even if you found a map, you'd need an experienced captain to stand a chance of getting through and, even if I could get to it, there's no way I'm going any closer to that dragon than I have to. They say it can destroy whole ships with one bite.",
    "Oh, there was not particular accident. It's just years of wear and tear. The Lady Lumbridge is an old crandorian fishing ship - the last one of her kind, as far as I know. That kind of ship was always mightily manoeuvrable, but not too tough. She happened to be somewhere else when Crandor was destroyed, and she's had several owners since then. Not all of them have looked after her too well, but once she's patched up, she'll be good as new!",
    "Of course! I'm sure the work needed to do on it wouldn't be too expensive. How does 2,000 gold sound? I'll even throw in my cabin boy, Jenkins, for free! He'll swab the decks and splice the mainsails for you!",
    "Okey dokey, she's all yours!",
    "That fair enough, I suppose.",
    "Hello, captain! Here to inspect your new ship? Just a little work and she'll be seaworthy again.",
    "Hello, captain! Here to take your new ship for a spin?",
    "Well, the big gaping hole in the hold is the problem. You'll need a few wooden planks hammered in with steel nails to fix it.",
    "I dunno, it looks fine to me.",
    "Yes, but that was before you fixed it!",
    "Oh, I'll be fine. I've got work as Port Sarim's first lifeguard!",
    "Sure thing, she's all yours.",
    "Wow! You sure are lucky! Seems the Lady Lumbridge just washed right up into the dock by herself! She's pretty badly damaged, though ...",
    "No, it's not. It may, to the untrained eye, at first appear to be the Lady Lumbridge, but it is definitely not. It's my new ship. It just happens to look slightly similar, is all.",
    "Nope, you're mistaken. It's my new boat."
  ],
  "Cabin Boy Jenkins": [
    "Ahoy! What d'ye think of yer ship then?"
  ],
  "Jenkins": [
    "Aye.",
    "Not me, sir! I'm just an 'umble cabin boy. You'll need a proper cap'n.",
    "The cap'ns round 'ere seem to be a mite scared of Crandor. I ask 'em why and they just say it was afore my time, but there is one cap'n I reckon might 'elp. I 'eard there's a retured 'un who lives in Draynor Village who's so desperate to sail again 'e'd take any job. I can't remember 'is name, but 'e lives in Draynor Village an' makes rope.",
    "Looks like there's a storm coming up, cap'n. Soon we won't be able to see anything!"
  ],
  "Ned": [
    "Why, hello there, [lad/lass]. Me friends call me Ned. I was a man of the sea, but it's past me now. Could I be making or selling you some rope?",
    "Well, I was a sailor. I've not been able to get work at sea these days though. They say I'm too old. Sorry, where was it you said you wanted to go?",
    "Crandor? But... It would be a chance to sail a ship once more. I'd sail anywhere if it was a chance to sail again. Then again, no captain in his right mind would sail to that island... Ah, you only live once! I'll do it!",
    "So, where's your ship?",
    "Ah, well. Let me know when you do. The place to look would be Port Sarim.",
    "That old pile of junk? Last I head, she wasn't seaworthy.",
    "You did? Excellent! Just show me the map and we can get ready to go!",
    "You'd better go find it, then. I'm not going to go sailing off without a map to show me where to head!",
    "You do that then.",
    "Excellent! I'll meet you at the ship, then.",
    "I said I would and old Ned is a man of his word!",
    "Just show me the map and we can get ready to go!",
    "You'd better go find it, then. I'm not going to go sailing off without a map to show me where to head!",
    "You do that then.",
    "Excellent! I'll meet you at the ship, then.",
    "I said I would and old Ned is a man of his word! I'll meet you on board the Lady Lumbridge in Port Sarim.",
    "Ah, it's good to be on board a ship again! No matter how long I live on land, a ship will always seem better. Are you ready to depart?",
    "Well, you go do whatever you need to do. I'll wait here for you until you're ready.",
    "Arr, Jim lad!",
    "Arr, Jenkins lad!",
    "Swab the deck!",
    "Splice the mainsail!",
    "Weigh the anchor!",
    "Shiver me timbers!",
    "Not long now! According to the chart, we'd be able to see Crandor if it wasn't for the clouds on the horizon.",
    "Oh, well. The weather had been so good up until now.",
    "See what?",
    "It's the dragon!",
    "We're going to sink!",
    "We're going to crash!",
    "Now I see why all of the other captains said I'd be mad to go near Crandor. It looks like we're stranded.",
    "Oh, that's good. I'll be able to get back to Draynor somehow. If I can sneak past all the skeletons and demons on this island!",
    "This ship's in a sorry state. You'd better fix up the hole in the hull before we can go anywhere.",
    "Ah, if you're wanting to go to Crandor again, can you find some other way? I think that voyage is cursed!",
    "That's a relief. You can go and use that instead."
  ],
  "Cabin boy Jenkins": [
    "It's Jenkins, cap'n!",
    "Aye aye, cap'n!",
    "Aye aye, cap'n!",
    "It's too heavy, cap'n!",
    "Aye aye, cap'n!"
  ],
  "Captain Ned": [
    "Ah, it's good to feel the salt spray on my face once again! And this is a mighty fine ship. She don't look much, but she handles like a dream."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Dragon_Slayer?oldid=36117412’"
  ]
}