{
  "Brother Tranquillity": [
    "Excuse me...",
    "I'm looking for a bold and true adventurer to help me with a... a... a little problem?",
    "Shhh! That's all part of the problem... and we can't talk here.",
    "Well, all I can say is that I am from a small, cloistered order of monks from a tiny island nearby, and that we have a problem with undead pirates...",
    "Oh, you'll help? Wonderful! Now, I'll just transport us to the island...",
    "Are you all right, my child?",
    "Hmm, that is odd. Have you considered seeing a doctor?",
    "Anyway, I'll just use the teleport spell I created. Let's go!",
    "But... but... aren't you an adventurer?",
    "*Sigh* Oh well. Saradomin be with you.",
    "What was that?",
    "... Well, as I was saying, our island has come under attack from undead pirates...",
    "Excuse me... oh, it's you. Have you thought any more about helping our order?",
    "Our island has been overrun by undead pirates.",
    "Would you like me to transport you to Harmony?",
    "It's true. We need your help... will you at least listen to us?",
    "Oh, but of course. I understand that this is very confusing. We are a cloistered order of Saradominist monks. We use the island's relative isolation to translate and illuminate books. We even have a treaty with the pirates; they leave us alone and we provide the occasional blessing they might need.",
    "This morning, however, we were awakened by the sound of a ship running aground and, as we readied ourselves to venture out to look for survivors, zombie pirates poured into the monastery.",
    "Not that we could tell. They seemed to be being given orders by a twisted little zombie called Mi-Gor and his cadre of sorebones. Some of us, like myself, were dragged away. I remember a terrible pain, and then woke up in this body with Mi-Gor nearby, gloating about having 'enhanced' a zombie with a non-rotting brain.",
    "I laid low, pretending to still be unconscious and, after a while, made my move, freeing the others that had been 'enhanced'. We fought our way to the granary and have barred the doors. We stored our now brainless bodies downstairs in case we can be put back to normal.",
    "It looked like they were going to storm the doors, but then Mi-Gor called them off.",
    "No, none whatsoever. Now that you know our plight, will you help us?",
    "Saradomin be praised! There is a secret tunnel into the monastery under the statue in the garden. If you get inside, you can find out what they are planning and we can counter it.",
    "So, have you found anything out about the pirates' plans?",
    "Well, the secret passage into the monastery is located in the gardens. If you pull the statue out of the way you'll be able to get into the tunnels, and from there into the monastery. We haven't been down there in a while, so you might want to take some gear to rebuild the stairs in case they have collapsed.",
    "So, have you found anything out about the pirates' plans?",
    "Fiendish! We have to prepare our defence against this threat. I recall something that might well help...",
    "No, no. You see, the gas will work on us faster than a normal poison, and a potion would take too long to diffuse through the stomach. No, what I'm thinking of is a prayer written centuries ago by one of the abbots at the Edgeville Monastery.",
    "He developed a prayer to Saradomin for deliverance from pestilences, plagues and other assorted ills, as he was going deep into the Wilderness where the fumes and brimstone would have choked him if he was not protected.",
    "Well, the abbot was slain by a group of raiders. Apparently his faith was little protection against their repeated sword blows.",
    "Anyway, the book of prayers he wrote was stored in the Edgeville Monastery, so you will need to go there and retrieve it. And quickly! Here, I'll take you straight back to Mos Le'Harmless.",
    "Do you have the book?",
    "Oh, well hurry to the Edgeville Monastery and get it. We haven't got a moment to lose!",
    "What use is it there? Go get it and hurry back. We haven't got a moment to lose!",
    "Do you have the book?",
    "When you took the book from the shelf, did you say the words?",
    "The words! The words of power that would prevent... Wait a moment, I forgot to tell you them, didn't I?",
    "Oh dear... In all the excitement I completely forgot about them... I do hope that we can fix things before the locusts arrive... Silly me, all this excitement - and likely that crude brain-operation - made me totally forget. I'm sure it'll all work out somehow.",
    "Oh, don't worry, it'll only be a little swarm. Now, back to business. So have you read the book?",
    "Well, you should give it a try now, just in case there is anything else you need. No point in going all the way to Harmony and then back because you need something else.",
    "Great! Do you have everything you'll need?",
    "Well, hurry! Who knows what depredations are going on back at Harmony!",
    "Excellent! Back to Harmony!",
    "Quickly, the pirates have released the gas! Use the prayer. The other brothers will help make it powerful enough to cover the whole of the granary.",
    "Well done! The power of Saradomin will keep the poison from affecting anyone within these walls.",
    "Well, fun as that would be, I was wondering if you could help us get our brains back into the right bodies.",
    "No. Just... no. While I trust your skills in all other areas, I can state without fear of contradiction when I say that you are not a brain surgeon.",
    "No, what we want you to do is bring Doctor Fenkenstrain to us to do the operation.",
    "In addition to wanting him to come here and help us, we also would like to let the poor soul atone for his sins and for his attempts to meddle in domains into which man was never meant to pry. Basically, I think when you tell him we have a werewolf-free place for him here on the island, I'm sure he'll agree to come.",
    "You have my word that he will not be able to continue his depraved experiments here on this island and will instead be moulded into a useful and faithful follower of Saradomin. Tell him that he is welcome here in exchange for his help. Want me to take you back to Mos Le'Harmless?",
    "What did the doctor say?",
    "Well, when you do, try your best to persuade him to help.",
    "How goes the plan?",
    "Well, I trust you, but this does sound a little...unusual.",
    "Would you like me to take you to Harmony?",
    "The doctor was delivered safely, although it seems like a bunch of pirates have stolen your cats.",
    "Would you like me to take you to Harmony?",
    "Well, the doctor is downstairs, waiting for you. I think he said he needed some things before he could begin.",
    "Want me to take you back to Mos Le'Harmless?",
    "So, when will the doctor be ready?",
    "Oh well, that shouldn't...",
    "Blow the doors off!?!?",
    "But...",
    "Wait! Do you want me to take you back to the island?",
    "So, when will the doctor be ready?",
    "Oh, okay.",
    "I take it that that explosion was the doors?",
    "How bad does it look?",
    "Are you alright? We dragged you back inside as quickly as we could.",
    "So long as you are unharmed, that is the main thing.",
    "Owwwww...",
    "Hurts...",
    "Yeah...wow...spinny room...",
    "W-wait...I have a bad feeling about this...",
    "The pirates m-must have moved something large into the s-secret room to b-block it, and Mi-Gor mentioned he had a bodyguard.",
    "You should be prepared for a f-fierce battle.",
    "Have a word with the others. They will bless you before you leave.",
    "D-do you want me to take you back to the island?",
    "Yes, one of the brothers observed him and a few of his sorebones slipping into the water shortly after there was a loud bang from inside the building.",
    "It is a pity he escaped, but Saradomin's justice will find him in the end.",
    "I cannot, but I do recall hearing it before.",
    "One of the pirates on the island said it while in the grip of a terrible fever. The others quietened him down and refused to answer any questions about it.",
    "I have no doubt that they know who it is, but I get the feeling that they will not tell you.",
    "Certainly! Saradomin blesses you for your valiant effort!",
    "Here is a lamp blessed by Saradomin. If you pray over it, it will grant you wisdom.",
    "Hear what?",
    "Oh, that? Sounds a little like locusts.",
    "You LOST the blessed lamp of Saradomin? The one-of-a-kind relic the likes of which has never been seen in this age?",
    "Well here, take this one and try not to be so careless in future!"
  ],
  "Player": [
    "Yes? Can I help you?",
    "Well you've found one... Say, you don't look much like a pirate. In fact, you look a little ill. A little more than ill, in fact...",
    "This is all starting to sound a little bit dodgy, and I do appreciate I'm in a hive of scum and villainy as I say this. Is there any part of your problem you can tell me?",
    "Undead pirates? Why didn't you say so earlier? Let me at em!",
    "No hitting! No hitting!",
    "Sorry, sorry. I just get this thumping pain in the back of my head whenever I think about travelling to an island full of undead pirates. I have no idea why.",
    "No, but I might well do soon if it keeps up.",
    "Oh, what a pity! Tell me how it all works out.",
    "Yes, but you see today I have to go...",
    "I mean, once I'm done, I'll pop back and help. Possibly.",
    "Well, I can see a bit of a resemblance.",
    "Nothing.",
    "Er, I might have done. What was the problem again?",
    "Yes, please.",
    "Not at the moment, thanks.",
    "Zombies! Back away from those monks now!",
    "What? Seriously? Zombie monks?",
    "Okay, but the first one of you that lunges for my brain will be strung up and beaten until they are dead... or very, very sorry.",
    "Were they particularly drunken-looking?",
    "And what have they done as a result?",
    "Called them off? Any idea why?",
    "Of course!",
    "Could you take me back to port?",
    "No, nothing yet. What would you recommend doing again?",
    "Thanks!",
    "Rabid Jack! That name again...",
    "Sleeping gas! I have to tell the monks about this right now! I only hope I have the time...",
    "The pirates are planning on using some sort of sleeping gas to knock you all out! When everyone is unconscious, they are going to come in and take you away for brain-swaps!",
    "Is it some sort of potion to counteract the poison?",
    "Hmm, how come I've never heard of this prayer?",
    "Ouch!",
    "No, I don't.",
    "Yes, in my bank.",
    "Yes, I have your book here.",
    "Words? What words?",
    "Yes! There were no words! What were they supposed to prevent?",
    "LOCUSTS?",
    "No, not yet.",
    "Yes, I have.",
    "No, I need to go and get a holy symbol.",
    "Yes, I have the book and the holy symbol I need.",
    "So what now? Want me to go and kill the zombies?",
    "You know, that was what I was going to suggest next. So what do you want me to do, scrub up and grab a pair of pliers or something?",
    "Fair enough.",
    "That evil, demented, eye-rollingly insane butcher? What could you want with him and his twisted... ...brain transplanting... ...cutting edge medical practices?",
    "Well, I can't say I agree with this... but I do appreciate that he's likely the only person that knows his way around the inside of someone's skull.",
    "Yes, please.",
    "Not at the moment, thanks.",
    "I haven't been to see him yet.",
    "For all the things you've done, I'd like to put barbecue sauce on your head and pitch you out that window. Instead, I've come to offer you a way out of this castle.",
    "Would you perform multiple brain surgeries on a number of zombie monks?",
    "I think you heard me. A number of monks on an island off the coast of Mos Le'Harmless have had their brains placed in zombie pirate bodies, and vice versa, and they want you to switch them back.",
    "Hands up, everyone who is being hunted by packs of ravenous killer werewolves! Oh, why, that would be you, doctor.",
    "Oh yes, I'm sure that a man that stitches corpses together for a living would be a good judge of rationality.",
    "Yes, I came here to tell you that a group of monks need your services, and that they are willing to shelter you from the werewolves if you will use your medical skills to help them.",
    "Well, you've lived here long enough. Is there some way I can smuggle you past?",
    "How do you mean?",
    "Okay, that seems sensible. I'll be right back.",
    "Hey, Rufus, I heard that you do deliveries of meat. Could you send me a crate of supplies to Mos Le'Harmless?",
    "Er, some meat?",
    "Oh, don't worry about it, I'll be providing the meat myself. It's a treat for some werewolves down there, you see.",
    "Oh sure, that's entirely reasonable.",
    "Oh, I'm sure that I'll be able to find some good meat from somewhere.",
    "What? Err, I mean, what do you mean only a little alive? Of course a good werewolf like me will be sending the food live.",
    "Errr, you know, something... special...",
    "Cats?",
    "But...",
    "Well, at least I got him to agree to ship the crate for me. I suppose in the meantime I'll set the crate up in Fenkenstrain's tower where he can get to it. All I have to do now is get a load of cats from somewhere...",
    "Of course! I'll make some fake cats from wood and fur! With a little help from the Ring of Charos, he'll never know the difference. It's just crazy enough to work...",
    "I'm currently creating a dummy crate filled with fake cats that I will use to trick the werewolves...",
    "And, you know, thats[sic] not the weirdest thing I've ever done...",
    "I have got Rufus to agree to let me ship some meat, but I have to build the crate and fill it with fake cats first.",
    "What? Wait? What sort of person?",
    "I get the feeling I'm being maligned...",
    "Fine. And if you keep up the cat remarks I'm going to make sure the crate is shipped upside down, and not give you any padding.",
    "Don't make me hurt you!",
    "Be quiet or I'm going to post this thing direct to Canifis! What is with this whole cat thing anyway?",
    "That does it, I'm leaving some nails in the bottom of the crate for him to sit on...",
    "Urge to kill... rising!",
    "Okay, Doctor, time to get in the crate. Let's hope this works...",
    "Well yeah, but this was the only place I could think of to store the cats.",
    "That it is!",
    "They must be pining.",
    "Yes. Pining.",
    "See, they made a noise.",
    "Nothing wrong whatsoever.",
    "I think the meowing point has been more than made.",
    "I don't, but I'll promise you this is the last time I do this.",
    "Yeah, Rufus, see you around!",
    "Yes, he's gone.",
    "Bear in mind I can still post you to Canifis if I choose! Gah... let's get this over with...",
    "It teleported... but didn't he say he was allergic... Oh dear, I do hope the doctor's reaction is not too violent.",
    "I was entirely unaware of at least one of those teleports.",
    "Too...much...information! Mind...reeling!",
    "Okay, what do you need?",
    "Brain tongs? Skull staples?",
    "Where do you suggest I get these things, 'Unusual Implements R Us'?",
    "A fair point. I'll pop back through that secret passage and ambush them.",
    "Well then, it looks like I'll go in through the front door.",
    "Okay, that does it. I'll...I'll...",
    "Wait a moment... That ship has cannons, right?",
    "Then I'll storm on board, grab some gunpowder and blow those doors off their hinges!",
    "Oh, this is nothing. All in a day's work for me.",
    "See you later, doctor. Whatever party they are planning in there, I have to go pick up my invitation.",
    "Just as soon as I blow the doors open and get all the things he needs.",
    "Only a little. Nothing to worry about, really.",
    "Be right back!",
    "Not at the moment, thanks.",
    "He'll be ready just as soon as I've killed enough of these sorebones to provide all the equipment he needs.",
    "Yes, sorry about that.",
    "Errr...",
    "Be right back!",
    "Woah...that gas is pretty potent... I'll need to wear my diving gear outside so that I don't get knocked out again.",
    "I have a cranial clamp for you, doctor.",
    "I have a hammer for you, doctor.",
    "I have some brain tongs for you, doctor.",
    "I have some bell jars for you, doctor.",
    "I have some skull staples for you, doctor.",
    "So we can begin immediately?",
    "Certainly. That and I'll be keeping an eye on you to make sure nothing 'untoward' happens to those brains.",
    "I don't want my eyes anymore!",
    "I think I'm going to be sick...",
    "But, but, it fell on the floor!",
    "How are things going, doctor?",
    "I'm sure that glowing review will endear you to them.",
    "How's the...brain?",
    "I guessed. Look, I'm going to head out and kill this Mi-Gor joker before he can get his crew together and sail away.",
    "You going to be okay?",
    "Not at the moment, thanks.",
    "That's pretty big talk for someone who can't even breathe properly!",
    "Hah, I don't care how muscular your bodyguard is. I'll still defeat them!",
    "What...what is that?",
    "Well, you'll not have to worry about Mi-Gor any more. I defeated his creation and he seems to have slipped away.",
    "One thing does strike me as odd. He mentioned the name Rabid Jack, which I have heard in connection to zombie pirates before.",
    "Can you tell me who that is?",
    "Hmm...I'm sure I might be able to get them to say if I persuade them.",
    "Still, that's a job for another time. After all that work, I think I might take a bit of a rest.",
    "Did you hear that?",
    "Er, time for me to be off, I think.",
    "Keep calm. I'm a professional. I'll take care of it.",
    "You wont, trust me!",
    "Sure, although the zombies were drunker, the hostages were less holy and the island was known for exporting swill, not piety.",
    "That's the spirit!",
    "You won't be, trust me!",
    "Then try to stay still!",
    "Just eat a cauliflower or something!",
    "Likely that's all in the mind... Sorry! Sorry!",
    "I'm working on it, okay? Give me a minute.",
    "Hang in there, brother, Player is on the case.",
    "I don't wanna know!",
    "The zombie version of him is a lot more charismatic!",
    "Wow, without a brain, these monks seem a lot less holy all of a sudden...",
    "I think I'll come back when you feel a little better.",
    "I seem to have lost my blessed lamp. Can I have another?",
    "Yes?"
  ],
  "Zombie monk": [
    "Wait! Wait! We ARE monks!",
    "I don't want to be stuck this way!",
    "I can feel my brain thumping about in here when I shake my head.",
    "What if I start craving brains?",
    "I don't even know what one of those is!",
    "This body feels itchy...",
    "I wish I was back in my own body.",
    "This is so awful...",
    "Something fell off! Something fell off!"
  ],
  "Monk": [
    "Honestly, they are with us, and they aren't zombies. Sort of, at any rate.",
    "I knew I should have been a bricklayer...",
    "What if they get in while I'm asleep? Oh no!",
    "Zombies! What ever will we do?",
    "I don't want to lose my brain!",
    "I was almost all the way through translating that book too...",
    "So, have you dealt with this sort of problem before?",
    "Oh, well that's okay then.",
    "I suppose I should view this as a test of faith...",
    "Except the holy texts are light on plagues of zombie pirates."
  ],
  "Narration": [
    "You look through the peephole in the wall into the main body of the monastery and overhear the following conversation:",
    "That voice can't help but make you shudder. It sounds like the speaker is trying to talk through a throat filled with mud.",
    "You peer back through the peep-hole.",
    "You can now craft wooden cats in the workshop of a player-owned house! Note: This need not be your own house.",
    "Rufus pauses and looks around in shock."
  ],
  "Mi-Gor": [
    "*Wheeze* I have received a summons to attend to the Captain and so will be 'down below' for a while.",
    "*Wheeze* How is the gas production progressing?",
    "*Wheeze* What is it? I can smell your lie, whelp.",
    "*Wheeze* Silence! I will not be questioned by underlings! *Wheeze* If you or the others do not consider yourself capable of carrying out Rabid Jack's orders, then perhaps you need to spend some time in 'The Box'!",
    "*Wheeze* Excellent... the gas will leave the brain intact for the next stage. *Wheeze* This time there will be no rebellion amongst the subjects. *Wheeze* Rabid Jack will have his crew of enhanced zombies and I will have as many test subjects as I can vivisect! *Wheeze* Hekhekhekhek!",
    "*Wheeze!* You! I will peel you like a grape for your interference!",
    "*Wheeze!* Filthy little insect! Wretched little vermin! Let us see how witty you feel after my barrel-chested bodyguard has beaten you to paste!",
    "*Wheeze* Hekhekhekhek... 'That' is my bodyguard, the Barrelchest!",
    "*Wheeze* I was going to test his capabilities by letting him wipe out the monks, but I believe a little warm up is in order first.",
    "*Wheeze* Barrelchest - Order: Annihilate that man!",
    "*Wheeze* And now I will take my leave."
  ],
  "Sorebones": [
    "Arr, it be progressin' well...",
    "No, no! 'Tis just that we need more ingredients fer enough te blanket the island! If ye'd just let us storm the granary we'd be able te take them monks out real easy like. Why, that thing of yers could hammer the wall down...",
    "Please, no! Not 'The Box'! The sleeping gas will be ready as planned, Surgeon General. Those monks will be takin' a nap for a week when they get a whiff of it, and the experiments will not stand a chance."
  ],
  "Dr Fenkenstrain": [
    "Are they here yet? I can hear them... howling!",
    "Anything, anything. I will do anything to escape the wolves!",
    "What?",
    "I see... and how long have you been hearing these 'monks' talking to you?",
    "Alright, alright! Whatever you say! I mean, you have to admit that this is a little... unlikely a scenario.",
    "Did you come here to ask me something or just to insult me? And my medical practice was my living. The corpses thing was just a hobby.",
    "Hmm, sounds like an offer I'd have to be really mad to refuse... I accept, but you'll have to get me past those werewolves.",
    "Hmm, their sense of smell is quite acute, so no disguise would work. And I have a slight... reaction... to teleporting. Wait... Rufus might be able to help.",
    "Well, he occasionally delivers meat to clients if they are too far away to come and get it themselves. If I were inside a crate of meat then he'd be unable to smell me and you'd be able to get me past.",
    "So how is the plan progressing?",
    "Cats? He thought you were shipping cats? Well, I don't know... if you were a werewolf, I can see you would strike him as THAT sort of person.",
    "Oh, it's nothing to worry about. Hahahahahahahahahaha! Cats... it all makes sense...",
    "Well, that's a nice crate, but unless you want me to sit under a layer of (heh heh) cats, I think it'll need a false bottom.",
    "Fine. *cough* Catlover *cough*.",
    "Well, it'll be a tight fit, but I'm sure I'll be able to squeeze in. Now all you have to do is go and get your little kitty friends!",
    "Nothing you need to worry about. Hahaha - nothing - hehehehe - at all. Mwuhahahahahahaha! Oh, it's so apt, I can't stop laughing!",
    "Well, you certainly seem to know what you are doing when it comes to rounding up cats. You must get a lot of practice!",
    "Well, regardless, everything seems to be ready for you to call Rufus. Blow the whistle and I'll get in the crate while we wait.",
    "You teleported me! Twice!",
    "I told you I reacted badly to teleportation!",
    "Well, on the plus side, there was plenty of water to clean my clothing with afterwards...",
    "Aside from that, I seem to have arrived in one piece. I apologise for not believing you earlier. Brother Tranquillity has told me the full story and I am prepared to help.",
    "However, I am going to need a few things.",
    "I will need a cranial clamp, a pair of brain tongs, three bell jars and at least thirty skull staples.",
    "Oh, and a hammer.",
    "Well, the zombies holed up in the main monastery must have at least one set of those items; otherwise, how did they perform the operation in the first place?",
    "That won't work. Apparently they have sealed off that passage. The monks heard some explosions and saw the zombies moving something off the ship.",
    "It seems they found the passage as they did a little interior rearranging.",
    "Hah, only if you can walk through wood! They sealed it with planks.",
    "I believe so.",
    "That sounds pretty dangerous.",
    "When you have all the equipment I asked for, come and see me so we can begin the procedure.",
    "Excellent, this will come in handy.",
    "Very nice. Although, a sterilised one would be better.",
    "Wonderful...and they even have easy-grip handles, too.",
    "It's exactly this style of jar that I need, thank you.",
    "Hmmm, size 3 staples. Interesting...",
    "Well, that's all of the items I'll need to get this situation fixed up.",
    "That's right.",
    "Could you please keep notes of what I do, for posterity?",
    "Well, that is your prerogative.",
    "Let us get this operation started. I'll begin by using the...",
    "Pah, you have no stomach for science.",
    "Well, if you are, do it in a bucket. This is a sterile environment, after all.",
    "Only a little, and the sawdust scraped right off with that cheese grater.",
    "Now, why not follow them upstairs while I clean up.",
    "I'm sure as soon as their headaches fade, they will want to talk to you.",
    "I have been talking with some of the monks. They do seem to be rather intelligent for members of the clergy.",
    "The ones with brains, that is."
  ],
  "Rufus": [
    "Well, it's a bit of a way to go, but for you, I'd wrrrite up a shipping orderrr. What do you want to send?",
    "Well, I didn't think you wanted to send shoes, frrriend; this is a meat shop. What I mean is, what KIND of meat do you want to send?",
    "Hmm, I hadn't hearrrd about any packs running with the pirrrates... still, I trust you. Look, I aprrreciate you'rrre wanting to catch the meat yourrrself, I mean that's the sort of wolf I am too, but therrre is one thing. I'll gladly give you a crate for the meat, but I'll have to inspect it beforrre you send it over. I don't want my name associated with anything less than 100% frrresh, you understand.",
    "Grrreat! Here's the parrrts of the crrrate. Sorrrry, but I seem to be out of nails. So, can I get a hint as to what you arrre sending? Rrrabbits? Ducks? Sheep?",
    "Wait, you are sending it live, rrright? I mean it is going to take a while to get therrre, so I'm not going to ship it unless it's at least a little alive.",
    "Ha, ha, ha! Of courrrse, of course! So, what can I expect to see when I inspect this shipment of yourrrs?",
    "It's cats isn't it?",
    "Oh, don't worrrry, you sly dog, I'll not tell anyone. Tell you what, I'll get the shipping order for a crrrate of cats wrrritten up rrright now. You just provide the meat.",
    "No buts, frrriend, you get going. I know how trrricky those things are to grab!",
    "Here, when you need me to inspect the meat, give this a blow and we'll get those tasty kitties of yours shipped off lickety split!",
    "Well, frrriend, I take it you have-",
    "What are you doing herrre of all places? Don't you smell that weedy human, Fenkenstrrrain?",
    "Well, I know I wouldn't want anyone to find out I had a habit like yourrrs, but still... I take it this is the crrrate?",
    "You know, they look verrry still...",
    "Pining?",
    "Seems rrreasonable. Is that why they arrren't making any noise?",
    "You know, I think therrre might be...",
    "...nothing wrrrrong whatsoever!",
    "Herrre is the shipping orderrr. Just paste it to send that crrrate on its way! Although I'd prefer it if you took yourrr cat habit elsewherrre in futurrre. You understand, rrright?",
    "That's good. You should rrreally kick the habit beforrre it gets too late. See you laterrr, frrriend!"
  ],
  "Elfinlocks": [
    "Keep up, cat!"
  ],
  "Clockwork cat": [
    "Click, whirr!"
  ],
  "Box of cats": [
    "Err... meow?",
    "Meow?"
  ],
  "Fenkenstrain in a box": [
    "Has he gone?",
    "I liked the part where he asked you to keep your cat habit to yourself."
  ],
  "Congratulations! You have completed": [
    "'The Great Brain Robbery' - Complete this quest."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:The_Great_Brain_Robbery?oldid=36140579’"
  ]
}