{
  "Player": [
    "Hello.",
    "Earth Sciences?",
    "So, if they don't pass the exams, they can't dig at all?",
    "Interesting...",
    "Can I take an exam?",
    "Why's that then?",
    "But why are you writing the letter? Shouldn't he?",
    "Oh, I see. I'll ask him if he'll approve me, then bring my stamped letter back here. Thanks.",
    "I have been given this letter by an examiner at Varrock Dig Site. Can you stamp this for me?",
    "Okay, I will. Thanks, see you later.",
    "I seem to have lost the letter of recommendation that you stamped for me.",
    "Thanks!",
    "Hello.",
    "Here is the stamped letter you asked for.",
    "The study of gardening, planting and fruiting vegetation.",
    "The study of the earth, its contents and history.",
    "The study of planets and the history of worlds.",
    "The combination of archaeology and vegetarianism.",
    "Magic users, miners and their escorts.",
    "Professors, students and workmen only.",
    "Local residents, contractors and small pink fish.",
    "All that have passed the appropriate Earth Sciences exam.",
    "Heat-resistant clothing to be worn at all times.",
    "Rubber chickens to be worn on the head at all times.",
    "Proper tools must be used.",
    "Protective clothing to be worn; tools kept away from site.",
    "Oh dear...",
    "Oh bother!",
    "Oh well...",
    "Hey! Excellent!",
    "Hello.",
    "Yes, I certainly am.",
    "No, not at the moment.",
    "I'm going to pass the Earth Sciences exams so I can dig at the site north of here.",
    "I'm not quite sure.",
    "Anything else?",
    "Can you tell me more about the tools an archaeologist uses?",
    "What about specimen jars and brushes?",
    "Where can I get any of these things?",
    "Anything else?",
    "Ah, okay, thanks.",
    "Thank you!",
    "I did it! Level 3 Earth Sciences!",
    "Well, I'm not really sure; I guess I should see what I can find around the site.",
    "Hey, something has been dropped here...",
    "Hello!",
    "What do you do here?",
    "Sounds interesting.",
    "I'm not sure.",
    "Can I dig around here?",
    "Appropriate exam level?",
    "Ah yes; I understand.",
    "Hello there. Can you help me with the Earth Sciences exams at all?",
    "What's that?",
    "What does it look like?",
    "Well, that's not too helpful, there are lots of those around here. Can you remember where you last had it?",
    "Okay, I'll have a look for you.",
    "Hello there. How's the study going?",
    "No, sorry, not yet.",
    "Hello there. Is this your animal skull?",
    "Okay, I'll remember that.",
    "Hello there.",
    "I need more help with the exam.",
    "Okay, I'll remember that.",
    "Okay, I'll remember that. Thanks for all your help.",
    "Hello there. Can you help me with the Earth Sciences exams at all?",
    "Your what?",
    "Oh, right. So if I find it, you'll help me?",
    "Any ideas where it may be?",
    "Okay, I'll see what I can do.",
    "Hello there. How's the study going?",
    "No, sorry, not yet.",
    "Hello there.",
    "Look what I found!",
    "Thanks for the information.",
    "Hello there.",
    "There are more exam questions I'm stuck on.",
    "Thanks for the information.",
    "Why not?",
    "So how do I become invited then?",
    "What's that?",
    "Tea?!",
    "Hello, who are you?",
    "Excellent!",
    "Thank you!",
    "Hello there. Can you help me with the Earth Sciences exams at all?",
    "How can I do that?",
    "Do you know where you dropped him?",
    "Leave it to me, I'll find it.",
    "Hello there. How's the study going?",
    "No sorry, not yet.",
    "Hello there.",
    "Guess what I found.",
    "Great, thanks for your advice.",
    "Hello there.",
    "I am stuck on some more exam questions.",
    "Great, thanks for your advice.",
    "Hello.",
    "I am ready for the next exam.",
    "Samples cut and cleaned before transportation.",
    "Samples ground and suspended in an acid solution.",
    "Samples to be given to the melon-collecting monkey.",
    "Samples taken in rough form; kept only in sealed containers.",
    "Finds must not be handled by anyone.",
    "Finds must be carefully handled.",
    "Finds to be given to the site workmen.",
    "Drop them on the floor and jump on them.",
    "Strike rock repeatedly until powdered.",
    "Rock pick must be used flat and with strong force.",
    "Always handle with care; strike the rock cleanly on its cleaving point.",
    "Rock picks are to be used to milk cows on a rainy morning.",
    "Oh no!",
    "Oh well...",
    "Nearly got it.",
    "Great, I'm getting good at this.",
    "I am stuck on a question.",
    "Sorry, I didn't mean to disturb you.",
    "I have lost my trowel.",
    "Hello.",
    "I am ready for the last exam...",
    "Samples may be mixed together safely.",
    "Samples cleaned, and carried only in specimen jars.",
    "Sample types catalogued and carried by hand only.",
    "Samples to be spread thickly with mashed banana.",
    "Brush quickly using a wet brush.",
    "Brush carefully and slowly using short strokes.",
    "Dipped in glue and stuck to a sheep's back.",
    "Brush quickly and with force.",
    "Bones must not be taken from the site.",
    "Feed to hungry dogs.",
    "Bones to be ground and tested for mineral content.",
    "Handle bones very carefully and keep them away from other samples.",
    "Ah... Yes... Erm.... I think I had better go and revise first!",
    "Oh bother!",
    "I'm nearly there...",
    "Hooray!",
    "I can dig wherever I want now!",
    "Hello there.",
    "Err... Yes please!",
    "Oh, well how much?",
    "Err... OK I'll see what I can do, but I'm not sure where I'd get one.",
    "OK, I'll see what I can turn up for you.",
    "Hello there.",
    "I haven't found one yet.",
    "Would an opal look like this by any chance?",
    "Great, thanks for your advice.",
    "Hello there.",
    "I am stuck on some more exam questions.",
    "Great, thanks for your advice.",
    "Hello!",
    "Can I dig around here?",
    "I am already skilled in digging.",
    "I have passed all three Earth Sciences exams!",
    "Ok!",
    "Take a look at this talisman.",
    "Hello. Who are you?",
    "Oh, okay. If I find anything of interest I will bring it here.",
    "I lost the letter you gave me.",
    "It says, 'I give permission for the bearer...to use the mine shafts on site. Signed Terrance Balando, Archaeological Expert, City of Varrock.'",
    "Here, look, I have this letter of permission to use the winches!",
    "Hello there.",
    "Here, have a look at this...",
    "Hey, I think I could fit down here. I need something to help me get all the way down.",
    "Hello.",
    "I have been invited to research here.",
    "Do you know where to find a specimen jar?",
    "I have things to do...",
    "I'm not really sure.",
    "I'm here to get rich, rich, rich!",
    "How do you move a large pile of rocks?",
    "Oh?",
    "It's okay, I already have one.",
    "Err... Sorry.",
    "The lid is shut tight; I'll have to find something to lever it off.",
    "The hammer just bounced off the wood.",
    "Looks like the knife is too bendy; it might snap!",
    "The chisel is too small; it might break!",
    "The spade is far too big to fit.",
    "Great! It's opened it.",
    "The rock pick is too fat to fit in the gap.",
    "I'll need a container to collect some. It looks and smells rather dangerous, so it'll need to be something small and capable of containing dangerous chemicals.",
    "Perhaps not; it might contaminate the samples.",
    "I'm not sure what this stuff is. I had better be VERY careful with it; I had better not drop it either...",
    "Not the best idea I've had; it's likely to spill everywhere in that!",
    "There's something in here, but I don't have room to take it.",
    "Excellent! This looks just right!",
    "Can you tell me any more about this?",
    "Hey, look at this.",
    "See what I have done with the compound now?",
    "I'll find a use for it!",
    "What do you think about this?",
    "Hmm, there's a room past these bricks. If I could move them out of the way then I could find out what's inside. Maybe there's someone else working in these underground areas here who can help...",
    "That was a good idea, but these blocks are huge. I'm going to need something much more powerful to shift these...",
    "That would be like cutting the lawn with nail scissors! It would take a year to chip away these rocks!",
    "Okay, the mixture is all over the bricks. I need some way to ignite this compound.",
    "Now, what am I trying to achieve here?",
    "The brick is covered with the chemical compound I made.",
    "Whoa! This is going to blow! I'd better run!",
    "Wow, that was a big explosion! What's that noise I can hear? Sounds like bones moving or something...",
    "It says: 'Tremble, mortals, for Zaros shall return.'",
    "I found this in a hidden cavern beneath the site.",
    "There is an altar down there. The place is crawling with skeletons!",
    "Thanks!",
    "Um, yes."
  ],
  "Examiner": [
    "Ah, hello there! I am the resident lecturer on antiquities and artefacts. I also set the Earth Sciences exams.",
    "That's right, dear. The world of Gielinor holds many wonders beneath its surface. Students come to me to take exams so that they may join in on the archaeological dig going on just north of here.",
    "That's right! We have to make sure that students know enough to be able to dig safely and not damage the artefacts.",
    "You could gain much with an understanding of the world below.",
    "You can if you get this letter stamped by the Varrock Dig Site manager, Seth Minas, in the main campus building. Don't take it to him at Varrock Museum, though. He likes to keep his work here on site and there at the museum separate.",
    "Because he is a very knowledgeable man and in charge of this site. I'm sure he knows a lot about your exploits and can judge whether you'd make a good archaeologist or not.",
    "He's also a very busy man, so I write the letters and he just stamps them if he approves.",
    "Hello again.",
    "Good, good. We will begin the exam...",
    "Okay, we will start with the first exam: Earth Sciences level 1 - Beginner. Question 1 - Earth Sciences overview. Can you tell me what Earth Sciences is?",
    "Okay, next question... Earth Sciences level 1, question 2 - Eligibility. Can you tell me which people are allowed to use this site?",
    "Okay, next question... Earth Sciences level 1, question 3 - Health and safety. Can you tell me the proper safety points when working on a dig site?",
    "Okay, that covers the level 1 Earth Sciences exam. Let's see how you did...",
    "Deary me! This is appalling, none correct at all! I suggest you go and study properly.",
    "Why don't you use the resources here? There are the researchers, and you could even ask other students who are also studying for these exams.",
    "You got one question correct. Better luck next time.",
    "Do some more research. I'm sure other students could help you out.",
    "You got two questions correct. Not bad, just a little more revision needed.",
    "You got all the questions correct. Well done!",
    "You have now passed the Earth Sciences level 1 general exam. Here is your certificate to prove it. You also get a decent trowel to dig with. Of course, you'll want to get studying for your next exam now!",
    "Hello again. Are you ready for another shot at the exam?",
    "Okay, take your time if you wish.",
    "Hi there!",
    "Okay, this is the next part of the Earth Sciences exam: Earth Sciences level 2 - Intermediate. Question 1 - Sample transportation. Can you tell me how we transport samples?",
    "Okay, next question... Earth Sciences level 2, question 2 - Handling of finds. What is the proper way to handle finds?",
    "Okay, next question... Earth Sciences level 2, question 3 - Rock pick usage. Can you tell me the proper use for a rock pick?",
    "Okay, that covers the level 2 Earth Sciences exam. Let me add up your total...",
    "No, no, no! This will not do. They are all wrong. Start again!",
    "More studying for you my [boy/girl].",
    "You got one question correct. At least it's a start.",
    "Get out and explore the site, talk to people and learn!",
    "You got two questions correct. Not too bad, but you can do better...",
    "You got all the questions correct, well done!",
    "You have now passed the Earth Sciences level 2 intermediate exam. Here is your certificate. You also get a nice rock pick. Of course, you'll want to get studying for your next exam now!",
    "Well, well, have you not been doing any studies? I am not giving you the answers, talk to the other students and remember the answers.",
    "Oh, no problem at all.",
    "Deary me. That was a good one as well. It's a good job I have another. Here you go...",
    "Really? Look in your backpack and make sure first.",
    "Ah, hello again.",
    "Attention, this is the final part of the Earth Sciences exam: Earth Sciences level 3 - Advanced. Question 1 - Sample preparation. Can you tell me how we prepare samples?",
    "Okay, next question... Earth Sciences level 3, question 2 - Specimen brush use. What is the proper way to use a specimen brush?",
    "Okay, next question... Earth Sciences level 3, question 3 - Advanced techniques. Can you describe the technique for handling bones?",
    "Okay, that concludes the level 3 Earth Sciences exam. Let me add up the results...",
    "I cannot believe this! Absolutely none right at all. I doubt you did any research before you took this exam...",
    "You got one question correct. Try harder!",
    "You got two questions correct. A little more study and you will pass it.",
    "You got all the questions correct, well done!",
    "Congratulations! You have now passed the Earth Sciences level 3 exam. Here is your level 3 certificate and a specimen jar and brush.",
    "Perhaps you should use your newfound skills to find an artefact on the site that will impress Terry, our archaeological expert.",
    "Well, what are you doing here? Get digging!",
    "Hello there! My colleague tells me you helped to uncover a hidden altar to the god Zaros. A great scholar and archaeologist indeed! Good health and prosperity to you."
  ],
  "Seth Minas (site manager)": [
    "Hello there.",
    "What have we here? A letter of recommendation indeed... The letter here says your name is Player. Well, Player, you appear to be fit for the task to me, and I like your proactive approach. Run this letter back to an examiner to begin your adventure into the world of Earth Sciences. Enjoy your studies, student!",
    "There you go! Good luck, student. Be sure to come back and show me your certificates. I would like to see how you get on.",
    "Hello there. I see you still have that letter I stamped for you. Why don't you run it back to an examiner at the Exam Centre?",
    "Hello there.",
    "Yes, I saw you drop it as you walked off last time. Here it is.",
    "No I don't want it back thank you, you'll need to take that back to the examiner at Varrock Dig Site."
  ],
  "Researcher": [
    "Hello there. What are you doing here?",
    "A good goal to work towards, and it should prove rewarding for you. So where are you starting your studies?",
    "You could ask the other students. I'm sure I saw a group of them on their way to the site earlier today.",
    "If you need something identified or are not sure about something, give it to Terry, the archaeological expert. He's standing over there outside the exam room.",
    "Of course! Let's see now... Trowels are vital for fine digging work, so you can be careful to not damage or disturb any artefacts. Rock picks are for splitting rocks or scraping away soil.",
    "Those are essential for carefully cleaning and storing smaller samples.",
    "Well, we've come into a bit more funding of late, so there should be a stock of each of them in the Exam Centre's tools cupboard. We also hand out relevant tools as students complete each level of their Earth Sciences exams.",
    "If you need something identified or are not sure about something, give it to Terry. He's the archaeological expert in the next room.",
    "Bravo! Well done, indeed! What are your plans now?",
    "I hear that the third level digs yield the best artefacts for display. Terry, the archaeological expert, has found many good things there that he's excited about."
  ],
  "Digsite Workman": [
    "Why hello there! What can I do you for?",
    "Well, my job involved digging for finds, cleaning them and transporting them for identification.",
    "I find it very interesting and very rewarding. So glad to see you're taking an interest in the digsite. Hope to see you out here digging sometime!",
    "Well, let me know when you are and I'll do my very best to help you!",
    "You can only use a site you have the appropriate exam level for.",
    "Oh yes, you need to have been trained in the various techniques before you can be allowed to dig for artefacts.",
    "Why hello there! What can I do you for?",
    "You can only use a site you have the appropriate exam level for.",
    "Really? What qualifications do you have?",
    "Well done! That means you can dig anywhere on this site, but you'll need to impress the examiner to use the winches.",
    "Good day; what can I do for you?",
    "I give permission... blah de blah... etc. Okay, that's all in order; you may use the mineshaft now. I'll hang onto this scroll, shall I?",
    "Oh wow! You're the archaeologist who found that altar in the mines aren't you!",
    "So glad to meet you! Well done!"
  ],
  "Eduardo (student)": [
    "Well... Maybe I will if you help me with something.",
    "I have lost my recent good find.",
    "Err... Like an animal skull!",
    "It was around here for sure. Maybe one of the workmen picked it up?",
    "Very well, thanks. Have you found my animal skull yet?",
    "Oh well, I am sure it's been picked up. Couldn't you try looking through some pockets?",
    "Oh wow! You've found it! Thank you so much. I'll be glad to tell you what I know about the exam. The study of Earth Sciences is: The study of the earth, its contents and history.",
    "How's it going?",
    "Well, okay, this is what I have learned since I last spoke to you...",
    "The study of Earth Sciences is: The study of the earth, its contents and history.",
    "Correct rock pick usage: Always handle with care; strike the rock cleanly on its cleaving point.",
    "Specimen brush use: Brush carefully and slowly using short strokes."
  ],
  "Dorian (student)": [
    "I can't do anything unless I find my special cup.",
    "My special cup. I won it for a particularly good find last month.",
    "I sure will!",
    "All I remember is that I was working near the panning area when I lost it.",
    "Yeah, maybe the panning guide saw it? I hope I didn't lose it in the water!",
    "I'm getting there. Have you found my special cup yet?",
    "Oh dear, I hope it didn't fall into the river. I might never find it again.",
    "Excellent! I'm so happy. Let me now help you with your exams... The people eligible to use the site are: All that have passed the appropriate Earth Sciences exams.",
    "How's it going?",
    "Hey, I'll tell you what I've learned. That may help.",
    "The people eligible to use the site are: All that have passed the appropriate Earth Sciences exams.",
    "Correct sample transportation: Samples taken in rough form; kept only in sealed containers.",
    "The proper technique for handling bones is: Handle bones carefully and keep them away from other samples."
  ],
  "Panning Guide": [
    "Hey! You can't pan yet!",
    "We do not allow the uninvited to pan here.",
    "I'm not supposed to let people pan here unless they have permission from the authorities first. Mind you, I could let you have a go if you're willing to do me a favour.",
    "Well, to be honest, what I would really like is... a nice cup of tea!",
    "Absolutely, I'm parched! If you could bring me one of those, I would be more than willing to let you pan here. I usually get some form Varrock but I'm busy at the moment.",
    "Ah! Lovely! You can't beat a good cuppa... You're free to pan all you want.",
    "Hello, I am the panning guide. I'm here to teach you how to pan for gold.",
    "Let me explain how panning works. First you need a panning tray. Use the tray in the panning points in the water and then search your tray. If you find any gold, take it to the archaeological expert up in the museum storage facility. He will calculate its value for you."
  ],
  "Katarina (student)": [
    "I can if you help me...",
    "I have lost my teddy bear. He was my lucky mascot.",
    "Well, I was doing a lot of walking that day... Oh yes, that's right - a few of us were studying that funny looking relic in the centre of the campus. Maybe I lost my lucky mascot around there, perhaps in a bush?",
    "Oh, great! Thanks!",
    "Very well thanks. Have you found my lucky mascot yet?",
    "I'm sure it's just outside the site somewhere...",
    "Hey! My lucky mascot! Thanks ever so much. Let me help you with those questions now. The proper health and safety points are: Proper tools must be used.",
    "How's it going?",
    "Okay, I'll tell you my latest notes...",
    "The proper health and safety points are: Proper tools must be used.",
    "Finds handling: Finds must be carefully handled.",
    "Oh, hi again. Did you bring me the opal?",
    "Oh, well, tell me when you do. Remember that they can be found around the site; perhaps try panning the river.",
    "Wow, great, you've found one. This will look beautiful set in my necklace. Thanks for that; now I'll tell you what I know... Sample preparation: Samples cleaned, and carried only in specimen jars.",
    "How's it going?",
    "Okay, I'll tell you my latest notes... Sample preparation: Samples cleaned, and carried only in specimen jars."
  ],
  "Student": [
    "What, you want more help?",
    "Well... it's going to cost you...",
    "I'll tell you what I would like: a precious stone. I don't find many of them. My favorite are opals; they are beautiful. Just like me! Tee hee hee!",
    "Well, I have seen people get them from panning occasionally."
  ],
  "Terry Balando": [
    "Unusual... This object doesn't appear right... Hmmm... I wonder... Let me check my guide... Could it be? Surely not! From the markings on it, it seems to be a ceremonial ornament to a god named... Zaros? I haven't heard much about him before. This is a great discovery; we know very little of the ancient gods that people worshipped. There is some strange writing embossed upon it. It says: 'Zaros will return and wreak his vengeance upon Zamorak the betrayer.' I wonder what it means by that. Some silly superstition, probably. Still, I wonder what this is doing around here. I'll tell you what - seeing how you were the one to find this, I'll allow you to use the private dig shafts. You obviously have a keen eye. Take this letter and give it to one of the winch operators at the north end of the dig, and they will allow you to use them.",
    "Good day to you. My name is Terry Balando, I am an expert archaeologist. I am employed by Varrock Museum to oversee all finds at this site. Anything you find must be reported to me.",
    "Can I help you at all?",
    "No you haven't! You have one in your backpack!",
    "I can't believe it! I go to all the effort of writing you a letter of recommendation and you lose it! Here, I'll write another... Don't lose it again!",
    "Nitroglycerine! This is a dangerous substance. This is normally mixed with other chemicals to produce a potent compound. Be sure not to drop it! That stuff is highly volatile...",
    "Hmm, that looks dangerous. Handle it carefully and don't drop it!",
    "Seriously, I think you have a death wish! What are you going to do with that stuff?",
    "What have you concocted now? Just be careful when playing with chemicals!",
    "Incredible!",
    "Yuck! This is an amazing discovery! All this while we were convinced that no other race had lived here. It seems the followers of Saradomin have tried to cover up the evidence of this Zaros altar. This whole city must have been built over it! Thanks for your help; your sharp eyes have spotted what many have missed. Here, take this gold as your reward.",
    "Ooh! I almost forgot. One of the students discovered an ancient book. Seems right up your street!",
    "Ah, but you don't have room for it. Talk to me again when you do.",
    "Hello again. I am now studying this mysterious altar and its inhabitants. The markings are strange... It refers to a god I have never heard of before named Zaros. It must be from some ancient superstition. That was a great find. Who knows what other secrets lie buried beneath the surface?"
  ],
  "You have unlocked a new music track": [
    "Venture2."
  ],
  "Doug Deeping": [
    "Well, well... I have a visitor. What are you doing here?",
    "Indeed, you must be someone special to be allowed down here.",
    "Hmmm, let me think... Nope, can't help you there, I'm afraid. Try asking at the Exam Centre.",
    "Of course, don't let me keep you.",
    "A miner without a clue - how funny!",
    "Oh, well, don't forget that wealth and riches aren't everything.",
    "There used to be this chap that worked in the other shaft. He was working on an explosive chemical mixture to be used for clearing blocked areas underground. He left in a hurry one day. Apparently, something in the shaft scared him to death, but he didn't say what.",
    "Rumour has it he'd been writing a book on his chemical mixture. I'm not sure what was in it, but he left in such a hurry, he probably left something behind in the other dig shaft. In fact, I still have a chest key he gave me to look after - perhaps it's more useful to you.",
    "Hey! Trying to steal from me, are you? What do you think I am, stupid or something?!"
  ],
  "Congratulations! You have completed": [
    "'The Dig Site' - Complete this Intermediate quest.",
    "'Ultimate Codex' - Claim and read the Codex Ultimatus."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:The_Dig_Site?oldid=35769340’"
  ]
}