{
  "Trufitus": [
    "Greetings, bwana! I am Trufitus Shakaya of the Tai Bwo Wannai village. Welcome to our humble village.",
    "Gracious lady, it means friend.",
    "It means 'friend', gracious sir.",
    "And friends come in peace. I assume that you come in peace?",
    "Well, that is good news, as I may have a proposition for you.",
    "I hoped you would think so. My people are afraid to stay in the village. They have returned to the jungle and I need to commune with the gods to see what fate befalls us. You can help me by collecting some herbs that I need.",
    "When you grow weary of violence and seek a more enlightened path, please pay me a visit as I may have a proposition for you. For now, I must attend to the plight of my people. Please excuse me.",
    "It means 'small clearing in the jungle', but it is now the name of our village.",
    "My people are afraid to stay in the village. They have returned to the jungle. I need to commune with the gods to see what fate befalls us. You may be able to help with this.",
    "I need to make a special brew! A potion that helps me to commune with the gods. For this potion, I need very special herbs, that are only found in the deep jungle. I can only guide you so far, as the herbs are not easy to find. With some luck, you will find each herb in turn and bring it to me. I will then give you details of where to find the next herb. In return for this great favour, I will give you training in Herblore.",
    "Very well, bwana. Perhaps once[sic] day you will return to me, invigorated and ready to take up the challenge.",
    "That is excellent, bwana! The first herb that you need to gather is called 'snake weed'. It grows near vines in an area to the south-west, where the ground turns soft and the water kisses your feet.",
    "Very well, then. May your journeys bring you much joy. Perhaps you will pass this way again, and then take up my proposal? But for now, fare thee well.",
    "Greetings, bwana. Do you have the snake weed?",
    "Please don't try to deceive me. I really need that snake weed if I am to make this potion.",
    "I don't recognise that grimy herb, bwana.",
    "Great! You have the snake weed. Many thanks. The next herb is called 'ardrigal'. It is related to the palm, and grows in its brother's shady profusion. To the north-east you will find a small peninsula. It is just after the cliffs come down to meet the sands. That is where you should search for it.",
    "The first herb that you need to gather is called 'snake weed'. It grows near vines in an area to the south-west, where the ground turns soft and the water kisses your feet. I really need that snake weed if I am to make this potion.",
    "Have you brought the ardrigal herb?",
    "Please don't try to deceive me. I really need that ardrigal if I am to make this potion.",
    "I don't recognise that grimy herb, bwana.",
    "Ardrigal! Wonderful. You are doing well, bwana. Now I want you to find a herb called 'sito foil', and it grows best where the ground has been blackened by the living flame.",
    "The next herb is called 'ardrigal'. It is related to the palm, and grows in its brother's shady profusion. To the north-east you will find a small peninsula. It is just after the cliffs come down to meet the sands. That is where you should search for it.",
    "Hello again, bwana. Have you been successful in getting the sito foil?",
    "Please don't try to deceive me. I really need that ardrigal if I am to make this potion.",
    "I don't recognise that grimy herb, bwana.",
    "Well done, bwana. Just two more herbs to collect. The next herb is called 'volencia moss'. It clings to rocks for its existence, and is difficult to see, so you must search well for it. Volencia moss prefers rocks of high metal content and a frequently disturbed environment. There is some, I believe, to the south east[sic] of this village.",
    "Now I want you to find a herb called 'sito foil', and it grows best where the ground has been blackened by the living flame.",
    "Greetings, bwana. Do you have the volencia moss?",
    "Please don't try to deceive me. I really need that ardrigal if I am to make this potion.",
    "I don't recognise that grimy herb, bwana.",
    "Ah, volencia moss. Beautiful. One final herb and the potion will be complete. This herb is the most difficult to find, as it inhabits the darkness of the underground. It is called 'rogue's purse', and is only to be found in pothole caverns in the northern part of this island. A secret entrance to the pothole caverns is set into the northern cliffs of this land. Take care, bwana, as it may be dangerous.",
    "The next herb is called 'volencia moss'. It clings to rocks for its existence, and is difficult to see, so you must search well for it. Volencia moss prefers rocks of high metal content and a frequently disturbed environment. There is some, I believe, to the south east[sic] of this village.",
    "Welcome back. Have you been successful in getting the rogue's purse, bwana?",
    "Please don't try to deceive me. I really need that ardrigal if I am to make this potion.",
    "I don't recognise that grimy herb, bwana.",
    "Most excellent, bwana! You have returned all the herbs to me. I can finish the preparations for the potion, and at last divine with the gods. Many blessings upon you! I must now prepare. Please excuse me while I make the arrangements.",
    "This herb is the most difficult to find, as it inhabits the darkness of the underground. It is called 'rogue's purse', and is only to be found in pothole caverns in the northern part of this island. A secret entrance to the pothole caverns is set into the northern cliffs of this land. Take care, bwana, as it may be dangerous."
  ],
  "Player": [
    "It's a nice village, but where is everyone?",
    "Me? How can I help?",
    "Hmm, sounds difficult, I don't know if I am ready for the challenge.",
    "It sounds like just the challenge for me. And it would make a nice break from killing things!"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Jungle_Potion?oldid=32465560’"
  ]
}