{
  "Mourner": [
    "Oi! What are you doing? Get away from there!",
    "Can I help you?",
    "I’m guarding the border to West Ardougne. No-one except we mourners can pass through.",
    "The plague of course. We can’t risk cross contamination.",
    "Maybe…",
    "I’m not here to chat.",
    "I protect people like you from the plague.",
    "By making sure no-one crosses the wall.",
    "Then they must be treated immediately.",
    "Any West Ardougnians which cross the wall must be detained and disposed of safely.",
    "Some find it hard, personally I quite enjoy it.",
    "What? I’m pretty sure I haven’t caught the plague yet.",
    "What are you up to?",
    "This is no place for sight-seeing. Don’t you know there’s been a plague outbreak?",
    "Then I suggest you leave as soon as you can.",
    "It’s all down to King Tyras of West Ardougne. Rather than protecting his people he spends his time in the lands to the West. When he returned last he brought the plague with him then left before the problem became serious.",
    "If he did he wouldn’t care. I believe he wants people to suffer, he’s an evil man.",
    "He’s not my king.",
    "The first signs are typical flu symptoms. These tend to be followed by severe nightmares, horrifying hallucinations which drive many to madness.",
    "It gets worse. Next the victim’s blood changes into a thick black tar-like liquid, at this point they’re past help. Their skin is cold to the touch, the victim is now brain dead. Their body however lives on driven by the virus, roaming like a zombie, spreading itself further wherever possible.",
    "Do you have a problem traveller?",
    "No! It's for protection.",
    "The plague of course...",
    "What are you up to with old man Edmond?",
    "What about his daughter?",
    "We know everything that goes on in Ardougne. We have to if we are to contain the plague.",
    "I imagine she’s caught the plague. Either way she won’t be allowed out of West Ardougne, the risk is too great.",
    "Been digging have we?",
    "Your hands are covered in mud.",
    "Funny, you don't look like the gardening type.",
    "What are you up to?",
    "I don't trust you.",
    "If I find you attempting to cross the wall I'll make sure you never return.",
    "Stand back citizen, do not approach me.",
    "Hmmm, how did you get over here? You’re not one of this rabble. Ah well, you’ll have to stay. Can’t risk you going back now.",
    "We’re working for King Lathas of East Ardougne trying to contain the accursed plague sweeping West Ardougne. We also do our best to ease these people’s suffering. We’re nicknamed mourners because we spend a lot of time at plague victim funerals, no-one else is allowed to risk the funerals. It’s a demanding job, and we get little thanks from the people here.",
    "Can’t risk you being a carrier. That protective clothing you have isn’t regulation issue. It won’t meet safety standards.",
    "Ah yes, I’ve heard of her. A missionary I believe. She must be mad coming over here voluntarily. I hear rumors she has probably caught the plague now. Very tragic, a stupid waste of life.",
    "I'd stand away from there. That black cross means that house has been touched by the plague.",
    "Sounds unlikely, even kidnappers wouldn't go in there. Even if someone is in there, they're probably dead by now.",
    "You don't have clearance to go in there.",
    "Well you'd need to apply to the head mourner, or I suppose Bravek the city warder. I wouldn't get your hopes up though.",
    "That's irrelevant. You don't have clearance to go in there.",
    "Well you'd need to apply to the head mourner, or I suppose Bravek the city warder. I wouldn't get your hopes up though.",
    "I'd stand away from there. That black cross means that house has been touched by the plague."
  ],
  "Player": [
    "Hello there.",
    "What are you doing?",
    "Why?",
    "Ok then, see you around.",
    "Just being polite.",
    "Sorry, what is it you do?",
    "How?",
    "What if they do?",
    "Treated?",
    "Sounds like nasty work.",
    "You’re a very sick man!",
    "Hi.",
    "Just sight-seeing.",
    "Yes, I had heard.",
    "Thanks for the advice.",
    "What brought the plague to Ardougne?",
    "Does he know how bad the situation is now?",
    "Isn’t that treason?",
    "What are the symptoms of the plague?",
    "Sounds nasty.",
    "I think I’ve heard enough.",
    "Hello there.",
    "No, I just wondered why you're wearing that outfit... Is it fancy dress?",
    "Protection from what?",
    "Hello old man.",
    "Why, what's wrong?",
    "What's happened to her?",
    "I'm sorry, I have to go.",
    "I will, Goodbye.[sic]",
    "Tell me more about the plague.",
    "Can I help find her?",
    "Where can I find these Dwellberries?",
    "Ok, I'll go and get some.",
    "Well, good luck finding her.",
    "Hello Edmond.",
    "Sorry, I'm afraid not.",
    "Ok, I'll go and get some.",
    "Yes I've got some here.",
    "Hello, Edmond has asked me to help find your daughter.",
    "I'll try to get some.",
    "Yes I've got some here.",
    "Hello Alrena.",
    "Alright I'll go and see him now.",
    "Hi Edmond, I've got the gasmask now.",
    "I still need to pour more buckets of water on the soil.",
    "Hello Alrena.",
    "I just need to soften the soil a little more and then we'll start digging.",
    "I've soaked the soil with water.",
    "Alright I'll check it out.",
    "Alright, thanks I will.",
    "Edmond, I can't get through to West Ardougne! There's an iron grill blocking my way, I can't pull it off alone.",
    "I've tied a rope to the grill over there, will you help me pull it off?",
    "1...",
    "2...",
    "3...",
    "Pull!",
    "Thanks, I will.",
    "Hello.",
    "Not yet, it's a big city over there.",
    "Hello.",
    "Not yet, it's a big city over there.",
    "Hello Alrena:",
    "We’re getting there.",
    "I just need to soften the soil and then we’ll start digging.",
    "Great, thanks Alrena!",
    "Hello again Alrena.",
    "I'm getting there.",
    "Ok, thanks for the warning.",
    "Great, thanks Alrena!",
    "Hello Alrena.",
    "Not yet, but I should be going soon.",
    "Ok, thanks for the warning.",
    "Hello Alrena.",
    "Not yet I'm afraid.",
    "It's alright, I'll get her back soon.",
    "Hello.",
    "Nothing, we’ve just been chatting.",
    "Oh, you know about that then?",
    "Have you seen his daughter recently?",
    "Hello there.",
    "What do you mean?",
    "Oh that...",
    "Oh no, I love gardening! It's my favorite pastime.",
    "Hello.",
    "Nothing.",
    "You don't have to.",
    "So what’s a mourner?",
    "I haven’t got the plague though.",
    "I’m looking for a woman named Elena.",
    "Hello there.",
    "Good day.",
    "Sorry, that’s not what I’m here to do.",
    "Hi there.",
    "Hello, how’s it going?",
    "Yes, living in a plague city must be hard.",
    "I’m sorry to hear that.",
    "I’m looking for a lady called Elena.",
    "Hello, how’s it going?",
    "Have you seen a lady called Elena around here?",
    "You should stand up to them more.",
    "Good day.",
    "Oh ok, bad day then.",
    "Why, what has he done?",
    "I’m looking for a woman called Elena.",
    "Hello there.",
    "Hello.",
    "You seem upset… What’s wrong?",
    "That’s awful, I’m sorry.",
    "Why didn’t you?",
    "Again, I’m sorry. Life can be harsh.",
    "Where did the plague come from?",
    "Have there been many victims of the plague?",
    "It sounds an awful way to live.",
    "I hope things get easier for you.",
    "Hello there.",
    "I’m ok thanks.",
    "You too.",
    "Hi, I'm looking for a woman from East Ardougne called Elena.",
    "Um... brown hair... in her twenties...",
    "Yes, I've got it here.",
    "Yes, I'll return it for you.",
    "No, I don't have time for that.",
    "So who's in charge here?",
    "I'm a friend of Jethick's, I have come to return a book he borrowed.",
    "Hi, I hear a woman called Elena is staying here.",
    "Not yet...",
    "Hello. Your parents say you saw what happened to Elena...",
    "Which building?",
    "No, I'm still looking.",
    "But I think a kidnap victim is in here.",
    "I want to check anyway.",
    "How do I get clearance?",
    "I fear not a mere plague.",
    "How do I get clearance?",
    "I need clearance to enter a plague house. It's in the southeast corner of West Ardougne.",
    "There's a kidnap victim inside!",
    "I've got a gasmask though...",
    "How do I get trained?",
    "I don't have that sort of time.",
    "Yes, I'm utterly crazy.",
    "So what's a mourner?",
    "I haven't got the plague though.",
    "I'm looking for a woman named Elena.",
    "I need permission to enter a plague house.",
    "I'll try asking them then.",
    "I'll try asking them then.",
    "Can I speak to Bravek anyway?",
    "This is urgent though! Someone's been kidnapped and is being held in a plague house!",
    "Who is through that door?",
    "Can I go in?",
    "This is urgent though!",
    "Ok, I'll leave him alone.",
    "Do you know when he will be available?",
    "I'm just looking thanks.",
    "Thanks, I won't take much of his time.",
    "This is really important though!",
    "You shouldn't drink so much then!",
    "I don't think drink is the solution.",
    "Do you know what's in the cure?",
    "Ok, goodbye.",
    "Try this.",
    "I need to rescue a kidnap victim called Elena. She's being held in a plague house, I need permission to enter.",
    "Ok, I'll go speak to them.",
    "Is that all anyone says around here?",
    "Don't you want to take an interest in it at all?",
    "I see why people say you're a weak leader.",
    "This whole city is a plague issue!",
    "Ok, I'll talk to the mourners.",
    "They won't listen to me! They say I'm not properly equipped to go in the house, though I do have a very effective gasmask.",
    "Not a problem, happy to help out.",
    "Hello Alrena.",
    "Not yet I'm afraid, I need to find some Snape grass first, any idea where I'd find some?",
    "Thanks, I'll go take a look.",
    "I also need to get some chocolate powder for a hangover cure for the city warder.",
    "Thanks.",
    "I have a warrant from Bravek to enter here.",
    "I would do but I don't have a key.",
    "Have you caught the plague?",
    "Strange, I was told this house was plague infected.",
    "Ok, I'll look for it.",
    "Hi, you're free to go! Your kidnappers don't seem to be about right now.",
    "Well you can leave via the manhole near the gate.",
    "Do you have any more of those scrolls?",
    "No problem.",
    "No problem.",
    "Yes, she is safe at home now.",
    "Yes, she's safe at home.",
    "Maybe."
  ],
  "Edmond": [
    "Sorry, I can't stop to talk...",
    "I've got to find my daughter. I pray that she is still alive...",
    "Elena's a missionary and a healer. Three weeks ago she managed to cross the Ardougne wall... No-one's allowed to cross the wall in case they spread the plague. But after hearing the screams of suffering she felt she had to help. She said she'd be gone for a few days but we've heard nothing since.",
    "Well if you hear anything about Elena please tell me.",
    "The mourners can tell you more than me. They're the only ones allowed to cross the border. I do know the plague is a horrible way to go... That's why Elena felt she had to go help.",
    "Really, would you? I've been working on a plan to get into West Ardougne, but I'm too old and tired to carry it through. If you're going into West Ardougne you'll need protection from the plague. My wife made a special gasmask for Elena with dwellberries rubbed into it. Dwellberries help repel the virus! We need some more though...",
    "The only place I know of is McGrubor's Wood just north of the Rangers' Guild.",
    "The foresters keep a close eye on it, but there is a back way in.",
    "Have you got the dwellberries yet?",
    "You'll probably find them in McGrubor's Wood it's just west of Seers village.[sic]",
    "The foresters keep a close eye on it, but there is a back way in.",
    "Take them to my wife Alrena, she's inside.",
    "Good stuff, now for the digging. Beneath us are the Ardougne sewers, there you'll find access to West Ardougne. The problem is the soil is rock hard. You'll need to pour on several buckets of water to soften it up. I'll keep an eye out for the mourners.",
    "How's it going?",
    "That's great, it should be soft enough to dig through now.",
    "I think it's the pipe to the south that comes up in West Ardougne.",
    "Once you're in the city look for a man called Jethick, he's an old friend and should help you. Send him my regards, I haven't seen him since before Elena was born.",
    "If you get some rope you could tie to the grill, then we could both pull it at the same time.",
    "Alright, let's get to it...",
    "Whew!",
    "Once you're in the city look for my old friend, Jethick. I expect he'll help you. Send him my regards; I haven't seen him since before Elena was born.",
    "I can't let you enter the city without your gasmask on.",
    "Have you found Elena yet?",
    "Don't forget to look for my friend Jethick. He may be able to help.",
    "Have you found Elena yet?",
    "I hope it's not too late.",
    "Thank you, thank you! Elena beat you back by minutes. Now I said I'd give you a reward. What can I give you as a reward I wonder? Here take this magic scroll, I have little use for it but it may help you.",
    "Ah hello again, and thank you again for rescuing my daughter.",
    "Yes, here you go."
  ],
  "Alrena": [
    "Yes he told me. I've begun making your special gas mask, but I need some dwellberries to finish it.",
    "The best place to look is in McGrubor's Wood to the west of Seers village.[sic]",
    "There we go, all done. While in West Ardougne you must wear this at all times, or you could catch the plague.",
    "I'll make a spare mask. I'll hide it in the wardrobe in case the mourners come in.",
    "Hello darling, I think Edmond had a good idea of how to get into West Ardougne, you should hear his idea.",
    "Hello darling, how's that tunnel coming along?",
    "Hello darling, how’s that tunnel coming along?",
    "Well I’m sure you’re quicker than Edmond.",
    "I’ve almost finished the spare protection mask. Come back later and it should be finished.",
    "I’ll hide it in the wardrobe when it’s ready.",
    "How's the tunnel going?",
    "One of the mourners has been sniffing around asking questions about you and Edmond, you should keep an eye out for him.",
    "I managed to finish the spare set of protective clothing, it's hidden in the wardrobe.",
    "Hi, have you managed to get through to West Ardougne?",
    "Make sure you wear your mask while you're over there! I can't think of a worse way to die.",
    "Hello, any word on Elena?",
    "Is there anything else I can do to help?",
    "That's the spirit, dear.",
    "Hello, any word on Elena?",
    "It’s not common round here, though I hear it's easy to find by the coast south west of Falador.",
    "Well I don’t have any chocolate, but this may help.",
    "Thank you for rescuing my daughter! Elena has told me of your bravery in entering a house that could have been plague infected. I can't thank you enough!"
  ],
  "Recruiter": [
    "Citizens of West Ardougne. Who will join the Royal Army of Ardougne? It is a very noble cause. Fight alongside King Tyras, crusading in the darklands of the west!",
    "Tyras will be informed of these words of treason!"
  ],
  "Man (1)": [
    "Plague bringer!"
  ],
  "Man (2)": [
    "King Tyras is scum!"
  ],
  "Priest": [
    "I wish there was more I could do for these people."
  ],
  "Bravek": [
    "Go away, I'm busy! I'm... Umm... In a meeting!",
    "I suppose they can come in then. If they keep it short.",
    "My head hurts! I'll speak to you another day...",
    "I can't possibly speak to you with my head spinning like this... I went a bit heavy on the drink again last night. Curse my herbalist, she made the best hang over cures. Darn inconvenient of her catching the plague.",
    "Well positions of responsibility are hard, I need something to take my mind off things... Especially with the problems this place has.",
    "Uurgh! My head still hurts too much to think straight. Oh for one of Trudi's hangover cures!",
    "Hmmm let me think... Ouch! Thinking isn't clever. Ah here, she did scribble it down for me.",
    "Uurgh! My head still hurts too much to think straight. Oh for one of Trudi's hangover cures!",
    "Grruurgh!",
    "Ooh that's much better! Thanks, that's the clearest my head has felt in a month.",
    "Ah now, what was it you wanted me to do for you?",
    "Well the mourners deal with that sort of thing...",
    "Well, they know best about plague issues.",
    "Nope, I don't wish to take a deep interest in plagues. That stuff is too scary for me!",
    "Bah, people always criticise their leaders but delegating is the only way to lead. I delegate all plague issues to the mourners.",
    "Hmmm, well I guess they're not taking the issue of a kidnapping seriously enough. They do go a bit far sometimes. I've heard of Elena, she has helped us a lot... Ok, I'll give you this warrant to enter the house.",
    "Thanks again for the hangover cure.",
    "I'm just having a little drop of whisky, then I'll feel really good."
  ],
  "Man/Woman": [
    "An outsider! Can you get me out of this hell hole?",
    "Go away. People from the outside shut us in like animals. I have nothing to say to you.",
    "Life is tough.",
    "Plague? Pah, that’s no excuse for the treatment we’ve received. It’s obvious pretty quickly if someone has the plague. I’m thinking about making a break for it. I’m perfectly healthy, not gonna infect anyone.",
    "Well, aint much either you or me can do about it.",
    "I’ve not heard of her. Old Jethick knows a lot of people, maybe he’ll know where you can find her.",
    "Bah, those mourners… they’re meant to be helping us, but I think they’re doing more harm here than good. They won’t even let me send a letter out to my family.",
    "Yes, I’ve seen her. Very helpful person. Not for the last few days though… I thought maybe she’d gone home.",
    "Oh I’m not one to cause a fuss.",
    "We don’t have good days here anymore. Curse King Tyras.",
    "His army curses our city with this plague then wanders off again, leaving us to clear up the pieces.",
    "Not heard of her."
  ],
  "Child": [
    "I’m not allowed to speak with strangers."
  ],
  "Carla": [
    "Oh, hello.",
    "My son fell ill with the plague…",
    "It would be easier to cope with if I could have spent his last few days with him.",
    "Those mourners came and whisked him away. He didn’t even seem that ill, I thought it was a common cold. But the mourners said he was infected and had to be taken away. Two days later the mourners returned and told me he had died.",
    "It’s down to King Tyras. He and his men brought the plague here from the darklands, and then left us to suffer. One day he’ll pay for what he’s done!",
    "You could say that… I’ve heard reports that half of West Ardougne is infected! Many have lost friends and family…",
    "People are very depressed and scared. I’ve never met anyone fully infected though. I suppose we should be grateful to the mourners for that.",
    "Me too…"
  ],
  "Nurse Sarah": [
    "Hello my dear, how are you feeling?",
    "Well in that case I’d better get back to work. Take care."
  ],
  "Jethick": [
    "Hello I don't recognise you. We don't get many newcomers around here.",
    "East Ardougnian women are easier to find in East Ardougne. Not many would come to West Ardougne to find one. Although the name is familiar, what does she look like?",
    "Hmmm, that doesn't narrow it down a huge amount... I'll need to know more than that, or see a picture?",
    "She came over here to help to aid plague victims. I think she is staying over with the Rehnison family. They live in the small timbered building at the far north side of town. I've not seen her in a while, mind.",
    "You were supposed to be returning a book to them for me.",
    "I don't suppose you could run me a little errand while you're over there? I borrowed this book from them. Can you return it?",
    "Well King Tyras has wandered off into the west kingdom. He doesn't care about the mess he's left here. The city warder Bravek is in charge at the moment... He's not much better."
  ],
  "Note": [
    "After you get in the house, Ted and Martha have the same dialogue"
  ],
  "Ted Rehnison": [
    "Go away. We don't want any.",
    "Oh... Why didn't you say, come in then.",
    "Thanks, I've been missing that."
  ],
  "[Martha Rehnison/Ted Rehnison]": [
    "Yes she was staying here, but slightly over a week ago she was getting ready to go back. However she never managed to leave. My daughter Milli was playing near the west wall when she saw some shadowy figures jump out and grab her. Milli is upstairs if you wish to speak to her.",
    "Any luck finding Elena yet?",
    "I wish you luck, she did a lot for us.",
    "Any luck finding Elena yet?",
    "That's good to hear, she helped us a lot."
  ],
  "Milli Rehnison": [
    "*sniff* Yes I was near the south east corner when I saw Elena walking by. I was about to run to greet her when some men jumped out. They shoved a sack over her head and dragged her into a building.",
    "It was the boarded up building with no windows in the south east corner of West Ardougne.",
    "Have you found Elena yet?",
    "I hope you find her. She was nice.",
    "Have you found Elena yet?",
    "I hope she comes and visits sometime."
  ],
  "Head mourner": [
    "How did you get into West Ardougne? Ah well you'll have to stay, can't risk you spreading the plague outside.",
    "You must be nuts, absolutely not!",
    "Well they're as good as dead then, no point in trying to save them.",
    "It's not regulation. Anyway you're not properly trained to deal with the plague.",
    "It requires a strict 18 months of training.",
    "You're wasting my time, I have a lot of work to do!",
    "We're working for King Lathas of East Ardougne trying to contain the accursed plague sweeping West Ardougne. We also do our best to ease these people's suffering. We're nicknamed mourners because we spend a lot of time at plague victim funerals, no-one else is allowed to risk the funerals. It's a demanding job, and we get little thanks from the people here.",
    "Can't risk you being a carrier. That protective clothing you have isn't regulation issue. It won't meet safety standards.",
    "Ah yes, I've heard of her. A missionary I believe. She must be mad coming over here voluntarily. I hear rumours she has probably caught the plague now. Very tragic, a stupid waste of life."
  ],
  "Clerk": [
    "Hello, welcome to the Civic Office of West Ardougne. How can I help you?",
    "Rather you than me! The mourners normally deal with that stuff, you should speak to them. Their headquarters are right near the city gate.",
    "Well, they do know what they're doing here. If they did start doing something badly Bravek, the city warder, would have the power to override them. I can't see that happening though.",
    "He has asked not to be disturbed.",
    "I'll see what I can do I suppose. Mr Bravek, there's a man here who really needs to speak to you.",
    "The city warder Bravek is in there.",
    "He has asked not to be disturbed.",
    "Oh I don't know, an hour or so maybe.",
    "Bravek will see you now but keep it short!"
  ],
  "Mourner #1": [
    "I'd stand away from there. That black cross means that house has been touched by the plague.",
    "This is highly irregular. Please wait...",
    "Hay...[sic] I got someone here with a warrant from Bravek, what should we do?"
  ],
  "Mourner #2": [
    "Well you can't let them in..."
  ],
  "Elena": [
    "Hey get me out of here please!",
    "I think there may be one around somewhere. I'm sure I heard them stashing it somewhere.",
    "No, I have none of the symptoms.",
    "I suppose that was a cover up by the kidnappers.",
    "Thank you, being kidnapped was so inconvenient. I was on my way back to East Ardougne with some samples, I want to see if I can diagnose a cure for this plague.",
    "Go and see my father, I'll make sure he adequately rewards you. Now I'd better leave while I still can."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Plague_City?oldid=36027614’"
  ]
}