{
  "Vanstrom Klause": [
    "Hello there, how goes it stranger?",
    "Hmm, well, I am a little concerned about some friends of mine. They're in dire need of some assistance, but I'm at a loss as to how I can help them.",
    "It's a personal tragedy that I have yet to meet them in the flesh. But their exploits make mouth watering hero stories...the real meat and drink of high adventure and daring...so they say.",
    "They're regarded as heroes in Morytania, though some people see them as vigilantes. The local villagers call them the 'Myreque'. Some people call them terrorists while others call them freedom fighters!",
    "I should imagine that heroes of such high calibre are almost always in some sort of trouble, wouldn't you? There's always some evil heel ready to grind the face of humanity into the dirt? However, the Myreque are almost certainly able to handle themselves...given the tools! I hear they're short of weapons, I was hoping to do it myself but I find that I'm rather short of time and ability!",
    "I'd have taken some weapons to them!",
    "Steel, I believe. All six of them require steel weapons. I would have suggested a longsword, two swords, a dagger, a mace and a warhammer.",
    "Oh yes? Well, that would be very nice of you! Are you sure you want to help out?",
    "Well, some freedom fighters, called the Myreque, require some weapons. You'd need to get the weapons they require and give them to the freedom fighters.",
    "Well, I'm sure the following will be fine: a longsword, two swords, a dagger, a mace and a warhammer. All the items should be made of steel. You would also have to fund the costs of this yourself and once you've found them, I'll be sure to give you a nice surprise in return for your help.",
    "I believe there's a boatman in Mort'ton who can show you the way. I'm sure if you use your powers of persuasion you can get some information out of him! The Myreque have a lot of sympathisers.",
    "Oh. Well, that is a shame, I'm sorry to hear it. But if you change your mind, please visit me again.",
    "That's great news, my friend, really great news! Perhaps the many peoples of Morytania now have an additional hero that they can come to rely upon?",
    "Oh. Well, that is a shame, I'm sorry to hear it. But if you change your mind, please visit me again.",
    "Hmm, the same as me I fear! Oh well, I'm sure they'll get on well by themselves, the little dears. Thanks for even considering it though.",
    "Hello again, how's the quest going?",
    "Oh dear... what do you need help with?",
    "You know what? I'm not exactly sure. The only thing I've heard, and it is a rumour, but the boatman in Mort'ton might be able to help. But again, it is only a rumour.",
    "Well, I'm sure the following will be fine: a longsword, two swords, a dagger, a mace and a warhammer. All the items should be made of steel.",
    "Actually you know, I don't know them at all! I've never actually met them, but would love to at some point! However, I'm sure that you'll be much more able than I at tracking them down.",
    "Hmm. Apart from the boatman at Mort'ton, I have no clue, my friend!",
    "Well, if you have any problems please feel free to come and chat with me.",
    "You've forgotten already? Ha! That's funny! But I do understand, my memory isn't what it was! It would be great if you could get some steel weapons and take them to the Myreque, the boatman in Mort'ton should be able to help you find them. But you may need to be a bit persuasive!",
    "Ha, ha, ha, you took me straight to them!",
    "Ha, ha, ha... you took me straight to them!",
    "The little dears are going to wonder which side you're on!",
    "The little dears are going to wonder which side you're on!",
    "Quite right...",
    "Quite right...",
    "Sorry, Harold, you too!",
    "Sorry, Harold, you too!",
    "And now I'm going to finish the rest of them off.",
    "And now I'm going to finish the rest of them off.",
    "With my little pet!",
    "With my little pet!",
    "Ha ha ha ha haaaaaa!",
    "Ha ha ha ha haaaaaa!"
  ],
  "Player": [
    "Quite well, thanks for asking. How about you?",
    "What friends are these?",
    "What does that mean exactly? I mean, I have some stories. I'm quite a hero myself, you may actually be talking about me?",
    "Why do they need help? Are they in trouble?",
    "What help do you hope to give them?",
    "What kind of weapons do they need?",
    "Perhaps I could help you out here. Maybe I could take these weapons to the Myreque.",
    "What would I have to do?",
    "What weapons do I need to get?",
    "Where do I need to take the weapons?",
    "Sorry, I can't do it!",
    "Yes, I'll do it!",
    "Sorry, I can't do it!",
    "Ok, thanks.",
    "I wish I could help, but I'm busy at the moment.",
    "Ok, thanks.",
    "Not very well. I need some help.",
    "Where are the Myreque?",
    "What weapons am I supposed to get again?",
    "How do you know the 'Myreque'?",
    "Is there anyone else who can help me?",
    "Ok, thanks.",
    "Ok, thanks.",
    "What am I supposed to do again?",
    "Hello there. I have some weapons for you to give to the 'Myreque'.",
    "Come on, I know you're in cahoots with them; just take these weapons to them.",
    "Can you tell me how to find the Myreque?",
    "Oh come on, you can tell me!",
    "Well, I guess they'll just die without weapons.",
    "What's that supposed to mean?",
    "Resourceful enough to get their own steel weapons?",
    "What have they been up against?",
    "What kind of loss and heartache?",
    "It sounds awful... Who is Sani Piliu?",
    "If you don't tell me, their deaths are on your head!",
    "One man's vigilante is another man's freedom fighter!",
    "Polmafi? Who's he?",
    "Who are the Drakans?",
    "What kind of a man are you to say that you don't care?",
    "But will you help me? Will you take me to them?",
    "I don't have anything which I can use against them at this time.",
    "I have this druid pouch! This turns the Ghasts visible and I can kill them once I can see them.",
    "I also have the three wooden planks you asked for.",
    "Not just yet, sorry.",
    "Why do you say that this place is 'forsaken'?",
    "I'll give you some cash if you tell me.",
    "Er, no, I just want to compensate you for your trouble!",
    "I just want to help them, I think they need help.",
    "Ok, thanks.",
    "Will you still take me to the Myreque?",
    "Can I ask some more questions?",
    "Where do I go after I get to the hollows?",
    "Tell me about the 'Myreque'.",
    "Why are they called 'the Myreque'?",
    "Tell me about the members of the Myreque",
    "Tell me about the Drakans",
    "Tell me about yourself.",
    "Ok, thanks.",
    "I've come to help the Myreque. I've brought weapons.",
    "But I just want to help deliver these weapons.",
    "Sounds fine to me. Go ahead, shoot!",
    "I don't have to answer to you!",
    "No reason.",
    "I'm lost, can you show me the way out?",
    "I have to go.",
    "What's the combination to the door?",
    "Hello there...",
    "I was asked to bring you some weapons. Apparently you need them? Don't worry, I'm a friend!",
    "So are you the leader?",
    "Can you tell me about your organisation?",
    "What can you tell me about Morytania?",
    "Lowerniel? Who's that?",
    "You sound very bitter.",
    "What are your plans for the future?",
    "Ok, thanks.",
    "I wanted to ask some questions first.",
    "Not yet, I'll go do that now.",
    "Greetings! My name is Player. Veliaf said that I should introduce myself to all members of the Myreque.",
    "Would you mind if I ask you a few questions?",
    "What are you doing here?",
    "What can you tell me about the Myreque?",
    "What do you know about Morytania?",
    "Have you heard any rumours?",
    "Ok, thanks.",
    "Fine, thanks. I'd like to ask a few questions if that's alright?",
    "Do you mind if I ask a few questions?",
    "What are you doing here?",
    "What can you tell me about the Myreque?",
    "What do you know about Morytania?",
    "Have you heard any rumours?",
    "Ok, thanks.",
    "Fine, thanks. I'd like to ask a few questions, if that's okay.",
    "Do you mind if I ask a few questions?",
    "What's your job here?",
    "What can you tell me about the Myreque?",
    "What are your plans for the future?",
    "Have you heard any rumours?",
    "Ok, thanks.",
    "Maybe! I'd like to ask a few questions, if that's OK?",
    "I am known as Player; nice to meet you, Sani.",
    "Well, perhaps a little; but it's nice of you to say so in any case. I'd like to ask a few questions if that's alright.",
    "Tell me a bit about yourself.",
    "What can you tell me about the Myreque?",
    "You make it sound easy!",
    "What's going on in Morytania?",
    "Is this your main camp?",
    "Ok, thanks.",
    "Fine thanks, do you mind if I ask a few questions?",
    "Not exactly! I am Player. I'd like to ask a few questions if that's okay.",
    "What's your job here?",
    "What can you tell me about your squad?",
    "Juves? What are they?",
    "What's your grasp of the situation, soldier?",
    "Have you heard any rumours?",
    "Ok, thanks.",
    "Do you mind if I ask a few questions?",
    "Ok, I'll go get them.",
    "Which weapons do you need?",
    "Are you alright?",
    "My commiserations for your loss. I wish that there was something I could do to help.",
    "I'm so sorry for your loss. If there's anything I can do, please let me know.",
    "It was the least I could do! After all, I was the one he followed here, I'm sort of responsible.",
    "Yes, I think I understand now.",
    "I want to join your organisation.",
    "What do you plan to do now?",
    "How do I get out of here?",
    "Let's get revenge on Vanstrom!",
    "Ok, thanks.",
    "Oh, sorry. I thought you were someone else.",
    "I thought you were that dirty murderer, Vanstrom.",
    "I definitely have!",
    "Thanks for your help in finding the Myreque.",
    "Hmm, yeah, I know how you feel."
  ],
  "Cyreg Paddlehorn": [
    "Hello there, friend.",
    "Hmm, well, it doesn't look as if you've got the right sort of weapons to me!",
    "Hmm, I'm sure I don't know what you're talking about.",
    "Ok, seriously, I did some work for them before, it's just too dangerous. I won't take the weapons to them, I'm sorry, it's just too dangerous.",
    "Their base is well hidden, and I'm sorry but I can't reveal the directions. Sorry, but I guess you're all out of luck.",
    "I'm sorry, I can't. I just can't... people are watching... eyes everywhere!",
    "Hmm, you don't seem too concerned about their welfare... I'm glad I didn't tell you where they were. In any case, they're resourceful. They can look after themselves.",
    "They're resourceful folks, that's all I'm saying. Their leader, Veliaf, looks after them well.",
    "Maybe they are... what do you care anyway? They've been up against it ever since they got started. All of 'em have suffered more loss and heartache than you'll ever know. Now, leave me be!",
    "You're not from around here or you wouldn't be asking such foolish questions. Morytania is ruled by a cruel dark overlord by the name of Drakan. His reign over Morytania means we all live in fear.",
    "The worst kind, most have lost members of their family. Little Sani Piliu, she was orphaned overnight when a vampyre went on the rampage... Imagine that, losing your entire family in one night? Terrible!",
    "She's the only female member of the Myreque. She's already proven herself with her agility and light fingers, if you know what I mean!",
    "There's death aplenty in this forsaken place... what do I care that some foolhardy vigilantes decided to go it alone against the Drakans? Stupidity of youth is to blame, I shan't carry it on my shoulders!",
    "Aye, you can see it from both sides I suppose. But many of us consider it fool hardy to fight for something we'll never get, even Polmafi, a scholar, such as he was, agrees that the chances are slim.",
    "Polmafi Ferdygris is one of the Myreque. He's a technical sort and advises on all sorts of things to Veliaf. He was a scholar before he became a renegade.",
    "The Drakans are the family of overlords that rule Morytania. They're the ones to whom the blood tithes are paid. Too much I have told you already! Ignorance is better than these truths, I tell you! I can pretend once more that I am a free man, and some relief from this gloom can I feel again. Be gone with you now and leave me with my dreams.",
    "Don't dare to judge me, young fool... what do you know of the heartache I carry? Can you not see the anchor of woe that holds me fast? Very well, if you would take your chance to help these strangers, who am I to stop you?",
    "No, I won't take you, but you can use my boat. You'll be going through Mort Myre, though, so I won't be letting you go unless you've some defence against the Ghasts.",
    "Very well, but I still cannot let you pass unprepared! My boat needs some work, so I'll need three wooden planks. The bridge you'll need to cross later is rotten and may need to be mended, so you'll need three more planks as well as a hammer, and I'd say around 75 nails.",
    "Thank you, but I still cannot let you pass unprepared. The bridge you'll need to cross later is rotten and may need to be mended. You'll need three more planks as well as a hammer, and I'd say around 75 nails.",
    "All of these lands are forsaken of Saradomin's kindness, only cold death from the evil gods do we now feel. Those lucky ones to the west of the Salve little realise their fate if the river should one day become tainted.",
    "You think you can buy me!",
    "You keep your money and I'll keep my secrets.",
    "Aye, well, they may do... but it's just not safe and it's not likely to get safer any time soon. Though I do feel sorry for Ivan, the baby of the group. He's seen too few winters to be involved in such toil.",
    "I cannot let you pass unprepared. You have the hammer for the bridge, but you'll still need 3 wooden planks and I'd say around 75 nails.",
    "I cannot let you pass unprepared. You have the hammer and nails for the bridge, but you'll still need 3 wooden planks.",
    "I cannot let you pass unprepared. You have the planks and hammer for the bridge, but you'll still need around 75 nails.",
    "Sure you can.",
    "You should head north and look for an unusual tree. You look like you know a thing or two about exploring so I guess I don't need to tell you to keep your eyes peeled!",
    "What do you want to know?",
    "The locals just called them after the place where they hide out, in Mort Myre. They are Myreque, 'hidden in the myre'.",
    "Well, you have Radigad Ponfit... he's your average mercenary from Asgarnia, ready to slice anyone's head off for a price. He's got a personal score to settle with the Drakans, though no one knows what it is. Then there's Veliaf, he's the leader. and then there's Ivan, he's the baby of the group. There's Sani Piliu, she's a lovely girl, though a bit shady if you know what I mean. You've also got Harold Evans, he's a bit hot-headed, always straight into the fray. And the brains of the operation, reporting directly to Veliaf, is Polmafi Ferdygris; he used to be quite a clever scholar!",
    "Well it's rumoured that they're controlling the whole of Morytania. They live in the Sanguinesti region, but I've never been, like most villagers in Morytania, I'm afraid to leave the village and dread what lies beyond.",
    "I'm just a humble boatman, Cyreg Paddlehorn is my name. Like most of the Paddlehorns before me, I make my living by tacking the swamps of Mort Myre.",
    "Hey, hands off my boat!",
    "Well, I'd like to say that you're welcome. But I heard that you led Vanstrom straight to their hideout and he killed Sani and Harold. I feel so guilty."
  ],
  "Curpile Fyod": [
    "Hey, what're you doin' here?",
    "It doesn't look as if you have the right weapons to me. Get out of here, you fake.",
    "Okay, I see ya got da weapons, but how'd I know you're not gonna use 'em against my friends?",
    "Well, dat's as maybe, and I'm not doubting your sincerity here, you seems all sincered up to me. It's choking me up right here, you're making me cry, but hey, I's godda do my job or da kids don't get fed! Okay, so say I asks you a few questions and you were to answer them all correct and so on; well, that'd make me believe yous. I'd get to feeling that you was the real deal an' all. How's dat sound?",
    "Hey...don't tempt me! You's dicing wiv death here, my friend.",
    "You do if you know what's good for you!",
    "Come on... speak up! I may be able to help you. However, you's gotta know that you's trespassing and that, by rights, I should slap you around a bit. You know: just like as a warning.",
    "You got yourself in here, now get yourself out. And quickly, if I were you.",
    "Sure... be on your way, stranger.",
    "Okay, first question. [question]",
    "Okay, interesting answer. First question answered.",
    "Okay, second question. [question]",
    "An interesting response. Second question answered.",
    "Okay, third and final question. [question]",
    "Hmm, a calculated retort. Third question answered.",
    "Name the only female member of the Myreque.",
    "What family is rumoured to rule Morytania?",
    "What is the boatman's name?",
    "Which member of the Myreque was originally a scholar?",
    "Who is the leader of the Myreque?",
    "Who is the youngest member of the Myreque?",
    "I'm sorry, but you got them all wrong! Go on, get outta here.",
    "I'm sorry, but you only got one question correct! Go on, get outta here.",
    "I'm sorry, but you only got 2 questions correct! Go on, get outta here.",
    "Okay, I believes ya, you can go on.",
    "Oh, there isn't one. I'll unlock it for you.",
    "Hey, leave me be. I'm guardin' this place."
  ],
  "Ivan Strom": [
    "Oh--er... hello... greetings that is... sorry... you need to speak to Veliaf first. I'm not sure if I'm supposed to be talking to you.",
    "Veliaf says it's okay for me to talk to you. My name is Ivan, nice to meet you.",
    "Yeah, I suppose so, but I don't know how much I can help.",
    "I'm not sure really. I should really be at the temple to Saradomin, but Veliaf says that the trip's too dangerous. I am a trainee cleric of Saradomin. I hope one day to serve him as faithfully as all his priests.",
    "Well, they're certainly brave and they're prepared to put up a fight against the evil of the Drakan clan. I'm proud to be associated with them, but with my poor skills I worry that I will let them down.",
    "It's a lost land ruled by the evil Drakans. People cling to each other in fear every week when the blood tithes are to be paid. With Saradomin's help we'll bring light back to this dark land.",
    "I'm sorry my friend, but I spend most of my free time in prayer to Saradomin. I prefer to cleanse my soul in case he should wish that I serve him closer.",
    "Oh, hello again. How are you?",
    "Oh, thank Saradomin you managed to kill that awful beast! It was so horrible seeing Sani and Harold killed right in front of my own eyes!",
    "I think you've done enough already, bringing that monster Vanstrom here."
  ],
  "Polmafi Ferdygris": [
    "Good day. You should quickly introduce yourself to Veliaf - after that I'll be happy to have a chat with you.",
    "Good! Now that you've introduced yourself to Veliaf and observed proper protocol, I'll be happy to chat with you. Now, please tell me... what can I do for you?",
    "Not at all, I'm sure I'll be able to help; and if I can't, I'll tell you so.",
    "I am the key advisor to Veliaf. He seeks my council on many issues before we engage the enemy. Not that we would be doing that any time soon... the situation is somewhat difficult and terrifying at the moment. However, we must always remember, 'All that is required for evil to survive is for good people to do nothing.'",
    "Well, we have a hierarchical chain of command. Veliaf reports to Calsidiu who is considered the head of the armed resistance against the Drakans. I've also heard people talking about a spiritual man who inspires many people to join the resistance. He's said to be very influential with supposed contacts within the Drakan clan.",
    "It has a rugged landscape, situated to the east of the River Salve. Primary occupants seem to be human in appearance, but are in fact large vampyric predators. They maintain a stock of human villages in the same way that humans keep cattle. Weekly blood tithes are paid to the Vampyric overlord Drakan in return for moderate safety.",
    "Yes, I hear them all the time, but they're usually neither correct nor even all that interesting. I suspect that we will be looking to make a strike against the human sympathisers some time soon.",
    "Warmest salutations of the day, my friend! How are you?",
    "Not at all, I'm sure I'll be able to help; and if I can't, I'll tell you so.",
    "I'm so sad since Sani and Harold were killed. The Myreque will be lonelier without them. Still, at least they didn't suffer.",
    "Don't worry. No one blames you. Anyone could have been tricked by Vanstrom. Whilst I mourn the loss of my comrades, it serves no useful purpose to blame anyone for it."
  ],
  "Radigad Ponfit": [
    "Greetings, friend! Once you've introduced yourself to Veliaf please feel free to chat with me...",
    "Ah, it's Player. I see you've introduced yourself to Veliaf, good! Now, how can I be of service to you?",
    "Sure, go ahead. I'll answer as best I can.",
    "I'm a bit of an all-rounder and help Veliaf where I can. I've relied on his sword arm many a time, and I like to think that he can rely on mine.",
    "We're just developing the resistance against the Drakans and the rest of the Vampyric entourage. We're seriously outnumbered. Veliaf doesn't like to hear us saying 'hopeless' but that's our situation at the minute.",
    "I'm not really sure. I guess Veliaf might know that, however I hope that more people will join the ranks and take the fight to the dead hearts of our vampyric foe so that we might one day reclaim our right to exist.",
    "I have. Something you might find interesting is that our enigmatic leader 'Safalaan' has connections inside the Drakan Clan. I'm not sure how true that is but it would be great!",
    "Hello again! Radigad at your service. Are you planning to join the fray against the Morytanian monsters and the rest of the Drakans?",
    "Yeah, I'm fine, thanks. You certainly proved yourself against that unearthly monster that Vanstrom conjured. I'm sorry I can't be more upbeat, but I'm very sad about Harold and Sani. It's terrible to see your comrades cut down in combat, especially those two. They were still so very young."
  ],
  "Sani Piliu": [
    "Hi there... you're new here, aren't you? You'd best go and talk with Veliaf. But afterwards, I'd love to introduce myself properly.",
    "Hello... very nice to meet you! My name is Sani Piliu, what's yours?",
    "The pleasure's all mine! Excuse me for being forward, but you somehow seem different to other people, somehow more determined. I sense a powerful aura... sorry, that must seem really strange?",
    "Sure, go ahead, I'll answer as best I can.",
    "There's not much to tell, really. I was about nine years old when my family was ripped to pieces by a vampyre attack. One day a happy member of a loving family, the next day an orphan living a hand to mouth existence. Somehow I managed to get by, eking out a living wherever I could. People took pity on me, I earned food by helping people out. Before too long I was quite adept at helping myself, other people appreciated my skills. I bumped into Veliaf in Canifis. He saw that I would be an asset to the resistance so I joined. I want to fight back against those killers who took my family. One day I may even escape to the west across the Salve! Who knows?",
    "As far as I know, Veliaf is one of two Lieutenants who report to another soldier called Calsidiu. While we don't advertise the fact, there are quite a lot of people in Morytania who want to put up a fight. Our current operations are merely trying to find a weakness in the Drakans' hierarchy and perhaps get a spy in there. We need to find out how to kill them before we then take the war to them.",
    "With determination you can achieve great things. However, Veliaf always tells us not to underestimate the enemy. After those juvenile vampyres discovered us in the forest, it's a mistake I won't be making again.",
    "Lowernial Drakan and his siblings collect blood tithes from the locals as a way of controlling the population and keeping their brood happy. Sanguinesti and Castle Drakan hold sway over all the inhabitants of Morytania. We're nothing more than an ill-organised rabble, but we're determined to fight against these evil monsters. We won't just offer our family members to the Drakans for a weekly snack, we're going to fight back!",
    "It's our only camp! At least, I don't know of any others.",
    "Oh hello Player, nice to see you again! How's things?",
    "It's Vanstrom! We're dead!",
    "It's Vanstrom! We're dead!"
  ],
  "Harold Evans": [
    "Hail and well met, friend! You'd better go and introduce yourself to Veliaf. But after come and have a chat if you've a mind to.",
    "Well met, friend! My name's Harold... nice to meet a fellow soldier. Just joined us have you?",
    "Sure, go ahead. I'll answer as best I can.",
    "I generally do what Veliaf orders. Taking a bridge, defending a tactical retreat... you name it, I'm usually in the thick of it. It's funny, I seem to cheat death most of the time.",
    "They're all good soldiers, though they're pretty much a bunch of irregulars. I consider them a good squad, ready to leap into the fray if needed, but we're seriously outnumbered by the Drakans and their brood. Most fights we have to improvise but this bunch are very good at that. That young lad over there, Ivan Strom, he saved our bacon in the last encounter by his faith in Saradomin... he weakened the Juves and we ran for it!",
    "It's short for 'juvenile', that's the stage that those vampyres were at in the forest. They've only recently become vampyric and they're pretty inexperienced. However, they're stronger and faster than many well trained militia men, and twice as bloodthirsty.",
    "The situation is grave, it would be dangerous to think differently. We're really up against it here, but we have no choice: this is a battle for our right to exist and we need to employ any tactics to achieve our goal.",
    "Yes, I hear them all the time. Thankfully, I don't pay any attention to them.",
    "Well met, Player! Here's to your strong sword arm!"
  ],
  "Veliaf Hurtz": [
    "Hello there... how did you get in here? Who are you?",
    "Hmm, well, it's true we could do with some supplies. It's very good of you to bring them to us. I'm sorry but I'm a bit busy at the moment; please introduce yourself to the others, then we can talk about those weapons.",
    "Well, as much as anyone is, it's not official or anything. I guess the others just look up to me or something. I feel a certain responsibility for them so I guess that means I'm a leader of sorts.",
    "Huh, organisation? That's rich! We're really not that organised, however, the Myreque are dedicated to mounting a resistance against the Drakans and the evil that they've brought to Morytania.",
    "I can tell you that it used to be a beautiful country before Lowerniel and his quarelling siblings arrived.",
    "Lowerniel Vergidiyad Drakan - he's the head of the Drakan family and along with his brother Ranis and his sister Vanescula they play out their petty backstabbing games using the peoples of Morytania as their pawns.",
    "So would you, if you lost everyone dear to you at the hands of such monsters.",
    "At the moment we're maintaining a low profile after we were spotted scouting out the Drakans' castle. The forest where we camped is infested with vampyres, and even though they're only juveniles in terms of experience, we only just managed to survive. After we've regrouped, we will try to recruit more people to our cause. At the minute we're hopelessly outnumbered.",
    "Have you introduced yourself to the rest of the gang?",
    "Well, ok, but only briefly, I have things to do.",
    "OK, great.",
    "Hello again... so, you've introduced yourself to the team, have you? Good. Now, let's have a look at those weapons you brought us.",
    "Well, you don't seem to have what we need in your inventory. We really need specific weapons, we each have our own specialisms. If you're wielding one of the weapons which you want us to have, probably best to un-equip it and then come and have a chat.",
    "Ok, I'd appreciate that.",
    "Here, I've compiled a list.",
    "Mind you, I've only checked your main inventory. If you're wielding one of those weapons, I won't take that into account.",
    "Hey, what's that mist coming in through the door? WE'VE A VAMPYRE IN THE ROOM!",
    "That murderer Vanstrom has killed Sani and Harold! He came in and killed them right in front of our eyes. And that beast he summoned probably would have killed the rest of us if it wasn't for you!",
    "That is for your conscience to bear, but now perhaps you can understand why we fight for our freedom?",
    "Hmm, well, thanks for your support. But I'll need to talk to my superior first.",
    "Well, I guess Vanstrom will expect that we're dead. He's so arrogant that he doesn't really consider us a threat. I can understand that; if I was that powerful I would probably feel the same. I guess we'll regroup and then try to recruit more people. We first need to know how we can fight against these monsters, then we'll take the war to them!",
    "If you go back into the main corridor which leads into this room, it goes down towards the basement of an inn. If you search the wall, you'll find that it is in fact moveable. You should be able to get into the room, take the ladder to come out to the south of the 'Hair of the Dog Tavern' in Canifis. While you're there, you could see if that murderer Vanstrom is still hanging around.",
    "Yes, of course, we'll certainly get our revenge on him and his superiors! Then they'll taste the bitter sorrow that we've had to endure so long!"
  ],
  "Stranger": [
    "Hello, friend. What can I do for you?",
    "Who did you think I was?",
    "Whoa! It sounds like you've got a score to settle.",
    "I think we've been through this before, haven't we?"
  ],
  "Congratulations! You have completed": [
    "'In Search of the Myreque' - Complete this Intermediate quest."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:In_Search_of_the_Myreque?oldid=35456114’"
  ]
}