{
  "Player": [
    "Hi there.",
    "What's this big hole in the ground all about?",
    "So why is it important to you?",
    "What situation? Maybe I can help.",
    "Your son Tolna? I don't know, what does he look like?",
    "You don't know what your own son looks like?",
    "Would you like me to go down to look for your husband and son?",
    "Don't worry. I'll investigate.",
    "No problem.",
    "Surely by now they'd both be dead?",
    "Oops.",
    "Hi.",
    "Sorry, what am I supposed to do again?",
    "Ah, I'm on my way!",
    "Wow! How did I do that? There is something truly mental about this place!",
    "Hi, I've been down into the rift and I found a strange room. I also heard a voice claiming to be Tolna.",
    "He said, 'Why should I, Tolna, be trapped in such a wretched place? Feel my ANGER!'.",
    "It's a very aggressive room. I think I need to defeat the monsters in there.",
    "I managed to defeat the monsters in the room!",
    "Sorry, I've yet to enter the next room.",
    "Hmmm, no light sources. So why can I still see down here? This can't just be a simple dungeon.",
    "This door's darker than the rest. There is no WAY I'm going in there.",
    "I don't like looking in these holes but I must!",
    "I don't feel quite so afraid now.",
    "These holes aren't that spooky.",
    "This isn't so scary after all!",
    "Phew, I don't feel so scared now. This feels like the figment of someone's imagination!",
    "Hi. I've made my way into a second room. I heard your son's voice again as well.",
    "'It's so quiet and dark. I FEAR I may never escape this horrid place. Mum, help me!'",
    "I've overcome fear in the second room and an exit has been illuminated.",
    "Erm, I haven't actually ventured through yet.",
    "Aha! The exit is now clear! This Tolna's mind really is a mess.",
    "Hi, I've journeyed through to a third room. Your son's voice spoke as I entered.",
    "Simply, 'Where am I? How long have I been here? Am I still the person I once was? I hate my CONFUSION'.",
    "Hi. I have prevailed over a third room.",
    "I think I may be getting closer.",
    "Is there any end to killing these monsters?",
    "This is hard work!",
    "I've almost killed them all now.",
    "Maybe if I kill one more?",
    "A bridge of hope! Tolna should feel that help is at hand by now!",
    "I have travelled through to a fourth room. As I entered your son's voice spoke to me!",
    "He said, 'What's the pint? Why do I defy such HOPELESSNESS? No-one will ever help me'.",
    "Can I succeed?",
    "I have endured against hopelessness to finish the fourth room.",
    "Only his voice. So far he has said to me, 'Why should I, Tolna, be trapped in such a wretched place? Feel my ANGER!', 'It's so quiet and dark. I FEAR I may never escape this horrid place. Mum, help me!', 'Where am I? How long have I been here? Am I still the person I once was? I hate my CONFUSION' and 'What's the point? Why do I defy such HOPELESSNESS? No-one will ever help me'.",
    "Don't worry, I will find him!",
    "Your father isn't lying.",
    "Are you ok?",
    "But how can I help?",
    "That's correct.",
    "I will try.",
    "I think I've saved your son.",
    "I've found your son.",
    "And your husband, but I'm afraid your son is no longer physically what he once was.",
    "I will try.",
    "I have returned your son to his normal state!",
    "Er, no, sorry. I just came back here to tell you.",
    "Tolna?",
    "You've been trapped down here for years, I've come to rescue you on behalf of your parents.",
    "She's up at the surface waiting for you.",
    "I'm just glad I could help!",
    "Hello Tolna.",
    "What exactly happened to you down there?",
    "At least we have a warning. Did you manage to retrieve anything?",
    "Thanks. So what are you going to do now?",
    "Thanks.",
    "Hello again. Can you tell me about this training area?",
    "OK, I didn't have too many problems beating them before.",
    "Thanks."
  ],
  "Launa": [
    "Hello.",
    "Oh I wish I knew for sure... All I do know is that it opened seemingly by itself few months ago. It was first discovered by the students over at the Varrock Dig Site, a few of which have gone down there but never returned. They told me about it straight way.",
    "A few reasons, but I think the situation is beyond help now.",
    "I suppose it wouldn't hurt to tell you. I'm waiting to see my son Tolna. Don't suppose you've seen him?",
    "I don't really know.",
    "No. You see I haven't seen him for... for.... 25 years now. He just ran away one day and never returned. I'm hoping he's down this rift as I know he headed in this direction. My husband went to look, but he hasn't returned for days.",
    "You would do that? Oh thank you so much!",
    "Thank you. You can use the rope that's attached at the edge to get into the rift.",
    "Be careful.",
    "What?!?!",
    "How could you say such a thing? Get away from me!",
    "Have you discovered anything yet?",
    "Go into the rift beside me and find my husband and son!",
    "Where are you going?",
    "But why? We're surviving perfectly fine on what we're earning.",
    "Tolna? TOLNA !!!",
    "My son! What did he say?",
    "Who can be surprised at his frustration?",
    "Don't waste my time, his life could depend on you.",
    "Have you found him then?",
    "Please hurry!",
    "What did he say? what did he say?",
    "You must save him! Help him get over his fear!",
    "What can you see?",
    "What are you waiting for? he must be so afraid in that place.",
    "Really? What did he say?",
    "You have to help him overcome his confusion!",
    "Are you any closer to finding my son?",
    "Please don't waste my time.",
    "Oh my! What did he say?",
    "You must fight to give him back his hope!",
    "Of course you can!",
    "Any sight of my son?",
    "You must find him and bring him back to me. Please, I beg you.",
    "You have?",
    "Can you save them?",
    "Thank you.",
    "And you've spoken to him?!?"
  ],
  "Tolna's Voice": [
    "Why should I, Tolna, be trapped in such a wretched place?",
    "Arrghh, It's not fair! Feel my ANGER!",
    "It's so quiet and dark. I FEAR I may never escape this horrid place.",
    "Mum, Dad, help me!",
    "Where am I? How long have I been here? Am I still the person I once was?",
    "Oh why am I so CONFUSED?",
    "What's the point? No-one will ever help me.",
    "I'm not worth anything. Will anyone ever combat my HOPELESSNESS?"
  ],
  "Congratulations! You have completed": [
    "'You Wouldn't Like Me When I'm Angry' - Enter the A Soul's Bane rift.",
    "'A Soul's Bane' - Complete this Novice quest."
  ],
  "You have unlocked a new music track": [
    "Wrath and Ruin.",
    "Fear and Loathing.",
    "Method of Madness.",
    "No Way Out."
  ],
  "Tolna": [
    "I can't live with your rules any more. Mother. I'm tired of working hard for very little money. There's great wealth that's mine for the taking!",
    "I'm tired of your pathetic outlook. Good bye.",
    "Leave me... But I don't want to... How can you say that...",
    "I've done nothing wrong... Arrrghhh...",
    "Why should I speak to you? Besides, I'm no longer the boy you once knew.",
    "No. Something evil in this dungeon has morphed my body and mind.",
    "Don't give up? You had your chance to help me, 25 years it's taken you!",
    "Lies!",
    "Ah, we have a visitor!",
    "Hah! If that's the way you think, then you shall both die!",
    "Sorry? What happened?",
    "Oh yeah. I was looking for the legacy of a civilisation that used to live down here.",
    "Father? Oh. I'm so sorry, can you ever forgive me?",
    "I'm fine, my memories are slowly returning. How's mother?",
    "Where is she?",
    "Thank you so much, I truly owe you for your help.",
    "Hi. Thanks again for saving me, I'm so glad to be out of that horrible place. I was foolish to ignore my parents' warnings when I ran away that day. Luckily I've been able to patch things up with them so they've returned home with peace of mind.",
    "I managed to find the remnants of the ancient civilisation that the stories talked about. It seems people used to worship a god there years ago in numbers far greater than a simple cult following. Sadly there is little remaining so I have nothing else to tell. As soon as I entered this area the ground swallowed me whole. I felt there was something watching, waiting. It's like there is some evil power under the ground that wanted me to suffer. As if it got some sort of empowerment from it. At least what ever it is, it doesn't want to reveal itself to the world yet...",
    "Not really, just a few coins, which you're welcome to have.",
    "I've decided to keep open the rift. There is a part of it that is perfectly laid out for combat training and remnants of my subconscious remain in there. I want to show people the problems I have faced, so that they may learn from them. You're welcome to go down there and practice fighting any time.",
    "Of course, if you enter the rift next to me, you'll find a large dungeon filled with four kinds of beasts. You will recognise them from the gauntlet in which you helped me.",
    "You might find it harder now! At least one is bound to cause you some sort of threat. Be careful! There isn't much in the way of items or treasure down there, it's purely for practicing your combat!"
  ],
  "Brana": [
    "Son! Is that you? Please speak to me! Tolna?",
    "What do you mean? You'll always be my son!",
    "There must be a way. Don't give up so easily!",
    "Sorry, but your mother and I...",
    "...tried so hard to find you!",
    "Please! You must help my son! He's beyond sense.",
    "I take it you have travelled through the mental dilemmas of my son, as I have.",
    "Now you must do what I cannot, conquer the physical dilemma!",
    "Thank you stranger.",
    "Please talk to him, make sure he's OK!",
    "What are you waiting for, bring him back to me!",
    "Son!",
    "Don't worry, I'm just glad you're back to yourself. Are you OK?",
    "She misses you dearly!",
    "Thank you traveller, I'm glad my wife and I never gave up hope. We should return to her and tell her the good news."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:A_Soul%27s_Bane?oldid=35833213’"
  ]
}