{
  "Father Aereck": [
    "Welcome to the church of holy Saradomin.",
    "That's lucky, I need someone to do a quest for me.",
    "Thank you. The problem is there's a ghost in the graveyard just south of this church. I would like you to get rid of it. You'll need the help of my friend, Father Urhney, who is a bit of a ghost expert. He's currently living in a little shack in the south of Lumbridge Swamps, near the coast. My name is Father Aereck, by the way. Pleased to meet you.",
    "Take care travelling through the swamps. To get there just follow the path south, through the graveyard.",
    "Oh, well. If you do have some spare time on your hands, come back and talk to me.",
    "Have you gotten rid of the ghost yet?",
    "Well, you should go find Father Uhrney[sic] as he knows all about ghosts. You can get to the swamp he lives in by going south through the cemetery. You'll have to head south through the swamp - stick to the coastline and you'll find his house in no time.",
    "Have you got rid of the ghost yet?",
    "I always wondered what that amulet was. Well, I hope it's useful. Tell me when you get rid of the ghost.",
    "Have you got rid of the ghost yet?",
    "That would explain it. Hmm. Well, I haven't seen any skulls.",
    "I hate warlocks. Ah, well, good luck.",
    "Have you got rid of the ghost yet?",
    "Great! Put it in the ghost's coffin and see what happens.",
    "Have you got rid of the ghost yet?",
    "Don't worry, I'm sure you'll find it again.",
    "I don't want it! Put it in the coffin and see what happens.",
    "Hi there. Hey, you're the one that got rid of that ghost. I wanted to reward you to say thanks for helping out.",
    "You've got rid of that ghost, haven't you?",
    "Thank you so much. I don't have much money, so I can't pay you, but I could improve your gravestone.",
    "Yes, the gravestone that appears when you die. If you go somewhere dangerous, you'll often find that people have died there and you'll see their gravestones. Most people have very plain ones, but I can upgrade you to a better design.",
    "Certainly. All proceeds are donated to the Varrockian Guards' Widows & Orphans Fund."
  ],
  "Player": [
    "Likewise.",
    "I will, thanks.",
    "How was I supposed to do that?",
    "Hello, ghost, how are you?",
    "Nope, still don't understand you.",
    "Never mind.",
    "Well, if you insist.",
    "Ah, well, better be off now.",
    "Bye.",
    "Well, if you insist.",
    "Ah, well, better be off now.",
    "Bye.",
    "Nope, still don't understand you.",
    "Never mind.",
    "Okay, okay. Sheesh, what a grouch.",
    "Sorry, that's not really possible. I don't have space to carry anything. I'll be right back!",
    "Thank you. I'll give it a try.",
    "A ghost haunting his graveyard.",
    "Sorry, that's not really possible. I don't have space to carry anything. I'll be right back!",
    "Thank you. I'll give it a try.",
    "Sorry, I must have got the wrong address. All the houses look the same around here.",
    "Never mind.",
    "Okay, I'll try to be.",
    "I had a talk with Father Urhney. He has given me a funny amulet for talking to ghosts.",
    "Hello, ghost, how are you?",
    "Why can't I understand you? Oh, yeah, it might help if I wear this amulet!",
    "Hello, ghost, how are you?",
    "What's the problem?",
    "Okay, okay, I can understand you. But have you any idea why you're doomed to be a ghost?",
    "Yeah, it is a pity. Sorry about that.",
    "What? I can see your head perfectly fine. Well, see through it at least.",
    "Okay. I'll try to get your skull back for you so you can rest in peace.",
    "I've found out that the ghost's corpse has lost its skull. If I can find the skull, the ghost should depart.",
    "I think a warlock has stolen it.",
    "Hello, ghost, how are you?",
    "Sorry, I can't find it at the moment.",
    "I've finally found the ghost's skull.",
    "Well, I found the ghost's skull, but then lost it.",
    "Hello, ghost, how are you?",
    "I found it!",
    "Hello again.",
    "That sounds good, but I need to free up some inventory space first. I'll be right back.",
    "Thanks!",
    "Yes, I have.",
    "My gravestone?"
  ],
  "Restless ghost": [
    "Wooo wooo wooooo!",
    "Woo woo?",
    "Woooooo!",
    "Wooo wooo. Woooooooooooooooooo!",
    "Woo.",
    "Woo wooooo! Wooooo woo woo woo!",
    "Wooo wooo.",
    "Wooooooo woo woooooooo.",
    "Wooo wooo.",
    "Wooo woo?",
    "Wooooooooo!",
    "Woo.",
    "Wooo wooo.",
    "Wooo woooooooooooooo...",
    "Wooo wooo.",
    "Wooo woo?",
    "Wooooooooo!",
    "Woo.",
    "Wooooooo woo! Wooooo woo wooooo woowoowoowooWoo wooo. Wooooo woo woo? Woooooooooooooooooo!",
    "Woo woo?",
    "Woooooo!",
    "Wooooooo.",
    "Wooo wooo wooooo!",
    "Not very good, actually.",
    "Did you just understand what I said?",
    "Wow! This is incredible! I didn't expect anyone to ever understand me!",
    "Well, to be honest, I'm not sure. I should think it's because I've lost my head.",
    "Oh, that's a pity. You got my hopes up there.",
    "Hang on a second - you can understand me!",
    "Great. The first person I can speak to in ages...[sic] ...and they're a moron.",
    "I'm impressed. You must be very powerful. I don't suppose you can stop me being a ghost?",
    "Nope. I just know I can't do much of anything like this. I should think it's because I've lost my head.",
    "Oh! It's your amulet that's doing it. I did wonder. I don't suppose you can help me? I don't like being a ghost.",
    "Nope. I just know I can't do much of anything like this. I should think it's because I've lost my head.",
    "Great. The first person I can speak to in ages...[sic] ...and they're an idiot.",
    "No, no, I mean from my REAL body. If you look in my coffin you'll see my corpse is without its skull. Last thing I remember was being attacked by a warlock while I was mining. It was at the mine just south of this graveyard.",
    "How are you doing finding my skull?",
    "Ah, well. Keep on looking. I'm pretty sure it's somewhere near the mining spot south of here. I really hope it's still there somewhere.",
    "How are you doing finding my skull?",
    "Hurrah! Now I can stop being a ghost! You just need to put it in my coffin there, then I'll be free!",
    "If you put it in my coffin, that should do the trick.",
    "Release! Thank you stranger."
  ],
  "Father Urhney": [
    "Go away! I'm meditating!",
    "I said go away!",
    "I suppose I'd better talk to you then. What has he got himself into this time?",
    "Oh. The silly fool. I leave town for five months and he's already having problems. *sigh* Well, I can't go back and exorcise it - I vowed not to leave this place until I've spent a full two years praying and meditating. I'll tell you want I can do, though - take this amulet.",
    "It is a ghostspeak amulet. It's called that because, when you wear it, you can speak to ghosts. Many ghosts are doomed to remain in this world because they have some important task left uncompleted. If you know what this task is, you can get rid of the ghost. I'm not making any guarantees, mind you, but it's the best I can do right now.",
    "Yeah. Even when we were trainee priests he kept getting stuck up bell ropes. Anyway, I don't have time for chit-chat. What's his problem this time?",
    "Oh. The silly fool. I leave town for five months and he's already having problems. *sigh* Well, I can't go back and exorcise it - I vowed not to leave this place until I've spent a full two years praying and meditating. I'll tell you want I can do, though - take this amulet.",
    "It is a ghostspeak amulet. It's called that because, when you wear it, you can speak to ghosts. Many ghosts are doomed to remain in this world because they have some important task left uncompleted. If you know what this task is, you can get rid of the ghost. I'm not making any guarantees, mind you, but it's the best I can do right now.",
    "On what grounds?",
    "What? But I don't have a mortgage - I built this house myself.",
    "What? What houses? This is the only one. What are you talking about?",
    "Oh, go away and stop wasting my time.",
    "What are you talking about? I can see you've got it with you.",
    "Why do you insist on wasting my time? Has it even occurred to you to look in your bank? Now go away!",
    "How careless can you get? Those things aren't easy to come by, you know! It's a good job I've got a spare.",
    "Be more careful this time.",
    "Go away! I'm meditating!"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:The_Restless_Ghost?oldid=36225379’"
  ]
}