{
  "This page contains dialogue related to Recipe for Disaster": [
    "Freeing King Awowogei.The content below is copied verbatim from RuneScape and thus copyrighted by Jagex."
  ],
  "Gypsy Aris": [
    "You will need to feed King Awowogei his favourite dish.",
    "I have to admit I'm not sure, maybe you should ask him?",
    "Yes, of course.",
    "Good work adventurer, I've teleported them away to safety! You only have [number] council members left to protect!"
  ],
  "Player": [
    "What's that then?",
    "Ask the version of him on Ape Atoll?",
    "The monkey king... However did I save him from the culinaromancer...?",
    "Oh yeah... I remember now...",
    "Do you have a favourite dish?",
    "Are you sure?...",
    "So you do have a favourite dish, but you don't want to tell me.",
    "So if I talk with these three monkeys they'll tell me all about it?",
    "Hello?",
    "There's something familiar about you guys.",
    "Who are you?",
    "What exactly are you doing here?",
    "Do you know anything about Awowogei's favourite dish?",
    "What's wrong with you?",
    "Can you tell me what this recipe is, then?",
    "Well, I am also on a top secret mission.",
    "Well, it's on a strict need-to-know basis. I'm sure you understand.",
    "However, I think I can trust you with sensitive material.",
    "(You whisper in Mizaru's ear) I've been charged with organising a secret party to celebrate the king's birthday. Keep it quiet, though, don't let a single monkey know.",
    "Where do I find this stuff, then?",
    "That's all for this moment.",
    "What are you doing here?",
    "Do you know anything about the king's favourite dish?",
    "What am I looking for again?",
    "Where do I find this stuff, then?",
    "Are you sure he's not trying to say something important?",
    "If you say so...",
    "I think your friend wants to tell me something.",
    "...",
    "Well?",
    "*sigh* I should have guessed it wouldn't be that easy. A red banana. Don't all bananas taste the same?",
    "Oh, you mean RED bananas! Yes, of course. I've heard that they are the tastiest. Much tastier than blue bananas, how could I forget? Bah, only a fake monkey wouldn't know that. Ahem.",
    "Err, I'm not from round here. Anyway, moving quickly on, is there a red banana tree nearby?",
    "Right! I'd better start looking for a red banana tree.",
    "I think Iwazaru is trying to say something.",
    "...He said all that?",
    "I never realised monkey sign language was so...concise. Anyway, where do I find this plant?",
    "Right! I'd better start looking for this tchiki monkey nut bush, then.",
    "Is this the red banana I'm looking for?",
    "Wait, I need that. You don't have to eat-",
    "Well... is that the right one?",
    "Really. I suppose I'd better get another one now.",
    "I think I've got some tchiki monkey nuts.",
    "Don't eat them!",
    "So, I've got all the ingredients. What do I do now?",
    "How do I do that, then?",
    "How do I cook this thing? It's huge! Is it going to fit in an oven or on a spit?",
    "Hmmm. Somewhere underneath here, with zombies?",
    "Somewhere hot, possibly nearby? What's this business about me dying, though? That's not so cool.",
    "Well, I suppose I'd better have a look.",
    "Yup, it's all cooked and ready to go, or, at least, I think it is.",
    "Yeah, listen to Iwazaru! Stay away from my stuffed snake! I'm not making another one. There was more than enough monkey business involved in making this one.",
    "Thanks for your help, guys! I've had more fun than a barrel of monkeys doing this.",
    "Although, I wish I'd realise earlier on that Iwazaru was the monkey with the brains.",
    "Time to serve this to the king.",
    "I'm just a wandering chef, travelling from town to town saving peoples lives.",
    "Yet again, my heroic work goes unappreciated, I suppose that is the fate of a true hero.",
    "So ...I've heard that this dish makes you more cooperative.",
    "Well, getting to Ape Atoll is quite a pain. Do you have a way of making it easier to get there?",
    "Will you let me know how to cast it?",
    "So, what do I need to know?",
    "Ah I see, so the banana actually has the crucial effect on the teleportation matrix.",
    "I'm sorry I forced you to tell me the spell.",
    "Yes – that would have been a lot worse.",
    "You're confused? Get a ticket and join the queue, Your Monkeyness."
  ],
  "Cook": [
    "Well, it was something that sounded ABSOLUTELY DISGUSTING that you picked up on Ape Atoll...",
    "Did you want a reminder on any other of your brave exploits?"
  ],
  "Awowogei": [
    "What? No. Definitely not.",
    "Absolutely. I can't let you have sensitive information like that...",
    "I won't tell you anything – and neither will the three monkeys, I made sure of that. I can't have any monkey knowing about it.",
    "NO! Now go away and leave me in peace.",
    "Err Where am I? Ooh! Roasted Stuffed Snake, lovely.",
    "Mmmm, I'm sure I can detect the delicate aroma of Tchiki Monkey nuts, and the sweet perfume of Red Bananas, all slowly caramelised on hot rocks.",
    "*munch* Who are you?",
    "*gorge* You're a bit odd, aren't you?",
    "*stuff* That's a lie, no definitely not. Well maybe.",
    "N. Nnnnn... nghghghnmnmn... Yes there is a spell.",
    "Absolutely No... Nerrrrnnnn... Oh, go on then.",
    "Well, it will take a while to explain...",
    "Yes, yes, of course.",
    "Oh that's alright – it could have been worse – you could have asked me to marry you.",
    "Anyway, it seems you have done me a favour. Though I'm a bit confused about what went on here."
  ],
  "Kikazaru": [
    "What? Eh? Did you say something?",
    "Who are you?",
    "...",
    "What? Oh, hello, who are you? I'm Kikazaru.",
    "What? Oh, this is Mizaru and Kikazaru.",
    "Aren't you the clever monkey around here?",
    "Hee hee hee! You're so rude.",
    "I know, I know. I'll tell him.",
    "I can't hear you...",
    "Ow! There was this recipe, right...",
    "Oof! He liked it so much he married the cook! YEAH? Have some of this! *poke*)",
    "Oof! The king thought it was magic and – AAAIEEE! – he got a priest to curse us to keep quiet. *head-butt*",
    "Ha! Serves you right! Anyway. The priest only had enough ingredients for one curse, so, when he tried to keep us all from telling anyone the recipe, each of us only got part of the curse. That's why I can't hear anything now.",
    "Hmmm...",
    "Really?",
    "Oh, that's very interesting.",
    "What? Eh? Oh, right!",
    "Iwazaru says that you have the wrong type of banana.",
    "You need a red one.",
    "(Kikazaru looks blankly over your shoulder)",
    "Ah, I see.",
    "Iwazaru says that you have the wrong kind of monkey nuts. Ordinary monkeys nuts just won't do.",
    "There is a special type of monkey nut that grows on the island, and has a subtle and distinctive flavour, highly valued by all monkeys with a sophisticated palate.",
    "They are called tchiki monkey nuts and they require a very particular combination of soil and climate.",
    "They need the minerals and dampness found in hill caves, but also cannot grow without sunlight.",
    "Myth and legend shrouds the history of the tchiki monkey nut.",
    "Some say that it is the nut that gave monkeys their superior intelligence.",
    "Others say tchiki monkey nuts are the food of the monkey gods.",
    "Either way, you must find a path through treacherous undergrowth to harvest the Nut of Kings.",
    "Yup.",
    "Look to the hills, south of here.",
    "Too late.",
    "I'm afraid you're going to have to get some more.",
    "Zzzzzzzzzzzzzzz.",
    "Zzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzz.",
    "Just a little taste."
  ],
  "Mizaru": [
    "Who's there? Hello?",
    "Is there somebody there?",
    "I'm Mizaru, and this is Iwazaru.",
    "He says hello. This is Kikazaru.",
    "Oi, you! Pay attention!",
    "Mizaru gives Kikazaru a slap.",
    "I've already said that.",
    "I'VE ALREADY SAID THAT.",
    "Not very bright, that one.",
    "Grr... Do you have any other questions?",
    "No! I forbid you to tell this stranger anything!",
    "Yeah, well, hear this gnomebrain! (He slaps Kikazaru.)",
    "Stop it!",
    "AARGH not in the eye! *kick*",
    "How do you know about that? It's top secret information, you know.",
    "Ah, I see. Can you tell me what the mission is?",
    "Of course, of course.",
    "Well, in that case, you definitely need to know the recipe.",
    "The king has a real soft spot for roasted giant snake, stuffed with sliced banana and monkey nut paste.",
    "Yup! You need to find some bananas and monkey nuts, and stuff a giant snake with them. It's as simple as that. Stop hassling me, Iwazaru.",
    "Every monkey knows where to get hold of nuts and bananas, but I believe that the snakes live on a nearby island. Never seen one myself.",
    "Some monkey nuts, a banana and a snake to stuff them into.",
    "I've heard that there are snakes on a small island to the east of here. Nuts and bananas? Just check the normal places.",
    "Stop making such a fuss, Iwazaru.",
    "No, no, no. Always looking to be the centre of attention that one. Don't let him worry you.",
    "This feels like the banana. This should do the job.",
    "Quiet, Iwazaru!",
    "Oh, ignore him, he's clueless.",
    "Grrrrr!",
    "(Mizaru looks astounded)",
    "How can a monkey say such a thing?",
    "Blue bananas? There's no such thing. Hey, wait a second, where did you say you came from?",
    "Iwazaru says there is a tree in the west of the island.",
    "Ah, monkey nuts. Good work.",
    "Stop playing around, Iwazaru.",
    "Oh, ignore him.",
    "Hmmm, oh yes, very tasty.",
    "Oh yes, I'd recognise the taste of red anywhere.",
    "Mmm, these are very tasty. Tchiki monkey nuts really are the best nuts I've ever tasted.",
    "You need to prepare the ingredients and stuff the animal.",
    "I don't know. They don't let blind monkeys into the kitchen. Anyway, you're the cook, I'm sure you can work it out.",
    "A very good question. Anyone know?",
    "Mmmm, something smells good...",
    "Maybe the king wouldn't notice if we had a little bit?",
    "Take that thing away from us. It will only fill us with unfulfilled longing.",
    "Ooh, you cheeky monkey!"
  ],
  "Iwazaru": [
    "Mmmmghmhhmh...",
    "Mmmmghhh mhhhh.",
    "Mmhggmmmhh.",
    "Ggmmhhmm.",
    "Iwazaru waves his hands around at Kikazaru in a way that might be construed as monkey sign language.",
    "(Iwazaru waves his arms again. Whatever he said wasn't very polite.)",
    "Hmhmhhhh mmgghh.",
    "Mmmmghhh. (He nods his head)",
    "(Iwazaru raises an eyebrow dubiously. You give him a wink.)",
    "GGHHMM! (Iwazaru starts jumping up and down)",
    "Gghmnmn!",
    "(Iwazaru jumps up and down, waving his arms and legs about wildly.)",
    "(Iwazaru grabs you by the arm.)",
    "(He shakes his head vigorously.)",
    "(Iwazaru makes what you suspect was a very rude gesture to Mizaru)",
    "(Iwazaru starts gesturing at Kikazaru)",
    "(Iwazaru gestures some more)",
    "(Iwazaru waves his arms about yet more)",
    "(Iwazaru sighs and points to you)",
    "(Iwazaru looks shocked)",
    "(Iwazaru nods enthusiastically and points west.)",
    "(Iwazaru is hysterically trying to get your attention)",
    "(Iwazaru grabs you by the arm.)",
    "(He shakes his head vigorously.)",
    "Mmmh! (He quickly makes some signs at Kikazaru)",
    "(Iwazaru nods enthusiastically and points south.)",
    "(Iwazaru slaps his forehead)",
    "(Iwazaru shrugs apologetically.)",
    "(Iwazaru nods. He looks at Kikazaru to translate for him.)",
    "(Iwazaru prods Kikazaru)",
    "(Iwazaru sighs, and then points to the floor directly beneath him, acting like a zombie.)",
    "(He then points at you and falls over and plays dead, gets up and shrugs.)",
    "(Iwazaru nods)",
    "(He then wipes his forehead as if it were hot and points at the sacrificial pyre in the east of the temple.)",
    "(Iwazaru shrugs)",
    "(Iwazaru slaps both of the other monkeys on the back of the head.)",
    "(Iwazaru mimes putting a crown on his head.)"
  ],
  "v • d • eRS3 Recipe for Disaster": [
    "Freeing King AwowogeiA subquest of Recipe for DisasterNPCs"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Recipe_for_Disaster:_Freeing_King_Awowogei?oldid=16604745’"
  ]
}