{
  "Sumona": [
    "How dare you speak to me with that spying cat following you. Keep the vile creature away from me.",
    "Oh, I'd have no clue; unless the gods themselves have taken an interest in my plight. Would you be the sort of hero who could rescue a damsel in distress?",
    "Very well. It's a simple tale: my twin sister has been captured by fiendish monsters and is held down the town well. I need a hero to rescue her. Can you help me? If you live, I give a solemn vow to reward you greatly.",
    "You don't know what great adventure you are missing.",
    "Great! All you need to do is to jump down the well in the centre of Pollnivneach and save my sister. Get to it.",
    "No news. My sister is still trapped in the bowels of the earth, awaiting your rescue.",
    "Nothing. Could you get down there and rescue her? I'm sick with worry, don't you know.",
    "No news. My sister is still trapped in the bowels of the earth, awaiting your rescue. You smell funny; of cat, or something.",
    "You think I'm interested in your gossip? Go and rescue my sister from that well.",
    "No ifs, no buts, just rescue. We have a deal, remember? I even made a vow to reward you. That's not something I do often.",
    "What manner of comedy headgear is that? Aren't you supposed to be on a serious mission? I'd really advise destroying it before you are laughed out of town.",
    "You think I'm interested in your gossip? Go and rescue my sister from that well.",
    "No ifs, no buts, just rescue. We have a deal, remember? I even made a vow to reward you. That's not something I do often.",
    "Yes, of course. I am delighted, happy, ecstatic.",
    "As you seem so good at killing things, I can give you some of these 'Slayer tasks' I hear about. I can also show you how to combine some of your existing Slayer equipment. In addition, my powers are such that you will be able to explore the areas beyond the barriers, down below the well, since I have weakened them for you.",
    "Oh, I was more heartbroken than you can ever comprehend.",
    "We have matters to discuss before I sell anything to you.",
    "'Ello. I'm a Slayer master now.",
    "There's not much to say. She's back in a safe place, where no one will see her again.",
    "Am I my sister's keeper? Some things must remain a mystery, known only to the gods.",
    "They are monsters, so they are fit only for slaying. With no thoughts of an afterlife, they live a simple life of kill and be killed. You should strive for such an existence, for therein lies happiness.",
    "Shifty? Me? I'm protecting her and leaving no clues to her location.",
    "There has already been a kidnap attempt and there may be another. Now, I shall be silent, in case I reveal too much.",
    "Well, they should be mostly passable. I weakened them for you after you rescued Jesmona. You should be able to sate your destructive appetite upon these creatures."
  ],
  "Player": [
    "Hello, there. I have a strange feeling that you are important. Have you any idea why this might be?",
    "I've had some mixed experiences with this sort of thing in the past. Give me some more details and I'll consider it.",
    "I'd rather not.",
    "Certainly, I can help.",
    "Hello, again. Do you have any news for me?",
    "So, nothing I should know?",
    "Not now puss, I have important work to do.",
    "Don't you have an owner or something? Get away!",
    "Ow, ow, ow! Okay, I get the hint, you insane thing. I guess I need to talk to you; even a cat would understand the vital nature of my heroic quest.",
    "Not now puss. I have important work to do.",
    "Don't you have an owner or something? Get away!",
    "Look, fleabag, I need to go down here to rescue a damsel in distress. I know it's dangerous.",
    "Smoke and banshees? Well, I'm sure I'll prevail.",
    "I suppose you'll have me travelling the globe on some epic quest?",
    "The desert's a big place, any better directions?",
    "Okay, the tombs east of the Agility Pyramid, talk to dead Slayer guy, learn the 'trick' and I can be off. Oh, and thanks, too.",
    "Can you remind me what I was supposed to be doing?",
    "The desert's a big place, any better directions?",
    "Okay, the tombs east of the Agility Pyramid, talk to dead Slayer guy, learn the 'trick' and I can be off. Oh, and thanks, too.",
    "Hello, again. Do you have any news for me?",
    "Well, I spoke to a cat just recently and talked about our mission. It said-",
    "But-",
    "Anything you could offer in the way of advice, my feline friend?",
    "What's that got to do with it?",
    "I'm still confused, but I'll give your theory due consideration.",
    "I think I'll leave it alone. I might get hurt!",
    "Ouch!",
    "Ah, yes. I can't understand you without my amulet.",
    "Anything you could offer in the way of advice, my feline friend?",
    "Interesting enough to go in and have a look?",
    "No, come back!",
    "Anything you could offer in the way of advice, my feline friend?",
    "Special sources?",
    "Sometimes I feel that the action goes on behind the scenes in the desert.",
    "Couldn't you give me direct instructions, for once? Just give me the third clue and let me ponder them all.",
    "Now, where did I leave my amulet of ghostspeak?",
    "At last, I reach you. I was told that you could help me in a quest.",
    "Master of the dead? I'm already a bit confused, so some clarifications would be handy.",
    "Could you tell me what to expect during the rescue?",
    "Really? I'm sorry to hear that.",
    "I'd wondered where these came from, but I thought it was spontaneous generation, or something.",
    "It sounds simple enough.",
    "I'm not after anything, in fact.",
    "I made the masked earmuffs.",
    "Well, no. I thought I'd come and chat with you, as it didn't seem that urgent.",
    "Ah yes, I can't understand you without my amulet of catspeak.",
    "Hello, Ali. I made myself masked earmuffs, so I'm safe in that vile dungeon.",
    "Well, I spoke to a cat just recently and talked about our mission. It said-",
    "But-",
    "Anything you could offer by way of advice, my feline friend?",
    "On that subject, how come you aren't coughing and sneezing?",
    "I look silly with this hat on, but at least I can fight when the right way up. Any more useful advice?",
    "What's going on here, then?",
    "Free her or face my righteous wrath!",
    "Once more, I am victorious and save the day.",
    "Now I really am confused.",
    "Can you tell me what just happened, though?",
    "That's a bit less confusing, but what about the book and the vanishing twin?",
    "That's what I'm hoping.",
    "I'll bear that in mind.",
    "I have rescued Jesmona, although it got slightly confusing at the end.",
    "I'm not after anything, in fact.",
    "I rescued your sister or, at least, it seems she escaped. I assume you have some sort of psychic link and know that she is safe.",
    "I'll have some questions afterwards, but do I get a nice reward? You swore, quite definitely, to recompense me.",
    "Thanks. I hope you weren't too distressed by the whole affair.",
    "I need another assignment.",
    "Do you have anything for trade?",
    "I am here to discuss any rewards that I might be eligible for.",
    "I have some questions about your sister.",
    "She started incinerating things when I freed her, and she said some pretty odd things. I'd prefer it if you gave me some answers.",
    "I'd like to know about the inhabitants of the dungeons.",
    "That's quite a grim philosophy.",
    "Why are you so shifty when I talk about your sister?",
    "But why not tell me?",
    "The barriers in the dungeon confuse me.",
    "I'm not after anything, in fact.",
    "Er, nothing.",
    "Well, I wouldn't put it quite like that.",
    "I think that was a compliment, so thanks."
  ],
  "Ali Cat": [
    "Meeeeeow.",
    "Mew, mew.",
    "RAAAREEEEOWEEE!",
    "Mew, mew.",
    "Stop, stop. Silly human.",
    "I said stop. Don't you understand?",
    "I have no owner, for I am a free cat. Listen to me or die horribly!",
    "You think you can fight banshees while surrounded by smoke? More skilled folk than you have died horribly in there.",
    "Try wearing your earmuffs and a face mask at the same time, bonehead: it can't be done. You'd be as helpless as a newborn kitten thrown into the Fight Pit. Luckily, I know a solution to this problem.",
    "Oh, no. All you need to do is seek out Catolax, a Slayer master who died ages ago, and have a chat with him. He was buried in the desert, so he may be hard to talk to.",
    "A deity told me to look near the ruins of Ullek. That's some-way east of what you humans call the Agility Pyramid. There are some old tombs in the valley walls there, which are only openable if you know the trick.",
    "My pleasure. A warning: don't trust any redheads. Oh, take your cat friend and this...",
    "Hello again, human. There's still no way you'd survive in there, so you can't go in.",
    "You need to seek out Catolax, a Slayer master who died ages ago, and have a chat with him. He was buried in the desert, so he may be hard to talk to.",
    "A deity told me to look near the ruins of Ullek. That's some-way east of what you humans call the Agility Pyramid. There are some old tombs in the valley walls there, which are only openable if you know the trick.",
    "My pleasure. A warning: don't trust any redheads. Oh, take your cat friends.",
    "Meeeeeow.",
    "Good for you. I hope the hunting is great down there. If only there were more mouse-sized monsters, I'd be heroic too.",
    "Word on the street is that you rescued the damsel and are due a hefty reward.",
    "Well, she's the sort to keep her promises, so you should be fine. Don't expect her to be gracious about it, though.",
    "So, you've finished Sumona's mission and you're now using her to your advantage. Well done.",
    "Oh, but I would. Using folk who think they're superior, but you know are not, is a useful life skill. You're becoming ever more feline, which is a good thing – trust me."
  ],
  "Cat": [
    "Have you seen the way that Sumona creature looks at me?",
    "She hates me, which shows she's up to no good. We cats are a blessed species - remember that.",
    "Meeeeew.",
    "Well, the obvious path is clearly a trap and that hole over there is very interesting.",
    "I'll look inside and check it for you, on the off chance that there's a nice place to have a nap.",
    "Too late now. I'm off.",
    "Everything looks suspicious in here, but I have some special advice from special sources.",
    "He is content to act as an anonymous force for your preservation on this occasion, and that's not something he does often. You must have impressed him in the past.",
    "That's much the case here, too. The information I have for you is threefold. Firstly, you can avoid or kill enemies as you see fit to start with. Secondly, you should examine the smallest details if you see seemingly unavoidable perils.",
    "Thirdly, the guardians sometimes only appear if their minions are dead. That's your lot – I hope you enjoy it!",
    "It's horrible down here; all kinds of vicious human-eating creatures. The smoke is pretty bad too.",
    "It's not so bad down here on the floor; so, if you stand on your head, you might be safe.",
    "My super-hearing can detect a woman's voice to the north; so, perhaps we can head there. If you can dodge those wailing banshees, it might be better than a fight, too. I expect you'll have to kill one or two as you progress."
  ],
  "Catolax": [
    "Woo woo.",
    "Indeed I can. The master of the dead told me of your need.",
    "I am dead, so my appetite for conversation is not large. I will give you the knowledge, but will not submit to further examination. You already know the answers to your own questions.",
    "Why must you pester me now? Combine your earmuffs and Slayer face mask, then go forth and rescue your damsel in distress. Anything more?",
    "Indeed I can, for it was there that I died, many years ago.",
    "It is no matter, as my life would have passed by now. As for the area beneath the well: it is the source of some creatures sought by slayers.",
    "Many of the perils of this world are there by design, not by accident. You will find, however, that much of the dungeon you intend to visit is sealed off. Only by successfully rescuing Jesmona and weakening the barriers will you be able to access the whole area.",
    "Be warned, however; this Sumona might not be expecting for you to succeed. Also, there is a monstrous banshee there which has a scream capable of penetrating earmuffs, so you will simply have to tolerate its attacks. Luckily, the effect of this scream is more awkward than deadly in effect.",
    "The sister is rescued?",
    "Heroes aren't the same as they were in my day. Can I help you with anything else?",
    "My heartfelt thanks, adventurer. With the death of the banshee mistress, my soul is freed.",
    "You have thwarted an attempt upon your life by the scourge of the desert lands. Her power will now be lessened once more. Fortunately for you, you have a promise of a reward, so will be safe from her vengeance. As I only answered your direct questions, I too will be able to exist without her torments. Only she loses.",
    "The book granted my murderess powers over the creatures here. I am sure that its destruction was simply to deny you its powers. As for the sister: I am sure you have realised that such a twin is far too convenient to actually exist. Now, my power to contact you through your mind is fading, as the immediacy of your victory passes. Once you have spoken with Sumona, I will await you below the well. Talk with me there if you have more questions.",
    "How goes it?",
    "Yes, the whole affair seems to have been played out behind the scenes, one might say. It's best you fetch your reward from that damsel in distress. Anything more?"
  ],
  "Jesmona": [
    "Save me!",
    "It is over. Now burn in the hell of your abject failure.",
    "You too have failed me.",
    "My shackles! Now, freedom is mine.",
    "I am rescued, it seems. My sister will deal with this."
  ],
  "Insectoid assassin": [
    "This woman belongs to us now and we shall not free her. No puny adventurer can interfere."
  ],
  "Banshee mistress": [
    "Eeeeeeeeeeeeaaaaaaaah!"
  ],
  "Insectoid assassin #1": [
    "No mi-"
  ],
  "Insectoid assasin #2": [
    "Spare me!"
  ],
  "(See Transcript": [
    "Catolax)"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Smoking_Kills?oldid=33514970’"
  ]
}