{
  "Squire Asrol": [
    "Hello, I am the squire to Sir Vyvin.",
    "Well, Sir Vyvin is a good guy to work for, however, I'm in a spot of trouble today. I've gone and lost Sir Vyvin's sword!",
    "Well now, if I knew THAT it wouldn't be lost, now would it?",
    "No. I was carrying it for him all the way from where he had it stored in Lumbridge. It must have slipped from my pack during the trip, and you know what people are like these days... Someone will have just picked it up and kept it for themselves.",
    "Yes. You can get bronze swords anywhere. But THIS isn't any old sword.",
    "Thanks for the offer. I'd be surprised if you could though.",
    "The thing is, this sword is a family heirloom. It has been passed down trough Vyvin's family for five generations! It was originally made by the Imcando dwarves, who were a particularly skilled tribe of dwarven smiths. I doubt anyone could make it in the style they do.",
    "I'm not a hundred percent sure the Imcando tribe exists anymore. I should think Reldo, the palace librarian in Varrock, will know; he has done a lot of research on the races of Gielinor. I don't suppose you could try and track down the Imcando dwarves for me? I've got so much work to do...",
    "Thank you very much! As I say, the best place to start should be with Reldo...",
    "He doesn't know yet. I was hoping I could think of something before he does find out, But[sic] I find myself at a loss.",
    "Yes, me too. I'm not looking forward to telling Vyvin I've lost it. He's going to want it for the parade next week as well.",
    "No, sorry, I'm loyal to Sir Vyvin.",
    "So how are you doing getting a sword?",
    "Please try and find them quickly... I am scared Sir Vyvin will find out!",
    "So how are you doing getting a sword?",
    "A picture eh? Hmmm... The only one I can think of is in a small portrait of Sir Vyvin's father... Sir Vyvin keeps it in a cupboard, in his room at the top of the castle, I think.",
    "Please don't let him catch you! He MUSTN'T know what happened!",
    "Please try and get it quickly... I am scared Sir Vyvin will find out!",
    "Please hurry!",
    "So how are you doing getting a sword?",
    "Please hurry!",
    "Thank you, thank you, thank you! I was seriously worried I would have to own up to Sir Vyvin!"
  ],
  "Player": [
    "And how is life as a squire?",
    "Do you know where you lost it?",
    "Well, do you know the VAGUE AREA you lost it?",
    "Well, the kingdom is fairly abundant with swords...",
    "I can make a new sword if you like...",
    "So would these dwarves make another one?",
    "No, I've got lots of mining work to do.",
    "Ok, I'll give it a go.",
    "Is he angry?",
    "Well, I hope you find it soon.",
    "Wouldn't you prefer to be a squire for me?",
    "I'm still looking for Imcando dwarves to help me...",
    "So are there any Imcando left at all?",
    "Hello. Are you an Imcando dwarf?",
    "Can you make me a special sword?",
    "Would you like some redberry pie?",
    "Hello. Are you an Imcando dwarf?",
    "Can you make me a special sword?",
    "I need you to make a sword for one of Falador's knights. He had one which was passed down through five generations, but his squire has lost it. So we need an identical one to replace it.",
    "I'll go and ask his squire and see if I can find one.",
    "About that sword...",
    "Sorry, not yet.",
    "I've found an Imcando dwarf but he needs a picture of the sword before he can make it.",
    "Ok, I'll try and get that then.",
    "I didn’t get the picture yet…",
    "I have the picture, I'll just take it to the dwarf now!",
    "About that sword... I have found a picture of the sword I would like you to make.",
    "Ok. I'll go and find them then.",
    "About that sword...",
    "I don't have any of them yet...",
    "I don't have enough iron bars...",
    "I don't have any blurite ore yet...",
    "I have them right here.",
    "Thank you very much!",
    "Thanks for all your help in getting it for me!",
    "I've found a dwarf who will make the sword, I've just got to find materials for it now!",
    "I have retrieved your sword for you."
  ],
  "Squire Arsol": [
    "Oh man... I'm in such trouble..."
  ],
  "Reldo": [
    "Hello, stranger.",
    "The Imcando dwarves, you say? Ah yes... for many hundreds of years they were the world's most skilled smiths. They used secret smithing knowledge passed down from generation to generation. Unfortunately, about a century ago, the once thriving race was wiped out during the barbarian invasions of that time.",
    "I believe a few of them survived, but with the bulk of their population destroyed their numbers have dwindled even further. I believe I remember a couple living in Asgarnia near the cliffs on the Asgarnian southern peninsula, but they DO tend to keep to themselves. They tend not to tell people that they're the descendants of the Imcando, which is why people think that the tribe has died out totally, but you may well have more luck talking to them if you bring them some redberry pie. They REALLY like redberry pie."
  ],
  "Thurgo": [
    "Maybe. Who wants to know?",
    "No. I don't do that anymore. I'm getting old.",
    "I'd never say no to a redberry pie! They're GREAT stuff!",
    "By Guthix! THAT was a good pie! Anyone who makes pie like THAT has got to be alright!",
    "Maybe. Who wants to know?",
    "Well, after bringing me my favorite food I guess I should give it a go. What sort of sword is it?",
    "A Knight's[sic] sword eh? Well I'd need to know exactly how it looked before I could make a new one. All the Faladian knights used to have swords with unique designs according to their position. Could you bring me a picture or something?",
    "Have you got a picture of the sword for me yet?",
    "Well, come back when you do.",
    "Ok. You'll need to give me some stuff in order for me to make this. I'll need two iron bars to make the sword to start with. I'll also need an ore called blurite. It's useless for making actual weapons for fighting with except crossbows, but I'll need some as decoration for the hilt. The only place I know where to get it is under this cliff here... But it is guarded by a very powerful ice giant. Most of the rocks in that cliff are pretty useless, and don't contain much of anything, but there's DEFINITELY some blurite in there. You'll need a little bit of mining experience to be able to find it.",
    "How are you doing finding those sword materials?",
    "Well, come back when you do. Remember: I need a blurite ore and two iron bars.",
    "Better go get some then, huh?",
    "Better go get some then, huh?",
    "Just remember to call in with more pie some time!",
    "No worries mate."
  ],
  "Sir Vyvin": [
    "HEY! Just WHAT do you THINK you are DOING??? STAY OUT of MY cupboard!"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:The_Knight%27s_Sword?oldid=31024923’"
  ]
}