{
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "Some missing dialogue, including if the player clears the workshop before smithing the itemsYou can discuss this issue on the talk page or edit this page to improve it."
  ],
  "Doric": [
    "It's over, it's over...",
    "My business, my life...everything! It's all in ruins.",
    "Nurmof should have sent his pickaxe order through this week but I've heard nothing. He's been my most loyal customer for years, and he's not the only one to stop. I'm ruined!",
    "Back again, adventurer? Unfortunately business isn't looking any better than last time we spoke.",
    "You'll help me? Thank you!",
    "I've been working here as a smith for decades, but over the last few months the number of people ordering from me has fallen.",
    "When I get new customers, they soon stop ordering from me as well.",
    "To make matters worse, I've received word that my son, Boric, finished his studies in the dwarven city of Keldagrim, but he hasn't made it home.",
    "He should have been back weeks ago. I'm getting too old for this.",
    "One. Sir Amik in Falador, the leader of the White Knights.",
    "We could try.",
    "Well if you don't mind. I've let things run down lately and I'm out of materials so we're going to need some ore before we begin – two copper ore and two tin ore.",
    "I should tell you, I use only high-quality ore. You need to know where to look for it, but it produces fine results.",
    "You can only find these ores in certain places. Take this ore bag and map to gather them; I've marked all the mining sites you'll need to visit.",
    "It looks like you've lost those items I gave you earlier. Luckily, I have some spares for you to take.",
    "I've marked all the mining sites that you need to visit on the mining sites map.",
    "I have a map and an ore bag to help you collect these ores, but you don't have space at the moment. Talk to me when you have room.",
    "Once you've visited all the mines, you can teleport to the Falador lodestone to get back here quickly.",
    "Thanks for your help. Any other questions before you leave?",
    "I've got a few people in mind. Don't be fooled, this business is more cutthroat than you'd think.",
    "There are dwarves in the mine nearby who would love to take my business from me – that's where I'm betting my money.",
    "I'm too worried about Boric to think about mining. What if he turned up and needed my help?",
    "I got bigger problems than letting random adventurers use my anvil right now – if you help me, perhaps I could allow you to work with it then.",
    "Good. Hurry back.",
    "Don't worry adventurer, you go about your business. I don't expect anyone to put themselves out for me.",
    "Goodbye adventurer.",
    "I got bigger problems than letting random adventurers use my anvil right now – if you help me, perhaps I could allow you to work with it then.",
    "Aye, I know about adventuring, young'un.",
    "I fought the Kinshra alongside Kara-Meir, and I accompanied her to the dark lands of Morytania!",
    "You humans are all young to me.",
    "Kara broke the back of the Kinshra's siege and challenged their leader. But the cost was high.",
    "That's a dark story. How could any of us have guessed the truth about Gar'rth?",
    "No, not all adventures end well. Reldo, the Varrock librarian, might be willing to tell you more.",
    "Hello traveller, what brings you to my humble smithy?",
    "Are you sure? Ore I've come across has always been pretty stoic.",
    "Let me see that.",
    "They were trying to target me? Why would someone go to so much effort to try to stop me getting some ore?",
    "Thank you. Glad you're alright.",
    "Well I don't know anything about that one specifically, but I recognise the design – it's a Gofannon amulet.",
    "It's said that it allows you to focus more when training.",
    "It looks a bit damaged at the moment, but let me look at it. I might be able to fix it up once we've finished sorting all this business out.",
    "For now, we should just focus on getting these weapons made.",
    "If you can smith a bronze sword and a bronze dagger, we can use those as samples to get a new order.",
    "You'll have to use the ore you just collected to make these weapons as they need to be high-quality.",
    "Withdraw the ore from the bag and smelt it in the furnace over there, then use my anvil to smith the item.",
    "It has to be this anvil, mind, as it has been designed especially for working this high-quality ore.",
    "Have you made those items yet?",
    "Good. Hurry back.",
    "Not bad, but we'll need to do a bit more to impress the White Knights.",
    "Head to the Artisans' Workshop in Falador and talk to Aksel. He'll be able to finish the weapons for you.",
    "Then, head west from there to Falador Castle and present them to Sir Amik's squire Cerlyn. If he's impressed, you'll be granted an audience with Sir Amik.",
    "The Artisans' Workshop is where many of the finest dwarven smiths reside. You can find the workshop south of here in Falador; it's in the south-east corner of the city.",
    "You'll find squire Cerlyn on the ground floor of Falador Castle.",
    "Be careful on your journey. If you see that dwarf or wizard again, make sure you take care of yourself.",
    "Hello traveller, what brings you to my humble smithy?",
    "Head to the Artisans' Workshop in Falador and talk to Aksel. He'll be able to finish the weapons for you.",
    "The Artisans' Workshop is where many of the finest dwarven smiths reside. You can find the workshop south of here in Falador; it's in the south-east corner of the city.",
    "You'll find squire Cerlyn on the ground floor of Falador Castle.",
    "I got bigger problems than letting random adventurers use my anvil right now – if you help me, perhaps I could allow you to work with it then.",
    "Boric! My son, you've returned.",
    "You? But why?",
    "Son, how could you even think like that? I would never have done that to you.",
    "You had no need to be. When I sent you to Keldagrim, I knew they would teach you more than I could by myself. You've done more than enough to make me proud 100 times over.",
    "How could you?",
    "Who, me?",
    "Not me, couldn't be!",
    "Well, maybe I did... what of it?",
    "When I first held you as a baby, I saw the foundation upon which a strong future could be built. Believe that, if nothing else.",
    "A lovely, tasty mackerel.",
    "I can work an anvil dawn to dusk, but nothing prepared me for the rigours of raising an infant. I didn't sleep for days!",
    "I didn't mean that, don't take it that way.",
    "I'm so sorry, lad. I wanted you to get the best out of life and I never thought to ask what you wanted.",
    "Lad, all I wanted was for you to succeed.",
    "My favourite color is blue. It has a certain quality I feel I can relate to.",
    "I always imagined you heading to Keldagrim, learning the trade there and then setting up your own business and being successful. More successful than me, anyway.",
    "You're right. I should have. I'm sorry, lad.",
    "Life has been hectic but good. I've lived these last few years with no regrets.",
    "That's my boy. I always wanted you to dream big.",
    "You expect me to feel sorry for you? If you'd come home, you wouldn't have had to sleep rough.",
    "You've got it all wrong.",
    "Your favourite toy was a little bear you used to call Terrence. You took him everywhere with you.",
    "Ever since your mother left us, I've had to bring you up alone. I might not have always been the greatest father but I've always had your best interests at heart. I miss her. And I miss you too.",
    "Raising a child alone is no small feat. It took all I had at times.",
    "I didn't mean it like that Boric.",
    "If only you could understand how stupid what you're saying actually is.",
    "I'm so proud of you, son. I knew you'd accomplish great things in life.",
    "If you come home, maybe we could get one.",
    "Sure, anything for my son.",
    "My years in Keldagrim were good, but were filled with fighting; coming here I thought I'd be able to get some peace at last - but even then I only just dodged death when my house was burned down.",
    "Boric, the way you've behaved is utterly reprehensible. I can't even believe you're my son anymore!",
    "I always hoped sending you to Keldagrim would give you new opportunities and ideas beyond those I could offer you.",
    "Trust me – it was done with good intentions.",
    "Boric, I sent you away because I wanted a better life for you. A life beyond what I could offer you here.",
    "Whatever you might think of me, I am your father and I will always be looking out for you.",
    "These last years have had their fair share of good moments. Getting drunk at the Dwarven Mine springs immediately to mind.",
    "Oh Boric, you should see some of the new things I've created. Whole new designs that people have never even dreamed of!",
    "You still sleep with Terrance?",
    "All I ever wanted for you, son, was the best. You'd never have got that if you stayed here.",
    "What were you thinking? If someone had been hurt, their blood would have been on your hands.",
    "Son, please, give me another chance.",
    "Ingrate! To the Abyss with you, then!",
    "No more than I. Bah – c'mere you daft, soppy lad.",
    "I can't thank you enough for what you've done for me.",
    "That's why we've decided we're going to relaunch the business...as 'Doric & Son'.",
    "In fact, we'd like you to come on board as a business partner. What do you say?",
    "Excellent, welcome aboard!",
    "Umm...actually...",
    "Thanks, partner!",
    "Well well, if you change your mind the offer is always open to you.",
    "Don't push your luck.",
    "So, what do you say?",
    "There'll be plenty of work, and where there's work, there'll be rewards for you.",
    "So, what do you say?",
    "Have you made those items yet?",
    "We need two suits of ornamental armour and a shop sign. Also, we need the underground workshop clearing[sic] so we can use it again.",
    "You can get any materials you need from Boric.",
    "Have you made those items yet?",
    "Thanks. Once you've cleared the workshop, come back and talk to me again. Ye ken?",
    "Thank you for all the assistance you've given us. I have something for you as a reward, but first let's get the opening ceremony started.",
    "Have you cleared the workshop?",
    "Well, when you're ready, how about you go downstairs and clear the rocks? Otherwise we'll never be able to open again.",
    "Thank you for all the assistance you've given us. I have something for you as a reward, but first let's get the opening ceremony started."
  ],
  "Player": [
    "Are you okay? What's over?",
    "Calm down and tell me what's happened.",
    "That does sound worrying.",
    "That doesn't seem like a good reason to quit. How many customers do you have left?",
    "How about we make some of your best items and present them to Sir Amik to increase your profile?",
    "Excellent. What can I do?",
    "Seems straightforward enough to me.",
    "Do you have any advice for aspiring adventurers?",
    "Young'un?",
    "I suppose that's true. Tell me more about Kara-Meir and Falador.",
    "What about Morytania?",
    "Tell me more!",
    "Avoid the scorpions, got it!",
    "What is that? It doesn't look too happy to see me.",
    "That's one ore down. I should use the mining sites map to try to find the rest of the ores.",
    "Another ore down! I should head to the next mining site now.",
    "That's all the ore! I should head back to Doric now so he can check them. He said using the Falador lodestone would be a quicker way of getting back.",
    "What's going on there?",
    "I need to return to Doric with this ore to find out what needs doing next.",
    "Doric, the ores were alive!",
    "I saw a wizard casting some kind of spell on the rocks. I also found this diary.",
    "I don't know. Luckily, I managed to get all the ore you wanted.",
    "I'm fine. I also found this amulet. Do you know anything about it?",
    "Thanks. So, what's next?",
    "I'll get on with that now, Doric.",
    "Not yet.",
    "Yes, here they are.",
    "I have all the materials I need already.",
    "He told me to bring them to you so you could 'finish' them.",
    "Sir Amik, actually.",
    "What's an artisan?",
    "Tell me more about yourself.",
    "I've got to go.",
    "Are you Cerlyn?",
    "I have these weapons to present to Sir Amik from Doric.",
    "What? But Doric doesn't have any workers, it must be an imposter. Can you describe them to me?",
    "Stop right there! Sir Amik, this is an imposter. It is I who was sent here by Doric.",
    "I was hired by Doric to get these weapons to you. This dwarf has obviously been going round stealing Doric's orders!",
    "Wait, you're Doric's son?",
    "He's been worried about you since he heard you left Keldagrim and never made it back home!",
    "I think it's about time Boric faces his father and explains his actions.",
    "Boric, you're coming with me.",
    "Do you want me to tell him or will you?",
    "Whoa! Slow it down, let's talk this out quietly and calmly. Maybe then we can resolve whatever issues you both have.",
    "Elementary! You see, I noticed on your fingers not just the dirt that comes from working as a smith but also the fibres that could only have come from a teddy bear.",
    "The fact they are visible means you must regularly sleep with it - and grip it quite tightly at that.",
    "I better try to resolve this quickly. They look like they're starting to lose patience with each other.",
    "Looks like I've just made things a lot worse. Perhaps I should try again when they've cooled down.",
    "It was nothing.",
    "That's brilliant!",
    "So what should a business partner start by doing? Sit back and enjoy the profits while you do all the work?",
    "Okay. I guess I could do that.",
    "Doric, I'm going to help you resolve your issues with Boric.",
    "That's great. So you're sticking around?",
    "I've still got some of them to do...",
    "Not yet.",
    "I've just got to clear the mine now.",
    "So much for being even business partners...",
    "All done!",
    "Not yet.",
    "All clear down there now!"
  ],
  "Dwarf Miner": [
    "Careful down there. If you're not so sure of your combat skills, stay towards the north of the mine. There are scorpions at the south of the mine who have a right nasty sting that can kill."
  ],
  "Concealed dwarf": [
    "Are you sure this will be enough to stop them getting the ore from here?",
    "What? I never wanted you to kill anyone!",
    "Huh? Did you hear something?",
    "No, someone is. Get us out of here quick!",
    "Thank you, sir. Doric will be pleased to hear that.",
    "So we have a deal? You agree to do your business with us?",
    "The old man deserves it. Yes, I've been taking his orders but these weapons were still made by me. They're better than Doric could ever manage.",
    "The name's Boric. I've just returned from Keldagrim and was thinking of setting up shop here.",
    "Oh, you've heard of me? I'm surprised he remembers to talk about me."
  ],
  "Dark Wizard Elijah": [
    "Anyone who triggers the spell will be lucky to make it away alive.",
    "You said you wanted them dealing with.",
    "It's too late now, anyway. Let me get on with it.",
    "I think you're imagining things; there's no one there.",
    "As you wish."
  ],
  "(Smithing": [
    "High quality bronze interface opens.)",
    "High Quality Bronze interface opens.)"
  ],
  "Aksel": [
    "Welcome! Welcome, lad. I'm Aksel, proud artisan and long-suffering inventor. Glad to make your acquaintance.",
    "Welcome. What brings you to the home of the artisans?",
    "And look how beautifully made they are – almost as good as if we had made them here ourselves. So what did Doric want us to do with them?",
    "I would be more than happy to help Doric out. The art of finishing requires a delicate hand and more dedication than that of simply creating a blade.",
    "With Doric's talents and our finish, these blades are fit for a king.",
    "Close enough. You'll want to head to the castle north-west of here and talk to Sir Amik's squire, Cerlyn.",
    "Do you have any more questions before you leave?",
    "Artisans are a collective of skilled smiths who work towards upholding quality as their principle ethos.",
    "Smithing can be seen as a coarse, unloving undertaking...bashing out platebodies as quickly as you can. It's not like that here.",
    "Recently, we've opened our doors to humans. Some of our stauncher members aren't happy about this, but if you work hard I'm sure you'll earn our respect.",
    "I built the furnace that rather dominates this room. Took me four and a half years; carved the rock myself. If you need any pointers on how to use it, talk to Egil.",
    "I don't do much actual smithing any more. I mainly potter around the workshop, helping where I can.",
    "Ah, take care."
  ],
  "Squire Cerlyn": [
    "Can I help you?",
    "Yes, that would be me. Paul Cerlyn is my full name, but everyone tends to just call me Cerlyn.",
    "I'm sorry, I think you've had your time wasted. One of Doric's workers is already here and meeting with Sir Amik as we speak.",
    "He was a dwarf; good moustache; looked like he knew how to handle an anvil. There really isn't much more to say. I didn't see his face that well, he had a cloak on.",
    "If you're sure this isn't one of Doric's workers we'd better interrupt this meeting before Sir Amik agrees to anything.",
    "I'll take those weapons from you. Now let's find Sir Amik."
  ],
  "Sir Amik Varze": [
    "The quality of these blades is excellent.",
    "Yes, Doric is a superb smith I must say.",
    "Of course. I'd be happy to use these weapons in the midst of battle.",
    "What? Who are you?",
    "I will not have the White Knights deal with fraudsters. Now tell me; who are you?",
    "Whoever you are, I do no appreciate being taken for a fool. Adventurer, as it seems you're working with Doric how would you like to deal with this?",
    "I agree; I bid you good day."
  ],
  "Boric": [
    "Ugh... wasnae my idea.",
    "Fine, I'll do it. It was me who was ruining your business and stealing your customers.",
    "The fact that you don't know is proof enough of why you deserved it. You chose to send me away instead of letting me stay here with you.",
    "It's pretty clear I was a disappointment that you didn't want to deal with any more.",
    "Aye, but you did, didn't you? You're a complete let-down.",
    "All I ever wanted was to make you proud. I wanted to study under you and – when you sent me away – I was ashamed.",
    "Thank you father, thank you.",
    "Stealing your precious pickaxe order with Nurmof was pretty funny. It took me so long to convince him, but he finally came around to seeing you as the old fool that you are.",
    "Doric stole the cookie from the cookie jar!",
    "Yes, you!",
    "Actually as you're the only other person who lives here it must have been you.",
    "I – I do believe you, father.",
    "Are we not meant to be resolving our issues, not talking about fish?",
    "So I was too much trouble back then, as well?",
    "Weak. No wonder you sent me away.",
    "I wanted to stay here with you and learn to be a smith here, not by a stranger in Keldagrim. You're the person who I spent my life looking up to.",
    "I felt ashamed. All I ever wanted was to apprentice under you and make you proud, but you seemed more determined to send me off to Keldagrim.",
    "You should have asked what I wanted.",
    "If your plan was to teach me to fight and fend for myself, even in exile and dishonour, then you've done that.",
    "You're no father to me!",
    "I have no idea what this has to do with anything.",
    "What if I wanted to work alongside you, as a family? There's honour in that! If you'd just asked...",
    "Not even about denying me my place here?",
    "It was good; I liked the big city. I've got ideas for how to become an even greater smith than you.",
    "In a way, I suppose you've helped me do that.",
    "Wherever I could find shelter, really. I spent a lot of time sleeping in mines to make sure I could keep up with the orders I was stealing from you.",
    "Always the same - you've got no idea! I've felt like this for years. Even before you kicked me out, you always spoke of sending me away. So much for family.",
    "I don't think so.",
    "As much as I love reminiscing about the past I'm not sure how this is helping.",
    "I miss her too pa. I...suppose you didn't do a terrible job of me.",
    "All you had? Don't you see what the problem is here?",
    "I wanted to teach you a lesson, make you remember that you have a son who still exists. When you sent me away it was pretty clear what your feelings were, you just wanted me gone from your life!",
    "You had plenty of opportunities to change and you never did.",
    "At graduation, I was one of the few in the class to finish with Honours. They said I had done great and could be a master smith in years to come.",
    "It's...it's good to hear you say that.",
    "They're just so cute! I love them!",
    "Really?",
    "I know you've had it tough, father, but you can't blame the past for decisions you made.",
    "Hah! Any excuse - you always wanted me gone!",
    "Well, I guess you just wanted the best for me.",
    "You should have talked to me about it, father. I understand why you did it but I wanted to stay with you.",
    "Aren't you meant to say you missed me?",
    "Are you avoiding the subject on purpose?",
    "What? How do you know about that?",
    "No...maybe...I don't wannae talk about it!",
    "What do you want me to say? It was good, okay? I learned some new techniques and I made some friends.",
    "Aye – I suppose I did alright out of it.",
    "I paid him to disrupt your business, but all he wanted to do was to hurt people.",
    "Well, I guess that's it then. I'm not sure we'll ever get along.",
    "Once again, you've proved yourself a stubborn old fool who refuses to listen. Why do I bother with you? You're not a father!",
    "Oh pa, I've been a fool. Please – forgive me.",
    "It was not! Gods know what I would have done if you hadn't made us talk it out.",
    "Don't worry, father, I've got this. Actually, what we'd like our brand new business partner to do is two very simple tasks.",
    "The first thing we need is more space, and when dwarves need space, they dig.",
    "There are some steps over there. Unfortunately, some rocks are blocking the way. We'd like our new business partner to clear it out.",
    "While you're at it, we also need two suits of ornamental armour for the mannequin bases and a new sign making for the shop front.",
    "Do you want those bars now?",
    "There you go.",
    "You don't have room for all the materials you need, but I can give you these for now.",
    "Okay, just let me know when you want them.",
    "You can bring me here, but I'm still not going to talk to him. Forget it. He's not worth the effort.",
    "Thank you for helping me patch things up with my pa. More exciting than that, though, I have ideas for how to reinvent this business!",
    "Aye. Talk to my father about it and he'll tell you more.",
    "How are you getting on with those tasks we set you?",
    "Okay, so why are you standing here talking to me? Get on with it.",
    "If you've made all the items give them to my pa.",
    "How are you getting on with those tasks we set you?",
    "Okay, so why are you standing here talking to me? Get on with it.",
    "Well done! We're almost ready to reopen. You should talk my[sic] pa as he's arranged an opening party to celebrate."
  ],
  "Congratulations! You have completed": [
    "'What's Mine is Yours' - Complete this quest."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:What%27s_Mine_is_Yours?oldid=36099356’"
  ]
}