{
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "Missing a dialogue branch without the slug, see \"Dialogue missing\"You can discuss this issue on the talk page or edit this page to improve it."
  ],
  "Tiffy": [
    "Jolly good show on getting into the White Knights, what?",
    "Now, how can I help you, young [fellow/mistress]?",
    "Well, now that you are a White Knight we can process your application form correctly.",
    "Already done, old bean! The scales of justice never sleep.",
    "So then, dear [boy/gal]; with that in mind, we have a mission for you.",
    "What? Ah, no actually. We're sending you to Ardougne.",
    "Hmm, what's happening in Ardougne?",
    "No, no, no, nothing happening in Ardougne. However, there is something going on in Witchaven, to the east of Ardougne.",
    "Haw, Haw, Haw, very funny old bean. I need you to report to Col O'Niall in Witchaven. He's a retired Temple Knight, but his clearance is still active. He will be able to fill you in.",
    "Remember to use the Temple Knight code phrase: 'In Falador, the geese fly backwards on Tuesdays'.",
    "Nonsense, my [man/gal], we take our work very seriously. The fate of the world rests in our hands, don't you know.",
    "Oh, I'll need to update your CommOrb with the new mission parameters",
    "Now, is there anything else I can do for you?",
    "Ta-ta for now, old bean!",
    "Greeting, Player. Anything to report?",
    "Good show! That's the spirit.",
    "Greetings, Player. Anything to report?",
    "Nonsense, dear boy, it can't be as bad as all that.",
    "Why don't you relax a little and tell Sir Tiffy what's wrong, hmm?",
    "Hmm, go on.",
    "Oh dear, that is a shame. Please go on.",
    "Ahh, the Mother Mallum. Dear-oh-dear, this isn't good news at all.",
    "Excellent! That should delay her plans somewhat. If she follows the same pattern as last time, the important figures of RuneScape will be her next targets.",
    "I think we are going to have to increase our surveillance somewhat.",
    "Seeing as you already have a familiarity with the sea slugs, I am going to place you personally in charge of this mission.",
    "Of course you are, my boy. Now you will need access to some of the more restricted resources of the Temple Knights.",
    "So with immediate effect, I am promoting you within the Temple Knights. Congratulations!",
    "I only wish it were under better circumstances.",
    "Tish, pashaw and nonsense. It's about time you were rewarded for your work.",
    "Now, with this promotion comes some new responsibilities. In due time you will have access to the Temple Knight headquarters, but for now we need to collate our information and plan ahead.",
    "Report back to me in a little while and I'll have some new tasks for you.",
    "Good lad. Oh and Colonel O'Niall has been placed on our disavowed list. He should be considered extremely dangerous and is to be killed on sight.",
    "Ta ta, old bean."
  ],
  "Player": [
    "The Slug Menace.",
    "Okay...So when can I start doing missions for the Temple Knights, and get some better Temple Knight armour and weapons and stuff?",
    "And how long will that take?",
    "Uh, right.",
    "Really? Great! Am I to be flung to some far off and exotic land to defeat some evil genius?",
    "Ardougne?",
    "I don't know, you were about to tell me.",
    "Are you sure? I mean, you're not a little... senile, maybe?",
    "You know, I'm still not sure this isn't some giant wind up.",
    "Goodbye",
    "Well, see you around, Tiffy.",
    "The Slug Menace.",
    "Hey, Sir Tiffy.",
    "Not yet, sir, but I'm working on it.",
    "Hey, Savant! Good to speak to you again!",
    "Me too. So, do you have anything you can tell me?",
    "Thanks Savant. I know I can count on you.",
    "Excuse me sir, would you be Col. O'Niall?",
    "Player, sir. Sir Tiffy Cashien sent me.",
    "Umm... In Falador the geese fly backwards on Tuesdays?",
    "Uhh. I thought it was a Temple Knight, secret code phrase.",
    "Whelp? I am a full member of the Temple Knights, sir!",
    "Right sir, I mean Colonel.",
    "What's the mission?",
    "Eeew!",
    "What, like surface to air ballistas, intercontinental exploding fireballs and quasi-futuristic henchmen uniforms?",
    "The essential tools for world domination?",
    "That doesn't sound very evil?",
    "Okay, that sounds suspicious. I'll look into it.",
    "Anything else?",
    "Are you sure they're not just getting drunk?",
    "Sure thing.",
    "Tell me about Witchaven",
    "Tell me about Witchaven.",
    "I noticed it's a bit run down.",
    "What happened to it?",
    "That's very sad. However, you can't stand in the way of progress.",
    "Who are the important people in Witchaven?",
    "Who are the important people in Witchaven?",
    "Right, who would that be?",
    "Speak to the Mayor, check.",
    "Brother Maledict, right.",
    "Holgart, oh yes I've spoken to him before.",
    "Will do Col. O'Niall. Thanks for the advice.",
    "That's enough for now.",
    "That's enough for now.",
    "Not yet, but I was wondering if I could ask you some more questions?",
    "So, Savant, what do you think?",
    "Yes, it does look a little unloved. What do you think could be the problem?",
    "Well, that's what Colonel O'Niall suggested. Best get on with it then.",
    "Hello there.",
    "Are you alright?",
    "What happened to you?",
    "I think you'd best go and lie down.",
    "Hello there.",
    "Wow, nice shanty.",
    "Wha...",
    "Who?",
    "How?",
    "Excuse...",
    "Hello there.",
    "Um, not recently.",
    "Hello there.",
    "Are you okay? You seem a bit pre-occupied.",
    "Who is?",
    "Hear who?",
    "What?",
    "Erm... I'll leave you to it then.",
    "What do you mean?",
    "No what?",
    "Which 'it' are you referring to?",
    "What light?",
    "Oh, you mean the sunlight.",
    "Hel...",
    "Than...",
    "You know, that seems like less and less of a good idea.",
    "Good day to you. Would you be the Mayor?",
    "It's certainly very quiet.",
    "I'm here to relax.",
    "I'm here to relax.",
    "I'm just looking around.",
    "I'm just looking around.",
    "I'm here to fish.",
    "I'm here to fish.",
    "Are you alright? You seem a little, hazy.",
    "Really, what are you working on?",
    "Well, um. Yes. Indeed. I'm sure Saradomin would be pleased.",
    "Like I said, I'm here to...",
    "Well, I'm also here to visit a friend, Jake O'Niall.",
    "Err, how did you know my name?",
    "No, no I didn't.",
    "Are you talking about the Fishing Platform?",
    "I thought it took away all the trade?",
    "Hmm, and I thought the village hated the Fishing Platform.",
    "What improvements are you making to the shrine?",
    "How so?",
    "Wow, the whole of Gielinor? I thought it was just some old shrine to Saradomin.",
    "Sounds like a very interesting place. I may have to take a look.",
    "So it's not completed yet?",
    "You know, you really are a strange person.",
    "Do you know you look very ill?",
    "But you've turned a slightly sickly colour.",
    "I've seen food poisoning. People normally don't look like... that.",
    "Well, I hope you get better soon.",
    "Nothing at the moment thanks.",
    "What's up Savant?",
    "No, really? And there was me thinking he was a model citizen.",
    "Sure thing, one moment. (Player scans with Commorb)",
    "But?",
    "Are you sure you're not just reading me?",
    "Hello again, Holgart.",
    "Busy as always. Is everything okay?",
    "Pardon?",
    "What?",
    "Oh my, that's terrible! What happened?",
    "He took your boat?",
    "I'll do that Holgart. I hope you get your boat back soon.",
    "Good day to you, sir.",
    "Player, at yours. How are you?",
    "Really, what's up?",
    "Well that's understandable.",
    "I can see why that would worry you. Do you have any idea why they would not attend?",
    "Well, that would make sense. Hmm, one more thing.",
    "Tell me again, what's worrying you?",
    "What can you tell me about the shrine?",
    "Wow! Now that is old.",
    "You must be pleased that the Mayor is renovating the shrine.",
    "Tell me about the people of Witchaven.",
    "Not anymore?",
    "How so?",
    "Perhaps he thinks the shrine could bring new interest to the village?",
    "Can I ask a question about a penguin?",
    "I just wanted to know if you had seen a giant penguin near here, or if any of your congregation had?",
    "My friend, Larry, was on holiday here and was disturbed by the appearance of a giant penguin in the sea. I was hoping someone else had seen it.",
    "That's enough for now.",
    "Something is definitely very wrong here.",
    "Mayor Hobb has confiscated Holgart's boat and given it to someone else.",
    "As well as this, there's something very... fishy about him.",
    "Yes, Brother Maledict is worried that his congregation is being led astray.",
    "The shrine to the west of the village has been consecrated to Saradomin for centuries.",
    "However, last time he was there, there was a very definite unpleasant feeling in the air.",
    "I was thinking the same thing. I'll get right on it.",
    "That's enough for now.",
    "What's the problem?",
    "I'll get right on it.",
    "Um... So how am I supposed to show him the glyphs?",
    "It's okay Savant. It's dead.",
    "Righty ho Savant. I look forward to your results.",
    "Hey Savant?",
    "What did you think of those doors? Spooky hey?",
    "They did look really out of place. I wonder who put them there.",
    "I only hope that Jorral can translate them.",
    "Thanks for the warning Savant. Speak to you soon.",
    "Translations",
    "Excuse me?",
    "I understand that you are something of a historian?",
    "Great, I was wondering if you could translate something for me please?",
    "Hmm, how much are we talking?",
    "That was a bit longer than I was willing to wait. Can't you fit me in anytime sooner?",
    "Savant?",
    "Um, no. (whispers) Savant, help.",
    "I, err, am working for a wizard who is giving me telepathic instructions.",
    "We have a..",
    "Sorry.",
    "Not you.",
    "Apparently, I'm working for Petmel Books and this document is from them.",
    "Um, I don't appear to have it on me.",
    "What does it say?",
    "Yes, yes I'm sure it's very interesting but what does it say?",
    "The Mavis Merton?",
    "And?",
    "Well, thanks for that. You have been a great help.",
    "Uh, right. Goodbye.",
    "Fantastic, I'm here Savant.",
    "Finally, some solid information.",
    "Now, why doesn't that surprise me?",
    "So what happened?",
    "Great, that means we can free those poor people who have already fallen.",
    "It looks like she's breaking free of that prison.",
    "Did your research reveal how she was trapped in the first place?",
    "Drat, that complicates things.",
    "Righty ho. I'll get to it. Thanks Savant.",
    "So, Savant. Can you tell me about the Mother Mallum again please?",
    "Thanks for the reminder Savant.",
    "Well, hello again, Player. What brings you back out here.",
    "Col. O'Niall, this is worse than we thought.",
    "There is something trapped under the town of Witchaven.",
    "Something the Temple Knights fought in ages past.",
    "Something ancient and very, very evil.",
    "It's called the Mother Mallum and may have some connection to the sea slugs.",
    "I agree, but what can we do about it?",
    "Of course! The temple of Saradomin has had a shrine here for centuries. I'll get right on it.",
    "That's enough for now.",
    "So Maledict.",
    "Uh, Maledict.",
    "Are you feeling alright?",
    "That sounds hauntingly familiar.",
    "I wanted to ask you something about the Shrine to Saradomin.",
    "Well I have discovered a hidden passageway leading to a huge pair of double doors.",
    "And I thought you might know something about what is behind them.",
    "What do you mean, no?",
    "Great! Can I have a look please?",
    "Again with this no business. Why not?",
    "Ah, right, sorry. Would you like me to find them for you?",
    "I'll get right on it.",
    "Frustrating, to be honest.",
    "Well, I'm not sure. Brother Maledict has asked me to find some pages that were torn out of his holy book.",
    "Yes, just like that, but I can't seem to find...",
    ". . . .",
    "Where on RuneScape did you get that?",
    "Strange. Do you mind if I take that?",
    "Thanks very much.",
    "You know, you sound just like the mayor?",
    "You know, you sound just like the mayor?",
    "You look like him as well.",
    "No really, what with the unhealthy skin tone and bulging eyes. The resemblance is uncanny.",
    "I can see why.",
    "Anything's possible I suppose. Wait a minute, you mean you've always looked that odd?",
    "I'm sorry, it's just... Nevermind.",
    "What do you do here?",
    "Interesting. Have you been doing it long?",
    "Wow, that's some lineage.",
    "Hmm, yes well. I'm sure it's all fascinating, but I...",
    "Yawn. Oh, I'm sorry but I really must be getting on. I think my giraffe needs feeding.",
    "Giraffe. Sorry, but he gets cranky without enough sugar. Bye now!",
    "You are a bit too strange for me. Bye.",
    "Jake, I hope you can help me out here.",
    "Well I... Hang on a moment, you're looking a bit sickly.",
    "Oh no. They got to you too, didn't they?",
    "Well, I don't know, but how can I trust you?",
    "That seems a tad convenient.",
    "I'm not so sure that this is a good idea, but yes, I'll take it.",
    "Great, another complication I didn't need. I wonder if swamp paste will do the trick?",
    "What? I'm only trying to glue these pages back together.",
    "So, how do I stick the pages back together?",
    "No problem Savant. I'll snap to it right away.",
    "I understand you can take me to the Fishing Platform.",
    "Arrrgh!",
    "N-No problem. It was just a surprise that's all.",
    "Well, I have something that could help you out.",
    "Well, I have a page that should give me the instructions on how to eliminate what could be the source of the sea slugs.",
    "It's been torn up into three pieces.",
    "I have it on good authority that you may be able to help me out by rendering a dead sea slug down for glue.",
    "Wow! That was good timing wasn't it.",
    "Ah. Um. No, not at the moment.",
    "Yes, here you go.",
    "Thanks very much. I'll get right to work on the parchment.",
    "What? Mayor Hobb.",
    "What's going on?",
    "Ahh, the penny drops. You got me to do your dirty work for you.",
    "And what are they? What are you plans?",
    "So this is the Mother Mallum?",
    "Yes. I have destroyed one of the great evils infesting this world.",
    "Never! I'll never serve you. I shall fight until my last breath before giving in.",
    "Nooooooooo!",
    "Savant! Help me, please, for the love of Saradomin!",
    "Savant!",
    "Savant, now would be a good time!",
    "Phew! Yes, Savant. That was too close for comfort.",
    "Indeed. I'll just get my breath back first.",
    "Sir Tiffy, it's all gone horribly wrong!",
    "The town of Witchaven has been overrun by mind controlling sea slugs!",
    "Well, the Mayor of the town was first, then brother Maledict, and finally Colonel O'Niall.",
    "Well, they tricked me into opening the prison that kept their Queen imprisoned.",
    "Well, it isn't all bad. I did manage to kill the Prince.",
    "That cannot be allowed to happen! What can we do about it?",
    "If you think I'm ready for it, Sir Tiffy.",
    "Wow! I am honoured.",
    "Yes sir, I'll keep my eyes open for any signs of sea slug infiltration.",
    "Right, no problem. Well, I'll see you soon."
  ],
  "Savant": [
    "Player, I am so glad you've been assigned this mission.",
    "Only what is already available through your CommOrb I'm afraid. I'm currently collating a lot of other data pertaining to Witchaven. I'll keep you updated if anything turns up.",
    "Savant out.",
    "Hmm, sounds like Witchaven has some problems at the moment.",
    "I really don't know at this point, Player.",
    "You really need to investigate that area further.",
    "Good luck, Player. Savant out.",
    "Player, hang on a moment.",
    "Something about the way the Mayor is acting is a bit fishy.",
    "There's no need to be sarcastic.",
    "I need to take some readings. Can you scan the Mayor for me please?",
    "Okay, Player, I'm looking at the scan results now.",
    "Hmm, that's odd. He doesn't seem possessed by any spirits and I can detect no residual magic around him.",
    "The CommOrb must need calibrating as I can register two life forms present at his location.",
    "I could have been but I doubt it. Hmm, I'll continue to analyze the results and see what I can come up with.",
    "Savant out.",
    "Player, hang on a second.",
    "The markings on that door look familiar. Can you take a scan for me please?",
    "I thought so. Those glyphs look similar to some ancient Saradomin runes I studied at the academy.",
    "Hmm, I know a man who can translate them for us, just be careful as he's not a member of the Knights.",
    "I have added a transcript of the runes into your pack.",
    "The man you need to see is called Jorral. You can find him in his tower north-west of Ardougne.",
    "Fantastic - I'll get right on it.",
    "Player, come in, this is Savant.",
    "I've detected a sea slug on you. Is everything okay?",
    "Phew. I was very worried there for a moment.",
    "Hmm, I'm going to take a quick scan of the slug and perform some analysis.",
    "Don't worry, there's nothing you need to do. I'll get back to you when I have something.",
    "Yes, Player?",
    "Very, though I can't shake the feeling that I've seen something like that before.",
    "The answer is probably contained within those strange glyphs.",
    "He has a very good track record in translation of ancient runes. Although, to be fair he does tend to get a bit obsessive at times.",
    "Savant out.",
    "Psst, Player.",
    "Drat, I was hoping he wouldn't notice.",
    "Uh. Tell him that you 're working for a wizard who's sending you telepathic instructions.",
    "We have a front company who's keeping Jorral on retainer.",
    "No! Hang on, I wasn't finished.",
    "Can I finish now? Anyway, tell him you are working for Petmel Books.",
    "Player, come in. This is Savant.",
    "That was the final piece of the puzzle I needed.",
    "I've cross-referenced the name Mahey'ish Medron with some other texts and been able to piece together some of the history.",
    "Indeed. It seems this isn't the first time the Temple Knights have run across this Mother Mallum character.",
    "Yes, it seems that centuries ago we discovered that a great evil had taken control of some of the most influential people in the world.",
    "That great evil was the Mother Mallum.",
    "Well, it took the few remaining uncorrupted knights all their wit and strength to devise a method of removing sea slug possession.",
    "Once freed, the Temple Knights pursued a great crusade to destroy the Mother Mallum. Unfortunately, she was too powerful and the best they could do was to trap her inside a mystical prison.",
    "Right, the best thing we can do then is to repair or reenforce it before she escapes.",
    "No, I hit a brick wall after that. We had a dragon crash land on our headquarters a few years ago and the resulting fire destroyed a lot of our records.",
    "I think the best thing you can do is take a look around Witchaven, speak to some of the locals and see if there are any clues to be found.",
    "Don't mention it, Player.",
    "Savant out.",
    "Sure thing, player.",
    "Well, this isn't the first time the Temple Knights have encountered the Mother Mallum.",
    "Centuries ago we discovered that a great evil had taken control of some of the most influential people in the world.",
    "That great evil was the Mother Mallum.",
    "It took the few remaining uncorrupted knights all their wit and strength to devise a method of removing sea slug possession.",
    "Once freed, the Temple Knights pursued a great crusade to destroy the Mother Mallum. Unfortunately she was too powerful and the best they could do was to trap her inside a mystical prison.",
    "Now the best thing we could do is to repair or reinforce it before she escapes.",
    "The best thing you can do is take a look around Witchaven. Speak to some of the locals and see if there are any clues to be found.",
    "Don't mention it, player.",
    "Savant out.",
    "Hello Bailey.",
    "Just looking around.",
    "Well, be very careful out there! Those dratted slugs have been joined by giant lobsters!",
    "Player, stop!",
    "Please don't use oil-rich swamp paste on an ancient parchment. It'll ruin it.",
    "Well, lucky for you, my preliminary sea slug analysis has just finished.",
    "It shows that if you render the slug down, it will form a very sticky glue that will dry clear.",
    "You will need to find someone who has years of experience in aquatic cooking or it could go horribly wrong.",
    "Player, are you there? We've been having a few technical problems...",
    "By the gods! Player I'll get you out of there immediately!",
    "Initiating emergency teleport. (Teleport animation on Player)",
    "She's blocking my magic! One second, I'll try something else. (Teleport animation on Player)",
    "Right, I think I've got it this time. Just one more second. (Mallum moves to attack, and Player teleports away)",
    "Player, are you there?",
    "Player, are you okay? Speak to me!",
    "Thank Saradomin!",
    "I thought we'd lost you there for a moment.",
    "I think you'd better talk to Sir Tiffy about this."
  ],
  "Col. O'Niall": [
    "I might. Who's asking?",
    "And?",
    "What? Are you mad [boy/girl]?",
    "Anything new to report?"
  ],
  "Col O'Niall": [
    "I see Sir Tiffy still has his fun with the Initiates. Sigh, I asked for a Knight and I get a whelp.",
    "Like I said, a whelp. And don't 'Sir' me [boy/girl], I work for a living.",
    "Jake will do fine [boy/girl].",
    "Now what do you want to know.",
    "Well, I started to notice something about three weeks ago.",
    "The Mayor called a meeting of the town council. Nothing too strange about that, in and of itself.",
    "He was acting a bit strange, like he'd taken a blow to the head or something. At the end of the meeting he announces that he's going to be renovating the shrine just west of the town.",
    "Now, I thought that was a bit off since he's about as religious as a dead dog on a termite mound.",
    "Quiet down, I'm talking here.",
    "I could have let that slip, save for the things he's been bringing in.",
    "No, mining equipment.",
    "As well as the mining equipment, he's been bringing in rune essence in large quantities.",
    "Far beyond what's needed for a small village such as this.",
    "Yes, some of the villagers have been disappearing overnight and reappearing the next day in a dazed and confused state.",
    "They could be I suppose, but I'd rather you made sure.",
    "Anything else you need to know?",
    "Well, what's to say. This place is falling apart.",
    "Run down? Hah! This place used to be a bustling hive of industry.",
    "The Fishing Platform happened to it.",
    "When you introduce a large scale operation like the Fishing Platform, it takes away the business from the little guy.",
    "Almost overnight Witchaven became a ghost town.",
    "I'm going to pretend you didn't say that [boy/girl].",
    "Remember, bigger is not always better.",
    "Hmm. There are only three people I recommend speaking to.",
    "Firstly go speak to Mayor Hobb. He was the first to be acting strangely.",
    "As well as that, he isn't looking too healthy.",
    "Next, speak to Brother Maledict at the church.",
    "He speaks to a lot of the villagers and has a good feel for what's going on in town.",
    "Finally, speak to Holgart the fisherman. I haven't seen him sailing in a while. That is definitely a bit off.",
    "That covers about everyone, but don't just limit yourself to those three. Others may have some insight into what's been happening.",
    "Stay sharp [boy/girl].",
    "So [boy/girl], what have you learned?",
    "Hmm, fishy you say. Anything else?",
    "Did he say anything more?",
    "Sounds like this shrine needs a thorough investigation.",
    "I recommend taking a good look down there - see if anything is amiss.",
    "Anything else I can do for you?",
    "Stay sharp [boy/girl].",
    "I doubt that, but go on.",
    "That's an awful big something [boy/girl].",
    "Care to be more specific?",
    "Hmm, it can't be a coincidence that the Mayor is 'renovating' the shrine. He must be preparing to break the Mother Mallum free.",
    "Hmm, it might be worth speaking to that priest of Saradomin.",
    "See if he's got any more light to shed on this.",
    "Stay sharp [boy/girl].",
    "Player, there you are.",
    "Perhaps. What is it that you need.",
    "Are you sure this is not some elaborate deception on my part, to fool them?",
    "Because you seek the last page of Maledict's holy book. It is right here for you.",
    "Perhaps, but at the end of the day it is what you need. Do you want it or not?",
    "Well you'll need to free up space for three items in your backpack first.",
    "It has been torn into three pieces. You will need to stick them back together before you can use them.",
    "Don't mention it."
  ],
  "Witchaven villager": [
    "Huh? Oh, hello.",
    "Uh? No... I, Uh, don't feel so good.",
    "Hmm? Oh... I, Uh, don't remember.",
    "What? Oh. Right. Yes.",
    "We're going away to leave you now. Goodbye, fare thee well. Goodbye, fare thee well. We're going away to leave you now. Hoorah, me boys, we're homeward bound.",
    "Aye lad, it's not bad.",
    "What is happening to the people in this town?",
    "I mean, why are people acting so strange?",
    "People I've known for years are acting like they've never met me.",
    "I think something bad is about to happen.",
    "I'm sorry, I'm too afraid to speak right now. Goodbye.",
    "Have you seen a group of lads around here?",
    "That's strange; we are supposed to be helping the Mayor. today. Ah well, never mind. I'm sure I'll find them soon.",
    "Hmm? Oh, hello there.",
    "It's nothing stranger. No need to concern yourself.",
    "She is close now... so close.",
    "So close I can almost hear her.",
    "...",
    "The family grows...",
    "Soon we will all be together...",
    "Are you with us?",
    "No.",
    "You are not with us.",
    "Can you see it?",
    "The light, the hot bright light.",
    "It is all around us. Scalding, burning, blinding light.",
    "Sunlight...",
    "Well, hello there...",
    "Welcome to our little village.",
    "Pray, stay a while."
  ],
  "Jeb": [
    "You are not part of us. Leave us alone.",
    "Yes, we can do that. Board the boat and we shall depart."
  ],
  "Mayor Hobb": [
    "Well hello there; welcome to our little village. Pray, stay a while.",
    "Indeed. Mayor Eustace Hobb, in fact. Do you like our home?",
    "Yes, quiet and undisturbed. Just how we like it.",
    "Tell me, what brings you to Witchaven?",
    "That's good, yes, that's good. Witchaven is a nice quiet village - very relaxing, good fishing.",
    "It's nothing, I'm just a little tired at the moment. So much work, so much to do.",
    "To the West, the shrine needs... work, yes work. Things must be made better.",
    "Saradomin... Why are you really here?",
    "Are you sure that's the only reason you are here, Player?",
    "Ahh, then this all makes sense. Yes, this is very good.",
    "You told me when you came in.",
    "It does not matter. One of my... villagers, must have mentioned that you are here.",
    "Is there anything else you need to know?",
    "The land has seen much sorrow, much loss.",
    "Fishing Platform? Oh yes, that. No. The platform will do much for this place.",
    "The platform heralds a new beginning for Witchaven, undreamed of by those that built it.",
    "This is true, but it has brought us so much more in return, so much more.",
    "It was... a necessary step.",
    "Is there anything else you need to know?",
    "Ahh, the shrine - the future, our destiny, our heritage.",
    "That which the shrine holds can unlock a new path for all the village of Witchaven. And in time the whole of Gielinor.",
    "The history of that shrine should not be overlooked. It is ancient beyond your knowledge and much that shaped our history is contained within its walls.",
    "There is much to be done before it is opened.",
    "When you are ready, it may be that you will be unable to keep yourself away.",
    "Is there anything else you need to know?",
    "Ill? No, merely tired.",
    "A touch of food poisoning perhaps.",
    "This has been known to turn the face and give the impression of severe illness.",
    "Time is all that is needed. Yes, time to...get better.",
    "Soon, all will be well again. Have no fear.",
    "Is there anything else you need to know?",
    "Then please feel free to stay in our village a while longer. Farewell.",
    "Welcome to the family, Brother Maledict.",
    "Ah, so good of you to finally join us Player. To be honest, I never thought you'd make it this far.",
    "Oh come now Player. Surely you are smart enough to know when you've been played for a fool?",
    "Indeed. The enchantment placed upon this door by the Temple Knights prevented anyone not working in their interests from opening it.",
    "With your superb timing, our plans have been advanced quicker than even we could have anticipated.",
    "You'd really like to know? Well, it seems the least I can do for you after all your hard work.",
    "Behold, the beauteous visage of our beloved Prince.",
    "Mwahahaha... Fool. No, this is not our Great Mother, though I sincerely wish you had the chance to gaze upon her",
    "Sadly for you, this will be the last thing you ever see",
    "Fool! The queen will not see the likes of you!",
    "No! Do you realize what you have done?",
    "You fool! Do you think it would be so easy? The Prince will be reborn in all his glory!",
    "Now you face the true wrath of the Mother Mallum!",
    "By your command, my queen. (Mayor Hobb teleports)"
  ],
  "​Player": [
    "What can you tell me about Witchaven?"
  ],
  "Holgart": [
    "Well, hello again m'hearty. How're yer fare?",
    "'Fraid not [lad/lass]. I've been washed up and left to dry.",
    "Scuppered I am, keelhauled and bottomed out.",
    "I'm destitute. I can sail no more.",
    "About two weeks ago, I was hauled up in front of the Mayor and he tells me I've broken his new 'Articles of sailing'.",
    "He tells me that under his new laws my boat is forfeit.",
    "Aye. The Mayor has given it to Jeb Wormwood. He is running the boat to the Fishing Platform now.",
    "Speaking of which, since you were last there it's got a might bit stranger. You really should take a look.",
    "Aye. Fare thee well.",
    "I don't know what to do without my boat."
  ],
  "Maledict": [
    "And a good day to you my [son/daughter].",
    "I am Brother Maledict, at your service",
    "Well, to be perfectly honest with you, I am a little concerned.",
    "It's my congregation. They seem to be drifting away from me.",
    "With all the hardships this small village has endured in the past few years, the people of Witchaven have never needed the solace of Saradomin more.",
    "Yes indeed. However, less and less people have been attending my services lately.",
    "The only thing I can think of, is that the Mayor has asked them to help improve the shrine.",
    "Ah yes, one of the wonders of Witchaven. That particular shrine has existed since before Witchaven was even founded.",
    "Over one hundred and fifty years old in fact.",
    "The role I now fulfill was originally given to one of the Temple Guardians, but in time that has been delegated to one of the ordained, such as myself.",
    "The shrine was abandoned when the village came into being. Since then it has fallen into disrepair and the other less savoury elements have moved in.",
    "Well yes, it came as something of a pleasant shock. I only hope he will let me visit it soon.",
    "He wants me to wait until it's ready to unveil.",
    "Anything else I can help you with?",
    "Ah, the people of Witchaven are the salt of the earth. Hardworking and very generous. Well, usually that is.",
    "Oh, most of them certainly. It's just that something has changed over the past few weeks.",
    "It's nothing I can put my finger on. My flock aren't exactly unfriendly anymore, just different.",
    "Well, they used to be very rigorous in attending my services. Now they seem almost apathetic.",
    "They wander around the village in a listless state, everyone except the mayor that is.",
    "Since the opening of the Fishing Platform he was a man beset by worries. The only thing that occupied his mind was how to rescue his village from financial collapse.",
    "Ordinarily, I would welcome his new found drive and energy, especially as it is directed towards renovating the shrine.",
    "I'm not sure but something about him has me worried",
    "Perhaps. Maybe I'm being a little paranoid. I'll give it some thought.",
    "In the meantime, is there anything else I can help you with?",
    "A…a penguin? I suppose, yes, ask away.",
    "Saradomin protect us! I have not seen anything of the kind, and I hope never to. I think I'd like to be alone now, if you don't mind.",
    "Peace be with you child.",
    ". . . . .",
    "Hmm. Oh, yes. We are Maledict.",
    "It's nothing, just a little tired at the moment. So much work, so much to do.",
    "Was there something you wanted?",
    "Yes?",
    "And?",
    "Ahh. Right. No.",
    "Most of the history of the shrine is contained within the holy book of Saradomin. We have yet to read that portion of the text.",
    "No.",
    "Because the three pages pertaining to the shrine's history have been stolen.",
    "It is imperative that you find them.",
    "Peace be with you.",
    "The joy of family are not to be underestimated child."
  ],
  "Jorral": [
    "Yes, can I help you?",
    "Hah! I am the foremost historian in the world.",
    "Possibly, I am very busy you see and my services don't come cheap.",
    "Well, I am very busy, but I could fit you in sometime next month.",
    "I'm afraid not. You see, I have this ongoing series of texts that need to be catalogued as soon as possible.",
    "What?",
    "Excuse me, but are you talking to your backpack?",
    "Riiiight. Okay. What does this err, voice, want you to do?",
    "Pardon?",
    "Oh, right! That explains the mild insanity. No problem; hand over the document and I'll have a look.",
    "Well, run along and fetch it then.",
    "Hmm. Interesting, very interesting.",
    "It's an early variation on a script used by the priests of Saradomin a long time ago.",
    "Look, you can see how the sentence structure and grammar evolved from the...",
    "Hmph. It seems this text pertains to a great battle between the temple of Saradomin and something called the Mahey'ish Medron.",
    "Mahey'sh Medron. I think it's a corruption of an even earlier language and actually refers to something called Mother Mallum.",
    "Well, there isn't a whole lot more. They managed to trap the Mother Mallum behind a mystical prison where she was to wait for all time.",
    "Any time. I recommend a doctor for those voices, though."
  ],
  "Ezekial": [
    "Hello again, Player. How are things?",
    "Sorry to hear that.",
    "Is there any way I can help?",
    "What, like this?",
    "Someone pushed it under my door just before you arrived. I went outside to see who it was but they'd already gone by the time I got there.",
    "Sure, here you go.",
    "Glad I could be of service. Anything else you need?",
    "Really? That's the nicest thing anyone has ever said.",
    "I admire him a great deal. He works so hard for this town.",
    "Hmm, I don't think I do.",
    "Well, I haven't spoken to him in a while. I don't get out much.",
    "Maybe the Mayor has finally seen how much I admire him and has grown to admire me?",
    "Hey, I resent that!",
    "I supply the local fishermen with the tools and bait they need to do their jobs.",
    "Why yes, all of my life. I took over from my father, who inherited the business from his father and so on.",
    "In fact, there have been Lovecraft's selling bait for over ten generations.",
    "Oh yes, we have a long and interesting family history. For one reason or another the Lovecraft's have always been bait sellers or writers.",
    "Oh very, very fascinating, for instance my great grandfather Howard...",
    "Your?",
    "Oh right, goodbye.",
    "Sniff. Yes, everyone says that."
  ],
  "Bailey": [
    "Waaaaah!",
    "Oh, sorry, Player. I thought you were one of those fishermen.",
    "Well, I am scared half to death out here.",
    "Really, great!",
    "What is it?",
    "Then why haven't you used it?",
    "Well, you are in luck. I had been cooking a new batch of gumbo for my dinner. However, I've let it cook too long and it's become very think and sticky.",
    "It should make the perfect base for your glue.",
    "Uncanny really.",
    "Do you have a dead sea slug I can use?",
    "Well, get back to me when you have.",
    "Right, I'll get cooking.",
    "Right, there you go.",
    "That should do the trick.",
    "Good luck."
  ],
  "Mother Mallum": [
    "Calm yourself, my child. We anticipated this eventuality. Go now and prepare the throne for our arrival",
    "So then, Player, it is just us. What shall we do with you?",
    "Your mind is like an open book to us. Your very essence laid bare before our sight.",
    "You have great potential, Player. We should destroy you now, lest you interfere with our plans further.",
    "Or we could take you whole and make you an extension of our will.",
    "After millennia, this husk is almost spent and requires replacement. Yes, you will make an excellent host.",
    "Yes, that's it, fight, fight with all your heart.",
    "It's always so much sweeter when they resist us."
  ],
  "Mallum": [
    "Come with us, Player. Come and be with us for all eternity. (Teleport animation on Player)",
    "Ahh, Player, it is useless to resist.",
    "Now we shall become as one."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:The_Slug_Menace?oldid=33428395’"
  ]
}