{
  "Player": [
    "Hello.",
    "I'm afraid I'm in a rush.",
    "How can I help?",
    "I could go and take a look for you if you like?",
    "I'm afraid not, but I'm sure he hasn't gone far.",
    "Hello son, are you okay? You need help?",
    "Your mum sent me to find you.",
    "Where is this treasure you talk of?",
    "Maybe I could help.",
    "So you're still here.",
    "I'll find that treasure soon, just you wait and see.",
    "Hello son, are you okay? You need help?",
    "Your mum sent me to find you.",
    "Where is this treasure you talk of?",
    "Maybe I could help.",
    "Ok, I'll leave you to it.",
    "Hello again.",
    "And miss all the fun!",
    "Why's that?",
    "Well, I wouldn't count on it.",
    "Neither is life, kid.",
    "Hello again.",
    "I saw Hudon by the river but he refused to come back with me.",
    "Any ideas on what I could do while I'm here?",
    "Hello again.",
    "I'll make sure it goes to a good cause.",
    "Hello there.",
    "It is quite pretty.",
    "Can you tell me what happened to the elf king?",
    "What happened to him?",
    "Where else is worth visiting around here?",
    "Who was queen Glarial?",
    "That's sad.",
    "Is there treasure under the waterfall?",
    "Thanks then, goodbye.",
    "Hello there.",
    "Hello Almera.",
    "Oh, I'm just sight seeing.",
    "Thanks Almera.",
    "Hello, is your name Golrie?",
    "Do you mind if I have a look?",
    "Could I take this old pebble?",
    "OK... Take care Golrie.",
    "Ouch!"
  ],
  "Almera": [
    "Ah, hello there. Nice to see an outsider for a change, are you busy? I have a problem.",
    "Oh okay, never mind.",
    "It's my son Hudon, he's always getting into trouble, the boy's convinced there's hidden treasure in the river and I'm worried about his safety, the poor lad can't even swim.",
    "Would you? You are kind. You can use the small raft out back if you wish, do be careful, the current down stream is very strong.",
    "Hello brave adventurer, have you seen my boy yet?",
    "I do hope so, you can't be too careful these days.",
    "Well hello, you're still around then.",
    "Yes he told me, the foolish lad came in drenched to the bone, he had fallen into the waterfall, lucky he wasn't killed! Now he can spend the rest of the summer in his room.",
    "Why don't you visit the tourist centre south of the waterfall?",
    "Hello adventurer, how's your treasure hunt going?",
    "No adventurer stays this long just to sight see. But your business is yours alone, if you need to use the raft go ahead. But please try not to crash it this time!"
  ],
  "Hudon": [
    "It looks like you need the help.",
    "Don't play nice with me, I know you're looking for the treasure too.",
    "Just because I'm small doesn't mean I'm dumb! If I told you, you would take it all for yourself.",
    "I'm fine alone.",
    "Don't play nice with me, I know you're looking for the treasure too.",
    "I'll go home when I've found the treasure. I'm going to be a rich rich man.",
    "Just because I'm small doesn't mean I'm dumb! If I told you, you would take it all for yourself.",
    "I'm fine alone.",
    "Not you still, why don't you give up?",
    "You do understand that anything you find you have to share with me.",
    "Because I told you about the treasure.",
    "That's not fair.",
    "You stole my treasure. I saw you!",
    "Hmmmm!"
  ],
  "Hadley": [
    "Are you on holiday? If so you've come to the right place. I'm Hadley the tourist guide, anything you need to know just ask me we have some of the most unspoilt wildlife and scenery in Gielinor. People come from miles around to fish in the clear lakes or to wander the beautiful hillsides.",
    "Surely pretty is an understatement kind [Sir/Ma'am]. Beautiful, amazing or possibly life-changing would be some suitable wording. Have you seen the Baxtorian waterfall? Named after the elf king who was buried beneath.",
    "There are many myths about Baxtorian. One popular story is that after defending his kingdom against the invading dark forces from the west, Baxtorian returned to find his wife Glarial had been captured by the enemy! This destroyed Baxtorian, after years of searching he became a recluse. In the secret home he had made for Glarial under the waterfall, he never cae out and it is told that only Glarial could enter.",
    "Oh, I don't know. I believe we have some pages on him upstairs in our archives. If you wish to look at them please be careful, they're all pretty delicate.",
    "There is a lovely spot for a picnic on the hill to the north east, there lies a monument to the deceased elven queen Glarial. It really is quite pretty.",
    "Baxtorian's wife, the only person who could also enter the waterfall. She was queen when this land was inhabited by elven kind. Glarial was kidnapped while Baxtorian was away, but they eventually recovered her body and brought her home to rest.",
    "True, I believe there's some information about her upstairs, if you look at them please be careful.",
    "Ha ha... Another treasure hunter. Well if there is no one's been able to get to it. They've been searching that river for decades, all to no avail.",
    "Enjoy your visit.",
    "I hope you're enjoying your stay, there should be lots of useful information in that book: places to go, people to see."
  ],
  "Golrie": [
    "That's me. I've been stuck in here for weeks, those goblins are trying to steal my family's heirlooms. My granddad gave me all sorts of old junk.",
    "No, of course not.",
    "Oh that, yes you have it, it's just some old elven junk I believe.",
    "Thanks a lot for the key traveller. I think I'll wait in here until those goblins get bored and leave."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Waterfall_Quest?oldid=32035330’"
  ]
}