{
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "Some dialogue branches need filling out.You can discuss this issue on the talk page or edit this page to improve it."
  ],
  "Lazim": [
    "Ah, an adventurer. Could you spare some of your time to help me?",
    "It's a sorry tale. I was once an accomplished sculptor, you see. I made statues for the kings, queens and rulers of Gielinor. But then there was the accident... After that, I could never hold a chisel again. But I have been struck by my muse while travelling the desert, and want nothing more than to build a statue in this area. The desert's plain and full of sand, and needs more decoration.",
    "As I said, I can't hold a chisel, but I can guide you in crafting the statue for me. I'd need you to quarry the stone for it, as well. Well, will you help me with my art?",
    "Excellent.",
    "There is a stone quarry nearby; I require several blocks of sandstone in order to make the statue. Each of these blocks should be around... well, let's say thirty two kilograms for the first one.",
    "Well, then, bring me enough smaller blocks to make thirty two kilograms, and I will deal with it.",
    "From what the last adventurer told me, there are tiny blocks that weigh 1 kg, small blocks that weigh 2 kg, and medium-sized blocks that weigh 5 kg. There are also large blocks that weigh 10 kg, but I doubt a weedy adventurer like you could even carry one, let alone mine one cleanly. Apparently, the more skilled you are at mining, the larger the blocks you can chip off the rock.",
    "All true art requires work.",
    "Well, hand it over, then. I need 32 kg more stone to make the base. Do you have any more stone you want to offload onto me?",
    "Thank you, adventurer. I'm now carrying <?> kg of your inexpertly-quarried stone./That makes <?> kg I'm carrying now. I need <?> kg more stone to make the base. Do you have any more stone you want to offload onto me?",
    "Oh, joy, I'm sure I'll treasure it. I'm now carrying <?> kg of your inexpertly-quarried stone./That makes <?> kg I'm carrying now. I need <?> kg more stone to make the base. Do you have any more stone you want to offload onto me?",
    "So generous of you, adventurer. I'm now carrying <?> kg of your inexpertly-quarried stone./That makes <?> kg I'm carrying now. I need <?> kg more stone to make the base. Do you have any more stone you want to offload onto me?",
    "Either you've been splitting stone into smaller blocks, or you're worse at quarrying stone than I expected. I'm now carrying <?> kg of your inexpertly-quarried stone./That makes <?> kg I'm carrying now. I need <?> kg more stone to make the base. Do you have any more stone you want to offload onto me?",
    "Because, adventurer, I'm not going to carry more of your blocks than I absolutely must. If your blocks are too big, break them with a chisel or a pick.",
    "That's enough for the base of the statue, certainly. Here you are, adventurer. Now, use a chisel to craft it into a base for the statue.",
    "Oh, stop whining. The last adventurer who helped me was carrying around a girl in a barrel. Zamorak only knows why, but he didn't complain.",
    "Excellent. Now, just put it on the flat ground next to me.",
    "Hmph. Well, the base of the statue is done, but it needs a body. Twenty kilograms should be enough for you to make it.",
    "That should be enough to use for the statue's body. All you have to do with it, adventurer, is chisel it into the body of the statue.",
    "Very nice, adventurer. You're supposed to make it into the statue's body. Get your chisel ready and start working.",
    "Well done, adventurer. Not as dense as you look. Go on, add it to the base of the statue.",
    "You utter incompetent! Have you added the body to the statue yet?",
    "Hmm, then perhaps I'm still missing something...",
    "Oh, I don't know, adventurer. Go and chisel the statue a bit more, or something.",
    "It shouldn't have taken this long... did I miscalculate? Ah, adventurer. As you can see, the statue is nearly complete. All it needs is a head. The head should be made out of granite, which you can find in that quarry nearby. As for whose head... well, perhaps I'll let you impose your own artistic vision on it. Whose head do you think should be on the statue?",
    "Are you mad? You'd start carving it, then you'd take a helmet off or change your hairstyle, and nobody would know who on Gielinor it was supposed to be! Statues are far more permanent than you adventurers and your fashions.",
    "No. Now choose something sensible.",
    "Why, that's very generous of you, adventurer. Are you hoping for a bigger reward for saying that?",
    "Wonderful. Well, at least you have me here for reference. Now, go and find a suitable block of granite and make that head. And do try to remember which one it is you're carving.",
    "I see... And which god were you thinking of? There's very little reference material here in the desert.",
    "Well, some of the people in the desert worship a god called Icthlarin. Or, if you prefer, I'm sure you could sculpt Zamorak instead.",
    "Ah, an excellent choice. Now you should find a suitable block of granite, and make that head. Try to remember which head you've decided to carve - I know you adventurers. Memories like fishing nets.",
    "An interesting choice - I'm sure there's some reference material you can use around here. Find a suitable block of granite, and get carving. And make sure to remember which one you're supposed to be carving. I've known some of you adventurers to forget things you were told three seconds ago.",
    "A human statue with a camel's head? Is there any particular reason?",
    "Well, it is appropriate, all things considered... Very well, it'll work well in a desert setting. Now, find a suitable block of granite, and carve that head. Make sure you remember which head you're carving. The last adventurer who tried to help me forgot half-way through carving, and produced the strangest mixture of camel and human I've ever seen.",
    "Keldagrim? Hmph. Technically good sculptors, the dwarves, but they have no sense of art.",
    "I'm sure that none of them would even think of travelling to the desert and building a statue here.",
    "Do you even remember what it looked like?",
    "Then no, you can't. Now, choose something else.",
    "Well, adventurer, get on with crafting that granite head for me. Or do you want to change the one you've chosen?",
    "Your faith in yourself is impressive... and somewhat misguided. You're planning to carve [Choice of head]'s head for the statue, remember that.",
    "Well, which will you choose this time?",
    "Excellent. That medium-sized block you have there should be perfect. Just craft it into the correct head.",
    "Hold it! I know you adventurers. I bet you've managed to use the wrong head, or something like that.",
    "I don't care if you think you know what you're doing. Let me have a look at that head.",
    "You said you'd make the statue's head look like <?>. Hmm. You're not a particularly good sculptor, adventurer, but at least it's recognisable.",
    "Ah, excellent, it's all gone as planned.",
    "Of course we did! That's why I had you build the statue.",
    "Oh, nothing. No treasure here. No priceless artefacts from the lost ages of Gielinor, or anything like that.",
    "Wait! If you help me, then... I'll give you a share of whatever we find.",
    "At the top of the temple. We've fallen through to the very bottom, so you'll have to climb up to the next floor.",
    "The stories I've heard say there are odd doors in this temple, that have locks that don't need keys, but... rather large limbs.",
    "You can use your chisel or your pick to take them from the statue. They should be the right size. Be thankful they're the statue's limbs and not yours, adventurer.",
    "Of course not! I'm not a carnival conjurer. Adversity builds character, adventurer. Heft them around by yourself.",
    "Oh, okay.",
    "Ah, it fell off when the statue dropped through the ceiling. I've been keeping it safe since then. Try not to lose it, adventurer.",
    "...You're carrying it, adventurer. Been at the Asgarnian Ale a little too much, have we?",
    "You didn't get far from here before you mislaid it. This time, try not to drop it.",
    "What pedestal?",
    "Really? Did it have some sort of recess on the top?",
    "Hmm. Intriguing, adventurer. Perhaps you should find out what shape the recess is, so you can sculpt something that will fit in it.",
    "Adventurer, I know more about this temple than you do. All you need to do is make a mould of the recess somehow, then use it as a guide to make another head. It should be made from the same granite as the statue's head was.",
    "Well done unlocking those doors, adventurer. Did you have any problems?",
    "Those are some of the traps to keep people away from this temple. Thankfully, they didn't send you mad this time.",
    "No, there is another floor above this. You have to go up a ladder in the room to the north.",
    "There's a magic barrier in the way. And right now, it won't let anything through.",
    "No, but I suspect the other rooms on this floor have magical properties. If you solve all the puzzles they present, then...",
    "Oh, it'll be quite obvious. The globes on the pedestal here will also light when you've solved the room they correspond to.",
    "The treasure's up ahead, adventurer. Be careful of the traps.",
    "Oh, I don't know. Perhaps, say, huge skeletons that'll tear your arms and legs off?",
    "Nothing, adventurer, nothing. You just trot along and get that treasure, now.",
    "Well, adventurer, do you have the treasure yet?",
    "None at all?",
    "Ah ha! So, it's not attacking you? Well done, adventurer. Your second brain cell must be working overtime today.",
    "Well, thank you, adventurer. You've just deprived me of a wonderful chance to learn from one of Zamorak's first followers.",
    "You utter imbecile! Did you think I was looking for gold?",
    "I want knowledge!",
    "'Sorry' won't bring those Mahjarrat back.",
    "*sigh* I might as well stay to study this temple. It has some interesting magical properties.",
    "Well...",
    "I'm sure I've dropped hints the size of Varrock, but you might not have noticed. I'm a Zamorakian mage.",
    "If you really want to learn my spells, you'll have to dedicate yourself to Zamorak.",
    "Then you won't be learning any of my spells. Ha ha ha ha!",
    "What did you expect from a Zamorakian mage?",
    "...You really thought I would teach you my secrets just like that?",
    "Ha ha ha! You are a naive fool.",
    "I'm a mage of Zamorak, after all. What else do you expect?",
    "How are you and your defective brain doing nowadays, adventurer?",
    "I'm not very nice. If you want to see who ruined all of my plans, adventurer, just look in a mirror."
  ],
  "Player": [
    "Why, what's the matter?",
    "So, what would you need my help with?",
    "Of course! You'll have to explain it to me as you go along, but count me in.",
    "What should I be doing to make your statue?",
    "I can't mine a block that big!",
    "So how much do different blocks of sandstone weigh?",
    "Okay, I'll get on with it.",
    "I don't know, that sounds like a lot of work.",
    "I have some sandstone for you!",
    "Yes, I have more stone.",
    "Here's a large 10 kg block.",
    "Here's a medium 5 kg block.",
    "Here's a small 2 kg block.",
    "Here's a tiny 1 kg block.",
    "Why won't you take more than 32 kg of stone?",
    "No, that's all for now.",
    "How am I supposed to carry that? It's huge!",
    "I've made the base of the statue!",
    "What do you want me to do now?",
    "I have this large block of sandstone you gave me.",
    "I've made the statue's body!",
    "Of course I have!",
    "What do you want me to do next?",
    "Okay then.",
    "I think it should have my head!",
    "So I can't put my head on the statue?",
    "I think it should have your head.",
    "After all, it's your statue.",
    "Er, maybe.",
    "I think it should have a god's head.",
    "That's true. Whose head do you think I should make?",
    "I'll use Zamorak's head for the statue.",
    "I'll use Icthlarin's head for the statue.",
    "I think it should have a camel's head.",
    "Er, no. I just thought it would be funny.",
    "You know, I've done something like this before...",
    "I had to help rebuild a statue in the city of Keldagrim, and then choose whose head should be placed on the top!",
    "Can I use the head I chose for that statue on yours?",
    "Er... no.",
    "No, I'll stay with the one I chose first.",
    "Yes, I'd like to change my choice.",
    "I've got some stone for the statue's head!",
    "I know what I'm doing, honest...",
    "Fine, fine...",
    "What's going on?",
    "Ow!",
    "Ouch!",
    "Argh, my duodenum!",
    "Ow... Lazim has some explaining to do!",
    "Gone as planned? We just fell through the ground into some weird temple!",
    "I don't think you really are a sculptor. What are you looking for in this temple?",
    "I'll be leaving, then.",
    "That sounds better. So, where's the treasure?",
    "That's good, but... How do I get further into the temple?",
    "Yuck!",
    "Could you make these stone limbs easier to carry?",
    "They're really heavy, and they weigh me down.",
    "Do you know where the statue's head is?",
    "Can you help me with this pedestal I've found?",
    "It's on the floor above this. It looks sort of important.",
    "Yes, and I tried using the statue's head with it... ...but it didn't fit properly.",
    "Are you sure that will work?",
    "Ow, not another headache...",
    "I saw some really strange visions. Everything went grey...",
    "That doesn't sound good. So, are we at the top of the temple now?",
    "Hah, that's easy. Treasure, here I come!",
    "Oh... is there any other way to get upstairs?",
    "How will I know when I've solved them?",
    "What?",
    "I, er... what? I have no idea what you're talking about, but I'm just as human as you are.",
    "Look, I'm not going to hurt you!",
    "I've got some food you can have. It's quite tasty.",
    "(alternative) Here, try this. It should fill you up.",
    "Are you feeling better now?",
    "Tell me about the room with the fountain.",
    "Tell me about the room with the furnace.",
    "Tell me about the dark room.",
    "It's okay, I don't need any help.",
    "What traps?",
    "What?",
    "Why, what's wrong?",
    "Who's trapped you in this form?",
    "Yes, I understand, but who is 'she'?",
    "Of course, I'll help you out. But first of all, do you have any treasure? I, er, was just wondering...",
    "That's good enough for me. What do I have to do?",
    "About this wall...",
    "Where do I get the stone?",
    "How do I build the wall?",
    "How long will it take?",
    "Could you tell me more about Enakhra?",
    "Could you tell me more about yourself?",
    "Okay, I'll start building.",
    "(Transcript missing. edit)",
    "What do you mean?",
    "If you're talking about Akthanakos, then yes!",
    "Er, no. But if you hate him so much, I suppose he doesn't support Zamorak...",
    "Who?",
    "But you said 'Zamorak' first!",
    "Okay...",
    "There doesn't seem to be any treasure there.",
    "Hmm... the big skeleton promised to give me something if I helped him.",
    "The wall's finally built!",
    "Wow. Er, what does it do?",
    "What? What about that treasure you were looking for?",
    "Um... sorry.",
    "Ooh, you're a mage? Can you teach me any spells?",
    "I couldn't do that!",
    "You're not very nice, are you?",
    "Sure, sign me up!",
    "That's not very nice of you.",
    "Hey! That's not very nice.",
    "Suit yourself. At least I got a nice amulet for my trouble."
  ],
  "Enakhra": [
    "At last, it's complete. A temple fit for my lord.",
    "Surely this would make a good weapon...",
    "No, no! Curse it, that doesn't work!",
    "I wish I'd never supported him.",
    "Of course.",
    "Heh heh heh...",
    "You will never have this temple - it belongs to my lord!",
    "Ah ha ha ha ha!",
    "But it's still a nice temple, isn't it?",
    "Ha ha ha. You believed me, didn't you? I would never desert my lord!",
    "(Transcript missing. edit)",
    "I'm keeping a weapon under control. If my attention wavers...",
    "...then it tries to escape me. I must keep it safe for my lord Zamorak.",
    "So, you're determined to meddle in other people's business?",
    "That weapon has suddenly become a lot harder to control.",
    "And I know it's your doing. He's tried to get you to help, hasn't he?",
    "Of course, I don't suppose he's told you who he's trying to support, has he?",
    "How dare you throw around his name so casually?",
    "No, Akthanakos never supported Zamorak. Not even after these thousands of years... He has pledged his allegiance to someone much more foul.",
    "...There are some names it is wiser not to mention, human. Such as the name of my lord Zamorak, that you seem so fond of throwing around.",
    "Out of my sight, you unworthy scum, before I rend your flesh from your bones. Never dishonour his name again.",
    "No! What have you done?",
    "After so many years, why didn't you just give up?",
    "Now my lord will punish you for destroying his weapon.",
    "If you value your skull, then beware because I'll be waiting for you in the north, Akthanakos."
  ],
  "Akthanakos": [
    "Well, why would Zamorak want a temple? You said he needed weapons instead.",
    "So you've seen sense? You'll join our side?",
    "Wait... What is this?",
    "After thousands of years... finally, I am no longer her slave.",
    "As thanks for your help, young [man/woman], please take this amulet of mine.",
    "It allows you to understand the speech of the Ugthanki, my patron animals, and other camels.",
    "It is also bound to the desert, and can thus transport you back to this temple if you wish.",
    "Ha ha... in that case, I'm sure lord Zaros will be happy to intervene.",
    "I look forward to it. Maybe we can end your worthless existence once and for all."
  ],
  "Knight": [
    "All right, men, destroy that evil sorceress... and her temple with her!",
    "F-for Avarrocka!",
    "Aaaaaargh!"
  ],
  "Pentyn": [
    "Have you come to torture me again?",
    "Oh, you may look human, but I know you're not. I've heard stories. How you Mahjarrat can take on any form, and use magic to inflict pain without any weapons.",
    "You'll never get what you want from me. I'm a soldier of Avarrocka, and will stand strong!",
    "Besides, I am already wounded, and have been so for many years, thanks to this spell you cast on me. And hungry. So very, very hungry.",
    "What do you take me for, a rabbit?",
    "I asked you for food, not something you dug up in your garden!",
    "I'm a civilised man, not a barbarian gnawing on his kill!",
    "What do you think I am, a bear? It's not even seasoned!",
    "That's revolting! Why would you give people food you've already eaten half of?",
    "I'm not touching that!",
    "I might have enjoyed that food if you hadn't already eaten part of it.",
    "Do you think I'm a gnome, or something? I'm not going to eat that!",
    "What do you take me for, a goat who'll eat whatever's in front of him?",
    "What are you trying to feed me? I don't want that!",
    "I don't know what you call food these days, but that's not it!",
    "Are you just trying to feed me everything you have?",
    "Why not actually ask me what I want to eat, you fool?",
    "What are you trying to do, kill me?",
    "I'm not going to eat something your cat dragged in!",
    "Oh, I get it, you're experimenting on me with different things to see what I'll eat.",
    "Just so you know, I'm not going to eat that!",
    "I'd rather have some good human home baking.",
    "Some fresh home baking would be delicious.",
    "I'd like something that's had some care put into making it.",
    "I'd like to have a hearty meal fresh from the oven.",
    "Did you just dig that up and throw it into an oven?",
    "It doesn't look good at all.",
    "I'd prefer it with some sort of topping...",
    "That doesn't look too bad at all.",
    "It could almost be my wife's wonderful cooking.",
    "I haven't remembered her in so long... thank you for reminding me of her.",
    "My son loved this dish. He would have eaten it every day if we had let him.",
    "I haven't remembered him in so long... thank you for reminding me of him.",
    "My daughter was learning to cook this when I left.",
    "I haven't remembered her in so long... thank you for reminding me of her.",
    "A cake? There's nothing to celebrate, is there? So many years gone by. My children must have grown up and left home. I haven't remembered them in so long... thank you for reminding me of them.",
    "Yes, thank you. The food you gave me healed my wounds, and it also reminded me of my family, that helped me to remember who I was. I'm afraid that I'm trapped here, but I still remember something of this floor of the temple. If you need any hints about the rooms nearby, I can give you some help.",
    "When we came to the temple, that fountain was frosted with ice. Even chipping at it with swords or lighting fires under it didn't do anything. My guess is that some sort of magic is keeping it that way.",
    "I tried to go in there, but the smoke was so thick I could barely see the furnace. It may be that it's blocked, in which case you'll have to clear it out. A good breeze should do the trick.",
    "I never went in there myself, but I peered through the door. There seems to be fires of some sort all around the room, but they were burning low. I'd imagine they've gone out by now."
  ],
  "Boneguard": [
    "Leave this temple at once, or I shall be forced to attack! I will defend this door until I am released from this prison of bone... Now, flee before I attack you!",
    "Leave this place, before I am forced to attack!",
    "If you value your life, young man/woman, then flee! You should not be here! This is a dangerous place for beings such as you!",
    "I am impressed, young man/woman. You seem to have more resilience than those I have fought off before. Perhaps, then, you could help me with my predicament?",
    "I am trapped in this form against my will... it has been a long and painful struggle to even regain control over my own mind.",
    "SHE has. She was my rival before we came to this world, and supported that upstart Zamorak in his quest to be a god. It angers me to think at how she tricked me into slavery...",
    "Her name is Enakhra, and she is the one who made this accursed temple and this boneguard that I am trapped in. Now, since you show some interest in my situation, will you help me?",
    "Certainly, young man/woman. If you help me, I will give you a valuable amulet, and some of my knowledge.",
    "Enakhra keeps me trapped in this form with magic. Her hold over me grew weaker over the years, and I began to build a wall to keep her trapped in her own temple forever. Unfortunately, she has strengthened her spells lately, and I can no longer will myself to continue building. I want you to finish building this wall, that we might seal her in this temple forever, where she cannot taint the world with her creations again.",
    "There is a pile of rubble nearby, made of blocks that have fallen from the walls and the ceiling over time. I have been trapped here for several thousand years, after all. Is there anything else you wish to know?",
    "Since the blocks are heavy, you will need to be quite strong in order to left them up to the wall. Once you have placed the stones up on the wall, you must trim them with a chisel so that they do not fall off when you place the next layer. Is there anything else you wish to know?",
    "I was not far from finishing, I must say. It will most likely only take you three loads to finish building it. Is there anything else you wish to know?",
    "She is a coward, and a despicable traitor. She even supported Zamorak when he tried to become a god. Of course, even though she built a temple for him, he didn't care, and she's been hiding here ever since. Is there anything else you wish to know?",
    "I was once a proud mage, and now look at me. Trapped inside a bone skeleton and forced to defend my rival's temple. To think I believed her when she said she wanted to become allies and make amends for our rivalry! That two-faced, conniving, backstabbing wretch... I suppose it is our nature, after all. Is there anything else you wish to know?",
    "Thank you. Once you are finished, the wall itself will shield me from most of her magic, and I will be free to move once more.",
    "Thank you. Thank you very much for all your help.",
    "I can feel Enakhra's control over me fading. Finally, I can be free from this imprisonment..."
  ],
  "Freed Spirit": [
    "Thank you, kind sir/madam... now I am free from my imprisonment. I no longer need these bones of mine - take them, please, and bury what you can."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Enakhra%27s_Lament?oldid=36137759’"
  ]
}