{
  "Grand Vizier Hassan": [
    "I have a task for you. Could you deliver a progress report to Emir Ali? I have matters to attend to here and I require his approval.",
    "Before you go Osman wanted a book from the Grand Library, remember? Do us both a favour and find that before you head to Al Kharid.",
    "How is finding Osman's book coming along?",
    "Have you delivered the progress report to the Emir yet?",
    "Have you delivered the progress report to the Emir yet?",
    "Don't you mean Jabari?",
    "Oh! As if one wasn't bad enough.",
    "Have you delivered the progress report to the Emir yet?",
    "I'm sure it's all fine. I trust you!",
    "Have you delivered the progress report to the Emir yet?",
    "I'm sure it's all fine. I trust you!"
  ],
  "Player": [
    "Sorry, I can't help right now.",
    "No luck as of yet!",
    "Hi, I'm looking for a book.",
    "No need to shout!",
    "*whispers* Hi, I'm looking for a book.",
    "A reliable source on the lineage of Menaphite royalty.",
    "Really? Do you know anyone that could?",
    "Thank you so much!",
    "Hi, I'm looking for a book!",
    "I had no idea, I'll try to keep my voice down.",
    "Don't push it.",
    "Thank you so much!",
    "Hello, Akhomet, I have a favour to ask of you. I need passage for someone to get into the city.",
    "I've been to Sophanem and the plague is not contagious. Regardless, this man is a scholar and a citizen of Menaphos: Aristarchus.",
    "He specialises in the study of camels and camelkind.",
    "Some camels may be mean-spirited, but shouldn't be taken for granted. Some people even worship them.",
    "Have you not at least heard of the legendary Akthanakos, one of the Stern Judges of Icthlarin?",
    "I have been made aware of it, yes.",
    "I'll be sure to keep an eye out, thanks for your help.",
    "He specialises in social sciences.",
    "People study social science because social phenomena affect people's lives in profound ways.",
    "Hi, Aristarchus, I've been told you are something of an expert on the royal bloodline of Menaphos?",
    "I could use your help finding a reliable source regarding the lineage of the throne of Menaphos.",
    "The current head librarian in Menaphos thought as much, and I got clearance for you to enter before I came here.",
    "You're making a mistake. Back away now.",
    "Plague test? What plague test? I didn't have to have one of those when I arrived.",
    "'The Hawfully Hungry Hyena', by Hal E Gator and Rhoda Camel? Seriously?",
    "Like, say, the lingering spirit of a renowned Pharaoh Queen of old?",
    "Not yet, no.",
    "I'm doing something of a favour for Osman.",
    "Nothing like that. In fact, definitely not that. Menaphos opened its gates to Al Kharid. They want to set up new trade to help cement the peace. The Emir sent me to keep Hassan safe and assist wherever I could. He made a point that I wasn't to spy and risk this deal. Osman didn't suggest anything different. All he wanted was information on the lineage of the old pharaohs. I've found most of it, but there appears to be missing information. It appears that information about Senliten and Osmumten has been removed. I was hoping you might be able to fill in the gaps.",
    "I'm sorry, I think I'm missing something. Why would this be a problem? He's just asked for some public records.",
    "Right, it's why we're both safe from the curses. We came here to restore Senliten.",
    "Oh, well, it was worth a shot, I guess.",
    "It's why you suggested those showing Leela the proper respect would go far, yes?",
    "Could you just tell me what you're getting at, please?",
    "Wait, so you ARE a princess?",
    "Ah. Why is this a bad thing, though?",
    "How do you mean? How is Osman trying to overthrow the Pharaoh a bad thing?",
    "What happened to him in the end?",
    "I'm sorry to hear that.",
    "What came next?",
    "Where are you going with this? What does all of this history have to do with Osman?",
    "Are you really going to send me to see Jex and the Sphinx again?",
    "Not well.",
    "Not yet.",
    "It's right here. Should be exactly what you're looking for.",
    "Yes, but I still have Jabaris to deal with.",
    "No, Jabaris - multiple.",
    "I have a report from Hassan on the current situation in Menaphos.",
    "Which one?",
    "Jabari has revealed his true colours, but also accused Osman of betraying Al Kharid!",
    "Found you! You're coming with me.",
    "More important, what will Osman do with his claim?",
    "Wait, Amascut plans to kill Osman?",
    "Tell me! Who is Amascut going after?",
    "And here's Amascut's thrall...unless you're hiding behind yet another explosive illusion?",
    "How could you be a willing follower?",
    "It doesn't matter - you're a schemer, a saboteur, and an assassin. You'll pay for your crimes.",
    "I've noticed.",
    "And what terms would those be?",
    "And what terms would those be?",
    "I thought you wanted a fair fight!",
    "I can see right through you and your petty illusions, Jabari. You're finished.",
    "Oh my goddesses, a god!",
    "Besides, it would just be your word against mine. The Pharaoh is just as likely to imprison you for trying to sabotage the deal.",
    "Yes, all done, although things didn't go exactly as planned.",
    "Yeah, so, Het just appeared to me at the Duel Arena.",
    "You're Het.",
    "You know me?",
    "I am honoured that the mighty Het would fight by my side.",
    "Where will you go?",
    "I should probably check back in with Emir Ali.",
    "Jabari is defeated, but he ran off before I could capture him.",
    "I had Jabari on the ropes, but he wouldn't accept his defeat and tried to attack me again...but Het appeared and interceded in our duel.",
    "Het mentioned something about the exposure of underhand plots clearing his mind. I fear Asmascut's involvement in this.",
    "Until Amascut is dealt with fully, anything could happen.",
    "Enjoying being back in the library?",
    "Yes, all done, although things didn't go exactly as planned.",
    "Osman admitted it - he says he only worked with Jabari for the greater good, to gain undeniable proof of his claim so that he could cement peace between Menaphos and Al Kharid."
  ],
  "Kohnen the librarian": [
    "Hi, can I help you?",
    "Ssh! This is a library! Speak quieter!",
    "Ssh! Ssh!",
    "I'm sure we'll have it, there are plenty here.",
    "I'm afraid to say they were all burned, and the last chief librarian along with them. I can't help you, by royal decree.",
    "You would need to talk to someone outside of Menaphos. Look for Aristarchus in Pollnivneach, he's reputed to be something of an expert in the field and used to work here. If you need help getting there, talk to Kags the ferryman in the Ports district. Before you go, however, you will need to authorise his passage into the city with the guard corp. Talk to Akhomet near the Grand Pyramid, although it may not be easy to convince her.",
    "Keep your voice down before I change my mind and call the guards!",
    "Did you not hear me the first time? Speak quietly, or I will have to call the guards and have you forcefully ejected!",
    "GUARDS!",
    "Look around you. Everything you see here is my kingdom, every page a peasant in my empire and every manuscript a loyal vassal, residuals in the pursuit of knowledge. Is it really so surprising that a king would demand silence in his court?",
    "I had no idea, MY LIEGE!",
    "I don't see you with Aristarchus. Did you forget his name or where to find him?",
    "Look for Aristarchus in Pollnivneach. If you need help getting there, talk to Kags the ferryman.",
    "Before you go, however, you will need to authorise his passage into the city with the Menaphite guard. Talk to Akhomet near the Grand Pyramid, although it may not be easy to convince her.",
    "Keep your voice down before I change my mind and call the guards!"
  ],
  "Commander Akhomet (Imperial)": [
    "Good day!",
    "You do realise the city is in lockdown, don't you?",
    "If I'm honest, I've had my suspicions about the plague. We have been receiving communications from the high priest in Sophanem, so it is encouraging to hear corroboration.",
    "This Aristarchus, you say he's a scholar? What does he specialise in?",
    "You expect me to believe there is an academic study centred around those fetid animals?",
    "I don't believe you. The desert pantheon already has an abundance of animal-headed deities, none of them camels.",
    "Now you're just making things up. You won't blag your way out of this one - tell me the truth.",
    "You do realise that is a field of research explicitly forbidden by decree of the Pharaoh?",
    "Well, first and foremost, this fellow is a citizen of Menaphos and he deserves to return home. As for his field of study, I'm not sure I agree with the Pharaoh's restriction of information.",
    "...but if this Aristarchus person doesn't outright tell me he is doing so, then I have no reason to believe he will break this royal decree.",
    "I will send a message to the guards at the gate to let him in.",
    "If you are off to Pollnivneach, I would be careful, however. Turncoats and thugs from my own guard have gathered there, some of whom attempted to assassinate the Pharaoh.",
    "They claimed him a thrall of Tumeken - such nonsense. I do not know what lies they have been told, or tell themselves, but they are no less dangerous for it.",
    "You're kidding, right? Why would we need social sciences? You expect me to believe people actually study that?",
    "Hah, good one! The Pharaoh and the gods are the only ones profound enough to affect our lives. What does he really study? No more lies!"
  ],
  "Aristarchus": [
    "Good day, [sir/madam]. Are you interested in Kharidian history?",
    "Indubitably so. I have pledged my life in scientific service to this land and its people. Well, there are numerous epistemological limitations that prevent me from applying the scientific method in my tenure, it's just that the sibilance sounds superior.",
    "That would be a truly impossible task for anyone less resourceful than I! I know of a sequestered stash within the Grand Library of Menaphos itself! The only catch is that we need to be inside Menaphos, and that is no trivial task.",
    "Unbelievable! I can return home? You have no idea what you've done, this is brilliant news! Give me some time to get my things together; I'll meet you in the Grand Library.",
    "What? Why have you been watching me?",
    "This seems like a poor time to talk!",
    "Good day, [sir/madam]. Are you interested in Kharidian history?",
    "Give me a minute to get my things together. I'll meet you in the Grand Library.",
    "Fantastic to see the traveller who got me back into Menaphos! Although, let me tell you, the 'plague test' at the gate wasn't pleasant in the slightest.",
    "Well, how fortunate for you. Anyway... I took the effort to procure you the book as soon as I could. Don't judge the source by its sleeve - there is a reason it has evaded incineration... though I've no doubt it will have confused a number of toddlers.",
    "Don't knock it - it's a children's classic.",
    "Hmm, you lost that book I gave you. Come back when you have room to take it.",
    "Just a single source is unlikely to hold up to scrutiny. Any good historian knows how important it is to corroborate a story. It's a real shame there's no eyewitnesses or living sources from around the time you could talk to.",
    "Ha! If only historical research were so simple; I'd be out of a job!",
    "It's wonderful to be back amongst the books! I've caught up on so much reading.",
    "Thanks again! Now, can I help with anything else?",
    "Like, say, are you interested in Kharidian history?"
  ],
  "Menaphite thug": [
    "Oy, Ari! The lady has been getting me to tail you and it finally paid off! Do you have any idea how boring your life is?",
    "That's above my pay grade...but a pass to enter Menaphos? That's something we can make use of. I reckon I could make a great Ari, but first let's make the old one unrecognisable...",
    "We can rough up both of you, no problem for me and the boys. Let's go, lads!"
  ],
  "Jabari": [
    "My liege, do you remember Player?",
    "Neither of those, sire, they are a traveller who has been meddling in our affairs around the city.",
    "I have heard from our sources in the library that they have been searching for evidence of your claim to the throne. More importantly, they have been seeking to reunite the throne with the line of Senliten.",
    "But we should really sto-",
    "As you wish, my lord.",
    "I knew I would find you here, Player! You've been digging around in matters well beyond your purview! Give me the book now!",
    "How did you think I got in here? Your guards are no match for my magic! Now hand over the book or there will be consequences.",
    "This one! Behold the power of Amascut!",
    "I'll speak slowly so you can understand. This matter concerns a kingdom far more important that your own. Hand over the book and you'll never need to worry about it again.",
    "Why, from what I've heard of Osmumten's tomfoolery, any number of pretty faces could have granted their spawn the same claim to the throne as yours. Pharaoh is a title acquired by virtue alone! You Kharidians could learn a thing or two about virtue. Maybe that could be the reason why your abhorrent hovel pales in comparison to the city of gleaming gold! Besides, I AM loyal to the only TRUE ruler of this desert. Some shared blood and dusty scrolls couldn't matter less to me, 'spymaster'. The bloodline of Senliten fell long ago, and the gods shall not be far behind them. As for my relations with the Pharaoh, don't pretend you don't have a similar situation with your Emir. Although I I have no doubt you don't quite share everything...",
    "Do you not feel the Emir deserves to hear of your past...collaborations?",
    "Very well, Osman. Your secrets are safe with me...",
    "I'm surprised you connected the dots. Unlike you, I am not afraid to get my hands dirty for my cause.",
    "Guards? I hope you have a lot.",
    "So, you're who was sent after me, Player. Meddler. You think I'd make it so easy?",
    "What will the Emir do with Osman, I wonder.",
    "Osman will NEVER be Pharaoh, you understand. My lady won't allow it.",
    "Not that it will matter once she's killed HIM.",
    "Kill Osman? Ha! No, nothing so mundane. She has 'bigger tombs to trash', if you get my meaning...",
    "You'll find out soon enough. For now, let's settle this! I await you at the Duel Arena...",
    "Oh, look, here comes Al Kharid's champion. You took your time.",
    "Yes, it's the real me, but how dare you? I am no thrall. I chose to follow her...in my own way.",
    "Well, I wouldn't go that far. She is just a means to an end, to an outcome I desire.",
    "So, it's to be trial by combat, oh self-righteous one? So be it. You'll find that I am not such an easy target. I may not be a cold-blooded killer such as you, but I have my tricks.",
    "I have set the terms of our duel. Do you accept?",
    "Just a simple one-on-one duel. I want a fair fight, none of your tricks.",
    "In your own time, 'champion'.",
    "I have set the terms of our duel. Do you accept?",
    "Just a simple one-on-one duel. I want a fair fight, none of your tricks.",
    "In your own time, 'champion'.",
    "This is fair! You just have to find the REAL me first...",
    "Too slow!",
    "GAH!",
    "Gah! You're insufferable! Why didn't my magic work on you?",
    "This is not the end. Not mine, anyway...",
    "Het? How are YOU here? My lady corrupted you! You should be a decrepit, sickly mess!",
    "The Pharaoh shall hear of this! Clearly, Player, you are just an agent of Osman the usurper...a peon of the pantheon! Your hopes of peace are shattered - there will be war again!",
    "You make a fair point. In which case, I shall sic Amascut on you both instead! Until we meet again..."
  ],
  "Pharaoh": [
    "Was that the troublesome ox farmer or the captain of my guard?",
    "Oh? So what? What could they potentially do that could prove problematic to those picked by the gods?",
    "Hah, fools! Why would I care about that? Just as Senliten's line was chosen by Tumeken, I too have received a blessing from the gods! I am the chosen ruler in Menaphos and there is nothing some snivelling scrounger can do to affect that!",
    "No! You should stop! I have said all I shall on the subject. Speak no more of it.",
    "JABARI! JABARI! Where is he? There are so many decisions to be made. No matter - I am the Pharaoh, after all. But how still the day is, nothing makes a sound...or if it does I cannot hear it? I am elevated above all simple strife and people's petty problems. Every man in this world envies me. EVERY MAN IN THIS WORLD ENVIES ME! I have been plucked from my mortal coil by the gods themselves, this realm is just an unfulfilling limbo to an eternity most high. The unyielding affection from my supplicants is the only thing I demand, and in return I do so much for them. But it seems even that which should have come naturally is beyond their seal-limbed grasp. My ascent to godhood is inevitable, this throne just a stepping-stone to even greater power, wherein my words will shake the very sand we stand upon. My worth will be undeniable to every worthless vassal in Gielinor. Guard! Bring in the next beggar! Where is Jabari? JABARI! JABARI!"
  ],
  "Senliten": [
    "Greetings, Player.",
    "What is it you wish to discuss?",
    "It is a risky plan, one with a high chance of failure. Perhaps he wished to keep you out of it, keep you safe.",
    "Both issues are worthy of being rectified, and both must be resolved if the Kharidan Desert is ever to fully heal.",
    "Although we have not been explicit about it, I am sure you must have picked up on the truth here... That the curses in this place do not affect those whom respect my bloodline.",
    "More tellingly, protected are those who also share my bloodline...and those that show them the proper respect.",
    "Ah, a fair guess, I'll grant you. His right of rule is only given by men. The first of the Menaphite pharaohs was chosen by Tumeken himself. By Leela's account, Emir Ali is a good man. But no, it is Osman and Leela that are of my bloodline.",
    "Good! You have been paying attention.",
    "Leela has spoken highly of this Ozan character. But no, it is Osman and Leela that are of my bloodline.",
    "Osman and Leela are my descendants, and therefore are the rightful rulers of Menaphos, the chosen of Tumeken.",
    "It is not. This is one of the ancient wrongs that should be righted. The line of kings should be restored, and Osman is next in line.",
    "He is also going about it the wrong way.",
    "Let me tell you another story so you might understand, this time from after my death. When I passed, my son, Osmumten, became Pharaoh. He inherited a kingdom at war with the ancient enemy. He would often visit me here in my tomb for counsel. One time, Tumeken himself bid my son here to seek me out; this was the day that Tumeken laid down his own life to spare his people, thus bringing an end to war. Osmumten was left to rule alone, and rebuild. It was he who decreed the creation of both Menaphos and Sophanem as you know them today. To build a city where only tents had stood, as a bastion against our lands that were rapidly turning into desert. He toiled day and night, yet did not order others to follow his example, but follow him they did. His fortitude and will inspired his people to survive in the wake of our god's passing. His strength inspired them, a strength that persisted throughout his rule.",
    "Others of our people did not respond so well to the loss of Tumeken. They blamed him for turning our lands into a desert. They did not recognize it as the cost of survival, for without his sacrifice, we would have lost everything regardless. They stopped worshipping him, questioned his past decisions and began to question his authority. Their minds became infected with doubt and contempt. Ultimately, they began to question my son's right to rule, for he was one Chosen of Tumeken, and now the only physical embodiment of his rule. The might of Menaphos was loyal to him, however, so they dared not challenge him openly. They plotted in the dark, conspired against him, using trickery and subterfuge to wear down his resolve. Eventually, they struck - an assassin that had worked up through the ranks of his royal guard. At least his death was swift... He was supplanted, the royal bloodline was deposed, and Menaphos has been ruled over by the descendants of that usurper ever since.",
    "My son did not get the respect in death that I did. Indeed, I fully suspect his usurper was behind the desecration of my tomb. The chosen of Tumeken were strong of will, yet those that had replaced it were weak of mind. They ruled as they plotted, not from the front, but from the shadows. They subjugated the weak, taxed the rich, divided the people by class. Their minds poisoned the minds of all they ruled. Much of this I have only learned since my restoration. It is a wonder that Menaphos stands still to this day, with rulers such as it has had.",
    "That there is more to the strength of man and woman than is seen in the throes of war. That strength is not simply physical might, but also strength of will and character. And that deception and plotting are not traits that should be sought in a leader. Those are the traits of our enemy, yet these are the methods Osman employs in his bid for power. Even if he succeeds in his goal, I fear for what that means for his rule. He is of the line of kings and, as such, he should act like one and lead by example. You must investigate why the people of the desert have become so weak of mind and will.",
    "No. By now you have either learned of our ways or you do not wish to. It matters not which. What you need to know, however, is something that Osman does not. Three things, in fact. One, that Leela and I fully suspect now that Amascut was behind my son's downfall, as a means of corrupting the god Het - he being our pantheon's god of strength. Two, that I fear Osman himself is an extension of this plot. He is walking a dangerous path alone, and he must stop before it is too late. And finally, only once he has acknowledged these two points, that I can tell him what he needs to make his claim. That being the name of my grandchild, who was smuggled out to safety as my son died - the ancestor whom he can draw back to such that he might prove his royalty.",
    "Greetings, Player.",
    "How go things with Osman?",
    "Greetings, Player.",
    "Greetings, Player.",
    "He is still your father, Leela, and the Chosen of Tumeken. Do not lose hope that he will do the right thing.",
    "Greetings, Player.",
    "Yes, this is a very good sign. Please, go and talk with Het.",
    "Greetings, Player.",
    "Worry not, Leela. Osman knows he must come to see me before he can progress his plans any further. We shall get through to him."
  ],
  "Leela": [
    "Oh, he hasn't got you spying for him, has he? Honestly, my father!",
    "So that's his plan? Why couldn't he have just have told me?",
    "It's a huge risk! He could incite another war. He needs all the help he can get. Yet even if he succeeds, it would only solve a symptom, not the cause. That's what we're doing; if only he'd listen to us...to me!",
    "Specifically meaning those who work in its interests, such as you and I.",
    "No, silly. It's my father and me.",
    "My father is the rightful Pharaoh of Menaphos.",
    "Perhaps...one day...but my father is rightfully next in the line of succession.",
    "He can barely rule his own head, let alone other people.",
    "My father is the rightful Pharaoh of Menaphos.",
    "My father is the rightful Pharaoh of Menaphos.",
    "Perhaps by blood, but Senliten's line was overthrown centuries ago. My father has got you delivering proof of our ancestry. If he were able to connect us with Senliten through official records, he could challenge the current Pharaoh's rule. He is building towards a coup, and has you caught right in the middle of it...though he would not risk raising suspicions in Menaphos if he did not already have something.",
    "It's just very, very dangerous, and he's trying to achieve it alone.",
    "Please, try to talk my father down from this course of action. He does not listen to me; he might to you.",
    "Surely he wouldn't do such a thing! I mean, I just don't know anymore with him...",
    "This is proof that the work we have been doing together is bearing fruit. My father cannot deny this any longer.",
    "I cannot believe he would stoop so slow. He has been spymaster so long, he has forgotten how to act.",
    "How can he become Pharaoh with such thoughts in his mind, such willingness to compromise his morals? I don't know if I can forgive him for this..."
  ],
  "Osman": [
    "Greetings, Player. Do you have the book that I'm looking for?",
    "Let me know as soon as you do.",
    "Senliten has swayed my daughter too much. I must pay them yet another visit, but this time we shall resolve things. Go report to Emir Ali.",
    "The book is already with its rightful owner, Jabari. Your influence has no sway here. Guards!",
    "Do you not know what this book means, Jabari? It is proof that I, Osman, am the rightful heir to the throne of Menaphos! Do you have any allegiance to your city and its people? Or purely to the rogue usurper perched in its pyramid? Or are you so used to your poisonous words influencing his actions that you want the power for yourself?",
    "Hold your tongue, worm! Don't you dare!",
    "I have no idea, Emir; however, if he continues, I suspect that it could be captured within the caverns of his skull for all eternity.",
    "So we're dragging each other through the swamp, are we? You're not as good at covering your tracks as you think, Jabari. I may not have proof, but I know it was you that killed Emir Shah.",
    "Curse Jabari's deceitful tongue! Bring him back alive to set this nonsense right!",
    "Do you not see, Emir? This is all for the good of Al Kharid! As Pharaoh, I can cement the peace between our cities. There will be no more intrigue, no more threat of war, no lack of trust. We can unite the entire Kharidian Desert together!",
    "Of course not, I would never. I cared greatly for you father - he was my friend first before being my Emir. I owed him everything. I owe Al Kharid everything. And while I deeply regret my actions with Jabari, they were necessary. I had plans in place to cover all angles.",
    "Jabari shall pay for taking your father's life, I swear to you.",
    "Emir, please. You have to see this is for the greater good!",
    "Thank you, Emir. I knew you would see reason.",
    "Emir, no... Don't do this. You need me! I will be Phara-",
    "I... I shall go. But I promise you this, Emir, whether you trust it or not - I shall continue to work towards lasting peace. Perhaps, one day, you might see it in your heart to forgive my actions."
  ],
  "Emir Ali Mirza": [
    "Welcome! It is good to see you again. How can I be of service, friend of Al Kharid?",
    "I thank you, and I appreciate you going to the trouble of making sure it got to me safely. Now, let us see...",
    "Jabari, what is the meaning of this?",
    "What is he referencing, Osman?",
    "Osman, is this true?",
    "WHAT?",
    "I cannot believe what I am hearing! Both of you shall be arrested immediately! GUARDS!",
    "Grab Jabari now, Player!",
    "All of them!",
    "Welcome! It is good to see you again. How can I be of service, friend of Al Kharid?",
    "Quick, chase after Jabari! I shall deal with Osman!",
    "Welcome! It is good to see you again. How can I be of service, friend of Al Kharid?",
    "I can not believe what I am hearing, Osman. You are supposed to be loyal to this emirate, not your own selfish desires.",
    "Yet to achieve this aim, you have betrayed this city! You have betrayed both me and my father. You speak of trust, but you have betrayed that too. Even if you were to remove all obstacles and become Pharaoh, how am I ever to trust you again? Would you send your spies into my midst?",
    "Except that you didn't! My father died as a result. He would be ashamed of your actions. The ends do not justify the means.",
    "I have no doubt, but so shall you. His blood is on your hands as much as on Jabari's. You are a traitor to the oaths you swore to him and me.",
    "It is taking all of my will right now to not have you executed where you stand, rightful Pharaoh or not...but I listened well to my father's words. You shall not die for these actions.",
    "You misunderstand me, Osman. Your treasonous acts shall not go unpunished. You are hereby stripped of the rank of spymaster and exiled from Al Kharid forthwith.",
    "NO! I shall not hear it! Get out of my sight and this city. Should you ever set foot in Al Kharid again, your life will be forfeit.",
    "Welcome! It is good to see you again. How can I be of service, friend of Al Kharid?",
    "Now that ugly business has been taken care of, what news have you of Jabari?",
    "Be quiet, Khoochak.",
    "Het? He was always a protector of Al Kharid, but his presence has not been felt for many years. I was still young at the time, but now I think of it, he seemed to disappear not long before the war between Menaphos and Al Kharid began. Our troops took it as an ill omen, and though the war itself was more than just a series of stalemates, it did mark the decline of my father's rule.",
    "Het's disappearance, my kidnapping, my father's death, Osman's corruption. This all leads back to that diamond, I have no doubt. Still, if Het showed himself to you, then perhaps things are not completely lost."
  ],
  "Khoochak": [
    "Intruder alert!",
    "Naughty naughty naughty!",
    "You and what army?",
    "Killed the Emir! Killed the Emir!",
    "The human must not escape!",
    "Ugly!",
    "Run away! Run away!",
    "*smacks*",
    "*braaak* Hello, friend. *raaawwwwk*",
    "*braaak* Forgot an adventure? Ask the parrot. *raaawwwwk*",
    "*braaak*",
    "Made noise in a library, you heathen! Stole a book!",
    "Jabari unhappy! Jabari assassin!",
    "Osman is Pharaoh! Osman is traitor!",
    "Nothing bad to say about you for once.",
    "Other than you stink.",
    "*raaawwwwk*",
    "*braaak* Get lost, bucko. *raawwwwk*"
  ],
  "Jabari clone": [
    "But not with me! Ever wondered how you were kidnapped so easily, Emir? Osman provided me with your travel plans in exchange for eyewitness accounts of the flight of Osmumten's child."
  ],
  "Ambassador Jabari": [
    "Catch me if you can...",
    "Not even close!",
    "You're getting warmer!",
    "This was fun, but I grow bored.",
    "Face me if you dare.",
    "Are you really the best that Al Kharid has to offer?"
  ],
  "Het": [
    "You are defeated. Accept your loss. The arena has chosen its champion.",
    "The underhand plots of spies and assassins is at an end. My mind is clear; my strength returns. The rule of Al Kharid once more falls to one strong of body and mind.",
    "With my corruption lifted, his mind will be stronger than your snake-tongue is used to.",
    "I am, and you are Player.",
    "Of course. My sisters - Crondis and Apmeken - speak very highly of you. You have helped to treat many wounds in my family.",
    "Once our brother, Scabaras, reveals himself, the bau of Tumeken shall be whole again. However, when that happens, I fear Amascut's plan for us shall also be complete. When that time comes, I hope that you will stand with us against her. For now, I must take my leave.",
    "To start, there is a plague in the southern city of Sophanem I must deal with. After that, I shall meet with my sisters and we shall search for Scabaras together. Until then, farewell."
  ],
  "Surgeon General Tafani": [
    "Look lively, nurses, we've got another head injury."
  ],
  "Congratulations! You have completed": [
    "'Our Man in the North'."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Our_Man_in_the_North?oldid=23438334’"
  ]
}