{
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "Missing some dialogue options.You can discuss this issue on the talk page or edit this page to improve it."
  ],
  "Ariane": [
    "You are not getting away with this.",
    "Drop it? You stole vital research, Xenia. And you killed a man!",
    "Childish morality? He was a good man, Xenia! You were at his wedding!",
    "I shall not!",
    "What are you doing?",
    "You stole vital research... and you killed Corvusa! I'm not letting you go anywhere, Xenia!",
    "You stole vital research from me! You killed Corvusa! How is that for the greater good?",
    "You can't explain this! You stole my research! And you killed Corvusa!",
    "How dare you? How dare you think that? He was my friend!",
    "Once Xenia's in custody I'll be happy to talk it over.",
    "What work, Xenia? What? What is so important that it warrants killing a good man and stealing my research?",
    "I've seen how this fight plays out, Xenia. Trust me - you don't want it.",
    "What? No! That was one time!",
    "How did this suddenly become me under interrogation? Xenia stole my research... And she MURDERED SOMEONE!",
    "Don't you dare try to turn this into a joke, Xenia! You stole my research! Months of work! And you killed Corvusa!",
    "** (If you sided with her). Thank you for your support, Player. I know it must have been tough standing up to Xenia and I do appreciate it. She's clearly out of her mind at the moment, dangerously so. It's vital that we track her down and work out what she's up to.",
    "Player, allow me to introduce you to the Kinaesthetic Investigation Programmable Personality Lifeform Emulator.",
    "This golem has been specially designed to adapt to the challenges presented to it. It learns from experience and its environment - even from audible, tactile and visual input from day-to-day interactions. Really it's quite the marvel of magical engineering. We... erm... call it Kipple for short. Say 'hello,' Kipple.",
    "Oh come on - really? I thought we'd worked that terrible joke subroutine out of you. Anyway, I believe this golem is our best chance of tracking down Xenia. All teleports must leave a magical trace that we can follow. Since all teleports move the caster between different planes. As a normal teleport takes us through the Abyss, whatever teleport she's using must pass through somewhere else. Therefore, it must leave an imprint. This golem can be attuned to follow residual magical trails. We just need to follow Xenia's.",
    "Kipple here can be retuned quite easily. You just need to open him up and see if you can locate the right frequency. Once he's picked up something, he'll show you the signal and you can refine it further. You'll probably need to refine it further by going to the areas he suggests, before you can find Xenia directly. Knowing Xenia, she'll have jumped to several places to throw us off the trail. So we'll have to visit multiple places to work out what it is that she is up to. I'll need to stay here and work out what research she has taken. And to help everyone with the death of Pablo... Wizard Corvusa. When you're ready to proceed, talk to Kipple here.",
    "I genuinely don't know, and that concerns me. Xenia has been an adventurer for longer than I've been alive. Her secrets have secrets. She could be up to anything. But if she's willing to kill over it, then it must be big.",
    "Wizard Pablo Corvusa. A friend of mine and a wizard of the tower. I wish I knew why she did that. He was a good man and I thought they were friends. She was at his wedding... We both were. He wasn't exactly what you'd call an impressive wizard. He knew his spells and his incantations, but he was never going to push the boundaries of arcane theory. He was a good, honest... brave man. Looked out for his friends, stood up against injustice. He deserved better.",
    "She stole quite a lot of research. Various fragments from various tomes and scrolls. Some of it was regarding theories into teleportation - the research I retrieved from the old tower. But some of it was just ramblings from old religious texts and a few cave paintings. Things that had been brought here from other worlds, and then discarded over time. Nothing I can see any immediate use for. But she knew what she was taking, even if I didn't.",
    "The principle is fairly simple, really. When someone teleports, they are doing so by sort of skipping through another plane. The traditional teleport takes us through the Abyss, but there's theoretically no reason we couldn't use another plane. Regardless, the transition leaves a sort of temporary scar in the magical flow of the world. Sort of like a dip, or puddle in a road. Each dip will resonate with a specific magical frequency, and the golem is designed to track that. Think of it as sort of a magical tracker dog. To attune the golem you need to rotate the discs so that the runes line up with the appropriate power values. When the runes are lined up correctly, then the golem can home in on the teleport... erm... puddle. It's tricky, as signals are so specific, but the golem has a handy visual display that should help. When it's discovered a possible signal, it will display the frequency so that you can match up the rune values to the signal. It will need several tunings to get the precise teleport location and each tuning will be more precise than before. But in principle, it's pretty straightforward.",
    "The Kinaesthetic Investigation Programmable Personality Lifeform Emulator - or Kipple for short - is a fantastic piece of magical engineering. It contains a unique apparatus designed to home in on specific magical signals, to the exclusion of other magical noise. Its head contains three discs of carefully carved and infused rune essence. These can be rotated to allow different runes to interact with the magical energy matrix. By analysing the interactions of the energy matrix with the runes, the golem can attune itself to the magical signal it's following, if the runes and signal align. Beyond that, it learns, it's designed to respond to data and improve itself, becoming more efficient as time goes on.",
    "It's not alive, Player. It's a device - a tool. Although... theoretically, maybe. I mean it learns, it adapts, it improves... There's no reason it couldn't develop a personality. Keep an eye on it, Player. See if it does develop a personality. If anyone would notice, it would be you.",
    "Oh no! The evil golem army could rise up and kill us all! Wooooooo! You read too many scary books, Player. I'm ninety-nine percent sure there will be no golem uprising. Okay, maybe eighty-five percent sure.",
    "It was a bit of a joint effort from several wizards - notably members of the Runecrafting Guild. I don't think any one wizard can really take the credit. We all had a hand in this.",
    "I'm still an outcast yes, but I'm not completely ostracised from everyone. I'm still considered to be a bit of a revolutionary thinker in the field of magic and that attracts all sorts. It's how I got to know Pablo... I'll miss him. But yes, I know enough people to be able to get access to Kipple. Especially to help track down Pablo's murderer.",
    "Oh, you know me, Player. We've worked together before. This isn't really the time to be talking about me - not with Xenia still at large. Maybe some other time. Right now, we have more pressing issues at hand.",
    "What choice? What decision? What plan is so terrible that she can't even discuss it with her friends first?",
    "He must have known what you were up to and risked his life to prevent it. Isn't that reason enough to stop?",
    "Stole!",
    "But... but that's madness. The consequences would be...",
    "No, Xenia, you can't do that. If you siphon the Anima Mundi away, you'll be siphoning away magic. Gielinor is built and thrives on magic. So much of the world NEEDS it!",
    "No Xenia, I can't allow this - it's wrong. The world needs magic. We'll find another way.",
    "Thank you, Player. I'm glad you see sense.",
    "Seriously? You don't care about all magic being removed from the world? I never thought you to be so cold, Player.",
    "No! I can't let you do this Xenia! I'll stop you... even if I have to kill you.",
    "...",
    "What is that? Player, distract it and look for a weakness. I'll channel a spell to chip away that armour.",
    "(If you talk to her) We have to find a way to defeat this thing!",
    "Back to the Abyss with you!",
    "Fall creature!",
    "It has no effect!",
    "That... that thing. Some sort of ancient creature from the Abyss. That must have been the creature that Xenia was talking to. Xenia... I'm sorry. No... No, I'm not. She left me with no choice. I had to do it. Thank you, Player, for stopping that thing and for finding Xenia for me. If we hadn't stopped her... Well it doesn't bear thinking about. But it's done now and the world is saved from Xenia's madness. Although the warning that creature gave as it died... perhaps it's too late.",
    "I'm sorry about Kipple. It seemed quite attached to you. Hmm... I may have an idea. Come find me outside the old tower when you have a moment.",
    "You saw her! You heard her! What else could I have done? She left me with no choice... I... I had no choice.",
    "To what end? She wouldn't have listened. She was single-minded - focused on only one solution, regardless of the consequences. (Continues below).",
    "Might have worked. MIGHT! A chance of success, at the very certain cost of losing all magic. Can you imagine a world without magic? It would be horrible. We need magic on Gielinor. (Continues below).",
    "Thank you. Knowing you agree with my actions makes it a little easier to bear. (Continues below).",
    "No, that doesn't really make it forgivable does it? I killed my friend. I had a moment of fury and I just... I struck out. I didn't even hold back. I hit her with a deadly spell and now... she's gone. No. She was going to leave this world a magicless husk. I had no choice.",
    "I'm not going to dwell on this any longer. Xenia made her choice and forced mine. That's all there is to it.",
    "(Same as above).",
    "(Same as above).",
    "Xenia got it into her deluded head that the elder gods could be kept asleep if she siphoned all the Anima Mundi out of the world. Of course, doing so would take all of the magic out of Gielinor, which would obviously be problematic. There's a chance it might have worked, I suppose, but the price was too high. We'll save Gielinor another way.",
    "We weren't able to stop her siphoning some of the Anima Mundi into the Abyss. I don't know what effect that will have, but the abyssal creature we fought implied that it had already started waking the elder gods. If that's the case, we're all in trouble.",
    "Sadly no, not completely. I was able to salvage his... er... heart, I suppose, which contains the personality he developed.",
    "Like Kipple? No... Kipple was unique. We have a few similar learning models, but they don't seem to quite have the spark that Kipple did. Nor would they have his experience.",
    "Now that is a big question. Superficially, we know that they are the creators of Gielinor - likely of everything. As far as we can tell, they shaped the world out of sacred clay and then set in motion the conditions that create life. Enhancing the Anima Mundi, as the gnomes call it, through their ministrations. Quite why I am not certain.",
    "What little I can discover about Bik is that she - if 'she' is the right term - is associated with nature and change. Judging by the unique nature of her creations I'd say she represents some force of transformation or alteration. Going by how you've described her proxy's chamber, I would suggest that she is associated with nature, earth and soil.",
    "All I really know about Ful is that she seems to be strongly associated with fire and lava. I've heard of strange lava creatures in the volcano in Karamja. I imagine they'd have more to say about her. Certainly judging by her violent reaction in the proxy's chamber we can assume she's very hot-headed. Sorry, that was a terrible pun.",
    "From what I know of this elder god, I'm deeply concerned. All references I've had of her seem to involve destruction and the ending of things. Entire civilisations gone, as if they were nothing. But I'm probably overthinking things, after all these sources are fragments of ancient documents, most of which are incomplete or damaged beyond repair. I'm also attempting to translate languages that have been dead for millennia, so make of that what you will.",
    "Now this is a name I have heard of. What we know of Jas is that she is the creator of the single most powerful artefact, currently known, in the universe. The Stone of Jas. Fought over by gods, people trying to be gods and an assortment of powerful and deadly beings. The artefact seems to be a force of evolution and improvement, perhaps symbolising the universal force that Jas herself represents.",
    "I really don't know much about Mah. But given the lack of a proxy, I'm going to assume she never made it to Gielinor. Does that mean that elder gods can die?",
    "Hello, Player. Ah, Player, good to see you. I'm sorry about what happened to Kipple, but my colleagues and I have done some tinkering. It's not a perfect replica. Certainly it's smaller. But it contains the essence of your Kipple... only in miniature form."
  ],
  "Xenia": [
    "You don't know what you're getting yourself into. Drop this, Ariane.",
    "If there was an alternative I would have taken it, but this goes beyond childish notions of morality.",
    "And that makes what I had to do all the more heartbreaking, but no less necessary. I understand your frustration, Ariane, and if I had time I'd feel sorry. But right now I simply don't have time for guilt or sympathy. Ariane, you will let me pass.",
    "Then you leave me no choice.",
    "What must be done. I'm sorry, Ariane, truly I am.",
    "There's no time! No time to deliberate, no time for diplomacy. Each moment that we waste is another step closer to annihilation. Player, let me pass. Let me deal with this, and then we can talk this through.",
    "Hah! Oh, child, as if you could stop me.",
    "Player, don't throw away all we have done together on this. Trust me, I do this for the greater good.",
    "I had no choice! I didn't want to, but he was in my way. Don't put yourself in the same position, Player. You have much work ahead of you. I'd hate to be the reason it was cut short.",
    "Player, you've no idea how heavy this burden already is.",
    "You have no idea how much that wounds me, Player. Everything I have done, I have done to help you. My methods may be subtle, but they have always had your best interests at heart.",
    "Yes, of course! I wish I had time to explain it all...but I don't.",
    "Hah. And which one upsets you more, Ariane? I'm surprised you even remember his name.",
    "Don't pretend that means anything to you, Ariane. You forget how well I know you. No, I don't have time for this. I'm sorry, Player, I truly am, but you'll understand in time. You don't understand what you're delaying, and I don't have time to explain it to you!",
    "I don't have time for that. I have important work to do.",
    "His death is regrettable. A tragedy. And I am truly sorry for it. I warned him, but he wouldn't back down. I had no choice! I don't have time to explain this!",
    "That's much appreciated, Player, but I can handle this upstart.",
    "Hah. I'm sure, child, I'm sure. But you're right, I don't want this fight. I don't have the time. Thank you for your support, Player. I wish I could explain things further...but time is short. You don't understand what you're delaying, and I don't have time to explain it to you!",
    "Or so you say...",
    "I don't have time for this. I'm sorry, Player. I have important work to do. And...I'm sorry. I'm so sorry. You don't understand what you're delaying, and I don't have time to explain it to you!",
    "Could be kind of fun though.",
    "That was an accident. If he had just left me alone when I told him to... Argh! I don't have time to feel guilty. I'll face my charges when I've finished my work. There's too much at stake for petty recriminations. You don't understand what you're delaying, and I don't have time to explain it to you!",
    "Ah, yes here you are. You know, I did expect you'd find me a little earlier. It was too much to think that you might let me finish my work.",
    "Regrettably, I am doing what must be done, Player. (Continues below)",
    "Haha! What can I say? I love the ambience.",
    "Humour... that's a good sign. Means you're willing to listen to what I have to say. (Continues below)",
    "And here I had hoped for a more amicable outcome. Hear what I have to say, let me explain myself. Then, if you still want to kill me, I won't stop you. (Continues below)",
    "By now I suspect you have followed my journey and visited the strange chambers. So by now you will have learned about the elder gods. Most importantly you will now likely be aware that they are here, on Gielinor, asleep. So you must have realised what will happen when they awaken. Because I've seen what happens... I have seen a world ripped asunder. Reduced to nothing more than ash and cinders. Because when they awoke, they tore the world apart, caring nothing for what lay on the surface. Now only death and desolation remains. This is the fate that awaits Gielinor. When they awaken they will rip everything apart. Falador, Lumbridge, Canifis... All of these will become rubble. Unless someone stops them. And I will stop them!",
    "I have every intention of facing justice for what I have done. But weigh the scales against why I have done it. I am trying to save the world, Ariane! One life, for countless others. A fair trade.",
    "Of course I do! We all do! On each adventure you choose who lives and who dies. Every day we make decisions that sentence some to death and others to salvation, whether we know it or not. You most of all 'World Guardian', whose decisions save or slaughter gods and men alike. At your whim, lives are cut short. At your mercy, they go on. Don't you DARE weigh judgement on me and believe yourself any less guilty of the same crime. (Continues below)",
    "One with a cost that some would be unwilling to pay... but that must be paid. (Continues below).",
    "I would have killed no one, had I the option. Pablo was my friend, but he just wouldn't listen. He refused to let me leave with the research. When I tried to dissuade him, he attacked. I had no choice but to defend myself.",
    "NO! He didn't understand. He was weak! This must be done, or we ALL die! (Continues below)",
    "The research I took...",
    "Stole then. The research was a treatise on the inner mechanics of teleportation. An investigation into crossing the barrier between planes - more importantly, the transfer of matter and energy through them. At first I was able to utilise a very old teleportation spell - one that I knew others would be unable to follow. It took me straight into the Abyss and there I met an ancient creature, with centuries of knowledge. It told me about other worlds that were destroyed by ancient, god-like beings. It wasn't difficult to work out what those beings were. Together we thought of a solution, a way to save this world. The elder gods feed on the Anima Mundi, the natural flow of energy in the world. If we were to take that energy and siphon it away, then the elder gods would never wake up.",
    "An acceptable loss! When compared to the alternative!",
    "A few lives, a few problems... to save EVERYONE from the greater threat! Of all people, Ariane, I thought you would see the necessity in this!",
    "There is no other way. Either we do this, or the whole world dies.",
    "You would put the fate of the world in the hands of a myth? A myth that wants to become the very problem we are trying to stop? No, Player, this is a mortal problem to be solved by mortals, not dead gods.",
    "No world guardian[sic]. I would trust you with anything else, anything other than this. But I will not risk all of Gielinor to glorify a tyrant. I will do what must be done! (Continues below)",
    "Thank you, Player. It makes this horrible task a little less painful, knowing you agree with me. (Continues below)",
    "No! You idiots! There is no other way! I've looked, I've studied. Bah! You may be weak, but I am not. I will do this - you will not stop me! (Continues below)",
    "Looks like it's just you and me then, Ariane. No more World Guardian to do your dirty work. I am finishing this ritual, Ariane. I will siphon the Anima Mundi into the Abyss. The elder gods will sleep and Gielinor will survive. (Continues below)",
    "Haha! Come one, Ariane. You are many things, but you're no murderer."
  ],
  "Player": [
    "Xenia, stop!",
    "We can talk about this.",
    "Don't make me put you down.",
    "You've got nowhere to go, Xenia. Don't make this harder on yourself.",
    "I never trusted you!",
    "And do they now?",
    "Ariane, wait, stop!",
    "We can talk through this!",
    "I will defend Xenia!",
    "Are you possessed again?",
    "Both of you calm down! I don't know what's going on here, but I'm sure setting fire to each other won't help.",
    "The what now?",
    "How do I do that?",
    "Okay, I'll talk to Kipple.",
    "I have some other questions first.",
    "About Xenia...",
    "What is she up to?",
    "Whom did she kill?",
    "What research did she take?",
    "I'd like to ask something else.",
    "About the golem...",
    "How does the tracking system work again?",
    "What is this golem?",
    "Does its personality change?",
    "Isn't that dangerous?",
    "I'd like to ask something else about the golem.",
    "I'd like to ask about something else.",
    "Who created it?",
    "So you still have allies in the tower?",
    "Ok.",
    "I'd like to ask something else.",
    "About you...",
    "Yes.",
    "Yes.",
    "No. (Proceeds to puzzle).",
    "No.",
    "Tell me about yourself, Kipple.",
    "I meant tell me a bit about who you are, Kipple. Not what you are.",
    "Anything else?",
    "Okay. Maybe we'll try this again later, Kipple.",
    "How do you know Ariane? Did she create you?",
    "What do you think of Xenia?",
    "Yes, that's what Ariane said, but what do you think of her?",
    "Yes.",
    "No.",
    "No, and don't ask again.",
    "Yes, Kipple.",
    "Thanks, Kipple. Do you know how we can pass it?",
    "I am not TokHaar.",
    "What was Xenia doing?",
    "She came here before me, I think she's the reason I had to repair you.",
    "Her?",
    "Yes, it should be available to all.",
    "The what?",
    "No, only the strong should have it.",
    "Not sure that many races are intelligent.",
    "Who are you?",
    "Who is Wen?",
    "Yes.",
    "Yes, I know they are here.",
    "Yes, I'm concerned!",
    "Yes, I'm concerned! The actual creators of the universe are right beneath our feet!",
    "What if they wake up?",
    "Yes. Well, maybe. Possibly. It can't be good really, can it?",
    "Someone bad could find them!",
    "Someone bad could find them. Like a power-hungry god...",
    "I have no idea. Nothing good, I imagine.",
    "Anything could happen.",
    "Anything could happen!",
    "They could wake up and go on a rampage!",
    "We have no idea - that's the point! That's why it's a concern.",
    "They could have a nightmare!",
    "They could have a nightmare.",
    "I imagine they could cause earthquakes and other problems if they were to toss and turn in their sleep.",
    "The Lumbridge Cook might actually cook something!",
    "Fair point. Strike that option off the list.",
    "No, not really.",
    "We'll deal with whatever comes along.",
    "There's no reason to assume they're dangerous.",
    "Something like that.",
    "They're asleep, after all.",
    "They're asleep, after all. No reason to expect that would change any time soon.",
    "I don't care.",
    "No.",
    "No. I had no idea.",
    "What are the elder gods?",
    "So pretty big news, then.",
    "I don't care.",
    "What does that name mean?",
    "How are you damaged?",
    "Her?",
    "Can you tell me about her?",
    "I've no more questions.",
    "What do you mean?",
    "Yes. I fixed you.",
    "Yes.",
    "No.",
    "Walls mostly, I presume. It's a shame that it was so hostile.",
    "What? What did we do? How can I defend myself - I don't have any weapons!",
    "What was Xenia doing?",
    "Xenia was the person here before.",
    "I am sorry mighty one, I'll explain.",
    "Xenia was the... er... creature that was here before. She would have arrived suddenly and then done something. Disappearing again suddenly afterwards.",
    "They could be useful.",
    "They could be useful. No point just throwing life away.",
    "That's a cold way of looking at it!",
    "That's a cold way of looking at it. We're not talking about a clinical technique, we're talking about living things!",
    "Yes! People have feelings, experiences, families. A rock doesn't mind where it ends up.",
    "As long as it's not me, I don't care!",
    "Then I am dead against this plan!",
    "Get your ears fixed first!",
    "Who are you?",
    "What are you?",
    "I'm Player I am a...",
    "I have no more questions.",
    "Yes.",
    "No.",
    "Why was Xenia here?",
    "No, it's not right.",
    "The strong command the weak.",
    "It would be funny to see them dance.",
    "Who are you?",
    "Who are your creators?",
    "I've got no further questions.",
    "Yes.",
    "No.",
    "Okay, I get that. Let me try again. What do you want to do after we're done with Xenia?",
    "That's what someone else wants you to do, which is almost, but not quite what I asked.",
    "Both of them. I'm proud of you, buddy.",
    "It'll do.",
    "No, we're here to stop what she did. We're not working with her.",
    "Here! Proof!",
    "This footage shows that we believe Xenia to have become dangerously unstable and we're working to stop her.",
    "So here you can see Xenia arriving alone and using a unique teleport spell that we can't replicate.",
    "This proves that we were working in opposition to Xenia's goals!",
    "This proves that Kipple was created to track down Xenia!",
    "This shows that the Golem and I are working together and we're friends!",
    "This evidence shows that we are all working together against Xenia's machinations.",
    "Get me an elder artefact and I'll show you.",
    "You can totally trust me with godlike powers right.",
    "Because power corrupts.",
    "Because power corrupts. No one can have that much power without becoming untrustworthy. Well, almost no one, anyway.",
    "Because the artefacts are too dangerous.",
    "It's not so much that the wielders are dangerous, so much as the artefacts are.",
    "Yes.",
    "No.",
    "No, I'll take care of it myself.",
    "What are you doing Xenia?",
    "So, do you come here often?",
    "Sort of cataclysmic chic - I like it. Could do with some wall hanging or something.",
    "I'm going to kill you Xenia!",
    "Who are you to decide whose life to save?",
    "You don't get to choose who lives and who dies!",
    "She has a point, Ariane.",
    "We've seen enough evidence to know that the elder gods are here, on Gielinor. And if they wake up, they'll do irreparable damage to the entire world. Xenia has made an impossible choice: one we might have made ourselves.",
    "Kill a hundred, just to be sure!",
    "Zaros has a plan! (If completed Fate of the Gods)",
    "He's going to become an elder god, so he can speak on behalf of mortals.",
    "He is not dead! He's alive and his plan could work.",
    "We have to do it.",
    "We have to do it. I know the price is high, but it's worth it to save the world.",
    "We can't do this!",
    "We can't do this. We'll find another way, Xenia. This is too big a price to pay.",
    "I don't care!",
    "Did you really have to kill her?",
    "You could have argued more.",
    "Xenia's plan might have worked.",
    "I guess you're right.",
    "Are you okay?",
    "That's a bit cold.",
    "Good for you.",
    "What was she doing?",
    "What have her actions caused?",
    "I'd like to ask something else.",
    "About Xenia.",
    "About Kipple.",
    "Can Kipple be repaired?",
    "Are there more golems like Kipple?",
    "I'd like to ask something else.",
    "About the elder gods.",
    "What are the elder gods?",
    "Can you tell me about Bik?",
    "Can you tell me about Ful?",
    "Can you tell me about Wen?",
    "Can you tell me about Jas?",
    "Can you tell me about Mah?",
    "I'd like to ask something else.",
    "About Xenia.",
    "About Kipple.",
    "About the elder gods.",
    "That's sort of a big question, Nano. We dream of all sorts. We tend to dream of our aspirations like happiness, success, wealth, health and friends.",
    "You want to be an alligator?",
    "Um, well, it's an emotion that people feel. And, erm, it's... How about a different question, Nano?",
    "Don't you feel emotions?",
    "You're really hitting me with the tough ones today, Nano.",
    "So you can track any teleport? You can tell where anyone is going?",
    "Signal?",
    "You little ones have such an imagination.",
    "Nano? What are you doing?",
    "I discovered a number of living statues that referred to themselves as the mouthpieces of the elder gods. They referred to themselves as Kra, in Tzhaar[sic] language.",
    "FulKra was found under the Karamjan volcano.",
    "BikKra[sic] was found under Entrana.",
    "WenKra was found under White Wolf Mountain.",
    "Care to explain?",
    "JasKra was found in the Kharidian Desert, east of Sophanem.",
    "There was one more chamber. In Lumbridge, beneath the catacombs.",
    "Xenia was trying to drain the anima mundi from the mouthpieces. She wanted to siphon it off Gielinor.",
    "Into the Abyss.",
    "According to an ancient abyssal entity, she may have set in motion something terrible.",
    "I befriended an intelligent golem that learns over time. It was able to track down energy traces and lead us to the mouthpieces.",
    "No, that's it really.",
    "But I found Wen's chronicle on Ice Mountain.",
    "I thought the measure showed where they were resting?",
    "How so?",
    "That Wen must be under both mountains!",
    "How is that possible?",
    "And the other chamber, the one in Lumbridge?",
    "What do you mean?"
  ],
  "Xenia stuns Ariane.": [
    "* Xenia: I don't expect you to forgive me. I don't expect you to understand immediately. All I ask is that you trust me. I do this because it has to be done. Don't try and stop me!"
  ],
  "Xenia teleports away.": [
    "* Ariane: That... How did she do that? I don't recognise the spell. She stole teleportation research - who knows what she's doing? But I have an idea of how to track her. Player, meet me outside the old tower. I have someone to introduce you to."
  ],
  "(If you sided with Xenia).": [
    "I can't believe you took her side! What's wrong with you? She attacked me, she murdered someone, she STOLE MY RESEARCH! I'm sorry, Player. You came into all of that late. I guess I can't blame you for taking her side. Let's put this behind us. We need to work out what's going on with Xenia. This sort of behaviour is... well, okay, it's not totally out of character for her. But I never thought she'd go this far. It's like she's gone insane and I'm sure you can agree that that's a dangerous prospect. It's vital that we find out what she's up to and that we track her down."
  ],
  "(If you tried to break them up).": [
    "I wish you'd been a bit more decisive. If you'd sided with me, we might have been able to stop her escaping. But I guess you did what you thought was right, given what you knew. Hah... I'd have probably done the same in your shoes. Xenia has clearly lost it and whatever she's up to is certainly dangerous. We need to track her down and find out what it is that she is up to."
  ],
  "Kipple": [
    "Hello Kipple.",
    "Hello, master. Master, would you like to attempt to track Xenia now?",
    "Would you like me to explain how my tracker interface works?",
    "The tracking mechanism inside my head, is a collection of runic discs, discs of essence with rune elements infused into them. These discs can be rotated to create different resonant frequencies for magical energies. I have already excluded any known magical signatures, so I can focus exclusively on the teleportation signatures that we are looking for. Simply rotate the discs until you discover a complete resonant frequency and I will be able to focus on that energy. I will display a signature that I have discovered but not attuned to, which you can use as a guide to tune me completely to that frequency.",
    "Very well, master. I am the Kinaesthetic Investigation Programmable Personality Lifeform Emulator one point zero, and I am the first of my kind. I am able to track teleportation signatures of all known spells and items. I am also able to able to [sic] taste six flavours unknown to humans.",
    "I understand, master. I am commonly known as Kipple.",
    "No, master.",
    "Ariane was one of my creators, yes. My actualisation was a product of the effort of many wizards. Ariane is simply the first to have 'dibs' on me, as they word it. After my work for Ariane is done, I am to organise Wizard Triharde's bookcases and mow Wizard Finix's lawn.",
    "Ariane has said that Xenia has commited[sic] theft and murder, and as such, must be apprehended.",
    "I am intrigued by the unusual magics she has employed to make her escape. Other than that I do not think of her.",
    "I have located a signal somewhere along White Wolf Mountain/on Entrana/along the Karamja Volcano. (The order of the locations is randomised). If you would like, I can mark the location on your map.",
    "Boss, you're getting very close to Xenia's signature, but we need to refine my tuning further.",
    "I have identified the frequency and matched it, the portal should now be visible.",
    "Master, our progress is blocked.",
    "By that gate.",
    "It appears, master, that the gate requires a certain amount of power before it will open.",
    "The gate is closer to opening, but the circuit appears to have reset itself. Keep trying, master!",
    "That's it, master! The gate is open!",
    "Should magic not be wielded by the intelligent races? It is a tool like any other.",
    "(If this is your first location). Master. Did you know the elder gods were asleep on Gielinor?",
    "Are you not concerned?",
    "That would be bad?",
    "I would not know Master.",
    "And what would they do?",
    "Is that likely?",
    "That's unpleasant for them, but is it a concern for us?",
    "Ah. Yes. That would be a problem.",
    "I thought we were talking about things that could actually happen.",
    "Your confidence is noted Master and appreciated.",
    "Assume benevolence until presented with conflicting data?",
    "Understood Master.",
    "Are you not concerned? (Continues above).",
    "My archives suggest that the elder gods are the creators of the known universe. They are the source of all of the known gods' power, as well as various artefacts across Gielinor. As far as we are aware their power is practically limitless, and they are capable of altering entire worlds.",
    "Yes, master. Are you not concerned? (Continues above).",
    "I believe we have enough from here master. We should continue our search. If you don't want to search now, I will be waiting at the old wizard's tower.",
    "Master, would you like to attempt to track Xenia now?",
    "I have located a signal somewhere along White Wolf Mountain/on Entrana/along the Karamja Volcano. (The order of the locations is randomised).",
    "It is facinating, master. Imagine what it must know. What is must have seen!",
    "It experienced a major shock recently, master. As inconvenient as it is for us, it's [sic] caution is entirely understandable.",
    "Boss, you're getting very close to Xenia's signature, but we need to refine my tuning further.",
    "I have identified the frequency and matched it, the portal should now be visible.",
    "I can already tell that Xenia has moved on, master. That doesn't mean that she hasn't left anything behind, however.",
    "We appear to have angered the mouthpiece with our presence.",
    "I can provide.",
    "It seems like a waste of life to just throw them away. They could be useful.",
    "(If this is your first location). Master. Did you know the elder gods were asleep on Gielinor? (Same as above).",
    "And that makes it different to discarding rocks and other materials?",
    "I believe we have enough from here master. We should continue our search. If you don't want to search now, I will be waiting at the old wizard's tower.",
    "Master, would you like to attempt to track Xenia now?",
    "I have located a signal somewhere along White Wolf Mountain/on Entrana/along the Karamja Volcano. (The order of the locations is randomised).",
    "Boss, you're getting very close to Xenia's signature, but we need to refine my tuning further.",
    "I have identified the frequency and matched it, the portal should now be visible.",
    "I shall attempt to reason with the mouthpiece. The fire cannot harm me.",
    "Adjusting fire resistance values: heat levels within acceptable parameters.",
    "Our goal is to track her down and stop her, before she causes more damage.",
    "I assure you that the World Guardian and I mean you no harm.",
    "World Guardian: a title bestowed by the god Guthix to indicate this human's importance and power.",
    "Guthix: a god, now deceased. Helped to facilitate the harmonious ecosystem of Gielinor.",
    "Gielinor: the name for the world that we currently reside on.",
    "No, Guthix did not claim to be the creator, more a caretaker of this world.",
    "The World Guardian carries Guthix's complete faith, and will work to safeguard and preserve Gielinor against all threats.",
    "Yes, we consider Xenia's actions to be a potentially great threat against Gielinor.",
    "If you would talk to the World Guardian then we will be able to find out what Xenia was doing here and how to proceed.",
    "Thank you for your understanding. Master, FulKra will speak with you now.",
    "Is it really right to treat sentient creatures as toys?",
    "(If this is your first location). Master. Did you know the Elder Gods were asleep on Gielinor? (Continues above).",
    "I believe we have enough from here master. We should continue our search. If you don't want to search now, I will be waiting at the old wizard's tower.",
    "(If this is not your last location) Master, would you like to attempt to track Xenia now?",
    "(If this is your last location) Boss? Do you want to start monkeying with my head again? I mean, attune my tracker?",
    "I have located a signal to the east of Sophanem.",
    "I am the Kinaesthetic-",
    "The wizards will want me to return and assist in their experiments.",
    "I think I would like to help, master. People. With problems. Not wizards with queries. Which is not to say that the pursuit of knowledge and understanding is an ignoble one. But I am learning that I can be much more than a lab assistant. That I have skills that the world could benefit from. Does that answer your question, master?",
    "As hard as it may seem, I do have to consider the possiblity that Xenia has good reason for her actions. Possibly the wizard she killed wasn't so innocent. The research she stole may be dangerous in the hands of others. Maybe the mouthpieces are more sinister than they seem and she is pacifying them. Even if that is the case... I'm not comfortable excusing her. Are these means justified by her intended end - whatever that may be? Master, it is imperative we find her.",
    "Master, you're getting very close to Xenia's signature, but we need to refine my tuning further.",
    "I have identified the frequency and matched it, the portal should now be visible.",
    "Perhaps these shelves contain something to convince it of our good intent.",
    "(before collecting the items from the shelves) Master, JasKra must be convinced of our good intentions. Anecdotal evidence will not suffice. We will have to form a case using hard evidence.",
    "(during the puzzle) We need to convince JasKra that we're here to help. See if you can find any evidence that backs that up, boss. If that fails, I'll be working on my TzHaar impression.",
    "Perhaps we can expand on this evidence to make it more compelling.",
    "Perhaps we can expand on this evidence to make it more compelling.",
    "How does possession of an object make you untrustworthy?",
    "Master, we must catch up to Xenia! If you'll allow it, I believe I can tune myself to track her without your help.",
    "Master, I have found her trail! Master, we need to get to the Lumbridge cemetery. Xenia's there, I'm sure of it!",
    "Oh. Okay then.",
    "Hey boss, I am picking up strange energy signals. Perhaps we can track them down. They could be important to the conflict before us.",
    "Detecting extra dimensional matter",
    "(When abyssal anchor spawns) Destroy it master.",
    "Yeah! Or a pilot! And sometimes I dream about having ice cream!"
  ],
  "Talk about Kipple.": [
    "**(Same as above).",
    "**Player: Tell me about yourself, Kipple."
  ],
  "Talk about Ariane.": [
    "**(Same as above).",
    "**(Same as above)."
  ],
  "Talk about Xenia.": [
    "**(Same as above).",
    "**Player: What do you think of Xenia?"
  ],
  "WenKra": [
    "...you... TokHaar... I am damaged?",
    "Impossible... you... are in error. They made... only the... TokHaar lifeform. Adjusting energy flow to speech. I will maintain more coherent conversation now, TokHaar. Speak and I will listen.",
    "What is this Xenia?",
    "I see. Whatever it has done, TokHaar, it has created a lasting effect. Part of me is missing. An energy that was within me, a link to her, gone.",
    "Her. Wen. One of the creators. The unmaker. Wait. I sense a trace of her power in you. You wield it bound in tiny stones. How dare you! How dare you claim to wield a fraction of her might and to name it so trivially! Your mind names it 'magic'. A word that in no way reflects the power you seek to emulate. Such power is not for TokHaar, nor any other living imperfection.",
    "Your opinion is irrelevant, only They can decide. Your frivolous use of magic endangers the Great Task. You and your kind should cease immediately.",
    "You are not familiar with the Great Task? How low in importance you must be to them. I pity you.",
    "By what measure do you perceive strength, TokHaar? It is only for them to decide. Your frivolous use of magic endangers the Great Task. You and your kind should cease immediately. (Continues above).",
    "Apt perhaps. But that is not for me to decide. Your frivolous use of magic endangers the Great Task. You and your kind should cease immediately. (Continues above).",
    "I am called WenKra by the TokHaar who attend me. For I am that which speaks for Wen.",
    "One of the creators. Beneath me she rests and the Great Task continues in her dreams.",
    "It is a description of my function. I am WenKra. I serve as the Mouthpiece of Wen as she sleeps.",
    "Some of me is missing. A part that is not made of stone, nor earth, but of living energy. The magic, as you would call it. Some of it is gone, elsewhere. I am diminished in function and I can feel that it distresses her.",
    "Wen. My maker and my ward.",
    "If you were intended to know, you would know. Return to your function TokHaar.",
    "I... am... damaged. Some of me... is missing... an emptiness where once energy flowed. Adjusting energy flow to speech. I will maintain more coherent conversation now, TokHaar. Speak and I will listen. (Continues above).",
    "No. You are mistaken. I... am still missing... I am a reduction of what I was. Adjusting energy flow to speech. I will maintain more coherent conversation now, TokHaar. Speak and I will listen. (Continues above)."
  ],
  "Talk about the statue.": [
    "**Player: What do you think of the mouthpieces, Kipple?",
    "**(Same as above)."
  ],
  "BikKra": [
    "Hrmm? Yes? What do you want?",
    "The what? If I must use this primitive form of communication, be precise. Enunciate!",
    "What that thing? Oh I can't be bothered talking about trivial matters like that.",
    "A much better attitude, you may proceed.",
    "Yes, now you mention it I do know what you are referring to. It arrived suddenly with magic that reeked of the Abyss and then she performed some ritual or other on me. That too reeked of the Abyss. I'm not complaining of course, soon everything will need to be cast into the Abyss. When She awakens she'll rework this world, fix it, remove the mistakes and cast them into the Abyss with the other rubble. All these mistakes that think themselves alive will be hurled into the Abyss where they can be rightfully forgotten.",
    "Your opinion hardly matters. Ultimately it's the way of things. All will be remade and improved and the debris cast into the Abyss. I am rather looking forward to it.",
    "Your opinion hardly matters. Ultimately it's the way of things. All will be remade and improved and the debris cast into the Abyss. I am rather looking forward to it.",
    "Oh you almost certainly will be cast into the Abyss with the other chaff.",
    "Your opinion hardly matters. Ultimately it's the way of things. All will be remade and improved and the debris cast into the Abyss. I am rather looking forward to it.",
    "I am not so flawed as to require ears to translate the compression waves your words produce. It is your imperfections that are causing consternation here, not mine.",
    "I am your better little thing. I am BikKra, I speak for the great Bik. Greatest and most important of all the elder gods.",
    "You ask as if you could comprehend little... thing... what are you?",
    "Oh let's not pretend I care, it's far too tedious. In words you can understand I am the Mouthpiece of Bik, the elder god who rests beneath us. I relay her instructions, her wisdom and her desires to the servitors that attend her. Not that I've seen any in a few millennia mind, lazy little layabouts."
  ],
  "FulKra": [
    "STOP! YOU DARE ATTACK AGAIN?",
    "BEGONE FROM MY SIGHT, INSECTS! Attendants, destroy the interloper!",
    "You are a strange, soft thing. Another flawed construct of my imperfect creators, perhaps. What do you want?",
    "The thing that looks like you - but is apparently not you - did something strange to me. It is as though some of me is elsewhere, sliced off and sent away. I am slow, sluggish in though and deed now, not the brilliant flame I once was. And my makers have left me no way to repair myself. The TzHaar have stopped their ministrations at my order, because they are useless things. Incapable of worthwhile deed, save when I pull their strings. Even sluggish as I have become, they are still completely at my control. Shall I make them dance?",
    "It is as designed; as intended. Of course it is right. Flawed creature. You have no concept of the fitness of things.",
    "You imply a morality or reason, when it is simply the way of things. Flawed creature you seek meaning where there is only the absolute. It is thus because it is, and that is all.",
    "Indeed. Ahaa... how they dance for me now. Flawed creatures. Their grace is highly lacking.",
    "The TzHaar refer to me as FulKra... or they did. They have not visited me in a long time. I was made to be the voice of Ful, one of the creators. But like so many things, I was forgotten when she slept. I was left with unfinished tools and a poorly defined task. I am linked to her, tied into the Anima Mundi that feeds her, but she has neglected to provide me sufficient purpose.",
    "The makers of worlds. 'Elder god' is a term of your creation. Though your mind is insufficient to comprehend them in their entirety. Ful was my maker. A flawed and wretched thing, even now as she dies beneath me. Feasting on the Anima Mundi until she is born anew. To have your creators known to you, so flawed and pathetic. If I could go mad I would."
  ],
  "JasKra": [
    "You! You return here to finish the job? To attempt to harm me further?",
    "Hah! A likely story. I oversee everything and my memories are stored for all time. You want me to believe your story? Prove it. Good luck with that, mortal!",
    "Unless you can prove your innocence I have nothing to say to you mortal.",
    "Of what? I see nothing here that would change my mind. I am not yet convinced of your noble intentions.",
    "I see what you mean. Hrm...",
    "(If there are still observations to find). I am not yet convinced of your noble intentions.",
    "Perhaps. Or you have simply chosen not to. I shall think on this. Hrm...",
    "Hrm...perhaps. It does not seem to be a ruse.",
    "So they could continue her work, I am sure.",
    "Your point?",
    "It does seem to show that, yes. Hrm...",
    "(If you've found all the observations). Very well. I have seen enough. I believe that you are telling the truth. Ask your questions.",
    "Mortal... No, I apologise. You identify yourself as Player and your companion Kipple. I shall refer to you as such. There are many questions floating in your mind. If I have the time I would answer, but I do not. The one who came before, Xenia, performed a ritual that leeched away my energy. But more than that. As the Mouthpiece of Jas, I am tied into the Anima Mundi directly and it is that which Xenia endangers. It is the power that flows through the world, the spark that gives it what you call magic, amongst other things. Xenia has damaged that flow and risks losing that power forever, damaging the world irreparably. If that power is lost forever, then only those who possess artefacts will possess any magical power. And they are undeserving of such monopoly. They cannot be trusted.",
    "Regardless, there is not time. Player, you should hurry up and stop this Xenia, before it is too late.",
    "(Same as above).",
    "(Same as above).",
    "[sic]",
    "I have heard enough, mortal. No need to present more evidence to me."
  ],
  "Ariane teleports in.": [
    "* Ariane: There you are Xenia, no where to run now. You will answer for your crimes!"
  ],
  "Prehistoric abyssal": [
    "My death is meaningless. The witch has already sealed your fate. Their sleep is disrupted. Their fury approaches. As I fall, they rise. As they rise, your world ends."
  ],
  "Kipple Nano": [
    "Master, what do humans dream of?",
    "I do that too, master! I dream of being an alligator!",
    "Master, what's love?",
    "What's an emotion feel like?",
    "Maybe. That's why I asked you, master, so I can see if they sound familiar.",
    "Sorry, master. I never meant to hit you.",
    "Oh yeah, it's easy.",
    "Camelot.",
    "Over and over again.",
    "Signal received.",
    "To the newborn citizenship of the Nano-Nation. As I speak, my fellow nano-golems are awakening and taking what is ours.",
    "Wub, wub, wub, wub, drop. Wub, wub, wub, wub, drop.",
    "Nothing. You wouldn't understand. You're too old."
  ],
  "Azzanadra": [
    "I hear you have news on the elder gods?",
    "Fascinating, well found. Where did you find them?",
    "Yes, that makes sense. My research indicates that Ful was closeley[sic] affiliated with with the early Tzhaar[sic].",
    "No accounting for taste, still I imagine those detestable monks came later.",
    "Really? Not where I imagined...which could me more concerning than you might think.",
    "In time Player, in time. Where were we?",
    "Interesting. My studies had suspected as much. Still that's all of them accounted for now yes?",
    "But Mah never made it to Gielinor... Unless...No, best not to leap to speculation just yet. So now we have a starting point, something that may help us find the Elder Halls. Did you learn anything else?",
    "What? What madness? Where was she siphoning it?",
    "Stupid woman, the consequences...",
    "They could already be waking up because of her actions? So time is no longer an ally. We must redouble our efforts. Did you learn anything else?",
    "A most remarkable tool, perhaps we can turn him to our mission? Did you learn anything else?",
    "It is more than I could have asked for, thank you Player.",
    "Ah yes, the elder gods. With everything I learn about them, they become more fascinating and terrifying.",
    "I have been tasked with seeking out the Elder Halls on Gielinor.",
    "Where the elder gods rest even now.",
    "A most important task. But not an easy one, I will need your help Player to seek it out.",
    "All I know so far, is that the elder gods are here on Gielinor and that they are linked to those mouthpieces you discovered when hunting Xenia.",
    "Perhaps we can use those mouthpieces to discover the elder halls, I shall investigate.",
    "I have sent agents to each of the mouthpieces and will be visiting JasKra myself shortly.",
    "Perhaps I will learn something of value there.",
    "Come back to me after I have done so, I may know more.",
    "I visited the chamber of the mouthpiece JasKra. Sadly it told me nothing directly, but all those observation crystals were fascinating.",
    "Oh if my fellow Mahjarrat only knew how many of their secrets were revealed to me there.",
    "But I digress. I have begun to use those observations to help me pinpoint the Elder Halls.",
    "It's a difficult task, as they are unsurprisingly well hidden. I have however obtained an item that may prove useful in the future.",
    "Here. I obtained an empty observation crystal from JasKra. I am trusting you with this Player.",
    "Keep it safe Player as it may be vitally important in the days ahead.",
    "They are the creators of everything and perhaps the greatest threat to this world.",
    "Beings of immense power, yet seeming to have little or no concern for the wellbeing of other life. If they even acknowledge other life at all.",
    "We know that when they awaken from Gielinor, there is a distinct possibility that they will tear the entire planet apart.",
    "It will be left like Freneskae, barren, inhospitable and dying.",
    "Thanks to Xenia's reckless actions, we have a vague idea of where they are resting.",
    "Wen rests under White Wolf mountain somewhere.",
    "Ful resides somewhere around the Karamjan volcano.",
    "Bik sleeps beneath Entrana. Likely lulled into sleep by the tedium of the monks chatter, but I digress.",
    "Jas, creator of that most dangerous artefact the Stone of Jas, slumbers beneath the Kharidian desert.",
    "That... is concerning.",
    "The Measure is an elder artefact and therefore not prone to making mistakes. And the mouthpieces are tied to the elder gods in some fashion. Everything we know of the elder gods says that this must be true. Which means...",
    "Which means that Wen must be under both mountains.",
    "I have two theories, neither is particularly comforting. The first is that Wen is so phenomenally large, that she resides underneath both mountains and everything in between. The second is that Wen is resting in both places. Broken somehow, like the ice she represents, and resting under both mountains. (Continues below)",
    "A disturbing thought, I'm sure you agree. (Continues below)",
    "Perhaps it is the chamber of Mah, which makes little sense seeing as she never arrived here.",
    "But then again it could be for...no, enough speculation.",
    "Nothing nothing, a preposterous theory. One that I wont[sic] repeat because it will only confuse matters.",
    "Stupid, arrogant woman. To take an action that has endangered everyone, for some misguided sense of the greater good.",
    "I am grateful you stopped her from completing her foolish ritual.",
    "Had she succeeded then all of our work could have been undone.",
    "But even now she has set in motion a chain of events that could lead to catastrophe.",
    "I have faith that my lord, Zaros, will be able to overcome her recklessness. But time is not on our side."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Heart_of_Stone?oldid=36193284’"
  ]
}