{
  "Morgan": [
    "Praise Saradomin! He has brought you here to save us all!",
    "He has guided your steps to my door, so that I may beseech you to save my village from a terrible threat!",
    "I, I, I couldn't. The fear grips me like a hand. I tremble at the the idea of leaving my house!",
    "Our village is plagued by a vampyre. He visits us frequently and demands blood payments or he will terrorise us all!",
    "I don't know, I just moved here with my wife. We'd move on again, but we're down on our luck and can't afford to. Besides, I don't want to abandon other innocents to this fate. This could be a good community, if only that vampyre would leave us. Will you help me, brave adventurer?",
    "Oh. Then I guess Saradomin did not send you in my time of need.",
    "Wonderful! You will succeed, I'm sure of it. You are very brave to take this on, but I think you should speak to my friend Harlow before you do anything else.",
    "He is a retired vampyre slayer! I met him when I was a missionary, long ago. He will be able to advise you on the best methods to vanquish this vampyre.",
    "Harlow is...past his prime. He's seen too many evil things in his life and, to forget them, he drinks himself into oblivion. I fear he will slay vampyres no more.",
    "He spends his time at the Blue Moon inn, located in Varrock. If you enter Varrock from the south, it is the second building on your right. I'm sure it's fill with lively people, so you shouldn't miss it.",
    "May Saradomin protect you, my friend!",
    "How can I help, brave adventurer?",
    "Well, ultimately, you need to slay the vampyre plaguing my village. But, right now, you should speak to Harlow in Varrock. He will tell you the secrets to vampyre slaying.",
    "Please hurry!",
    "Leave Draynor Village heading north-east. Cross the River Lum and head north to Varrock. Enter Varrock from the south and on your right should be a pub called the Blue Moon inn. Harlow should be in there: drinking, no doubt.",
    "Please hurry and slay that vampyre!",
    "How can I help, brave adventurer?",
    "Oh? And what has he told you to acquire?",
    "Harlow did tell me to always keep garlic on me. He insisted on constant vigilance against any possible threats. I used to have a large supply of it, but it's been disappearing. I think my wife dislikes the smell. Feel free to look around and see if you can find any she missed. Can I help you with anything else?",
    "Well, Harlow always kept plenty of stakes with him. You can probably get another from him.",
    "Hmm, speak to Harlow, he'll probably give you another.",
    "Harlow did tell me to always keep garlic on me. He insisted on constant vigilance against any possible threats. I used to have a large supply of it, but it's been disappearing. I think my wife dislikes the smell. Feel free to look around and see if you can find any she missed. Can I help you with anything else?",
    "I knew he would help is in our time of need. Did he tell you what you needed to know?",
    "You must forgive him. He believes the beer frees him from his memories, but it's really just destroying him.",
    "Praise Saradomin! Bless you! We are all saved, the vampyre is slain!"
  ],
  "Player": [
    "Wha–",
    "Why don't you save your own village?",
    "What is this terrible threat?",
    "What is this terrible threat?",
    "The vampyre showed up all of a sudden and started attacking your village?",
    "No, I think not.",
    "Yes, I'll help you.",
    "Who is this Harlow?",
    "You already know a vampyre slayer? What do you need me for?",
    "Where can I find this Harlow?",
    "Okay, I'll go find Harlow.",
    "What do I need to do?",
    "Right, I'll get on it.",
    "How do I find Harlow?",
    "Never mind.",
    "No, you've had enough.",
    "Are you Dr Harlow, the famous vampyre slayer?",
    "Your friend Morgan sent me. He said you could teach me how to slay a vampyre.",
    "You couldn't possibly be Dr Harlow, you're just a drunk.",
    "I think Morgan must have been mistaken. There is no way you could teach me to slay a vampyre, you can barely walk!",
    "Your good friend Morgan is living in fear of a vampyre and all you can think about is beer?",
    "I'll just go and buy one.",
    "Okay, here you go.",
    "So, tell me how to kill vampyres then.",
    "Okay, so those are the supplies I need, but how do I actually kill him?",
    "Thank you very much!",
    "So, tell me how to kill vampyres then.",
    "I've lost some equipment you gave me, could I have replacements?",
    "Nothing, sorry for bothering you.",
    "I found out what equipment I need from Dr Harlow.",
    "I already have a stake, Harlow gave me a spare. I have the special hammer made for striking stakes into vampyres. I still need to get some garlic.",
    "Harlow gave me his spare stake, but I don't have it with me.",
    "Harlow gave me a special hammer, but I'm not sure where I put it.",
    "I still need to get some garlic.",
    "I've spoken to Dr Harlow.",
    "Yes, he did, but only after I bought him a pint! Some vampyre slayer he is.",
    "Hmm, maybe I'll speak to him.",
    "Do you have any garlic on you?",
    "Tell me about the vampyre.",
    "What is terrible?",
    "A vampyre is attacking people?",
    "So, tell them! I need more information about the vampyre.",
    "...",
    "Uh, shouldn't you be more concerned with the vampyre living in the manor before you go turning it into a museum?",
    "You're crazy, lady.",
    "What happened?",
    "Can you tell me about vampyres? I told Morgan I would slay the one in Draynor Manor.",
    "That's not very helpful.",
    "What did you mean about 'Beware the vampyre'?",
    "Hmm, maybe I should speak to him.",
    "Can you tell me about the vampyre attacks on the village?",
    "Can you tell me anything useful about vampyres? I promised Morgan I would slay the one preying on your village.",
    "Can you tell me anything about vampyres? I told Morgan I would slay the one in Draynor Manor.",
    "I'll try my best!",
    "Hi Aggie. I've spoken to Dr Harlow about how to kill the vampyre. I have to use a special hammer to drive a stake into his heart. Do you have any advice for me?",
    "What's new in Draynor Village?",
    "The blood sucker?",
    "Wow, that's sad.",
    "Hi, Martin. I was wondering, have you heard about the vampyre attacks in Draynor Village?",
    "Why is he attacking the village? Where did he come from?",
    "Yes, I've promised Morgan I would help. I've also seen Dr Harlow, who was a famous vampyre slayer. He's taught me what to do.",
    "Well, someone has to stand up to him. Otherwise your village won't have any villagers!",
    "Anything interesting happening in Draynor Village?",
    "You seem pretty calm about it.",
    "Can you tell me anything about vampyres? I told Morgan I would slay the one in Draynor Manor.",
    "That's not very helpful!",
    "Have you got any advice for me before I try to kill the vampyre?",
    "I should tell Morgan that I've killed the vampyre!",
    "I killed the vampyre!",
    "Wait! This time I can tell YOU about the vampire. I've killed it!",
    "No, you horrible woman.",
    "What happened?",
    "I've killed the vampyre!",
    "I did it! I killed the vampyre. Your village is safe again.",
    "I've done it! I killed Count Draynor. The village is free of him.",
    "Anything interesting happening in Draynor Village?",
    "You seem pretty calm about it.",
    "I've done it! I killed Count Draynor. The village is free of him.",
    "I killed the vampyre!",
    "I've killed the vampyre!",
    "I successfully slayed the vampyre! Morgan's village is now free of threat and all is well."
  ],
  "Dr Harlow": [
    "Buy me a drrink pleassh.",
    "Pssssh, I never have enough!",
    "Dependsh whose ashking.",
    "Shure, I can teash you. I wash the best vampyre shhlayer ever.",
    "Of coursh I'm Dr Harlow. I'm famoush! I've shlayed more vampyresh than a pup like you could imagine.",
    "I'm the besht in the business. No one could teash you what I know. No one else has sheen what I've sheen.",
    "Buy me a beer and I'll teash you.",
    "Buy ush a drink anyway.",
    "Did you buy ush a drrink?",
    "Cheersh, matey.",
    "Yes, yes, vampyres. I was very good at killing 'em once. Vampyre slaying is not to be undertaken lightly. You must go in prepared, or you will die.",
    "*Sigh*",
    "A stake is an essential tool for any vampyre slayer. The stake must be used in the final blow against the vampyre or his dark magic will regenerate him to full health. I always carry a spare, so you can have one.",
    "You need a special hammer as well, to drive it in properly. Hmm, I think I have a spare hammer you can have.",
    "One last thing. It's wise to carry garlic with you; vampyres are slightly weakened if they can smell garlic. Garlic is pretty common, I know I always advised Morgan to keep a supply, so you might be able to get some from him. If not, I know they sell it in Port Sarim.",
    "You are an eager one. Killing a vampyre is DANGEROUS! Never forget that. Go in prepared, with food and armour, but understand that you may die. It's a risk we all take in this business. I've seen many fine men and women die at the hands of vampyres. Enter the vampyre's lair and attempt to open the coffin. He should be asleep in there, so try to use the stake on him. As you're new at this, you'll probably just wake him up and the real fight begins. Fight him until he's nearly dead, and, when the moment is right, stake him through the heart and hammer it in. It's gruesome, but it's the only way. Once he's dead, speak to Morgan so he can notify the village.",
    "Oh, itsh you. What do you want?",
    "Young peoplsh these days. Can't keep track of nuffin'.",
    "You haven't lost your stake, it's in your bank.",
    "Well, you've still gotsh your stake.",
    "How yoush expect to kill a vampyre without a hammer?",
    "You haven't lost your hammer, it's in your bank.",
    "You've still gotsh your hammer, it's in your pack",
    "Issh all right.",
    "Good jobsh. Go tell Morgan and leave me alone.",
    "Buy me a drink pleassh.",
    "Oh, itsh you. What do you want?",
    "Well, that calls for a drink to celebrate! How 'bout yoush buy me one?"
  ],
  "Maris": [
    "You look brave. You should speak to my husband, he is looking for an adventurer.",
    "I understand you have agreed to rid our village of the vampyre! May Saradomin protect you in your endeavour. If you are uncertain of anything, you should speak to my husband.",
    "What can I do for you, brave adventurer?",
    "What an odd question! Morgan always tries to carry some on him, but it makes him stink, so I hide it. I can't remember where I've put it, but it's somewhere in the house. Feel free to look around.",
    "That's wonderful news! Quickly, tell my husband; he will be so relieved."
  ],
  "Miss Schism": [
    "Oooh, my dear, have you heard the news?",
    "Well, there's just too much to tell at once! What would you like to hear first; the vampyre, the bank or the battlefield?",
    "It's terrible, absolutely terrible! Those poor people!",
    "Why, the attacks!",
    "Yes, haven't you been listening? A no one is lifting a finger to do anything about it. Well, that new couple, Morgan and Maris, they think we should find a vampyre slayer, but I'm not sure I trust them. They aren't local.",
    "Why the stories I could tell! Such terrible things I've heard.",
    "Don't get angry with me. I'm not some gossip, blabbing about other people's tragedies.",
    "I, my dear, am a concerned citizen of Draynor Village. Ever since the Council allowed those farmers to set up their stalls here, we've had a constant flow of thieves and murderers through our fair village, and I decided that someone HAD to stand up and keep an eye on the situation. I also do voluntary work for the Draynor Manor Restoration Fund. We're campaigning to have Draynor Manor turned into a museum before the wet-rot destroys it completely.",
    "A little old vampyre won't matter, dear. Besides, he'd probably look quite fine as an exhibit.",
    "Oooh.",
    "Oooh, my dear, have you heard the news?",
    "Well, there's just too much to tell at once! What would you like to hear first; the vampyre, the bank or the battlefield?",
    "Why, I know that already. He couldn't have been that much of a bother, since you managed to kill him so easily. It's too bad, really. He was going to be an exhibit in the Draynor Manor museum. Speaking of which, would you like to donate to the cause?"
  ],
  "Fortunato": [
    "Can I help you at all?",
    "The village is quite old, but the market is a rather recent addition. We were doing quite good business up until recently.",
    "Well, not long ago there was a battle right outside Draynor, between Saradomin and Zamorak! You can still see the battlefield. Besides that, mysterious attacks began happening to villagers. Some say it's a vampyre, but I'm not convinced. Perhaps I can interest you in some wine?",
    "So, it is a vampyre is it? Very interesting. I'm afraid I can't tell you anything of use, except to be careful.",
    "Can I help you at all?",
    "The village is quite old, but the market is a rather recent addition. We were doing quite good business up until recently.",
    "Well, not long ago there was a battle right outside Draynor, between Saradomin and Zamorak! You can still see the battlefield. Besides that, mysterious attacks began happening to villagers. Some say it's a vampyre, but I'm not convinced. Perhaps I can interest you in some wine?",
    "Well, that is good news. Maybe business will pick up!"
  ],
  "Town Crier": [
    "BEWARE THE VAMPYRE, EVERYONE IN BY NIGHTFALL... Oh, sorry for shouting right at you.",
    "Hello citizen. What can I do for you?",
    "Our village is plagued by a vampyre that lives in the manor to the north. One of the citizens - Morgan I think - is trying to find a vampyre slayer to rid us of him.",
    "Hello citizen. What can I do for you?",
    "A sad business, that. It used to be a great tourist attraction, having a haunted house next to the village. Then these attacks began, and the town has been hit hard financially. It's hard to keep morale up when it's not safe to be outside after nightfall.",
    "Hello citizen. What can I do for you?",
    "I only know the after-effects of a vampyre attack. It is not a pretty sight. To face one head-on with the intention to kill it? I can't offer you any advice. Perhaps you should find someone who has killed a vampyre to advise you.",
    "Hello citizen. What can I do for you?",
    "That is great news! You should tell Morgan, I'm sure he'll reward you for your efforts."
  ],
  "Aggie": [
    "What can I help you with?",
    "I know they can only be killed with special equipment, but I don't know what or where you could get it. I'm glad you are attempting to end Count Draynor's reign of terror, though.",
    "Do not underestimate the vampyre. He will have strong regenerative abilities. Take garlic and be prepared for a battle.",
    "The blood sucker has returned to Draynor Manor. I hate his kind.",
    "Yes, Count Draynor, the vampyre. He's preying on the innocent people of this village. I do my best to protect them with the magic I have, but he is powerful.",
    "What can I help you with?",
    "Well done, [player]. You are truly a great warrior."
  ],
  "Martin the Master Gardener": [
    "Has he attacked again? It was only at night before! This village has really gone downhill.",
    "I don't know, I'm relatively new to Draynor. That horrible gossip, Miss Schism, probably knows. Just make sure you are indoors when the sun sets.",
    "Hello, Player. I've heard rumors in the village that you've promised to kill the vampyre in Draynor Manor. Is that true?",
    "Are you mad? Taking on a vampyre?"
  ],
  "Ned": [
    "Why, hello there, [lad/lass]. Me friends call me Ned. I was a man of the sea, but it's past me now. Could I be making or selling you some rope?",
    "Well, there's a nasty vampyre causing a ruckus every night. I s'pose that's interesting.",
    "Boy/Girly after everything I've seen in my life, a vampyre doesn't ruffle my feathers. Long as I stay inside after dark, I'm fine.",
    "I know to stay well out of the way if you value your life.",
    "Don't be a brave fool. If you're dying, run away. Better to live to fight another day.",
    "Why, hello there, [lad/lass]. Me friends call me Ned. I was a man of the sea, but it's past me now. Could I be making or selling you some rope?",
    "Well, there's a nasty vampyre causing a ruckus every night. I s'pose that's interesting.",
    "Boy/Girly after everything I've seen in my life, a vampyre doesn't ruffle my feathers. Long as I stay inside after dark, I'm fine.",
    "I'm impressed. Didn't think a whippersnapper like you would make it."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Vampyre_Slayer?oldid=36105839’"
  ]
}