{
  "Player": [
    "Hello. What are you doing here?",
    "What's going on here?",
    "No, I'm an adventurer.",
    "Looking for adventures - what else?",
    "What's the matter?",
    "What do you mean it isn't working?",
    "So how come the spell doesn't work?",
    "Taken?",
    "Stolen?",
    "I'm not interested.",
    "Can I be of help?",
    "???",
    "I would be happy to.",
    "I'm not interested in the rantings of an old wizard.",
    "You wizards are always complaining.",
    "No, sorry, nothing yet.",
    "I've got some questions about the search for evidence.",
    "Aha! A robe. This could be a clue...",
    "Here's some armour; it could be evidence...",
    "Aha, a dagger! I wonder if this is evidence...",
    "I've found an eye patch; I had better show this to the Watchtower Wizard.",
    "What's this? Disgusting! Some fingernails. They may be a clue though... I'd better take them.",
    "Hmmm, nothing here.",
    "I have already searched this place.",
    "I have this [robe, dagger, armour, eyepatch] ...",
    "Have a look at these...",
    "A skavid?",
    "What do you suggest I do?",
    "Why not?",
    "And how do you know that?",
    "So what do I do?",
    "That sounds scary...",
    "What do I need to do to get into the city?",
    "I won't bother, then.",
    "Shall I search the caves?",
    "I seek entrance to the city of ogres.",
    "What can I do to help an ogre?",
    "I have come to kill you!",
    "Wow! That tunnel went a long way.",
    "I think I need a key of some sort...",
    "I have your gold.",
    "I haven't got it yet.",
    "I have lost the key!",
    "I have your gold.",
    "I want to enter the city of ogres.",
    "Don't eat me; I can help you.",
    "I am a mighty adventurer, slayer of monsters and user of magic powers.",
    "You will have to kill me first.",
    "I've come to knock your teeth out!",
    "Err, I don't have it.",
    "I have it.",
    "I seek entrance to the city of ogres.",
    "I'll find a way, trust me.",
    "I could do something for you...",
    "Die, creature!",
    "I have nothing for you.",
    "When I say I will get something, I get it!",
    "An ogre gave me this...",
    "An ogre gave me these...",
    "I don't have anything.",
    "I have a relic from a chieftain.",
    "But I am a friend to ogres...",
    "Like what?",
    "Not if I can help it.",
    "Okay, okay, I'm going.",
    "Urrrrrgh!",
    "I tire of ogres; prepare to die!",
    "How about this?",
    "You want me to give you 20 gold pieces to let me jump off a bridge?",
    "Okay, I'll pay it.",
    "Phew! I just made it.",
    "Forget it, I'm not paying.",
    "I am on an errand.",
    "I am an ogre killer come to destroy you!",
    "I seek passage into the skavid caves.",
    "I worked it out!",
    "I'm glad that was easier on the way back!",
    "I have worked out the guard's puzzle.",
    "I am still trying to navigate the skavid caves.",
    "I am trying to get into the shamans' cave.",
    "Alright!",
    "The WHAT?",
    "Great...",
    "It is going well.",
    "???",
    "???",
    "Stop moaning, creature. I know about you skavids - you serve those monsters, the ogres.",
    "You have something that belongs to me...",
    "Somehow, I find your words hard to believe.",
    "I don't believe you, hand it over!",
    "Oh great, I'm not getting anywhere.",
    "Okay, okay, I'm not going to hurt you.",
    "I am studying the speech of your kind...",
    "Cur.",
    "Ar.",
    "Ig.",
    "Nod.",
    "Gor.",
    "Cur.",
    "Ar.",
    "Ig.",
    "Nod.",
    "Gor.",
    "Cur.",
    "Ar.",
    "Ig.",
    "Nod.",
    "Gor.",
    "Cur.",
    "Ar.",
    "Ig.",
    "Nod.",
    "Gor.",
    "Here it is!",
    "???",
    "Cur.",
    "Ar.",
    "Bidith.",
    "Tanath.",
    "Gor.",
    "I want to go in there.",
    "I want to rid the world of ogres.",
    "I can't touch it... Perhaps it is linked with the shamans in some strange way?",
    "I have found the cave of ogre shaman, but I cannot touch them!",
    "Can you tell me again what I need for the potion?",
    "I have one right here.",
    "What is the final ingredient?[sic]",
    "I have some of those.",
    "What is the final ingredient?",
    "I have some bat bones; how can I grind them?",
    "Are these ground up well enough?",
    "Any chance of advice about this potion?",
    "I have made the potion.",
    "How high is high enough?",
    "I am still working to rid us of the shamans...",
    "That's one destroyed...",
    "That's the second one gone...",
    "That's the third one dealt with...",
    "There goes the fourth...",
    "That's five! Only one more left now...",
    "Any chance of a hand?",
    "Indeed it did! I wiped out those ogre shamans!",
    "What should I do now?",
    "Do you have any more quests for me?",
    "I lost the scroll you gave me.",
    "That's okay."
  ],
  "Tower guard": [
    "We are the tower guards – our business is our own!",
    "You can't go up there. That's private, that is.",
    "It is the wizards' helping hand - let 'em up."
  ],
  "Wizard": [
    "You'll have to speak with the Watchtower Wizard about that.",
    "You'll have to speak with the Watchtower Wizard about that.",
    "Nope. Try the Watchtower Wizard.",
    "Well, you could ask the Watchtower Wizard for one.",
    "You will need to speak to the Watchtower Wizard. Seriously, he's the one in charge here.",
    "All's well that ends well."
  ],
  "Watchtower Wizard": [
    "Who are you? Are you one of the new guards?",
    "Well what are you doing here?",
    "Oh my, oh my! What does it all matter in the end, anyway?",
    "Oh dear, oh dear. Darn and drat! We try hard to keep this town protected. But how can we do that when the Watchtower isn't working?",
    "The Watchtower here works by the power of magic. An ancient spell designed to ward off ogres that has been in place here for many moons. The exact knowledge of the spell is lost to us now, but the essence of the spell has been infused into four powering crystals that keep the tower protected from the hordes in the Feldips.",
    "The crystals! The crystals have been taken!",
    "Stolen!",
    "Yes, yes! Do I have to repeat myself?",
    "That's typical, nowadays. It's left to us wizards to do all the work.",
    "Help? Oh wonderful, dear traveller! Yes I could do with an extra pair of eyes here.",
    "There must be some evidence of what has happened here. Perhaps you could assist me in searching for clues?",
    "Try searching the surrounding area. If you find anything unusual, bring it here. Try the bushes - I've read enough adventure stories to know that clues get caught in bushes all the time. I will tell the guards to let you past - that way, you can just use the ladder to get in and out.",
    "Hmph! Suit yourself.",
    "Complaining? Complaining! What folks these days don't realise is that if it weren't for us wizards, this entire world would be overrun with every creature you could possibly imagine. And some you couldnt[sic] even conceive of!",
    "Hello again. Did you find anything of interest?",
    "Oh dear, oh dear, there must be something, somewhere...",
    "Hello again. Did you find anything of interest?",
    "Let me see...",
    "No, sorry, this is not evidence. You need to keep searching, I'm afraid.",
    "Interesting, very interesting. Long nails...grey in colour...well chewed... Of course! They belong to a skavid!",
    "A servant race to the ogres: grey, depressed-looking creatures, always losing nails, teeth and hair! They inhabit the caves in the Feldip Hills. They normally keep to themselves, though. It's unusual for them to venture from their caves.",
    "It's no good searching the caves. Well, not yet, anyway.",
    "They are deep and complex. The only way you will navigate the caves is to have a map or something. It may be that the ogres have one...",
    "Well... I don't.",
    "You need to be fearless and gain entrance to Gu'Tanoth, the city of the ogres, then find out how to navigate the caves.",
    "Ogres are nasty creatures, yes. Only a strong warrior, and a clever one at that, can get the better of them.",
    "Well, the guards need to be dealt with. You could start by checking out the ogre settlements found around here. Tribal ogres often dislike their neighbours...",
    "In the meantime, I'll throw those fingernails out for you.",
    "Won't bother? Won't bother! Perhaps this quest is too hard for you?",
    "Ah, it's part of an old ogre statue. I'll see if I can fix it up for you. It might come in handy. There may be more parts to find... I'll keep this for later.",
    "Excellent! That seems to be all the pieces. Now I can assemble it...",
    "How is the quest going?",
    "My, my. A wordsmith as well as a hero.",
    "Take some illumination with you or else it will be dark.",
    "Yes, it will be well guarded. Hmmm, let me see... Ah yes, I gather some ogres are allergic to certain herbs. Now what was it? It had white berries and blue leaves.... Cave nightshade, thats it! You should try looking through some of the caves.",
    "And don't forget to look out for the dragons!",
    "Dragons. Didn't you know that the ogres keep blue dragons as pets and for magical ingredients? Well, regardless, I'm sure a bold, brave adventurer such as yourself won't have any problems.",
    "That's good to hear. We are much closer to fixing the tower now.",
    "That is because of their magical powers. We must fight them with their own methods; do not speak to them! I suggest a potion... Collect a guam leaf, add some jangerberries, then mix in some ground bat bones. It is essential to return it to me before you use it, so that I can empower it with my magic. Be very careful how you mix it as it is extremely volatile. Mixing ingredients of this type in the wrong order can cause explosions! I hope you've been brushing up Herblore and Magic? I must warn you, only experienced magicians can use the potion. It is too dangerous in the hands of the unskilled.",
    "Any more news?",
    "Yes indeed, let me see, what was it again...",
    "You need a guam leaf.",
    "Wonderful! You will need to add that first.",
    "You will also need a guam leaf. That goes into the mix first.",
    "You need some jangerberries.",
    "Wonderful! You will need to add those after the guam leaf has gone in, but before the other ingredient.",
    "You will also need some jangerberries. Those go into the mix before the final ingredient.",
    "The final ingredient is ground bat bones.",
    "A pestle and mortar will more than do the trick.",
    "Yes, those will do nicely.",
    "When you have mixed the potion correctly, then I can empower the potion with magic and the ogre shamans can be destroyed.",
    "Any more news?",
    "That's great news; let me infuse it with magic...",
    "Here it is - a dangerous substance. I must remind you that this potion can only be used if your Magic level is high enough.",
    "Well, if you can cast Bones to Bananas, or any spells beyond that, you should be alright.",
    "Hello again. Did the potion work?",
    "May you have success in your task.",
    "Hello again. Did the potion work?",
    "Magnificent! At last you've brought all the crystals. Now the shield generator can be activated and, once again, Yanille will be safe from the threat of the ogres. Put the crystals on the pillars there and throw the lever to activate the system.",
    "The system is not activated yet. Throw the switch to start it.",
    "Marvellous! It works! The town will now be safe. Your help was invaluable. Take this payment as a token of my gratitude. Also, let me improve your Magic level for you. Here is a special item for you - it's a new spell. Read the scroll and you will be able to teleport yourself here.",
    "Greetings, friend. I trust all is well with you? Yanille is safe at last!",
    "Never mind, have another...",
    "Ho, ho, ho! A comedian to the finish. There it is, in your backpack!",
    "We are always in your debt; do come and visit us again."
  ],
  "Og": [
    "Why you here, little t'ing?",
    "You got no business there! Just a minute... Maybe if you did somet'ing for me, I might help you get in.",
    "South-east of here der is more ogres - the name of the chieftain is Toban. He stole gold from me and I want it back! Here is a key to the chest it's in. If you bring it here, I may reward you...",
    "Kill me, eh? You shall be crushed. Guards!",
    "Where my gold from dat dirty Toban?",
    "Dat is not what I want! If you want to impress me, get da gold I asked for!",
    "Don't come back until you have it, unless you wanna be on tonight's menu!",
    "Oh yeah? What's dat den?",
    "Stoopid! Take another and don't lose it!",
    "Where my gold from dat dirty Toban?",
    "Hah! This little t'ing is pretty smart for such a little t'ing! Pity you don't have any space for your reward.",
    "Well, well, the little t'ing has got it! Take dis to show little t'ing is a friend to da ogres. Hahahahaha!"
  ],
  "Grew": [
    "What do you want, little morsel? You would look good on my plate!",
    "Hah! I should eat you instead!",
    "What can a morsel like you do for me?",
    "Well, well, perhaps the morsel can help after all... If you t'ink you're tough, find Gorad, my enemy to the south- east, and knock one of his teeth out! Heheheheh!",
    "That's not tricky - guards!",
    "The morsel is back. Does it have our tooth for us?",
    "Morsel, you dare to return without the tooth! Either you are stoopid, or wants to be eaten!",
    "It's got it; good, good. That'll annoy Gorad lots! Heheheheh. Here's a token of my gratitude: some old gem I stole from Gorad. And an old part of a statue."
  ],
  "Gorad": [
    "You shut your face! I smack you till you dead and sorry!"
  ],
  "Toban": [
    "What do you want, small t'ing?",
    "Hahaha! You'll never get in there.",
    "Bold words for a t'ing so small.",
    "Hahaha! This creature t'inks it can help me! I would eat you now, but for your puny size. Prove to me your might: bring me the bones of an adult dragon to chew on, and I'll eat them, not you.",
    "Hahaha! It t'inks it's a match for Toban, does it?",
    "Hahaha! Small t'ing returns. Did you bring the dragon bone?",
    "Then you shall get nothing from me!",
    "Hahaha! Small t'ing has done it. Toban is glad, but you can't hold his reward; you'd best put somet'ing down.",
    "Hahaha! Small t'ing has done it. Toban is glad - take this..."
  ],
  "Watchtower wizard": [
    "Hmm, yes, it is as I thought... A statue symbolising an ogre warrior of old. Well, if you ever want to make friends with an ogre, this is the item to have!",
    "More quests? No, indeed, adventurer. You have done us a great service, already."
  ],
  "Ogre guard": [
    "Well, what proof of friendship did you bring?",
    "Why have you returned with no proof of companionship? Back to whence you came!",
    "It's got the statue of Dalgroth. Welcome to Gu'Tanoth, friend of the ogres.",
    "Oi! Where do you think you are going? You are for the cooking pot!",
    "Prove it to us with a gift. Get us something from the market.",
    "Surprise us...",
    "You can help by being tonight's dinner, or you can go away. Now, which shall it be?",
    "Back to whence you came!",
    "Grrrrr!",
    "Stop, creature! Oh it's you. Well, what have you got for us, then?",
    "Well, well, look at this. My favourite: rock cake! Okay, we will let it through.",
    "What do you want, small thing? Leave us alone!",
    "Oi! Little thing. If you want to cross here, you must pay me 20 gold pieces first!",
    "That's what I said, like it or lump it.",
    "A wise choice, little thing.",
    "In that case you're not crossing.",
    "Creature, did you bring me the gold?",
    "It's brought it! On your way."
  ],
  "Ogre trader": [
    "Arr, small thing wants my food, does it? I'll teach you to deal with ogres!"
  ],
  "City guard": [
    "Grrrr, what business you got here?",
    "So what you want with me?",
    "I would like to see you try!",
    "Is that so... You humour me small t'ing, answer this riddle and I will help you... I want you to bring me an item: I will give you all the letters of this item, you work out what it is... My first is in days, but not in years, My second is in evil, and also in tears, My third is in all, but not in none, My fourth is in hot, but not in sun. My fifth is in heaven, and also in hate, My sixth is in fearing, but not in fate, My seventh is in plush, but not in place. My eighth is in nine, but not in eight, My last is in earth, and also in great. My whole is an object, that magic will make, It brings wrack and ruin to all in its wake... Now how long, I wonder, will this riddle take?",
    "Hur, hur. The imp has done it! Thanks for the rune; this is what you be needing..."
  ],
  "Skavid": [
    "Gor cur...",
    "Bidith tanath...",
    "Cur bidith...",
    "???",
    "Ig! Bidith ig!",
    "Bidith ig!",
    "Gor cur...",
    "???",
    "Ar, ar cur!",
    "Ar cur!",
    "Bidith tanath...",
    "Cur, cur tanath!",
    "???",
    "Cur tanath!",
    "Tanath gor...",
    "???",
    "Nod, gor nod!",
    "Gor nod!"
  ],
  "Scared skavid": [
    "Tanath cur, tanath cur!",
    "Don't hurt me, don't hurt me!",
    "Please don't touch me!",
    "I don't have anything; please believe me!",
    "I'm begging your kindness; I don't have it!",
    "Ahhhhh, help!",
    "Thank you, kind sir. I'll tells you where that things you wants is. The mad skavids have it in their cave in the city. You will have to learn skavid, otherwise they will not talks to you. Here, I'll tell you what you need to know...",
    "Tanath cur, tanath cur!",
    "I cannot help you, but the others can. Let me tells you the most common skavid words: Ar, nod, gor, ig and cur. Those will gets you started.",
    "Master, how are you doing learning our language?",
    "Master, my kinsmen tell me you have learned skavid. You should speak to the mad ones in their cave."
  ],
  "Ogre shaman": [
    "You shut your mouth! Don't tell them anything!",
    "Hur, hur, hur. Stoopid dragon!",
    "Take dis!",
    "Hur, hur, hur, hur!",
    "Grr! How dare you talk to us?",
    "Grr! How dare you talk to us?",
    "You are no match for our magics!",
    "You are no match for our magics!"
  ],
  "Mad skavid": [
    "Tanath gor ar bidith?",
    "Ar cur...",
    "Bidith ig...",
    "Cur tanath...",
    "Gor nod...",
    "???",
    "Hehe! So you speak a little skavid, eh? I'm impressed. Here, take this prize. The others are with the shamans in the enclave - you'll never get them back. They hid one in the sacred rock - nothing can touch it now."
  ],
  "Enclave guard": [
    "No you don't!",
    "What do you want?",
    "Oh you do, do you? How about 'no'?",
    "You dare mock me, creature!",
    "What is this? Arrrrgh! I cannot stand this plant! Argh, it burns! It burns!"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Watchtower?oldid=36218524’"
  ]
}