{
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "Other dialogue options may not have been included yetYou can discuss this issue on the talk page or edit this page to improve it."
  ],
  "Senliten": [
    "Greetings, Player.",
    "Not at this moment: you need to learn more of the desert, first.",
    "Greetings, Player.",
    "Perhaps, but first let me tell you a story. My memories have only recently returned to me, and it is an indulgence to share them with someone. Early in my time as Pharaoh, I toured across my kingdom to learn more of the places and people within it. I travelled with a large retinue on a boat up and down the River Elid. Throughout our journey, we were followed by a large crocodile. A few times, we'd lose sight of it for days on end, only for it to make its presence known on the next morning. We did not know if it was stalking us or acting as an escort. Crocodiles were known to sometimes attack and eat humans, but they are also revered by us for their tenacity and modesty. All thought of it was forgotten, however, when we were set upon by a small scouting force of the ancient one. This was before open war had broken out with him. We managed to fend them off, but during the skirmish our boat was damaged and began taking on water. It was at this moment that the crocodile made its final appearance. The boat sank and we all found ourselves in the water with the crocodile, it's[sic] hunger ignited by the smell of blood in the air.",
    "Perhaps, but while she was being dragged away, it allowed the rest of us time to swim to the relative safety of the riverbank.",
    "I made it safely out of the water, my retinue putting themselves between me and the crocodile as we swam.",
    "In those times, life in this region was nowhere near as harsh as it can be now. It was not uncommon to see those who had difficulty dealing with abundance. One member of my retinue, whose particular vice was food, had grown quite large in her years. She swam slowly, but the crocodile did not... Within seconds it was on her, and dragged her beneath the surface, neither of them to be seen again.",
    "Within this event, I learned a truth. The crocodile, hungry as it was, could have easily attacked all of us, yet it chose to expend its efforts on only one. With the least amount of effort, it received the largest possible meal. While they may be dangerous animals, if you understand them you can safely navigate their waters. It also taught me a lesson in moderation, to only take what was needed - a lesson that has served my people well once this land became a desert.",
    "It appears that, in recent years, the crocodiles along the River Elid are no longer sated so easily. Leela?",
    "I need your help, Player. You must investigate why crocodiles have become so gluttonous of late. Something is not right.",
    "It has everything to do with Crondis.",
    "I see you do not connect this with the goddess Crondis? Go to the city of Sophanem: Leela tells me that the Sphinx still abides there. She and a local priest called Jex know much about minor deities. Discover all there is to know about a goddess called Crondis. Doing so will illuminate the importance of the desert crocodiles.",
    "Greetings, Player.",
    "Of course.",
    "Perhaps, but while she was being dragged away, it allowed the rest of us time to swim to the relative safety of the riverbank.",
    "Early in my time as Pharaoh, I toured across my kingdom to learn more of the places and people within it. I travelled with a large retinue on a boat up and down the River Elid. Throughout our journey, we were followed by a large crocodile. A few times, we'd lose sight of it for days on end, only for it to make its presence known on the next morning. We did not know if it was stalking us or acting as an escort. Crocodiles were known to sometimes attack and eat humans, but they are also revered by us for their tenacity and modesty. All thought of it was forgotten, however, when we were set upon by a small scouting force of the ancient one. This was before open war had broken out with him. We managed to fend them off, but during the skirmish our boat was damaged and began taking on water. It was at this moment that the crocodile made its final appearance. The boat sank and we all found ourselves in the water with the crocodile, it's[sic] hunger ignited by the smell of blood in the air.",
    "I made it safely out of the water, my retinue putting themselves between me and the crocodile as we swam.",
    "In those times, life in this region was nowhere near as harsh as it can be now. It was not uncommon to see those who had difficulty dealing with abundance. One member of my retinue, whose particular vice was food, had grown quite large in her years. She swam slowly, but the crocodile did not... Within seconds it was on her, and dragged her beneath the surface, neither of them to be seen again.",
    "Within this event, I learned a truth. The crocodile, hungry as it was, could have easily attacked all of us, yet it chose to expend its efforts on only one. With the least amount of effort, it received the largest possible meal. While they may be dangerous animals, if you understand them you can safely navigate their waters. It also taught me a lesson in moderation, to only take what was needed - a lesson that has served my people well once this land became a desert.",
    "It appears that, in recent years, the crocodiles along the River Elid are no longer sated so easily. Leela?",
    "I need your help, Player. You must investigate why crocodiles have become so gluttonous of late. Something is not right.",
    "I see you do not connect this with the goddess Crondis? Go to the city of Sophanem: Leela tells me that the Sphinx still abides there. She and a local priest called Jex know much about minor deities. Discover all there is to know about a goddess called Crondis. Doing so will illuminate the importance of the desert crocodiles.",
    "Greetings, Player.",
    "I see you do not connect this with the goddess Crondis? Go to the city of Sophanem: Leela tells me that the Sphinx still abides there. She and a local priest called Jex know much about minor deities. Discover all there is to know about a goddess called Crondis. Doing so will illuminate the importance of the desert crocodiles.",
    "Greetings, Player.",
    "Crondis was once a crocodile, turned into a deity by Tumeken, father of the Kharidian lands. Crocodiles are her symbol, her greatest supporters and her mortal embodiment. Of all the gods, Crondis is the most moderate. For the crocodiles of the Elid to so brazenly attack people suggests all is not well with her. It will not be long before this sign of such rapaciousness spreads to the people of the desert, if it has not done so already. The crocodiles must be restored their modesty. They must return to being measured, determined and restrained. I must ask that you do this for me. I cannot leave this tomb yet, and I need Leela to act as my temperance.",
    "There is a relic, housed within this mastaba, that should help you to locate Crondis. After the crocodile attack, my group was stranded in the desert. It was only through the learning of the crocodile's modesty that we were able to survive. As we set out on our long journey back home, we took what food and water we needed from the Elid and it sustained us. After these lands became a desert, however, finding food and water became much harder, and so I sought out a genie to create a relic for me with which to locate these things should I ever have need.",
    "Indeed, they are tricky and fickle beings, but not without their uses. This one created for me a dowsing rod, which can find an oasis in any desert. It is housed in the model barque - a replica of the boat that sank that day - on display in the entrance to this mastaba. You have my permission to remove this dowsing rod relic from my tomb without becoming cursed. Use it to locate Crondis and set things right.",
    "Greetings, Player.",
    "You are to recover the dowsing rod relic from the model boat within the entrance to this mastaba, and use it to located[sic] Crondis such that you may set things right with her.",
    "Greetings, Player.",
    "Being so far underground must be sending it haywire. Go up to the surface and try activating it.hings right with her.",
    "Greetings, Player.",
    "Of course! The rod hasn't been tuned to look for Crondis so it just searches for what it knows.",
    "I cannot, but I know the ones who can. You should seek out the Elid elementals. They can be found in a cavern at the source of the River Elid. Be careful, though. I have heard of adventurers perishing at the hands of the Saradominist golems that dwell there.",
    "Also, the dowsing rod relic can be used as a key to enter their dwelling.",
    "Greetings, Player.",
    "Well? Did the Elid elementals tune the dowsing rod to find Crondis?",
    "Please hurry. Travel to the source of the River Elid and find them. You can use the dowsing rod relic as a key to enter their dwelling.",
    "Greetings, Player.",
    "Ensure you show Crondis the proper respect - she is a goddess, after all.",
    "Greetings, Player.",
    "What did she say?",
    "What was it?",
    "A demon? This sounds like the work of Amascut. Whatever happens, you must rid Crondis of this entity. No doubt it was what was causing her greed.",
    "Greetings, Player.",
    "That is good news, but what of Crondis?",
    "I warned you both before - this is not a place for your squabbles.",
    "Do you not see the folly in that, Osman? People are ruled, not places.",
    "I'm sorry, Leela, but your father just isn't ready to listen.",
    "Greetings, Player.",
    "Let us not dwell on Osman's visit. How fare things with Crondis? I can feel her restraint returning to the desert. What caused it?",
    "Yet another scheme of the Devourer's. It concerns me greatly that there may be reason behind her acts of corruption we are yet to understand.",
    "That seems as good a plan as any, Player. Please continue to assist this Ozan character. For now, however...",
    "Greetings, Player.",
    "Thank you for setting things right with Crondis. I can already feel her modesty returning to the hearts of the Kharidian people."
  ],
  "Player": [
    "Can I be of service?",
    "Can I be of service?",
    "That's awful.",
    "What happened to you?",
    "What happened to your retinue?",
    "Where are you going with this?",
    "This is a nice story and all, but why mention it now?",
    "Sorry, I can't help right now.",
    "Is this something to do with Crondis?",
    "Why is this important? Can the locals not just fend off the crocodiles?",
    "Last time we spoke, you told me a story. Can we talk of it?",
    "That's awful.",
    "What happened to you?",
    "What happened to your retinue?",
    "Where are you going with this?",
    "This is a nice story and all, but why mention it now?",
    "Sorry, I can't help right now.",
    "Why is this important? Can the locals not just fend off the crocodiles?",
    "Why is this important? Can the locals not just fend off the crocodiles?",
    "Hello, Jex.",
    "Could you tell me more about the minor gods?",
    "Could you tell me more about Crondis?",
    "That must be awkward when buying helmets.",
    "What kind of people follow her?",
    "How so?",
    "Why?",
    "Could you tell me more about Crondis's connection with crocodiles?",
    "I think I've learnt abough about Crondis... I think I understand why she is so important.",
    "Could you tell me more about Crondis's followers?",
    "I think I've learnt abough about Crondis... I think I understand why she is so important.",
    "Good day.",
    "Ummm, yes.",
    "I need help.",
    "Can you tell me about the gods of the Menaphites?",
    "Tell me about Crondis.",
    "Coming from a mixed up creature like yourself, that's an interesting criticism. Any other information you can impart?",
    "I think I've learnt abough about Crondis... I think I understand why she is so important.",
    "Okay, so you need me to discover where Crondis is and find out what might be wrong with her? How do I do that?",
    "That can't have been easy - I've had to deal with a genie myself, not long ago.",
    "What was I doing again?",
    "I've got the dowsing rod. Now what?",
    "This doesn't look like a place you'd find Crondis, I'll give this another try.",
    "I think I see a pattern here... One last try!",
    "Another Oasis!? [sic] This isn't working out, I'm heading back to Senliten.",
    "Senliten, the dowsing rod keeps taking me to oases in the desert. How can I make it lead me to Crondis?",
    "Could you charge it for me?",
    "Somehow I don't think that's going to be a problem.",
    "Oh, and I seem to remember I'll need a rope to get in...",
    "Oh, I haven't visited them yet.",
    "Hello? You know I'm here, right?",
    "I need your help to charge this dowsing rod - I'd like to find Crondis to discover why she's been so silent recently.",
    "So an intervention is in all four of our interests?",
    "I've found Crondis! The dowsing rod led me to a sunken pyramid in the mouth of the River Elid. There's a ferryman in Menaphos named Kags who's happy to take me there.",
    "I'll return and see if there is anything she can do to stop the crocodile attacks.",
    "Really, you don't charge?",
    "Are you okay? You seem like you don't want to be here.",
    "My name is Player. I came here to visit the, er, you...and to make sure everything was alright with you. Is it?",
    "There have been reports recently of crocodiles attacking people living on the river's edge.",
    "You might know how to put a stop to it?",
    "*whispers* Um, what should I do? Should we stand still so she can't see us?",
    "*whispers* Well, what then?",
    "*whispers* Where can I get a beltfish?",
    "Here, I have what you asked for!",
    "*whispers* Toothpicks? Where can I get toothpicks? Hey, also, what's a toothpick?",
    "Here, I have what you asked for!",
    "Here, I have what you asked for! Please let that be enough.",
    "Oh, thank goodne-",
    "*whispers* Sorry... What do you need?",
    "*whispers* That's the Agility Pyramid, right? Will do.",
    "Here, I have what you asked for!",
    "Here, I have what you asked for! Surely, you've had enough by now...oh, great Crondis?",
    "*whispers* Plovers?",
    "Here, I have what you asked for!",
    "Here, I have what you asked for!",
    "*whispers* Did she just eat all of those plovers? Excuse me, but did you just eat all of those plovers? It took me ages to catch those!",
    "*whispers* Thanks a lot, Tamsah; you're such a croccy's boy. Fine, where do I get these croc ices?",
    "Here, I have what you asked for!",
    "Here, I have what you asked for!",
    "THAT'S ENOUGH!",
    "Yes, I dare! Get a hold of yourself! You're nothing but a greedy bully! You're no goddess.",
    "You'll what?",
    "Go on, then, what are you going to do?",
    "Spit it out, already!",
    "I didn't mean literally!",
    "I put my foot down with Crondis - I told her outright there would be no more food deliveries from me.",
    "It's more what she did than what she said. She got so angry with me, I didn't know what she was going to do, but all of a sudden she stopped and something flew out of her mouth.",
    "I think it's some sort of crocodile demon, a manifestation of whatever was corrupting Crondis.",
    "I managed to defeat the crocodile demon!",
    "Oh, right, yes. I should probably go and check on her, see if she is alright.",
    "Is there anything you can do about the crocodiles attacking people?",
    "Be seeing you two!",
    "What would you have done if I wasn't around?",
    "Crondis is all better now, I think. After I destroyed her manifest corruption, she became a lot more reasonable. She agreed to put an end to the crocodile attacks immediately. The Devourer tricked her into ingesting some sort of corruption, which affected the crocodiles of the River Elid.",
    "What can we do but react as we discover each of her plots? It's not like we can just ask her.",
    "Ozan believes she's working below Menaphos.",
    "He's trying to track down what happened to the Kharid-ib. I'm helping him search the tombs beneath the city.",
    "Ah, so-so. How are things with you and Crondis?",
    "My travels are going so-so, but thank you, Crondis[sic]",
    "I should definitely get out of here."
  ],
  "Leela": [
    "Indeed. I have gathered reports from both Pollnivneach and Nardah of locals being attacked and eaten, dragged back to the river. These attacks are becoming more and more frequent, and the people are afraid.",
    "Indeed. I have gathered reports from both Pollnivneach and Nardah of locals being attacked and eaten, dragged back to the river. These attacks are becoming more and more frequent, and the people are afraid.",
    "You know what I'm doing here! I'm working with Senliten for the betterment of all!",
    "How can I trust you when you won't share it with me? You just wanted me safe, out of the way. Your plotting just creates more corruption; we're working to remove it!",
    "You're too blind to see it!",
    "He's only going to make things worse...",
    "How can we figure out what she's up to?",
    "Can we not? She seemed particularly unhinged when we faced her, if we could but track her whereabouts.",
    "Ozan? So that's where he went? How is he doing?"
  ],
  "Jex": [
    "Hello, Player.",
    "Jex rubs his head tenderly.",
    "Crondis is a ferocious lady with the head of a mighty crocodile.",
    "Enough flippancy: remember she is a deity, and this is her place of power.",
    "She embodies modesty, diligence and resourcefulness, so Crondis is worshipped by the desert's subsistence farmers and hunters. Conversely, she proves unpopular amongst society's elite.",
    "Crondis teaches that people should take no more than they need and make do with little, which, as you can imagine, conflicts with the values of many in the richer echelons of society. In Menaphos, she is particularly frowned upon, although that is hardly surprising.",
    "The Pharaoh of Menaphos is a greedy, cruel man whose lack of restraint is beyond even Crondis's help. Excuse me, I should not have spoken that way. It is unwise to speak ill of one's betters.",
    "Crondis was once a crocodile. Many people believe that those that hunt in the waters of the River Elid embody her very spirit. They were her most beloved supporters. When I was young, people were wary of them, revered them even, but were not afraid of them. With all the recent crocodile attacks, that has changed. I'm afraid that the growing lack of restraint of the crocodiles along the River Elid is only further proof that not all is well with Crondis.",
    "Crondis is worshipped by those who rely upon their own ingenuity to survive: sailors, engineers and rouges hold her in high regard. Due to her popularity amongst seafarers, word of Crondis has spread far and wide and her followers can be found in a great number of exotic places."
  ],
  "Sphinx": [
    "Ah, how interesting...a cat. Come here to me, kitty.",
    "Do you think that you'll be able to communicate with me at a deeper level because you're wearing that amulet of catspeak?",
    "Foolish human, am I not part human?  The Sphinx shakes her head in bemusement.",
    "What with? Your cat tells me that you have held The Devourer at bay.",
    "I suppose I could spare a moment or two. Who do you want to know about?",
    "Crondis is the lesser deity of resourcefulness and unassuming cunning. She has the head of a crocodile, which I don't see as being physically pleasant.",
    "There is a place sacred to Crondis in the Temple of the Lesser Gods in the north-east of this city. Jex there should know more about this deity."
  ],
  "Cat": [
    "Meow."
  ],
  "Nirrie": [
    "We didn't expect to see another of your kind",
    "What? How did we not know that thou",
    "Of course, we knew you",
    "Alas, Crondis is not silent, we",
    "Crondis is all she has to remember her husband's ingenuity and resourcefulness by and",
    "There, it is done. We have",
    "It is vital that you go to where",
    "Your rod has been",
    "Really?",
    "You know we have. It's a waste of",
    "Leave us alone. We have much to discuss."
  ],
  "Tirrie": [
    "here again so soon.",
    "art here for aid on your pilgrimage to Crondis?",
    "were here before you did.",
    "Her greed makes the swirling sound of an insatiable vortex, a rapacious whirlpool that will inevitably lead to every drop in this destitute desert drying up.",
    "the tides of her timeless love for him should not be stemmed by Crondis's gluttony.",
    "repurposed that artefact you hold",
    "Crondis is, and quickly. The crocodiles help us protect the river, and when they are",
    "more importantly, it throws the esturaries[sic] into imbalance.",
    "charged. Be careful not to lose it again, or you may need to bring us",
    "time-"
  ],
  "Hallak": [
    "Well, I did. Knew thou has been coming for ages.",
    "Although I knew first. Speak.",
    "just don't have the luxury of being so deaf.",
    "All three of our interests. We are one, and Elidinis wishes for change too.",
    "you may use it to locate Crondis.",
    "feral. we[sic] really have to pick up the slack and,",
    "a turnip.",
    "Have you ever wondered what it's like to be soup?",
    "vegetables. Time vegetables."
  ],
  "Portmaster Kags": [
    "Hi, I'm Kags, the portmaster round here. I run a volunteer transportation service and I'm going places!",
    "I just love the ocean! Where would you like to go?"
  ],
  "High Priest of Crondis": [
    "Ah, pilgrim. Are you here to serve the mighty Crondis? *whispers* Please say yes.",
    "Hahahahaha! Of course I want to be here. Why would you say that? Why? *whispers* Why? Keep it down, you'll upset her.",
    "I have the honour of tending to the delectable Crondis. Are you here to assist me in this honour? *whispers* She's insatiable. I need help.",
    "*whispers* It really isn't.",
    "*whispers* Now you've done it.",
    "*whispers* I don't think that works on crocodiles.",
    "How about a beltfish, oh great one? You like those, don't you?",
    "*whispers* You can fish them in Menaphos. Best catch one yourself; she only likes them fresh.",
    "*whispers* And please, for the love of Crondis, hurry up!",
    "*whispers* We make our own; Crondis only likes locally-sourced wood. She says the acadia logs found in Menaphos are the best - just go cut and bring me a couple of those and I'll make the toothpicks.",
    "*whispers* Thank you!",
    "*whispers* Don't say no! She hates hearing that wor-",
    "*whispers* Or more likely me...",
    "*whispers* It's never enough. She's insatiable.",
    "*whispers* Don't, you'll jinx it!",
    "*whispers* Now look what you've done; I'll have to go on the roof now, and I'm scared of heights!",
    "*whispers* Could you bring me four of the golden pyramid tops from Jaleustrophos, please?",
    "*whispers* See what I mean? It just doesn't stop. Help me...",
    "*whispers* Thank you!",
    "*whispers* What are you doing?",
    "*whispers* That line never works for me.",
    "*whispers* Plover birds. They apparently like cleaning bits of food out of crocodiles' mouths, so my croccy god tells me. *whispers* They tend to wade in the mouth of the River Elid; you'll find some on the Sophanem side of the river. *whispers* It never ends. She is so demanding. So...greedy!",
    "*whispers* Thank you!",
    "*whispers* Oh, goddesses...",
    "*whispers* Don't question her; best to just keep quiet.",
    "How about some croc ices, oh delectable one? You love those, don't you?",
    "It's a desert...I mean a dessert. We get them imported from a man in Nardah named Rokuh. Just bring one.",
    "*whispers* Actually, you'd better grab more than that - they're hard to stop eating once you start.",
    "*whispers* Thank you!",
    "*whispers* You're crazy!",
    "*whispers* You'd better go, and quickly! I'll try to calm her down...",
    "*whispers* Uh oh, now you've done it. You've gone too far this time. We're doomed...",
    "I don't even know what you destroyed there, I never saw you eat one of those, Great One.",
    "I always feel better after throwing up, my almighty Lord. *whispers* Stress of the job...",
    "*whispers* Oh, no!",
    "*whispers* She could just do that the entire time?",
    "*whispers* Please, don't leave me.",
    "I said: I hope you never leave me, almighty Crondis[sic]",
    "That thing you killed looked pretty terrifying!",
    "Well, I've learned a few tricks for subduing crocodiles. You just have to grab their jaw to stop it from opening.",
    "If only my hands were big enough for this one...",
    "But an all-powerful deity that still can't scratch her own back? Sounds like you need me!",
    "So good to see you. How are your travels faring?",
    "Much, much better. Spitting up that icky thing has really curbed her hunger and improved her...",
    "They said that the travels are going so-so[sic]",
    "'Be my high priest', she said. 'All my commandments will go through you', she said. Do you not wonder how she isn't wrinkly from being in the bath so long? She was a human when she got in.",
    "No but you were a quarter of the size. Those croc ices aren't low-calorie, you know, and it's not like you swim like when you were younger!"
  ],
  "Crondis": [
    "Who is it, Tamsah? Tell them to go away - I'm bathing.",
    "Of course! Could not be better. Why would you think otherwise?",
    "Ha! Crocodiles get hungry too, you know. It's nothing, I'm sure. Though, now you mention it...",
    "What? No! I'm hungry too. Bring me something!",
    "Well? Where is my snack? Or should I just eat one of you two instead?",
    "Eeny!",
    "Meeny!",
    "Miny!",
    "Haha! Yes! Bring me a beltfish...freshly caught!",
    "Where is my beltfish?",
    "Mmm, lovely!",
    "But now I have fish bits in my teeth! Bring me some toothpicks!",
    "This time make it TWO!",
    "No? No! You don't deny Crondis! Bring my food or I'll eat you instead!",
    "Where are my acadia logs?",
    "Where are my acadia logs?",
    "Where are the rest of them?",
    "Yes! That's enough food for now.",
    "Now I want something shiny! Tamsah, our pyramid top could do with replacing!",
    "FOUR golden pyramid tops! Shiny!",
    "I say when I've had enough! And I haven't! And I won't! Go, get what I want! Where are my pyramid tops?",
    "Where are my pyramid tops?",
    "Where are the rest of them?",
    "NO! I say when I've had enough. Those toothpicks didn't do the job! Bring me some plovers; they clean Crondis teeth good!",
    "EIGHT little plover birds, cleaning out my teeth!",
    "It is going to happen. Do you know why it's going to happen? Because I DEMAND IT! Where are my plover birds?",
    "Where are my plover birds?",
    "Where are the rest of them?",
    "YUMMY PLOVERS!",
    "Of course! How else would they clean my teeth save for with their crunchy little bones? Or did you think they'd magically peck away at leftovers stuck in my teeth?",
    "Now I want something SWEET!",
    "Ooh, goody! Well done, Tamsah!",
    "NOT ONE! SIXTEEN! BRING ME SIXTEEN CROC ICES!",
    "YES! YES! YES! YES! YES!",
    "Where are my croc ices?",
    "Where are my croc ices?",
    "Where are the rest of them?",
    "More croc ices! More, more more! Bring me MORE!",
    "I want thirty-two croc ices now! Go, get them!",
    "YOU DARE...?",
    "I AM! I AM CRONDIS! I WILL...",
    "I WILL...",
    "I WILL...",
    "Where am I? I feel like this is the first time I've seen clearly in a long time.",
    "You realise that I can hear you, Tamsah? Regardless, this can wait until later. Is there anything I can do for you, Player?",
    "Crocodiles are attacking people? That will just not do! Consider it done.",
    "Now, after all that work, I couldn't be hungrier...",
    "*snaps fingers*",
    "A croc ice! Just one, though; can't be greedy.",
    "Is there a frog in your throat, Tamsah? No? Want a crocodile in there?",
    "What was that? Speak up, high priest!",
    "That's so sweet. You may leave with my blessing, Player.",
    "Tamsah, can you come over here? My back needs doing and my arms are too small to reach.",
    "You should probably be on your way, Player. I think my high priest has forgotten I'm an all-powerful deity.",
    "I do, but remember your place.",
    "Ooh, is that Player? Ask them how their travels are going!",
    "I asked them, Tamsah...",
    "Stop being ridiculous, Tamsah.",
    "Cease your impudence! And come wash my back."
  ],
  "Crondis still wants you to deliver acadia logs": [
    "[amount missing]"
  ],
  "Crondis still wants you to deliver pyramid tops": [
    "[amount missing]",
    "[amount missing]"
  ],
  "Crondis still wants you to deliver plover birds": [
    "[amount missing]",
    "[amount missing]"
  ],
  "Crondis still wants you to deliver croc ices": [
    "16",
    "[amount missing]",
    "[amount missing]"
  ],
  "Rokuh": [
    "Come one, come all, buy my amazing choc ice invention here! Chocolate on the outside. Iced cream on the inside. Oh I also have some chocolate left over from making choc ices which I'm selling too.",
    "Why, yes I do! I've just recently started stocking some for a customer near Menaphos. I have to warn you, though - they are VERY moreish. They are so delicious, it's hard to stop at just eating one. Though, you should be aware you'll have to deliver them by foot. Any sort of magical interference and they'll melt."
  ],
  "Ukunduka": [
    "I will devour you whole.",
    "I'd rather have a bowl of croco pops.",
    "You are nothing but a tiny morsel.",
    "Could have done with more salt; I'm sure you've got plenty to spare.",
    "That food was delicious!",
    "Yuck! That was cooked horribly."
  ],
  "Osman": [
    "What are you still doing here?",
    "No, I am working for the betterment of all! You are playing with animals. My plan will work, you just have to trust me!",
    "Like with your crocodile taming? How exactly does that help anything?",
    "I am not blind, I'm just focussed on the big picture - Menaphos! Your work only helps individuals; my plan helps everyone.",
    "Yet one cannot be done before the other. I'll hear no more! Besides, we have company...",
    "I give up with you, Leela - you're as willful as your mother was. I can't, however, understand why you waste your time with this nonsense, Player. When you're ready to make a serious contribution to our cause, come see me in Al Kharid."
  ],
  "Jabari": [
    "Mighty Pharaoh, I bring you some troubling news.",
    "Crondis has somehow managed to shake off my mistress's shackles.",
    "Well, I'm afraid we lose the free fear keeping many Menaphites inside the walls; we can up our payments to the bandits and thugs around the desert as a substitute.",
    "Indeed, sire."
  ],
  "Pharaoh": [
    "Speak.",
    "WHAT? The last thing I need is deities running rampant on my doorstep! What are our options?",
    "Good. Make it so. We may have to pay Crondis a visit sooner or later. Time is ticking away for her and her kind. We'll see how she likes the taste of my wrath! The new must consume the old, and the time of the pantheon is coming to a close. Soon, the whole world will know a new master!"
  ],
  "Khoochak": [
    "*braaak* Hello, friend. *raaawwwwk*",
    "*braaak* Forgot an adventure? Ask the parrot. *raaawwwwk*",
    "*braaak*",
    "Met with Crondis, greedy Crondis.",
    "Brought her a croc ice!",
    "Brought her a croc ice!",
    "Brought her a croc ice!",
    "Brought her a croc ice!",
    "Brought her a croc ice!",
    "That joke got old quick! Bored now.",
    "She spat something up! Disgusting, gross - kill it with fire!",
    "I'm talking about you now.",
    "*raaawwwwk*",
    "*braaak* Get lost, bucko. *raawwwwk*"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Crocodile_Tears?oldid=23438320’"
  ]
}