{
  "King Roald": [
    "Is there no way that you will reconsider?",
    "We talked about this, Ella.",
    "We can't send troops away from the cities. You know this!",
    "Not helpful, my dear.",
    "Adventurer, I have a task for someone willing to take on a great burden...but with the opportunity to reap greater rewards. Would you like to hear more?",
    "A threat looms over the three Saradominist kingdoms.",
    "We have suffered through famine and war. We need time to recover and rebuild.",
    "But in the Wilderness beyond the northern border, Zamorakian forces ready for the attack.",
    "The Kingdom of Misthalin stands at the forefront. The other kingdoms can offer little aid.",
    "We are not prepared to fight another war. Even the city of Varrock is vulnerable.",
    "We must do what we can to protect the undefended lands to the south.",
    "In the near Wilderness is a site of strategic importance, a vale that has seen countless battles..",
    "Claim this place. Establish a fortification there and be ready for the retaliation when it comes.",
    "Do this, and we will declare your domain a new duchy of the Kingdom. You will rule over it in our name as a peer of the realm.",
    "Claim the vale, establish a fort there, and join the ranks of the Misthalinian nobility.",
    "You are not the first I have dispatched on this endeavour. The last group had an architect with them, perhaps he survived.",
    "If not, you can always recruit your own staff. A noble is responsible for maintaining their own household, after all.",
    "Naturally.",
    "If it had an official name, it has been lost to history. The border patrols call it the Grieving Vale.",
    "It is part of the region we now know as the Wilderness. In ancient times it was called Forinthry.",
    "A fitting name for your new domain - if you are able to hold it.",
    "The vale has a colourful history. It's been the site of countless bloody battles over thousands of years.",
    "It's a critical position, strategically speaking. It sits a short way into the Wilderness, on the path between Misthalin and Daemonheim.",
    "It also looks out onto an estuary, giving access to the Eastern Sea.",
    "It's one of the most hotly contested territories in the world, and one that nobody has been able to hold for long without meeting a grisly end.",
    "Not to worry! I wouldn't be sending you out there if I didn't think you could do it.",
    "The Zamorakians in the Wilderness have been preoccupied fighting amongst themselves.",
    "This gives us an opportunity to establish a barrier between their forces and Varrock, which is close enough to the border to be under threat.",
    "I have no doubt that they will soon resume their assault on us, and I want to be ready.",
    "Our forces are perilously depleted. Raids are ongoing, and I cannot risk moving troops away from the towns and cities.",
    "To be perfectly clear this is neither a right nor a responsibility I am assigning you.",
    "In times past land was claimed by those with the strength to defend it.",
    "That opportunity is all I can offer. If you fail, I will send others.",
    "Besides a noble title, and a domain of your own? Some spend their entire lives seeking such a reward, you know.",
    "Your position would be a unique one, affording you greater freedom than most nobles.",
    "I assure you I will be a much better friend to you than an enemy.",
    "And as for the Queen... well, you really don't want to upset Ellamaria. Trust me on that.",
    "Not meaningfully. I cannot spare money, forces or materials.",
    "The purpose of our political structure is that each duchy is largely autonomous.",
    "In times of legend, when the gods themselves walked the world, the god Zamorak obliterated an entire continent to defeat his enemies.",
    "For two thousand years it has remained a scorched wasteland, haunted by ghosts and prowled by demons. Despite all this, those who still follow Zamorak's tenets regard it as their own.",
    "No doubt they will see you as a challenge. Be ready to face their reprisal.",
    "Splendid! East of Varrock is the King's Road. Follow it north to the Wilderness and you'll find the vale.",
    "Very well. Should you change your mind, the offer remains open.",
    "That is a shame.",
    "Sorry adventurer I got other duties to attend to. Please hurry and save Bill from an unfortunate fate."
  ],
  "Veteran Adventurer": [
    "Sorry m'lord - not worth the risk. That place...",
    "It's cursed.",
    "Cowards? Wait a moment now..."
  ],
  "Queen Ellamaria": [
    "Here we go...",
    "We're wasting time and gold on these cowards.",
    "Silence! One more word and you'll be picking your teeth up off the floor.",
    "This is useless. We should just send an army. I'll lead them myself if I have to!",
    "Tsch...",
    "That depends. Are you a rank craven, like everyone else we've seen today?"
  ],
  "Player": [
    "Am I interrupting something?",
    "On my own?",
    "Why has there been so much fighting over it?",
    "I...see.",
    "That sounds like something your troops would be suited for, though.",
    "Actually, I'm a bit busy right now.",
    "Thanks. Are you the architect?",
    "Are you always this...candid?",
    "I... suppose that's fair.",
    "Hang on! I've come out here to claim the duchy as my own, and that's what I'm going to do.",
    "I don't believe what I'm hearing.",
    "The people of Misthalin are in danger! Someone has to protect them, and that person is me.",
    "The King himself sent me here to establish a fort, and by the gods I'm going to do it!",
    "Are you with me? Are you with me, Bill?",
    "That's more like it. Glad to have you with me, Bill.",
    "We can do it, Bill. You and me.",
    "We just need to start small. You're the architect, what do we build first?",
    "Perfect, we'll start there.",
    "So how do we build a workshop?",
    "What if I need wood and stone?",
    "Right.",
    "Glad you like it. It does look pretty good, doesn't it?",
    "About that. For a fort, it's looking decidedly...well...",
    "Yeah.",
    "Walls?",
    "Like builders?",
    "Yes, we need a steward. Do you have any suggestions?",
    "I'll find Aster and recruit them.",
    "Not yet. Where were they again?",
    "Oh, that's right.",
    "Aster Dunnet?",
    "Player. Is this a good time? Bill sent me.",
    "Bill the architect. We're building a fort.",
    "I'm creating a new duchy in the Wilderness to defend Misthalin. I need a steward to run the fort.",
    "Once I've built it.",
    "Great! When can you start?",
    "Then I should look for more people in the meantime. In your professional opinion, what are the key roles we need to fill?",
    "Wouldn't that be your job?",
    "Sounds important. Was there someone you had in mind?",
    "Right. I'll speak to Siv in Gunnarsgrunn.",
    "I did. They sent me to find someone else.",
    "Siv, a Fremennik overseer in Gunnarsgrunn.",
    "I get on with that then.",
    "Overseer Siv?",
    "Oh? What did you come here to do?",
    "So your services might be available soon?",
    "I'm Player. Aster Dunnet recommended you.",
    "Run logistics for my fort.",
    "In the Wilderness. Just north of Misthalin.",
    "Well... there will be, when I've built it.",
    "Is that good laughing...?",
    "I... thanks?",
    "Right, so I have people for construction, administration and logistics.",
    "Well, it's pretty grim up there, and crawling with the undead. Morale will be a problem.",
    "Know any good priests?",
    "Right. I'll speak to Flint in Draynor Village market.",
    "I did. They sent me to find someone else, who sent me to find someone else.",
    "Father Flint, a priest in the Draynor Village market.",
    "I'll get on with that then.",
    "Hi there! I'm-",
    "Um...",
    "Bad day?",
    "Looking for you, actually. Siv recommended you.",
    "I'm Player, and I'm looking for staff to help me manage my fort.",
    "It's in the Wilderness, surrounded by demons and undead.",
    "It's... um... a cursed place, haunted by the ghosts of its bloody past.",
    "The site of many a battle, and countless cruel betrayals.",
    "A... befouled land! One that yearns for... redemption?",
    "Excellent. I'll head back to the fort now[sic]",
    "Yep. I've recruited a steward, an overseer and a priest. They're making their way here.",
    "In the meantime, we'd better get on with these walls.",
    "The walls are complete.",
    "...",
    "We'll have to be ready. We'll build up our defences, get stronger.",
    "Oh, am I a noble now?",
    "That's what he said.",
    "Right.",
    "Fort Forinthry!"
  ],
  "Bill": [
    "It's not safe here, you need to clear out all the undead!",
    "Thank you. You've got a bit of zombie juice on your face there.",
    "Name's Bill. And you must be Roald's latest hired muscle with delusions of grandeur.",
    "Only when I've been left for dead by jobsworth thugs. Puts me in a right mood.",
    "Look friend, I appreciate the save, but you've wasted a trip. Nothing here but mud, the walking dead and a bunch of ruins.",
    "Then you'll do it without me. Good Guthix, I'm too old for this... Trudging through the murk, pursuing futile endeavours.",
    "Wait a-",
    "...",
    "Damn it all.",
    "I'm in, friend.",
    "Where do we even start, though? This is just a pile of rubble.",
    "It's too much.",
    "We're going to need wood and stone. We need a workshop to make planks and blocks.",
    "I'm going to set up at a suitable location. Come and speak to me when you're ready.",
    "I brought my old sawmill for cutting logs into planks. There's also a workbench for assembling frames and a contraption for cutting stone.",
    "You'll need frames to make anything here. You make them out of planks.",
    "Check the blueprints on the table to find out how many you need. Once you have everything, you can begin work from there as well.",
    "You'll have to source that yourself. There's plenty of trees south of here, and the closet quarry is in Silvarea down towards Morytania.",
    "Great. You've assembled the materials for the workshop but you need to actually build the thing.",
    "Good job.",
    "Aye, that it does. And I'm true to my word: I'm here to help you whenever you need to build more things for your fort, or improve what's already there.",
    "Unfortified?",
    "You've hit the nail on the head, my friend. What we need is-",
    "Walls, yes, but we also need more staff.",
    "Maybe, but also people to help run the place.",
    "Aster Dunnet. Last I heard, they were odd-jobbing over in Varrock, doing accounts for the Blue Moon Inn's landlord.",
    "Back already? Did you find Aster?",
    "Blue Moon Inn in Varrock.",
    "Back already? Did you find Aster?",
    "Oh, who?",
    "...",
    "Back already? Did you find Aster?",
    "Oh, who?",
    "...",
    "Did you find anyone to help?",
    "Right.",
    "Good plan. You can plan out walls the same way you planned the workshop.",
    "If you build each section as you go we'll at least look like we're making some progress.",
    "Check the blueprint table for the materials you need, and to start building.",
    "Better to finish the wall section you've already started before starting another.",
    "And I'm sure that active volcano in the distance is nothing to worry about.",
    "Spoken like a true... wait, what should we call you?",
    "The Wilderness is a no man's land. The title is yours as long as you can hold it."
  ],
  "Aster": [
    "Yes. And you are?",
    "Alas, I am presently engaged, and will be for-",
    "Bill - you mean Sawmill Bill?",
    "Yes, that's Bill. Long ago, he used to run a sawmill. For what do you require my assistance?",
    "Ambitious... and shall we say 'forward thinking', given the absence of such a structure so far.",
    "Consider my interest piqued. It will be good to see Bill again.",
    "I have some work to do for the Blue Moon's proprietor first.",
    "My first recommendation would be to recruit a somebody to oversee communications and logistics. An overseer.",
    "As steward, I would manage everything that occurs within the keep. The overseer would manage everything that happens outside.",
    "Sourcing resources, managing your remote business interests for you, that sort of thing.",
    "Look for a Fremennik woman named Siv - I hear she is currently in Gunnarsgrunn on business.",
    "Her family are known on the Fremennik Isles for their acumen and resourcefulness. She's just the sort to rise to a challenge like this.",
    "I will join you as soon as I have finished my work here.",
    "You can find Siv in Gunnarsgrunn.",
    "I'm sure it won't suffer the same fate as the many fortifications that have occupied the same space.",
    "Ah yes, the matter of your title.",
    "Did the king declare this a new duchy?",
    "I am sure the appropriate letters and such will arrive in due course, but we needn't stand on ceremony.",
    "How would you like to be addressed?",
    "Very well, your grace, I shall make it known that you wish to be addressed as Duke.",
    "Very well, your grace, I shall make it known that you wish to be addressed as Duchess.",
    "Very well, your grace, I shall make it known that you wish to be addressed as Dux.",
    "If I might make a suggestion, your grace? In ancient times, before it was the Wilderness, this land was known as Forinthry.",
    "An auspicious name for a reclamation such as this, if I may be so bold.",
    "Indeed, your grace, very alliterative."
  ],
  "Overseer Siv": [
    "Just Siv. Not overseeing much at the moment.",
    "Set up a new trade route between the Fremennik Province and Gunnarsgrunn. The hope was that our long-estranged cousins would have secured access to plentiful local produce.",
    "Turns out they've spent the last few generations mooning over the past and writing sentimental poetry.",
    "Who are you, anyway?",
    "Aster... there's a name I haven't heard in a while.",
    "What do you need me to do?",
    "Where is this fort?",
    "Well, that does sound like a challenge.",
    "But I've been along that border many times, and there's no fort there.",
    "When you've-",
    "Hahahaha!",
    "Sorry, sorry. It's just been a while since I heard something so fatally ambitious... yet genuinely fascinating.",
    "I like you, kid.",
    "I'm in. I'll pack up here and meet you at the fort as soon as I can.",
    "That covers everything.",
    "It sounds like you need a priest.",
    "Good priests? No. Priests? I think so.",
    "Father Flint was a soldier before he turned to the cloth. He's in Draynor Village, last I heard.",
    "He's a character. Probably preaching in the market. Peacetime isn't suiting him well.",
    "You can find Father Flint in Draynor Village market."
  ],
  "Father Flint": [
    "Avaunt ye, shadows! Beleaguer the eyes of these lost souls no more and let the light shine upon them!",
    "Villagers! Cast off your shackles! Languish no more beneath the yoke of darkness!",
    "...",
    "Bah! To the Abyss with the lot of 'em!",
    "EVERY day's a bad day here! You'd think living in the shadow of a vampyre's mansion'd have them yearning for divine direction but no.",
    "These provincial heathens are a lost cause. It's enough to drive a man to asceticism. Well, almost.",
    "What're you doing down here anyway? You'll catch your death.",
    "Eh? What do you want with me?",
    "Never heard of you, nor your fort. Why should I be interested?",
    "...",
    "Go on.",
    "Yes?",
    "Yes?",
    "YES!",
    "By the gods, I've not felt this fired up since-",
    "Where my eyes were closed, now they are open. I will join you there.",
    "I'll meet you back at the fort.",
    "It's glorious... a shining bulwark against the looming shadow!",
    "Our enemies are relentless, the darkness ever encroaching."
  ],
  "Martin the Master Gardener": [
    "Calm down, father! Here - have an apple, on me. You look awful pale."
  ],
  "Siv": [
    "I like it. It's got character.",
    "The Duchy of Forinthry in the Kingdom of Misthalin, which would make this-"
  ],
  "Congratulations! You have completed": [
    "'New Foundations' - Complete this quest."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:New_Foundations?oldid=36222913’"
  ]
}