{
  "Tunks": [
    "Human! Thank the spirits you've come by. My village is in urgent need of help!",
    "I am Tunks of Village Kanatah on Mazcab. I have come through the world window to find brave adventurers that might be able to help us! I may be young but I'm the first Kanatan to set foot on this lumpy, purple planet. I must say, I didn't imagine the spiky trees and glowing soil.",
    "The devourer spirit?! AAAHH! Save yourself, [good sir/fair maiden]! I will distract the beast with my magnificent rock! Tell the tale of your goebie saviour to the people of-",
    "Ah, yes. I knew that. Sorry, my natural reflexes kicked in. Anyway, that is kind of why we need your help. The airut that Tuska left on our planet attacked Kanatah and are gathering to wipe the village out completely! It seems they've been enraged by the death of one of their chieftains. Your kind have proven yourselves as mighty heroes and I want to be one when I grow up too! Would you help us?",
    "Oh. I understand. You're too busy to help my people's struggle for survival.",
    "Great! Perhaps it would be best for me to return to Mazcab now, my mother will be worried about me. She said I wasn't allowed to come here, so if you see her... Shhh. Anyway, come to Kanatah and speak to the Acca when you're ready. I can't wait to fight alongside a valiant adventurer like you!",
    "When I'm allowed to explore beyond Kanatah I want to climb the tallest mountain on Mazcab!",
    "I'm sorry! The pick wasn't my idea!",
    "Are you feeling lighter though?",
    "Wow.",
    "We've been sent to find Nemi root, your most large... hugeness... one.",
    "Come on Player, I'm eager to look at this temple! Who knows what we might find!",
    "We need to look like the ancient warriors! Close your eyes, Player. I've got an idea.",
    "Ok, we're ready!",
    "I feel strange still. My pebbles are tingling.",
    "Xinachto, you don't look well.",
    "What did you do?!",
    "Thanks, Player. We never would've figured out the trials on our own.",
    "No... We are done with running. Now we fight.",
    "We should talk to the Ancient goebie about the roots we need.",
    "We've got what we came for. Our adventure draws to a close. We should return to Acca Kanatah.",
    "Hey, Player!",
    "I'm on an adventure! I heard about these goebies boldly going where no goebies have gone before and knew I had to join them.",
    "Oh this? It's my new headdress. I met a little man called Gudrik who told me new adventurers all go to Ashdale, so that was the first place I went! The island was in the clutches of Morwenna the Cruel, but she was no match for the power of our ancestors.",
    "Well, I heard there are adventures to be had in a place called Silvarea to the north. That's where I'll head.",
    "Thank you, Player!"
  ],
  "Player": [
    "Oh, where are you from?",
    "Erm, we're actually on Tuska's back. She crash landed onto our planet...",
    "It's okay, you don't need to be scared. The reason Tuska crash landed was because she was slain.",
    "I met Tunks on the other side of the world window. He said he'd come to our planet to find help for your village and that I should speak to you.",
    "They attack you here all the time though. Isn't dodging those attacks kind of your whole thing?",
    "Ok, I'm ready to help. What do you need me to do?",
    "I think I can see why the Acca asked for my help.",
    "We're supposed to help collect supplies to fix up the area.",
    "Come on.",
    "We've got the wood, what do we need now?",
    "Oh... No, I would never have guessed...",
    "Great, so where do I get more of this poison?",
    "Right, I'll return when I've found something.",
    "I'm no goat! I'm a human.",
    "I'm pretty sure I'm not a goat. I don't have hooves or weird eyes.",
    "Kanatah is at risk of getting overrun by the airut. The root might give them the edge they need to survive.",
    "In a sense you're getting closer, but a Hu-goat isn't an actual thing. Hu-man is the word.",
    "Can you help us?",
    "Holds up?",
    "But how?",
    "What's special about them? Why can't you help your friend yourself?",
    "And you[sic] assistants?",
    "It'll probably be quicker to just help them.",
    "Erm, hello?",
    "What are you then?",
    "You look like a giant tortoise to me.",
    "Why are you here?",
    "Are you a spirit guardian?",
    "Mountain-back?",
    "What can you tell me about Mazcab?",
    "Why is your 'vessel' in this temple?",
    "So this is where they come to die?",
    "Do you know anything about the goebie trials?",
    "Can't I do the trials with them?",
    "Sadly I cannot join you on these trials, the future of Kanatah is in your hands young goebs.",
    "I'll wait out here for you, good luck!",
    "Was that so much more effort than finding our own roots?",
    "We did it, we freed Xinachto and discovered the temple's magic.",
    "They also wielded powerful magic too, I gather.",
    "If it could save lives, why haven't more goebies completed the trials?",
    "You're saying that the temples of Mazcab are all tributes to you?",
    "You dealt with them swiftly enough.",
    "I met a spirit named Xinachto and a goebie as tall as a tree. They warned me that overuse could come at a price.",
    "Hi Tunks, what are you doing here?",
    "What's that on your head?",
    "Wow! So what are you planning to do next?",
    "Good luck on your travels!"
  ],
  "Acca Kanatah": [
    "Is there something you wish to discuss, human?",
    "Hm, I should have known he would disobey his mother. Audacious little goeb, that one. Brave though. Tell me, human, what do you know of the situation here?",
    "Well, yes, but I'm afraid our situation is much more dire than that, my friend.",
    "Mm, indeed. Our situation is certainly a dire one, my friend.",
    "Ha! You are indeed a plucky one. Unfortunately our situation is rather a dire one, my friend.",
    "The airut that harry us have decided enough is enough. Our scouts report that they are amassing forces and preparing to raze Kanatah to the ground. Our homes, our supplies... Possibly even our people, will all be destroyed. Hmm.",
    "Ordinarily, yes. Never before like this though. They're out for blood. It is most troubling. If it wasn't for our diligent rangers we would not have managed to evacuate the village before they came. This time I believe they aim to destroy everything we have built here, yes.",
    "I do not think you quite understand this camp's significance, human. We stand here in open defiance of those monsters! We are here not because of the path that lies before us, but the path that lies behind us. We built this camp right under their noses, and after all this time, after all their efforts to defeat us, I remember that which matters most... WE ARE STILL HERE!",
    "How do you humans say it...'cool beans'? Yes, cool beans. Well my friend, we must prepare ourselves. No longer will we cower and hide from the airut. Today, we will stand strong and repel them! Mm. First things first, seek out Tunks and his friends. I've set them to collecting wood to shore up the village and I suspect they'll need guidance. They should be at the beach to the east. Collect them and I shall come find you.",
    "We're going to need more wood in order to fix the village up. Luckily, my predecessor accumulated a good stock of supplies and hid it from the airut. Unluckily my predecessor was a little too security conscious and hid the logs in a ruin full of obstacles and bottomless pits.",
    "I've asked for you three to join me, as each of you have unique skills that should come in useful. You just need a teacher to help you master them. A teacher like Player.",
    "Nonsense! I'm sure your adventuring experience has left you plenty prepared for this role!",
    "How about we get to it? Lunch, if you clear the entrance?",
    "You'll be fine!",
    "This gap may look intimidating, but you can clear it.",
    "Excellent work, Tunks!",
    "Let's see how the other two do. That wall looks cracked. You should be able to break it Lunch.",
    "That gap looks just small enough that Peck should be able to squeeze through.",
    "Excellent, this should give us the last things we need to fix up the village.",
    "Thank you for rounding these three up for me, Player. Let us speak in the village, I have another task for you.",
    "Is there something you wish to discuss, human?",
    "Yes, excellent, excellent. Hm. I'm afraid that was bit[sic] of a test. The real work is to come. Our appearances may have deceived you, with our solid rocks and muscular physiques, but we are not the most capable of fighters.",
    "Mm, indeed, your kind are so soft and fleshy. It is a wonder you show such strength and resilience! Still, if we are to repel the airut we must learn to defeat them. I believe Nemi poison may be the answer, but it is in short supply. Hmm.",
    "Ah, so you do not know? The poison our scouts have found in Nemi forest seems to be most potent against the airut. Trinks over there has a small supply she has been giving to adventurers in order to weaken the enemy. The effects are quite intriguing, mm. When ingested it reduces the physical capabilities of the victim. Quite useful to level the playing field, you see.",
    "I'm glad you ask, human. Travel to Nemi forest and search for an abundant source of poison. I have heard tales from our scouts of huge plants supplying it! Of course, the Nemi forest can be dangerous and unpredictable. Who knows what you may find within its depths...",
    "Is there something you wish to discuss, human?",
    "Travel to Nemi forest, Player. Search for the poison within!",
    "Is there something you wish to discuss, human?",
    "Welcome back Player. Have you found the poison we need?",
    "Excellent, we shall use this to fight back against the airut! How did the goebs fair? Did you find anything of interest in the forest?",
    "It sounds like your trip went swimmingly. Thank you for helping my village, Player. Please accept these tokens of gratitude.",
    "Incredible! Just think how much we could learn from a towering elder! Mm. It sounds like your trip went swimmingly. Thank you for helping my village, Player. Please accept these tokens of gratitude.",
    "Oh my, that is not at all what I expected. This is far better than poison. We could stop the airut dead in their tracks with this!",
    "Player, I am the Acca of this village. I have gained much wisdom in my time. I will do what is required to keep my people safe, yes? If moderation is the best course of action, you can bet that's the course I'll take. I'll make sure to send a couple of our rangers to find this temple and learn a little more about it. First, please accept these tokens of my gratitude. You have truly changed our lives. Hm.",
    "It sounds like your trip went swimmingly. Thank you for helping my village, Player. Please accept these tokens of gratitude.",
    "Make haste, human."
  ],
  "Peck": [
    "One second, human. We're doing some important research here.",
    "Oooohhhhh. No. That's wrong.",
    "The Acca wants us?",
    "Bottomless pits? Hidden ruin? What? Why even use that as a place to store supplies? How desperate for storage space do you have to be to consider 'next to a bottomless pit' a great place to store big, heavy logs?",
    "I'll let you take first crack at it.",
    "I thought I wanted to hurry up and get my grow on, but now I'm not so sure.",
    "[He/She] is a human. I can't speak to the goat bit though, I'm not sure what one is.",
    "You don't look so scary to me.",
    "We don't really have to deal with this mysterious friend do we? We could just find our own poison. I'm getting nervous with all this broom talk.",
    "I can't wait to tell you I told you so.",
    "Yes! That's a great idea! No peeking, Player, we'll know!",
    "I've heard of you! You're Xinachto! I didn't know you could speak.",
    "Hey, guys! I think we should try walking over the buttons in the order shown here!",
    "What was that?",
    "You've absolutely lost me.",
    "I feel like I could zap you right now!",
    "I wouldn't... I'm just saying... I could.",
    "You're dying?",
    "...",
    "Easy for you to say, you didn't have to go anywhere. We should talk to scaffolds and get this all over with.",
    "That's a relief, there's no way ol' scaffolds over here is going anywhere.",
    "We should talk to scaffolds and get this all over with.",
    "There we go, airut attack. I told you this would be a pain.",
    "I'm one more person asking for a favour away from pulling my pebbles out."
  ],
  "Lunch": [
    "Steady!",
    "AAAAAAAHHHHH!!",
    "AAAAAAAHHHHH!",
    "AAAAAAAHHHHH!",
    "What about my head?",
    "If I could just reach...",
    "Tunks? Please?",
    "Acca?",
    "Oof!",
    "Yeah. I could lift that.",
    "Kanatah is at risk of getting overrun by the airut. The root might give us the edge we need to survive.",
    "The old one seems alright. We should help his friend.",
    "Wait a second, we need to get ready for the challenge that awaits us! I don't think we really look the part.",
    "Team Goebie! Let's do this.",
    "Oh, did you feel it too? I was worried it was just me.",
    "What?",
    "I feel like I could move a mountain!",
    "I can't stand by and watch this happen. That creature is dying!",
    "I had no choice!",
    "We've let the turtle out, we should tell the big one that their friend is okay.",
    "Today we make a stand.",
    "Did you see that, Player? The airut were coming but we showed them!",
    "Do we have to go home? I wanted to do more lifting.",
    "1... 2... 3... 4... 5..."
  ],
  "Ancient carer": [
    "Who are you? What are you? Shoo! Shoo!",
    "I'm watching you, goat."
  ],
  "Ancient goebie": [
    "Mmmmbmbmmmmbrrbbrrrmmm... ...mmmnbbrrgrrrrwgooooooaaaaaatt. Gooaaaat got innnn.",
    "Very well. Not entiiiiirely convinced. Shall talk. What brings your flock here, Hu-goat?",
    "Poisonnnnnn. Yesssssss.",
    "Yes. Attendants can bring root. You free friend from temple.",
    "Friend old like I. Hard to miss like I. Entrance sits nearby.",
    "Entrance sits nearby. Friend old like I. Hard to miss like I.",
    "Be well, Goatuman",
    "Beware sudden surprises, Goatuman. Problem for your kind.",
    "Oldest tree in forest.",
    "Yes. Oldest tree in goebie. Second oldest tree in all goebies.",
    "One. Holds up.",
    "Holds all up.",
    "Tree? Many older trees, odd goat.",
    "Nemi grows. Nemi changes. Nemi provides. Nemi protects.",
    "Very kind. Obviously.",
    "Chantli used to be happier thing. Destroyer didn't help much. Dampened mood somewhat.",
    "Was younger. Destroyer came. Destroyer left. I remain. Am large. Intimidating. Mean right hook. Flight understandable.",
    "Not in fighting frame. Terror only one elbow drop away.",
    "Old goebies resourceful. Industrious. Build big pyramids. Solve problems. Cook decent stew. New goebies too busy. No time for decent stew.",
    "Terrrrrrrible steeeeew.",
    "Teeeemples?",
    "Busy here.",
    "Busy there.",
    "Be well, Goatuman",
    "Beware sudden surprises, Goatuman. Problem for your kind.",
    "Enter temple. Yessssssss. Release old one.",
    "They come. Followed you. They come now.",
    "Go now, human.",
    "Old goebies resourceful. Industrious. Build big pyramids. Solve problems. Cook decent stew. New goebies too busy. No time for decent stew.",
    "Terrrrrrrible steeeeew.",
    "Ssssaid resourceful.",
    "Too costly. Could save some. Hurt all though.",
    "Temples old. Built as beacon. Spirits get lost, don't read signs well. Temple gigantic sign. Easily readable. Lead spirits back home. Back to Chantli. Temple also built to honour self. Have many notable accomplishments.",
    "Maaaaaaannnyy accomplishments, Hu-goat."
  ],
  "Ancient carer (#1)": [
    "Shoo! Get out of here goat!",
    "I'm not sure, great one. This could be a goatly ruse.",
    "Goebie, great one.",
    "The airut are coming! How did they find us?"
  ],
  "Ancient carer (#2)": [
    "I'll get the broom!",
    "I've found the broom! Back, beast!",
    "I will fetch you stew, great one!",
    "Everyone, hide! Quick! Not even the broom will do!!!",
    "I will fetch you stew, great one!"
  ],
  "[Peck and Tunks]": [
    "Woah..."
  ],
  "[Tunks/Peck/Lunch]": [
    "This temple is impressive, I never imagined one of the ancient temples to be this big!",
    "Looks like we have to start some sort of trial?"
  ],
  "Xinachto": [
    "What...are...you?",
    "Adventurer... This is not...what you are. You are...alien.",
    "Human... It has no meaning to me. You are...alien.",
    "You...are no rock-bearer. You are...alien.",
    "I...am of the earth. I...am of the plants. I...am life.",
    "Tortoise... No. This vessel is not I. I give voice...to the greater whole.",
    "This vessel must return...to the earth. Its anima is needed...to replenish the source. I am here...speaking through it...because you are here.",
    "Spirit...guardian... Yes, this is what...the great mountain-back named these...vessels. Long ago...",
    "The eldest of the rock-bearers...the one who yet remembers...the power of old. This vessel... The ones before it... The ones that will follow. Spirit guardian was the name...it bestowed upon them. Manifestations of lost anima...assuming the form of the elements. Just as they left...they must also return...to the earth. To me... So that their energy...may be reclaimed. We must regrow.",
    "This is where...all vessels must come. To the heart of the hollow mountains...carved by the ancient rock-bearers. This is where...their pilgrimage must end. Where they must go...to sleep...and return their anima to the earth.",
    "Die... No. This is where they return...to the source. To rejoin the greater whole.",
    "Once more...three young rock-bearers step forth...to face the trials of their ancestors. Held in this place...is the power of the ancients. It has lain dormant...for long enough. It is time for these rock-bearers...to endure the trials...and reclaim the power of their people.",
    "The ancients...placed a magical protection...upon this place. Only one of their own...may enter the trials.",
    "You return, world walker.",
    "Felt the taste... the essence... of the earth. Leaks from... the thin places... scars... where it tore... holes.",
    "Deeper... the wound... grows deeper. The vessel... its shackles... loosen. Your presence... disturbs the... earth.",
    "The time... draws near. The vessel... concludes... its journey.",
    "Xinachto will... end. I will endure. I will come closer... closer to... whole.",
    "You are wise... alien.",
    "You must not... interfere. The process must be... complete. The earth can... be made... whole... in time.",
    "It is... required. This vessel... a lost child... of the source. Must be reclaimed... to repair... the source... the earth. You must not... interfere.",
    "The vessel knows... it is needed. Felt the call... the pull... home. You must not... interfere.",
    "The vessel... must be... ...stopped."
  ],
  "Xinacho": [
    "Mazcab... This is a new sound...used by the rock-bearers. Before it...there was Chantli. A different sound...with the same meaning. They refer to the plants... To the trees... To the creatures. Mazcab is I... Chantli is I... I am life."
  ],
  "Peck and Tunks": [
    "Thanks!"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Call_of_the_Ancestors?oldid=35905412’"
  ]
}