{
  "Dororan": [
    "'My heart with burdens heavy does it lie.' 'For never did I...' Um...",
    "You're a poet too?",
    "Ah! Then I'm sure you can identify with the arduous state of my life.",
    "Oh. Then maybe you can identify with the arduous state of my life.",
    "Oh. How can I expect you to identify with the arduous state of my life?",
    "My heart is stricken with that most audacious of maladies!",
    "Love! The walls of my heart are besieged by love's armies, and those walls begin to tumble!  In the barbarian village lives the fairest maiden I have ever witnessed in all my life.",
    "I wouldn't know where to start! Her fiery spirit? Her proud bearing? Her winsome form?",
    "The people of this village value strength, stature and riches. I have none of these things. My people are indomitable warriors, dripping with gold and precious gems, but not I. I am not built for combat, and poetry has proven a life of poverty!",
    "You see!",
    "If Gudrun could ever love a dwarf, surely she would need to see my artisanry. Will you help me? I am no crafter of metal.",
    "I need a ring of purest gold. Then we can engrave it with the words of my heart. Oh! I know the perfect place to get a gold ring. Edgeville's metalsmith, Jeffery, labours like myself under the weight of unrequited love. Perhaps, if you took one of my love poems to Jeffery, he would trade it for a gold ring.",
    "By all means.",
    "Yes! Jeffery's rings are timeless works of incomparable romantic splendour.",
    "North of here, beyond a ruined fortress. It used to be a bustling den of cutthroats but it's quite quiet these days.",
    "Some time ago, Jeffery asked me for advice in acting on his affections. I gave him the best advice that I could. Things didn't work out very well for him. One thing led to another and now he no longer wishes to speak to me.",
    "These love poems are written in the Misthalinian style. A noble barbarian maiden would be insulted, not flattered.",
    "Oh no, nothing like that! I have the words, I just need your help with the tools.",
    "'I await in eagerness for a loop of lustrous grandeur.' No, that just sounds ridiculous. Have you brought me a ring from Jeffery?",
    "Thank you! That's exactly what I need! Now, would you engrave something on it for me?",
    "I've given this some thought. 'Gudrun the Fair, Gudrun the Fiery.'",
    "Just use a chisel on the gold ring.",
    "Yes, here you go.",
    "I've seen jewelcrafters use them for all sorts of precise work.",
    "Is it done? Have you created a work of magnificent beauty?",
    "You seem to already have one.",
    "Is it done? Have you created a work of magnificent beauty?",
    "You're right! It's perfect!",
    "Brilliant! That's perfect!",
    "I don't know what you mean: it's perfect!",
    "Will you do one more thing for me?",
    "I fear she will only judge this poor book by its cover. Would you take the ring to Gudrun for me?",
    "Please don't tell her I'm a dwarf just yet.",
    "Inside the barbarian village.",
    "Please take the ring to Gudrun for me.",
    "Did you give Gudrun the ring? What did she think?",
    "Oh no!",
    "Did you give Gudrun the ring? What did she think? Did it capture her heart?",
    "It's because I'm a dwarf, isn't it? Or because I'm a poet? I knew it! I'm completely worthless!",
    "Oh! Then what's the problem?",
    "Sorry! Most cruel is fate! Most cruel! Why not?",
    "This village has stood for a hundred years!",
    "Really? Interesting.",
    "Not really. I talked with Hunding, who guards this tower here. An idea occurs to me, but it is hubris of the greatest magnitude.",
    "An idea occurs to me, but it is hubris of the greatest magnitude.",
    "What if I wrote a poem? Forged a sweeping, historical epic? Crafted a tale to touch the chieftain's soul?",
    "To win the heart of my beloved from her father's iron grasp? It is worth it just to try!",
    "'Even the bloodiest rose must settle.' Mixed metaphor. What settles? Detritus. That's hardly flattering. 'Even the rolliest boulder...'",
    "I'm stuck! I'm a worthless wordsmith! My work is pointless! My life is pointless!",
    "I'm stuck on a word. By the colossus of King Alvis! I can't find the words!",
    "I don't know! I'm not some kind of word scientist. I just feel it out as I go. Maybe you could suggest some words to get me started. Then I can tell you more.",
    "That doesn't really fit. It needs to be one syllable long.",
    "That doesn't really fit. It needs to rhyme with the word 'day'.",
    "That doesn't really fit. It needs to mean something like 'wandering aimlessly'.",
    "'And from his righteous purpose never stray.' That fits! It fits perfectly. Right meaning, right length, right rhyme. Well done!",
    "The poem still isn't finished, though. I have another missing word. Give me another one; anything, to get me started.",
    "That doesn't really fit. It needs to be one syllable long.",
    "That doesn't really fit. It needs to mean something like 'danger'.",
    "That doesn't really fit. It needs to rhyme with the word 'yet'.",
    "'But long is gone the author of that threat.' Perfect! Yes!",
    "It's coming together. We're nearly done! One more to go! This one is tricky, though. It's a phrase I need. Someone did something.",
    "That doesn't really fit. It needs to rhyme with the word 'lore'.",
    "That doesn't really fit. It needs to imply some aggressive action, like 'started a fight'.",
    "That doesn't really fit. It needs to be three syllables long.",
    "'Who then, in face of madness, swept to war.' At last! It's done! It's finished! My finest work! Thank you so much for your help!",
    "What? No! I'm a writer, not a performer. I think the chieftain would respond best to one of his people. Perhaps you could ask Gudrun to recite it to her father?",
    "My poem is terrible, isn't it? The chieftain will probably have me killed.",
    "How long have they been in there?",
    "This isn't going to work.",
    "What was I thinking? You should go in there and stop them before Gudrun makes a fool of herself.",
    "No! Wait, stay here, it's too late now. We'll just have to see how it turns out.",
    "You're right, it's too late now. We'll just have to see how it turns out.",
    "I can't hear what's happening. Can you hear what's happening?",
    "He's probably considering the various tortures he has planned for me.",
    "The poem says you can honour your ancestors by settling peacefully on the land they conquered. He'll probably find it insulting.",
    "I hope they at least give me a decent burial.",
    "Um, that would be me. Hello.",
    "Uh, yes.",
    "Sorry.",
    "I'm more than a little surprised! He even gave me a house to live in!",
    "It's huge!",
    "I think Gunthor wants to keep me close, but not too close. Oh, I found something there for you! Whoever lived there before left a dozen pairs of boots in the attic. I picked out a pair for you to thank you for all your help. Underneath them all was this magic lamp. You should have it as well!",
    "Yes, we'll see you there!",
    "Goodbye!",
    "Goodbye!"
  ],
  "Jeffery": [
    "Keep it quick. What do you want?",
    "You want to buy a gold ring? You want to sell a gold ring? You want to ask pointless questions about gold rings?",
    "Trade you? Trade you for what?",
    "A love poem? What? Wait...that dwarf put you up to this, didn't he?",
    "I recognise his awful handwriting.",
    "That cheeky little... He can't just leave it alone, can he? Fine! I'll trade you for the poem. What is it you want?",
    "Well, all I have is this plain, gold ring. That will have to do.",
    "Now, leave me in peace!",
    "I haven't had a chance to do anything with it yet!"
  ],
  "Player": [
    "Who was that love poem for?",
    "I have one right here.",
    "Not yet.",
    "Are you Gudrun?",
    "This is for you.",
    "A petite paramour.",
    "A concise courter!",
    "Yes.",
    "What's that?",
    "Why not?",
    "She liked it, but there's a problem. I'm dealing with it.",
    "Your daughter seeks permission to court an outerlander.",
    "What?",
    "He mentioned someone called Gunnar, and that you should think about his feelings.",
    "I'll ask him.",
    "There's a problem.",
    "He's obsessed with the stories of his ancestors. He says his people are still at war.",
    "I heard him arguing with one of the others. He says he honours his ancestors this way.",
    "What is it?",
    "Will that work?",
    "How is the poem going?",
    "Maybe I can help. What sort of word?",
    "Alright, how about, uh...",
    "Are you ready to present it to the chieftain?",
    "Another gift from your mysterious suitor.",
    "It's a poem; a story to convince your father to settle down. You could recite it to him.",
    "Gunthor is laughing at something."
  ],
  "Kjell": [
    "Gudrun! You caught enough fish?",
    "Your father needs many fish to feed the freemen!",
    "Maybe you should sneak off to the outerlander city again? Buy fish in market, instead of catching them?",
    "You are not!",
    "Fine!",
    "Hear the chieftain speak! Hear him!",
    "FOR GUNNAR!"
  ],
  "Gudrun": [
    "Yes! I have plenty of fish!",
    "I know!",
    "Shut up! I'm much better at fishing than you.",
    "Just guard the hut like the chieftain told you to!",
    "Stupid barbarian. Sorry about that, stranger. Did you want something?",
    "Yes.",
    "It's lovely! There's something written on it: 'Gudrun the Fair, Gudrun the Fiery.' Is it about me?",
    "This is a beautiful gift, stranger. Thank you.",
    "That's very flattering! You look like an adventurer, though?",
    "I'm sorry, I could never get involved with an adventurer.",
    "Oh! Who is it from?",
    "A tale-teller? A bard? My people have great respect for poets.",
    "Does that really happen? How exciting!",
    "What?",
    "What?",
    "This man, he is from outside the village?",
    "I would love to leave the village and be romanced by exotic, handsome, outerlander men. There's a problem, though.",
    "My papa, the chieftain. He would never let an outerlander pursue me.",
    "He thinks all your people are our enemies.",
    "I suppose that might work.",
    "What? No! Maybe...you could just try talking to him. I've tried to reason with him, but he's impossible! Maybe he'll listen to you. I know some of the others feel the same, but they're loyal to papa.",
    "In the longhouse at the north end of the village, drinking and shouting.",
    "If there's anything you can do to make papa see sense, please do it.",
    "What did he say?",
    "By the eyeballs of Guthix! Always Gunnar!",
    "He was my great-grandpapa! He founded this village a hundred years ago.",
    "I think there's a difference between respecting my ancestors and obsessing over them. Papa thinks whatever stupid war Gunnar fought is still going on.",
    "I don't know. Maybe your mystery man has some ideas.",
    "If there's anything you can do to make papa see sense, please do it.",
    "What have you got there?",
    "A scroll?",
    "Let me see that.",
    "'Gunnar's Ground.' Yes! I think this could work. I'll go to the longhouse right away!",
    "That was brilliant! I must know who wrote that poem.",
    "That line about beauty was for me, wasn't it?",
    "You're the mystery poet who sent me the gold ring!",
    "I have no idea dwarves could be so romantic! Come here!",
    "Papa was so impressed by Dororan's poem, he's made him the village poet!",
    "Our people's tradition is that the tribe provides lodging for the poet.",
    "It's not in the village. It's east of here: across the river and north of the road on the way to Varrock. It's a big house with roses outside.",
    "We're going to the new house. You should come and visit!",
    "Goodbye!",
    "Goodbye!"
  ],
  "Chieftain Gunthor": [
    "Begone, outerlander! Your kind are not welcome here!",
    "Make it short.",
    "WHAT?",
    "Do you have ANY idea who we are?",
    "We are the storm that sweeps from the mountains! We are the scourge of these soft lands!",
    "We are the freemen of the ice. You think this is a settlement, but it is a camp of war!",
    "What is it, Haakon?",
    "Your father? Do you honour him, Haakon?",
    "And do you honour Warlord Gunnar?",
    "Then why do you dishonour his name by abandoning what he fought for? We will honour our fathers and we will honour Gunnar!",
    "You! Outerlander!",
    "We are not friends, you and I! We are not allies! Run back to Gudrun and tell her to remember her forefathers! Tell her to think of Gunnar and what he would think of this insult! Now go, before I have Haakon dismember you.",
    "Run back to Gudrun and tell her to remember her forefathers! Tell her to think of Gunnar and what he would think of this insult! Now go, before I have Haakon dismember you.",
    "Freemen! Freemen! I have an announcement!",
    "We have always borne the legacy of our ancestors, and we have borne it with honour!",
    "And though we honour them still, the time of our ancestors is past. This is the time of Gunthor!",
    "Gunthor says: This is Gunnar's ground, bought with blood! Let it remain Gunnar's ground forever! Here we settle! GUNNAR'S GROUND!"
  ],
  "Haakon": [
    "Chieftain! May I interrupt?",
    "We have lived here since before the time of my father. Perhaps we are no longer a camp.",
    "Of course!",
    "Of course, Chieftain!",
    "Yes, Chieftain. You are wise. I am sorry.",
    "Come here and say that to my face, outerlander!",
    "Come here and say that to my face, outerlander!",
    "FOR GUNTHOR!",
    "GUNNAR'S GROUND!"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Gunnar%27s_Ground?oldid=35987177’"
  ]
}