{
  "Mr Mordaut": [
    "Hello there, Player.",
    "My good friend, did you not say that you had defeated that terrible Mr Kerapac?",
    "Well it's just that some of the archaeologists around here claim to have seen him recently.",
    "Tall, scaly, deeply threatening sense of self worth. It does seem to fit the bill.",
    "Excellent. I'm sure it's nothing, but it's better to be safe than sorry. You should speak to Eliza and Alpheus about what they saw."
  ],
  "Player": [
    "Yes, Kerapac should no longer be a danger to any of us. Why?",
    "But that's not possible. Are they sure it was him?",
    "Hrmm, perhaps I should investigate?",
    "Actually, I'm busy right now, I'll make time for that later.",
    "Hi there. Mr. Mordaut tells me you've spotted Kerapac around?",
    "If I can...",
    "You had already evacuated when the dinosaurs attacked. You were completely safe!",
    "Sorry to interrupt, but back to Kerapac. Where did you see him?",
    "By the entrance to his lab you mean? The most obvious place he would go?",
    "Right. Fine. Could have said that at the start and saved us a lot of time, but no, fine. I'll go and investigate.",
    "Hmmm... I don't see anything down here that looks out of place? I should check to see if there is anything else around here out of place.",
    "That's strange, I swear that statue looks different.",
    "It looks like there are scratch marks on the side of the arch, I wonder if it's a door?",
    "Well that's annoying... I thought I'd found something exciting.",
    "Arrrrg!",
    "Okay... Maybe I have found something.",
    "Perhaps I should find out what these are first.",
    "I should speak with Vicendithas before turning these.",
    "Kerapac?",
    "I'm sorry about your father. It must pain you to know he's an unwilling servant of Jas again.",
    "What are you doing here?",
    "What is it?",
    "Don't you mean made?",
    "Can I help with the machine?",
    "Can't we just do it again?"
  ],
  "Alpheus": [
    "Oh yes. Never clearly, never directly. But we've seen him over the past few weeks, appearing in the night. Stalking around the place with a deeply nefarious air to him.",
    "Oh don't remind me. I didn't sleep for days after that. Those horrible lizards trampling all over everything!",
    "AAAARGH!",
    "Oh. Sorry. You made us jump. You shouldn't interrupt people reliving traumatic moments like that.",
    "Sure they did.",
    "To the north by that sinister dragon statue."
  ],
  "Eliza": [
    "It's terrifying. I've never seen anything like it, other than the last time Kerapac was here of course.",
    "Dear me that was quite terrifying. I wish I hadn't reminded myself now.",
    "AAAARGH!",
    "Safe? SAFE! Those beasts trampled all over the camp. They disturbed countless tiny archaeological projects. One of them ate my thesis!",
    "That's the place."
  ],
  "Not Kerapac": [
    "No."
  ],
  "Vicendithas": [
    "Though we do share a family resemblance. My name is Vicendithas, I am Kerapac's son.",
    "Unwilling servant. What a poetic way to put it. Much kinder than the real word for it.",
    "Yes, well. Hardly your fault if I'm honest. My father's single minded obsession was always going to lead to something like this.",
    "At least he lives, which means there is always the possibility of his freedom.",
    "And that he failed to destroy all life on the planet is a rather pleasant side effect. I like this world.",
    "Straight to the point? My understanding is that you humans relish your small talk. I had practiced several casual phrases about the weather and how it is both always too hot and never hot enough.",
    "But I find small talk frustratingly pointless, so let us get to it.",
    "I am here to finish what my father should have finished years ago. I am here to save a dying people.",
    "My father once made an offer to the ilujanka to heal them and allow their race to flourish again.",
    "I believe he made remarkable headway, but then, like so often happens, he was distracted by the curse and he abandoned his project to focus on destroying the stone.",
    "So where he failed, I will succeed. And this machine will allow me to do that.",
    "This is the effigy incubator. A machine that my father once believed would revolutionise information storage for the dragonkin. It is the place where effigies are born.",
    "No. Effigies are more than just collections of data. They are capable of growth, of becoming more. They are inorganic, but in many ways they are alive.",
    "My father had one in his lab that had been slowly learning his secrets for centuries. That accumulation of knowledge created a spark in the effigy that seemed to allow it a limited form of consciousness.",
    "According to my father the dissection was fascinating but ultimately didn't reveal anything useful.",
    "But I digress. This machine was father's attempt at creating new effigies. I believe I can use them to soak up fragments of my father's knowledge so that I can continue his work from where he left of[sic]. Brilliant a scientist as my father is, he has never been one to leave his secrets lying around.",
    "Unfortunately I can't quite seem to get this machine working. It looks like it's at least a two person job and none of the other Dactyl are on speaking terms with me at the moment.",
    "My father had a great deal of influence and respect in the Dactyl, as you may have guessed.",
    "So when he shunned me, the other Dactyl followed suit.",
    "And now of course I am doubly cursed. Because after my father's disaster with the Needle and his Shadow Anima machine, I am shunned because I am related to him.",
    "I don't really blame them. Actually, no, I do. They enabled my father's obsession all these years they should at least be brave enough to stand by him when it reaches its inevitable conclusion.",
    "But, anyway, fun as this therapy session is, it's hardly resolving my current predicament.",
    "Oh, now wouldn't that be poetic. Me working with the person who enslaved my own father.",
    "You're serious? Hrmm. It would definitely make quite the statement and I could use the assistance.",
    "Very well World Guardian, let's make this work. I imagine we can both benefit from this machine after all.",
    "Don't just touch things. Talk to me first.",
    "Before we can do anything else, we're going to need to grab the materials.",
    "First, we need to house the materials. For this, we use an effigy casing.",
    "This pile of scrap metal should have what we need. You'll need to be a proficient smith to determine the useful bits though.",
    "This gathering of nicknacks is all that remains of some of my father's failed experiements[sic]. The residual imprint of his inventive...genius...should prove useful if you've got the invention knowledge to uncover the best bits.",
    "Not all knowledge is contained in stone and metal, much the pity. Here are the remains of Kerapac's experiments on dragons. This dragon flesh should be something we can use if you have the crafting skills to stitch it into something usable.",
    "Finally, from the material to the immaterial. There's plenty of anima leakage in this lab, as a result perhaps of Ful's intervention. These anima nuggets can be contained if you have the Runecrafting skills to distil them.",
    "Go ahead and pick one of those to gather materials from while I try and work out how this machine works.",
    "One is enough.",
    "Look at that! An effigy remnant. Not exactly stable, but much more efficient to gather from. Effigy remnants are more densely packed with the materials we need. So if you see one make sure you harvest them while you can.",
    "Go ahead and pick one of those to gather materials from while I try and work out how this machine works. 20 should do the trick, along with 1 casing to house the materials.",
    "Stick to the material you started with.",
    "Good. I think that should be enough, now collect a casing to house those materials.",
    "Good. I think that should be enough.",
    "Now that you've got the materials you can create an effigy core at the workbench. This is the framework around which we can construct an effigy, a powerful item which should give us useful benefits.",
    "Go and build one now and then we can see about empowering it.",
    "Then bring it to me.",
    "You have enough.",
    "Now that you've got the materials you can create an unstable effigy core at the workbench. This is the framework around which we can construct an effigy, a powerful item which should give us useful benefits.",
    "Go and build one now and then we can see about empowering it.",
    "Then bring it to me.",
    "You've already created an effigy. Bring it to me.",
    "Excellent. See how it feels, that strange crackle as it tries to siphon knowledge out of the air? Now we need to give it something to feast on, to allow its potential to manifest.",
    "That's where this comes in. This incubator will flood that effigy with cosmic energy allowing it to transform into a more or less complete effigy and the excess energy from that process I can use to capture fragments of my father's knowledge in my own effigy. We both benefit.",
    "Before we can do that though, we'll need to power up the machine. This won't be simple, you and I will need to work together to get this up and running.",
    "There are a number of valves which modify the energy flow within the incubator. I'll need to monitor the incubator and I will shout out what valves you need to pull.",
    "Turn the [Colour] valve.",
    "Turn the [Colour] valve.",
    "We still need to callibrate[sic] the machine.",
    "Turn the [Colour] valve.",
    "Turn the [Colour] valve.",
    "No no no. Listen to what I tell you to turn. You need to be precise or this won't work.",
    "Turn the [Colour] valve.",
    "Turn the [Colour] valve.",
    "Turn the [Colour] valve.",
    "Turn the [Colour] valve.",
    "Excellent, the machine is now correctly callibrated[sic].",
    "It is done. Excellent.",
    "When incubating the effigies, if the machine is active and in it's[sic] enhanced state, the effigies will duplicate due to the excessive power. Incubating one uncharged effigy will generate two effigies.",
    "If you run out of time but still have the materials required to make an effigy, you can still incubate them. Due to reduced power, you will only receive one effigy per uncharged effigy incubated.",
    "Now, quickly, add your uncharged effigy into the incubator. You can add more than one if you need to, but one should be sufficient for now.",
    "I will keep an eye on the effigies whilst they incubate for you.",
    "The process has finished. Collect your effigy from the incubator.",
    "In return for my teachings, I will keep that effigy. Here is an example of what you will receive when collecting your own.",
    "You did it. An effigy succesfully[sic] incubated.",
    "As you create your effigy, so do I empower my own. I shall call it the cold effigy in honour of my father.",
    "Wait...NO! The effigy needs more charge, more knowledge. It was only able to siphon a sample of the fragments of his knowledge. I need more. Much more if I am going to be able to save the ilujanka.",
    "Yes and no. The machine uses a lot of energy, energy that takes time to recharge. There is some residual energy from before, so we might be able to set another round going, but I need more knowledge than that.",
    "I believe it would take roughly a month for the machine to power up   [sic]again and I will need several runs before I can gather enough knowledge to discover father's secrets.",
    "You will be able to continue to collect from the cracked effigies around the room but if the incubator isn't active, the materials collected don't seem to carry the same energy.",
    "These non-enriched materials aren't much use but I will take them off your hands and reward you in return. I intend on doing futher[sic] research on these.",
    "Well then, World Guardian. What do you say? Continue helping me to help the ilujanka?"
  ],
  "Congratulations! You have completed": [
    "'Sins of the Father (miniquest)' - Complete this Novice miniquest."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Sins_of_the_Father?oldid=35999344’"
  ]
}