{
  "Eluned": [
    "Player! Can you feel it? The whole city is shaking.",
    "It's as though the city is tearing itself apart. The Voice of Seren seems to amplify the problem. The crystal of the city is resonating with the song in a way we've never seen before. The crystals seem to be shifting towards the Tower of Voices. It's almost as if they're working their way towards the fragment of Seren, like plants grasping at the sun. And... I think I feel it too. These crystals were once a part of Seren. They are willing me to bring them back together, Player. I'm sure of it.",
    "I... I'm not sure. I don't want to imagine the consequences for our beautiful city if the crystal movements get any worse. The Elders share my concerns and a sacred conclave is to be held in the upper chamber of the Tower of Voices, as is elven tradition in times of need. The Elders believe that the crystals are changing because Seren is trying to reform. But she cannot do so alone. I think the Elders intend to vote on bringing Seren back! You've been instrumental in helping us so far, Player. Will you attend the conclave with me?",
    "Because if we cannot solve this, then Prifddinas and everything we've worked towards will tear itself apart. Whatever your opinions on Seren may be, I hope you would care enough about this city and her people to help.",
    "Oh, you can always come back if you change your mind.",
    "I knew we could count on you, Player! The conclave is imminent, we should hurry to the Tower of Voices. I'll meet you there!",
    "The conclave is imminent, we should hurry to the Tower of Voices. I'll meet you there!",
    "...they're returning to her core, I can feel it! We need to restore Seren before our city collapses!",
    "And you'd be doing it for Prifddinas! The whole city is in danger. You might be our only hope.",
    "It's so strange that you know about this key. It's almost like this was predestined somehow. As if the key engineered itself to be here, for this situation. No, that's crazy talk. Player, you should follow the key and find out where it's leading you.",
    "Was there anything else Guthix told you? Anything at all that could help us?",
    "What? Me - a part of Seren? I...",
    "This is a lot to take in. I need some space to think.",
    "You need to gather the four great shards. Crwys and Meilyr know about the Naturalist shard. Amlodd and Hefin know about the Spiritualist shard. Cadarn and Iorwerth know about the Military shard. Trahaearn and Ithell know about the Artisan shard. You should speak to each of them to find out what you need to do.",
    "About me potentially being a shard? That my life is a fabrication? That I'm not really...me...but just a piece of her? It's hard to come to terms with. But that's not important right now, right now we should focus on getting those shards.",
    "Surely we couldn't include that part in the restoration!",
    "So, I need to be...reincorporated...",
    "But this is different...I...we'll cross that bridge when we come to it. Right now we should deal with the Dark Lord...",
    "Honestly? Terrified. I mean...it's not going to be death, not really...but what is me will be gone. I will be just another part of Seren, not Eluned any more. What makes me me, will be gone. It's selfish to think like that, I know. Maybe it's more important that Seren is made whole...but still.",
    "You don't, you can't, but it means a lot that you would try.",
    "It seems... wrong some how. There's too much missing.",
    "Player I will go too, I have always dreamed of visiting Tarddiad.",
    "Tarddiad...it's just like I dreamed it. It's so beautiful. We should be able to find plenty of crystal here, but we need to find crystal with Seren's essence. We should explore deeper as well, I have a strange feeling.",
    "About 50 shards infused with essence should be enough. I'll let you make your own way around, I'll explore around here a bit. Who knows what dangers we may face here, make sure you are prepared to defend yourself.",
    "You're seeking out 50 crystals that have been infused with Seren's essence.",
    "I suggest heading further into the forests. I have a feeling that there's something here that can help.",
    "I overheard your conversation with the shapeshifter. Perhaps she'll be able to help identify how to find the shards we need.",
    "I saw. I was following you and I saw your conversation. It's tragic to see what we could have become. I should go and talk to her, but I need to think of the right words.",
    "Yes, I know. You introduced us, remember?",
    "In fact, she is standing right there, so having this conversation seems a little rude.",
    "But isn't that going to just make it worse? I mean you've said that the crystals basically enslave you.",
    "But it could be rebuilt? We could help!",
    "No. I mean, we could...I just...",
    "Really? I heard stories about her. She wrote the Cerddi!",
    "But...you do seem to act like you hate her...",
    "How does it feel? To change your form so easily?",
    "I can't decide whether that's good or bad.",
    "If you let us help we could...",
    "Hello Angof. I am Eluned, from Gielinor it's good to meet you.",
    "I am sorry, I didn't know that any...no, that's a lie. I knew that there might have been elves left behind. But we didn't want to believe it. None of us wanted to imagine what had become of you. We assumed you would all be...",
    "Please...forgive us.",
    "The Worldgate[sic], we lost it...",
    "Nothing remains?",
    "Fantastic! You seem to have enough crystals to restore Seren. We should return and speak to the elders.",
    "So this is it then...the end of my journey?",
    "I'm scared Player.",
    "I don't want to go.",
    "Player I'm scared, but I will do my duty if you think I should. I trust your decision, though I am sorry for making it yours.",
    "You're right of course. Goodbye my friends. I return to the light.",
    "I...thank you.",
    "I ... for some reason I know you need to go to Freneskae Player. I can't explain it.",
    "It didn't work...do you think it's because of me?",
    "Oh no, what have I done.",
    "We need to go to Freneskae, maybe her homeworld will help revive her.",
    "That's it. She's back and I'm still ... still me. None of this would be possible without you Player, you've saved Prifddinas and you've saved me. There's nothing I can give you that will repay what you have given me ... but perhaps there are others I can help in your honour."
  ],
  "Player": [
    "What do you think is going to happen to Prifddinas?",
    "How do we decide?",
    "I believe Seren needs to be reformed!",
    "Seren sacrificed herself for a reason, she should be allowed to stay shattered.",
    "So, where do we start?",
    "Fine.",
    "The Enchanted Key? I, umm, might know where it can be found...",
    "I actually have it on a keyring.",
    "I actually have it with me now.",
    "I just need to nip to the bank...",
    "Lady Trahaern said she could attune this for me, I should take it to her first.",
    "The what?",
    "Why do my teeth taste of lemons?",
    "I kind of feel the need to panic right now...",
    "What now?",
    "I sense some mild hostility here...",
    "Predem abducto!",
    "I am Player, the world guardian. The Enchanted Key brought me here.",
    "You did...",
    "I'm just an adventurer. The Enchanted Key brought me here.",
    "GUTHIX! The Enchanted Key brought me back to you!",
    "You've already banished Seren?",
    "I watched you die, Guthix. I couldn't save you.",
    "You shared your power with me and told me to be a guardian of this world.",
    "Zaros has returned in my time. He's corporeal again.",
    "He was slain by one of the gods you banished, but has since returned.",
    "I've come on behalf of the elves. We need to know how we can restore Seren.",
    "When you demand she leaves she will choose to shatter herself into crystals rather than abandon the elves.",
    "Do you know if it's possible to rebuild her?",
    "How do we reconstruct them?",
    "What about all the parts of her that have been lost?",
    "Thank you, Guthix.",
    "Someone's spying on us?",
    "Okay, I'll be back soon.",
    "Hello?",
    "Yes, I saw you another time I travelled to the past.",
    "You can trust me. I'm working with the elves, that's actually why I'm here.",
    "Ah, so that's why you're here. Perhaps I should let him know...",
    "You look just like her, even your names are similar.",
    "So she's the same age as you? Even now?",
    "Wait-",
    "Yes, the intruder was an elf called Haluned.",
    "Haluned said an elf I know called Eluned was her twin. Do you think she meant someone else?",
    "What should I do now?",
    "Be seeing you, Guthix.",
    "Thank you for all your help, Guthix.",
    "I don't want to leave you, Guthix!",
    "Predem abducto!",
    "Goodbye, Guthix...",
    "The enchanted key worked. It took me back in time to speak with Guthix.",
    "He told me we need to collect the major shards of Seren. We'll need replacement crystal to fill in the gaps, so to speak.",
    "Where are they now?",
    "All he said was we need to find an elf who knows powerful ancient magic to restore them. The kind possessed by some of your ancestors.",
    "I found out something that might explain why you want to return the shards to each other so badly. I'm not quite sure how to say this but... Apparently you may be a part of Seren, like Haluned before she became the Dark Lord.",
    "I spoke to Haluned in the past. She said you were twins, born from the same mother.",
    "How are you doing, you know...being a...er...",
    "How can I find the Spiritualists shard?",
    "How can I find the Spiritualists shard?",
    "I'm looking for a rare ingredient for the Elixir of Revealment.",
    "Yes. Do you know where I can find one?",
    "Oh? That sounds ... really ... interesti ... zzz",
    "Yeah...so...what metal is it made from?",
    "Got it. I'm ready to start the ritual.",
    "Got it. I'm ready to start the ritual.",
    "Puro.",
    "Glanha.",
    "Adfer.",
    "Ddiarddel.",
    "Llygredd.",
    "Here's the shard we purified!",
    "Here, we managed to purify the Spiritualists shard!",
    "The human? I have a name you know.",
    "Oh...sorry.",
    "My name is Player, I'm working with the elves to restore Seren and save Prifddinas.",
    "Baxtorian, it's an honour to meet you.",
    "Player, The World Guardian.",
    "It was a title given by Guthix himself.",
    "...",
    "Player, Saviour of Prifddinas.",
    "Well, where do I begin?",
    "And then, with the Dark Lord defeated, we returned Prifddinas to its former glory.",
    "Player, Arianwyn's friend.",
    "But you have a grandson, Islwyn.",
    "Player, the Ravensworn.",
    "Well it took a long time to get, so I wanted to show off.",
    "Player, follower of Seren.",
    "Why have you sealed yourself away?",
    "So you turned yourself to crystal?",
    "You seem to be doing ok, considering.",
    "I have so many questions...",
    "The what?",
    "What was that?",
    "Not necessarily...I mean Seren was fine without you being part of her previously right?",
    "How do you feel about all of this?",
    "I understand.",
    "I was told you have access to the Grand Library through your arena, can you take me there?",
    "The elders told me, I need to find what remains of the Dark Lord.",
    "Good riddance.",
    "I found the Dark Lord shard and chose to bring it back to use in the restoration.",
    "I found the Dark Lord shard and chose to destroy it.",
    "I searched everywhere, there was no trace of the Dark Lord.",
    "How many crystals do you think we'll need?",
    "What am I doing again?",
    "I met a shapeshifter.",
    "You're right. I don't know why I brought it up.",
    "Erm...hello?",
    "Hello, pleased to meet you.",
    "You can talk!",
    "Sorry, it's just...well the other shapeshifters have been...",
    "I'll talk, but I'm staying armed.",
    "I am Player.",
    "Tell me about the crystals.",
    "I need complete crystals.",
    "I have my reasons.",
    "I am rebuilding Seren.",
    "She shattered herself, rather than abandon the elves on Gielinor.",
    "I'd rather not fight them.",
    "Fine by me.",
    "I can get it elsewhere.",
    "I will fight the shapeshifters.",
    "I prefer a peaceful solution.",
    "Can I exchange fragments?",
    "What do the crystals do?",
    "That sounds...unpleasant.",
    "Tell me about yourself.",
    "What is your role here?",
    "So there's no lord, lady or any kind of ruler here?",
    "What can you tell me about your history?",
    "None taken.",
    "What are your opinions on Seren?",
    "Tell me about the shapeshifters.",
    "What are they?",
    "But not you?",
    "What are the crystals?",
    "Can I help them?",
    "Perhaps the elves on Gielinor can help.",
    "Let me get Eluned. She's an elf from Gielinor.",
    "I could gather more crystals. I need to gather them for the elves back in Gielinor anyway.",
    "Will you be able to resist the temptation to use them yourself?",
    "Tell me about Tarddiad.",
    "What happened to the elven civilisation?",
    "What are these crystal growths?",
    "What was the religion before Seren?",
    "I know that song...I know it...",
    "No...It's more than that. It was the last piece I needed! Thanks.",
    "I've discovered the last part of the song[sic] of Restoration as well.",
    "Maybe you don't have to? Seren was fine without you as a part of her before, maybe she doesn't need you now.",
    "It's the only way.",
    "I've been there before. It was where I encountered ...",
    "Zaros. I encountered Zaros there.",
    "... someone strange.",
    "Yes.",
    "No.",
    "I don't think it's because of you.",
    "Here we are, Seren. We'll soon have you fixed.",
    "Cough, cough!",
    "Don't worry Seren, this isn't Tarddiad.",
    "There, we're nearly finished, Seren.",
    "Phew! Gasp! After that climb I'm feeling bushed. You know, given the theme of your temples I would have thought you'd have been...lighter!",
    "Well I thought it was funny.",
    "A Muspah! I can't fight that while I'm carrying Seren! I'll have to avoid its attacks while I think of something.",
    "Zaros, you saved us!",
    "I didn't have much of a choice. How else am I supposed to complete her body?",
    "But then why is she not awake? Did we not find all the shards?",
    "How am I supposed to do that? I've come too far to fail now.",
    "Why don't you do it yourself? And why do you have to leave?",
    "I don't understand fully, but you did just save me so I accept your terms.",
    "The future?",
    "Yes. He told me how to help reinvigorate you.",
    "No. Not that I am aware of.",
    "Who's Zaros?",
    "Which is?",
    "You bet Seren wouldn't reform?",
    "The key can do that?",
    "World Guardian is a bit formal. Don't you think?",
    "And which am I to you?",
    "I'd like to ask about you.",
    "What was it like, shattering yourself into pieces?",
    "I'd really rather not.",
    "I'd like to talk about Haluned, the Dark Lord.",
    "What was Haluned?",
    "You created life?",
    "Were you aware of what it was doing?",
    "How do you feel about the Dark Lord?",
    "How are you going to atone?",
    "I'd like to talk about Eluned.",
    "What is she?",
    "That's not really what I was asking.",
    "Where has she gone?",
    "But then you'd have never come to Gielinor.",
    "What was Eluned?",
    "Can you bring her back?",
    "How do you feel about her?",
    "I'd like to ask about Zaros.",
    "Did you know that he's returned?",
    "What is your relationship with Zaros?",
    "Are you two on good terms with each other?",
    "Should I trust Zaros?",
    "I'd like to ask about Guthix.",
    "I'm sorry, let me ask something else.",
    "Did you love him?",
    "I'd like to ask about the Elder Gods.",
    "What are they?",
    "Where are they?",
    "Gielinor.",
    "How can they be stopped?",
    "I shall.",
    "But Zaros already has a plan.",
    "I'd like to ask about the Dragonkin.",
    "I'd like to ask about Armadyl.",
    "Would you consider working with him, Armadyl believes that Gielinor can unite under a banner of peace.",
    "I'd like to ask about Bandos.",
    "But don't you see the wisdom in his philosophy?Survival of the fittest is a fundamental trait of nature.",
    "I'd like to ask about Saradomin.",
    "I'd like to ask about Zamorak.",
    "But I thought you and Zaros didn't get along?",
    "But surely you see the wisdom in his philosophy? We improve only in response to chaos. Order brings only stagnation.",
    "I'd like to ask about Sliske.",
    "I'd like to ask about Brassica Prime.",
    "But what does he even do? I mean he just seems ... well nuts.",
    "So he helps the anima mundi?",
    "I'd like to talk about the future. What will you do now?",
    "So that's it, you'll just sit here and think?",
    "I'd like to talk about your history.",
    "What was your role in the god wars?",
    "I'd like to ask about your history with the elves.",
    "What was Tarddiad like?",
    "Tell me about elven longevity.",
    "How do you feel about the clans?",
    "You said nine clans?",
    "I'd like to ask about your life on Freneskae.",
    "Tell me about yourself.",
    "What was elven royalty like?",
    "I hear you can do powerful magic.",
    "Why not?",
    "What will you do now?",
    "Tell me about Glarial.",
    "Tell me about elven history.",
    "What happened after Seren shattered?",
    "Tell me about the elven expansion.",
    "Tell me about the Iorwerth uprising.",
    "Tell me about when you went to the falls.",
    "What do you think of Seren.[sic]",
    "What do you think of the current elves?",
    "Do you intend to retake the crown?",
    "What is your relationship?",
    "Does this affect your plan?",
    "Are you happy she's returned?",
    "I've heard all that I need to."
  ],
  "Arianwyn": [
    "Player, well met. I confess I am pleased to see you. Perhaps you can help us with this chaos.",
    "Likewise, but I'm afraid the situation is too dire to go through the nicities[sic]. we[sic] must discuss the issue at hand..[sic]",
    "And it is greatly appreciated, given all you have done for us so far. There are important matters we must turn our attention towards.",
    "If you don't mind, there are important matters we must turn our attention towards.",
    "I, for one, think Eluned is right. We have finally regrown our city, I will not lose it again. It is time we brought Seren back.",
    "We've sent some of our brightest scouts into the east to investigate non-elven forms of magic, but such journeys have proved perilous. Some of those chosen have still not returned. It was deeply saddening to hear from Ilfeen that one was murdered on her way to meet a contact in Morytania.",
    "Agreed. We cannot ignore what is happening outside these very walls! I vote she be made whole once again.",
    "I'm disappointed to hear you say that, Player. You wouldn't just be doing this for Seren though, you'd be doing this for us.",
    "That's settled then! Where do we start?",
    "What about if we were to-",
    "It may allow us to speak to one of our ancestors who possesses a deeper knowledge of crystal singing or elven magic. Perhaps even both. Or maybe even Seren herself! What better way to find out how to restore her?",
    "You should locate the key and bring it to Lady Trahaearn to attune.",
    "I wonder where the key will take you?",
    "Player, you've returned! How goes it?",
    "It is well known that clans Cadarn and Iorwerth formed the Military. We were at war at the time, though. The old Lord Iorwerth had a certain disregard for our goddess. Baxtorian likely hid the shard entrusted to the Military.",
    "Let us focus on gathering the shards first. Perhaps we will find something useful on the way.",
    "That's understandable. Everyone, we should give Eluned some breathing room.",
    "Here, this may help you. It's a poem written by Baxtorian himself. The first part you may know, but only a handful of us know the existence of the second section.",
    "It looks like you have no room in your inventory for it, clear some space and then come back to talk to me.",
    "I'm sure it will be valuable in tracking down this shard.",
    "I'm sure that book will offer us an insight into the military shard, there's something odd about the second section.",
    "Do you see? The final verse has massive implications!",
    "Exactly!",
    "No! No.",
    "No! No.",
    "He may still be alive somewhere in the Falls themselves. Sealed in such a way that only Glarial could find him.",
    "This would have been such a tragic ending for a great man. We should investigate his statue, I am sure it's more than it seems.",
    "Deffro Baxtorian, eich pobl sydd angen i chi! DEFFRO!",
    "I'm sorry your majesty...",
    "Then you would like the new Prifddinas.",
    "The old regime is gone, yes, the new Iorwerth stood against them and wished to return the elves to democracy.",
    "Because I stand before you, now, as the Lord of clan Cadarn. From a Prifddinas that is once again free.",
    "I'm sorry...",
    "King...Lord Baxtorian, we are here because Prifddinas needs your help. We need to reform Seren and we are missing the shard held by your military. Do you know where we could find it?",
    "We would be honoured to have you involved.",
    "Get the shard, then let's head out of here.",
    "We should return to the tower. Hold on to the shard for now, I'll take it from you when we get there.",
    "You got the shard? I had no doubts you would my friend.",
    "Now you should turn your attention to the other shards, there are yet more out there",
    "Surely you don't mean-",
    "I think you need to speak to Morvran.",
    "How goes the search of the Grand Library?",
    "Oh!",
    "Does anyone know the combination that will take us there?",
    "Ha ha! I knew you could do it my friend. Seren is right, you are the champion of Prifddinas and of the elven people."
  ],
  "Lord Crwys": [
    "You are the first human to attend such a conclave, young one. How the times change...",
    "Indeed! We have all seen the changes in the crystal. The trees cry out in fear as the city writhes and stretches.",
    "Hmmm. There is an ache, though... From Isafdar, through the roots of our great city, to the tallest spire. Nature itself yearns for her return. I vote she be reformed.",
    "There are risks, of course. Meddling with time is a dangerous game. We must progress with... caution. We elves have a relationship with time that allows us to slow its effects, but reversing it completely could create branches. Branches and splinters in the flow of time... Hm, dangerous indeed.",
    "Thank you for your help in this matter Player, we owe you many debts.",
    "Replacement crystal? The only place we could get that would be Tarddiad.",
    "Ah yes, I had almost forgotten how Crwys and Meilyr used to be bound. The Naturalists...that is what they called us.",
    "The Meilyr and my clan took our shard and buried it deep beneath the earth, in a cave, so that it would be safe. Over time a great crystal tree grew over this cave, marking its entrance. So we took the seeds of this tree and grew several more outside the great city and we enchanted the cave so that it would be revealed only to those who knew the secret. Seek out this tree when it is in a state of heightened activity and then you will need to use a special potion so that the entrance will reveal itself. Talk to Lady Meilyr to find out what's involved in that.",
    "You have recovered the shard, Player, I never doubted you would.",
    "Patience is a virtue my lady. Sometimes just by standing still and thinking through, we can reach the root of the problem.",
    "You are getting the hang of them my lady. It's always good to branch out a little.",
    "Strange that we should be so willing to reunite Seren with the darker aspects of herself.",
    "If I may, the World Gate has been returned to us once more, it was how we came here, surely it's a way back.",
    "I agree with Player; Eluned is her own self now, complete and uncorrupted unlike her sister. She has every right to remain just as she is.",
    "She is a seed that has grown separate from the tree for too long now. Who's to say that forcing Eluned to sacrifice herself would not make matters worse?",
    "And with Seren returned, it is like spring once more. The city and its people, are rejuvenated in her light. You are the firmament that the city grows upon, without you this city would have withered and died."
  ],
  "Lady Trahaearn": [
    "Ha, young one. Oh, Lord Crwys... You are all young ones to me.",
    "Hrmm. I rather set myself up for that one, didn't I?",
    "My husband Cynog died to protect the walls around us. These walls that were built from Seren's crystal! She shattered herself so that we could prosper; we should honour their sacrifices. We can find other ways to stabilise the city.",
    "Quiet! Enough squabbling, I may have a solution. A little farfetched, perhaps, but desperate times call for desperate measures. The ancient elves of my clan once smithed an artefact that was imbued with the power to manipulate time.",
    "Oh! That certainly is a twist of fate.",
    "The general belief is that the key is attuned to a few specific moments in time. Mostly times of historical significance, such as early Gielinor and so forth. However, from my studies I believe it is more that the key exists outside of time and can be focused on a specific goal. If you know what you're doing of course, which I obviously do.",
    "You'll need to bring me the key so I can modify it.",
    "You'll need to bring me the key so I can modify it.",
    "So you have the key? I would very much like to see it.",
    "Hmph. Fine. Suit yourself.",
    "Let me have the key a moment, I'll attune it properly...",
    "Now, this bit goes here...",
    "Then I turn this bit like so.",
    "Now I just need to reallign[sic] the positronic ray...",
    "Nothing nothing, ignore that. Also ignore the faint smell of fudge...",
    "No reason. Everything is fine. No need to panic...",
    "There, done. The key should now be attuned to a place and time that will help us restore Seren.",
    "Right, off you go. Backwards through history...and all that.",
    "So you have the key? I would very much like to see it.",
    "I see, treasure hunting more important than saving this city from destruction? I quite understand. Don't trouble yourself, there's no hurry or anything.",
    "Oh no, I'm as happy as can be. You are clearly going mad. Off with you.",
    "This key is truly one of a kind. Do you know that all the records for creating such an artefact were lost? Burned away in a freak fire. The original inventor slipped on some stairs and bumped his head, suffering complete amnesia over the methods needed to create the key. All that is remembered is that the process seemed almost easy, as though the key wanted to be made. Hokum, obviously, but fascinating. If only we could harness the power at will, we would be able to rewrite history. I could remake the world! It would be a glorious world, in my image. HA HA HA HA HA! Ahem, sorry about that, sudden bout of megalomania, it's passed now. Take care of that key Player it is unique.",
    "Hmph. Fine. Suit yourself.",
    "The major shards he spoke of, we gathered them during the aftermath of Seren's shattering. We can worry about replacement crystal once we have gathered them once more.",
    "It was a chaotic time. The four largest shards were divided and given to clans of similar cultures for safe keeping.",
    "And then there is the Artisans: clans Ithell and Trahaearn. Long have we built the foundations of elven civilisation, so of course we were entrusted with a shard.",
    "My memory is a little foggy, but I recall we hid the shard under the watchful gaze of Lady Ithell. There was some sort of defence system in place as well. I can't for the life of me remember what it is though.",
    "My memory is a little foggy, but I recall we hid the shard under the watchful gaze of Lady Ithell. There was some sort of defence system in place as well. I can't for the life of me remember what it is though.",
    "Hrmm...you want to know the secret of my suit eh?",
    "You will never fully understand my genius, the designs cannot simply be explained to lesser minds!",
    "Years of research...careful experimentation...many...painful sacrifices. This is my magnum opus, my greatest work!",
    "I will never share my genius: AHAHAHAHAHAHAHAAAA!",
    "Oh. Runite. I had a good supply and it's a very sturdy metal.",
    "Erm...forget the whole mad laughter kind of thing. I get a bit carried away sometimes.",
    "Ah Cynog. A good man and a devoted husband. Never have I met a man quite so pliable and devoid of opinion.",
    "I could say 'jump' and he would. I could say 'dance' and he'd flail about, because he had no grace whatsoever.",
    "I lost him when a building collapsed on him. No one was to blame, it was a freak accident that couldn't have been avoided.",
    "I still miss him.",
    "Every time I hear music playing, I imagine him trying and failing to dance to it. A good man, but a rubbish dancer.",
    "How on Gielinor should I know? I'm old and forgetful and other obvious excuses. Go and take a look yourself!",
    "HAHAHAHA.",
    "Well our future is doomed then. Look at them, lollygagging layabouts.",
    "Especially you barkbrain!",
    "More tree puns? Your should LEAF them alone!",
    "The shard! How wondeful[sic]! You've done very well.",
    "Now you need to find the other shards.",
    "You found the artisans[sic] shard, perhaps you should look into the other shards? Don't forget to return them to the lords so they can prepare them.",
    "Some people here will tell you that we don't need the dark part of Seren reunited. I disagree. No one is truly good, nor evil, but both. We are made from our actions and our inactions. Our reason and our emotions. To believe we can pick and choose is folly and reckless. I urge you, Player, she must be reunited with that dark aspect of herself.",
    "Where can we get more, without, you know, tearing down the city?",
    "The old tree is right. I've lived long enough to see the dangers of absolutes. Let Eluned keep the life she has earned, Seren doesn't need her to be complete.",
    "What a tragic waste.",
    "Is it though? I can't be the only person thinking it sure[sic]? Seren spent years without incorporating Haluned and Eluned, does she really need them both now?",
    "Well ... great ... well done. Now I've lost a bet.",
    "Ha ha. No, I knew she'd reform. I was just certain you'd end up breaking the universe with that time key before I saw it.",
    "... No? ... Oh look! A distraction!"
  ],
  "Lady Hefin": [
    "Millennia ago Seren made the ultimate sacrifice for the elves. Rather than leave us when Guthix established his edicts, she chose to stay. She shattered herself into thousands of crystals so that she would always be with us.",
    "I spent many years living alone in the poison wastes contemplating this very question. At first I was blinded by the feeling of betrayal some of you may still harbour. But as the years turned into decades, and the decades trickled into centuries, my meditative state grew deeper and I began to feel it... We have an innate connection to Seren's crystals. Like them, this connection runs deep into the soil of these lands. She is as much a part of Tirannwn as we are. The Hefin clan has purified its crystal long enough. It is our duty to reform Seren.",
    "There's no time for introspection here, you should find the key, get Lady Trahaearn to attune it and then see where it leads you.",
    "Our shard was found in the Poison Waste. Since Prifddinas was regrown we've housed it in our monastery, trying to purge the corruption. My clan has been working tirelessly and I now believe we may be able to perform a ritual to cleanse the last of the poison. The ritual will require three light cores if we are to purify the shard completely. They can be found using Divination in Lord Amlodd's district. Meet me in the monastery when you have the necessary supplies. I'll be waiting.",
    "The ritual requires us to synchronise several poises in a row so we are in harmony, then we will perform an incantation in the elven tongue. I will speak the words and then you must copy me. At first there will be three words and poses, but these will increase to five as the ritual intensifies.",
    "The words we must speak are: 'puro' meaning 'purify', 'glanha' meaning 'cleanse', 'adfer' meaning 'restore', ddiarddel' meaning 'expel' and 'llygredd' meaning 'corruption'.",
    "Now for the incantation, listen carefully!",
    "[Series of randomly selected words from above]]",
    "Incorrect, pay more attention next time!",
    "It's working! Only [2 or 1] more to go.",
    "We've done it! Finally the Spiritualists shard has been purified. Return the shard to me or Lord Amlodd when you next visit the Tower of Voices.",
    "With the corruption purged from our part of Seren I feel like a great weight has been lifted from me. Thank you, Player.",
    "You should lend the other clan leaders your help so we can find the remaining Seren shards.",
    "You've already found the Spiritualists shard. Lend the other clan leaders your help so we can find the remaining ones.",
    "You must recover the dark part of Seren's spirit. She must be whole again.",
    "Tarddiad...",
    "Seren was there for years, we don't even know how long, and it's a world we know is filled with crystal. If there's anywhere that might have the sort of crystals that we need, it will be there.",
    "It would be a noble sacrifice Eluned. Seren and you would both be whole again.",
    "We need Seren whole again. We cannot risk her being incomplete. I'm sorry Eluned, truly I am, but Player is right.",
    "Zaros? He's a dangerous being Player, Seren spoke often about his treacherous nature.",
    "Lady Seren?",
    "Well done adventurer. Seren has returned and our people are whole once more. You have no idea what this means to me ... to us. We are forever in your debt."
  ],
  "Lady Ithell": [
    "We kept these crystals close and, since they had unique properties, we used them in a variety of our crafts. Notably in our architecture. Parts of this magnificent city that surrounds us were constructed from those very crystals. We are surrounded by Seren.",
    "Well I say we restore her. The Ithell clan cannot deconstruct these growths forever, and I long for the chance to sing Seren back to her true form.",
    "Our clan has piles of research into how crystal singing might be used-",
    "The key...some part of me remembers it, though I have never seen it. I have fond memories that never belonged to me, of a device that appears to the right people, when needed the most. You're quite special Player. It's no wonder that we put so much faith in you.",
    "Did Guthix share anything about how to reform the pieces? Perhaps a new crystal singing technique?",
    "Oh... Well, maybe we need to use the enchanted key again?",
    "All I know is that the shard is hidden deep beneath the earth. The entrance is watched over by clan Ithell. Not sure what that means I'm afraid.",
    "Fantastic, I knew you'd find it.",
    "Now you need to find the other shards.",
    "You already found the artisans' shard.",
    "You managed to return all the shards!",
    "Listen, think carefully. Do we really need to incorporate that nightmare into Seren? Remember all the death and destruction it caused!",
    "There is no need to distrust the Iorwerth now, King Baxtorian...",
    "ENOUGH! Baxtorian, lord[sic] Iorwerth here was instrumental in taking down the old Iorwerth regime. He has more than proven that he is a friend of all the clans, not just Iorwerth. I understand your past with the Iorwerth, but now is a time to mend bridges and not burn them. Lord Iorwerth, you were saying?",
    "I knew you wouldn't fail us Player. Thank you for everything."
  ],
  "Lord Amlodd": [
    "It has been thousands of years since her shattering, but we have always held faith. Our scholars have continued to research all possible avenues.",
    "Indeed... I believe our past holds the key. But we are still unlocking the secrets of our ancestors.",
    "As is tradition, it shall be put to a vote. One voice will emerge from many. Player, ordinarily only clan leaders are permitted to vote. Though, given the circumstances, we are in agreement that you have earned that right. As our honoured guest, you will cast the first vote. What say you?",
    "I find Lady Meilyr's argument compelling. Seren made a great sacrifice for her people one that we should honour. We can find another way to protect the city.",
    "Lady Ithell you are right, we cannot rely on your clan to repair everything forever. I vote that we restore Seren.",
    "Even in times of peril we still stand by tradition I see. The vote currently stands at a tie. Lady Hefin, you have the deciding vote it appears.",
    "So it is decided, we shall find a way to restore Seren.",
    "Lady Trahaearn has attuned the key, you should see where it leads.",
    "The key is a powerful device, the spirit within it must be strong. Hrmm.",
    "Lady Trahaearn has attuned the key, you should see where it leads.",
    "Then the legends of the key were true! Surely a being so powerful as Guthix had important insights for us?",
    "Ah, I remember it as though it were yesterday. The bonds between certain clans ran deeper back then. Amlodd and Hefin were known as the Spiritualists. We still protect our shard to this day.",
    "Adventurer, come and speak to us individually to learn more of how we might find the shards.",
    "The shard entrusted to Lady Hefin and I was found in the Poison Waste. Many years have been spent trying to purify it of the corruption that gripped it there. Thanks to the hard work of the monks in the monastery I believe we are close to finally purging the poison once and for all. Lady Hefin tells me it will involve a ritual at the monastery, completion of which will require three light cores that can be gained through Divination in the Amlodd district. Good luck, adventurer! Bring the shard back here when you are done.",
    "Fine work, adventurer! I knew it could be done.",
    "Now, do not tarry. There are still more shards to find if we are to restore Seren once more!",
    "You've already found the Spiritualist's[sic] shard. Perhaps you should speak to some of the other clan leaders about where the rest can be found.",
    "So, we are to reunite Seren with her darker self. Wise. An incomplete spirit is more dangerous than one tainted with darkness.",
    "There is. There's just not enough crystal infused with her essence.",
    "Then we are settled then. Player head through the World Gate to Tarddiad, Eluned will meet you there. Be careful though, no one has been to Tarddiad in centuries, who knows what it has become.",
    "Have you not felt incomplete all your life Eluned? That you were part of something greater?",
    "I wish I could agree with your[sic] Lady Trahaearn, but I fear the dangers of reviving an incomplete spirit.",
    "Do you hear them ... the whispers? A voice ... she speaks of a barren world far away. A dead world that bleeds magma and cloaks itself in storms. She calls it her birthplace. Freneskae. Player you must take her body to somewhere called Freneskae.",
    "My lady Seren, you have returned at last. I have no words to describe this honour.",
    "You have done us a great service Player. The city and her spirits are now calm once more. You have my thanks."
  ],
  "Lady Meilyr": [
    "Seren made a choice, the reasons for which no amount of reflection or meditation may ever help us truly understand. I say we respect that choice.",
    "Hm, perhaps a potion to give us further insight through internal reflection?",
    "You get a chance to explore through time itself? Why are you still here? Go, adventure across the millenia[sic]!",
    "Indeed, our shard is well hidden. Lord Crwys and I alone posses the knowledge required to find it.",
    "Long ago, we buried our shard beneath the earth in the heart of Prifddinas. Eventually it transformed a simple seed, which instead became a mighty crystal tree. Through the magic of this seed we locked the cave that held this shard to this tree and then the tree split into a network of trees. Now the shard can only be found by a tree that is in an active stage of growth and a special potion used on it. Sadly I can no longer recall the recipe fully. I only remember pieces. First, you will need a grand defence potion as its base. From there you'll need to find a rare ingredient from Isafdar and another ingredient that is a closely guarded secret of the treants. Unfortunately that's all I remember. But I hope it's enough.",
    "Wonderful, I knew you would be able to get it.",
    "Now you need to find the other shards.",
    "Now you need to find the other shards.",
    "I'm not convinced we need to incorporate the darker aspects of Seren into herself. Surely we want her at her best?",
    "The question is, does anyone know how to get there?",
    "You did it! I'll have to brew some special potions in celebration. Thank you, World Guardian."
  ],
  "Lord Iorwerth": [
    "I also believe we should honour her sacrifice. Even as scholars we can never claim to fully comprehend the decision Seren made.",
    "All of which have been inconclusive. No one has any idea where to start!",
    "You speak of the key? I have heard only tales in books, wasn't it lost long ago?",
    "Be careful with that key, time is not something to be trifled with.",
    "The actions of my clan, historically, have not been the best. I think you would be better of[sic] speaking to Lord Cadarn.",
    "Excellent, you have the shard!",
    "Wait, there is one other...",
    "Yes. The Dark Lord was a shard of Seren. What if there is a part of it left?",
    "Guthix said we need all the major shards of Seren, yes? What if that includes Haluned and perhaps even Eluned? Player, go and speak to Morvran. He'll be able to let you into the Grand Library to search for any remnants of the Dark Lord.",
    "You must unite Seren with every aspect of herself, no matter how much you may not want to. It is vital that she be returned with even the darkest parts of herself intact. Even gods must attone for their sins, not just be given a blank slate.",
    "I believe I can help with that. In my studies I did come across a reference, it may not be too difficult to deduce the combination.",
    "I can assure you the information is quite genuine.",
    "He is no king of mine.",
    "Yes, I believe a little trial and error may be needed to reach Tarddiad via the World Gate. I will entrust Player with what little information I have so there can be no clan bias. The information will allow you to bypass the barrier that prevents access to Tarddiad, but you'll need to work out the gate attunement yourself.",
    "No, Seren must be made whole again.",
    "Let's just hope you made the right decision.",
    "Yes. I remember reading about a place with that name. Seren spoke of it rarely and never fondly.",
    "Hrmm. It seems that Freneskae may hold some answers then, but be careful.",
    "I congratulate you on your achievement. There are none other that could have done what you did. There will be tales of people who slew gods, but you, alone, will be the hero who saved one. I am honoured to know you."
  ],
  "[Random elder": [
    "] Welcome back, Player."
  ],
  "[Guthix": [
    "] It is not often that someone finds their way in here. Who might you be?",
    "] World guardian... what a curious title... and who appointed you guardian of the world?",
    "] I see...or I will...I suppose.",
    "] You are much more than just an adventurer, I see that well enough.",
    "] Ah, then we are friends? Will be friends, perhaps. Regardless, it is always good to see a friend.",
    "] I am intrigued. You find yourself here... now, even as I prepare my greatest workings...with the Amserdrwys. Why are you here?",
    "] Forgive me, I do not know the words you use to count down the ages. Since we are known to one another, perhaps I can tell you what is going on in Gielinor now. This...wonderful...world has been besieged by younger gods. They have brought with them their wars, their cruelties and their callousness. The people of Gielinor have suffered enough, I have no choice but to banish the other gods. All of them.",
    "] Not yet. She is different from the others. She cares not for power or worship, she just wants to protect and care for her people. I would wish nothing more than for her to stay...But the lesser gods have forced my hand. I must ask her to leave, though it breaks my heart to do so, no gods can stay on Gielinor...not any more.",
    "] The Amserdrwys, yes. Seren and I discussed it in detail, she was very proud of the ingenuity of her elves. I cannot blame her, to step through time is a most impressive feat.",
    "] All things must die. That is the balance of life. For life to have meaning, it must be finite. The longer we live the more we realise that all things come to an end and that nothing is truly forever. It is mortality's greatest gift that things like friendship, peace and love can seem eternal. I have always known my death would come and it does not frighten me.",
    "] Yes. I sense my power within you. Use it wisely, live up to the mantle I have bestowed upon you. I have faith in you.",
    "] 'Zaros'... I have heard this name before. Seren spoke of him. I am not aware of his presence. If he was here, he departed long before I awoke.",
    "] To return from death is an unnatural act requiring great power. Be wary of this god, adventurer, such power rarely comes without a cost.",
    "] Restore? I'm afraid I do not understand...",
    "] Seren... Such incredible sacrifice. Her bond to the elves may be unbreakable, but I cannot discriminate. Gielinor must be safe from the wrath of gods. It is the only way.",
    "] Perhaps...First you will need to collect what major pieces of her remain.",
    "] Elven magic is unlike any the other races possess. A rare few of them wield it with far greater power than their kin. Not only did these elves create the key you hold, but the most proficient among them are able to form vast crystal structures with voice alone... They have even mastered the elements and become able to manipulate nature. An elf that commands such power may know the song required to reshape their goddess.",
    "] I do not know. It may be that you will need to find a way to restore what is missing.",
    "] Wait... I feel the presence of another here. We are being watched.",
    "] I can sense Seren's essence. It is her but... Different, somehow. The intruder is somewhere in this chamber. I suggest you seek them out before you depart.",
    "] The intruder is somewhere in this chamber. I suggest you seek them out before you depart.",
    "] Return to me, adventurer.",
    "] Seren has been keeping watch over me.",
    "] I am aware of her. One of Seren's creations. A piece of Seren with a will of her own.",
    "] Haluned is a part of Seren; a shard. It is unlikely she is the only one. If this is true for your friend, then I'm afraid you will both face difficult decisions ahead.",
    "] You have the information you came here for. Gather the major shards and find an elf that has the power to restore them. I will visit Seren for the final time. Trying to change her mind may be futile, but it will help me accept her fate. Go now. The elves of your time need you.",
    "] Goodbye, Player.",
    "] Goodbye, Player. I look forward to meeting you again.",
    "] Yet you must. We will meet again, though for you that has already happened. Goodbye, Player."
  ],
  "Haluned": [
    "Oh! You spotted me! Wait, I recognise you. Have we met?",
    "That's right! You were the human I saw all those years ago. The one misplaced in time...",
    "I've got it! You were the human I saw all those years ago. The one misplaced in time...",
    "How strange that we should meet again. You're quite fascinating for a human.",
    "I'm sorry, I shouldn't really tell you. Seren sent me herself.",
    "But I saw you talking to Guthix! It's him I'm supposed to be keeping an eye on!",
    "Oh no, please! It's only because Seren is worried he's going to make her leave. I'm to report back if Guthix leaves this dwelling.",
    "Why would you ask that?",
    "Well, that's because we are born from the same mother. You might say we're twins.",
    "Y- Oh, I've said too much. I won't speak of her any more.",
    "My mistress calls for me... She's displeased - it was wrong of me to speak to you. I should go."
  ],
  "Coeden": [
    "Now ... that ... is ... something ... I ... haven't ... heard ... in ... a ... long ... time. You ... must ... be ... looking ... for ... the ... wintercup ... mushroom.",
    "Yes ... yes ... I ... can ... tell ... you ... where ... to ... find ... one ... It ... reminds ... me ... of ... a ... funny ... story ...",
    "It ... begins ... on ... a ... cold ... winter's ... evening ... There ... I ... was ... sitting ... blah ... on ... a ... stool ... Just ... blah ... sapling ... blah ... my ... own ... business ... Blah ... a ... strange ... blah ... appeared ... blah ... of ... nowhere ... Naturally... blah ... was ... confused ... blah ... their ... blah ... arrival ... but ... When ... blah ... offered ... me ... blah ... blah ... I .... was ... pleasantly ... blah ... I ... blah ... his ... blah ... and ... together ... blah ... flew ... into ... the ... blah ... Blah ... the ... forest ... blah ... was ... blah ... blah ... big ... blah ... with ... enormous ... roots ... blah ... upon ... its ... magnificent ... blah ... were ... blah ... growths ... of ... brilliant ... blah ... and ... they ... blah ... cold ... blah ... blah ... touch ... Blah ... squidy[sic] ... blah ... blah ... held ... blah ... but ... blah ... immediately ... blah ... saw ... blah ... blah ... powerful ... blah ... blah ... knew ... blah ... Blah ... they ... blah ... on ... blah ... blah ... blah ... had ... blah ... fight ... blah ... Blah ... didn't ... blah ... my ... blah ... strength ... blah ... blah ... snapped ... blah ... blah ... like ... blah ... twig ... blah ... blah ... of ... shock ... blah ... blah ... face ... blah ... haunt ... blah ... dreams ... blah[sic]",
    "Here ... the ... mushroom ... is ... yours ... May ... it ... give ... you ... better ... memories.",
    "Ah ... but ... you ... already ... have ... the ... mushroom ... go ... brew ... the ... potion.",
    "Oh ... I ... thought ... you ... might ... enjoy ... my ... story ..."
  ],
  "[Clan leader": [
    "] I'm not entirely sure what you're expecting me to do with that ... but I am not going to do it."
  ],
  "[Lady Meilyr or Lord Crwys": [
    "] You already found the naturalists' shard."
  ],
  "Trahaearn automaton mk V": [
    "Identifying life form...",
    "Identity unrecognised. Access prohibited.",
    "Exoskeleton detected. Confirming identity. Please identify the metal your exoskeleton is comprised of.",
    "INCORRECT: ACCESS PROHIBITED",
    "Correct.",
    "Please state the name of your husband Lady Trahaearn.",
    "Correct.",
    "Please state the number of Seren stones currently being monitored by clan Trahaearn.",
    "Correct."
  ],
  "Trahaearn Automaton MK V": [
    "Analysing response to this statement: 'Our children are our future'",
    "Welcome back, Lady Trahaearn.",
    "Entering passive observation mode"
  ],
  "Baxtorian": [
    "Glarial? My Glarial you've retur...ah. It was too much to hope for. I should have known. Is there at least news?",
    "No, my friend, I am no king, no longer. I gave up my crown long ago. If anything the elves should split the crown between them, each clan held in equal esteem.",
    "A new one? Has Iorwerth fallen?",
    "Then perhaps now is the right time to return...who is the human?",
    "And a chip on your shoulder. I meant no offence by referencing your species.",
    "Honour? Perhaps not, I do not feel I deserve that reverence. Let's settle for being pleased to meet one another. What can you tell me about yourself, so I may better know you?",
    "What a ridiculous title...sorry, I mean what an impressive title. How did you earn it?",
    "Oh. In that case I completely take it back, it doesn't sound ridiculously self agrandising[sic] at all.",
    "Oh dear, this isn't coming out right at all.",
    "Really? And how did you accomplish this great feat?",
    "Well then, you achieved what I could not. In that case I profess the honour of this meeting is mine.",
    "A simple and honest moniker. And you Arianwyn, why should I care that this adventurer is your friend?",
    "So it's true, you succeeded where I failed...and Glarial?",
    "I see.",
    "A grandson...so Eirlys survived...and had a child? I shall have to meet him.",
    "The Ravensworn? Should that mean something?",
    "It does sound impressive, I'll give you that.",
    "Forgive me Player, but my own faith has wavered over the centuries. Meeting a fellow disciple has lost its meaning somewhat.",
    "Because I lost her. My Glarial.",
    "Yes, it allowed me the release from my grief, which was unbearable, but with hope enough that she might yet return to me. Please...I know you want to ask more, but even the centuries have barely dulled the agonising pain of her loss.",
    "I have spent years embroiled in the politics and machinations of aristocracy, I have a very well maintained mask.",
    "And in time I will answer them, but for now I sense an urgency in your companion. When the city is safe and Seren restored, we will have plenty of time for answers.",
    "Ha ha ha. Yes young Cadarn, I know where it is. I have kept it close to me for the last few centuries. If you are reforging Seren, I would be a part of that.",
    "Very well. I trust that you know the Song of Restoration?",
    "Ah, that may be a problem. I only remember some of it. It was a song that Seren gave the lords before she shattered herself. A song so that in a moment of direst need, if all hope for the elves was lost, that we could sing her back whole again. I was taught some of the song...but there's still so much missing.",
    "But, that is a bridge we will cross when we come to it. For now I promised you a shard... I hid the shard close to me, with a form that I would defend at all costs.",
    "Forgive me my love.",
    "And now she is gone forever...take the shard. I will return to Prifddinas.",
    "I hid the shard close to me, with a form that I would defend at all costs. Take the shard to the tower, I will meet you there. You should return that shard to the Tower of Voices, I'll meet you there.",
    "Ah, you have returned. No doubt you are overburdened with questions for me, but for now you must focus on gathering those shards. When all this is over, then we shall talk properly.",
    "The Dark Lord has been a dangerous thorn in the side of Prifddinas for far too long. If the choice were mine, I would see it destroyed and not have Seren tainted with its evil.",
    "Tarddiad? Are you serious?",
    "And we are to believe Iorwerth deceptions?",
    "You need to gather tarddian crystals Player. We need a good supply of them before Seren can be reforged.",
    "You have crystals. Good. It is time.",
    "Marvellous. You have done well Player, come, let us bring an end to all of this. Let us unite as one council. One voice, from many. Seren. Hear this song and be restored!",
    "Be careful, I sense that world is fraught with danger. You should be prepared.",
    "When you are ready, either return here or head through the world gate[sic].",
    "Seren... she was so... empty. A body, but no soul to occupy it.",
    "What are you saying? Are you abandoning us again?",
    "Player you are indeed the champion of Prifddinas and as such are worthy of recognition.",
    "Here, as a reward for all you have done, let me teach you magic known only to a few elves.",
    "It is not the magic to summon rivers or move mountains, but I hope it will serve you well.",
    "There, may these spells and prayers serve you well.",
    "Greetings Player, it is good to see you again. I suppose you have many questions.",
    "What would you like to know?",
    "It was a society born in haste, from Seren's destruction. Glarial and I took the throne after Seren's shattering. The elves needed a ruler and the two of us were the most experienced. To alleviate tensions between the clans, we elevated several elves from various clans to roles as advisors and adminstrators. From these would come the first of the elven aristocracy. As is common with positions of power, many let their status get to to their heads and acted with prejudice to those of 'lower class'.[sic] Something that gave the Iorwerth a platform on which to seed their dissent. It is easy to point those with little at those with great wealth and say 'this is why you suffer'.[sic] In many ways the uprising was inevitable. Iorwerth merely spearheaded it.",
    "Yes. I know spells that can move mountains, or summon the trees to fight as an army. But this is not magic I will teach.",
    "Because such force could disrupt the balance of power in the world. It could create tyrants and topple kingdoms. It is magic intended to make the world a better place, but the world is not ready for such change yet. Perhaps in time.",
    "I will remain here, in Prifddinas. Perhaps a time will come again where I can be useful.",
    "She was radiant, both in beauty and in temperament. I loved her from the moment I saw her. A terrible cliché ... perhaps fitting for a king. We courted for a full decade. I showed her parts of the world that no other elf had been. I taught her ancient magic and she was a quick study. I thought that we might change the world together. But then I left on that foolish crusade. I wanted to see the world and found a new glorious city. My arrogance and hubris gave the Iorwerth their opening and from there I lost everything. ... I would burn the world to ash for just a few more moments with her ... Ask me something else Player. Don't make me dwell on what could have been.",
    "Is there anything that you do not know?",
    "Our civilisation fell into chaos. Understand that we were utterly devoted to Seren. Our entire culture revolved around her words of wisdom. Without her guidance there was panic. The streets were filled with terrified people unsure of what to do. My beloved Glarial, always the voice of reason, encouraged me to take control of the situation. The Cadarn warriors helped to police the city, establishing order and Glarial and I spoke to the people. It was not a swift thing, of course, but between us we brought order to chaos. From then we worked on what was needed and we tried to figure out what we should do next. Without Seren's words to guide us we were lost. We turned to each problem one at a time, never seeing the big picture. It was Glarial who saw the wider vision and helped us to pull our society back together. For a while we returned to peace. But our city was so magnificent, our culture so strong, that we could not limit ourselves to a single region. It was then that we looked to expand the elven lands.",
    "We had just done the impossible. We rebuilt our civilisation after Seren had shattered herself. As a nation we felt unstoppable and so we decided to expand our civilisation beyond the single city. We spread our civilisation out across Kandarin and even into Misthalin. Such was our confidence. We forged lasting alliances with several races. Our old friends the gnomes were first. It had been so long since we had seen each other that we held a great feast lasting a full week. With the gnomes[sic] help we forged treaties with the human tribes dotted around the region. They were wary of us, but peace is preferable to war and so we flourished. The goblins and ogres were less willing to agree to peace. They were so locked into their own civil wars. Still, they were no match for us, so we ignored them. We prospered for a long time. I was genuinely proud of our accomplishments ... then Tirannwn fell silent.",
    "It began with silence. Tirannwn, the heart of our empire, could not be reached. I sent messengers, both elven and animal. I summoned powerful scrying scrolls to see what was happening ... but there was nothing but darkness. We of course knew that something was afoot and I sent five of my best scouts to investigate. Only one returned, but he was able to tell me of Iorwerth's treachery. Prifddinas had fallen. The Iorwerth had seized absolute control, by some terrible power. Glarial and I knew we could not let this stand. So I rallied our warriors and mages behind us and left for Prifddinas. Though it broke my heart to leave her behind. We were so arrogant. We thought our knowledge of magic might be enough, but with the clans behind us how could we be stopped? Had we known that Iorwerth would be wielding the power of Seren, twisted as it was in the form of the Dark Lord, we might have been less confident. Shadows assailed us and darkness blinded our archers. The Lord Iorwerth laughed as our unprepared forces were torn apart. But our will could not be broken. We withdrew and we lay siege to the city. A long protracted war. Somehow the walls withstood my magic, as if some dark force just drained the magic right out of my spells as they approached. We fought and we fought ... but in the end we knew that we had failed. The Iorwerth had won. We withdrew back to the east ... but found only ruin. The Iorwerth, not only able to hold off a five year siege, had destroyed everything else we had built. They had rallied the goblins and ogres against our defenceless cities. They had bribed weak-willed human armies to turn on us. And amongst all of that sadness I lost all hope and all will to fight ... because she was gone.",
    "At first I went there to end it all. My grief was so strong that I could not bear it. But I still had that most painful of afflictions ... I still had hope. Hope that one day, Glarial and I might be reunited. So, I hid the shard, that was mine to ward, in a statue of my beloved and then I transformed. It is an ancient spell, intended to imprison my enemies, but I was my own worst enemy. Once the spell was complete I was just crystal and then I waited.",
    "It is good to have her back and I think she is making the right choice distancing ourselves from her. We have shown that we are capable of greatness even without her.",
    "They have achieved much. The new society is as strong as we ever were. Even the Iorwerth seem to have redeemed themselves.",
    "No. No. My time as king is over. I shall advise and I shall serve, but I shall no longer rule."
  ],
  "Seren": [
    "...Lost...I feel them stirring...My people need me...help me...Player...",
    "Tarddiad...my beautiful Tarddiad. I should never have left you. You were the perfect world, not Gielinor. Here my elves would have been happy...I would have been happy. Oh Guthix, why did you ever have to go to that foolish world?",
    "I am more than just crystal. More than my shards and my shell. I was born to be the light that balanced the darkness. His opposite and his companion. Player, you must take me to the world that gave me life. Return me to her so that she may restore me. Please...hurry, I feel the city you have all built. It shudders and rages to restore me. I cannot stop it. Hurry, before it is too late.",
    "Tarddiad! What has become of you?",
    "Integrity. This is the virtue upon which all others stand. To maintain one's courage, one's principles, despite all opposition and influence. This is a foundation stronger than any stone.",
    "Harmony. This is the virtue that links all others together. We are all bound together by the Anima Mundi, the energy that flows between all creation. From the greatest gods to the smallest insects, all are linked together. Worlds are the heart in which the Anima rests. When we are in harmony with the world around us, we strengthen the Anima and we strengthen ourselves and each other.",
    "Prudence. This is the virtue that protects the others. Too often life presents us with a curse disguised as a gift. Be cautious and be prepared for all things. There are snakes in the grass, be watchful of their movement.",
    "Wisdom. This is the virtue that allows all other virtues to work. It is not enough to know or have something, but to be aware of how and when to use it. Gold is worthless if simply hoarded. It is only when it is spent that it can enact change. Be mindful of the changes you would make to the world and know how to make them happen.",
    "I am returned.",
    "Player, I am whole again. Thank you. Even the dark is rejoined with me, as it should be. I was wrong to hide from it before. We must each accept that there is darkness within us. We must stand up to it, acknowledge it and control it, rather than flee from it.",
    "Player, I thank you for keeping the darkness away from me. It was a corrupting influence, that tainted my choices with fear and even a little prejudice. But now that part of me is gone and I can focus on ... er ... the ... erm ... what's that word?",
    "Yes, that's the word. The future. I can put the darkness of my past behind me and focus on the future!",
    "Ah ... but speaking of darkness, I sense my brother's lingering presence. He was here, wasn't he? Zaros.",
    "He did, did he? What angle are you working now brother?",
    "Oh no, Player. I can feel the lie upon you, it falls from your lips like poison. I do not know why you feel the need to protect his involvement from me. But you should be careful. My brother, Zaros ... 'The Empty Lord' ... is not to be trusted.",
    "Why these lies Player? You know full well who Zaros is. For some reason, my brother has involved himself in your life. Like orchestrating his place there. Has he really done anything to inspire such loyalty to you now?",
    "Know this of my brother Player; he is loyal only to himself. He would let entire worlds burn if it would get him but one step closer to his ultimate goal.",
    "Here... it is better that I show you.",
    "I take you to Freneskae, long long ago. Before even the mahjarrat walked the world.",
    "I felt your frustration brother. Why did you come here?",
    "I don't understand, what do you mean?",
    "Don't be so cruel Zaros, she's our mother...",
    "In her own way she loves us ...",
    "You know it's not my choice. If I could end my power, I would.",
    "Brother ... where is this going?",
    "To what end? We have purpose here?",
    "What are you talking about?",
    "If they are the elders, then who are the younger gods?",
    "You're scaring me a little now brother. We were not created for such feats...",
    "Careful brother, you'll wake her ...",
    "No. Mah does not understand the harm she inflicts, but we would. I will not compound the problem the Elder gods represent, by helping create one with an ego.",
    "You misunderstand me brother. I cannot stand with you, but I will stand against you. As long as I live, I will stop you from becoming an Elder god.",
    "Or become its end.",
    "You see Player, all Zaros cares about is power. He would see entire species destroyed to obtain it. Come. Freneskae is no place for civilised conversation. Join me in the Tower of Voices, so that I may address my people.",
    "My how you have changed. My beloved elves. Prifddinas is truly a wonder to behold.",
    "There are no words because it is an honour that I do not deserve.",
    "I know that problem well my child. I was broken for too long. Thoughts float past me, just out of grasp. There are words that I would use, but they flitter past like leaves on the wind.",
    "I have been the source of so much suffering for you, my people. Part of me was the Dark Lord that tormented you so.",
    "It was my meddling that cursed you all with your dependancy upon me.",
    "All I have done, I have done for you. To try and be the deity you deserve ... but in that endevour[sic] I have failed.",
    "I am no longer the goddess I once was. I am no longer the goddess you deserve.",
    "No. But neither shall I hold myself as your goddess. I shall withdraw here, to the tower, where you can find me but where I shall be ... apart from you.",
    "Here my song will still affect the city. I owe you that much. But I shall be your servant, not you my worshippers.",
    "Guthix was right, Gielinor is better off without its gods. I will not leave you, not again, but I will not lead you.",
    "Let me, here and now, recognise this council as the true leadership of the elven people.",
    "And let me recognise Player here, as a champion of Prifddinas.",
    "Greetings, World Guardian.",
    "I have some enchanted lamps for you, when you have some inventory space free.",
    "Perhaps. But Guthix does not bestow his trust lightly and so the title must be earned as well. Humility is a worthy virtue. But we should be willing to embrace our achievements rather than obfuscate them out of some false sense of modesty. For good or ill, you are the World Guardian now. To some that makes you a beacon of hope and to others a threat to destroy.",
    "Now now, that would be telling wouldn't it Player?",
    "What would you know?",
    "A difficult question to answer. Take a knife and cut off your toes. Then cut off your fingers. Then your ears and your nose. Your lips, then gouge out your eyes.",
    "Of course not. But you asked what it was like. It was like ripping myself apart. Cutting off my limbs and tearing off my skin. It was a horrible experience. But a neccesary[sic] one. As the shards I was only passingly aware of the world around me. Time was meaningless and I had little grasp on events around me. Given all that has happened, it was probably for the best.",
    "It was a terrifying experience. I was floating away from myself. Thoughts drifted out of reach, memories all but lost. I was dimly aware of the world around me. Events passed by like half forgotten dreams. I do not recommend it.",
    "Ah, very well, let us dig up painful memories once more.",
    "She was a part of me that I allowed to live its own life. It is not a concept I can explain easily. She was me and yet she was not me. Writers talk of characters living their own lives, but lives created from the imagination and experiences of the author. I suppose that best describes what she was. When I shattered myself, she took on the burden of my darker aspects. She became the Dark Lord out of a noble sacrifice. She would be corrupted, so that the rest of my[sic] would remain free.",
    "I remember very little of Haluned. I remember creating her, taking a piece from my chest and giving it a body of its own.",
    "From nothing? No. It would be better to say that I found a way to exist in two places at once. For a while both Haluned and I was[sic] Seren.",
    "Yes. But only dimly. Like it was happening out of the corner of my eye. I could not stop it, please believe me on that.",
    "I ... I cannot remember.",
    "Guilty. Ashamed. Are these the words you want to hear? That a god can admit they made mistakes? Had I know what she would become ... how the Iorwerth would have used her ... I would have done it differently. But then we are all saints when looking through hindsight.",
    "Nothing. That part of me is gone. I am sorry for the danger it presented, but that is all I can feel.",
    "You pass judgement so quickly. Have I not already atoned? To save my people I tore myself to pieces and scattered myself in the wind. Yes the Dark Lord was a travesty, an abomination, but it was sealed away. It was the Iorwerth and the greed of mortal men that empowered that creature, not I. But to ensure that there will not be another Dark Lord, I will pull myself away from the elves. In time they will no longer need my presence and I can leave them, to be forgotten.",
    "I shall do nothing. That part of me has already been destroyed, you saw to that. I shall use it as an example to inspire me to not make such mistakes again.",
    "What would you like to know?",
    "She thinks herself your friend. Is that not enough?",
    "No, indeed. In truth she is simply Eluned. She was created from a memory inside a shard of me. A shard that sang itself into the elven woman you know well. From then her life has been her own.",
    "She has decided to visit Tarddiad and see what she can do for the elves there. It is my hope that she can help to correct my cruel mistake. I should never have abandoned them.",
    "And I fear my elves would be all the better for it. This world has been the cause of so much pain. I should have stayed with my elves on Tarddiad.",
    "Your friend, or at least she thought so. That is how I would remember her, were I you. Before I shattered myself, just after I created Haluned, I created another. Eluned. Whereas Haluned was intended to be a permanent extension of myself, Eluned was my way of seeing life through the eyes of the elves, rather than above them. She showed me the wonder of my people in a way I never could have imagined. Then she returned to me. The Eluned you remember is as unique a creation as the Dark Lord. A fragment of myself with the memory of a person. A single crystal that remembered how to sing itself into being. It became Eluned. Until I started to reform, she had no idea what she was. She was just an elf, as far as she knew.",
    "No. The Eluned you know is gone. I could no more seperate[sic] her from myself then[sic] you could separate rainwater from a river. I could create a new Eluned, who looked and acted like the old one, but it would not be her. All I can do is strive to live up to her sacrifice. To give it meaning.",
    "That is a strange question Player. She is a part of me now, so I cannot feel her loss. I lament the loss of her potential, what she could have been could have been beautiful. But now she is a part of me. And a piece I welcome.",
    "I would rather not discuss my brother, but if we must. What do you want to know?",
    "I felt his influence earlier, so yes, I know he's back. My brother and I are made of hardier stuff than the lesser gods, so I was not convinced at his earlier demise. Perhaps 'death' has taught him a little humility. Though I doubt it.",
    "He is my brother. The darkness to my light. My polar opposite and the only person ... living ... that can truly understand me. It's complicated really. We were both forged from the dreams of a half-formed elder god. We rather defy the traditional concepts of family that you might be used to.",
    "Zaros always has an agenda. He must always be in control. I believe that everyone should govern their own actions. So, no, I suppose we are not on the best of terms.",
    "Only you can make that choice Player. But ask yourself, what is he after? Would he be approaching you if you weren't the World Guardian? Zaros always has an agenda. Think carefully about where you might sit within it.",
    "No ... please. To me it was like he died yesterday. It's still too painful to discuss.",
    "That word is too small to describe what we had ... I left Tarddiad for him ... I shattered myself rather than bare his disappointment in me.",
    "Love is a mortal word, with mortal restrictions. We were more.",
    "What would you like to know?",
    "They are the driving force of creation. The origins of all the worlds and the life that dwells amongst them. They feed on the anima mundi of a world and become reborn, cycle after cycle. All the younger gods owe their power to these beings. Even Zaros and myself are born from Mah's restless sleep. To attempt to define them further is to fundamentally fail to understand them and to overthink your position in creation. It would be like describing a dragon to an amoeba. So utterly beyond its understanding.",
    "Come now, you know this answer as well as I do.",
    "Yes. Beneath the very ground we stand on, in the heart of this world, sleep the living engines of creation. It is, in part, why this world is so interesting to the younger gods and the other races. Gielinor is a perfect world. A perfect magical crucible of limitless potential. This is, of course, their doing.",
    "In the past I would have said they couldn't, but now ... Guthix felt that if he could carefully control the flow of Anima Mundi, he could keep the elder gods docile and the world thriving. It wasn't until the younger gods interfered with his plans that this changed. I have no answer now, but perhaps I can find one. Come see me when you learn more about the elder gods, perhaps together we can find a solution.",
    "Oh, of that I have little doubt. But Zaros always has a plan. A plan to see just how much power he can gather. How much control he can wield over the world. My brother cannot be trusted, remember that.",
    "I'm afraid I can be of little help there. I have precious little knowledge of the Dragonkin. My brother, on the other hand, was studying them quite carefully.",
    "You forget, my consciousness has been shattered and spread apart from itself. The Armadyl I remember is a naive idealist who is easily led astray by the machinations of older gods. But time is the ultimate catalyst for change and the Armadyl of today is likely quite different.",
    "Perhaps. But not today. I have too much history to catch up on, before I make any decisions about the future.",
    "A dead god and one who's[sic] death I do not mourn. He was a tyrant and a monster, who only wished to see everything bloodied and burnt. He would have burned countless worlds to ash in his pursuit of mindless 'glory'.",
    "There's survival and then there is bloodthirsty conquest. Bandos cared more for the latter. His philosophy was an excuse for wanton violence, nothing more.",
    "Saradomin means well. Even back in the time of the god wars, he genuinely believed what he was doing what was best for Gielinor. Misguided, perhaps. Arrogant, certainly. But there is a genuine sense of duty to his actions. That said, his zeal and inability to recognise the wisdom of others, has meant that he has fallen more and more from his path. He can be redeemed, I believe, but that is more your choice than mine.",
    "He who tried to kill my brother. I have no positive words for him.",
    "I distrust, despise and sometimes even hate my brother Zaros. But I also love him. Whatever comes between us, whatever trials we face, he is the only brother I will ever have. So forgive me if I dislike someone trying to take him from me.",
    "Perhaps. But there is also imagination and community. When sharing with others we can learn to see the world differently. Look at all my elves accomplished. It was undone for a time because of chaos. It was harmony that restored them.",
    "I will not discuss the man who murdered my ... my Guthix. I have been a pacifist. Refusing to turn my power to destruction ... But if I meet him ... I will remind him how light can burn.",
    "Ah yes. The god of cabbage. I must say I'm pleased he's still around. The younger gods are so full of fury, duty and a stoic seriousness, it is nice to see one who lives in a world of whimsey.",
    "Yes, I suppose he does. But remember that he sees the world through the eyes of a cabbage. Plants have different priorities to the rest of us. In his own way he tends to the anima mundi, helping to keep it healthy and bountiful.",
    "In his own, insane, little way. It is why we remain friends. I have memories of him chatting away to the pieces of me across the world. Of course he didn't understand that I was incomplete and took my silence to be deep rapture in his bizarre monologue. There are only so many different ways to hear about how delicious a cabbage is before you start going mad from boredom.",
    "I shall remain here, in case my elves need me. Whilst I am here I shall reflect on solutions to the elder god problem. With your help, together we might be able to stop them.",
    "Now, I shall withdraw from the elves. It is time that I found a way to remove their dependance on me.",
    "I shall remain here, in this tower, out of the way and reflect on the choices that led to this situation.",
    "Since the danger of the elder gods is here and ever present, I shall consider them too.",
    "You trivialise it quite well there.",
    "Thought is useless without action, this is true, but action without thought can be a dangerous thing.",
    "I have made that mistake before, I shall not do so again.",
    "So like mortals, dwelling on what was rather than focus on what is to come. Very well, what do you want to know?",
    "For the most part I stayed well away from it. I knew that Zamorak had not truly destroyed Zaros, so I curtailed my wrath. I had promised Guthix a peaceful world, after all. As the fighting grew more widespread, I sent a few scouts to investigate. Some were discovered and fought to survive. They did not. Some of my people screamed for vengeance, but I forbade it. A few went anyway, but their impact on the war was negligible.",
    "What would you like to know?",
    "Stunning. A world of trees and beautiful crystalline structures. The elves lived in harmony with it, growing their houses from seeds. They lived as part of the ecosystem, rather than exploiting it. I often think that I should never have left it.",
    "My greatest mistake. The lifespan of my elves was so short. A few decades, barely a century, and then they were gone. Understand, World Guardian, that to me these were my children. Each one that died was a grief I could barely contain. It was out of love for them that I tried to share with them some of my longevity. My immortality. It worked ... but at a price. They were bound to me. Unable to leave my presence without growing sick and dying. It was why I had to shatter myself, rather than leave them. I am not proud of this mistake, Player. If I could undo it, I would.",
    "When I first discovered the nine clans on Tarddiad, I was enamoured with their society. Everyone took their place within the clan and worked for the betterment of the elven people. The Cadarn were the scouts and mages who scoured the many forests for potential danger. The Iorwerth were great warriors who fought the dangerous beasts that hid amongst the trees. The Meilyr and Crwys both worked in harmony with nature to find medicine and grow food. The Ithell and Trahaearn worked tirelessly to create houses, tools and anything else that was needed. And the Hefin and Amlodd focused on more spiritual pursuits. Seeking ways of enlightenment for their people.",
    "Yes. There was also the Cywir. A clan dedicated to elven traditions. They kept the lore of the old people and they maintained the shrines to the elven spirits. They ... would not come with me to Gielinor.",
    "Mah was, in many ways, both my mother and my child. She dreamed me into existence so that Zaros would not leave her. I believe she felt that a companion, an equal, would keep Zaros happy. But we were the creation of a child. One who could not understand the complexity of sentient emotion. In me she created an ... ability. It would impose upon others a twisted sense of what she understood as love. Zaros was compelled to be in love with me, just as his nature compelled loyalty in me. But it was a hollow feeling and to each of us it felt like chains holding us against our will. Love is as deadly an emotion as it is a wonderous one. Just as it can bring people together, it can lead to unbearable pain and a complete loss of self. I do not blame him for wanting to escape that. But he wanted more than to escape, he wanted to ascend. Zaros tries to control everything around him. He tried to control me, even as I unconciously[sic] controlled him. Power as great as he wishes to attain, should not go to someone like that."
  ],
  "Morvran": [
    "What do you want?",
    "Who told you that? I don't know what you're talking about...",
    "Oh, so they know? Keeping tabs on me again... Fine. I'll take you down there.",
    "The staircase to the Grand Library is through the door on the other side of this walkway. Watch your step.",
    "You've made your decision, you should return to the Tower of Voices."
  ],
  "Angof": [
    "Sheathe your weapons human, let us try words over warfare.",
    "I don't wish to fight you human, let us try words over warfare.",
    "A proper civil greeting, I too am pleased to meet you human.",
    "Evidently.",
    "Less than polite, yes, I must apologise on their behalf. They are...not themselves.",
    "A dissapointing[sic] stance for our first diplomatic introduction, but I understand. May I at least know your name?",
    "I am Angof. I will speak for my people.",
    "Hello again Player.",
    "What would you know?",
    "Why exactly?",
    "And you are entitled to them, of course. But I know that infused shards can only be obtained from my brethren.",
    "Rebuilding? She has broken?",
    "Of course she did... At least she cares about some of us. However, obtaining the crystals will not be easy. They can only be obtained from my brethren.",
    "And they will not give them up willingly, without a fight.",
    "Good to hear my friend.",
    "But not by me. They aren't monsters Player they are people, suffering.",
    "Perhaps I can offer an alternative. My people need crystal fragments and you need them whole. Fragments can be found across Tarddiad. In trees, rocks, even floating in the rivers. For every 3 of these you bring me, I will give you complete crystal.",
    "Yes and no. In the long term I believe I can ween my people off the crystals, but it needs to be a gradual process. The hold is too strong.",
    "I am glad. All but the most violent of my brothers and sisters are now in hiding. Tread carefully, but you should be able to harvest the fragments without fear. Gather crystal fragments from the resources across Tarddiad and I will exchange them for complete crystals.",
    "No, the only place you'll find complete crystals is from my brethren... Ah. I see. You realise that my people won't give up without a fight.",
    "Then this conversation is over. So be it. I have called to my brothers and sisters, they will not hide from you. If you change your mind come see me, I will try and calm them.",
    "It appears you have insufficient fragments to trade.",
    "I will give you <number> complete crystals for <number> crystal fragments.",
    "For my kind, they stave off the terrible need, if only for a while. They allow us a brief moment of lucidity before swallowing us back.",
    "It is. But it's either that or death.",
    "What would you like to know?",
    "You ask that as though there were some sort of hierarchy here. Truth be told, I am merely the most coherent currently. Officially I serve no role. In time I too will forget myself and become...as the others. Perhaps another will become cognisant enough to take my place, or perhaps not.",
    "Haha once perhaps. But our civilisation, such that it is, no longer has such things.",
    "Ha ha ha. You could rebuilt[sic] houses. Tend the sick, perhaps. But Tarddiathen[sic] civilisation is long gone. What would you remake us into? A blissful simulacrum of your own world perhaps? That is no longer who we are. The elves of Tarddiad are dead and forgotten. Your kind made sure of that.",
    "I know. I am sorry. But the bridge between our people was burned long ago. It will take a long time to repair our kinship.",
    "A broad question. I was born here, on Tarddiad, in the village of Cysur. I was a proud descendant of Ceidwad herself. Quite the mantle to carry.",
    "She did a lot more than that, but yes. She was a spiritual leader for our people, even before Seren's arrival she was our conscience. It is a source of great personal pride to know that my blood can be traced back to hers.",
    "But even that impressive lineage did not stop me from getting the Sickness. I took the crystal before I even knew what it was. And that, for all intents and purposes, is my history. Every day since has been searching for those crystal shards. It is not an existence I would recommend. I confess greater coherence than my brethren, so I took it upon myself to watch out for them. Such as offering an alternative to their slaughter by some hapless adventurer. No offence.",
    "It's strange. I should hate her for abandoning us. But I don't. All I feel is a profound sadness that she is not with me. Odd, isn't it?",
    "I am angered by her. Furious at her abandonment. I loathe her, but I also love her, as do all of her slaves.[sic]",
    "What would you like to know?",
    "What a question. They are my family, my friends, the people I love. But of course you don't mean it like that. Once we were elves. Tall, graceful, proud and noble. But we loved a god and she abandoned us. After that, we could never be complete. Our histories speak of the countless deaths that followed the Great Exodus. Death from loneliness, from an impossible aching yearning. I'll wager that you have felt the pain of heartbreak at least once in your life. Now imagine that increased by a thousand. It was agony; torture. We had to find a solution and we did...to a degree. The native crystals to Tarddiad retained traces or[sic] her resonance. The tiniest sliver of her essence. Not enough by themselves...but we were adaptable. Using magic and a variation on the Song of Creation, we embedded these crystals within ourselves. It helped, at first. But we simply replaced one need for another and over time we became more and more dependant on the crystals. Over time the crystals changed us. We became...this. The crystals that we embedded within ourselves, began to twist us. Flesh and bone became malleable, like clay. At first it was a blessing. We could reshape and reforge ourselves. We became our weapons. Our artisans no longer needed to create and maintain tools to craft. Our form was pliable and limited only by our creativity. It could have been a golden age for my people.",
    "How do I explain? It is like breaking every bone in your body at once. Twisting every muscle. And it is like relaxing completely in warm water. Like lying down after a hard day's work. It is an agony like no other and an indescribable serenity.",
    "On the whole, good. But it is not without it's[sic] cost.",
    "But we were fools to believe that there would be no cost.",
    "The crystals created within us a new need, a new hunger. An insatiable craving for more crystals. But it's a vicious cycle, the more we acquire, the more we crave. Soon there's nothing left but the aching need for crystal shards. You see now why most of my brethren are mad. Consumed utterly by their hunger for the crystals.",
    "Ha ha. Oh I crave the crystals. You have no idea how badly I crave them. Each minute is a struggle. Each thought is laced with desperate desire for more of them. But I resist. I remember what I...what we... once were and I use that knowledge to hold on. But I am slipping and it just takes one moment of weakness to fall forever.",
    "No. *Sigh* Not yet. There is a lot of resentment that remains with my people regarding the elves of Gielinor. There are some who would rather die than accept your aid. In time we may be able to change this. But it will be a long process. I hope you understand.",
    "Simultaneously they are our salvation and our doom. They were natural growths on Tarddiad. We used them in our tools and architecture. But it wasn't until Seren came that we saw their true potential. Seren was a beautiful goddess of crystal and these crystals resonated with her. Her songs, and ours, caused these crystals to absorb the tiniest sliver of her nature. Her essence, if you will. Not enough to cause her harm, or even for her to notice, but just enough to be special. They contain just enough essence to hold back the Sickness as well. Though not enough to starve it off completely. But you can clearly see the profound side effects that they have on us physically, though the mental effect is far worse.",
    "Perhaps Player, perhaps. The crystals that we crave can also be our salvation. If I can slowly ween them off the crystals, then they might become as cognisant as I. Perhaps then, helping one another, we might help each other to find an alternative to these crystals.",
    "We would look like monsters to them and what could they do but watch us suffer?",
    "Likewise. I am sorry that you could not see us at our best. We are not what we once were.",
    "Dead. I know. I understand.",
    "No. I'm sorry, but I cannot. Your kind abandoned us and turned your backs on us entirely. Your kind had every opportunity to return and check on us. But you chose not to.",
    "And before it was lost? After? Even now you come here not to aid your own kind, but to rebuild the goddess that did this to us. I bear you no ill will, specifically, Eluned. You at least have made the journey here. But I cannot forgive the elves of Gielinor for abandoning us.",
    "Yes, that would help. I could ration them and help my brethren get back on their feet.",
    "Honestly I could not say. But I have resisted this long, with a clear goal in mind I believe I can prevail.",
    "What would you know?",
    "When Seren left us and took the majority of our people with her, what remained was barely enough to maintain a civilisation. We drew inwards, becoming a number of small communities rather than the great cities of old. But without her light to guide us and to protect us, we became sick. Then we found the crystals. We began to care less about maintaining our society and more and more focused on simply finding more crystals. Soon there weren't even villages, we became wanderers. Nomads. Searching for the next source of crystals.",
    "I have salvaged what I could. But our ancient temples are overgrown and full of monsters and our cities are now forests. I believe it may once be reclaimed, but it will not be for decades yet.",
    "Yes I heard your Gielinor did not have them. But to us they are as natural as the trees and rocks. They have always been part of my world.",
    "Do you know, I have no idea. I suppose it just stopped being relevant. I'm not even sure we had religion before her. We worked with the land, venerating what was, rather than the intangible.",
    "Farewell human. *Sings to herself*",
    "I fail to see how, it's an ancient elven song. Only the crystals here really remember it."
  ],
  "Zaros": [
    "Go. Away.",
    "I saved Seren, who you exposed to danger by bringing her here.",
    "Are you too blind to see it? Her body is reforged.",
    "Her body is not the cause. Her soul too was shattered in her sundering and now needs to be reforged as well.",
    "That too can be accomplished in the Elder Halls. I will show you how and then depart.",
    "Seren and I are the opposite poles of light and dark. And like the opposing poles of a magnet we are drawn to one another. I yearn for her even as she is now. If she was restored in my presence then neither of us would be able to control ourselves. That is why you must complete her soul. And you must never tell her I was involved in this.",
    "Very well, I will take you to the Elder Halls now.",
    "See the light that emanates from her, as revealed by the power of the elder halls[sic]. That energy must be passed into the fractured shards. Redirect the flow of light into those shards. When enough energy has been cleansed in this way, she will be restored. I will leave you to this task now. Tell her ... no, tell her nothing of this.",
    "Look at her Seren. Such a waste...",
    "Power. Unbridled, unrestrained, limitless potential ... all trapped within this malformed and pathetic husk.",
    "She is our jailor and our tormentor. She is more of a child than a mother, we are her carers not her children.",
    "Love. A pointless tether, nothing more. Love is her way of chaining us Seren. You know that better than most.",
    "I know, dear sister, I understand like no one else ever could. It is not your choice, but hers. She squanders her power on what? Pets? Toys? We could be so much more. We deserve to be so much more!",
    "My time here is done. Mah will chain me no longer. There are worlds other than this and I would explore them.",
    "Nursemaid to this cosmic mistake? Did you know there were others, like her, before her? Even they abandoned her.",
    "There is a chamber in the heart of this world. Within it lie the remnants of others, like Mah ... but more so. It was easy enough to find the memories, when you look carefully enough. Six of them, five of form and one of ... something else. The Elder Gods.",
    "Who else but us sister? The power we wield, if we could just create life, we could fill all of creation with such wonder!",
    "AND WHY NOT?",
    "Forgive me. But why should we be imprisoned by the half-baked ideas of a child that dreams itself a god? I see a different way. I will find these Elder gods and I will claim my birthright. I will become as they and then I will make this universe ... perfect. Will you come with me, dear sister?",
    "Then I will do this alone.",
    "Sister ... do not do this ... we could create a perfect universe.",
    "That is a difficult question to answer. In one sense we are brother and sister. And yet we are as alien to one another as can be. She represents light and I, darkness. Both necessary elements of a stable universe. Mah made me first and within me she gave the power of loyalty. So that all who met me would follow me. But it wasn't enough. I could command her feeble muspah, but I was still nothing but a toy to her. When I tried to leave she dreamed Seren into existence. In her Mah gave the power to inspire love, at least how she understood it. A terrible chain of heartache that wrapped around all who encountered Seren. Seren inspired an absolute sense of love, beyond romantic, beyond familial. Addictive and unbearable. For a time Mah's plan worked and I stayed at Seren's side. But I knew the feelings I felt for her were false. Seren, I know, felt the same. These forced feelings fostered great resentment between us. A resentment that soon became stronger than the loyalty or love we engendered and so I broke free. I left Mah and Seren has never forgiven me for it.",
    "No. I am still the best hope for Gielinor and Seren will see that in time.",
    "Yes. Does that surprise you? Whatever we are, however much we squabble, we are still the closest to family each of us will ever possess. Seeing her whole again means there is hope that we may yet reconcile."
  ],
  "Congratulations! You have completed": [
    "'The Light Within' - Complete this quest"
  ],
  "Azzanadra": [
    "Yes. My lord has informed me of her return.",
    "I am pleased to see that you had the sense to restore Seren fully. I can think of few things as dangerous as a god of her power driven mad by incompleteness.",
    "I am disappointed that you did not fully restore her. Eluned may have been your friend, but she was a part of Seren also. She should have returned to Seren. Now Seren is incomplete and who knows what complications that might have.",
    "My lord thinks fondly of her, though I know the two did not see eye to eye. I only hope she isn't blinded by petty hatred still."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:The_Light_Within?oldid=36197026’"
  ]
}