{
  "This page contains dialogue related to Recipe for Disaster": [
    "Freeing Sir Amik Varze.The content below is copied verbatim from RuneScape and thus copyrighted by Jagex."
  ],
  "Gypsy Aris": [
    "To protect this noble knight from the magic of the culinaromancer, you will have to give him a creme brulee.",
    "Not just any creme brulee mind you, but a creme brulee supreme!",
    "Are you going to constantly ask me questions?",
    "I am a gypsy, not a cook, and again I would suggest you speak to the cook next door who will be much more helpful on such culinary matters.",
    "Although I happen to know that one of the ingredients is the egg of the evil chicken.",
    "I believe the wise old man in Draynor has studied the Evil Chicken.",
    "I would suggest you speak to him to get you on the right track. And tell him Bubbykins says hi.",
    "That is not important right now. Go! Protect Sir Amik from the magic that threatens his life, my spell will only hold so long!",
    "Good work adventurer, I've teleported them away to safety! You only have [number] council members left to protect!"
  ],
  "Player": [
    "Well that doesn't sound too hard. What's so supreme about a creme brulee supreme?",
    "The evil chicken? Great. He only ever seems to show up when I don't want him too.",
    "Er... Bubbykins?",
    "Just give me 5 minutes and I'll be back!",
    "That white knight... Sir Amik Varze... I can't quite remember how I saved him...",
    "But it was something to do with creme brulee supreme...",
    "Ah, you did, did you? I don't suppose you could refresh my memory about that?",
    "Cornflour? How do I... er, how DID I make that then?",
    "Really? Weird. Okay, what did I do then?",
    "Sounds easy enough so far. Er, I mean it was easy enough up to that point.",
    "I definitely said that I had to kill some black dragons to do that?",
    "Oh yeah... I remember now...",
    "Could you tell me about the Evil Chicken, please?",
    "Right, so if you were looking for the chicken where would you go?",
    "Yes, please.",
    "Thanks, maybe some other time.",
    "What happened? I rubbed that coin and everything went black!",
    "I took it from the dead body of a black dragon.",
    "I didn't realise what it would do if I rubbed it.",
    "Who, or what, are you anyway?",
    "I'm afraid I don't understand.",
    "So I can ask one thing of you?",
    "Please flambe this creme brulee for me.",
    "Go ahead, I'll be fine.",
    "What gloves do you have in mind?",
    "I'll go fetch them then. [If the above option is chosen]",
    "Could I just keep your token for when I really need it, please?",
    "Can I wish for some xp?",
    "I'd like a horse, please."
  ],
  "Cook": [
    "Ah yes! Why, I was so impressed with that recipe you created that I memorised it!",
    "But of course! It was an unusual dish, an unusual dish indeed! First you blend together, in a pot, some milk and some cream. Then add cornflour to the mixture.",
    "Oh, you told me you used sweetcorn in a mill.",
    "Then you travelled to the Kharazi Jungle and searched the plants there until you found a vanilla stick, which was then added to the mixture.",
    "After that you told me that you sought out and killed the fearsome Evil Chicken, to get one of his eggs, which was then mixed with the other ingredients.",
    "Finally you made some cinnamon by grinding the branch of a Dramen Tree and sprinkled it on top of the creme brulee.",
    "Yes, but then came the impressive part!",
    "Apparently, a creme brulee supreme needs to be flambed at exactly the right temperature, and the only fire that is hot enough to do this is the breath of a dragon. Luckily, while killing black dragons near the Evil Chicken's lair, you came across a method of forcing a dragon to your will so that it would complete the dish, which you then used to protect Sir Amik!",
    "Oh yes. You were quite adamant about it. Specifically black dragons. Specifically near the Evil Chicken's lair.",
    "Did you want a reminder on any other of your brave exploits?"
  ],
  "Wise Old Man": [
    "The Evil Chicken! Many are the myths and legends surrounding this foul bird. Some say that it is the result of a mad mage's attempt to summon a demon, others say that it was once a normal chicken that realised how limited its farmyard life was. It threw off its chains and attempted to unite the other chickens in revenge against their human captors. When that failed the Evil Chicken grew angry with its brethren and swore to kill any human or chicken that it ever encountered again!",
    "It is whispered that there is a coven of witches that meet, on the night of the full moon in the fabled fairy kingdom, to worship this bird and that they can summon it to do their twisted will!",
    "I would start in the lands of the fairies, possibly there is some truth in the rumours of summoning the chicken there. Actually, I've done further research, it may be around here somewhere. If you're really thinking of going there you should be extremely careful, it's claimed that the chicken has forced some very powerful creatures to guard its lair.",
    "Is there anything else you'd like to ask?",
    "As you wish. Farewell, [Player]."
  ],
  "Evil Chicken": [
    "Bwuk bwuk bwuk",
    "MUAHAHAHAHAAAA!",
    "Begone, [Player]!",
    "Bwuk."
  ],
  "K'klik": [
    "Who are you? You're not the hero I gave my token to!",
    "How did you get that coin you used to summon me?",
    "My name is K'klik. I am a Fairy Dragon.",
    "One of the last surviving members of my race, I fear.",
    "Enough of that: you summoned me, so how can I help?",
    "The person who holds my token can summon me by rubbing it.",
    "They then have the right to request one thing of me before returning my token.",
    "That's right. What do you want?",
    "Sure, that's easy.",
    "I think you need to wear some sort of protective gloves, otherwise I'll flambé your arm.",
    "Okay, if you're sure.",
    "A pair of ice gloves should do the trick.",
    "I suppose that seems fair. Alright, just call me when you need me.",
    "Sorry, can't help. You'll have to ask the genie for that.",
    "No horses in RuneScape. Try again."
  ],
  "v • d • eRS3 Recipe for Disaster": [
    "Freeing Sir Amik VarzeA subquest of Recipe for DisasterNPCs"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Recipe_for_Disaster:_Freeing_Sir_Amik_Varze?oldid=35725496’"
  ]
}