{
  "Velorina": [
    "Take pity on me, please - eternity stretches out before me and I am helpless in its grasp.",
    "Oh, I'm sorry - I was just wailing out loud. I didn't mean to scare you.",
    "Do you know the history of our town?",
    "Would you help us obtain our release into the next world?",
    "Do you know why ghosts exist?",
    "Yes, that is normally the case. But here in Port Phasmatys, we of this town once chose freely to become ghosts!",
    "It is a long story. Many years ago, this was a thriving port, a trading centre to the eastern lands. We became rich on the profits made from the traders that came across the eastern seas. We were very happy... until Lord Drakan noticed us. He sent unholy creatures to demand that a blood-tithe be paid to the Lord Vampyre, as is required from all in the domain of Morytania. We had no choice but to agree to his demands. As the years went by, our numbers dwindled and many spoke of abandoning the town for safer lands. Then, Necrovarus came to us. He came from the eastern lands, but of more than that, little is known. Some say he was once a mage, some say a priest. Either way, he was in possession of knowledge totally unknown to even the most learned among us. Necrovarus told us that he had been brought by a vision he'd had of an underground source of power. He inspired us to delve beneath the town, promising us the power to repel the vampyres. Deep underneath Phasmatys, we found a pool of green slime that Necrovarus called ectoplasm. He showed us how to build the Ectofuntus, which would turn the ectoplasm into the power he had promised us. Indeed, this Ectopower did repel the vampyres; they would not enter Phasmatys once the Ectofuntus began working. But little did we know that we had exchanged one evil for yet another - Ectopower. Little by little, we began to lose any desire for food or water, and our desire for the Ectopower grew until it dominated our thoughts entirely. Our bodies shrivelled and, one by one, we died. The Ectofuntus and the power it emanates keeps us here as ghosts - some, like myself, content to remain in this world; some becoming tortured souls who we do not allow to pass our gates. We would be able to pass over into the next world but Necrovarus has used his power to create a psychic barrier, preventing us. We must remain here for all eternity, even unto the very end of the world.",
    "Would you help us obtain our release into the next world?",
    "No, you're right - it's our own fault. If you do change your mind though, please come back and help us. We will be here ... forever.",
    "Oh, thank you! Necrovarus will not listen to those of us who are already dead. He might rethink his position if someone with a mortal soul pleaded our cause. If he declines, there may yet be another way.",
    "I sense that you have not yet spoken to Necrovarus.",
    "Well, I suppose we do have all the time in the world...",
    "I feared as much. His spirit is a thing of fire and wrath.",
    "It is only a small chance. During the building of the Ectofuntus one of Necrovarus's disciples spoke out against him. It is such a long time ago I cannot remember her name, although I knew her as a friend. She fled before the Ectofuntus took control over us, but being a disciple of Necrovarus she would have been privy to many of his darkest secrets. She may know of a way to aid us without Necrovarus.",
    "I have a vision of a small wooden shack, the land it was built on the unholy soil of Morytania. I sense the sea is very close, and that there looms castles to the west and the east.",
    "She was a friend of mine. Had she died, I would have felt her spirit pass over to the next world, though I may not follow.",
    "Nobody knows what has happened to the Book. It was stolen when our port was raided by pirates many years ago, and never seen since.",
    "I imagine they are still worn by his mortal body, which now lies in a coffin inside the Temple.",
    "I don't really know. You could try asking some of the traders from the East - they might be able to help you.",
    "How is it going?",
    "Oh, kind [sir/lady] - you are the answer to all our prayers!",
    "You don't need to tell me Player- I sensed the removal of Necrovarus's psychic barrier!",
    "Here, take this as a thank you for the service that you have given us.",
    "This is an Ectophial. If you ever want to come back to Port Phasmatys, empty this on the floor beneath your feet, and you will be instantly teleported to the temple - the source of its power. Remember that once the Ectophial has been used you need to refill it from the Ectofuntus.",
    "All in good time, Player. We stand forever in your debt, and will certainly put in a good word for you when we pass over.",
    "Of course you can, you have helped us more than we could ever have hoped."
  ],
  "Player": [
    "Why, what is the matter?",
    "No, that's okay - it takes more than a ghost to scare me. What is wrong?",
    "Yes, I do. It is a very sad story.",
    "No - could you tell me?",
    "A ghost is a soul left in limbo, unable to pass over to the next world; they might have something left to do in this world that torments them, or they might just have died in a state of confusion.",
    "Why on earth would you do such a thing?",
    "That's a very sad story.",
    "I'm sorry, but it isn't really my problem.",
    "Yes, of course I will. Tell me what you want me to do.",
    "Leave me alone - I'm scared of ghosts!!!",
    "No, I was just getting to that.",
    "I must speak with you on behalf of Velorina.",
    "She wants to pass-",
    "But she-",
    "Please, listen to me-",
    "I'm sorry, but Necrovarus will not let you go.",
    "You spoke of another way.",
    "Do you know where this woman can be found?",
    "If it was such a long time ago, won't she be dead already?",
    "I'm here about Necrovarus. Were you once a disciple of Necrovarus in the Temple of Phasmatys, old woman?",
    "Is there anything that can help to refresh your memory?",
    "Do you know where I can find nettles around here?",
    "Here's some tea for you, like you asked.",
    "I see. Can I have this special cup, then?",
    "Here's a lovely cup of tea for you, in your own special cup.",
    "Here's a lovely cup of milky tea for you, in your own special cup.",
    "I have come from Velorina. She needs your help.",
    "She's a ghost, I'm afraid.",
    "She and many others want to pass on into the next world, but Necrovarus will not let them. Do you know of any way to help them?",
    "No I don't, I'm afraid.",
    "Yes, I'm carrying one in my bag.",
    "Yes, I'm wearing one right now.",
    "What do you need to perform the enchantment?",
    "You are doing so much for me - is there anything I can do for you?",
    "That's the second saddest story I have heard today.",
    "Was this his boat?",
    "If I find him, I will pass it on.",
    "Remind me - what can I do about Necrovarus?",
    "What did you want me to get for you?",
    "I'll go and search for those items you need.",
    "I am afraid I have not found your son yet.",
    "I am afraid I have lost the boat you gave to me.",
    "Wheels have been set in motion, Necrovarus; wheels that will set the citizens of Port Phasmatys free.",
    "Do you know where I can find the Book of Haricanto?",
    "Do you know where I can find the Robes of Necrovarus?",
    "I need something to translate the Book of Haricanto.",
    "How is it going?",
    "What is your name?",
    "You're the cabin boy?!?",
    "Can I have the key to the chest?",
    "Is this your toy boat?",
    "Your mother gave it to me to pass on to you.",
    "Yes, in a shack to the west of here.",
    "Can I have the key to the chest, then?",
    "I've lost my key to the chest - do you have another one?",
    "Sorry, I won't do it again...",
    "Good news! I have found your son!",
    "He lives on a shipwreck to the east of here. He remembers you and wishes you well.",
    "Err, I was just curious...",
    "Do you have any jobs I can do?",
    "Yes, I'd be delighted.",
    "No, I didn't mean a job like that.",
    "After hearing Velorina's story I will be happy to help out.",
    "I must let you know, Necrovarus, that I am collecting signatures from the citizens of Port Phasmatys.",
    "Would you sign this petition form, please?",
    "Would you sign this petition form, please?",
    "Would you sign this petition form, please?",
    "Would you sign this petition form, please?",
    "Would you sign this petition form, please?",
    "How much?",
    "Okay, if you insist.",
    "There's no way I'm giving in to corruption.",
    "I don't have that many on me.",
    "Would you sign this petition form, please?",
    "Necrovarus, I am presenting you with a petition form that has been signed by 10 citizens of Port Phasmatys.",
    "It says that the citizens of Port Phasmatys should have the right to choose whether they pass over into the next world or not, and not have this decided by the powers that be on their behalf.",
    "So you will let them pass over if they wish?",
    "Really?",
    "It matters not that you ignore your citizens' wishes, Necrovarus. Wheels have been set in motion, wheels that will set them free.",
    "So, have you changed your mind yet?",
    "Yes. He burned it.",
    "Well, if you knew that he would do that, why have I been wasting my time running around after ghosts for signatures?",
    "It's nice to see a human face around here.",
    "You come from the lands of the East? Do you have anything that can help me translate a book that is scribed in your language?",
    "How much do you want for it?",
    "What would you like me to do?",
    "Okay, wait here - I'll get you your bow.",
    "Sorry, I have too much to do at the moment.",
    "Have you got an oak shieldbow that I can get Robin to sign for you?",
    "Well done, you beat me.",
    "So are you going to pay up then? You owe me [25/50/75] gold coins!",
    "What if you lose again?",
    "I've had enough of you not paying up - you owe me 100 gold coins. I'm going to tell the ghosts what you're doing.",
    "How about you signing my shieldbow then?",
    "So, still here then.",
    "You have a serious gambling problem, you know.",
    "I need you to sign another shieldbow.",
    "Yes, I'll give you a game.",
    "How do you play Runedraw?",
    "No, I don't approve of gambling.",
    "No, you didn't pay up the last time you lost.",
    "I have your signed shieldbow for you.",
    "He was more than happy to oblige (cough). Here you are.",
    "Thank you for the translation manual, Ak-Haranu - it may save many souls before long.",
    "I'm sorry, I seem to have lost the translation manual you gave me.",
    "I'm here about Necrovarus.",
    "I have something for you.",
    "I'm here about Necrovarus. I seem to have lost my ghostspeak amulet.",
    "I'm here about Necrovarus.",
    "Actually, I haven't tried it yet.",
    "I have had the Amulet of Ghostspeak enchanted, which I shall use to command Necrovarus to set you free.",
    "No, Necrovarus, I am not insane. With this enchanted amulet of ghostspeak I have the power to command you to do my will!",
    "Let any ghost who so wishes pass on into the next world.",
    "Carry on...",
    "Yes?",
    "I think we're almost getting there...",
    "Tell me a joke.",
    "Who's there?",
    "Egbert who?",
    "Do a chicken impression.",
    "Told you I'd defeat you, Necrovarus. My advice to you is to pass over to the next world yourself with everybody else.",
    "Quiet, evil priest!! If you try anything I will command you again, but this time it will be to throw yourself into the Endless Void for the rest of eternity.",
    "Only happy to help out.",
    "Why are you still protesting? I have commanded Necrovarus to let you and your friends do as you like! There's no need for this anymore!",
    "Okay, suit yourself then.",
    "I thought you were going to pass over to the next world.",
    "Can I have another Ectophial?"
  ],
  "Necrovarus": [
    "You dare to speak that name in this place?????",
    "Silence!! Or I will incinerate the flesh from your bones!!!",
    "Get out of my sight!! Or I promise you that you will regret your insolence for the rest of eternity!!!",
    "No - listen to me. Go from this place and do not return, or I will remove your head.",
    "Oh goody goody. I just can't wait.",
    "Oh, I do admire an activist. Do let me know when you're finished, and I'll give it my fullest consideration.",
    "A petition you say? Continue, mortal.",
    "I see.",
    "Oh yes.",
    "NO!!!!! Get out of my sight before I burn every ounce of flesh from your bones!!!!!",
    "I have almost completely lost patience with you, mortal. Another word, and every threat I have uttered will be made real for you.",
    "NEVER!!!!! WHICH IS A VERY LONG TIME!!!!!!",
    "You dare to face me again - you must be truly insane!!!!",
    "I - will - let ...",
    "...any...",
    "... ghost who so wishes ...",
    "... pass into the next world.",
    "Knock knock",
    "Egbert.",
    "Egbert no bacon.",
    "Cluck cluck squuuaaaakkkk cluck cluck",
    "I think I've laid an egg...",
    "I should fry you for what you have done...",
    "Please no! I will do whatever you say!!"
  ],
  "Netty": [
    "I don't remember; I am so old and my memory goes back only so far...",
    "Yes, I would love a nice hot cup of nettle tea.",
    "I believe they grow wild in the Haunted Forest.",
    "Yes, but it's not in my special cup! I only ever drink from my special cup!!",
    "Oh no, it hasn't got milk in it. I only drink tea with milk, I'm afraid.",
    "Ah, that's better. Now, let me see... Yes, I was once a disciple of Necrovarus.",
    "Velorina? That name sounds familiar... Yes, Velorina was once a very good friend! It has been many years since we spoke last. How is she?",
    "They are all dead, then. Even Velorina. I should have done something to stop what was happening, instead of running away.",
    "There might be one way...",
    "Do you have such a thing as a ghostspeak amulet?",
    "Well, you'll need to find one.",
    "Well, that's a stroke of luck.",
    "Well, that's a stroke of luck.",
    "There is an enchantment that I can perform on such an amulet that will give it the power of command over ghosts. It will work only once, but it will enable you to command Necrovarus to let the ghosts pass on.",
    "Necrovarus had a magical robe for which he must have no more use. Only these robes hold the power needed to perform the enchantment. All his rituals came from a book written by an ancient sorcerer from the East called Haricanto. Bring me this strange book. I cannot read the strange letters of the eastern lands. I will need something to help me translate the book.",
    "I have lived here on my own for many years, but not always. When I left Port Phasmatys, I took my son with me. He grew up to be a fine boy, always in love with the sea. He was about twelve years old when he ran away with some pirates to be a cabin boy. I never saw him again.",
    "If you ever see him, please give him this...and tell him that his mother still loves him.",
    "Yes, he made it himself. It is a model of the very ship in which he sailed away. The paint has peeled off and it has lost its flag, but I could never throw it away.",
    "I never expected that you would find him - although if you do, please let me know.",
    "No, I've found it - here you go.",
    "Good - the robes of Necrovarus.",
    "The Book of Haricanto! I have no idea how you came by this, but well done!!",
    "A translation manual - yes, this should do the job.",
    "Wonderful; that's everything I need. I will now perform the ritual of enchantment.",
    "Oh dear, that's unfortunate. You'll have to go and find another one, then.",
    "Did it work?"
  ],
  "Old man": [
    "Wonderful, wonderful! Mother's coming to get me!",
    "I don't remember. Everyone around here just calls me 'boy'.",
    "Yes, and proud of it.",
    "Hang on, let me ask the Captain ...",
    "The Captain says no.",
    "No - I made a toy boat a long while ago, but that one had a flag.",
    "No -  I made a toy boat a long while ago, but the colours on the flag were different.",
    "My word - so it is!!! I never thought I would see it again!! Where did you get it from?",
    "My mother? She still lives?",
    "After all these years ...",
    "Hang on, let me ask the Captain ...",
    "The Captain says yes.",
    "What? But the chest is only just over there! How on Gielinor did you lose it in that short distance?"
  ],
  "Old crone": [
    "Goodness! Where is he?",
    "Oh thank you!! I will travel to see him as soon as I am able!!"
  ],
  "Ghost disciple": [
    "What are you doing going in there?",
    "Inside that room is a coffin, inside which lie the mortal remains of our most glorious master, Necrovarus. None may enter.",
    "Woooo wooooo woooo"
  ],
  "Ghost innkeeper": [
    "Yes, actually, I do. We have a very famous Master Bowman names Robin staying with us at the moment. Could you take him some clean bed linen for me?",
    "Oh, thank you. Be careful with that Robin, though - he's far too full of himself, that one."
  ],
  "Gravingas": [
    "Will you join with me and protest against the evil desires of Necrovarus and his disciples?",
    "Excellent, excellent!! Here - take this petition form, and try and get 10 signatures from the townsfolk.",
    "Come on - you haven't even started yet! You need 10 more signatures.",
    "Not doing too badly I see! You need [4-9] more signature[s].",
    "Are you sure you haven't done this type of thing before? You need [2-3] more signatures.",
    "Very nearly there!! Only 1 more signature to go.",
    "You've got them all! Now go and present it to Necrovarus!!",
    "Blown away in the sea breeze, hey? Oh well, can't be helped. Here's another one, but you'll have to start from scratch again.",
    "So have you presented the petition to Necrovarus?",
    "That's exactly what I thought he would do.",
    "It never hurts to get involved in politics.",
    "There's always a need for a healthy interest in politics."
  ],
  "Ghost villager": [
    "I'm sorry, but it's hard to believe that a mortal could be interested in helping us.",
    "Why are you wearing that bedsheet? If you're trying to pretend to be one of us, you're not fooling anybody – you're not even green!",
    "I will have you know that I am a fervent supporter of Necrovarus.",
    "My answer is no.",
    "How dare you accost me in the street?",
    "I don't have time for this nonsense.",
    "Get lost.",
    "Most certainly, I will.",
    "I'll do anything that annoys Necrovarus.",
    "Yes! It's about time somebody did something about Necrovarus.",
    "Yes, of course.",
    "I will if you make it worth my while...",
    "You scratch my back and I'll scratch yours...",
    "It'll cost you...",
    "Oh, it'll cost you [1-3] ecto-tokens.",
    "Suit yourself.",
    "No tokens, no signature.",
    "You only just asked me the same thing! Leave me alone - I've had my say!"
  ],
  "Ak-Haranu": [
    "My name Ak-Haranu. I am trader, come from many far across sea in east.",
    "Ak-Haranu may help you. A translation manual I have, much good for reading Eastern language.",
    "Ak-Haranu not want money for this book, as is such small thing. But there may be something you could do for me. I am big admirer of Robin, Master Bowman. He staying in village inn.",
    "Please get Master Bowman sign an oak shieldbow for me, so Ak-Haranu can show family and friends when returning home and become much admired. Then I give you book in exchange.",
    "No, Ak-Haranu afraid that no shieldbow in supply at moment. You must make one or buy one.",
    "Ah, can it be true? You have obtained bow from Master Bowman?",
    "May honour be bestowed upon you and your family!",
    "And Ak-Haranu thanks you for kind gift of shieldbow.",
    "Ah, no worry, my friend. For the gift of shieldbow Ak- Haranu would give a thousand books."
  ],
  "Robin": [
    "Hey you, why don't you have a game of Runedraw with me? If you've got 25 gold pieces I've got a bag of runes we can use.",
    "How about another game?",
    "How about another game? I'll pay you back with the winnings.",
    "Er ... we'll deal with that when we come to it.",
    "Please don't do that!!! They will suck the life from my bones!!!",
    "I'll certainly sign your shieldbow, if you bring me one!!",
    "Yes, anything!!!",
    "Do you want another game of Runedraw?",
    "Oh, okay - just keep your promise not to tell the ghosts anything.",
    "Two players take turns to draw a rune from a bag, which contains ten runes in total. Each rune has a different value: an air rune is worth one point, up to a Nature rune which is worth nine points. If a player draws the Death rune then the game is over, and they have lost. A player can choose to hold if they wish and not draw any more runes, but this runs the risk of the other player drawing more runes until they have a greater points total and win."
  ],
  "Congratulations! You have completed": [
    "'Ghosts Ahoy' - Complete this Intermediate quest."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Ghosts_Ahoy?oldid=36173389’"
  ]
}