{
  "Redbeard Frank": [
    "Arr, Matey!",
    "Arr, treasure you be after eh? Well I might be able to tell you where to find some... For a price...",
    "Well for example if you can get me a bottle of rum... Not just any rum mind... I'd like some rum made on Karamja Island. There's no rum like Karamja Rum!",
    "Gadzooks, that swill! Not a chance! It's Karamja Rum or no deal.",
    "Fair enough. I'll still be here and thirsty whenever you feel like helpin' out.",
    "Yer a saint, although it'll take a miracle to get it off Karamja.",
    "The Customs office has been clampin' down on the export of spirits. You seem like a resourceful young lad, I'm sure ye'll be able to find a way to slip the stuff past them.",
    "Arr, that's the spirit!",
    "Arr!",
    "Nothin' at the moment, but then again the Customs Agents are on the warpath right now.",
    "Arr, Matey! Have ye brought some rum for yer ol' mate Frank?",
    "Not surprising, 'tis no easy task to get it off Karamja.",
    "The Customs Office has been clampin' down on the export of spirits. You seem like a resourceful young lad, I'm sure ye'll be able to find a way to slip the stuff past them.",
    "Was there anything else?",
    "Arr, Matey! Have ye brought some rum from yer ol' mate Frank?",
    "Now a deal's a deal, I'll tell ye about the treasure. I used to serve under a pirate captain called One-Eyed Hector. Hector were very successful and became very rich. But about a year ago we were boarded by the Customs and Excise Agents. Hector were killed along with many of the crew, I were one of the few to escape and I escaped with this.",
    "This be Hector's key. I believe it opens his chest on his old room in the Blue Moon Inn in Varrock. With any luck his treasure will be in there.",
    "I'm not allowed in the Blue Moon Inn. Apparently I'm a drunken trouble maker.",
    "No lad, you got it fair and square. You enjoy it. It's what Hector would have wanted."
  ],
  "Player": [
    "I'm in search of treasure.",
    "What sort of price?",
    "Would some Braindeath 'Rum' do?",
    "Not right now.",
    "Ok, I will bring you some rum.",
    "What do you mean?",
    "Well I'll give it a shot.",
    "Arr!",
    "Do you have anything for trade?",
    "No, not yet.",
    "What do you mean?",
    "Well, I'll give it another shot.",
    "Yes, please.",
    "Oh dear, I don't seem to have enough money.",
    "No, thank you.",
    "Can I journey on this ship?",
    "Why?",
    "Search away, I have nothing to hide.",
    "Umm... it's for personal use?",
    "Ok.",
    "Oh dear, I don't seem to have enough money.",
    "Oh, I'll not bother then.",
    "You're not putting your hands on my things!",
    "Does Karamja have unusual customs then?",
    "Could you offer me employment on your plantation?",
    "That customs officer is annoying isn't she?",
    "Really? How interesting. Whereabouts do you send those to?",
    "What did I have to do again?",
    "No, the crate isn't full yet...",
    "So where are these bananas going to be delivered to?",
    "I've filled a crate with bananas.",
    "Will you pay me for another crate full?",
    "Thank you, I'll be on my way",
    "Can I get a job here?",
    "No, I haven't.",
    "Where can I get one of those?",
    "Yes, I have one right here.",
    "Yes, can I work out front now?",
    "Yes, are you going to pay me yet?",
    "No, it's a complete mess.",
    "Yes, I've got some.",
    "Ok thanks, I'll go and get it.",
    "So why didn't you ever get it?",
    "I have the treasure, would you like a share?"
  ],
  "Seaman Lorris": [
    "Do you want to take a trip to Karamja? The trip will cost you 30 coins.",
    "The trip to Karamja will cost you 30 coins."
  ],
  "Customs officer": [
    "Can I help you?",
    "You need to be searched before you can board.",
    "Because Asgarnia has banned the import of intoxicating spirits.",
    "Aha, trying to smuggle rum are we?",
    "Well, you've got some odd stuff, but it's all legal. Now you need to pay a boarding charge of 30 coins.",
    "You're not getting on this ship then.",
    "I'm not that sort of customs officer.",
    "Can I help you?"
  ],
  "Luthas": [
    "Hello I'm Luthas, I run the banana plantation here.",
    "Yes, I can sort something out. There's a crate ready to be loaded onto the ship. You wouldn't believe the demand for bananas from Wydin's shop over in Port Sarim. I think this is the third crate I've shipped him this month.. If you could fill it up with bananas, I'll pay you 30 gold.",
    "Well I know her pretty well. She doesn't cause me any trouble any more. She doesn't even search my export crates any more. She knows they only contain bananas.",
    "There is a little shop over in Port Sarim that buys them up by the crate. I believe it is run by a man called Wydin.",
    "Have you completed your task yet?",
    "There's a crate ready to be loaded onto the ship. If you could fill it up with bananas, I'll pay you 30 gold.",
    "Well come back when it is.",
    "I sell them to Wydin who runs a grocery store in Port Sarim.",
    "Well done, here's your payment",
    "Yes certainly. If you go outside you should see the old crate has been loaded on to the ship, and there is another empty crate in its place."
  ],
  "Wydin": [
    "Welcome to my food store! Would you like to buy anything?",
    "Well, you're keen, I'll give you that. Okay, I'll give you a go. Have you got your own white apron?",
    "Well, you can't work here unless you have a white apron. Health and safety regulations, you understand.",
    "Well, I get all of mine over at the clothing shop in Varrock. They sell them cheap there. Oh, and I'm sure that I've seen a spare one over in Gerrant's fish store somewhere. It's the little place just north of here.",
    "Wow - you are well prepared! You're hired. Go through to the back and tidy up for me, please.",
    "Is it nice and tidy round the back now?",
    "No, I'm the one who works here.",
    "Umm... No, not yet.",
    "Ah well, it'll give you something to do, won't it.",
    "Can you put your white apron on before going in there, please?"
  ],
  "Gardener": [
    "First moles, now this! Take this, vandal!"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Pirate%27s_Treasure?oldid=36076769’"
  ]
}