{
  "Bill Teach": [
    "Mumblelandlubbermumblemumble...",
    "What right have ye to be so happy, landlubber?",
    "Aye, that it is.",
    "Will ye forgive an old sailor his temper [lad/lass]? I'm in dire straits indeed.",
    "I dunno, [lad/lass], I need a pirate to help me with my problem, but none will sail with me.",
    "Well, ye look like ye might have the right stuff, tell me would ye like te be a pirate?",
    "Well I dunno... it takes more grit than most have te be a pirate.",
    "Tell me, be ye as agile as a cat on a hot tin roof?",
    "Be ye a smith and [craftsman/craftswoman] of great renown?",
    "Be ye the kind of keen-eyed archer that can hit an albatross at one hundred paces?",
    "Have ye rendered great services to pirates in the past?",
    "Then no, [lad/lass], ye can't help with my problem.",
    "Well [lad/lass], I don't think ye could pirate yer way out of a chest full of piracy.",
    "But since nobody else will risk the trip ye'll do!",
    "Well [lad/lass], I be Bill Teach, the Captain of The Adventurous, one of the finest ships ever to sail these waters.",
    "I'm in port doin' some legitimate tradin' before headin' back to Mos Le'Harmless.",
    "It's a pirate stronghold off the southern coast of Morytania.",
    "Been in existence for years it has, the best place for pirates to relax with the exception of Brimhaven.",
    "Would be THE best, but we don't have their fancy Agility Arena.",
    "Of course [lad/lass], once we make landfall ye'll have worked as a sailor on a pirate vessel, which is one of the easiest ways to become a true pirate.",
    "This brings me back to the reason I'm stuck here of course, and the reason I need your help.",
    "Last night I got into a war o' words with another Cap'n, and he has vowed to sink my ship and put all of my crew to the sword.",
    "By desertin'.",
    "Every last one!",
    "The second I leave port I'll come under attack.  [sic]I think I'll be able te make it if I have another person helpin' out, but I wouldn't stand a chance by me self.",
    "Ye said ye would help me out [lad/lass], will ye stand by yer word?",
    "Well, that doesn't surprise me much.",
    "On yer way [lad/lass], leave me be.",
    "Arr! Ye struck me as a [man/woman] of integrity!",
    "My ship is The Adventurous, and she's at the east dock.",
    "I'm all ready te get underway, and I'll see ye onboard when yer ready te go too.",
    "I'm sure I won't.",
    "Aye, that it be. Come back when yer liver ain't so lily-like, [lad/lass].",
    "Let me finish my drink, landlubber!",
    "If ye ain't up te scratch as a pirate I may not get another one.",
    "Just remember, [he/she]'s all ye could get, Bill, and maybe ye'll get through it...",
    "Ye came!",
    "Well, I had the feelin' ye might have run off when ye realised how much of a task ye had ahead of ye.",
    "Aye, I should have remembered ye was eager.",
    "Ye all ready to go [lad/lass]?",
    "Aye [lad/lass], take yer time, I'm not goin' anywhere without ye.",
    "All right lad/lass, let's try this again. This time, try not te run away!",
    "Well, as much as this is an interestin' break, why don't ye head back to the ship and we'll see if we can beat them this time?",
    "Stop sayin' that!",
    "Ye don't say [lad/lass].",
    "Well, without anyone else te help ye'll have te do some hard work if we don't want to end up walkin' home on the sea bed.",
    "Well if their first shot hadn't taken out the cannon I'd be firing that at them.",
    "Arr! They seek te hole the ship! Go and take care of their cannon.",
    "If ye grab some fuse from the gun locker, and a rope from the repair locker, then ye can use the rope on the sails to swing over and deal with their cannon.",
    "Just take the fuse, use it on the barrel of gunpowder next to the cannon, and then light it with something.",
    "A lantern, a tinderbox, it doesn't matter.",
    "End of problem.",
    "They have masts as well don't they?",
    "Just do the same trick using some rope on their sails and swing over.",
    "Stop doin' that!",
    "Ye ain't a pirate yet by a long shot!",
    "I'll be on deck if ye need me.",
    "Well, ye'll need to silence their cannon before it sinks us. Before ye do that though, ye'll need to swing over to their ship.",
    "Yer not much of a pirate are ye [lad/lass]?",
    "Ye climb up the mast and use a rope on the sails up there.",
    "Then ye climb down and ye swing on the rope.",
    "If I have te explain how ye do THAT then I might as well just send out some biscuit weevles[sic] to do the job instead.",
    "Egad...",
    "Well, ye'll need some fuse from the cannon locker below decks.",
    "Swing over to the enemy ship and put the fuse in the barrel of gunpowder they'll have next to the cannon to speed up their firin'.",
    "Then, use something on the fuse te get it lit. A tinderbox, candle or any sort of flame will do.",
    "After that ye just step back and let it burn by its self.",
    "Give me strength...",
    "Yer not a pirate yet [lad/lass], so stop talkin' like that!",
    "Well, ye've sorted out their cannon, but we're takin' on water.",
    "Go below deck and sort out the leaks.",
    "No [lad/lass], these holes were made by cannon fire.",
    "Ye'll need to get some planks from the repair locker and tack them in place.  [sic]Then ye smear swamp paste over the planks to seal the hole.",
    "Wait 'till we make landfall before ye start actin' like a pirate!",
    "Zounds...",
    "Pay attention!",
    "Ye'll need to get some planks from the repair locker and tack them in place. Then ye smear swamp paste over the planks to seal the hole.",
    "This is what I get when I ask random strangers for help...",
    "Nailed shut and waterproofed?",
    "Good work [lad/lass].",
    "If ye weren't set on yellin' 'Arr!' all the time I'd think ye was a born sailor.",
    "Regardless, those cowardly dogs seem a little too scared to swing over.",
    "Why not pay them a visit and go plunder their hold?",
    "Gadzooks...",
    "Look, just go below their decks and search their hold for Plunder[sic].",
    "Come back here and drop it in the chest in the hold.",
    "Ye should be able to round up five loads of the stuff.",
    "I've been a pirate all me life and I've never heard anyone keep harpin' on like that!",
    "Stop it!",
    "Five! Can't ye count that high?",
    "Yer not making any friends here [lad/lass], just go and do it.",
    "I warn ye, [lad/lass], if the first word out of yer mouth is 'Arr' I'll be wearing yer spleen as a novelty hat before ye reach the second 'r'!",
    "I should have seen that comin'[sic]",
    "Let me see that.",
    "Have what back?",
    "Not yet! Let's give em a blast with the cannon before we leave!",
    "Alright [lad/lass], try and stay with me on this one.",
    "See, there is a secret technique for making things that be broken right again.",
    "We call this magical process...repairin'.",
    "Ye need to remove the old barrel, then replace it with a new one from the gun locker downstairs.",
    "I don't want to overload ye with too many details right now. Come tell me when the cannon is ready again.",
    "If ye know what is good for ye, yer off to fix the cannon!",
    "By replacing the broken barrel with a new one! Hop to it [lad/lass], the salt air is clearly eatin' into yer brains!",
    "Have ye fixed the cannon yet, yes or no.",
    "Ye did? Great!",
    "Now ye can give those pirates a good shot across their bows.",
    "Ye'll need to load the cannon, and if ye get it wrong the barrel will blow, and ye'll need to start again.",
    "First, ye take some powder from the powder keg.",
    "Then ye use a ramrod from the gun locker on the powder to tamp the charge.",
    "Then ye use a canister round on the cannon.",
    "Finally ye use some fuse on the cannon, and light it like ye did the fuse on the barrel earlier.",
    "Then, ye'll need to use the ramrod on the cannon to clean it out for the next shot.",
    "Ye got all that?",
    "And te think this was all I could get te help...",
    "I can guess from the lack of an explosion that ye haven't fired the cannon yet, correct?",
    "And I'll bet ye want a quick recap of how to do it, correct?",
    "Ye'll need to load the cannon, and if ye get it wrong the barrel will blow, and ye'll need to start again.",
    "First, ye take some powder from the powder keg.",
    "Then ye use a ramrod from the gun locker on the powder to tamp the charge.",
    "Then ye use a canister round on the cannon.",
    "Finally ye use some fuse on the cannon, and light it like ye did the fuse on the barrel earlier.",
    "Then, ye'll need to use the ramrod on the cannon to clean it out for the next shot.",
    "Ye got all that this time?",
    "Yer still not a pirate, so cut that out!",
    "Great! This ordeal will soon be over!",
    "Pirates?",
    "Yes, that ordeal too!",
    "Now [lad/lass], we'll send them to the bottom of the sea.",
    "Well, ye'll shoot holes in their hull with the cannon.",
    "Essentially ye do what ye just did, but use a cannonball from the gun locker in the hold instead of the canister rounds.",
    "Again with the 'Arr!'...",
    "Give it three tries and see if they sink, that many holes should do it.",
    "Aye [lad/lass]?",
    "Aye [lad/lass]?",
    "Aye [lad/lass]?",
    "Three! Three times [lad/lass]! Three! One more than two, one less than four! Got it!",
    "Go back?",
    "Got a little scared now have we?",
    "A likely story.",
    "Are ye sure ye can't get by without it?",
    "I thought as much.",
    "That's the spirit!",
    "One look at the enemy and ye run away.",
    "Get over there and take out their cannon before I throw ye there me self.",
    "Looks like they haven't been back to port to get that cannon fixed, which is lucky.",
    "Get below and fix the holes in the hull pronto, or we'll sink before they have a chance te kill us!",
    "When yer quite done runnin' away [lad/lass] ye've got a load of plunder to be grabbin'!",
    "Have ye sorted out the cannon yet?",
    "Then hop to it [lad/lass]!",
    "We were on the home stretch [lad/lass] why did we turn back?",
    "Never mind, just go shoot the pirates and let's press on.",
    "We had them right where we wanted them, and we ran!",
    "I'll be a laughing stock...",
    "We're almost there! Just hole their hull and we'll be able to make it past. Get to it!",
    "Let's head to the island!",
    "Oh, Miss La'Fiette, if only I were that lucky.",
    "My crew deserted and I was stuck with an adventurer mannin' me ship.",
    "[He/She] was as piratical as a bunch of Dwellberries...",
    "Aye [lad/lass], I remember.",
    "All right...",
    "Ok Player, yer now a pirate, but...",
    "BUT ye can't just go around talking like some pirate in a fancy play.",
    "No self-respectin' pirate says 'Arr' that much!",
    "Well, except for Fancy Dan, but that be another story.",
    "Here, have this book. It'll learn ye how to be a pirate.",
    "Or at least learn ye te talk proper like one.",
    "Aye...that be all ye need te do.",
    "Ye'll need that book if ye want te trade with some of the pirates round here.",
    "Outsiders tend not te understand them if ye catch me drift.",
    "Anyway, I'd have been shark bait without ye.",
    "If ye get a moment come see me fer yer share of the loot.",
    "I'm sure as soon as ye stop yellin' 'Arr!' ye'll make a great pirate.",
    "Thanks Player. If ye need a lift back, just come see me."
  ],
  "Player": [
    "Hello!",
    "Well it is quite a nice day.",
    "What's the problem? I may be able to help.",
    "Yes, I've always wanted to be a pirate!",
    "A life on the open waves, swinging on the rigging, walking the plank...",
    "I'd love to be a pirate!",
    "Well, I am quite agile...",
    "Arr! That I be!",
    "Aye! Ye point me te the Albatross and I'll bring it down Cap'n!",
    "Not yet, but I was going to!",
    "Arr! I be the least land-lubberin' landlubber that ye ever did see!",
    "I'll send those scurvy-riddled bilge-dogs to the bottom of the sea!",
    "Fire another broadside Mr Bosun!",
    "Flog 'em fer bein' lazy sons of whelks!",
    "Arr! Arr!",
    "Awww...",
    "Mos Le'Harmless? Where is that?",
    "Will it be OK for me to go there if I am not a pirate?",
    "How horrible! How did your crew react?",
    "All of them?",
    "No, if it's so dangerous your crew left, count me out.",
    "Yes, I am a [man/woman] of my word.",
    "You won't...err...I mean ye'll not regret it Cap'n!",
    "No thanks, it sounds quite dangerous.",
    "Aye aye Cap'n!",
    "You seem rather surprised.",
    "Don't ye worry about me, Cap'n! I'm the scurviest, throat-cuttinest pirate to ever walk the mainplank! Arr!",
    "Let's go Cap'n!",
    "Can I just go grab something?",
    "Aye aye Cap'n!",
    "Well, it looks like they've found us Cap'n.",
    "What will you be doing?",
    "How?",
    "How do I get back?",
    "Arr! I'll hop to it Cap'n!",
    "Now to take care of that cannon!",
    "Just to clear everything up, what is it you want me to do?",
    "How do I make a rope swing?",
    "Aye aye Cap'n! One rope swing coming right up!",
    "How can I blow up their cannon?",
    "Arr! I'll blow that cannon sky high, sez I!",
    "Arr! I've blown their cannon to smithereens Cap'n!",
    "Will smearing swamp paste on the holes do?",
    "Arr! I'll have this ship ship-shape in no time! Arr!",
    "Errr...I may well have been caught up in the whole 'pirate' thing, and I can't seem to remember what I need to do now...",
    "Arr! I be rememberin' now Cap'n!",
    "The holes be plugged Cap'n!",
    "Aye!",
    "Arr! I'll plunder their booty and no mistake!",
    "Aye aye Cap'n! One plunderin' comin' right up!",
    "So...how many loads of plunder did you want me to get?",
    "Arr! I'll keep plunderin' till the hold be full of booty!",
    "Ahoy shipmate!",
    "Cap'n! I've put five loads of plunder in the chest, in the hold!",
    "I even had some left over!",
    "Can I have those back?",
    "Nothing...",
    "Are we all done now?",
    "How, the cannon is broken.",
    "I know what repairing is!",
    "How do I repair the cannon?",
    "And then what?",
    "What was I doing again?",
    "How was I going to do that again?",
    "Cap'n I...",
    "Yes.",
    "Yes, but if I forget I'll come and ask you.",
    "Well, not as such no.",
    "That would help to be honest.",
    "Aye Cap'n!",
    "Well, that seems to have showed them Cap'n!",
    "Aye Cap'n, we'll beat these pirates yet!",
    "How?",
    "Arr! I'll sink them scurvy dogs!",
    "Cap'n, I know I need to load and fire the cannon at the enemy ship...",
    "and I know I do this by adding powder to the cannon, tamping the charge with a ramrod, adding a cannonball, adding some fuse and then lighting it...",
    "And I also remembered your warning about cleaning the barrel after every shot to avoid the cannon exploding...",
    "But I've forgotten how many times I'm supposed to shoot the enemy ship...",
    "There is no need to shout...",
    "Err, Cap'n, can we go back to port?",
    "It's not that, I just need to grab something from the bank, that's all...",
    "No, I need to go back now.",
    "I'll try...",
    "Not yet.",
    "Well, I did shoot the crew with the cannon before we left.",
    "What?",
    "I am still here you know...",
    "Arr!",
    "So all I have to do is read this book and I'm a pirate?"
  ],
  "Pirate": [
    "Fancy a crumpet?",
    "Sorry, I mean...",
    "Arr! Run [him/her] through, sez I!",
    "Kill the landlubber!",
    "Kill the squid-lovin' dog!",
    "I'll have ye guts fer garters!",
    "Get off my ship!",
    "Te Davy-Jones Locker with ye!",
    "Prepare te die!",
    "I'm gonna kill ye!",
    "Garr!"
  ],
  "Mama": [
    "Bill? You look like you've been to Davey Jones's locker and back.",
    "I'll leave you two alone."
  ],
  "Congratulations! You have completed": [
    "'Cabin Fever' - Complete this quest."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Cabin_Fever?oldid=36139054’"
  ]
}