{
  "Pikkupstix": [
    "Hello there! Welcome to my humble abode. How can I help you?",
    "Well I do have something you could look into, although I don't know if I would call it a quest, as such. But if you do have some free time, could you look into the whereabouts of my two assistants, Scalectrix and Bowloftrix?",
    "Well, they are only slightly late compared to poor Feletrix... Actually they are quite late, to be honest. I sent them out this morning to gather supplies, and they have not returned. It is a little worrying. They were over by the old dry well in west Taverley, opposite the watermill. Could you take a look for me?",
    "Oh, I do hope so! Thank you my lad/lass!",
    "Oh no, this is terrible! Is Scalectrix all right?",
    "I...might well do. But it's risky. Although with you assisting me we might well do it. I sense deep wells of energy within you that you could tap. You might even survive!",
    "We are going to attempt a momentous feat of summoning! We are going to try and summon...a giant wolpertinger!",
    "A giant wolpertinger is a legendary spirit creature that can generate an aura of fear so potent that even a horde of trolls will flee in terror at its approach! Usually such a summoning would take a circle of experienced druids, but we have to clear out that horde before they attack. We will begin immediately. I need you to bring me a few things. I will need you to bring me my ancient wolf bone amulet, some white hare meat, and an embroidered pouch. I will also need to give you a blessed spirit shard, and a grey charm. The amulet should be with my assistant, Stikklebrix. He took it to White Wolf Mountain, which is the large range to the west of Taverley. The hare meat is available from the pet shop, which is on the bottom floor of the building to the south of here. The pouch is lost somewhere upstairs. I managed to lose it in a rather violent kafuffle. And, of course, I have the last two items here when you are ready for them.",
    "I gave it to my assistant, Stikklebrix, when I sent him over to White Wolf Mountain to bring me some wolf fur. For luck, you know. Although now I come to think of it, I haven't seen him in a while...what day is it again? Huh...that means he's been gone about a week. I do hope he's all right. Anyway, I'm sure you'll find him in good health. White Wolf Mountain is to the west of here. You will need to cross the river at the bridge to the south-west. I'd suggest taking some food. There are vicious wolves there. If you see one, then just run past it if you can.",
    "The pet shop owner in town has some. They import it for some of the more pampered pets, although to be honest more of it ends up on the plates of pet owners than in doggy-bowls. The pet shop is on the bottom floor of the building to the south of my house. I would go and get it myself, but after the bird seed incident we are not on speaking terms.",
    "It's in my room upstairs, somewhere. We lost it when Beezeltrix summoned that smoke devil.",
    "Oh, it was terrible! Really, truly terrible...I've never seen such...carnage and devastation! We have managed to clean up all the glass and soot, but I couldn't find it. Obviously a fresh pair of eyes will do the trick. Oh, and if you find a foot up there, do let me know. There's a good chap.",
    "Never mind! I remember where we found it now.",
    "Of course. Remember, these are EXTREMELY rare and precious, so I plead that you take good care of them.",
    "I hope you're right. These are very valuable relics.",
    "Yes...",
    "Rare and unique enough for me to enchant them to return to me if they were lost. So, imagine my surprise when I turn round and find them lying on my table.",
    "Save it. Take them back, and try not to drop them this time.",
    "Well, best of luck in your hunt.",
    "How goes the hunt?",
    "I see what I have heard about you is more than true! You've got everything right here! Now, before you go running off, let me do something...",
    "I have some spirit helpers that sometimes do tasks for me. In this case I just asked them to make sure that these items will all return to me if they get lost or damaged. Now, all you have to do is go and infuse them at the obelisk there. You won't have to worry about picking which pouch to make, as you know exactly what to make from these items.",
    "Well, you should come over here and let me inspect your work. You never know what could go wrong with such a monumental summoning effort like this one!",
    "What is it you need?",
    "I know. The spirits brought it back to me, covered in Guthix knows what kind of muck and slime. I don't know what you were thinking, but try and keep a hold of this one!",
    "Well it's a good job that I enchanted it. Keep better track of it this time.",
    "You mean the one my spirit helpers returned to me because you un-found it?",
    "Very effective.",
    "Well, you need to take those items over there and infuse them at the obelisk to make them into a giant wolpertinger pouch. I think that about covers it. Do you need any more help?",
    "Have you done it? Do you have the pouch?",
    "WHAT? One of the most potent summoning pouches of this era and you LOST it? Do you have any idea what this thing could do in the wrong hands? Any idea at all? You are lucky that I planned for this contingency. The enchantment I put on the items may well work now they have been combined into a pouch. Now, don't lose this one!",
    "Phenomenal! I knew I sensed great things in your future my assistant. Come, let me see it!",
    "I had never thought we'd have needed one of these in my lifetime. Well done. I think you are ready. Take this to Scalectrix. With her help, you should be able to summon this spirit beast and rout the trolls.",
    "No, no. The energy needed to summon this beast is too much for just one person. Even with the pair of you it will only last a few moments. But Scalectrix is strong too. Between you both you should be able to accomplish this.",
    "What are you waiting for? You have to get that pouch to Scalectrix as soon as possible!",
    "What? You've forgotten that she is over at the old well already? Maybe crafting this pouch took more out of you than I expected...I wonder if this is a symptom of melty-brain syndrome... yes, that could be it.",
    "Well, technically creating a pouch would not cause it. Nobody knows what causes it. You could be walking along, minding your own business, and then the next thing you know your brains are squirting out of your ears and nostrils. Like what happened to poor old Soltrix...",
    "Hmm? Oh yes, Scalectrix. That's where she is. Is there anything else?",
    "Good idea. If you do have BMS then keeping your head steady until your brain congeals is the best plan. Anyway, is there anything else I can help you with?",
    "What are you waiting for? You have to get that pouch to Scalectrix as soon as possible!",
    "What is it? I can't hear you.",
    "What was that? You LOST the giant wolpertinger pouch?",
    "And you want me to get it back for you?",
    "Now, don't loose this one!",
    "You are right, it has been pretty hard since the war started.",
    "It is a mixture of both, really. To be honest, I have always found that my assistants have had a lot of eagerness and a lot less common sense for self-preservation. Now, let me see...You already know about Stikklebrix...who else was there? There was poor Lunatrix, who went mad. He tried to commune with the elder spirits, and they were not happy. Last I saw of him, he went running out of the door with his pants on his head... Then there was Ashtrix. He managed to cut his own hand off, the poor fool. It would have been alright, except he then managed to wedge a hacksaw in the stump, and in his delirium wouldn't let anyone help him. Then there was Spartrix, who was captured by the Black Knights and taken as a slave. I hear that he tried to lead a slave rebellion. Which, while noble in itself, is not really the sort of thing a 5-foot, sickly, bookish druid should do. Especially when unarmed and facing evil knights in full plate mail. Let's see...there was Beezeltrix and the smoke devil; we literally lost Feletrix; those trolls took the twins when they were healing soldiers on the front line. And the less said about Hastrix, the better!",
    "It has been one heck of a busy week, I can tell you. Now, is there anything else you need?",
    "Well done! I heard the news! You've saved my assistants from a fate worse than death!",
    "No, I'm afraid not. The pieces you used were rare...unique in some cases. But in the end they were all used up for a good cause. And it did take a hero like you to bring it about.",
    "What was that?",
    "Anyway, once they are rested, I'll be sending those two off to gather some of those highly poisonous weeds that I need for my research. They grow in a pretty dangerous place in the wilderness. Tell me, would you like to be my assistant as well?",
    "Strange...that's what most people say when I ask them that."
  ],
  "Player": [
    "Hello there, I'm [player name], the adventurer. Do you have a quest for me?",
    "Why, have they gone missing?",
    "All right, I am sure they are fine. They are probably just taking their time, or maybe stopped for a chat.",
    "Hey, are you Scalectrix; the assistant to Pikkupstix?",
    "He sent me to find you, apparently you were supposed to be back a while ago.",
    "Trolls! Where are they?",
    "All right you trolls, let the druid go! Wow...there certainly are a lot of you...",
    "I warn you, you'd better let him go!",
    "Uh...that's a bit unexpected.",
    "Bowoloftrix! Don't worry, I'm going to go and get help!",
    "All right. Wait here, I'll be right back.",
    "Ok, let's try this again!",
    "You know, I remember there being fewer of you last time around.",
    "I warn you, you'd better let him go!",
    "Uh...that's a bit unexpected.",
    "Bowoloftrix! Don't worry, I'm going to go and get help!",
    "The...plan?",
    "Oh! That plan! Sorry, I still need to speak to Pikkupstix to find out what he has in mind.",
    "Hey, you can't rush heroism. I'll be right back.",
    "Bowloftrix has been kidnapped by trolls!",
    "Yes, she is keeping an eye on the trolls by the well. She says there are too many trolls to attack directly. She tried scaring them away, but a spirit wolf didn't work. Do you have anything more powerful that could work?",
    "Well thanks, I..., ...I might what now?",
    "How will that help?",
    "What happened to her?",
    "A foot? As in a 'foot' foot or a foot of something?",
    "Well, you know, I'm pretty skilled at holding things. I should be able to keep this safe.",
    "I think I had better go.",
    "Okay that pouch has to be here somewhere.",
    "Hello there, do you sell white hare meat?",
    "That's all very interesting, but do you happen to have some white hare meat I could have? It is an emergency.",
    "Can I use your shop?",
    "Theoretically, HOW rare and HOW unique were they?",
    "Ahaha...funny story...",
    "I think I had better go.",
    "Pikkupstix wants me to summon a giant wolpertinger to scare off the trolls. Do you think that'll work?",
    "Yes, that is what I am looking for right now.",
    "I have the items all here!",
    "What was that about?",
    "Then what?",
    "I need to ask you something about the quest.",
    "I lost the amulet.",
    "I put the meat down for a second and it vanished. I think wolves took it.",
    "Oh hey...you remember that pouch I found?",
    "Yeah, that one...",
    "That enchantment that you cast on all those valuable items you gave me. How effective was it?",
    "Uh, well I'd best be going now that I got these back...",
    "Nope, I think I can handle that.",
    "I should check with Pikkupstix that this is how it is supposed to look.",
    "Well, between here and the obelisk I may have sort of managed to lose it...",
    "Here it is.",
    "So can't I do this on my own?",
    "Melty-brain syndrome? What...why didn't you tell me I could get that?",
    "Uh...the old well, right?",
    "Uh, no. Not right now. If you need me I'll be delivering this pouch, and then trying not to shake my head around too much.",
    "Mumblemumble...",
    "Mumblemumble...",
    "Mumble?",
    "Mumble...",
    "You really seem to have had some problems with your assistants.",
    "Well what's happened? Have the trolls been killing them, or has it all been down to accidents?",
    "Wow... you really haven't had much luck with assistants.",
    "I have made a giant wolpertinger pouch, and I'm all ready to save Bowloftrix.",
    "Of course, here it...",
    "...",
    "...uh, give me a minute...",
    "I have a giant wolpertinger pouch. Here, take a look.",
    "Come on. Let's get Bowloftrix before he becomes a bowl of Bowloftrix.",
    "Alright, trolls. Time for round two!",
    "You want to eat something? Chew on this, you filthy animals!",
    "Quick! Let's get Bowloftrix, before they regroup.",
    "Well let's get Bowloftrix and get out.",
    "No problem, I'm just glad we got you out of there before you were badly injured.",
    "He seemed to run quite quickly for a man with a cracked rib.",
    "Yes, that giant wolpertinger really made the difference. Say, do you have the parts needed to summon it again? I'm sure it would come in handy.",
    "Darn...Oh well, at least Bowloftrix is safe... ...for now.",
    "Nothing.",
    "I have to go! Look at the time! My oven is on and I need to feed the cat!"
  ],
  "Scalectrix": [
    "Yes! How did you know that?",
    "Well, I would have come back, but Bowloftrix has been captured by trolls! I've been waiting here for someone to come and help me!",
    "They're in this well. But don't go in there! There are way too many to handle! We need something to keep them at bay or to break them up; something that will scare them. I tried using a spirit wolf, but they just laughed. The leaders seem immune to the howl of the spirit wolf...but without something to thin their numbers we'll never get Bowloftrix back! Please, sir/madam, can you let Pikkupstix know what has happened? I'm sure with your help he can come up with something to drive away these trolls.",
    "Be careful!",
    "So what's the plan?",
    "The plan! The plan to save Bowloftrix!",
    "Well could you PLEASE hurry up?",
    "So what's the plan?",
    "A giant wolpertinger? That'd scare the heads off the King Black Dragon, never mind these trolls! But you'll have to get some pretty unique items to make it work...",
    "Oh? Then I won't take up any more of your time. Guthix speed your progress, hero!",
    "You're back! What's the news?",
    "That's wonderful news! Can I see the pouch?",
    "Oh...of course.",
    "A giant wolpertinger pouch...I never thought I'd see one. With just the two of us it'll be a stretch, and we'll only be able to summon it for a few seconds, but that might be all the time we need.",
    "This is it, get ready!",
    "Yes! Feel the true power of the Druids!",
    "Yes, the wolpertinger won't last long.",
    "In fact, there it goes...",
    "Oh dear...I hope he's all right.",
    "Well he/she is the one you should really be thanking. Without him/her we'd never have been able to call the wolpertinger.",
    "Especially as that means you'll be able to come back and help with Pikkupstix's next project.",
    "Oh, you poor man! Go see the healers before you faint!",
    "Maybe he was in such pain he wanted to get there quickly. Anyway, he's alive and well, all thanks to you!"
  ],
  "​Player": [
    "Look, I'll just go and take a look myself. I am trained for this sort of thing, after all."
  ],
  "Wolf Meat": [
    "Hur hur hur, more food come to us!",
    "Specially not if we cut 'em into little bitty bites!",
    "Lookit! There's a little puppy!",
    "Hur hur hur, more food come to us!",
    "Specially not if we cut 'em into little bitty bites!",
    "Lookit! There's a little puppy!",
    "It's da girly dat had da woof! We gots more druid meat 'fore da big fight, lads!",
    "It scaring me! Why it scaring me?",
    "It messing with Wolf Meat's brains! It in my head! Make it stop!"
  ],
  "Wolf Bones": [
    "Or what? Wolf Bones tink you're not gonna last long!",
    "Stoopid Hooman! We's been eatin' wolves fer breakfast since we wus tiny! We's not scared of dem!",
    "Or what? Wolf Bones tink you're not gonna last long!",
    "Stoopid Hooman! We's been eatin' wolves fer breakfast since we wus tiny! We's not scared of dem!",
    "Har har har! A big bunny! Dat's not scary at all!",
    "Lef it! It going to eat us all!",
    "Wolf Bones need his mummy!"
  ],
  "Bowloftrix": [
    "Please hurry!",
    "Please hurry!",
    "Thank you both! I was a gonner[sic] until you showed up!",
    "Yes, thank you very much, hero!",
    "Uh...well...yes... Oh! Ow! Ow! I think the trolls cracked one of my ribs! I should get that seen to...right away!"
  ],
  "Infobox": [
    "Pikkupstix carefully hands you the grey charm and blessed spirit shard.",
    "You take the amulet from the sad remains of Stikklebrix.",
    "Pikkupstix carefully hands you the rare summoning items.",
    "This amulet is fragile and precious. If you drop it the spirits will take it to Pikkupstix, who will not be happy.",
    "These items are some sort of precious relics. If you drop them then you will need to speak to Pikkupstix to get more.",
    "This pouch is needed to save Bowloftrix from the trolls. If you drop it the spirits will take it to Pikkupstix, who will not be happy.",
    "This meat is pretty important. If you drop it the spirits will take it to Pikkupstix, who will not be happy.",
    "You craft the giant wolpertinger pouch. It thrums with barely contained power.",
    "This pouch is a unique and powerful artefact you need to save Bowloftrix. If you drop it the spirits will take it to Pikkupstix, who will not be happy."
  ],
  "Pet Shop Owner": [
    "Yes I do! I stock it as a treat for the animals, but some people round here snap it up for themselves! Waste not, want not! I get it imported from a very reputable trapper in Morytania called Rufus. He always knows how to get the best meat for the animals and ships it pre-skinned, boned and cut. White hare, basilisk, chinchompa, veal...",
    "Well if it is an emergency I suppose I can let you have some. I hope things work out for you! Is there anything else I can help you with?"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Wolf_Whistle?oldid=33490202’"
  ]
}