{
  "Linza": [
    "Player! Thank the gods you're here!",
    "Kidnappings! Someone has been kidnapping people from Taverley and Burthorpe!",
    "They've taken Brother Samwell, Major Rancour and Meg! They just...vanished! We need your help!",
    "Not much. They always vanished when they were either alone or out of sight of others. There is one clue; Relomia, the emissary of Sliske, was seen just before the last person was taken. She seemed...shocked.",
    "Thanks, Player, I'll come with you to help.",
    "Uh, all right?",
    "Not much. They always vanished when they were either alone or out of sight of others. There is one clue; Relomia, the emissary of Sliske, was seen just before the last person was taken. She seemed...shocked.",
    "Thanks, Player, I'll come with you to help.",
    "All right, there she is. You take the lead and I'll see what I can do to help.",
    "This is serious!",
    "I'll meet you there, Player.",
    "I'll meet you there, Player.",
    "Let's head to Daemonheim as soon as we can!",
    "I found something! This trapdoor wasn't here last time I came by this area.",
    "What?",
    "Maybe it's disguised?",
    "It's still worth checking out though. Don't forget we may not have access to a bank when we find the Dragonkin, so you'll need some free space to carry anything we find.",
    "We're about to head down into what might possibly be a secret Dragonkin complex...are you ready for this?",
    "Ok, I'll be here. Just let me know when you're ready.",
    "It does seem abandoned.",
    "Do you think Relomia was confused?",
    "That would make sense.",
    "Yes, the brothers have been guarding us but we're all right.",
    "Player, are you sure about this?",
    "This place gives me the creeps. Hey, can you hear the sound of someone fighting?",
    "This whole situation is just... I have no words really. Let's get this over with as fast as we can.",
    "I don't want anyone hurt here, but let's be realistic. Ahrim is a wight, he's already undead. Wouldn't it be better to hurt him, rather than risk one of the hostages?",
    "No, listen Ahrim, Player has a good point. The pain now will numb you to any pain later, so it'll be easier to cope with.",
    "Coward.",
    "Coward.",
    "You can't be serious. He's an undead wight and a warrior, he can suck it up. He won't die, one of the others might.",
    "No. This is your 'lesson' Ahrim, don't make someone else suffer because you're too weak to take the pain.",
    "I know it's hard on Ahrim, but this is HIS challenge. Surely he should suffer and not someone else?",
    "Do your worst Mahjarrat, I'm not afraid of your games.",
    "But what about the others who will be hurt in your place?",
    "AAAAAAAAAARGH!",
    "AAAAAAAAAARGH!",
    "AAAAAAAAAARGH!",
    "AAAAAAAAAARGH!",
    "AAAAAAAAAARGH!",
    "AAAAAAAAAARGH!",
    "AAAAAAAAAARGH!",
    "AAAAAAAAAARGH!",
    "AAAAAAAAAARGH!",
    "I know he's hurting, but we've come this far. Let's not make an innocent suffer for him.",
    "But what about the others who will be hurt in your place?",
    "AAAAAAAAAARGH!",
    "Come on Ahrim, you're nearly there, just fight through it.",
    "AAAAAAAAAARGH!",
    "AAAAAAAAAARGH!",
    "AAAAAAAAAARGH!",
    "AAAAAAAAAARGH!",
    "AAAAAAAAAARGH!",
    "AAAAAAAAAARGH!",
    "AAAAAAAAAARGH!",
    "AAAAAAAAAARGH!",
    "AAAAAAAAAARGH!",
    "AAAAAAAAAARGH!",
    "AAAAAAAAAARGH!",
    "AAAAAAAAAARGH!",
    "But it's nearly over, he can shoulder this burden a little longer.",
    "Come on Ahrim, you're nearly there, just fight through it.",
    "AAAAAAAAAARGH!",
    "Monstrous. Only one person should be hurt.",
    "You've barely been hurt! Everyone else has suffered on your behalf.",
    "I don't want anyone hurt here, but let's be realistic. Ahrim is a wight, he's already undead. Wouldn't it be better to hurt him, rather than risk one of the hostages?",
    "You've barely been hurt! Everyone else has suffered on your behalf.",
    "A what key?",
    "Another one?",
    "Of course you do...",
    "Psst...guys, get in here and block the masks so Sliske can't see Player is busy.",
    "What is this?",
    "...",
    "Why didn't you help block the masks?",
    "Who is that knight?",
    "You know, you're taking this 'outed Zamorakian' thing a little too seriously.",
    "Fair enough.",
    "Guthan, you have to let it out. Your brothers will suffer if you don't. That's the whole point of Sliske's games; to make people suffer. Dharok couldn't stop himself bullying others until he let them kill him. Ahrim couldn't move on until he too accepted punishment for what he did. And Verac was suffering because he didn't want to admit his worship of Zamorak.",
    "What?",
    "I don't know. We'll need to buy [him/her] as much time as we can.",
    "This looks like it'll be the last. These are the last brothers at any rate.",
    "A fair point. I guess we'll just have to tough it out and help Player as best we can.",
    "What's the matter?",
    "Wow, I didn't know you felt this way. I guess some people might have the same thoughts about me. I mean, someone spends all their life learning to smith and then I come into town and everyone starts cheering for me, not them. If the best material you have to work with is steel and then I appear and hammer out some rune or even dragon weapons without breaking a sweat... And don't you give me that look either. I know that what I do is hardly keeping a town safe from trolls for your entire life.",
    "What?",
    "Yeah, but the price...",
    "I know...I'd best get moving in case Sliske is listening in.",
    "You too, Major.",
    "Meg, why are you shouting?",
    "Meg, I know you're nervous, but you have to calm down.",
    "Take a deep breath, hold it, and release.",
    "We'll be fine, trust me.",
    "Practice, Meg. Practice makes perfect.",
    "Uh...",
    "That's a lot of questions, Meg.",
    "Evil?",
    "But look what happened with the barrows brothers. Sliske betrayed them. Trust me, there is no shortcut to power that is worth it. If you steal from the wrong people or enter into hasty deals then you'll regret it.",
    "No buts, Meg. Don't take any offer Sliske makes to you. Now, I'm going to see what I can do before Player gets back.",
    "Guthan, what is this lever for?",
    "Why would you do this?",
    "Uh...",
    "I think I should wait for Player to get back before I do something like that.",
    "I think I should wait for Player to get back before I do something like that.",
    "You know, I think I can probably take the front off this box. Then I can get to the guts of this machine and set off both barriers at the same time.",
    "Not if I do this right.",
    "...",
    "Meg...",
    "Stay back! He's too powerful!",
    "Sliske!",
    "I had to! You don't understand!",
    "They were hunting me! I had to do something!",
    "I had to do it! If people found out then what would happen to me? You, Player, the world guardian, you go around punishing thieves like me who endanger the rest of the world. I had nobody else to turn to. I didn't know about the staff, I swear!",
    "No!"
  ],
  "Player": [
    "What's the matter?",
    "What?",
    "I'll help any way I can. What can you tell me about these kidnappings?",
    "I'll speak with her and see what she knows.",
    "Sorry, but I have a world to guard...ian at the moment. I'll get back to you when I'm free.",
    "What can you tell me about these kidnappings?",
    "I'll speak with her and see what she knows.",
    "All right, Relomia, what are you and Sliske up to?",
    "...wait, what?",
    "Well...",
    "I think I'll take a nap, grab some lunch and just relax. Woo!",
    "Are more than welcome to keep that giggling manipulative son of a...",
    "...you know, I hadn't thought about that. I guess I will need to do something.",
    "I think I'll take a nap, grab some lunch and just relax. Woo!",
    "Are more than welcome to keep that giggling manipulative son of a...",
    "...you know, I hadn't thought about that. I guess I will need to do something.",
    "So what happened, exactly?",
    "I guess I'll have a look around there and see if I can find a way in.",
    "Where should I start looking?",
    "I guess I'll have a look around there and see if I can find a way in.",
    "Um...",
    "This doesn't really look like a Dragonkin lair. It's just a regular trapdoor.",
    "Maybe? It just seems a little incongruous.",
    "Good thinking.",
    "Hmm, a trapdoor down into Daemonheim? I don't remember this being here before.",
    "Where is everyone?",
    "Is this really where they took Sliske?",
    "Maybe they are in the shadow realm?",
    "S...Sliske?",
    "Sliske? Where are we? And where are the others?",
    "But where are the others?",
    "I don't have time for your passive-aggressive nonsense, Sliske. What do the Dragonkin want?",
    "We have to stop them!",
    "Ha ha. I'm going to see if I can find a way out of here.",
    "All right, Sliske, I have an idea.",
    "First, I need you to let me punch you in the face.",
    "Ok, hear me out. If we can brawl, then maybe the guard will come into the cells. If that happens maybe we can grab some keys or something to unlock them.",
    "Because...uh...",
    "Take that, Sliske!",
    "Hmm, the guard doesn't seem to be reacting. Maybe if I hit you again?",
    "Ow!",
    "Actually, I have another idea now.",
    "Well, after our little fight I'm injured, and what do injured people do?",
    "...no. I'm going to get the guard to deliver some food so I can heal.",
    "No! When he comes into the cell or gets close I'll try and steal the keys!",
    "If I can get the guard to come over here I might be able to steal a key or weapon. Hey! You!",
    "Hey, you there!",
    "I don't think I can get them to come over by myself. But I bet they might break up a brawl between me and Sliske. With the added bonus that I get to punch Sliske in the face!",
    "Give us some food!",
    "Hey, I know you can hear me! Give me some food!",
    "You know, I have an encyclopedic knowledge of nursery rhymes and a singing voice that can only be described as grating. I also have capacious lungs and endless stamina. In combination these things can make guarding me...uncomfortable.",
    "If you give me some food I promise not to sing 'The littlest pyrefiend' at the top of my voice on an endless loop.",
    "No, I just got a plate of this gooey stuff. I don't think eating it will be safe. But the plate...if I can break it in half and sharpen it, maybe I can make it into a tool or a weapon. I'll need you to distract the guard though.",
    "Just give it a try, Sliske. I'm going to scrape this gunk down the latrine.",
    "I lost the plate of food.",
    "Why do you have more dragonkin[sic] food?",
    "Player: I was wondering if you wanted to eat this food rather than let it go to waste down the latrine.",
    "Fine, but don't say I didn't offer you anything.",
    "Wait a minute, that gives me an idea!",
    "I lost the tin plate.",
    "How did it end up in your cell?",
    "Keep distracting the guard; I have an idea. The food I scraped into the latrine seems to have reacted with the waste down there. If it is acidic or volatile then maybe I can use it to melt through the lock!",
    "Well, now I have a brick, and these plate halves are a bit more useful I guess.",
    "I lost the bits of tin plate.",
    "What were they doing in the latrine?",
    "I lost the brick.",
    "Why do you have a spare brick?",
    "...",
    "I lost the other half of the plate.",
    "Wait, you shave?",
    "I lost the sharp plate.",
    "How did it end up in your cell?",
    "I think we'll leave suicide out as a solution for now. However I don't think this knife will make much of an impression on the guard or the lock. I actually think it'll only hold an edge for one cut, and there is not enough plate left to grind another one.",
    "Hmm, this gives me an idea.",
    "I lost the cloth strip.",
    "Don't you need these?",
    "Actually I think I can use this to get us out of here. Specifically, I need you to get that potion up on the wall there.",
    "I can probably attach something to it to make it heavier. Give me a second.",
    "Linza will be extremely proud of my weapon-crafting.",
    "I lost the flail I made.",
    "Why did you make another one?",
    "Sliske, I need you to use this to get the potion off of that shelf.",
    "Right now, yes. So get me the potion!",
    "Now might be a good time to pick the Dragonkin's pockets...",
    "I lost the potion.",
    "I don't remember that, are you sure?",
    "I lost the bag of crystals.",
    "Where did you find them?",
    "Karma?",
    "Nothing.",
    "Actually I might need that.",
    "I do need it actually.",
    "Because it turns out that this potion and the thing I lifted from the Dragonkin are just reagents, which I am pretty sure I can use to make acid in the latrine. And I need the strip to make a facemask to stop myself inhaling deadly fumes.",
    "I'm trying to get us out of here. The things I got from the guard will let me make a powerful acid in the latrine.",
    "Looks like this will make short work of the lock. But I need something to get the acid out without burning my hand.",
    "If this does work then the acid will give off enough fumes to knock me out. I need to cover my face with something.",
    "I lost my bottle.",
    "Wait, this is empty!",
    "That's the acid. Or, more accurately, the smell of the acid eating into the stone of the latrine.",
    "I lost the vial of acid.",
    "Wait what? How did that get there?",
    "I have the acid!",
    "Not yet; I need you to distract the guard.",
    "Wait, you don't need to antagonise him. Just take this plate and redirect the light at him. I don't think he'll come in here and attack you, he'll likely just look away to stop being annoyed. Besides, if he does attack you, I'll throw this vial of acid at him.",
    "That's good news.",
    "Good point. Back in a second.",
    "We're free! I'd best let Sliske out.",
    "Uh...[sic] No time to worry about that now, I need to talk to Sliske.",
    "Sliske, let's get out of here!",
    "No! Let's get going so we can save the hostages and get the stone of Jas back to your...[sic] ...and you have no idea how sick this makes me to say...[sic] ...safekeeping.",
    "Sliske, what are you talking about, the Dragonkin have them!",
    "Yes, you told me they...[sic] And now I am on the same page. You lied to me.",
    "The Dragonkin don't have the hostages?",
    "It's a pretty elaborate costume.",
    "And you were never kidnapped?",
    "Sliske, I am going to leave now.",
    "What about them? And I mean that in the 'what about the barrows brothers' sense. The hostages I do care about.",
    "Nice outfit!",
    "Nice outfit!",
    "Any idea where I could get a raven-like one?",
    "Come on, help a ravensworn out.",
    "Fine, be like that. I'll make my own outfit and it'll be so much cooler.",
    "Linza, are you all right?",
    "Why do you think I'll do this, Sliske? This is madness. Worse, this is nonsense! What is the point of all this? Just to get me to jump through hoops?",
    "More of...?",
    "You'll what?",
    "No, not even slightly. But we don't have much of a choice right now. Everyone, keep your eyes out for a way to escape as we progress. The sooner we can get out of here the better.",
    "Where is this place?",
    "What's going on?",
    "What can I do?",
    "Really?",
    "Well it does; if you die they will stop attacking.",
    "Yes, but he hasn't beaten you completely.",
    "Um...",
    "Just lay down your weapon and let them kill you. I'll collect your body and you can regenerate in peace.",
    "Think about it. Strong enough to be weak? That's some high-class self-help advice right there. If I was a mystic you'd be lapping this stuff up.",
    "I should speak to Dharok first.",
    "What is this? I'm inside the champions head. I guess I will have to steer them to fight Dharok.",
    "Hey Dharok, try picking on someone...a lot bigger than you.",
    "Moving on!",
    "Exciting?",
    "So what now?",
    "I meant to do that.",
    "Ahrim? Now's the time to come clean. This is your chance of redemption.",
    "Look, it's done, you've all been punished enough, surely. What good can come of fighting about this?",
    "I'm going to investigate behind this door.",
    "Yeah, so much fun.",
    "Keep cool everyone.",
    "What?",
    "But why has he done this to you?",
    "But the Zamorak keys will only be forged from pain.",
    "But now his 'light' is tearing you up inside.",
    "But where is the key?",
    "I need a key to release this statue's hold on Verac.",
    "I need a key to unlock this.",
    "I need a Zamorak key.",
    "Verac is strung between two statues. I need to unlock the statue of the god who does not have a claim on him.",
    "One of you will have to put your hand into the key maker, and Sliske says it will only work with pain.",
    "I'm sorry guys. But I need that key.",
    "The last one broke.",
    "I don't know what to tell you.",
    "I need a Zamorak key.",
    "Maybe just one more key?",
    "It broke!",
    "It broke again.",
    "I didn't feel anything...",
    "The key broke again!",
    "But that means...",
    "I didn't!",
    "I am not! The keys keep breaking!",
    "The key broke. This isn't working.",
    "I've got to get the Saradomin key. There is no other way!",
    "I'm sorry.",
    "I will go as quickly as I can.",
    "I can't feel it!",
    "I have to pull harder. I'm sorry. I'm sorry!",
    "Good point.",
    "Verac, are you all right?",
    "Sarcasm, that means you're good to go. Look, I want you to help me. Go out that door and tell Linza to keep playing Sliske's game. I'm going to explore that tunnel the falling statue opened up. If it leads outside I will come and get you and the hostages.",
    "This looks important, I probably shouldn't touch it until I've looked around carefully first.",
    "This object is radiating magical power, I can feel my bones tingling as I step near it. This must be some sort of focus for Sliske's control over the shadow realm. Hmm, I have an idea...",
    "I'm here, Sliske. I just stepped out of the room to get something from Verac's chamber. Right guys?",
    "Really?",
    "Sliske, you are being too reasonable.",
    "What's the matter, Sliske? Not what you were expecting?",
    "Sliske, this is over. I'm leaving. Linza...",
    "Uh...",
    "'Cough' - urgh!",
    "Linza...",
    "Run, the roof is coming down!",
    "I feel a little odd, but that's about it.",
    "Dharok? What are you doing up here?",
    "Thank you for that, Dharok. What now?",
    "I'll do what I can when that happens."
  ],
  "Relomia, Emissary of Sliske": [
    "Help me! Sliske's been kidnapped!",
    "The Dragonkin; they found a way to do something to him! He's powerless!",
    "But, Player...",
    "But Player, the Dragonkin...",
    "...and the Stone of Jas?",
    "But, Player...",
    "But Player, the Dragonkin...",
    "...and the Stone of Jas?",
    "Thank you.",
    "I'm not sure. Sliske sent me a message from the shadow realm. I saw him being surrounded by Dragonkin and stripped of his power. He sent me a message to go and find some people in Taverley and Burthorpe. The Dragonkin planned to kidnap them too for some reason. But I was too late! They used the shadow realm to spirit them away! I know they haven't found the stone yet, but it is only a matter of time. You have to do something.",
    "That's your decision. Just hurry!",
    "Thank you!",
    "The last message Sliske sent me said he was in a Dragonkin prison near Daemonheim.",
    "Hurry, Player. I don't know how long Sliske can last!",
    "The last message Sliske sent me said he was in a Dragonkin prison near Daemonheim.",
    "Hurry, Player. I don't know how long Sliske can last!"
  ],
  "Sliske": [
    "Well done, Player, you certainly managed to 'save' me from my escape attempt.",
    "We're currently in a slightly less escapable Dragonkin prison. I would be more precise but it seems our hosts have learned a few things from my last escape. Now our guard won't even speak to me, which means we get to spend some quality time together!",
    "I think they were taken deeper into the lair. I was going to look for them but then I thought 'Hey, Sliske, your escape is far more important'. And how well did that turn out, again, Player?",
    "I have no ide...[sic] Oh all right, I can't even say that with a straight face. They want what they always want; the Stone of Jas, as well as death to all the False Users. And thanks to some particularly daring scheming they have the former and are likely planning the latter.",
    "We need to escape and gather our power...and an army of wights to come down here and...[sic] ...wait! I tried that and got blocked by an idiot.",
    "Great, let's hear it.",
    "I am now slightly less enthused about this plan.",
    "Right, but why does that mean you have to punch me in the face and not the other way around?",
    "You know what? That's fair enough.",
    "Ow! That was right in the eye!",
    "Hey! What? Ow! I think my lip's bleeding!",
    "No! Maybe he'll react better to this?",
    "No reaction? Oh well. Looks like your plan didn't work out after all.",
    "Good, but I'm not going to get hit again.",
    "So what now?",
    "Die? Oh, I know! Get used as a living shield!",
    "Fantastic. And you're going to eat until you get so fat you crush the floor under your weight, making me a tunnel to escape?",
    "Actually, that is a sensible plan. If a little dull by comparison.",
    "Do it you fool! [He's/She's] not bluffing!",
    "How did it go, Player? Did you get the keys?",
    "Distract him? How?",
    "That's your plan? You really are one saucy devil, Player.",
    "So, not content with punching me in the face now you want him to do it?",
    "Really? Maybe I should get him a milky drink and a blanket while I'm at it?",
    "Are dungeons your thing? That's cool.",
    "Do you come here often?",
    "So...how you doin'?",
    "You know...I'm a scaly.",
    "Your scales look fantastic.",
    "...and that's why your face is dumb.",
    "...and the horse you rode in on.",
    "...and spin on it until you get dizzy.",
    "...which is what your mother said last night.",
    "...which is why you are stupid.",
    "Once upon a time...",
    "...and the littlest pyrefiend was very sad...",
    "...but in the chest there was only a golden whistle...",
    "...'those aren't my trousers', he said...",
    "...and they all lived happily ever after.",
    "Here, have some from my stash.",
    "I have no idea how long I will be down here, so I've been hoarding in case they try and starve me.",
    "What now? You're distracting me from distracting the guard.",
    "No, Player. I don't feel like eating that gelatinous glop.",
    "Yes, I found it on the floor of my cell. Here you go.",
    "I must have charmed it over with my magnetic personality!",
    "What now, Player?",
    "That's...vile, but might work. Remind me to shake your hand when we get out of here, but only after you have washed.",
    "Well I fished these out of the latrine. Have fun.",
    "What do I look like, the plate whisperer?",
    "I'm sorry you were outsmarted by a rock. Here, have a brick to make up for it.",
    "I have a plan to build an even smaller prison and lock myself inside so the dragonkin can't get me.",
    "I see you managed to break that plate in half. Is your plan to put them back together then climb through the 'whole'?",
    "...[sic] You're right to sandbag that one, Player. Can you hurry up with whatever whacky scheme you're doing? This place is making me stir-crazy.",
    "Well you can have this one I have been using as a shaving mirror.",
    "Not my face, obviously.",
    "I know! I tripped over it and almost cut my toes off!",
    "Your carelessness!",
    "What are you going to do with that knife?",
    "Oh, are you going to kill yourself and respawn to get help?",
    "Then you'd best cut something important.",
    "Here, use this strip of cloth from my undergarments.",
    "Oh don't worry, I usually go naked under this robe. Live free, let 'em breathe, that's how I roll.",
    "I see you have a strip of cloth. Truly a weapon to make the walls of this prison come tumbling down. Oh wait, maybe you will put it on as a headband and break out some of that fancy Eastern-Lands dance fighting they do?",
    "I can give it a try, but that strip looks far too flimsy to make a good noose.",
    "Don't worry, I made a spare.",
    "I...actually thought it looked kind of cool.",
    "Is this the best you can come up with, Player?",
    "Fine, fine! Give me your brick-on-a-rope and let's get this over with.",
    "No you didn't, you gave it to me, remember?",
    "If you didn't then how did I get this potion?",
    "You mean this bag?",
    "I don't know...",
    "My face! Why is everyone hitting me in the face today?",
    "What was that, Player?",
    "In other news, he left this cloth strip behind. I guess I can use it to bind my wounds.",
    "Might or do? Because, you know, facial wounds and such.",
    "Why?",
    "Well fine, have it. But this plan of yours had better work.",
    "What are you doing, Player?",
    "There is a joke here, but I am too sophisticated to make it.",
    "Well if you are going to chicken out why not take a drink of this?",
    "I may be slightly drunk, I'm just throwing that out there.",
    "Cough, cough! What is that smell? Are you brewing 'rum' over there?",
    "Urgh, well can you hurry up and get us out of here? That smell is making my throat itch. And some of us don't have the luxury of a cloth strip to breathe through!",
    "Try checking your backpack.",
    "It was there all the time. The true acid was within your heart, Player.",
    "Great, let's get out of here.",
    "I am not getting punched again!",
    "Fine, give me the plate.",
    "Well he doesn't seem to like being blinded. And he hasn't come to beat me yet.",
    "Anyway, don't you have a lock to melt?",
    "Why so hasty, Player.[sic] You all done here? Maybe you'd like to try tricking the guard into drinking from the toilet or something?",
    "The hostages are fine, Player, slow down.",
    "Do they?",
    "Oh yes.",
    "Nope. That isn't even a real Dragonkin out there. It's just a wight in a costume.",
    "I know, right? I didn't even make it, he just had one.",
    "Nope. I just grabbed a bunch of people for my scheme and got my fangirl to lure you in. And let me say, your performance was exemplary. I was on the edge of my seat the whole time!",
    "But what about the hostages and the barrows brothers?",
    "Exactly! Now join me through that door and find out why I brought you here.",
    "No, I will release you gradually!",
    "While you're trying to figure that one out, here's how this is going to go. In a moment I am going to transport the barrows brothers to different places within my vault. Not a particularly impressive display I know. But, there's more! I'll also give them back their souls and free will! And then I'll torture them all. And trust me, I know how to get right under their skins. But there's still more! You, Player, get to go in there and rescue them. You'll learn all their darkest secrets, and you'll get to hurt them as badly as I have...or forgive them if you're feeling merciful.",
    "In reverse order; not exactly, it's a secret. No it isn't, it kind of is...and because I'll kill more of the hostages if you don't.",
    "You see, there is a reason for all this, Player. Two, in fact. The one you'll get now is that I'll present you the staff of Armadyl when you are done.",
    "You'll get the staff of Armadyl. So you can use it to go stabby-stabby on some of the gods if you want. Basically the way things are unfolding is dull. Deadly, bone-numbingly dull. So, I thought to myself; who's likely to be able to liven this whole thing up a little? And your name popped right into my head! As such, I'm going to torture the barrows brothers, and you're going to play along with my little game to set them free or hurt them harder. And if you mess up or stop being entertaining I'll kill more of the hostages. But if you do keep me entertained, you get the staff and everyone goes free! Aside from the barrows brothers, I mean.",
    "That's the spirit! Ok then, on with the show!",
    "My game isn't stupid, Player, you'll see that very quickly. Now, let's get moving!",
    "There's no need for sarcasm, Player. Let's get going.",
    "This is just one of many fun little corners in my vault. If you want more of an explanation, just go speak to Dharok in the fighting pit over there!",
    "This is Dharok's punishment. You see, Dharok loves this kind of thing. He loves nothing more than crushing foes so weak they can't even hurt him back, isn't that right, Dharok?",
    "That's a lie and we both know it. You made life miserable for the weak and powerless in your village when you were a mortal.",
    "Well that's all well and good, but now you get to change back. You see, Player, now Dharok is under attack by weaker foes. They won't let him be because if they don't give it their all I'll do...unpleasant things to their loved ones. So he has to crush them, over and over, like he used to do until he likes it again. Unless you feel like doing something about it, that is.",
    "Well, there is a champion of Saradomin that can defeat Dharok. You could let them out. I am sure they are more than angry at seeing what he has been doing to his friends. If you think of something else then feel free to try it. But trust me, nothing makes a bully see the error of their ways than being beaten down and bullied in turn. I look forward to watching!",
    "Speaking of which, let's see how dear old Ahrim is doing shall we?",
    "And now it's dear old Ahrim's turn. Ahrim liked to lead, always knowing where he was and where he was going. So his challenge is simple, a nice little maze. What could go wrong?",
    "Come now, you didn't think a simple maze would be the extent of your rehabilitation did you Ahrim? No no, you see this little test references a time when you hurt your dear brother, badly, in favour of your own gratification. Such a cold, cruel moment in your life Ahrim. Dear old Guthan really loved her and you, oh you monster. So here's the deal. You have a choice here, you can embrace justice or you can remain resolute in your virtue. If you take the path to your left, you will embrace martyrdom and will suffer...oh how you will suffer...for your crimes. Or you could take the right path, continue on knowing that you are safe and secure in your virtue. Oh someone else will suffer in your place, but what does that matter really?",
    "Ha ha. Oh but let's hear from our audience. Player, how do you feel about this?",
    "Does it matter? Someone else, not Ahrim here, another. Perhaps one of the brothers, perhaps one of the hostages. All that is important is that Ahrim here will continue on, safe in the knowledge that he is a righteous man.",
    "Are you ready for them to hear your tale Ahrim? Ready to hear how you betrayed your dear dear brother.",
    "Haha haaa! Very well, perhaps later.",
    "He has a good point. I am a terrible person.",
    "Well, if you insist.",
    "Oh look...another fork in the road. A path to the north and another to the south. Both will lead you closer to your goal, but there's still that same old catch. Someone must pay the toll. To the north Ahrim will pay the toll of exquisite anguish. But should he go south...why another must pay that price. Who will you choose?",
    "Hmm, let's see. This time I think old Mary Rancour here could do with a bit of excitement in her old age. But she's a tough old gal, I'm sure she can take it.",
    "Brave and stupid, my favourite combination.",
    "Are you ready for them to hear your tale Ahrim? Ready to hear how you betrayed your dear, dear brother?",
    "No no. Of course not. You are a righteous man. A devout man. You would never betray anyone...clearly.",
    "But not as easy as letting someone else suffer in your place. That's a lot easier.",
    "Spoilsport. Still, either way, I get some entertainment.",
    "Spoilsport. Still, either way, I get some entertainment.",
    "Ding ding ding. Do you hear that? The tollbell is ringing and someone has to pay. To the western road I'll extract my toll of suffering from dear old Ahrim here. But if you take the eastern path, someone else will have to pay. Choose wisely.",
    "Let's leave this one a lovely little mystery shall we? It could be one of the brothers...it could be you Player. Haha ha ha. It most definitely won't be me though.",
    "Are you ready for them to hear your tale Ahrim? Ready to hear how you betrayed, your dear, dear brother?",
    "Oh yes, of course you were. I understand, really I do. She was such a bad influence wasn't she?",
    "Oh you know the drill by now. West to hurt little old Ahrim, east to hurt an innocent. Though is anyone really innocent? We've all done things we regret haven't we? Fine, not the time for philosophy, got it.",
    "Let's see. Linza my dear, I think it's your turn to suffer, don't you?",
    "So this should be an easy choice then.",
    "Let's see, we know it involved a woman and we know you think she's a bad influence...what else?",
    "Oh but it is so much fun! Come now, what's the point of having skeletons in your closet if you never air them? Now...she was your brother's beloved wasn't she?",
    "Indeed. But she was more than that to him really? Wasn't she? He loved her, truly and completely.",
    "Of course you did. She was very attractive, it must have been so unpleasant.",
    "It's that time again. Time to choose who pays the price for deeper passage into the maze. South leads to suffering for...someone, but north leads to agony for dear old Ahrim.",
    "Let's make it a nice surprise shall we? Well, ok, not exactly nice for the victim, but definitely a surprise.",
    "You ready to lay bare your sordid little secrets Ahrim?",
    "I mean did you really HAVE to? Couldn't they have been happy together? Or is it more that you couldn't be happy seeing her in the arms of your brother rather than your arms?",
    "Hussy? Harlot? Harpy? Seductress? Trollop? Which colourful insult fits them best?",
    "You've done so well to come this far. Bravo, really bravo. Just one more person needs to bleed before you can...get your reward Ahrim. Why not go east this time Ahrim? Let someone else shoulder the burden for a moment.",
    "Why...this time...I'll hurt everyone but Ahrim. How's that sound?",
    "You talk as if your opinion means anything here. Spoiler...it doesn't.",
    "All in good time my friends, all in good time.",
    "You wound me Ahrim. You've made it to the centre, why would I punish you? No no no. I have a reward for you... I thought you might like a friendly reunion...",
    "Yes! That's right, dear, sweet, beautiful Isolde in all her splendour. I just knew how much you'd like to see her again, so I borrowed her spirit for a quick reunion.",
    "Oh but that's right, you're not the only one who would welcome such a reunion...",
    "And end this happy happy reunion? Never, but you can...",
    "I've empowered your weapon, just strike her. Strike her and her soul will never trouble you again. It's up to you though, so here's Player to make sure I'm not interfering.",
    "Wait wait wait, let's have an audience if we're going to do this...",
    "Oh yes, good question. Why wasn't she waiting there Ahrim? Hmm?",
    "Oh yes, that plan definitely worked didn't it?",
    "Player has a point Guthan, roll over and be a good boy and let the important people sort it all for you.",
    "Indeed not. There's still one last thing... Ahrim, this woman represents the corruption of your dear baby brother's precious soul. So, you have the chance now to end that threat...forever. If you strike her now, she'll be gone, never to trouble you again.",
    "Of course, which is why I throw in this special extra prize. For this one time only, I'll also wipe Guthan's memory of this whole sordid affair. Hardly a choice, I know. It's only your brother's memories and the soul of a heathen?",
    "It will be our little secret.",
    "Marvellous. Good show everyone, well played. You stuck to your path Ahrim, no matter who it hurt. I respect that. Pain is fleeting, suffering transiant, but principles - oh they stick around for a lifetime. Ahrim, you're free to go and Player - it's time for the next game. Time to see dear little Verac...",
    "End her Ahrim. End her corruptive influence, prove that you were right all along.",
    "No? No? You killed her once already, why not again? It's not like she's not used to it. Come on, destroy her, you know you want to.",
    "BORING! I thought you were the brother with conviction. Instead you're just as dull and spineless as the rest of them. Ahrim, you're free to go and Player - it's time for the next game. Time to see dear little Verac.",
    "Good plan, Player! That's where I'm keeping Verac. By the way, once you enter that room you'll be locked in, so make sure you're ready for fun!",
    "Yes, they are, aren't they, Verac?",
    "Try not to lose your temper! Too much shouting and you are liable to tear apart. Player, this one is very simple; Verac is being torn between two gods, Saradomin and Zamorak. You have to figure out which one doesn't have claim on his soul and make them let go.",
    "Then that's simple, isn't it? All you need is a key to Zamorak's chains. There is a machine for making them over in the other room where your friends are. They just need to step into that little box and give some blood and pain to power the machine.",
    "Well that might be because I hid the Saradomin key in there.",
    "If you think maybe Saradomin has less of a claim on Verac than he declares all you have to do is dig it out. Have fun!",
    "No deal, Dharok! The machine needs pain and blood, and while you might happily take the former you lack the latter.",
    "Precisely!",
    "It's beautiful isn't it!",
    "Oh come now, that's not true. Beauty makes the world bearable; without it, life is grey and empty. It evokes pure emotion. True beauty can bring empires to ruin or inspire the most evil men to heroic deeds.",
    "Yes...I suppose you think it is.",
    "Thank you for the tip-off about this delightful thing by the way, I would never have found it on my own. It never occurred to me that the staff could be used that way.",
    "Yes and the look on that dragonkin's face was hilarious! Even better now that I have the stone. To think, they just cast this thing away, hoping no one would find it. They must have known the Stone wouldn't be hidden forever. Something like this...it wants to be found. It needs a user, false or not.",
    "Sorry, getting all poetic there for a moment, totally out of character I know.",
    "Oh yes, very much so. The siren song of the Stone will bring all of the gods together. It will be a gathering like no other, a monumental occasion that everyone will yearn to observe.",
    "Yes, of course. I live to serve.",
    "Oh no; the only person that can help here is Player. Well, and Guthan can help himself I suppose. But for now let's settle with the World Guardian calling the shots, right Player?",
    "What's that, stricken dumb at this latest puzzle? Still getting Verac goo off your hands? Never mind, I'm sure you're dying to hear what's going on. Guthan there has to keep that spiked ball balanced, because if he does not...[sic] ...then it'll roll down and slam his brothers onto a scalding-hot grate, pushing them through in glistening chunks! Of course, since he is undead and keeping it at the top of even a steep ramp is easy for someone with unlimited stamina, we have a special guest! If Guthan goes too far, he'll roll all the way down there and crush an old friend of the family, Commander Jaycliff.",
    "Oh, but there is more to it than that, Player. Why don't you have a poke around and find out?",
    "Isn't it just delightful, Player? Brothers betraying each other in blood, for blood! Misunderstandings and plots and secrets, can there be anything better for tearing a family apart? Oh, I know! You pulling the lever and either ending the suffering of Guthan's poor brothers or his poorer victim! What's that? Nothing witty to say, Player?",
    "Ah! I see you have found the solution to Guthan's little problem, Linza. That lever will, when pulled, raise a barrier that will prevent the ball from rolling down that way. Pull it towards the brothers, and they will be saved. Pull it towards Jaycliff and he'll 'live'. Of course, in order to make this more exciting, whichever party you don't choose to save will be impaled by a shiny new replica of Guthan's spear.",
    "Linza, is that you again? Where is Player? Where's the outrage?",
    "Never mind, I don't have time to waste on you. Player, the point of this little puzzle is that Guthan has been a rather naughty little boy. You see, he made a decision that saved some people that hurt others, and he's been carrying that guilt around like a giant, spiky ball for all this time. Now, he has to keep making that choice until outside forces fix it for him. So, pull the lever and set him free, or just sit back and watch him wear his feet down to nubs. Your choice, Player!",
    "Hey, hey, hey! No cheating! Player, if you're not the one doing this then I'll have to punish someone. ...Player?[sic] You're being very quiet. What are you doing?",
    "What's going on in there? I'm coming in. Nobody move and nobody dies!",
    "What is this? Where is Player?  Linza, tell me where Player has gone or you will live to regret it, however briefly!",
    "Oh, Player, your lies are adorable. You know what? Game over. I've had a good time, and whatever you were planning would only annoy me. So congratulations, time for the winner to claim their prize!",
    "Really and truly! All of the people I kidnapped can go free, the brothers can go back to being unfeeling wights, and you will get what I promised you.",
    "Too reasonable? Goodness, you wound me. I'm wounded, everyone! I don't care if you believe me or not. But here is the staff. Time for me to give it to you!",
    "Oh this is too perfect! All your choices have brought you here, to me! Now your soul will be mine!",
    "Hah! I wouldn't bet on that! I'm pulling out Player's soul! Soon it will be mine! I will have to do something about all these useless memories and emotions. Like your childhood, your feelings for Zanik, the fact you've seen my...",
    "You've seen my plans. My real plans. The secret plans.",
    "You're not allowed to see behind the mask. Nobody is.",
    "YOU'RE NOT ALLOWED TO SEE THAT!",
    "You're! Not! Allowed! You're just another pawn! Pawns don't get to play the game by themselves!",
    "Oh that felt good. I haven't been that angry in a while. Hey Meg, still think you can take me on? Come on, you miserable insect, give me a try. No? I thought as much.",
    "Player, you hurt me. You really, honestly hurt my feelings. And you're going to pay for that. I think you've made a good down payment, but we're nowhere near done today. Here's something to think of while you're on your knees; Linza betrayed you.",
    "Her and Relomia were in on this from the start. Isn't that right, Linza?",
    "Since you'll probably spin this to make yourself look better, I'll let Player hear my version. Linza here is a fraud, a thief and a liar. She never learned to smith dragon weapons. She stole the secrets from the Dragonkin. Stole the ore from them as well. Now, we both know what reasonable chaps the Dragonkin are when people take things from them, especially lesser races like us who could use those things against them.",
    "And so she came to me. She. Came. To. Me. And I made her an offer. I'd give her the strength to fend off the Dragonkin by herself, and in return she'd feed you this quest like a good little collaborator.",
    "And speaking of turning, I know I agreed to wait until you were dead before making you a wight, but I've changed my mind.",
    "Now, Player. I know that when you are not writhing in pain you're thinking 'why did Sliske only beat me mostly to death?' That's because I'm going to get the barrows brothers, and sister, to send you the rest of the way. Then they are going to kill the other hostages. Then I'm going to send them to kill your friends, your family, basically anyone that has ever brought you joy. So when you wake up in Lumbridge you'll have that to look forward to.",
    "Excuse me?",
    "I am surrounded, if not inundated, with miserable wretches who think they know who they are dealing with.",
    "Yes, run all you want. Can you outrun the ground, Player? Will being a world guardian stop you being crushed!",
    "I'm done here! You're all dead! And you, if you think what I did to your souls before was bad, it will be a blessing compared to what is coming!"
  ],
  "Wight in a Dragonkin costume": [
    "Urrrrrrrrr..."
  ],
  "Terry": [
    "Urrrrrrrrr...",
    "Urrrrrr?",
    "Urrrrrrr..."
  ],
  "Major Mary Rancour": [
    "Sliske! Release us at once!",
    "What?",
    "By the gods!",
    "Hmmm, this looks like some kind of arena. And it sounds like it is in use. We should go and see who is fighting.",
    "I haven't got the time to play these demented games. Let's go along with it for now and when Sliske slips up, I'll kick him right in the...",
    "Bring it on you boney-faced buffoon, I'm not afraid of you.",
    "AAAAAAAAAARGH!",
    "AAAAAAAAAARGH!",
    "AAAAAAAAAARGH!",
    "AAAAAAAAAARGH!",
    "AAAAAAAAAARGH!",
    "AAAAAAAAAARGH!",
    "AAAAAAAAAARGH!",
    "AAAAAAAAAARGH!",
    "AAAAAAAAAARGH!",
    "AAAAAAAAAARGH!",
    "AAAAAAAAAARGH!",
    "AAAAAAAAAARGH!",
    "AAAAAAAAAARGH!",
    "AAAAAAAAAARGH!",
    "AAAAAAAAAARGH!",
    "AAAAAAAAAARGH!",
    "I think we can start taking the hint here can't we?",
    "How much longer do you think Player will be?",
    "I'll do my best. I wonder how many more of these sick games Sliske has planned for us.",
    "Hmm...that assumes Sliske doesn't force them all to fight for his amusement or some equally sick plan.",
    "Hmmmph...",
    "That's kind of the point of all of this isn't it? We're reduced to holding out for Player to come swinging in and save us. We wouldn't even be here if Sliske wasn't so obsessed with [him/her]. Don't give me that look, I know this sounds like the usual Godless clap-trap. But I feel I have earned at least a little rant. I lost my husband and two sons to the trolls. I have broken every bone in my body fighting those monsters. I've grown old and grey before my time and for what? Sliske captures a magic stone, the gods return and now nobody cares about monsters killing villagers in Burthorpe. And even if they do, they turn to the 'World Guardian'. Not Major Rancour, who bled and struggled to keep them safe. I caught two guards the other day; both of them were slacking off in their duty. I reprimanded them, and do you know what they said? 'It's fine, Player will take care of any trolls that get through.[sic] I...I almost overreacted.",
    "I guess it puts it all in perspective.",
    "The way the barrows brothers sold out to Sliske. Why be a farmer all your life when you can lead a glorious crusade? Imagine how easily I could best the trolls with some of those weapons, or an army of wights?",
    "Yes, there is that. You always have to think of the cost of what you do.",
    "I'll keep blocking the mask. It was good to speak to you, Linza.",
    "We noticed!",
    "Linza, we have to stop him!",
    "The tunnel is collapsing! Let's get out of here!",
    "There's no time to talk. Hurry before we're all crushed to death!",
    "Yes. You've done well Player, despite everything.",
    "Hmm, I'd be careful if I were you. Anyway, now that we're free from here I must return to my duties. Farewell Player, I am in your debt."
  ],
  "Meg": [
    "We should explore this place. I'll walk around the edges pushing on the walls in case there are secret doors. If I find one I'll let you know!",
    "This is all so exciting!",
    "I mean terrifying... We should probably get moving.",
    "AAAAAAAAAARGH!",
    "AAAAAAAAAARGH!",
    "AAAAAAAAAARGH!",
    "AAAAAAAAAARGH!",
    "AAAAAAAAAARGH!",
    "AAAAAAAAAARGH!",
    "AAAAAAAAAARGH!",
    "AAAAAAAAAARGH!",
    "AAAAAAAAAARGH!",
    "AAAAAAAAAARGH!",
    "AAAAAAAAAARGH!",
    "So it has to be one of us?",
    "Really?",
    "Uh...",
    "Hello there, Player and Linza!",
    "I'm not shouting! Why are you shouting?",
    "But...",
    "Thank you Linza. I'm just so worried. I don't want to die here!",
    "But what if it isn't? I want to be a hero like Player and you. If I die here then all my training will be wasted. And I still have so much to learn and live for! Like, how did you get so good at smithing?",
    "But how did you learn to make dragon items? I thought that only monsters knew how to make them.",
    "Did you find the secret in some ancient ruins? And where did you get the ore?",
    "I'm sorry! I truly am. I tend to ask a lot of questions when I'm nervous. Like when I am around Player I keep on asking them such stupid questions. I can't help it! It almost makes me wish Sliske, or preferably someone as powerful but not...you know.",
    "Exactly! If they would offer me awesome power, cool weapons and the like then...I might take them up on it.",
    "But I...",
    "All right. Take care.",
    "Errr...",
    "Tea and crumpets, pip-pip, this is a two-pipe problem and no mistake. By jingo, I can't remember the last time I was in such a pickle, what what. Thankfully good old fisticuffs and a bit of the old elbow-grease should see us through. Huzzah!",
    "Yarr! 'tis a scurvy-riddled situation and no mistake, lads! I dunno if I should keel-haul Guthan, his brothers or this land-lubber of a knight. I'll just have a tot 'o[sic] rum and think on what'll bring me the most plunder and booty!",
    "Vat is zis amateur hour trap, Sliske? Vere I in charge of zis dungeon then all zese vights vould be impaled on sticks vhile I drained zere blood! For zere is nobody more evil than I, Player, dark [boyfriend/girlfriend] of the niiiiight! Bleah!",
    "I panicked!",
    "Linza, we can take him!",
    "Linza, he's lying, right? Linza?",
    "The ceiling is collapsing around us, I think we need to run!",
    "We're alive. Oh thank the stars we're alive.",
    "Are you...ok? I mean Sliske did steal some of your soul right?",
    "Yes, I'd best return to the port. Adventure waits for no woman."
  ],
  "Saradominist crusader": [
    "Chaaaarge!",
    "Die, undead monster!",
    "For my loved ones!",
    "Forgive me!",
    "I will prevail!",
    "Now it is my turn!",
    "Saradomiiiiiin!",
    "Take this! Haaa!",
    "This is all your fault!",
    "This is the end for you!"
  ],
  "Dharok": [
    "Help me!",
    "No! Never!",
    "Maybe once, but I changed. A man can change with the grace of Saradomin!",
    "If what Sliske says is true, this is some sort of punishment for me. I was...I was a bully. Not just to my brothers but to others around the farm. It shames me to think back on it. I was eventually shown the difference between right and wrong and how to use strength for good by a preacher that stayed with us for a season. Then...horror and darkness. I didn't even want to go fight! I was happy working on the farm! I hated killing people. It was giving in to the anger I often felt could overwhelm me if I didn't calm myself. I just wanted to work the farm, raise a family, and die content and surrounded by my loved ones. I would have let the others go to war without me. Maintaining the farm and feeding the hungry soldiers of Saradomin's armies was glory enough for me. But the deal was all of us or none of us. So off to war I went.",
    "Well what do you suggest?",
    "Yes, but these fighters are so weak compared to me that sometimes a parry will kill them.",
    "Yes; I have no idea where Sliske got them but they are really weak. It is almost like they have not been trained in defence.",
    "What? That makes no sense!",
    "Yes, but then I'll be dead!",
    "I really don't understand your logic. Besides, Sliske has already beaten me. I am an undead abomination in his thrall.",
    "So why should I let his minions beat me now? Won't that secure his victory?",
    "Sorry, Player, I'm not going to do it.",
    "But...I...well...",
    "I'm not sure this is a good plan, but all right...",
    "Is this some kind of a joke? That doesn't make any sense!",
    "No I would not! I refuse to just give up!",
    "I did, but these fighters have so little defense that a stunning attack crushes their brittle bones like an eggshell. That sounds implausible. I know; what kind of fighter would ignore defensive training like that?",
    "Well...great.",
    "Bye.",
    "Help me!",
    "...",
    "Thank you, Player, you were right. Letting my anger go, letting my pride go, and allowing myself to experience retribution at the hands of my victims was the right path. I feel...liberated. If only redemption for all my misdeeds was so easy.",
    "Player, you did what you had to, but I consider this a betrayal. Just because I was a bully does not mean I am a bully now, so having me crushed utterly in that way... It smacks of something Sliske would do.",
    "Now we need to press on. Sliske informed me that my brothers are stuck in similar hells. We should free them immediately.",
    "It's odd to feel...like me again.Though these games of Sliske's ruin the experience.",
    "I'll do it. My pain means nothing in the long run after all.",
    "But...he's been dead for years.",
    "That's commander Jaycliff. He used to be the terror of our village. He was a drunk and a brawler. Personally, I hated him because he represented what I used to be. I don't know why he is here though. He was murdered in a bar brawl a week or so before we started our crusade.",
    "The druidess? The one you were going to run away with?",
    "Amen to that.",
    "He's right. I wanted no part in this until the rest of you told me we all had to take the deal.",
    "We're not going to kill Player, Sliske. Linza might be under your control but we can check her while Player escapes.",
    "Sliske has regained control of us all. But not totally.",
    "Whatever you did, either in the trials or in his sanctum, we have some slight control.",
    "I'm here to tell you that, and to tell you that Linza can still be saved.",
    "She's not like us. She's undead and will return from the dead like we do.",
    "But Sliske's control over her is weaker. There is still hope.",
    "Now, I will return to my tomb as before. We will pretend that Sliske's rule over us is absolute still.",
    "But know this; when the time is right we will stand with you.",
    "Until then..."
  ],
  "Ahrim": [
    "This is ridiculous Sliske. I won't play your stupid games. I have done no wrong and will continue on my path.",
    "...",
    "And just walk into whatever punishment Sliske wants to dole out to me? I don't think so.",
    "You think Sliske won't hurt someone else anyway?",
    "A fair argument. Very well Sliske, I will endure. Do your worst.",
    "AAAAAAAAAAAAAgh!",
    "And just walk into whatever punishment Sliske wants to dole out to me? I don't think so.",
    "...I didn't betray him. I would never...have never.",
    "Someone else will endure just as well as I. I still need to reach the end.",
    "What kind of argument is that? Suffer now so you'll only suffer a bit later?",
    "I'm sorry...I'm taking the southern pass.",
    "You're right, I won't give you the satisfaction Sliske.",
    "AAAAAAAAAAAAAgh!",
    "You're right, I won't give you the satisfaction Sliske.",
    "AAAAAAAAAAAAAgh!",
    "I'm sorry...I'm taking the southern pass.",
    "Someone else will endure just as well as I. I still need to reach the end.",
    "It wasn't betrayal...I was...looking out for him.",
    "She was a heathen...an idolator, she would have corrupted his very soul...I...Why am I talking about this?",
    "I'm sorry...if I'm going to make it to the end of this maze someone else has to take the hit now.",
    "Let's be practical here. This won't end until I reach the centre and I won't reach the centre if I'm dead.",
    "It's not a matter of weakness, it's a matter of simple practicality. If we want this to end any time soon, someone else has to bleed.",
    "No, no I've got to make it through this. I'm sorry to whoever suffers in my place, but I'm sure you understand.",
    "How is it more practical to hurt me? I've got to make it to the end of this accursed challenge.",
    "No, no I've got to make it through this. I'm sorry to whoever suffers in my place, but I'm sure you understand.",
    "No, no I've got to make it through this. I'm sorry to whoever suffers in my place, but I'm sure you understand.",
    "That...Ok, that makes sense. Very well Player, I'll take the western path. AAAAAAAAAAAAAgh!",
    "No, no I've got to make it through this. I'm sorry to whoever suffers in my place, but I'm sure you understand.",
    "No, no I've got to make it through this. I'm sorry to whoever suffers in my place, but I'm sure you understand.",
    "No, no I've got to make it through this. I'm sorry to whoever suffers in my place, but I'm sure you understand.",
    "No, no I've got to make it through this. I'm sorry to whoever suffers in my place, but I'm sure you understand.",
    "I'm sorry...if I'm going to make it to the end of this maze someone else has to take the hit now.",
    "Let's be practical here. This won't end until I reach the centre and I won't reach the centre if I'm dead.",
    "Leave it be Sliske. We don't need to dig up these old memories. It helps no one.",
    "A schoolyard fling, nothing more.",
    "He only thought he did. He was too young to know any better I...I protected him.",
    "No, it wasn't like that...it... Why am I discussing this with you? Let's just move on.",
    "I'm taking the east path.",
    "People are always hurt, let's cut the moralistic rubbish and just get this maze over.",
    "No, sorry, I'm taking the eastern path.",
    "No, sorry, I'm taking the eastern path.",
    "How do you figure that one out?",
    "That doesn't really seem to help speed things up much. No, sorry, I'm taking the eastern path.",
    "Yes...all this stopping and starting...the debates and decision. They slow it all down.",
    "I see your point. Very well, I'll head west. AAAAAAAAAAAAAgh!",
    "That doesn't really seem to help speed things up much. No, sorry, I'm taking the eastern path.",
    "That doesn't really seem to help speed things up much. No, sorry, I'm taking the eastern path.",
    "That doesn't really seem to help speed things up much. No, sorry, I'm taking the eastern path.",
    "That doesn't really seem to help speed things up much. No, sorry, I'm taking the eastern path.",
    "No, sorry, I'm taking the eastern path.",
    "No, sorry, I'm taking the eastern path.",
    "I'm taking the east path.",
    "People are always hurt, let's cut the moralistic rubbish and just get this maze over.",
    "I did what had to be done. Let's leave it there.",
    "How dare you, I would never...sully myself with that...that...",
    "That isn't... Oh shut up Sliske.",
    "Not this time, no. Just...just let someone else take this one...",
    "I...I can't... It's too much.",
    "I'm heading south.",
    "I am not weak... I am Saradomin's holy warrior... I am his sword...",
    "Hardly a motivating speech there. I'm heading south.",
    "Hardly a motivating speech there. I'm heading south.",
    "I am fighting. But...it's not unreasonable to share the burden.",
    "Yes... Weakness... I...",
    "No...but it is not weakness to pass the burden from time to time. I'm heading south.",
    "Yes...and in his name I endure. AAAAAAAAAAAAAgh!",
    "Hardly a motivating speech there. I'm heading south.",
    "Hardly a motivating speech there. I'm heading south.",
    "Hardly a motivating speech there. I'm heading south.",
    "Hardly a motivating speech there. I'm heading south.",
    "Hardly a motivating speech there. I'm heading south.",
    "I'm heading south.",
    "I'm heading south.",
    "I'm heading south.",
    "Not this time, no. Just...just let someone else take this one...",
    "I...I can't... It's too much.",
    "No. No I am heading east. It's the final leg, I've suffered enough.",
    "Then it will change nothing if I walk a different path now.",
    "Have a care young adventurer, you know who you're talking to.",
    "Weak insults, they mean nothing to me. No. No more words, no more pulling on puppet strings. I have made my choice, I go east.",
    "Weak insults, they mean nothing to me. No. No more words, no more pulling on puppet strings. I have made my choice, I go east.",
    "A disappointment?",
    "Then I'm afraid you don't know me at all. No. No more words, no more pulling on puppet strings. I have made my choice, I go east.",
    "Then I'm afraid you don't know me at all. No. No more words, no more pulling on puppet strings. I have made my choice, I go east.",
    "Yes...strong. I am...",
    "Yes...and in his name I can endure anything. AAAAAAAAAAAAAgh!",
    "Yes...and in his name I can endure anything. AAAAAAAAAAAAAgh!",
    "Not good enough. Then I'm afraid you don't know me at all. No. No more words, no more pulling on puppet strings. I have made my choice, I go east.",
    "Then I'm afraid you don't know me at all. No. No more words, no more pulling on puppet strings. I have made my choice, I go east.",
    "Then I'm afraid you don't know me at all. No. No more words, no more pulling on puppet strings. I have made my choice, I go east.",
    "Weak insults, they mean nothing to me. No. No more words, no more pulling on puppet strings. I have made my choice, I go east.",
    "No. No more words, no more pulling on puppet strings. I have made my choice, I go east.",
    "No. No more words, no more pulling on puppet strings. I have made my choice, I go east.",
    "No. No more words, no more pulling on puppet strings. I have made my choice, I go east.",
    "No. No more words, no more pulling on puppet strings. I have made my choice, I go east.",
    "Then it will change nothing if I walk a different path now.",
    "I'm here Sliske. I've made it through your pathetic, childish maze. What horrors await me now? Hmm?",
    "I...Isolde?",
    "Sliske, send her back... Send her...",
    "You've had your fun Sliske. You've made your point. Send her back, end this. Please.",
    "Isolde...I...I'm...",
    "No. Don't listen to this godless harlot Guthan. She will poison your mind, just as she tried to poison your heart.",
    "Leave it, demon.",
    "Redemption? Hah! You say it as though I did something wrong. I was protecting my little brother, she would never be good enough for him.",
    "She would have twisted your faith, turned you away from the one true god and to the worship of false idols. Her death may have broken your heart, but her demise should have saved your soul!",
    "No Guthan! I did it for you, to protect you, to spare my beloved little brother from her insidious manipulations.",
    "See! See brother! See how she lies, how she tries to twist our bond of blood. That's what these heathens do. They try to break our faith.",
    "As much as it pains me to admit it, you are right Sliske. I cannot allow this base seductress to influence my family further.",
    "No brother, I can't bear the thought that you might never forgive me... I only did what was right so it's best that you don't remember. Sliske, I will hold you to your bargain. Make Guthan forget all of this.",
    "IN SARADOMIN'S NAME, I CAST THEE INTO DARKNESS! DECEIVER! IDOLATOR!",
    "One day you will see that I did what is best for you brother. One day.",
    "...no.",
    "No Slikse[sic], I won't. In many ways your little game has helped me to realise my own self-righteous arrogance. The pain I was feeling... I could have so easily just passed it on to another...like I did before. It was arrogance and jealousy more than reason that made me tear Guthan and Isolde apart. I see that now. Brother, I know you can never forgive me and I would never ask you to, but please know that I am truly sorry. Isolde, I can never undo what I did, but please know that the guilt for my crimes will stay with me for eternity.",
    "It seems Sliske needs you to save my brother. I urge you to get to it quickly.",
    "No. You have done a service rescuing my brothers so far, but some discussions are for family only.",
    "Then you will need to unlock the Zamorak statue. He is as devout a Saradominist as you would ever find.",
    "Guthan! Torag! Karil! Speak to me!",
    "I have something more important to do; trying to save my brothers! Now let me think in peace.",
    "And who told the rest of us we should accept?"
  ],
  "Isolde": [
    "No...not him...please...",
    "No, don't listen to him.",
    "I tried. I did. But he stopped me. I wanted to be with you but Ahrim...",
    "No my love. Guthan I would never betray you.",
    "But I did... As soon as you asked me to be with you, I ran to our meeting place. I was so excited, so ready to be with you.",
    "You mean because I refused your advances. You killed me because I was never going to be yours.",
    "This isn't over Ahrim.",
    "No, please..."
  ],
  "Guthan": [
    "Isolde? I never thought I'd see you again. You never showed...",
    "But we were going to leave together, you said you would come back to me and we'd leave together. But I waited and I waited and you never came.",
    "Then what happened? Why weren't you there?",
    "Ahrim? What's going on?",
    "In Saradomin's name... Ahrim...you didn't?",
    "You killed her? You murdered the woman I loved...for what? Some insane sense of righteousness?",
    "This isn't over Ahrim.",
    "It won't fix what you've done Ahrim, I'll still know.",
    "Ahrim, no, leave her be. Don't listen to him.",
    "No... Isolde...",
    "...",
    "Balancing. I have to stay balanced. Got to keep focused.",
    "I...No, I can't.",
    "Verac you...",
    "Do you remember Isolde?",
    "Yes. After she left me I was distraught. I went to the tavern and drank.",
    "I didn't mean it! I was drunk and you...",
    "That's not all.",
    "I...betrayed you all to Sliske.",
    "I had the blood of a Saradominist commander on my hands! I knew an investigation would find me out and then I would hang! Sliske offered me a way out. Who would question a great Saradominist hero? And more over, how much more good could I do if I took up my sword and fought in Jaycliff's place? But it had to be all of us or none of us.",
    "Yes, but who was it who told you all to accept Sliske's offer?",
    "Don't touch the lever there! It's a trap!",
    "Don't touch that!",
    "But won't that kill everyone?",
    "No."
  ],
  "Verac": [
    "You there! Help me! These things are tearing me apart!",
    "Sliske! Release...aaaaargh!",
    "Saradomin is my lord and light! Aaaargh!",
    "Hurry! Do it! Free me! My vitals feel like they are being sliced apart!",
    "Sliske told you why I am here. This is one of his sick games!",
    "He clearly wants you to injure me for no reason! Aaargh! He wants you to cut the Saradomin key from me, symbolically removing my love for him.",
    "It is pain either way then! But why else would he hide the key in me? I led a crusade in the name of Saradomin! His light fills me...aaargh!",
    "That sounds like Sliske's logic. Don't fall for it!",
    "Yes! Unlock the Zamorak statue quickly, I beg you!",
    "Sliske already told you; you need to get one of your friends to operate a machine to make one. Go to the door, and swiftly!",
    "Bye.",
    "The machine must not have worked correctly. Maybe the person in the box flinched? Get them to make another, and keep still this time!",
    "Well I felt the chains relax, you almost had it!",
    "Well I did! Get another key!",
    "Sliske must be toying with you! Try again!",
    "Yes, I know they have to go back in the box. But this time be more careful with the key!",
    "I saw you do that on purpose!",
    "You did! You're enjoying making me suffer!",
    "A likely story. Get another, and this time I will be watching you like a hawk!",
    "Yes it is, I can feel it. Just try again. Sliske must desire enough suffering to release the chains. Just keep making keys until it works!",
    "I don't care what Sliske said to you, I am devout! Devout! Get a Zamorak key and release me!",
    "No, don't do it! I follow my god willingly! If you cut me open then these statues will rip me in half!",
    "AAAAAAARGH! Please, don't do this! You're killing me!",
    "Mercy! Please no more!",
    "You're tearing me in half! Stop, please! Aaaaaaaaah!",
    "No! Sliske, please stop the pain! Take my mind away again, anything! My god, why are you letting this happen?",
    "C...curse you Zamorak, why didn't you shield me? Was I not worthy?",
    "The power of Saradomin has healed me. Make a Zamorak key, and hurry!",
    "The power of Saradomin has healed me. Make a Zamorak key, and hurry!",
    "The power of Saradomin has healed me. Make a Zamorak key, and hurry!",
    "You already have it.",
    "You pulled a key out of my chest and exposed my heresy to the world. Why would I not be all right?",
    "Fine, I'll be your messenger. Try not to take too long.",
    "Guthan, why are you hurting yourself like this? Just roll yourself over onto Jaycliff. Nobody will miss that preening bully!",
    "I don't know why Guthan doesn't just roll over and crush that white knight. Guthan! Just crush him!",
    "What? How is that Zamorakian? It's my family versus a drunk I would happily stab even if he was alive.",
    "Roll harder, Guthan!",
    "Yes, I admit it. But that's not the point. Linza has it right; this is all Sliske's little game. So come now, brother, what did you do? Why is Jaycliff here?",
    "And who was it who took Sliske's offer first?",
    "Yeah, that's right."
  ],
  "Meg/Linza/Major Mary Rancour": [
    "Ok. I'll do it.",
    "Aaaaaargh!",
    "Ok. I'll do it.",
    "Aaaaaargh!",
    "Ok. I'll do it.",
    "Aaaaaargh!",
    "Ok. I'll do it.",
    "Aaaaaargh!",
    "Ok. I'll do it.",
    "Aaaaaargh!",
    "Ok. I'll do it.",
    "Aaaaaargh!"
  ],
  "[Mysterious voice]": [
    "Beauty is meaningless.",
    "This conversation is irrelevant.",
    "The staff is quite useful.",
    "Is there a point to this?",
    "Enough! This will bring them?",
    "This bluster is pointless, simply make it happen."
  ],
  "Karil": [
    "Ahrim! Brother! Help Guthan!",
    "What?",
    "Oh Guthan..."
  ],
  "Commander Jaycliff": [
    "And then he killed me.",
    "...Impuned[sic] your honour, disgraced your family and mocked your lost love. I know. I have been suffering Saradomin's displeasure since that night. He showed me that I was nothing more than a bully, and my death deprived the world of so much good I could have done, had I picked a different path."
  ],
  "Torag": [
    "Wait, I don't remember that. I was already planning on signing up to the crusade before you came to me.",
    "Player, I can feel his control over us returning, run!"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Kindred_Spirits?oldid=36196386’"
  ]
}