{
  "Player": [
    "How's the outpost?",
    "Is there anything else I can help you with?",
    "Which gets hotter and colder?",
    "Oh, the key and I go way back. It's a bizarre item, so it'd be great if I could study these papers.",
    "I'm sure I'll enjoy finding out.",
    "Yes, please.",
    "No, thanks.",
    "Actually, I've had my fill of adventure for now.",
    "Hi Jorral.",
    "Hmmm. I want to investigate further before I commit myself to a hypothesis.",
    "Oh, sorry, but I lost the notes you gave me; can I have them back?",
    "Here goes nothing. Predem abducto! Hmm. Nothing's happening. What? Arghhhh!",
    "Where am I?",
    "Ahhh, how cute. Hello, little doggy-woggy.",
    "Thbbbbt!",
    "Excuse me, can you help me?",
    "Excuse me?",
    "I'm sorry, I'm just a traveller, I-",
    "Ahhh. Look at the ickle baby.",
    "Hi, I-",
    "I, er, I was just outside Ardougne Castle whe-",
    "Oh? What about Lumbridge? Falador? Varrock?",
    "This is RuneScape, isn't it?",
    "RuneScape. Then this must be...the past?",
    "And you're just a normal family?",
    "Sorry, I have to go. (I should use the key to go back to the future and speak with Jorral)",
    "Sorry, you did say this was Gielinor, didn't you?",
    "That's what I'm going to find out. I need to speak with a friend.",
    "Jorral! Jorral! You won't believe what happened.",
    "I went back in time, back before Ardougne even existed!",
    "Wait, let me tell you.",
    "...and then I used the key to return to, er, now.",
    "It looks as if that family could do with a hand – they're new to a strange world, after all. It could provide us with a great opportunity to learn about the past. I should travel back and see what I can learn from Roger, Jack and Laura.",
    "Rub different parts of the key, check.",
    "Hello, Jorral.",
    "I'm still looking into things at the moment.",
    "Hi.",
    "Erm, I am?",
    "Oh, sorry.",
    "Hmmm. That's a very good idea. Hold on, I'll be right back.",
    "Here!",
    "I wonder what the baby will think of this.",
    "Oops.",
    "Hello, I'm just travelling through.",
    "What's the matter?",
    "Shame.",
    "Hello.",
    "Err. Yeah. What?",
    "How nice. But can you tell me about your past? Where are you from?",
    "Well?",
    "You've lost the plot, haven't you? Totally bonkers.",
    "I'll think I'll have better luck talking to your past self.",
    "Just take it easy.",
    "Hello. I've got some medicine for your daughter.",
    "Please, I mean no harm. The recipe was from, er, your wife.",
    "Here, little one.",
    "C'mon now, drinky-upsies.",
    "There's a good baby.",
    "My pleasure. Now that we can talk in peace, I was wondering if you could help me out.",
    "Can you tell me where you came from?",
    "I'm sorry, you said 'arrived on this plane'?",
    "Sorry, bad memory, what portal?",
    "Amazing. So you're the only family to visit RuneScape?",
    "The start of humans inhabiting RuneScape, that's great to hear.",
    "You too.",
    "Hello Rodger.",
    "Most definitely. All is good, although it's a shame about Snowy.",
    "Oh, I probably shouldn't have said that. Ignore me, I've got a condition.",
    "Erm. Speaky-rubbish-ionosys. It means I'm prone to talking garbage.",
    "What? Really?",
    "My brain hurts.",
    "Hi, young'un.",
    "It's good to see ambition.",
    "You don't say. You made them all by yourself?",
    "I had better watch out, then. I hope you're going to use your magic for good and not evil.",
    "Surely you'd be better off making gold bars? Or rare and powerful weaponry?",
    "What it is to be young.",
    "Hi, Jack, or should I say, Super Jack the Fantasmic! Do you happen to know much about fruit trees?",
    "Well, thanks anyway.",
    "Excuse me. Can I have a word? Jack, is it?",
    "I thought you wanted to become a druid.",
    "Oh, erm, a lucky guess.",
    "Perhaps you'd spare the time if I read your mind with magic?",
    "You wanted to be known as Super Jack the Fantasmic.",
    "You wanted to be known as Superb Jack the Fantastic.",
    "You wanted to be known as Fantasmic Jack.",
    "You started with fire, earth, air and body runes.",
    "You started with cosmic, mind, body and fire runes.",
    "You started with mind, water, air and earth runes.",
    "You got the runes from Merlin.",
    "You got the runes from Misthalin.",
    "You got the runes from Misalionar.",
    "You started learning magic when you were four.",
    "You started learning magic when you were seven.",
    "You started learning magic when you were ten.",
    "You started to learn by trying to levitate objects.",
    "You started to learn by trying to freeze monsters.",
    "You started to learn by trying to create fire.",
    "You hoped to create chocolate cakes.",
    "You hoped to make gold bars.",
    "You hoped to take over the world.",
    "You wanted to use your new powers for good.",
    "You wanted to use your new powers for evil.",
    "And your favourite flavour of milk is banana.",
    "You've not heard of bananas?",
    "And your favourite flavour of milk is vanilla.",
    "And your favourite flavour of milk is strawberry.",
    "That shouldn't be too hard.",
    "I'll see what I can do.",
    "Sorry to bother you.",
    "Hi, Jack.",
    "I'm still looking into it.",
    "Excuse me, do you know much about these trees?",
    "Time travel? You have an interesting imagination.",
    "Excuse me, do you know much about these trees?",
    "That's fantastic. I'll have to talk to Jack.",
    "Oh, nothing.",
    "Hi, Jack. I've sorted all the trees out.",
    "You asked me to find out why the trees didn't grow, they're all bearing fruit now.",
    "Oh, I see! You wouldn't know about the poorly placed trees because I changed hist- Wait. Ignore me. So, do you think you could answer some of my questions?",
    "What do you know about runes and magic?",
    "By Guthix?",
    "I suppose magic has developed over the years?",
    "That's very interesting. Thank you!",
    "So, did you manage to master your Magic skill?",
    "That's great, what inspired you?",
    "That's kind.",
    "That's great. I'm sure it'll go very well.",
    "How's things; still sad?",
    "Really?",
    "That's great.",
    "Hi, Roger.",
    "It certainly is, and how are you?",
    "Yes, he was a lovely dog.",
    "Oh, poor Snowy.",
    "Look what I have!",
    "What? Ooops. *ahem* Nope, this is mine. Yes, my brooch. Bye!",
    "Excuse me, Could you tell me about your past?",
    "I SAID, COULD YOU TELL ME ABOUT YOUR PAST?",
    "You regret not seeing more of the world? Why didn't you?",
    "A map for your younger self? Hmmm.",
    "Excuse me, but I've got something for you.",
    "It's this map, it shows you the surrounding lands. You can use it to explore.",
    "Oh, I've just been mapping the nearby lands during my travels, that's all.",
    "My pleasure.",
    "Hello again. I was wondering if you could help me out with some information?",
    "Hello. Tell me, have you travelled much in your life?",
    "So, no regrets?",
    "A brooch? I'll see what I can do.",
    "Hi there. This may seem a little strange, but do you have a brooch?",
    "Are you still looking for your brooch?",
    "Oh, I just get the feeling that it's a lot closer than you think.",
    "Look what I have!",
    "It most certainly is.",
    "No problem. I was hoping you could help me out by telling me about your past. I've been looking into the history of this world.",
    "Amazing! How many times did you see him? What of the other gods, Zamorak and Saradomin?",
    "So, what did he say to you?",
    "Did he mention other races?",
    "That's okay. That's already much more than I previously knew. Thank you.",
    "Hi Laura. Thanks again for telling me your story.",
    "Excellent. I think I have all the information I need now. Jorral should be most pleased to hear from me.",
    "Hi, Max.",
    "It seems from the campfires that this is becoming a common place for travellers to stay.",
    "Fantastic. I'm so pleased that my helping the family is having this effect.",
    "My pleasure.",
    "Hello, Jorral.",
    "Yep. I've got the complete picture now.",
    "It seems that, a great many years ago, the god Guthix created a portal between Gielinor and another dimensional plane. The first humans that stepped through into this realm discovered runes and decided to name our world Gielinor after them. Guthix paid frequent visits to those first settlers; Saradomin and Zamorak don't appear to have even been heard of back then.",
    "That'd be great.",
    "Hi, Jack. How goes the practice?",
    "That's good.",
    "That's at least something.",
    "Ha ha! I'm sure that'll stick.",
    "Hi, Laura.",
    "I think so, unless you have anything interesting to tell me?",
    "Great. Thanks. Fascinating.",
    "Hello, Rodger.",
    "Most definitely. How is little Sarah?",
    "You're welcome.",
    "Ahh. Look at the ickle baby.",
    "Hello, Sarah, how's things?",
    "Herblore",
    "Nah. You should probably call it '[Adventurer]'s lore'.",
    "Hello, Jack.",
    "Heh. I was just wondering how things are going?",
    "Good luck and be careful. I foresee strange things in other parts of the world.",
    "Hello.",
    "That's fine. I wanted to ask: what was it like where you came from?",
    "I can't imagine that.",
    "I suppose there must be a limit to how far I can explore in the past."
  ],
  "Jorral": [
    "It's strange that you should ask. I've come into possession of many papers that talk of an enchanted key.",
    "Why, yes! How'd you know?",
    "They may be a load of nonsense.",
    "Here's a copy of the important notes. We wouldn't want the originals getting marked, now, would we?",
    "The other notes mentioned that carrying additional items other than the key made using the key difficult. Would you like me to take the items you are carrying and wearing for the bank for you?",
    "That's dissapointing.",
    "Anything to report?",
    "I look forward to it.",
    "Hold on. Here you go. Please don't make me write them out again.",
    "Yes?",
    "What? Are you sure? What did you see?",
    "That's amazing.",
    "That sounds like a plan! Before you go, though, I've been looking through the notes and it seems you can travel to different times by rubbing different parts of the key.",
    "Hello. Discovered much?",
    "Then, please keep talking to the family and trying to meet their requests, They should give you all the information you need to know.",
    "Hello. Discovered much?",
    "Excellent. Please tell all.",
    "Amazing. This answers so many questions and I'm sure Varrock Museum will be interested to hear all this, too. I'm going to plan some visits to the past; hopefully, I will need your assistance in the future.",
    "Hmmm. I was going to offer you a reward, but your inventory seems full. Come back when you have more space."
  ],
  "Option 1": [
    "Chat",
    "General Chat",
    "Super Jack the Fantasmic.",
    "Fire, earth, air and body runes.",
    "Merlin.",
    "Four.",
    "Trying to levitate objects.",
    "Create chocolate cakes.",
    "Good.",
    "Banana.",
    "General chat.",
    "Papyrus.",
    "Charcoal.",
    "General chat.",
    "General chat.",
    "General chat.",
    "General chat."
  ],
  "Snowy": [
    "Yip yip yap woof!",
    "Yip yap!",
    "Whine!"
  ],
  "Option 2": [
    "Stroke",
    "Repeat Cutscene",
    "Superb Jack the Fantastic.",
    "Cosmic, mind, body and fire runes.",
    "Misthalin.",
    "Seven.",
    "Trying to freeze monsters.",
    "Make gold bars.",
    "Evil.",
    "Vanilla.",
    "Repeat story.",
    "Repeat story.",
    "Repeat story.",
    "Repeat story.",
    "Repeat story."
  ],
  "Option 3": [
    "Shoo-away",
    "Fantasmic Jack.",
    "Mind, water, air and earth runes.",
    "Misalionar.",
    "Ten.",
    "Trying to create fire.",
    "Take over the world.",
    "Strawberry."
  ],
  "Roger": [
    "Arrghh! Who are you? Get away from my baby!",
    "Leave us be.",
    "Hey you, stranger. Don't tease my baby.",
    "Coochy coohcy coo! Who's my beautiful darling?",
    "Not you, stranger. I'm trying to calm my daughter.",
    "She won't stop crying. I can't understand what's wrong! I wish I could talk to her and find out what's wrong.",
    "Who are you? What do you mean by showing up out of nowhere with random items?",
    "Waa waaaa!",
    "That's the sound the baby makes. Waaa!",
    "...",
    "I like rabbits, they never cry. Nope. Never.",
    "Hey. You remind me of someone. Your face looks very familiar...but it can't be.",
    "What?",
    "How can I trust a stranger?",
    "My wife? I suppose it's okay, then. Please feed it to my daughter, but be careful!",
    "She stopped crying! Thank you, thank you, thank you. I can hear myself think again.",
    "What's the matter?",
    "When we first arrived to this plane, we travelled from the east over some white mountains. It was a long journey, and we saw no other humans and few animals.",
    "Through the portal, of course.",
    "Have you hit your head? We're the first humans to come to RuneScape. We came from another plane.",
    "On our plane, there are a great many people, and the creatures and the scientific laws seen far less strange.",
    "Oh now, there are a great many humans that came through the portal, from all corners of our home plane. We're spread out, some in larger groups, but our family decided to travel a bit further afield. From time to time we see others, and we've arranged to meet up once a year to the east and share our experiences.",
    "Ah, it seems we're disturbing my daughter, you'll have to excuse me. I've also got to attend to Snowy, it's time for his feed.",
    "Take care, traveller.",
    "Hello, friend. Things well?",
    "Snowy?",
    "What kind of condition?",
    "Oh, yes. Sounds familiar. I think my aunt had that.",
    "Yes, but don't worry, I've got see-through-speaky-rubbish-ionosys.",
    "Why, hello, young [sir/lady]! Lovely day today.",
    "A little tired, but still in one piece. I kind of miss Snowy, though.",
    "Hello, friend. Were you pleased with your findings?",
    "She's fine, she sleeps so soundly these days, thanks to your help.",
    "Hey you, stranger. Don't tease my baby."
  ],
  "Baby Sarah": [
    "Gwaaaa waaaa!",
    "Waaa! Waaa!"
  ],
  "Laura": [
    "Who are you? Where'd you come from?",
    "Ardoin Castle? I don't think there are any castles around here.",
    "What strange names. We've been here a while now and we've not come across any civilisations, let alone the ones you're talking about.",
    "Of course. Why? Where are you from?",
    "What are you rambling on about?",
    "We're a perfectly normal family, thank you very much! I'm Laura, there's my husband Roger, young Jack, our baby Sarah, and our beloved dog, Snowy. Who are you?",
    "Oi! Who are you?",
    "Of course. Who are you? What's going on?",
    "Look, I'm busy with this here shed, I've got no time for strangers. Kindly leave my family alone.",
    "Is that my brooch? Give it back, you thief!",
    "What? Speak up!",
    "No need to shout. There's not much to tell. I've spent my entire life looking after my family. I so wish I'd done more travelling when I was young, seen the world and had some adventures.",
    "I didn't know where to start or what to expect. It's not good to leave your family and never return because you got lost. I wish I'd had a map of the lands, just something to get me interested and started.",
    "Yes. What is it now?",
    "really? That is quite interesting, how did you find it?",
    "Wonderful! I shall give it a look right after I've finished this shed and taken Snowy for a walk. Thank you, stranger.",
    "Look, I'm busy with this here shed, I've got no time for strangers. Kindly leave my family alone.",
    "Most certainly! I've travelled long and far. I'm sure, in my lifetime, I've experienced more adventures than most.",
    "Just the one. You see, I had a family heirloom – a brooch – that I lost somewhere on my travels, over the years. I wish I'd taken better care of it.",
    "A 'little' strange? I don't have it on me, but that's not really any of your business, even if you did help me out with that map.",
    "I am, yes. Why?",
    "Oh my, is that my brooch?",
    "Oh, thank you so much!",
    "Most definitely, friendly traveller.",
    "I don't know everything, but I picked up a lot about the gods. Years ago we were greeted by Guthix. He was the god that introduced us humans to RuneScape, though he was always keen to point out he didn't create us. I'm sure he chose his appearance so as to not intimidate us and to remain as neutral as possible. Yet, you could sense his power – you could practically feel it when he was near.",
    "Other gods? I've not heard those names before. Guthix appeared frequently to us back in those days. I suppose he wanted to ensure balance and that he wasn't introducing something to this world to upset that balance.",
    "He said very little. I think he just wanted us to be aware that he existed and to give us some understanding in those first days. He spoke a lot about balance and encouraging us to live in harmony with our surroundings – to feel free to use our environment, but not to abuse it. It seems that he had not created this world, and spoke of 'elder gods' that existed in a time before he could remember, of this he said little.",
    "He spoke briefly of 'short folk of varying kinds' already existing here, but we've yet to see them. There's not much else I can tell you, I'm afraid.",
    "It was my pleasure, dear.",
    "The friendly traveller! Did you have all your questions answered?",
    "Hmmm. Did you know that no piece of square paper can be folded in half more than seven times?",
    "Oh, it's the young'un that returned my brooch! Thanks again, my dear.",
    "In some ways it was very similar to Gielinor, but with lots more people.",
    "You wait and see. One day, you won't be able to kick a pebble without hitting another person."
  ],
  "Sarah": [
    "Hello, traveler *cough* Nice to meet *cough* you.",
    "Oh, I just *cough* need to take some more medicine. Hold on a second. *gulp*",
    "That's better – milk, honey and guam. It's just a condition I've had since I was a baby. My father was always confused as to why I'd never stop crying.",
    "Waaa! Waaa!",
    "Waaa?",
    "Gyaaa!",
    "Goo boo baba?",
    "They're fruit trees my mum planted years ago, but they haven't ever borne leaves. Never mind fruit. I've always thought they were planted in the wrong patches. Perhaps if the avocado tree was closer to water and the quince further away? If we had fruit I wouldn't feel so ill all the time and I'm very bored of the other food we have. It's a shame I couldn't go back in time and try planting the trees differently.",
    "They're fruit trees. We planted them years ago and they've always grown so well.",
    "Why?",
    "Actually, things are perfect, traveller. I've met a very special guy and we're engaged to be married!",
    "With the family doing so well, more travellers have been passing by and I've met my dream guy.",
    "The wedding's soon and I can't wait to start living a full life!",
    "Gwaaaa waaaa!",
    "Very good, actually. For starters, I'm engaged to be married to a traveller who was passing by. Secondly, I've started an interesting study into plants and how they can be made into potions and medicines.",
    "Herblore? Hmm, that's the perfect name for the discipline. From now on I will call it 'Herblore'!",
    "I think I'll stick with Herblore, thanks."
  ],
  "Jack": [
    "I'll have you know, mister, that I'm practicing to be a big and powerful druid, the likes of which you have never seen! I shall be known as Super Jack the Fantasmic.",
    "I've started trying to light this fire. I've got these rare and powerful runes. Let me tell you a secret: they're called cosmic, mind, body and fire runes.",
    "No, silly billy, I got them from a druid called Misalionar. He saw my potential to be the greatest druid in all of RuneScape, all at the age of seven!",
    "Most definitely good. When, I'm all-powerful, I'll create chocolate cakes out of any substance. Mmmmm.",
    "How boring. No, I'll make it rain strawberry-flavoured milk and conjure magical birds that will fly me around the world.",
    "Fruit trees? My mum's planted some behind the house. Don't know why, I hate fruit. Blurgh.",
    "Yes, I'm Jack, but I'm about to leave on a trip, so this had best be important.",
    "That was a chilhood[sic] dream. Hang on, how'd you know that?",
    "Magic? Well I did have an interest in it when I was younger... Okay.",
    "Oh yeah. Hahaha. I remember.",
    "What? No, I didn't.",
    "That sounds familiar, but it's not quite right.",
    "No. That's not as I remember it.",
    "Yes, that's right. That's all I knew of back then.",
    "No. It was definitely something else.",
    "Who's Merlin? I don't remember.",
    "No. That sounds more like a place than a person, anyway.",
    "Yes, that's right! Good, old Misalionar; what a strange chap he was.",
    "I'm not sure that sounds right.",
    "Must have been. I remember that being my first birthday on RuneScape.",
    "No, I was younger than that, if I remember correctly.",
    "I don't recall any levitation. No, that's not correct.",
    "Monsters? Certainly not by my recollection.",
    "Oh, yeah. I can remember a lot of sore bones from those early days.",
    "Oh, wow, that's true! I was obsessed with chocolate cake as a child.",
    "Hmmm. I don't think I was ever interested in wealth.",
    "Hahah. Certainly not.",
    "That's true. Although, I probably had quite greedy ideas.",
    "I was many things, but I was never a bad kid.",
    "What on RuneScape is a banana?",
    "Not in these lands.",
    "My tastes may have changed, but I've never liked vanilla.",
    "That's very impressive. If you're so good at looking into the past, then perhaps you could answer a more useful question?",
    "My mother planted trees behind our house, but sadly they never grew. Perhaps you can find out why? Finding food is starting to become a real problem and, without good nutrients, we're frequently falling ill. I think she planted the trees in the wrong patches, but I'm no expert.",
    "Any luck with the trees, traveller?",
    "I hope you find something soon, I'm starving! Perhaps you should chat with Sarah; she may have some ideas.",
    "What do you mean, traveller?",
    "I never said that to you. They've been bearing scrumptious for years.",
    "I can't see why not.",
    "When I was a kid, some druids discovered runes, apparently created by Guthix himself, for us to use.",
    "Yes, he's created countless numbers of them, storing them all over the place, so, soon after their discovery, the world was dubbed RuneScape. We were initially calling it Gielinor, but, like many things of importance, different people call it by different names.",
    "Vastly! Many spells have been discovered and we keep finding different types of runes. Researchers have even started writing what they call 'spellbooks' – grouping together different types and categories of spells. The druids are becoming more commonly known as wizards, and are choosing to wear robes and pointy hats. It'll never catch on; it's a silly look.",
    "Most definitely, my friend. Although I ran out of runes and set fire to the house, I was inspired to keep at it.",
    "Not what, who! A traveller stopped by when I was younger and helped my family out. He also took the time to talk me about my ambitions. All without asking for anything in return.",
    "Indeed. I don't want to seem big-headed, but without that inspiration, I would never have founded the Wizard's Guild, although, much work remains in spreading the word about magic.",
    "Not so bad. I think I may be getting a little better.",
    "Either that or I've hurt my body so much that I can no longer feel pain. I've also scared Snowy one too many times, but I'm sure he's still fond of me.",
    "Actually, I've been thinking up spell names. I've decided to call my first spell Fire Strike!",
    "Don't you mean Super Jack the Fantasmic? Hahaha.",
    "Not bad, not bad, my friend. I'm preparing for a journey across the sea. I'll be among the first to travel across the seas of RuneScape!",
    "Ah. Right-oh, traveller."
  ],
  "The inscription reads": [
    "Our beloved Snowy. Died age 10. A truly kind-hearted dog, so gentle and fun."
  ],
  "Max the traveller": [
    "Well, hello.",
    "Definitely! Word has spread of this place and the family her, I'm sure it'll be an important location in years to come.",
    "If you are the cause for this, you must also receive my warm thanks!"
  ],
  "Congratulations! You have completed": [
    "'Meeting History' - Complete this quest."
  ],
  "(Cutscene": [
    "an elf called Haluned appears)"
  ],
  "Haluned": [
    "What are these strange beings?"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Meeting_History?oldid=36196535’"
  ]
}