{
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "Additional dialogue optionsYou can discuss this issue on the talk page or edit this page to improve it."
  ],
  "Mistag": [
    "It is good to see you again! The Dorgeshuun Council would like to ask a favour of you, if you are interested.",
    "Surface-dwellers have been visiting the mines for some time now, but no Dorgeshuun has yet visited the surface. We are curious about the surface, and we are also worried about the dangers it poses. We know that Lumbridge is friendly but we are worried that the HAM group may be plotting against us. We are planning to send an agent to the surface and we would like you to act as a guide.",
    "Thank you! In order to get into the HAM base undetected you will both need to go in disguise. You should get two full sets of HAM robes. Once you have them, our agent will meet you in the cellar of Lumbridge castle.",
    "Oh dear. Our agent is ready, but the Council will not let this go ahead without a guide. If you reconsider please let me know!",
    "Certainly. Come back soon!"
  ],
  "Player": [
    "What is this favour?",
    "I'll act as a guide.",
    "I'm too busy.",
    "Can I sell you some ore?",
    "Why do the Dorgeshuun live underground?",
    "What happened to your arm?",
    "Can you show me the way out of the mines?",
    "Yes, I'm [Player]!",
    "Yes, I have two sets of robes!",
    "Not yet.",
    "Where do i get the robes?",
    "Aren't you scared of the surface?",
    "What's that mark on your forehead?",
    "OK.",
    "See you soon!",
    "No, I'm not [Player].",
    "I need to do something else for a bit.",
    "Aren't you going to put on your disguise?",
    "Will you tell me about the mark on your forehead?",
    "Follow me!",
    "Yes",
    "Not now.",
    "We are on the surface! We're in Lumbridge Castle!",
    "Of course not! The gods don't just wander around Lumbridge!",
    "Yes please!",
    "Actually I'm not interested!",
    "Zanik is the first cave goblin to visit the surface! I'm giving her a tour of Lumbridge.",
    "I don't think Zanik has time to help you.",
    "I'd like to get into the city too.",
    "Tell be about the treaty.",
    "Have you heard of any HAM activity lately?",
    "That's the sun.",
    "What god did the Dorgeshuun use to follow?",
    "What happened in the wars?",
    "How did the godwars end?",
    "Not all the gods are bad!",
    "Bye.",
    "What?",
    "Let's go, Zanik.",
    "I'm not with her.",
    "Zanik is the first cave goblin to visit the surface. I'm taking her on a tour of Lumbridge.",
    "Don't worry, Zanik. I'm sure you're not really doomed.",
    "Oh no! You should go back home!",
    "I'm taking Zanik on a tour of Lumbridge. She's the first cave goblin to visit the surface!",
    "Yes please. What are you selling?",
    "No thanks.",
    "Yes please. What are you selling?",
    "No thanks.",
    "Hello there.",
    "Yes, let's talk about something else.",
    "No, we're leaving.",
    "Yes.",
    "What do you mean?",
    "I'm giving Zanik here a tour of Lumbridge.",
    "I need to do something else for a bit.",
    "Have you seen enough of Lumbridge yet?",
    "Yes please!",
    "Actually I'm not interested!",
    "Will you tell me about the mark on your forehead?",
    "I've lost my HAM disguise!",
    "Zanik isn't from around here.",
    "What are all you people doing here?",
    "Who are you and what do you do here?",
    "What do you think you're going to achieve?",
    "Where did all you people come from?",
    "Okay, thanks.",
    "Have you seen enough?",
    "What kind of organisation is this?",
    "Who are you and what do you do here?",
    "Ok, thanks.",
    "Are you planning to do anything about the cave goblins?",
    "Can't you please tell me?",
    "Is it really necessary?",
    "That's good.",
    "Have you seen enough?",
    "Where?",
    "You cave goblins must have better eyesight than humans. I would never have noticed it without you!",
    "How do you know they're down there?",
    "Ow.",
    "Let's go!",
    "No, there's a guard patrolling the corridor.",
    "Now!",
    "Isn't shooting people in the back wrong?",
    "How did you kill that guard in one hit? I want to learn how to do that!",
    "There are two more guards but I don't know how to get behind them.",
    "Okay.",
    "Wait here.",
    "Isn't shooting people in the back wrong?",
    "How did you kill that guard in one hit?",
    "There's just one guard left.",
    "I can't hear anything.",
    "What are they saying?",
    "Oww... my head... Zanik? Where's Zanik?",
    "Did you see what happened to my friend?",
    "Oh no! I've got to find her!",
    "What did you do to her?",
    "Zanik? Zanik! Where are you?",
    "Zanik? Are you okay? Zanik!",
    "Juna told Zanik that when the mark glowed again she should go to see her. Perhaps I should take Zanik's body to Juna. I can't leave her here anyway!",
    "I can't just leave Zanik's body lying around! I should take her to Juna.",
    "Zanik is dead!",
    "It's glowing now. Look...",
    "You can just bring her back to life?!",
    "Yes.",
    "No.",
    "I have the Tears.",
    "Yes.",
    "Juna brought you back from the dead.",
    "The plot! [Player], I've got to tell you what I heard outside the meeting room!",
    "I can't hear anything.",
    "What did Sigmund do to you?",
    "What's it like beind dead?",
    "I need to do something else for a bit.",
    "What's in these crates?",
    "Where's Sigmund?",
    "Why are you helping the HAM people?",
    "Okay",
    "There's no way I'm helping!",
    "What's in these crates?",
    "Where's Sigmund?",
    "Why are you helping the HAM people?",
    "But don't you know what they're planning to do?",
    "Thanks.",
    "I don't know, what are you thinking?",
    "Good idea.",
    "Not now.",
    "I doubt it.",
    "He must have had a ring of life! It looks like he got away from us this time, Zanik."
  ],
  "Zanik": [
    "You must be the famous [Player]!",
    "Pleased to meet you! I'm Zanik of the Dorgeshuun! I can't wait to see the surface! But first you need to get us both sets of HAM robes.",
    "All right, let's go! I can't wait to see all around Lumbridge!",
    "I'm so looking forward to seeing the surface. But the council insists that I get the disguise first.",
    "How should I know? You're the surface-dweller! Maybe you could steal them from the HAM people or something. We'll need two sets of full robes. Shirt, robe, hood, cloak, gloves, boots and badge.",
    "Well... a bit. All our legends say it's a terrible place. But that's a bad reason to not visit it. Maybe the legends are wrong. Or even if they're right, we should know for sure. And I've always wondered... what's beyond the next cave? What's at the end of every tunnel? The surface is a whole new world to explore, and I can't wait!",
    "I, er, er... To be honest I don't know. It happened when... If you don't mind, I'd rather not talk about it now. Maybe once you've shown me some of the surface.",
    "Oh well",
    "What are we waiting for? Let's go!",
    "All right. I'll wait for you in the castle cellar.",
    "There's no need for that yet. Why don't you show me around Lumbridge first? I'm so excited about visiting the surface!",
    "I, er... I will tell you, [Player], but not just yet. Finish showing me around Lumbridge and then I'll tell you.",
    "Okay!",
    "Are you ready to finish our tour now?",
    "Well then, let's go!",
    "Oh well",
    "Where are we? I thought that ladder led to the surface.",
    "It's so enclosed, it could almost be underground. Let's go outside, [Player]! I want to see the sun!",
    "There are so many people around! You must introduce me to them, [Player]!",
    "So far on the surface we haven't seen any... you know... gods.",
    "Don't they? I have no idea what to expect!",
    "I ought to visit the Duke of Lumbridge while I'm here. Ur-tag asked me to give him his regards.",
    "Why don't you take me to a shop? I promised Tignik I would bring back a souvenir from the surface.",
    "Are there still goblins living on the surface, [Player]? Are there any near Lumbridge? I should reunite the two sides of the race!",
    "It's a pity some people up here don't like me. I suppose I should have expected that. But at least you're friendly, [Player]!",
    "Duke Horacio seemed nice. But politics is just as boring up here as it is at home!",
    "That priest seemed friendly. I thought any servant of a god would be much more aggressive.",
    "Those poor goblins. It's hard to believe I'm the same species as them. No wonder the HAM people hate us if they assume we're like them.",
    "This 'wood' is an odd material. It's heavier than bone but it doesn't seem to be as brittle. It would be good for making crossbows out of!",
    "Have you seen enough of lumbridge yet?",
    "Well... our legends all talk about the gods living on the surface, but since I've been up here I haven't seen any. Is there anyone around here who might know about them?",
    "Are there any goblins living up on the surface? I'd like to see them, to see how they're different from the Dorgeshuun.",
    "I promised Tignik I would bring a souvenir back from the surface. Will you take me to a shop?",
    "I think I've seen enough of Lumbrdige now. If you like I'll tell you about the mark on my forehead.",
    "You don't care about me at all!",
    "I'm Zanik of the Dorgeshuun! Pleased to meet you!",
    "I don't know what those things are! Are they exotic surface foods?",
    "If they're the basic ingredients, why don't you already have them?",
    "Are you a... a soldier?",
    "I'm not here to invade! I'm just looking around!",
    "Come on, [Player]. At least not everyone on the surface is a soldier. Some of the council think that a war is still going on.",
    "I'm Zanik of the Dorgeshuun. Headman Ur-Tag sends his greetings.",
    "I know! But the ruling council is slow to make decisions. It's made up of old fogeys who are set in their ways.",
    "Maybe when I return I can convince them to open the gates of the city.",
    "I wish I could show it to you, [Player]! Someday I will, but I don't think the council will agree to open the doors anytime soon.",
    "This is boring. Let's go.",
    "So this is the surface! What's that? The giant light?",
    "It's so bright! I can't look at it! But it's amazing to think that there's nothing above me. Just the sun and the air and empty space, forever... For generations my people have lived with rock over our heads. But now I can see the sky!",
    "What's a church? And what is Holy Saradomin?",
    "Oh, a GOD.",
    "We DON'T worship any god! Thousands of years ago the gods made our ancestors fight in horrible wars. It was only after we escaped from them that we were able to build a civilisation.",
    "Our history does not remember his name. We know only that he was a violent god of war.",
    "Dorgeshuun history remembers them as real. But we don't know much detail. Our ancestors were just footsoldiers, they didn't know what they were fighting for.",
    "Our history doesn't make a distinction. There was your own god who would kill you if you refused to fight, and someone else's god who would only kill you if you lost.",
    "Yes, how did they end? My ancestors missed that bit!",
    "So that's why there are no gods here on the surface?",
    "I will tell the Dorgeshuun about this! The gods are gone and the surface is safe for us!",
    "Maybe that's true. I should try to approach things with an open mind!",
    "We don't like bright lights. They hurt our eyes.",
    "I can manage without Saradomin, but thanks anyway.",
    "I don't need anything you've got to sell anyway!",
    "I'm Zanik of the Dorgeshuun! Pleased to meet you!",
    "The surface is amazing! All these colours and smells and the sky is so huge.",
    "I know! Right now I'm just visiting Lumbridge, but some day I want to see the whole of the surface world!",
    "Come and find me in the city, and I'll give you the tour!",
    "I'm Zanik of the Dorgeshuun! Pleased to meet you!",
    "I'm Zanik of the Dorgeshuun! Pleased to meet you!",
    "It's amazing! The sky is so huge! But I'm not sure I'd want to like under it for too long; it's kind of scary.",
    "Doom? Where?",
    "I'm doomed?",
    "Thanks, [Player]. If there's any doom, I'm sure we can overcome it together!",
    "Go back home? I can't give up after coming this far! Doom or no doom, I'm pressing on!",
    "I'm Zanik of the Dorgeshuun! Pleased to meet you!",
    "It's amazing! The sky is so huge!",
    "But I'm not sure I'd want to live under it for too long. It's kind of scary!",
    "It's a surface shop full of exotic surface goods! What are you selling?",
    "Wow... The bucket and the hammer, what are they made of?",
    "Amazing!",
    "A wood bucket! And a wood hammer! And a newcomer map! I brought some surface money.",
    "Thank you!",
    "No thank you, I have all I need!",
    "Oh! I can't see any creature. Is it disguised?",
    "I'm not going to be part of any collection!",
    "This is ridiculous! Can't you enjoy anything without destroying it? Let's go, [Adventurer].",
    "I'm Zanik of the Dorgeshuun! Pleased to meet you!",
    "I've been training on giant frogs!",
    "Are those... goblins?",
    "H-hello? Goblin?",
    "I'm Zanik of the Dorgeshuun!",
    "Yes! The Dorgeshuun tribe? We live underground, We've been cut off from other goblins for generations but now we're back!",
    "We, er, we're your distant cousins? We want to learn about your culture.",
    "Your art! Your philosophy? Your way of life! Now that the godwars are over you must have been able to build a peaceful civilisation!",
    "Why is peace for the weak?",
    "Big High War... Oh, I see.",
    "I'm Zanik of the Dorgeshuun!",
    "We were never going to attack you! YOU nearly attacked US!",
    "Stop talking about me like I'm not here!",
    "I'm not sure a Dorgeshuun would want to marry a human!",
    "No!",
    "We would never do that! We don't tunnel upwards and we're very careful not to damage human cellars.",
    "I'm Zanik of the Dorgeshuun! Pleased to meet you!",
    "Your land?",
    "I'm sorry! I didn't realize. I'm Zanik of the Dorgeshuun!",
    "What are those things outside?",
    "There are lots of them! You know, the white fluffy things?",
    "'Sheep'! Finding all these strange surface creatures is so exciting!",
    "Duke Horacio seemed nice. But politics is just as boring up here as it is at home!",
    "I think I've seen enough of Lumbridge now. If you like I'll tell you about the mark on my forehead.",
    "...And when they opened up the giant frog's stomach they found all the missing silver, and Mistag's brooch!",
    "I hope I get ranging XP! Aaaah! What .. what's happening?",
    "I know! What happened?",
    "Wow...",
    "Ever since then I've wondered what the sign meant. But perhaps you will help me to find out, [Adventurer]! I've seen enough of Lumbridge now. Let's get to the HAM lair and see if they're up to anything!",
    "Aren't you going to put on your HAM disguise? You might be able to do without one but I don't want you giving me away?",
    "You'' have to find a new one from somewhere then.",
    "What are we waiting for? Let's get to the HAM hideout and find out what they're planning!",
    "I'm Zanik of... I mean, I'm Zanik!",
    "Oh yes. My whole city is overrun by goblins.",
    "So what's your group planning to do about it?",
    "No... I'm sure the threat will be dealt with soon...",
    "Listen to what that speaker's saying, [Adventurer]. And they're all lapping it up! No one challenges him or even asks questions. They're just sitting there while he fills their minds with hate!",
    "Let's get this over with, [Player]. Let's just find whoever is in charge.",
    "Perhaps we should talk to whoever is in charge of the HAM group.",
    "Let's have another look the main rea. Maybe there's something we missed.",
    "Not yet. THere must be another area where HAM people make their plans. We should try to find it.",
    "Look, there.",
    "Over there. There's a trapdoor hidden by dirt.",
    "What are we waiting for? We ought to go down that trapdoor and find out where the HAM people are making their plans!",
    "It's got to be somewhere. Down there is worth a try!",
    "The room where the HAM members make their plans must be down here somewhere. We've got to find it without getting caught!",
    "[Player]! Wake up!",
    "The guards caught you but I managed to slip away. Here, I'll let you out!",
    "*whispers* Get him to face away from me...",
    "We can get through this if we work together, [Adventurer]. But I can't get too close to the guards or they'll see I'm not human. You've got to get them to turn their backs on me so I can shoot them without them seeing me draw my crossbow.",
    "If you can get to the other side of that guard you can make him turn around so I can shoot him. Make sure another guard doesn't catch you though!",
    "Thanks, [Adventurer]! Is the coast clear to get past?",
    "I'll take care of him! Just tell me when his back is to us...",
    "We got him, [Player]!",
    "Why more so than shooting them in the front?",
    "It's a special technique with the bone crossbow. If we both get out of this alive I'll teach you, [Player]!",
    "Then maybe you could lead one of them past me.",
    "The guard in the east corridor... if I wait at the end of the corridor then you could lead him past me...",
    "Okay.",
    "I don't think that guard's going to move away from the door. I think we need to approach him from different directions.",
    "That's the last of them! Now to listen to what's happening in the meeting room!",
    "I think I can hear something ahppening behind the double doors. We should listen.",
    "Shh! I can hear them.",
    "They're saying something about... they're planning something... something about a machine... Oh! Oh no!",
    "We've got to do something, [Adventurer]! They're going to—",
    "Uuuhhh! Get off me, you monsters! What are you doing? Noo! Don't kill me! [Player], help me! Oh! They killed me, didn't they, [Player]?",
    "Then what am I doing here?",
    "But what does that mean?",
    "Shh! I can hear them.",
    "Let's go, [Player]! We've got to get to the Lumbridge water mill so we can foil Sigmund's plan!",
    "It was horrible, [Player]! They didn't just kill me quickly. They were enjoying themselves. The light was so bright I couldn't see but I could hear them laughing... Let's get them, [Player]! I need to save my city and I want to get my revenge!",
    "Let's go, [Player]! We've got to get to the Lumbridge water mill so we can foil Sigmund's plan!",
    "It was... it wasn't like anything. One moment Sigmund and his thugs were... you know... And then suddenly I was down in the cave and you were here. There was nothing in between. We Dorgeshuun don't believe in an afterlife. At least, if there is one we don't claim to know about it. And if anything happened to me while I was dead then I don't remember it. And now my life's a mystery too. What was that destiny Juna talked about? But there's no time for that now. Let's get to the water mill!",
    "Do it quickly, [Player]! We've got to stop Sigmund from destroying my city!",
    "We're not too late! They're still assembling the machine. Now we've got to find some way to get down there and stop them.",
    "How can we get down there?",
    "I don't know. But there must be something around here we can use.",
    "Those must be the parts for the machine they're going to use to flood my city!",
    "Hey... if I carried one of these crates I could slip downstairs and stop them!",
    "Don't you dare go down there without me, [Player]! Find some way to get us both down there so I can face Sigmund myself!.",
    "Are you thinking what I'm thinking, [Adventurer]?",
    "I could hide in one of those crates, and then you could carry me downstairs as if you were carrying some of the machinery.",
    "It worked! Now we've just got to deal with Sigmund!",
    "[Player]! Thank goodness you're all right! Now let's finish off Sigmund and his cronies before they flood the city!",
    "I won't let you destroy my home, Sigmund!",
    "let's get them, [Player]!",
    "What happened? He vanished!",
    "The important thing is we stopped him! Now let's smash that machine and then get back to Dorgesh-Kaan!",
    "Quick, [Player], let's smash that drilling machine before Sigmund returns! Then we can return to Dorgesh-Kaan for a hero's welcome!",
    "Now let's get back to Dorgesh-Kaan to tell them what happened! We can go south along the tunnel Sigmund has dug.",
    "We did it, [Player]! My city is safe! Now we can follow that tunnel south back to the mines!",
    "I'll show you the way through to the city. Wait till we tell Mistag about what happened!",
    "The city is safe! The HAM group was plotting against us, but we've stopped them!",
    "The surface is a strange and wonderful place! We should embrace it, not shut ourselves off! And not all surface-dwellers are bad. Without [Adventurer] the city would have been destroyed for sure!",
    "This is brilliant! I'm sure you won't regret this! Thank you for taking me on that adventure, [Adventurer]! I'll show you how to use the bone crossbow like I promised I would!",
    "Come find me in the city if you ever want to chat, [Adventurer]. I'm going to go and think about what Juna said about my destiny. I don't know what it will involve, but I have a feeling we will adventurer together again!"
  ],
  "Cook": [
    "What, er, who is this? Is it a cave goblin?",
    "Well, pleased to meet you, Zanik. In fact, it's a good thing I met you. It's the Duke's birthday today, and I should be making him a lovely big birthday cake. I need eggs, flour, and milk...",
    "Well, they're not exactly exotic, they're just the basic ingredients of a cake.",
    "Well, er...",
    "It was worth a try."
  ],
  "Guardsman": [
    "I'm keeping an eye on you, goblin.",
    "The Guardsmen are local farmers who also defend the town. We're not professional soldiers but that doesn't mean you can try anything. We're quite skilled at repelling goblin invaders.",
    "The Duke has told us to leave you be, but that doesn't mean I have to like it. Do your looking around and then go back home."
  ],
  "Duke Horacio": [
    "Greetings. Welcome to my castle. It's good to see a visitor from the Dorgeshuun.I am Duke Horacio.",
    "Tell Ur-Tag that I wish to speak with him again. I think that our cities could profit from trading with one another, but there can be little trade if he does not allow visitors to enter the city.",
    "Now there, child, there is room for caution and experience in politics.",
    "It basically defines the borders between our two societies. It's not usual for two states to be above one another rather than side-by-side. Everything above ground, within the borders of Lumbridge, belongs to Lumbridge. Everything below the ground belongs to the Dorgeshuun. Except for the cellars of our buildings, those belong to Lumbridge. Of course both our underground systems might expand. Neither state can build new tunnels that are too close to the other's systems...",
    "No. I know they've been gaining members but I haven't heard anything else from them. They may be planning something but then again they may not.",
    "Hello again, Zanik, [Player]. I hope you are enjoying your tour. Perhaps someday a human can have a similar tour of your city."
  ],
  "Father Aereck": [
    "Welcome to the church of Holy Saradomin!",
    "Surely you have heard of the god, Saradomin? He who creates the forces of goodness and purity in this world? I cannot believe your ignorance!",
    "Not just A god! Saradomin is the god with more followers than any other! At least in this part of the world. Which god do you cave goblins worship?",
    "Sounds like Zamorak to me! Or one of the minor gods who followed him. Saradomin would never be so barbaric.",
    "We do have stories about a war between the gods. I had always interpreted them as symbolic of the spiritual war between light and darkness in our hearts.",
    "I am sure they were engaged in a noble struggle, although perhaps on the wrong side! Saradomin was fighting to bring goodness and order to the universe, but Zamorak was leading the forces of darkness in a bid to bring eternal night to the world!",
    "Saradomin was on the brink of victory, but he could not defeat Zamorak without destroying the world. So Saradomin in his mercy allowed Zamorak to flee to another world, and all the gods agreed never again to intervene directly in the world. Again, I had always interpreted it as symbolic, but that is how the legend goes.",
    "That's right. The gods live in our hearts and listen to our prayers, but they no longer walk among us.",
    "Quite right! The Dorgeshuun have just had bad experiences of them.",
    "Exactly! You Dorgeshuun have lived in darkness for too long. But now you can come into the light of Holy Saradomin!",
    "May Saradomin bless you in all your pursuits!"
  ],
  "Bob": [
    "Get out of my shop! GET OUT!",
    "We don't serve the likes of that thing in here.",
    "And don't you come back, you filthy goblin!",
    "Oh well... what do you want?"
  ],
  "Xenia": [
    "Oh, hello. You must be one of the cave goblins from beneath Lumbridge.",
    "My name is Xenia, and it's a pleasure to meet you. I heard about how [Adventurer] made contact with your people. I'm glad to see a cave goblin adventurous enough to explore the surface.",
    "It's beautiful, isn't it? Not just Lumbridge, I mean traveling, seeing new places.",
    "You remind me of me when I was young. Ah. I shouldn't keep you. I'm sure you have more important things to do than talk to a nostalgic old lady. I hope your city opens up soon so that I can come and see it."
  ],
  "Father Uhrney": [
    "Go away! I'm meditating!",
    "I don't care! I'm still meditating!"
  ],
  "Lumbridge Sage": [
    "Greetings adventurer. I am Phileas the Lumbridge Sage.",
    "A Dorgeshuun? How curious! I don't think I've seen a creature quite like you before.",
    "Well, Zanik, I hope you like what you find up here.",
    "You get used to it."
  ],
  "Doomsayer": [
    "Doooooom!",
    "You, goblin! You are doomed!",
    "I can sense it on you! You have a terrible doom in your future!"
  ],
  "Donie": [
    "Hello there, can I help you?",
    "Hello Zanik! I hope you like what you find up here!",
    "You'd get used to it!"
  ],
  "Shop assistant": [
    "Can I help you at all?",
    "Um, yes, exotic surface goods... here, have a look at our wares...",
    "Um... wood. It, er, grows on trees?",
    "So, do you want to buy anything?",
    "There you go!",
    "How about you?",
    "Can I help you at all?",
    "How about you?"
  ],
  "Explorer Jack": [
    "Hold perfectly still! Now, don't panic but... ...you're being stalked by some foul creature.",
    "Remarkable! It can speak rather well in human tongue. I must say, it's not often you hear a goblin speak so well. In fact, it'd make a rather splendid addition to my exploration collection.",
    "Of course, we'll need to visit the taxidermist to have you stuffed. And there'll be the whole unpleasant business of... er... ending you. But then you'd be my most exquisite article!",
    "It seems I've upset your little friend. But we can discuss something else instead if you'd like."
  ],
  "Harlan": [
    "Hi there Zanik! You look like a strong fighter!",
    "You don't need any more help, then. How about you, [Player]?"
  ],
  "Goblin": [
    "Who you?",
    "Dorgeshuun?",
    "What?",
    "Culture?",
    "Peace is for weak. We goblins! We strong!",
    "Big High War God say so! He make us strong!"
  ],
  "Man": [
    "Eeek! What is it?",
    "A cave goblin? Well, there goes the neighbourhood.",
    "It's all very well the duke signing a peace treaty with those creatures. Maybe that'll stop them attacking us. Bur for them to come wandering around the surface and mixing with decent people? I don't know, what's the world coming to?",
    "Oh, they may say they're civilised, but they're still goblins. You can't trust them. The only reason they're not a threat is that they're so stupid.",
    "Keep away from me you dirty goblin!",
    "I don't know, what will be next? Cave goblins LIVING up here? Taking our jobs? Iwouldn't want my daughter to marry a goblin!",
    "What rudeness! This is why they say goblins have no manners!",
    "Goblins wandering around Lumbridge and talking to the duke like they're normal people? I don't know what the world's coming to.",
    "You cave goblins... don't you, you know, eat people?",
    "Oh! Well, that's all right then.",
    "Oh, I've got nothing against goblins in their own place. I just don't think they ought to be wandering around our city and making the place look bad.",
    "It just makes me uncomfortable, is all. What if I was in bed and some horrible little goblin poked its head up through the floor?"
  ],
  "Hans": [
    "Hello. What are you doing here?",
    "Pleased to meet you, Zanik! I know not everyone in Lumbridge was pleased with the peace treaty, but I'm delighted to have new underground neighbours."
  ],
  "Fred": [
    "What are you doing on my land?",
    "Yes, my land! This is my farm!",
    "So you're one of them cave goblins, then? I suppose you weren't to know.",
    "Things? There's more than one now?",
    "Oh, you mean my sheep!"
  ],
  "Juna": [
    "Your stories have entertained me. I will let you into the cave for a short time.",
    "It is not normal for the Tears to have that effect.",
    "It is a sign. The power of the Tears has marked you for a special purpose. I cannot tell you more now. That mark will soon fade, but someday it will glow again, and on that day you should return to me so that I can tell you more about your destiny.",
    "Tell me... a story...",
    "That cannot be. She had not yet returned to learn of her destiny. The mark that the tears gave her had not begun to glow again.",
    "This is indeed strange. I must commune with mighty Guthix and the forces of destiny.",
    "Zanik's death was premature. The gods will allow it to be reversed.",
    "The Tears of Guthix have powers beyond the understanding of mortals. They can restore her to life, with the gods' permission.",
    "You must collect some of the tears using Zanik's tear-bowl. Although I would not normally deem you worthy to collect the tears, I will let you into the cave for this special purpose.",
    "You must collect some of the tears using Zanik's tear-bowl. I will not count this against the next time you can collect the tears for yourself.",
    "Are you ready?",
    "Twenty tears should be sufficient. Collect twenty blue tears, but remember that green tears will decrease the amount of blue.",
    "Then the forces of destiny must wait until a time that is more convenient for you.",
    "Zanik has not yet fulfilled her destiny, so the gods will allow her to be resurrected. You must collect some of the Tears of Guthix to allow this to happen.",
    "Then I will call upon their power.",
    "Listen to me, Zanik. You are marked for a special purpose, and you have been granted a new life so that you can carry it out. Your destiny is to lead all goblins into a new age.",
    "Someday you will know. But today you must hurry to foil the plot that even now threatens your home!"
  ],
  "H.A.M. Guard": [
    "Hello [Brother/Sister], you fit in much better now that you're correctly attired. Before you stuck out like a sore thumb! Keep your eyes peeled though, I've heard there are thieves among us! I don't think I've seen you before! What's your name?",
    "Zanik? What kind of a name is that?",
    "It's good that we're getting members from further afield! Is the monster problem very bad where you're from, Zanik?",
    "Goblins? That's terrible! You know, there are goblins living right underneath Lumbridge. And the duke is treating them as if they were people like you and me! He's even signed a peace treaty with them!",
    "Johanhus doesn't tell his plans to ordinary members like us, but I've heard he and Sigmund are planning something big. I don't think we'll have to worry about the cave goblin threat for much longer!"
  ],
  "Johanhus Ulsbrecht": [
    "Welcome, [brother/sister], to our organisation. Ours is a fight for humanity in all its shapes and forms... and to rid mankind of the monsters that exist in our world. We have no quarrel with a fellow [brother/sister].",
    "You should know, brother... we don't let ordinary members in on all our plans... but rest assured those foul creatures will be dealt with very soon!"
  ],
  "Johanhus UlsbrEcht": [
    "No! That kind of information is for... only senior members of the group. Ordinary members like you must learn to... trust your leaders.",
    "How can you even... ask that? Right beneath Lumbridge is a whole cave system full of those creatures! They've got a passage leading right up into the castle ktichen! And I've heard that theres a whole city of those things down there, not that anyone has ever seen it. WHat have they got in there? What are they planning? We've got to get them before the get us!"
  ],
  "Guard": [
    "Hey! Ordinary members aren't allowed here! Go back upstairs and I'll say nothing about it. But if any of the other guards see you you're in big trouble!",
    "Hey! Where do you think you're going? Uh!",
    "Hey! What are you— Unk!",
    "Hey! You there!",
    "There's no more guards! We've got them all!",
    "Got you, you spy!"
  ],
  "Jimmy the Chisel": [
    "Hello mate!",
    "There was a lot of commotion when they dragged you in here. There was someone else, she was struggling like anything. They said they'd take her outside. Dunno what happened to her then."
  ],
  "Johanus Ulsbrecht": [
    "So, you got out of the cell? No matter... your goblin friend has already been dealt with... and Sigmund is on his way to deal with rest of her foul brood!"
  ],
  "H.A.M Member": [
    "Did you hear? They caught a goblin spy down in the store rooms!",
    "Oh, Sigmund and some of the guys took it upstairs and dealt with it. Can't have goblins coming down here!",
    "You should have seen how it was screaming for mercy! Those monsters aren't so tough when they're outnumbered twenty to one!",
    "These crates are heavy! I could do with some help if that's what you're here for.",
    "*pant* Go away, outsider! *pant*"
  ],
  "Sigmund": [
    "Good news, brothers! Our tunnel from the water mill has reached the cave goblin tunnels, and the last shipment of machinery is on its way from Keldagrim.",
    "I'll need to take some of the low-level members to help unload the machinery at the Lumbridge water mill.",
    "Soon the mighty River Lum will wash away those evil goblins forever!",
    "[Player]! You and your goblin friend have interfered for the last time. Guards, kill them!",
    "Saradomin protect me from melee!",
    "Saradomin protect me from this foul goblin!",
    "Curse you, [Player], and your goblin friend! You win this time, but we will meet again!"
  ],
  "Johanus Ulsbrucht": [
    "Do we have to deal with the dwarves? They may not exactly be monsters but they're still not human.",
    "By all means. It's about time that lot made themselves useful."
  ],
  "HAM member": [
    "If it wasn't for the King's tolerance of monsters, we humans would have a better industry than the dwarves!"
  ],
  "HAM Deacon": [
    "Well said, brother!",
    "Saradomin will surely bless us for destroying those abominations!"
  ],
  "All": [
    "Death to the Dorgeshuun!"
  ],
  "Dwarf": [
    "Oh, it's another one of you funny people. Okay, grab one of the crates and take it downstairs. I told your boss how to put the parts together.",
    "Didn't your boss tell you? It's a digging machine. Very special. Digs straight up, and can work without supervision when it's turned on.",
    "What, your boss? He's downstairs waiting for you slakcers to carry the rest of the crates down. So get a move on!",
    "Is that what you people call yourselves? Well, it's certainly not out of the goodness of my heart. Your boss paid good money for this machine, plus my fee for transporting it all this way. So get to work and get it downstairs!",
    "Oh, honestly! If you're not here to help then get out of the way!",
    "What do you want?",
    "None of your business! Those funny pink-robed people told me to keep it a secret!",
    "The guy who ordered all this? I don't see that's any of your business.",
    "What, these odd pink-robed people? Oh, the normal reason. Because they paid me.",
    "No, and I don't want to. Now go away!",
    "Where do you think you're going? Only people helping assemble the machine are allowed down there!"
  ],
  "Ur-tag": [
    "Welcome back, Zanik. What have you to report?",
    "You stopped them this time, but the surface still poses a danger. The council has been debating how much contact we should have with it, and wants you to make a recommendation.",
    "[Adventurer], we are in your debt once again. The council has voted that, if Zanik's recommendation was positive, humans from Lumbridge should be allowed into the city. You may now enter Dorgesh-Kaan!"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Death_to_the_Dorgeshuun?oldid=36229789’"
  ]
}