{
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "Extra dialogue options, gender-specific conversations with Vargas' childrenYou can discuss this issue on the talk page or edit this page to improve it.",
    "Dialogue with Baba Yaga is needed as the rest are missing towards anger.You can discuss this issue on the talk page or edit this page to improve it."
  ],
  "Baba Yaga": [
    "I don't think you'll get much talk out of him.",
    "I wish I knew. He washed up on the shore as though he'd fallen from a ship, but we never saw it. I was hoping that you'd be able to help me.",
    "Wonderful! Now where to start? He looks surprisingly healthy, considering. He still hasn't come around, though. I'm worried that he may have some illness of the mind.",
    "There is one thing we could try.",
    "Let us travel into his dream world and see if we can't find the root of the problem!",
    "Good! Remember, anything can happen in a dream world. I'm sure you remember all the fighting last time you went, so, if I were you, I'd come ready for war. I'll sort out the potions we need. Meet me back here when you're ready and we'll go to the brazier together.",
    "That is a shame. Be sure to come back when you can.",
    "Have you decided to help us?",
    "Are you ready? Don't forget that the consequences of anything that happens to you in a dream world may be only too real.",
    "Excellent!",
    "Hurry, he may be in danger.",
    "What is this place? It looks like the home of our sick sea-captain.",
    "Really? None at all? Let's think about it: we've got pieces of dream world arranged like the floors of a tower, with a big flashing glow at the top.",
    "Only literally. There are other platforms above and below. A tower here doesn't need walls, only for the dreamer to expect it to stand.",
    "I think so. Don't forget the flashing light.",
    "I doubt it. It's very spacious for a ship, and even in a dream world you expect it to move a little. It's almost like a tower, and don't forget the big pulsing glow up above.",
    "Do you know what happened to him?",
    "I think that's what he's writing now.",
    "Well, yes, but what does that tell you?",
    "Have you seen what he's writing?",
    "Having come into his dream world to help him with his real-world catatonia, I would be quite disappointed if he weren't.",
    "Indeed.",
    "Come on, I don't think we're helping much here. Let's search the room and be moving on.",
    "Hurry up. I've been in the dream worlds of some pretty strange people, and the atmosphere here is...unusual.",
    "Are you sure we've searched the room thoroughly? We might not be able to get back once we leave.",
    "That's probably all we're going to find here. I wonder where the stairs lead.",
    "Not that way, we need to press on.",
    "Wait, we can probably learn something here.",
    "Let's see if we can hear anything.",
    "Her plan sounds quite thorough.",
    "That doesn't sound good at all. We need to find a lectern and get out of here. Let's check out that tunnel over there.",
    "Come on, let's get out of here!",
    "Look, he is on his own at last! Perhaps this one can see us.",
    "We're here to help you get away from here. Hurry, [Fremennik Name], try the lectern.",
    "Finally, a way out. Except... It's not working!",
    "I don't know, I'll have to study it.",
    "Oh, you really are sick, aren't you? She's not sending them, not in here. You are the only one making the danger in here. [Fremennik Name], I need you to hold them off. Don't worry about me, just keep their attention and keep yourself alive until the lectern is ready. I'll help where I can.",
    "I have # sharks left",
    "Did it! That was close!",
    "You left the dream world without a lectern, and made me come back as well! In the dreams of a fragile mind we cause more harm than good if we don't follow the rules.",
    "Now, are you ready to go back?",
    "Good.",
    "I don't see any change, yet.",
    "Oh my, the Oneiromancer!",
    "... ... ...",
    "Already? But that's terrible!",
    "If you're ready now, I know a trick to get you there quickly.",
    "Don't be too long.",
    "Could I just see your seal of passage for a moment, please?",
    "What are you doing here, Fremennik?",
    "Ready to join the battle for Relleka?",
    "[Fremennik Name], Chieftain Brundt: I'd like to talk about the prophecy tablets we've been finding.",
    "Except that, this time, we've almost got the whole set.",
    "Chieftain, I'm sorry about that, but it was a long time ago. We've got more pressing concerns now.",
    "[Fremennik Name], did you bring all the ones you found so far?",
    "Not to worry. I had a look at the one you found in the dream world lighthouse. It said: 'When the tide is strongest, Good Intent will be needed once more.'",
    "I have another tablet. We found it near where Silas had washed up. It reads: 'The lost Mother is dead, her Daughter risen in her place.' Then there's the one Chieftain Brundt and his friends recovered all those years ago, which said: 'And [his/her] name will be [Fremennik Name].' For a long time I was too short-sighted to understand the last one, but now it sounds like you're the one fated to sort this out.",
    "Yeah, that looks right! And 'And [his/her] name will be [Fremennik Name].' is probably last.",
    "I'm not so sure about that.",
    "Well, I'd guess that first comes this one: 'All-consuming Darkness will rise from the sea, unleashed by Good Intent.' 'The lost Mother is dead, her Daughter risen in her place.' sets the scene a little more, so that's probably next. 'And [his/her] name will be [Fremennik Name].' sounds like it should be last. That leaves us with 'When the tide is strongest, Good Intent will be needed once more.' in between.",
    "Perhaps.",
    "Not quite. The second tablet worries me. [Fremennik Name], have you seen a dagannoth mother before?",
    "I thought so. Under the lighthouse, yes?",
    "I think [Fremennik Name] is the 'Good Intent that unleashed the Darkness'.",
    "[He/she] had no choice, Brundt. Let's not dwell on it. I think the lesson that we need to learn is that we mustn't kill the mother; she needs to be confined somehow, so that the colony can't replace her.",
    "Come on, let's keep going.",
    "We should have someone take watch here in case the dagannoths sneak up behind us.",
    "Wait! What's that noise behind us?",
    "The Dagannoth Kings? I have heard of them. [Fremennik Name], you go ahead and deal with the mother. The rest of us will help Koschei.",
    "We will be fine. I promise.",
    "Between us you have a master swordsman, an archer and a lunar mage. Not to mention Prince Brand to keep up the morale. We will be fine, I promise.",
    "Oh, [Fremennik Name], thank goodness you're alive. We barely made it through, those of us who made it at all.",
    "Let's get out of here.",
    "Oh, [Fremennik Name], thank goodness you're alive. I'm sorry for your loss.",
    "I don't know what else I can say, [Fremennik Name]. I did everything I could, but it wasn't enough.",
    "That's not true! We needed both of them! There was no way Koschei and I would have managed without them.",
    "I know, and that was a mistake. I made a promise I couldn't keep and for that I'm sorry. Your wife/husband died a heroine/hero and saved us all.",
    "Listen to yourself, [Fremennik Name], you dishonour her/his memory by ignoring what she/he achieved",
    "I don't have to put up with this.",
    "I did, [Fremennik Name]. I did.",
    "They didn't die in vain. We would have lost without them, then you would have had the dagannoth kings at your back while you fought the mother.",
    "So, the mother is defeated? I think we have to consider that a good result, on balance. Silas was making a strong recovery and seemed really eager to go, so we let him leave.",
    "Exactly. I'm not going to look after someone against their will. He will be safe, don't worry."
  ],
  "Player": [
    "Who is he?",
    "Yes, I think I can manage that.",
    "Is there anything we can do?",
    "Sounds like a lost cause.",
    "Yes?",
    "I think I can guess what's coming.",
    "An excellent idea!",
    "If we must.",
    "I'm sorry, I'm far too busy.",
    "I am ready.",
    "Not yet.",
    "I've no idea.",
    "Let me guess: is it some kind of floating platform with no walls?",
    "So it's a tower.",
    "It's a big cabin on a mighty ship.",
    "I think I've got it. I remember this place – at least, the real one. It's a lighthouse. This is his home, but he's no sea-captain; he's the lighthouse keeper. Or at least he was.",
    "His name is Silas. He went missing and I helped his nephew look for him, but we never found him. It seems that he became obsessed with the creatures in the basement of the lighthouse. His journal from the time is quite a disturbing read.",
    "It's a tower with a flashing light?",
    "He's crazy.",
    "Poor man.",
    "She didn't count on us finding out.",
    "I'll stop her!",
    "I'm a friend of your nephew.",
    "I'm a powerful hero, come to save you.",
    "None of your business.",
    "What do you mean, 'not working'?",
    "Can you make it work?",
    "I'm ready.",
    "What is?",
    "Will you two please stop that?",
    "I need to go to the bank first.",
    "I'm ready. What's your trick?",
    "Now what?",
    "What? But I have a seal of pass... Oh, I get it. I see what you did there.",
    "What is the matter, Your Majesty?",
    "I'll set out right away.",
    "I'd love to help, but Rellekka needs me.",
    "I know: King Vargas is missing. The dagannoths of Waterbirth Island have him.",
    "You haven't lost him.",
    "You'll never lose me, Astrid.",
    "Let's just see how it goes.",
    "You haven't lost your father.",
    "You'll never lose me, Brand.",
    "Let's just see how it goes.",
    "Chieftain Brundt, could I have another seal of passage, please? Baba Yaga kept mine when I came back to help.",
    "I will stay here for the moment.",
    "I'll go with you.",
    "Could we go to the bank on Etceteria, please?",
    "What kind of voices?",
    "Sounds that way to me.",
    "Could it be an old man echoing from underground?",
    "Have you seen anything else that was strange?",
    "We aren't out yet.",
    "You probably still will be.",
    "Come on, this isn't the King Vargas I'm used to.",
    "Pull yourself together, Your Majesty.",
    "No, I can imagine.",
    "That's more like it. Good to have you back, Your Majesty.",
    "Yes, it is. I do heroic things all the time, but you don't see me complaining.",
    "I'll have to take the passage to the lighthouse.",
    "Let's go that way then.",
    "Thanks.",
    "Certainly, I've got some here.",
    "I will do.",
    "I have, but I might need it later.",
    "I'll see what I can do",
    "I'll stay close to you. Come on.",
    "Phew, barely made it out of there. Now I suppose I need to find King Vargas again.",
    "Sure, let's go.",
    "Is everything all right up there? I knew I should have gone first.",
    "Well, as quickly as you can, please.",
    "You aren't gravely wounded, you sop!",
    "Don't touch anything! Just get up the ladder and out of the way!",
    "Hurry up! You're going to get us both killed!",
    "Pardon?",
    "Who did?",
    "Where am I?",
    "Am I...dead?",
    "I'm not supposed to be here?",
    "Can you at least explain where I am?",
    "I know what this place is.",
    "This is some great afterlife for warriors to sit and drink.",
    "And you say I'm not allowed in?",
    "I'd best be getting back, then.",
    "Where is 'here'?",
    "How do I get back then?",
    "I bet they're all drinking.",
    "So now what?",
    "Can you send me back?",
    "How do I get back?",
    "...",
    "Hey, that's not fair!",
    "She took the news well. Last time I spoke to her she was going to move to Neitiznot to be with her brother.",
    "The dagannoths are mounting a massive attack on nearby settlements.",
    "It's nothing I can't handle.",
    "Well, you wouldn't normally find me here.",
    "Oh, you know, bits and pieces...",
    "...",
    "I'm not falling for that again.",
    "Just passing through.",
    "I could ask you the same question.",
    "You realise they're waiting for a huge battle?",
    "I don't recall that working out so well last time.",
    "Just provided you realise the danger.",
    "I'd rather carry on with my quest, thanks.",
    "Yes, please.",
    "Not yet, thank you.",
    "What happened?",
    "Where am I?",
    "I'm always up for a challenge",
    "I don't like the sound of that.",
    "I'd be honoured, Your Majesties!",
    "I suppose I could do that.",
    "I don't really know what to do.",
    "(Chosen response)",
    "...we are gathered here today...",
    "(Chosen response)",
    "...to join this man and this woman in matrimony.",
    "...to bring together the great kingdoms of Miscellania and Etceteria, by joining their rulers in matrimony.",
    "...to bring war to the daggermouths and crush them beneath our boots!",
    "Well, we didn't really come here for the wedding. With a bit more planning you could have had it somewhere much nicer.",
    "Yes, certainly.",
    "I suppose so.",
    "Do you, King Vargas, take Queen Sigrid as your lawful wife?",
    "(Chosen response)",
    "(Chosen response)",
    "Do you, Queen Sigrid...",
    "...take King Vargas as your lawful husband?",
    "(Chosen response)",
    "(Chosen response)",
    "Same question.",
    "Obviously. Well, do you?",
    "Then, by the power vested in me as Regent of Miscellania and Etceteria, I pronounce you husband and wife.",
    "That's a(n) [wonderful/excellent] idea!",
    "There is nobody to perform the ceremony.",
    "Very well.",
    "Let's discuss it later.",
    "Yeah, about the whole marriage thing...",
    "I, [Fremennik Name]...",
    "...take thee, [Astrid/Brand]...",
    "...to be my [wife/husband] until death.",
    "...take thee, [Gudurn/(Transcript missing. edit)]...",
    "Astrid, I mean Astrid.",
    "I do.",
    "Well, actually...",
    "Nothing, sorry, carry on.",
    "I don't think this is such a good idea.",
    "Agreed, let's get a move on.",
    "Actually, could you drop me off at the bank on Etceteria?",
    "I'd like to stay here a while longer.",
    "Let's go now.",
    "Later, perhaps.",
    "(Say nothing)",
    "Got there in the end.",
    "Yes, I have two.  The one from the lighthouse says: 'When the tide is strongest, Good Intent will be needed once more.' King Vargas gave me one saying 'All-consuming Darkness will rise from the sea, unleashed by Good Intent.' I wonder what that is supposed to mean.",
    "I've seen two, if you don't count the one Chieftain Brundt and the others fought a yeti for. I didn't bring them, though.",
    "(Work out the order)",
    "What do you think?",
    "Yes, I have – I killed her.",
    "(Lie) No, I haven't.",
    "I don't remember.",
    "No, of course not!",
    "Yes, I suppose it is.",
    "That's not fair!",
    "(Any Response)",
    "I know where her lair is; King Vargas told me.",
    "I'm ready.",
    "I'll speak to you again when I'm ready.",
    "Yes, let's go now.",
    "Later, perhaps.",
    "That sounds reasonable.",
    "I suppose so.",
    "Good luck.",
    "I need you with me.",
    "You'll be killed!",
    "What, no speech?",
    "I thought there might be a bit more. You know, from someone with such flowery speech. I suppose that's the Silas influence. Did you ever read his diary?",
    "Of course not.",
    "Maybe just a little.",
    "No, I wasn't complaining.",
    "Whatever.",
    "So, if I weaken the pillar and prop it up with wood as I go, I can then set fire to the wood and run.",
    "Stupid thing. Just a bit more.",
    "Aaghhh!!!",
    "Excellent!",
    "Actually, I was hoping you'd say that.",
    "I'll live.",
    "I seem to have died again.",
    "Yes, I am.",
    "Not yet.",
    "Poor [Brand/Astrid]. She will be missed.",
    "Astrid? Astrid, dear? No!",
    "Wait until I find those kings...",
    "Poor Astrid. She will be missed.",
    "What happened here?",
    "You're 'sorry'? Is that it? My [wife/husband] is dead and you're 'sorry'?",
    "You're right, I'm sorry.",
    "You promised to keep her safe!",
    "She/He was no use to you, but you took her/him anyway and assured me she/he would be fine!",
    "You promised...",
    "You're right, I'm sorry",
    "What good is that?",
    "If it wasn't for you she'd/he'd be safe on Miscellania now, rather than lying lifeless in this foul cave.",
    "You're right, I'm sorry",
    "How dare you?",
    "Don't lecture me about honouring my wife, you arrogant witch!",
    "I'm sure you did everything you could.",
    "Thank you. I'll make sure King Vargas hears that.",
    "They didn't make it.",
    "Dead, all of them.",
    "He's right. We've won!",
    "The war is won, but the price was heavy.",
    "Don't worry, I will.",
    "Well, I suppose if he was healthy enough...",
    "You just let him go?",
    "It's good to have King Vargas back.",
    "I think I may have found your uncle.",
    "Well, he was being looked after by the mages in Lunar Isle but, when he got better, he wanted to leave, so they had to let him go.",
    "At least we know he's alive and well. I'm sure he'll show up sooner or later.",
    "Have you heard any news of the Fremennik war against the daggermouths?",
    "I'm surprised to see you still here.",
    "I have good news. I've been to the afterlife - long story - and Nial was there, safe and sound.",
    "Greetings, Hamal. I have good news. I have been to the afterlife and can tell you that your daughter made it there safe and sound.",
    "I have good news. I have been to the afterlife and Asleif is there, happy and peaceful."
  ],
  "Silas": [
    "Dagannoth! I know thee! I call thee! For I too am of the ocean, I too know this land as home! Home? Perhaps. Where did you come from? Where do you plan to go?",
    "I cannot imagine anything more glorious, my lady.",
    "Who are you?",
    "Now you've done it! They're coming! She sends them for us!"
  ],
  "You find a stone tablet with an obscure inscription": [
    "When the tide is strongest, Good Intent will be needed once more."
  ],
  "Dagannoth Mother": [
    "Observe the power of my army!",
    "Soon they will march on the barbarian port and lay waste to it all. The Jah-Nay Islands will not attack us once they have seen their mainland friends destroyed, and the riches of the Misk island will surrender quickly when they realise we have their king.",
    "Once my beautiful children have developed the new immunities I have mastered, the world will be as a toy to us. I doubt the modern humans can forge a weapon that could hurt me, and soon my entire army will be invincible too!",
    "So, finally you darken my door. Time to die.",
    "What were you expecting? 'You can't win, [Fremennik Name]. Strike me down and... blah blah blah.'",
    "Are you mocking me?",
    "ENOUGH! I know what you're planning and it won't work, because I'm going to kill you. Simple enough?",
    "Argh! That axe! Where did you get it?",
    "No! You cannot do this!"
  ],
  "Oneiromancer": [
    "... ... ... ...",
    "...",
    "While you were gone, we had word from Rellekka. They've got hordes of the creatures they call daggermouths swarming in from the sea. [Fremennik Name], you must go and help as soon as possible!",
    "I hear that it is over, and that you are the one to thank. You've made the seas around here a safer place."
  ],
  "Brundt the Chieftain": [
    "Come on, [Fremennik Name], we must kill more!",
    "The tide is turning, and I see a longship on the horizon! Get to my boat and we'll go to meet them.",
    "Come on, [Fremennik Name]! Get to my boat!",
    "Thanks for your help defending Rellekka, [Fremennik Name].",
    "Good show, [Fremennik Name]. We can hold the fort here.",
    "Nonsense, [Fremennik Name]. We can hold the fort here.",
    "Go and solve this, [Fremennik Name]! We can hold the fort here.",
    "Of course, [Fremennik Name]. This 'Baba Yaga' sounds like a shifty character. If you've got everything you need, I suggest you use your Fremennik sea boots and enchanted lyre to go straight to their doorstep, getting the jump on the daggermouths! When you get there, keep an eye out for Bardur. He's always there slaying daggermouths: perhaps he'll have seen something. If you'd rather, you can come back to Rellekka with me to prepare.",
    "Of course.",
    "Need to resupply, yes? Good plan!",
    "What are you waiting for? You need to rescue King Vargas from Waterbirth Island! When you get there, keep an eye out for Bardur. He's always there slaying daggermouths: perhaps he'll have seen something.",
    "A strange woman came looking for you. She said she needed you to go to her, and that you might not know the way. She handed me a note to give to you. Sounds magical to me, but having her in my hall made everyone feel like the Father was watching over it, so I think we need to trust her.",
    "Ah, [Fremennik Name], good to see you lively again.",
    "We found you below the lighthouse and brought you aboard my ship. There was a rockfall - some kind of daggermouth trap, we think. King Vargas signalled us and we went down and got you.",
    "...",
    "[Fremennik Name], come and stand at the bow. I'll move out of the way.",
    "Come on, [Fremennik Name], get on with the ceremony.",
    "I think [Astrid/Brand] wanted to speak to you.",
    "Of course, Your Royal Highness. Although, if you don't mind, I'll keep it short. There is a war on, after all. Places everyone!",
    "Nonsense, [Fremennik Name]. Granted, you probably shouldn't be married by the king or queen, but I am the leader of my people and this is my ship.",
    "Then it's settled. If you don't mind, though, I'll keep it short - there is a war on, after all. Places everyone!",
    "Before these two young heroes are forever tied, I must ask whether there is anyone present with good reason that it should not be so.",
    "[Princess Astrid/Prince Brand], repeat after me: I, [Astrid/Brand], take thee, [Fremennik Name], to be my [husband/wife] until death.",
    "Now you, [Fremennik Name]: I, [Fremennik Name]...",
    "...take thee, [Astrid/Brand]...",
    "...to be my [wife/husband] until death.",
    "Then, as Chieftain of Rellekka and captain of this ship, I pronounce you partners for life.",
    "I'll continue, if I may? [Fremennik Name], do you take Astrid to be your wife until death?",
    "Then, as Chieftain of Rellekka and captain of this ship, I pronounce you man and wife.",
    "What is it, [Fremennik Name]?",
    "Well, that's more than enough reason to stop the ceremony. Still, at least we can get on with the war, right, Princess?",
    "Let's get back to Rellekka and prepare for the final assault.",
    "I'll be in the long hall when you're ready to set sail again.",
    "Of course. I have to go back to Rellekka, though, so look for me in the long hall there when you're ready.",
    "I understand; it's important to keep up morale. Speak to me again when you want us to make port.",
    "Are you ready to set sail for Waterbirth? Remember to bring Queen Sigrid's axe and everything else you might need for the glorious battles that lay ahead!",
    "See the mighty fleet we've put together? Fremennik warriors and their allies as far as the eye can see!",
    "Blasted prophecy tablets. Always trouble.",
    "This time? You mea-You! You're the one who stole my prophecy tablet then messed with my memories!",
    "I suppose that is true. Come on then, how can the prophecy help?",
    "King Vargas showed me the other one. It said: 'All-consuming Darkness will rise from the sea, unleashed by Good Intent.'",
    "Never mind that. It's only a bunch of old carvings.",
    "Well, can it tell us how [Fremennik Name] is to solve this? It doesn't seem to have any advice for us. I suspect there's one still missing, possibly telling us how this will end.",
    "But, as it is, we are told nothing about the present or the future?",
    "I tire of all this talk! What are you saying, witch?",
    "What? [Fremennik Name], this is your doing?",
    "Very well, [Fremennik Name]. When we arrive at Waterbirth, you should take a small group there and deal with her. I will lead everyone else in a frontal assault to cause them casualties and buy you some time. We'll land as soon as we're all ready.",
    "I was hoping you'd say that.",
    "How do you do that? You just jump overboard? I've come back for you, but we really must get back to the fleet.",
    "This is a grave day, [Fremennik Name]. Without you to defeat the mother, our offensive collapse. Go to the hatchery under Waterbirth as quickly as you can. The rest of your group will meet you there and we will try and stage another diversion.",
    "Quick, [Fremennik Name], our offence is failing and we must get to my boat before they retaliate!",
    "Ah, what a mercy that you're survived! Where are the others?",
    "Oh, [Fremennik Name], this is a solemn day. What of the daggermouth threat?",
    "We found another of those damn prophecy stones during the raid. 'Wits and Skills will bring the Light; fate does not dictate.' Stupid thing was just taunting us and had no intention of helping at all. I'm going to destroy it when I get home; I suggest you do the same with yours.",
    "Let's go to the islands and spread the word. King Vargas should hear of his loss.",
    "Ah, you have come to claim the rest of your reward! Tell me what you would learn, and I will have the most appropriate of my men or my allies impart their wisdom.",
    "[Fremennik Name]! The mother is defeated and the colony is under control once more! This is a joyous day for the mighty Fremennik and their allies!"
  ],
  "Queen Sigrid": [
    "Oh, Your Royal Highness, thank goodness we've found you. We must speak at once.",
    "King Vargas is missing! He went looking for treasure under Waterbirth Island and we haven't seen him since. We were about to announce our engagement.",
    "[Fremennik Name], I want you to have this. It's been in my family for generations, from the times when we used to send raiding parties to Waterbirth like the Fremennik do. It's said to be made of some legendary ore and sharpened on the hides of dagannoths, and is particularly good at killing them.",
    "By the way, don't let King Vargas near that axe. I love him dearly, but he can be so clumsy at times.",
    "[Fremennik Name], I want you to have this. It's been in my family for generations, from the times when we used to send raiding parties to Waterbirth like the Fremennik do. It's said to be made of some legendary ore and sharpened on the hides of dagannoths, and is particularly good at killing them.",
    "By the way, don't let King Vargas near that axe. I love him dearly, but he can be so clumsy at times.",
    "Thank you, [Fremennik Name], but I cannot rejoice in it without him.",
    "[Fremennik Name], I want you to have this. It's been in my family for generations, from the times when we used to send raiding parties to Waterbirth like the Fremennik do. It's said to be made of some legendary ore and sharpened on the hides of dagannoths, and is particularly good at killing them.",
    "By the way, don't let King Vargas near that axe. I love him dearly, but he can be so clumsy at times.",
    "You know?",
    "I need him back, we were about to announce our engagement.",
    "Please, hurry! Speak to Chieftain Brundt and he can take you back to Rellekka.",
    "Oh, stop wasting time with your pointless trinkets, Vargas.",
    "[Fremennik Name], we're so grateful for everything you've done, but we have a favour to ask.",
    "Stop beating about the bush, dear. [Fremennik Name], more than bringing the kingdoms together you've helped bring the two of us together, what with sorting out our misunderstandings...",
    "What my fiancé and I are trying to say is...",
    "I... might have let it slip.",
    "Just make sure you get it done before King Vargas gets himself in trouble again.",
    "Let [him/her] finish!",
    "Pardon?",
    "Well, could you pretend, please, as a favour to me? This being my wedding day and all.",
    "I do.",
    "Apart from the names and about him being my husband?",
    "I do.",
    "Thank you, [Fremennik Name]. I think [Astrid/Brand] wanted to speak with you.",
    "I'm so pleased for you and [Astrid/Brand]. Congratulations! When you're ready for us to make port you should speak to Chieftain Brundt.",
    "It's a shame that it didn't work out for you and [Astrid/Brand]. When you're ready for us to make port you should speak to Chieftain Brundt.",
    "Thank you for everything, [Fremennik Name]. It was hard to move out of my beloved castle, but worth it to be with my husband."
  ],
  "I know": [
    "King Vargas is missing."
  ],
  "Princess Astrid": [
    "Oh, my darling [Fremennik Name], it's so good to see you here. Listen, when this is over we should get married as soon as possible. I don't want to lose you like I've lost father.",
    "Thank you, I feel so much better now you've said that. I hope you're right.",
    "Thank you so much! I feel so much better now!",
    "Ah, Your Highness, good to see you.",
    "Well, hurry up - I love weddings!",
    "That was a lovely ceremony. Well done.",
    "What a nice ceremony. Good job.",
    "Ah, that was beautiful. I had a thought: since the times are so dangerous, why don't we get married? It seems like we've been engaged for ages.",
    "Oh, I'm so happy. Thank you, darling.",
    "... ...",
    "I'll put an arrow between the eyes of anything that threatens us."
  ],
  "Prince Brand": [
    "Oh, my darling [Fremennik Name], it's so good to see you here. Listen, when this is over we should get married as soon as possible. I don't want to lose you like I've lost father.",
    "It's nice of you to say that. I hope you're right.",
    "Ah, Your Highness, good to see you.",
    "I'm so glad you're here.",
    "Don't keep them waiting.",
    "That was wonderful. It occurred to me: since the times are so dangerous, why don't we get married? It seems like we've been engaged for ages.",
    "Congratulations! This is so wonderful.",
    "Shame about Astrid.",
    "This will be a wonderful subject for my next song."
  ],
  "Princess Astrid/Prince Brand": [
    "You should talk to Queen Sigrid; this is her expedition."
  ],
  "Chief Brundt": [
    "Well, speak to me if you want to go back to Rellekka."
  ],
  "Bardur": [
    "[Fremennik Name], am I glad to see you! I hear voices on the wind! I think I'm going crazy!",
    "I was getting some air before I went back down to keep culling the fledglings, so when I heard a ghostly voice, like an old man from the beyond...",
    "Now that you mention it, I did see a hole that I hadn't noticed before, way round to the south. I've got spare rope if you want to go down there.",
    "Good luck.",
    "[Fremennik Name], can you hear me? There are daggermouths swarming out of the cave entrance up here. Can you find a safer way out?"
  ],
  "King Vargas": [
    "Oh, [Fremennik Name], thank goodness you've found me! I thought I'd be dead for sure.",
    "Well, we'd be fine if I were on form. It's just that they've been wearing me down for so long, foiling every attempt to escape. We'd better get back, because it'll be dark soon, and they mostly come at night. Mostly.",
    "Look, it's not easy being a great hero all the time.",
    "We can't go south from this chamber – that doorway goes towards the mother's lair. There's an underwater passage over there.",
    "The water is flowing strongly though it. If you need to come back here, you'll need to find another way. It comes out in the middle of the Waterbirth caves, so, if you work your way past where we surfaced, you'll find the exit eventually.",
    "[Fremennik Name], do you have any food? I'm so weak, I could really do with some fish or something to build my strength.",
    "That's excellent but, on second thought, perhaps we should save it for the time-being. If I get injured, I'd really appreciate it if you could hand me some.",
    "Oh well, perhaps you're right to save it for the time-being. If I get injured, I'd really appreciate it if you could hand me some.",
    "And don't leave me behind, [Fremennik Name]. I'm injured and can't go quickly. I've tried to escape before but they just capture me and put me back here.",
    "Let's get out of here.",
    "Wait for me!",
    "Thanks!",
    "They got me again. Please take better care this time.",
    "Ready?",
    "It's quiet here. Too quiet. Don't rush off without me.",
    "Look out! More are coming!",
    "Leave me alone. It's slow work climbing a ladder when you're gravely wounded.",
    "The rock in the ceiling is really strange. It's almost like someone had been chipping away at it, trying to make bits come loose.",
    "Oh my, if we're not careful the whole lot could... No! LOOK OUT BELOW!",
    "Thank you for rescuing me, [Fremennik Name]; time and time again you prove we were right to make you Regent. While I was rooting around that dagannoth cave I found one of those prophecy tablet things that good old Brundt keeps on about.",
    "Yes, well, anyway, here you go.",
    "There was one other thing.",
    "Oh, it's nothing to difficult. It's just that you've been instrumental in bringing our kingdoms together...",
    "And turning me back into a human!",
    "I didn't think we'd announced that yet!",
    "Never mind, what we mean to say is that we'd like to be married as soon as possible, and we were hoping that, as Regent, you'd be prepared to conduct the ceremony.",
    "Excellent! Let us just get organised, there isn't much room for this here.",
    "No bother, just welcome the congregation, say how it is that you're empowered to marry us, then pronounce us married. The actual words don't matter too much.",
    "Well, actually, I saw this as being more about Sigrid and me...",
    "[Fremennik Name] has a point.",
    "I do.",
    "Thank you, [Fremennik Name]. I think [Astrid/Brand] wanted to speak to you know.",
    "I'm so glad you and [Astrid/Brand] finally married. Congratulations! When you're ready for us to make port you should speak to Chieftain Brundt.",
    "It's a shame that it didn't work out for you and [Astrid/Brand]. You should remain Regent, though, you've done more than enough to earn that. When you're ready for us to make port you should speak to Chieftain Brundt.",
    "Dark times need great heroes, [Fremennik Name]. I'm glad Miscellania has you. To see you cope so well with your loss drives me to do the same. I hope you will remain Regent; you're the closest thing I have to a [son/daughter] now."
  ],
  "Eir": [
    "Ah, [Fremennik Name], they told me you'd come.",
    "I would love to answer all of your questions, but I'm afraid there isn't much time. You aren't supposed to be here yet.",
    "I'm afraid not. Not that we wouldn't like you to take a seat in the Hall – certainly, I hope you come back for good before the End of Things – but now just isn't the time.",
    "Actually, they're getting ready for the great final battle.",
    "Not yet. You have much more to achieve elsewhere.",
    "(Transcript missing. edit)",
    "This is the grand hall of our Father, where fallen warriors come to prepare for the great battle at the End of Things.",
    "They died glorious deaths and will put everything on the line once again when needed. They've earned a drink. It won't do them any harm; they are already dead.",
    "This time I will send you to where your friends are. If you die again in pursuit of your current task I will be able to put you back on that track, or send you to the place you'd normally awake after such an incident. This time I was allowed to save your belongings, but next time they'll fall on the ground – or be destroyed as normal. It'll take me a moment to get ready, just speak to me then.",
    "Please don't do that; you can't go in there.",
    "I'll be ready to take you back in a moment.",
    "Are you ready to go back now?",
    "Not a problem. I'm ready when you are.",
    "I can send you back to the battle, or let you respawn where you normally would in Burthorpe.",
    "I'm going to miss you when you stop dropping by.",
    "Well, have a look around, rest a while, then talk to me when you're ready to go.",
    "You did it!",
    "Some bad news though: it's still not your time to be here. I'm sorry to disappoint you.",
    "Oh, look on the bright side. It's not often anyone gets to see this magnificent hall then go back to the world of the living!",
    "Since you've completed the task set out for you, I won't be able to help you any more. You probably won't see me again until the real time comes. Are you ready to go back?",
    "Until the next time..."
  ],
  "The note begins to crumble as you read it": [
    "'You who have unfinished business at our doorstep, read on to visit us once more.'"
  ],
  "Nial Swiftfling": [
    "You've got a lot of guts coming here after what you pulled.",
    "Had you going there, didn't I? ... Seriously, though, I really appreciate what you did. It's so good to be free, to have people to talk to again. Tell me, how is Freygerd?",
    "I'm glad to hear that. Well, I suppose you're on some great mission or other?",
    "Wow, I wish I could be a part of that. It's been so long since I've been able to fight beside my brothers from Rellekka and the islands. Is it tough down there? There's no better feeling than protecting your loved ones against some awesome threat.",
    "Mastery before modesty! That's what a hero needs!",
    "Too true!",
    "Still, you're going back soon, so it must be something important!",
    "Just the usual, then? I'm sure the daily pursuits of a hero like yourself are far from mundane.",
    "Take care [Fremennik name]. May your ancestors look over you. I know we will.",
    "You've got a lot of guts coming here after what you pulled.",
    "I can't believe you fell for that again!",
    "I'd be disappointed if you did, [Fremennik Name]."
  ],
  "Asleif Hamalsdotter": [
    "[Fremennik Name]! I knew it was you! What are you doing here?",
    "Oh, that's a shame. You should stay, you'd like it here. Some people think it's bad to have left everyone behind, but they all catch up sooner or later.",
    "Of course! And I intend to be with them on the front line, with my herbs and potions.",
    "I think I did quite well during that whole 'tablet' thing. It's only when the man in the bear suit took me by surprise afterwards that things went sour. Besides, what do you expect to happen to me now? I'm already dead!",
    "Of course. It's good that you're still questing.",
    "Nice to see you again. Well, nice to finally meet you, I should say. Good luck.",
    "Don't let me keep you. I'm sure you've got people to be saving."
  ],
  "Asleif Hamasdotter": [
    "Yes, but that might be a bit daft. You know I'm dead; you were the one who buried me. This is my rightful place."
  ],
  "King Vargas hands you a stone tablet with a curious inscription": [
    "All-consuming Darkness will rise from the sea, unleashed by Good Intent."
  ],
  "[Princess Astrid/Prince Brand]": [
    "[Excellent/Marvelous]! Chieftain Brundt, could you do the honours?",
    "Well, if that's how you feel, I won't argue.",
    "Of course, [darling/dear].",
    "No, don't say it; I understand.",
    "..",
    ".. ..",
    "I, [Astrid/Brand], take thee, [Fremennik Name], to be my [husband/wife] until death.",
    "What?",
    "I should hope so.",
    "I knew it!",
    "..",
    "... ..."
  ],
  "Option 1": [
    "And [his/her] name will be [Fremennik Name].",
    "And [his/her] name will be [Fremennik Name].",
    "And [his/her] name will be [Fremennik Name]."
  ],
  "Option 2": [
    "When the tide is strongest, Good Intent will be needed once more.",
    "When the tide is strongest, Good Intent will be needed once more.",
    "When the tide is strongest, Good Intent will be needed once more."
  ],
  "Option 3": [
    "All-consuming Darkness will rise from the sea, unleashed by Good Intent.",
    "The lost mother is dead, her Daughter risen in her place.",
    "All-consuming Darkness will rise from the sea, unleashed by Good Intent."
  ],
  "Option 4": [
    "The lost Mother is dead, her Daughter risen in her place."
  ],
  "Baba Yaga I have a theory": [
    "the prophecy says she was lost and that only now does her daughter rise in her place. I think that the Waterbirth colony was weaker while she was trapped."
  ],
  "Koschei the Deathless": [
    "Soon we find the fiendish enemy and end her reign of terror."
  ],
  "Koschei the deathless": [
    "I will stay. I can take care of myself.",
    "[Fremennik Name], I have grave news: a trio of mighty daggermouths enters the hatchery, each fighting in a different style. I cannot defeat them alone.",
    "Ah, the glory of combat is like sweet mead to my old head. Bear with me a few minutes, [Fremennik Name], I think I may have died again.",
    "The mother is buried alive. This war is won."
  ],
  "Advisor Ghrim": [
    "It certainly is, and I understand he has you to thank, Your Majesty. Perhaps, now that Queen Sigrid has moved in, he will not be tempted to go on any more 'adventures'."
  ],
  "Jossik": [
    "Really? Where is he? How is he?",
    "He just left? Oh my... Well, now I'll never find him."
  ],
  "Mawnis Burowgar": [
    "Well done driving back those daggermouths, [Fremennik Name]."
  ],
  "Freygerd": [
    "Well, I went to visit Mawnis a couple of times, but I'm just used to the atmosphere here. It's home.",
    "Oh, that's wonderful news! Thank you so much!"
  ],
  "Hamal the Chieftain": [
    "That is wonderful news, and most auspicious. I thank you again, [Fremennik name]."
  ],
  "Ragnar": [
    "Thank you, friend. This is great news."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Blood_Runs_Deep?oldid=36007989’"
  ]
}