{
  "Death": [
    "I feel you are ready to learn of another former apprentice of Rasial's.",
    "Lord Yudura, of the necrolords of Daemonheim.",
    "The necrolords are powerful necromancers, and Daemonheim is their laboratory.",
    "Lord Yudura once led them, but met his demise in the not too distant past.",
    "This one is different. Yudura did not meet his fate at Raisal's hand.",
    "Daemonheim is littered with ghosts, lingering on in that place with unfinished business.",
    "I am certain that if you talk to some of the listless dead, particularly those wondering around on the surface, then you will learn of Lord Yudura.",
    "How goes your investigation into Lord Yudura?",
    "You are returned. I was beginning to worry.",
    "Edimmu are such ghastly abominations. I shall head over there and reap him post-haste.",
    "Did you learn anything of value from this investigation?",
    "Not with my involvement; I would just return you. Perhaps, in part, that is a reason he chose you as his new apprentice.",
    "No, I do not accept that. Look how far you have come with the souls of Um willingly fighting at your side.",
    "That is troubling news... But, from everything you have learned, I think Rasial's vessel is the true target.",
    "Indeed. He can return as many times as he likes, but perhaps instead of trying to become stronger than him, we can strip him of his power.",
    "His power comes from the souls of Um, same as yours...but your power is earned, while his is stolen.",
    "Yes, leave this thought with me, continue your ascent. We will end this soon enough, one way or another.",
    "You need to free up two spaces in your backpack."
  ],
  "Player": [
    "Who's next?",
    "Maybe later.",
    "So, another dead Rasial apprentice. This does not look good for me.",
    "What is he now, and how can I talk to him?",
    "Okay, I'll go and talk to some ghosts around Daemonheim's entrance!",
    "It's going okay. I should probably get back to it.",
    "I am a conduit to the City of Um. Pass on through me, friend, and rest in peace.",
    "I'm not here for the dead, I'm here for you.",
    "Actually, I just wanted to learn from you about Rasial.",
    "It's true, I am his new apprentice. And if you're aware of him, I definitely can learn from you.",
    "What would you ask of me?",
    "I'm not snatching any bodies for you.",
    "Sorry, yes, let's continue.",
    "No. You might have a lesson to teach me, but I won't condone forcing the dead into servitude. If you insist, I'll find another way, and leave you to retrieve your own remains.",
    "Perhaps I can head to the Underworld and find this person's spirit, ask them there.",
    "Then what?",
    "That's still forceful!",
    "I don't like it, but fine. But the moment this spirit wants to return...",
    "And my name is Player. Would you mind please answering some questions for us? We will return you to your rest anytime you wish and disturb you no more.",
    "Yudura! Cut the link. Remember our deal.",
    "Thank you, Captain Toma. Be at rest.",
    "What about this one?",
    "Easy, friend. Can you speak for a short while?",
    "Clearly, this one knows nothing. Let them be at peace.",
    "Over here.",
    "Calm yourself. I am Player. Would you mind answering some questions?",
    "We'll do our best. Rest easy.",
    "Here's another one.",
    "Yudura, let this soul rest. Send her back.",
    "We are sorry to have disturbed your rest. Go, be at peace once more.",
    "Okay, we've found you. I've held up my side of the bargain, now you.",
    "Oh, I need one free space in my backpack first.",
    "Now what?",
    "Inks and candles in the room to the west first, then to the ritual chamber east of here.",
    "I, er...lost your corpse.",
    "Oh, I need a free backpack space first.",
    "What should I do again?",
    "I don't have any space in my backpack.",
    "I, er, 'lost' Lord Yudura's corpse... Maybe he's seen it around.",
    "I've finished setting up the ritual site.",
    "I don't need anything from here right now.",
    "What did I just witness? What have you done to yourself?",
    "Why would you do this to yourself?",
    "But you're an abomination!",
    "How does this ritual help me?",
    "Okay, so then, teach me, and then our deal can be done and we can part ways.",
    "If you thought those pitiful conjurations would defeat me, then you've lost far more than a few memories.",
    "You won't fare any better.",
    "And of course you show up to check on me. Can't you just wait for me to assault your citadel or something?",
    "You killed him! Like he was nothing.",
    "I'll be coming for you next, Rasial!",
    "I don't think I'm going to learn anything else here. I'd best head back to Um and share all this with Death.",
    "Well, I met Lord Yudura's ghost and helped him to find his earthly remains.",
    "Under the pretense[sic] of him teaching me a new ritual in return for my help, he brought himself back as an edimmu!",
    "Turns out he was just angry with Rasial for replacing him with me as his apprentice. He tried to kill me.",
    "No need. Rasial showed up too, already did the deed.",
    "Well, one thing - if I were to die, I think Rasial would leave me alone.",
    "Yudura suggested I need to give into the darkness of necromancy if I hope to defeat Rasial.",
    "Then the only other thing would be that I think Rasial is going to be able to return much more frequently now, thanks to Yudura's new ritual.",
    "The organ up in his citadel?"
  ],
  "You do not meet the requirements to start": [
    "'Remains of the Necrolord'.",
    "'Remains of the Necrolord'."
  ],
  "Lord Yudura": [
    "Who encroaches on the domain of the necrolords? Face me out front if you dare...",
    "How dare you encroach on the domain of the necrolords? The dead here belong to us!",
    "So, another rival necromancer vies to wrest control from us?",
    "Wait... You bear his mark? So, Rasial did abandon us.",
    "Hmm, very well. Rasial and I are certainly not on friendly terms. He left us here to rot!",
    "There is certainly one lesson I can teach you. However, I will need something first in exchange...",
    "As you can see, I am a ghost. I wish to rectify this...mishap, but I require a body.",
    "Hahaha! Nothing so prosaic. I need assistance to recover my own remains.",
    "Come, let us venture into the halls below.",
    "Where did you vanish off to? We still have work to do.",
    "Ah, the frozen floors. I find their chill comforting. Look around and see what you can find.",
    "This one knows something of my demise. Let me just raise it and force it to talk...",
    "A self-righteous necromancer? Who could have thought? Rasial really is scraping the barrel this age.",
    "Now it is my turn to say no. You could search the Underworld for numerous lifetimes and may never find this spirit. We continue on here; I am not waiting any longer than I have to.",
    "There is another way. I know of an incantation that can temporarily turn this corpse into a conduit and draw back its spirit.",
    "We can ask if it would mind aiding us. If it objects at any time, I will cut the link and allow it to return. Would that be a fair compromise?",
    "...then it returns. Agreed. Now I will cast Speak to Dead on Captain Toma.",
    "Welcome back, Captain Toma. It is I, Lord Yudura.",
    "Captain Toma, my mortal form was dispatched by the assassin Moia. She had disguised herself as you. I am searching for my remains, but my memory of my own death is lost to me - what information do you have?",
    "Focus, Captain. Where was Moia going?",
    "No, you must know mor-",
    "Oh, fie[sic]. Very well.",
    "Fine, we can find another to question on the floors below...",
    "Perhaps these floors are not as abandoned as I thought... One of these might be of value.",
    "I am Lord Yudura. Tell me where my remains can be found!",
    "Stop rambling and answer, soldier!",
    "Fine.",
    "Enough pleasantries! These 'dungeoneers', do they know the fate of Lord Yudura?",
    "Another dead end.",
    "The ones who think you killed them?",
    "Ah, she speaks of a phantom - her desire for revenge manifested. Tell me of these stories you heard.",
    "Aha! Yes, I remember this room well. Temporary corpse storage room B12. Let us go!",
    "At last, I have found myself. Pick up my remains!",
    "Well, I've certainly looked better, but those are my remains.",
    "Yes, very well. Though it's not the kind of lesson I can just tell you. Pick me up and I will show you.",
    "Now, let's continue on...",
    "Fear no longer, fellow necrolords! Yudura has returned!",
    "Lend your aid to my new...sidekick. We have a ritual to perform!",
    "I will teach you a new ritual, one to give you new life even beyond death.",
    "Should Rasial ever dispatch of you, you can return and enact revenge.",
    "First, gather some ritual supplies. There are candles and various inks in the storage room to the west.",
    "Then proceed east to the ritual chamber and prepare the ritual. Place my remains at the centre as the focus object.",
    "Return to me once you are finished.",
    "You did not lose it, you attempted to destroy it! Unsuccessfully, for your sake. Here!",
    "*sigh* Gather inks and candles in the storage room to the west, then head to the ritual chamber to the east.",
    "Once you've set up the site, return to me.",
    "Is it typically this difficult for you to learn things? I do not envy Rasial right now.",
    "No, not in there! That is for after the ritual...",
    "Let us begin!",
    "My brothers! Let us perform the ritual of the possession, and show my sidekick here the collective power of the necrolords!",
    "Vos-Da!",
    "Xau-Ma!",
    "Tak-Ma!",
    "Yes! I am reborn!",
    "I am returned!",
    "As a ghost, my intellect would deteriorate. As a zombie or skeleton, my physical form instead.",
    "By possessing my own corpse, I retain the best of both, with the added bonus of a powerful and menacing presence.",
    "Progress demands sacrifice!",
    "It doesn't - that was for me! But I hate being indebted; I still owe you a lesson.",
    "Please, join me in the room south of here and I will teach you what you need to know about Rasial.",
    "Rasial's teachings can be somewhat harsh...harmful, even.",
    "If you ever hope to become strong enough to supplant him, I'm afraid your frail mortal body is not going to cut it.",
    "You must succumb to the darkness of necromancy as have my brethren and I, create a powerful new form such as mine!",
    "I was his apprentice once. I was learning so much! And then Moia tricked me, stole parts of my mind, cut me down in my prime...and Rasial abandoned me.",
    "Then you turn up, the insult added to my injury. Why would he pass on ME to make YOU his new apprentice?",
    "I was his star pupil; I shall be again!",
    "There's only one spot open, and if it's to be mine, that means you must be out of the picture.",
    "Now, what was that thing you said about parting ways...",
    "How is this possible? You are but a puny mortal necromancer. You should not have been able to do that.",
    "Perhaps so. This new form should have made my conjures more powerful. No matter, I'll deal with you personally.",
    "Rasial!",
    "Please, master. Take me back. This human's potential is limited. Just look at what I have accomplished in your absence!",
    "S-so, you'll take me back?",
    "T-thank you, master. Now, let's ditch the dead weight and continue your teachings."
  ],
  "Captain Toma": [
    "Who takes me from my rest?",
    "So the rumours are true - a necromancer with care for the dead. Your name is getting around the Underworld, Player. I will answer whatever you wish, to the best of my ability.",
    "Moia! Was that who did for me too! I knew that wasn't, er... She stole something from me too. I...am filled with sadness.",
    "I'm not really sure. Some of my men who've since joined me in death said I was acting strange as low down as the furnished floors.",
    "I'm sorry, I have no more information. Please, return me to my rest."
  ],
  "Andelus": [
    "Wait, am I back here again? I thought I got out.",
    "Am I hungry? Am I lost? I had a key...",
    "Lord who? I don't know anything about that.",
    "Yes, I want to rest."
  ],
  "Taevas": [
    "They've killed us! Where is my sister?",
    "That's a nice name. You're not like the other dungeoneers - they had vile names, toxic people.",
    "They didn't exactly stop to chat. They just killed me. Please, save my sister."
  ],
  "Vengeance": [
    "Why am I back here? Is this a nightmare, or was the other place a dream?",
    "I had a life...a child... I was at peace.",
    "No, wait! Yudura? That name is familiar. The stories...",
    "The ones who think I killed them visit me sometimes.",
    "They attacked us...killed my brother...poisoned me. As I lay there slowly dying, IT came to me.",
    "I poured my spite into it and cursed them with my last breath. I did not kill them - it did.",
    "Skaldrun's story... Yudura... He died on the furnished floors...a storeroom...storage crates...an obelisk?"
  ],
  "Necrolord (#1)": [
    "Oh, help Yudura with his ritual? Why, of course, I'd love to help my fellow necrolord out. It's just, um, I've got another ritual starting in ten minutes that absolutely can't miss. Sorry, my hands are tied."
  ],
  "Necrolord (#2)": [
    "I think I'm coming down with a cold. Best not help with the ritual, it might spread. All the best, though"
  ],
  "Necrolord (#3)": [
    "I am too...er, weak to help out Yudura with the ritual. Yes, too weak. Good luck, though."
  ],
  "Necrolord (#4)": [
    "I'd love to help you out with the ritual, but, um...actually no I wouldn't."
  ],
  "Necrolord (#5)": [
    "I've heard of Lord Yudura. I wish to see if he lives up to the legends. I'm in.",
    "I am in awe...of both of you."
  ],
  "Necrolord (#6)": [
    "With me on board, I believe we have just enough willing necrolords to pull this off."
  ],
  "Necrolord (#7)": [
    "Very well, I shall assist...but only because Yudura still owes me some slaves.",
    "Tell him I'll be expecting interest."
  ],
  "Necrolord (#8)": [
    "We need all the necrolords we can muster. Of course I will help.",
    "Our ranks swell!"
  ],
  "Necrolord (#9)": [
    "Yes, I will assist you. This place has diminished since Yudura's demise.",
    "You have returned Lord Yudura to us. Well done."
  ],
  "Necrolord": [
    "You've sure done us a favour bring[sic] Yudura back. Nice one, pal.",
    "Nice going with the ritual. I think I've developed a headache now too.",
    "Gee, thanks for returning Yudura to our fold.",
    "Great going, thanks. Should have just left Yudura to rot."
  ],
  "Necrolord  (#6)": [
    "Ah, another successful ritual!"
  ],
  "Rasial, the First Necromancer": [
    "Now, now, students, play nicely...",
    "Hmm, perhaps you aren't so worthless after all.",
    "I'll admit, I had given up on ever learning anything of value from your pitiful cabal.",
    "But this possession ritual...this I can use. Yes, this shall make returning to physical form much easier. I thank you, Yudura.",
    "That is an excellent idea.",
    "He served his purpose, which, to be honest, is something I had given up on a long time ago.",
    "You have yet to fulfil yours, though I sense you are getting close.",
    "Oh, I don't doubt it for a second. I'll be seeing you again very soon..."
  ],
  "You have unlocked the title": [
    "'Necrolord [Name]'"
  ],
  "Congratulations! You have completed": [
    "'Remains of the Necrolord' - Complete this quest."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Remains_of_the_Necrolord?oldid=36182369’"
  ]
}