{
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "missing lucien's endYou can discuss this issue on the talk page or edit this page to improve it."
  ],
  "Lucien": [
    "I seek a hero to go on an important mission!",
    "I require the Staff of Armadyl. It is in the deserted Temple of Ikov, near Hemenster, north east of here. Take care hero! There is a dangerous monster somewhere in the temple!",
    "The guardians of the Staff of Armadyl fear me! They have set up a magical barrier which even my power cannot overcome!",
    "It's not as easy as it sounds. The monster can only be killed with a weapon of ice. There are many other dangers.",
    "Take this pendant. Without it you will not be able to enter the Chamber of Fear.",
    "I cannot stay here much longer. I will be west of the Grand Exchange in Varrock. I have a small holding up there.",
    "Wimp! Call yourself a hero?! My daughter is more a hero than you!",
    "I see you are the mercenary type.",
    "I will reward you well if you bring me the staff.",
    "Hmph.",
    "Well, if you see any be sure to point them in my direction.",
    "I told you not to meet me here again!",
    "My patience grows thin hero! I need the Staff of Armadyl. It's in the Temple of Ikov, near Hemenster, north east of here.",
    "Have you got the Staff of Armadyl yet?",
    "You don't want to attack me. I am your friend.",
    "Gah! I don't have time for this. I'll find someone else to do my bidding.",
    "Have you got the Staff of Armadyl yet?",
    "Muhahahhahahaha! I can feel the power of the staff running through me! I will be more powerful and they shall bow down to me! I suppose you want your reward? I shall grant you much power!"
  ],
  "Player": [
    "I am a mighty hero!",
    "Why can't you get it yourself?",
    "That sounds like a laugh!",
    "I'm up for it!",
    "Oh no! Sounds far too dangerous!",
    "What's the reward?!",
    "It's a living.",
    "I'll pass this time.",
    "Yup, lots of heroes about these days.",
    "Sorry! Can you remind me of my mission?",
    "I'm up for it!",
    "No, not yet.",
    "A mighty hero!",
    "A humble pilgrim.",
    "Nah, not bothered!",
    "Yes, we do!",
    "Yes, I do!",
    "If you're such a great witch, get me over!",
    "I can do something for you!",
    "Alright, I'll come back when I've got enough roots.",
    "Okay, here are your limpwurt roots.",
    "No, I haven't got any.",
    "I've got some. How many did you need?",
    "Yes, I've got them.",
    "I seek the Staff of Armadyl.",
    "Lucien will give me a grand reward for it!",
    "How dare you call me a fool! I will work for whom I want!",
    "I just thought of something I must do!",
    "You're right, it's time for my yearly bath.",
    "Give it to me!",
    "I collect rare and powerful artefacts.",
    "Out of my way fool!",
    "Why not?!",
    "Then you must die!",
    "You're right, I will go now.",
    "What are your kind and what are you doing here?",
    "What is the Armadyl?[sic]",
    "Ah ok, thanks.",
    "Someone told me there were only three gods. Saradomin, Zamorak and Guthix.",
    "Who are the Mahjarrat?",
    "Did you say Lucien? It was Lucien that asked me to get the staff!",
    "You're right, it's time for my yearly bath.",
    "I hope you are doing a good job then!",
    "Wow! You must be really old!",
    "Ok! I'll help!",
    "Yes!",
    "No! I shan't turn against my employer.",
    "I need time to think.",
    "Not yet.",
    "Yes! Here it is.",
    "Yes please. Could you do the honours?",
    "No thanks."
  ],
  "Fire Warrior of Lesarkus": [
    "Amitus Smeti!",
    "Who dares to enter the Temple of Ikov!",
    "Pathetic fool! Prepare to die!",
    "I haven't seen a pilgrim for thousands of years! Temple is closed!",
    "Your puny weapons do nothing against me human! Come back when you can give me a real fight!",
    "You will not pass!",
    "Amitus Smeti!"
  ],
  "Winelda": [
    "Hehe! We see you're in a pickle! Wants to be getting over the nasty lava do we?",
    "Hehe! Ye'll come back! They always come back!",
    "Mocking us are we? Clever one aren't we?",
    "I'm knowing some magic trickesses! I could get over easy as that! Don't tell them! They always come! They pester poor Winelda!",
    "See? They pester Winelda!",
    "Good! Don't pester, help! Get Winelda 20 limpwurt roots for my pot. Then we shows them some magic!",
    "Ooh, they're well prepared! Hehe!",
    "Good! Good! My potion is nearly ready! Bubble, bubble, toil and trouble! Now we shows them ours magic! Hold on tight!",
    "Have you got roots for poor Winelda?",
    "We needs 20 limpwurt roots for pot. Then Winelda helps you get over nasty lava.",
    "We needs 20 limpwurt roots for pot. Then Winelda helps you get over nasty lava.",
    "Good! Good! My potion is nearly ready! bubble, bubble, toil and trouble! Now we shows them ours magic! Hold on tight!",
    "Want to get over the nasty lava, do we?",
    "Certainly! We helps those that helps poor Winelda!",
    "Come again when you do. We helps those that helps poor Winelda!"
  ],
  "Guardian of Armadyl": [
    "Thou art a foul agent of Lucien! Such an agent must die!",
    "Thou hast ventured deep into the tunnels, you have reached the temple of our master. It is many ages since a pilgrim has come here.",
    "We are the guardians of the staff, our fathers were guardians and our father's fathers before that. Why dost thou seek it?",
    "Thou art working for that spawn of evil?! Fool. You must be cleansed to save your soul!",
    "We must cleanse the temple!",
    "An agent of evil cannot be allowed to leave!",
    "The staff is sacred! You will not have it!",
    "Your worldy greed has darkened your soul!",
    "I may be a fool but I will not step aside!",
    "Only members of our order are allowed to handle the staff.",
    "That is a wise decision. Stay a while and let your soul be cleansed!",
    "We are the Guardians of Armadyl. We have kept the temple safe for many ages. The evil in the dungeons seek what lies here. The Mahjarrat are the worse[sic].",
    "Armadyl is the god we serve. We have been charged with guarding his sacred arctifacts[sic] until he requires them.",
    "Go in peace.",
    "Saradominists. Bleh. They only acknowledge those three. There are at least twenty gods!",
    "They are ancient and powerful beings of evil! it is said that they once had great influence over this plane of existence, and that Zamorak was once of their kind. They are far fewer in number now, but there are still some present in this world. One such as Lucien would become nigh unstoppable if he were to possess the Staff of Armadyl",
    "You are a fool to be working for Lucien! Your soul must be cleansed to save you!",
    "Do not fear! We are devoted to our charge!",
    "No! I am not old! my family has guarded the staff for many generations.",
    "You have been cleansed!",
    "Lucien must not get hold of the staff! He would become too powerful!",
    "Hast thou come across this foul beast? If you know where he is you can help us defeat him.",
    "So he is close by?",
    "He must be after the staff. Here, take this pendant; wear it to show your allegiance to us, then defeat him in combat. I doubt you'll kill him, but it should discourage him for a while.",
    "Fool! You will die for your sins!",
    "Linger a while and be at peace.",
    "Have you rid us of Lucien yet?",
    "Hurry friend! Time is against us!"
  ],
  "Congratulations! You have completed": [
    "'Temple of Ikov'.",
    "'Temple of Ikov'."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Temple_of_Ikov?oldid=36120876’"
  ]
}