{
  "Player": [
    "Hi Chuck. How's it going?",
    "Any news of the penguins, Chuck?",
    "Ok, I'm ready.",
    "Hi Chuck. How's it going?",
    "Erm Chuck, could you remind me what the passphrase was?",
    "Thanks, I won't forget this time.",
    "Hmm, Chuck said to strike up a conversation. I wonder... Excuse me. Could I borrow a tinderbox?",
    "They do say they're better...",
    "The weather [holiday destination] is [weather] and [food] are to die for.",
    "Hello. Chuck sent me to find you. He said the penguins are up to something?",
    "In what way?",
    "Oh no!",
    "Why don't you two go?",
    "Fine. Hey can you feel that rumbling?!",
    "What did I just see?!",
    "Why don't you two go?",
    "...",
    "Hi Chuck. How's it going?",
    "I met the two PBJ agents, they said that Pescaling Pax is plotting to permanently lower the temperature of Gielinor! I was just about to head to the iceberg to check things out when we saw a blue box take off from there! It landed in the desert, Chuck!",
    "Yes sir!",
    "There's a small sign on it. It reads: Terraforming Arctic Refrigeration Dispersing Ice Spreader. Maybe this is how the penguins are planning to lower the temperature of Gielinor. Maybe I should see if anyone in the area saw what happened.",
    "Did you see what happened here?",
    "You can talk to crocodiles?!",
    "Could I try it out?",
    "But why?",
    "But aren't they quite vicious? How come one hasn't eaten you yet?",
    "I see... Do you think maybe you've been out in the desert a bit too long. Could I get you some water?",
    "... If the crocodiles don't get him, the jackals will...",
    "Er, nothing!",
    "I should equip my Crocspeak amulet if I want to talk to him.",
    "Er...Hello?",
    "What's wrong, brown croc?",
    "There, there. Calm down. It'll probably just melt soon.",
    "Yes, I saw...It seems to be some sort of terraforming machine.",
    "Time travel? But if that was possible, plot points could be reverted... And any narrative dead-end could be resolved with a cheap flick of the time-travel reset switch... Or something like that... Anyway, perhaps I'd better report back to Chuck.",
    "Not yet Croc. But don't worry, I'm working on it! Just think warm thoughts for now!",
    "So, you know Chuck eh?",
    "What happened? How did you end up here?",
    "There's a small sign on it. It reads: Terraforming Arctic Refrigeration Dispersing Ice Spreader. Maybe this is how the penguins are planning to lower the temperature of Gielinor. I should tell Chuck about this.",
    "Hi Chuck. How's it going?",
    "Chuck, I've got some more information about the penguin activities.",
    "They've built something called a Terraforming Arctic Refrigeration Dispersing Ice Spreader, or T.A.R.D.I.S. for short. It's landed in the desert and is now slowly changing the desert to an arctic tundra!",
    "I couldn't look too closely, there were several penguins wandering around nearby. But I did speak to an old friend of yours, called Croc?",
    "Croc was complaining that with all the ice that was coming out from the T.A.R.D.I.S. the desert was cold, and he wasn't very happy. Is there anything we can do?",
    "What's the agent's name?",
    "Oh... So how will I find him?",
    "But how will I be able to get into the disguise by myself?",
    "I think I misplaced my penguin disguise.",
    "Ok Chuck, I'll see what I can do...",
    "Hi Chuck. How's it going?",
    "Not yet, I'll get right on it.",
    "There's a small sign on it. It reads: Terraforming Arctic Refrigeration Dispersing Ice Spreader. Maybe this is how the penguins are planning to lower the temperature of Gielinor.",
    "I can't speak to the penguins when I'm not in my disguise.",
    "I can't get into my penguin disguise, I need my hands free to operate it.",
    "I can't get into my penguin disguise, I can't wear a cape inside the suit, it might get caught.",
    "I wouldn't want to break my penguin disguise.",
    "Hi!",
    "It's rather warm out here isn't it?",
    "Right...",
    "I'd love some ice cream...",
    "Aw. I'll pass, thanks.",
    "I er, banged my head. I went to lie down... I don't really remember what happened.",
    "Er... would you like a piece of pie?",
    "... Phew, that was close. Finding the PBJ agent is a bit of a puzzle, I need to consider the clues more logically...",
    "I er, banged my head. I went to lie down... I don't really remember what happened.",
    "Er... I said, it's very dry...",
    "... Phew, that was close. Finding the PBJ agent is a bit of a puzzle, I need to consider the clues more logically...",
    "Er... I said, I think I might cry.",
    "... Phew, that was close. Finding the PBJ agent is a bit of a puzzle, I need to consider the clues more logically...",
    "I don't understand...",
    "Chuck sent me to find you. What's happening here?",
    "Oh no! If only there was some way to stop them...",
    "What's that?",
    "Sounds good... so what have you been working on?",
    "What does it do?",
    "Huh?",
    "Wow!",
    "Wait, why can't you go?",
    "Fine... I'll help.",
    "It's not even finished?",
    "Ok thanks!",
    "Ok thanks!",
    "No, I got distracted...",
    "I need to be wearing my penguin disguise to go in there. I think Jim, the polar bear over there, will be able to help me.",
    "Hello?",
    "Erm, no, just who are you anyway?",
    "I think they've gone... You're like the only penguin still here.",
    "So what do you do around here then?",
    "Sails? Do you mean sales?",
    "I don't have anything to write with.",
    "No...",
    "Perfect, I'll buy it.",
    "What is this place, what am I doing here?",
    "Fininor, you mean Gielinor? Wait, nevermind, what are you two up to?",
    "No way?",
    "So what happened, why are you in a pillory instead of partying?",
    "That seems very egregious dudes, I mean unfair.",
    "I'll check it out and see what I can do. Hang in there.",
    "Hang in there. I'm sure there's something instrumental I can do around here to resolve the situation.",
    "Hang in there. I'm sure there's something instrumental I can do around here to resolve the situation.",
    "What's going on?",
    "What's wrong with them?",
    "Can I help?",
    "Hi Chuck. How's it going?",
    "Sorry Chuck, I just thought you might like a chat.",
    "But doesn't the nature of time travel mean that...",
    "I'll get right on it.",
    "Noodle! Is that you?",
    "Right...",
    "Wow, I guess you guys have been busy. Though, I guess humans have been blissfully ignoring us since changing to the 6th age and all.",
    "Yeah, sorry I knew that. Do you know anything about a T.A.R.D.I.S?",
    "Glad you landed on your flippers.",
    "Yeah, about that...",
    "Well, apart from using a G.P.S. device to locate the hidden hatch access, I literally entered the most common 4 digit 'fin' number. Bam, first try!",
    "Right...",
    "But penguins can swim...",
    "Alright, alright! Calm down, let's not be too hasty now.",
    "Well, I'm guessing that you don't need me to do any favours then?",
    "Dare I ask?",
    "Is that it?",
    "Well, that's good, given certain penguins kept losing them, and forgery and fraud rates were quite high.",
    "You really think they're listening in? Have you considered a different shape or you know, not making it out of easily fabricated 'card'?",
    "Hey, that er... party was really good right?",
    "Back to work then.",
    "Hey, what's with all the scaffolding?",
    "Should be good then.",
    "What's with the food these days?",
    "I could eat Macaroni Penguins and Cheese every day!",
    "What's going on?",
    "No, what happened?",
    "Really?",
    "Phew! How did they save him?",
    "Have you seen the weather outside?",
    "Would it be affected by the heat of say the desert?",
    "Hey, how's it going?",
    "Hello?",
    "Erm, no?",
    "Yes sir! Right away sir!",
    "Hi, what are you up to?",
    "Hi, what are you up to?",
    "Sorry, I just thought you might be doing something to prepare for the mission...",
    "Well, I best be getting along.",
    "Hello.",
    "So... nice weather down here...",
    "Well, I best be getting along.",
    "Hi there!",
    "So... what do you do here?",
    "That's nice... Well, I best be getting along.",
    "My name is Player and I'm from the 6th age, your De-lore-ing device worked and you sent me back here to change the future.",
    "Whatever it is you were - I mean - are - working on here succeeds, but it crash landed in the desert and has started churning out ice to send Gielinor back to the freezer! I met you in the 6th age, and fixed your De-lore-ing device to allow me to come back here and stop it from happening.",
    "Guthix - no wait - I shouldn't tell you any more than you need to know. We need to stop the device from leaving this base by destroying it somehow!",
    "But we must stop it from freezing the world!",
    "You're right, how far along is the device and what can we do?",
    "Ok, I'll go and find Elon.",
    "Not yet, where can I find him?",
    "Ok.",
    "Hi, Gordon sent me, do you need some help?",
    "Sure what do you need?",
    "Ok, I'll take a look, and see what I can source.",
    "I lost the list you gave me...",
    "Er...",
    "I've brought you [item].",
    "I'm still looking for some of the things.",
    "Yes, he gave me a list of things to get.",
    "You've been here for ages and the most interesting conversation you had was with a Polar Bear?",
    "What's that Buzz, they've been trying to extract energy from you?",
    "A gift for me?",
    "I can get more energy from your friends, but they won't be so willing to hand it over?",
    "Can I get you out of here? I'll see what I can do. Stay positive.",
    "I've brought you the 121 Killerwatt Energy.",
    "I've brought you the 'Fishvention' Rod.",
    "I've brought you 1985 lemon sole runes.",
    "I've brought you the Ice box.",
    "I've brought you a Cool-ant.",
    "I think I've got everything...",
    "What kind?",
    "I have an idea... maybe some different types of divine energy would do the job?",
    "Er... nevermind, pretend you didn't hear anything! How much energy do you need?",
    "Ok, I'll be back soon.",
    "No... could you remind me what I needed to do?",
    "Ok, got it!",
    "The T.A.R.D.I.S. is nearly ready, I just need to configure the energy source.",
    "What's your plan?",
    "That seems a bit unnecesary, I'm on your side!",
    "...",
    "I finished calibrating the machine.",
    "Sir! The T.A.R.D.I.S. is complete, Sir!",
    "Yes, Sir! Gordon and Hugh, and then report to Emperor Wing so that we can leave!",
    "Yep.",
    "The T.A.R.D.I.S. is complete, we should prepare to leave!",
    "Ok... But make sure it's somewhere I can find it in the future!",
    "The T.A.R.D.I.S. is complete doc, we should prepare to leave!",
    "Sir! The T.A.R.D.I.S. is complete, and the crew are ready!",
    "Surely you can't be serious?",
    "Er... sure. What's the worst that could happen?",
    "What do you mean...another?",
    "What should we do then?",
    "Right, thanks. I'll be off then just in case.",
    "Can I get you out of here? I'll see what I can do. Stay positive.",
    "Hi Chuck. How's it going?",
    "I travelled back in time, and...",
    "Oh... But I don't understand... Gordon sabotaged the T.A.R.D.I.S. in the past, but it still landed in the desert and is making the area cold... Nothing changed!",
    "But what about all the ice? What about Gielinor?",
    "What about Croc, he'll still be cold?",
    "Oh...",
    "Hi Chuck. How's it going?",
    "Have you heard anything from Gordon recently?",
    "It's ok Croc, their machine can't make things any colder than they currently are... It's not working to its full capacity, and the heat of the desert will keep things under control.",
    "Why don't you scoot along the river a little?",
    "Hi Gordon! How's it going?",
    "What are you doing?",
    "Good luck!",
    "I er, just went to stretch my flippers... Will we ever get the T.A.R.D.I.S. repaired?",
    "Still here?"
  ],
  "Chuck": [
    "Ah, Player. It's good to see you again.",
    "Funny you should ask. I've just had word from two PBJ agents that are on an observation mission. They've reported that there's been some unusual activity on the iceberg. Perhaps you could go and speak to them, and find out what's happening?",
    "Oh. Well come back if you change your mind.",
    "Splendid! The agents are called Skot and Mundsen, and are located in Rellekka. You may have difficulty spotting them, with their exceptional disguises! Go and strike up a conversation with them, and report back to me when you have more information... Oh, I almost forgot, you'll need a passphrase...",
    "The weather [holiday destination] is [weather] and [food] are to die for.",
    "Ah, Player. It's good to see you again.",
    "Please remember it this time...",
    "The weather [holiday destination] is [weather] and [food] are to die for.",
    "Ah, Player. It's good to see you again.",
    "Well, what are you doing wasting time here? Get after them!",
    "Ah, Player. It's good to see you again.",
    "Go on...",
    "That's very worrying indeed! Did you get a get a good look at this T.A.R.D.I.S. device?",
    "Ah Croc, he used to live here in the zoo. He escaped a long time ago, but it's good to know he's still out there.",
    "Well, we do have one option. A while ago a PBJ agent was tasked with infiltrating extreme penguin cells. This group of penguins in the desert sounds pretty extreme, so maybe the agent is with them. He may be able to provide us with more information.",
    "His identity is so secret that even I don't know.",
    "You'll need to talk to the penguins in the desert and see if you can work out which is the undercover agent. The only thing I do know about him, is that his favorite food is sardines. Maybe that'll be some help. I suggest you take your penguin disguise with you, otherwise the penguins won't talk to you.",
    "The agent should have a device with him that will allow you to shrink into your disguise when you're nearby.",
    "As luck would have it, I have a spare here, but if you lose it I won't give you another.",
    "Ah, Player. It's good to see you again.",
    "Did you manage to find our agent in the desert?",
    "Ah, Player. It's good to see you again.",
    "Shouldn't you be in the past stopping the penguins from launching their Terraforming Arctic Refrigeration Dispersing Ice Spreader?",
    "There's no time for that, Player! The penguins must be stopped!",
    "You must hurry before the whole of Gielinor is permanently frozen!",
    "Ah, Player. It's good to see you again.",
    "Let me stop you right there, Gordon's sent a report over to me, I know all about it.",
    "Don't you see? The T.A.R.D.I.S. was already harmless when it landed, because it had already been sabotaged!",
    "Gielinor will be fine. The T.A.R.D.I.S. isn't working to full capacity, so the heat from the desert will keep the ice level under control.",
    "I'm sure he'll adapt. Besides, there's a whole wide desert he can explore.",
    "Don't be sad, have some rewards for your trouble.",
    "Ah, Player. It's good to see you again.",
    "He sends in reports when he can, via magic carpet. The penguins are trying to repair their T.A.R.D.I.S., but as you can imagine, it's almost impossible for them to get spare parts out there. Gielinor is safe for the time being!",
    "Ah, I see you've finally become learned about Invention, here I've got something for you!"
  ],
  "Mundsen/Skot": [
    "I use a firelighter.",
    "I'm thinking of taking a holiday...",
    "I don't like the sound of that holiday very much."
  ],
  "Skot": [
    "That does sound like an excellent holiday destination. What can we do for you?",
    "Penguins running around here and there. Lots of banging noises. It's all very suspicious.",
    "Oh we're much to import- er, busy. Yes busy.",
    "It looked like some sort of a flying blue box... I think it might have gone all the way to Pollnivneach!",
    "We uh, left our warm weather gear at home."
  ],
  "Mundsen": [
    "Indeed. There's been an abnormal amount of activity on the iceberg of late.",
    "We heard from an inside source that Pescaling Pax is plotting to permanently lower the temperature of Gielinor.",
    "Perhaps you should go over there and find out what's happening?",
    "The penguins must have finished whatever they were doing. Maybe you should get to Pollnivneach and find out what's happening."
  ],
  "[Penguin]": [
    "SQWARK!",
    "SQWARK!"
  ],
  "Dundee": [
    "Hello there young adventurer!",
    "I'm afraid I didn't. I was bus talking to this croc here, and when I turned around, there was a load of penguins and ice everywhere!",
    "Course! Got my trusty crocspeak amulet here!",
    "Sure, take my spare.",
    "I'm studying the crocodiles in the area of course!",
    "They really are fascinating creatures! Some of them have razor sharp wit!",
    "Don't be silly, crocs are incredibly misunderstood. They're very gentle when you get to know them!",
    "No, no adventurer, don't you worry about me!",
    "I'm sorry, did you say something?",
    "You'll be wanting this if you're planning on talking to crocs.",
    "Cheerio!"
  ],
  "Croc": [
    "Oh no... oh no...",
    "I don't like the cold. Please don't let them make it cold.",
    "No, they have a machine, and it keeps spitting out ice...",
    "If only someone could have prevented this from happening... If I could turn back time, I'd find a way to make sure it didn't happen again.",
    "Oh, you know Chuck? I like Chuck, he's sure to know what to do.",
    "You didn't manage to stop the penguins machine yet? I'm so cold...",
    "Oh, I hope you can stop it.",
    "Yes, back in the day when I was a resident at the zoo. Those were the days of our lives, the bad things in life were so few. Chuck was always talking about penguins and their crazy schemes. I didn't quite believe him, until now.",
    "I felt the call of the wild, you know? I needed to find... something... So when the keeper came to feed me one day, I gave him the gentlest of nips, and made a run for it. I've climbed the highest mountains, I've run through the fields... but I still haven't found what I'm looking for...",
    "Old age, a cold zoo and a hot desert. They play havoc on the skin!",
    "Farewell.",
    "You didn't manage to stop the penguins' machine yet? I'm so cold...",
    "Oh... But it's making a bit of a draft. I feel so cold.",
    "I suppose that would work."
  ],
  "Lara or Rose": [
    "Oh, hello!",
    "That's because it's the middle of the desert, silly! Doctor Hugh has tasked me with making sure everyone stays cool... Make sure you take regular breaks and stay out of the sun where possible!",
    "Is it time to leave?",
    "Ok, I'll be right there!"
  ],
  "Penguin henchman": [
    "Is there anything I can do for you?",
    "Sorry, we're all out of ice cream. We've got plenty of ice cubes though?"
  ],
  "Emperor Wing": [
    "Ah! It's the pilot. We wondered where you'd got to.",
    "We brought the T.A.R.D.I.S. here to begin the process of lowering the temperature of Gielinor. However, something went wrong, and we crash landed here. Now the T.A.R.D.I.S. is malfunctioning. It was to be a glorious and epic mission. We had a party before we left, to send us on our way. We were each served our favourite fish. There was mackerel, sardines, shrimp and anchovies. We were supplied with emergency items, just in case, that would help us with our mission. There was black ice, vanilla ice, cyan ice, and yellow snow.",
    "I didn't pay much attention to anyone else, but I had Mackerel, it was delicious.",
    "What did you say?!",
    "Oh... Maybe later.",
    "There's no time to chat! We must all help get the T.A.R.D.I.S. working to full capacity!",
    "There's no time for chit-chat laddie/lassie! We've got work to do! Hop to it!",
    "Good! Inform the crew that they should prepare to leave, then report back to me.",
    "Good. Good. Excellent! Er... Player? I've not quite finished my pilot training... Can you fly this T.A.R.D.I.S., and land it?",
    "I am serious, and don't call me Shirley.",
    "Great!",
    "We must get to the T.A.R.D.I.S! Let's leave now before we're overcome by the cool-ant leak."
  ],
  "Penguins talked to": [
    "[X]/4",
    "[X]/4",
    "[X]/4",
    "[X]/4"
  ],
  "Elon": [
    "Ah! It's the pilot. We wondered where you'd got to.",
    "Don't you remember how much we laughed at the navigator getting given Vanilla Ice? What help is that going to be?",
    "Excuse me?!",
    "Well, that's deserts for you.",
    "There's no time to chat! We must all help get the T.A.R.D.I.S. working to full capacity!",
    "So much to do and so little time...",
    "So much to do... but sure, if you can find some things for me that would be a great help.",
    "I've got a list, have a read and see what you can get hold of. You may need to go on a dangerous mission amongst humans to find some of the parts.",
    "Remember, Humans are dangerous.",
    "So much to do... Oh it's you, how's the search for the things on the list going?",
    "Please try not to lose this one. Paper doesn't grow on trees you know!",
    "Ok, but hurry, we're on a tight schedule!",
    "So much to do... Oh it's you, how's the search for the things on the list going?",
    "Excellent! It shouldn't take too long to get these installed. While I do that, would you mind calibrating the energy supply at the battery control panel? You'll need to supply it with some sort of energy first...",
    "Hmm. Well, there's the tricky part. All energy sources we've tried so far have failed to give sufficient power to the T.A.R.D.I.S. We need something stronger, more concentrated... Something with flickering, bright, sparkling, gleaming qualities... As if it was the life-force of a God! But I don't know where we'd find such a thing!",
    "What's divine energy?",
    "It's hard to say for sure, but I think a total of 200 units, split equally amongst different types of energy, should suffice.",
    "Have you calibrated the machine yet?",
    "Find 200 units of a highly concentrated flickering, bright, sparkling, gleaming energy. Deposit it into the crate next to the battery control panel, then operate the control panel to configure the power supply.",
    "Good work young penguin! I've finished installing everything, the T.A.R.D.I.S. is ready to go! Please, inform Gordon and Hugh, and then report to Emperor Wing so that we can leave!",
    "Keep your flippers on, I'm coming!"
  ],
  "Hugh": [
    "I'm not a fan of parties, I mostly just sat in a corner reading some medical books. I do remember noticing one of the guys doing some pretty bad dancing. He had yellow snow in one hand, and some shrimp in the other.",
    "Pardon?",
    "That'll be the sand getting in your eyes. There's some eyewash in the T.A.R.D.I.S. you can use.",
    "There's no time to chat! We must all help get the T.A.R.D.I.S. working to full capacity!",
    "Having a rest, what does it look like?",
    "Even the KGP are allowed rest breaks!",
    "I'll be right there, I'll just get my two assistants!",
    "Keep your flippers on, I'm coming!",
    "We must evacuate the bunker and get to the T.A.R.D.I.S!"
  ],
  "Gordon": [
    "It was a great evening. Luckily I didn't have to eat any anchovies! We were all given some emergency items. I lost mine, but I can tell you that Hugh had Cyan Ice.",
    "Shhh! Not so loud! Who are you? You look familiar... were you on the T.A.R.D.I.S?",
    "Never mind. What do you want? How do you know who I am?",
    "The penguins have been building a doomsday device in a secret bunker underneath their base. You can see it here, it's the Terraforming Arctic Refrigeration Dispersing Ice Spreader, or T.A.R.D.I.S. for short. Its purpose is to change the whole of Gielinor to be a permanently frozen arctic tundra! As you can see, things haven't gone quite to plan, and we landed in the desert. But the machine is still gradually turning the desert into a giant ice rink!",
    "We can't sabotage the T.A.R.D.I.S. while the crew and these henchmen are around, but there may be another way... There's a device back at the iceberg I've been working on during my 'Twiblick All-day Passion Projects' time.",
    "Oh, it's time we're allocated to work on our own things. The things we're really passionate about!",
    "It's called a De-lore-ing device.",
    "Well, put simply, it's a temporal displacement device.",
    "It makes time travel possible...",
    "You could go to the secret bunker on the iceberg, and use the device to travel back in time. My past self will be able to help you. Maybe together we can stop this from happening.",
    "If I leave here, my cover will be blown. And besides, I can't risk bumping into my past self!",
    "Great! I've hidden the De-lore-ing device in my locker. There's also some other bits around the place that'll help you finish it.",
    "Don't be grumpy, it'll be fun! Here, take this device, you can use it to locate the bunker. You'll also need the CHIP and FIN entry code: 1234",
    "Here, take this device, you can use it to locate the bunker. You'll also need the CHIP and FIN entry code: 1234",
    "Did you find the secret bunker yet?",
    "Who are you and how did you get in here?!",
    "Slow down, slow down... tell me what happened.",
    "6th age you say? But this is the 5th age. What happens? NO! WAIT! DON'T TELL ME!",
    "You do realize that if we destroy it, we wouldn't have met and you couldn't have come back to stop it.",
    "No, we must ensure the device is finished so we don't cause a time loop or paradox.",
    "Well we've had some supply problems and issues finding parts. You'll need to speak to Elon to find out more and see if you can help him. Meanwhile, I'll think of something to try and break out of this loop and stop it happening over and over.",
    "Did you speak to Elon?",
    "He should be in the main research facility with the T.A.R.D.I.S.",
    "Did you speak to Elon?",
    "Good. That should keep you busy while I try and come up with a plan!",
    "How are you getting on?",
    "Right. I start putting things into place.",
    "If I told you that, I'd have to kill you...",
    "But what if you fell into the wrong hands? You might squeal.p_peng_neutralNo, you're best not knowing[sic]",
    "I'll be right there, I just need to put my prototype De-lore-ing device in a safe place!",
    "Keep your flippers on, I'm coming.",
    "We must get to the T.A.R.D.I.S! It's the only way out of the bunker!",
    "Hello, Player! Good to see you again.",
    "Fine. The penguins are still trying, and failing to get their T.A.R.D.I.S. working to full capacity.",
    "I'm just staying under cover, and sending reports when I can. My mission now is to sit tight and observe."
  ],
  "Filip": [
    "Oh good, are you here for the presentation?",
    "I'm Filip, and I'm waiting for some Very Important Penguins so we can begin our strategy update.",
    "Oh, and I'd been practising and I'm ready to deliver my strategy update for the year. It's all about: Transformation, Transformation, Transformation!",
    "I'm in charge of strategy, and more recently sails.",
    "Yeah, that! There's been a recent boom in that sector. Here, take this pen...I'll show you! Now give it back to me, and say: Hey man, sell me this pen. Hey, can you sign this for me?",
    "Well have you tried using that old Rod?",
    "It's no good, so you need a writing implement you can rely on. Here, I'll sell you this pen...",
    "See!",
    "Oh good, are you here for the presentation?",
    "Ok then, when you change your mind I'll be here!",
    "Ah back again, changed your mind about the presentation?"
  ],
  "Ping": [
    "Dude, are we glad to see you.",
    "Check it out, he doesn't even perceive his location as Fin-inor!",
    "Dude, we're famous rock stars!",
    "Yes way! We had a most excellent journey becoming unrivalled musicians.",
    "Well we were popularising our new album and performing on our most resplendent tour ever.",
    "And that's when we bit the head off a fish on stage!",
    "Then security chaperoned us off stage forthwith.",
    "Yeah, especially when we should be composing new material for our comeback!",
    "Catch you later!",
    "Dude, any luck?",
    "Did you bring us some most excellent news?"
  ],
  "Pong": [
    "Yeah man, it's bodacious.",
    "Whoa, that's most non non non excellent.",
    "Outstanding rock stars in the band Chilled Unicorns!",
    "We've come a long way from the iceberg and practicing in an igloo!",
    "And I was getting totally famished.",
    "I was ravenous bro, but they took offence because because it was on a national holiday called 'Darkness'.",
    "And they thrust us in this enclosure to decompose.",
    "They even threw our instruments over there to taunt us.",
    "Party on for us dude!",
    "Did you bring us some most excellent news?",
    "Dude, any luck?"
  ],
  "Man": [
    "I  am  not  a  robot.",
    "I  hope  I  do  not  break  my  pick  axe",
    "Must  mine  ore.",
    "My  mining  level  is:  [number]",
    "Work  work",
    "My  Er  Mining  level  is... Argh a talking penguin! I mean shhuuusssshhhhh, keep you voice down...",
    "I was sent here to investigate these 'people' if you can call them that.",
    "Well, they're all doing the same thing, and behaving very oddly. Almost like they've lost their minds and have become drones or robots or something.",
    "Well, I've tried distracting them by throwing things but nothing happens. As my mum used to say, if it's not working, give it a kick! Perhaps you can try?",
    "Does  not  compute.",
    "Nothing interesting happens."
  ],
  "Noodle": [
    "Hey, how di' u get in 'ere?",
    "Dat's need to know bruva, but I got it easy tho... Only lot 'ere r all dem science boffs who come up wif plans 'n' mad strats 'n' stuff for takin' over th' wurld.",
    "Lots of blue ice finkin' goes on down 'ere. An I'm in charge of protektin' da place. Simple wif' my uva set o' skillz.",
    "Whut new age? U gon made? Dis is da fif' age mate.",
    "Yes mate, pays ter keep yer ears to da walls. It's the latest fling in global coolin' Nearly fin-ished 'n all.",
    "Long story mate, but after gettin' outta the can, I needed another job, you know jus' fur sho'. Gets the fuzz off me back, and workin' 'ere 'as sum perks.",
    "Rite, back to bizness. Only jokin', I just mess around all day cuz I sorted out sum top notch security for dis place.",
    "Tis impregnable mate, unlike sum fins I no!",
    "Wot 'bout ma security!",
    "Lucky guess! Anyway, can't change it nah, took long nuff for pengwins to 'member dis one.",
    "'member mate, if I find aut dat u've been sharin' that code 'n' grassin', u'll be takin' a long flap off a short pier.",
    "Di' I mention dat u'd be wearin' concrete boots 'n' all?",
    "Bizness is good man, we'f been branchin' aut, security mainly, cos we got lots of experience!",
    "Oh, I'd not forgotten 'bout dat mate. I've got sum ideas when we get back to de Motherland. Gonna need you to bring me some supplies for my new bizness ventures.",
    "Well, I'm gonna get into racketeerin' once I gets me some rackets. N' I've already dun some vote riggin' for som' bloke wif blon 'air...",
    "Yeh, 'cept I was finkin' about loanin' sharks, but I ain't fand anyone who wan's one yet.",
    "ID Cards? Nah, dere yousless mate.",
    "Keep yer voice down, feds are still listnin' in, so don' mention words like dat, or u'll get us all in truble.",
    "Too much hassl'. So I wen' wif dis new Chip 'n' Fin tech, and my bro hit me up wif de gear. Got it fur a steal!",
    "Get to da T.A.R.D.I.S! I'll er. hang' a'roun' 'n keep everyt'in' safe."
  ],
  "Penguin": [
    "Yeah, the T.A.R.D.I.S. pre-launch party last night was pretty cool. Bit soon if you ask me, there's still loads to do!",
    "How could you have missed it? It's all part of the bunker refurbishment. Ice white was last year, it's all about grey stone these days.",
    "I know right. I'm tired of fish everday, it'd be nice to have something else for a change.",
    "That sounds good, wait, don't you mean Penguin Macaroni and cheese?",
    "Did you hear about Gordon's most recent experiment?",
    "I can't believe you didn't hear about it, we thought he'd died!",
    "Yeah, Gordon's alive though, mainly down to Dr Hugh, Rose, and Lara's quick thinking!",
    "They used the de-fin-brilator ofcourse[sic].",
    "Yeah, it's too warm for my liking. Other than that, the conditions are perfect for launching the T.A.R.D.I.S., if its ever finished.",
    "Probably, the desert is far too hot for penguins like us. Mind you, once the T.A.R.D.I.S. is fully operational over Gielinor, we'll have it cold and frozen in no time!",
    "I can't believe it's been [number] days since our last accident. We're due a party on the fields of ice if we keep this safety record up!",
    "Not bad, did I see you in Ice-land the other day buying some fish?",
    "Oh hi, say, have you been to NY? They say it's better than Old Yanille.",
    "You look familiar, did I meet you before at the company jolly up the coast at Tenner Reef?",
    "Urgh! Another cool-ant leak alarm.",
    "Yeah, happens quite often. Can't tell you how hard it is to gather up all the cool-ants afterwards.",
    "It's probably just another false alarm, some builders probably set it off again I guess."
  ],
  "Buzz": [
    "Buuuuzzzzzzzz."
  ],
  "Lara": [
    "Hi there!",
    "Yep.",
    "We must get to the T.A.R.D.I.S! It's the only way out of here."
  ],
  "Rose": [
    "Hello!",
    "I'm one of the doctor's assistants.",
    "Hurry, before the cool-ant spreads further! We must get to the T.A.R.D.I.S!"
  ],
  "WARNING": [
    "COOLANT LEAK DETECTED."
  ],
  "Congratulations! You have completed": [
    "'Back to the Freezer'."
  ],
  "Elon, Emperor Wing, or Hugh": [
    "Ah! It's the pilot. We wondered where you'd got to.",
    "Be positive young penguin! The supply problems out here are making things difficult, but with hard work we will prevail!"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Back_to_the_Freezer?oldid=35491481’"
  ]
}