{
  "Ozan": [
    "*psst* Hey, buddy. Over here. Yeah, you. I know you don't I?",
    "Yeah, you helped me kill that troll general back in Burthorpe. I see you adopted our little mascot! Hey there, little buddy!",
    "How's the little tyke doing? Does it have a name yet?",
    "How, er...creative.",
    "Hey, yeah, that's a good name for it.",
    "It ate one of your other pets? How, er, cute.",
    "Yeah, you helped me kill that troll general back in Burthorpe. Whatever happened to that baby troll?",
    "Hahaha, yeah? How's the little tyke doing? Does it have a name yet?",
    "How's the little tyke doing? Does it have a name yet?",
    "How, er...creative.",
    "Hey, yeah, that's a good name for it.",
    "It ate one of your other pets? How, er, cute.",
    "I'm sure it'll come to me. Never mind for now; my name's Ozan.",
    "That's it! Xenia told me about you. She said you helped stop some blood ritual in Lumbridge. Said I should watch out for you, this new up-and-coming hero. By the way, my name's Ozan.",
    "Anyway, I'm glad you stopped by. I've got a bit of a situation here and I could use some help. An old friend of mine - Khnum's his name - seems to have fallen in with a new gang setting up shop here in Draynor. When I saw him he was acting all shifty, wouldn't talk to me about it. I think he's in over his head. So I need someone on the inside. I'm a bit too well known. Adventures with me tend to be a bit...unpredictable, but I'm sure we'll have a few laughs along the way. What do you say?",
    "I'll be here if you ever change your mind. See ya around.",
    "Right now, Khnum is holed up in the cellar of this house next to us. Knock on the trapdoor, pose as a thug and try to get yourself recruited, then see what you can find out about Khnum. Any questions?",
    "I knew him back when I was growing up in Al Kharid. He was a palace guard and I was a petty thief, but we were good friends. That is until I had to, er, leave...then we lost touch. I've no idea how he went from being a palace guard to joining such a violent gang... ...but I'd like to help him out of it, like he used to help me. He's a good man at heart.",
    "They call themselves the Skulls – relatively new to the game. From what I hear, they're making a lot of waves, trying to make a name for themselves. They take jobs other more 'reputable' outfits wouldn't touch with their blackjacks. I mean, I've got a bit of a shady past myself, but some of the things these guys do...it's just not right. This cellar they're in is the gang's secret drinking den.",
    "Great!",
    "Hey, so you made it back out alive. Are you in? What did you find out?",
    "This kidnap job he mentioned worries me – I want to ask him about it. He said he wants you to meet him at his gang's HQ, then run supplies to his mercs. So it sounds like he'll be moving his own away there soon. We should wait for him to surface then follow him – that's how we'll find the HQ. Once we get him alone, I'll step in and one can find out more about what he's mixed up in. There must be more going on – the Khnum I knew wouldn't do something like this. Are you ready to trail Khnum back to his HQ?",
    "Good, but you'll need to get rid of your follower first.",
    "Okay, when Khnum comes out, we need to keep him in our sights. But don't get too close, or else he'll spot you. I'll stick with you, but will hang back so he doesn't see me. If you're getting too close, or he's getting too far away, I'll let you know. I think I hear him coming. Let's do this.",
    "Okay, I'll wait here for you until you are.",
    "Haha! You gave him some good answers there. I'd hire you! You were just pretending, though, right? Anyway. What else did Khnum say?",
    "I can't believe he's the gang leader. And none too fond of me any more, by the sound of it. No wonder he wouldn't talk to me about this. I mean, I may be more than just the world's greatest thief these days, but he is still an old friend. I'd help him if I could. I wonder what happened to lead him to this. Was there more?",
    "Wait, what? He said he was 'sticking it to his old employer'? Surely he can't mean from back when he was a palace guard in Al Kharid. I just can't see him doing something that serious. What are you up to, Khnum? Anything else?",
    "Come on, we have to keep moving.",
    "Move up.",
    "Okay now.",
    "Let's go.",
    "We're losing sight of him.",
    "Hurry, he's getting away!",
    "We lost him. We'll have to try following him another time.",
    "Back up[sic]",
    "Ease off[sic]",
    "We're too close[sic]",
    "Quick, we have to hide!",
    "He spotted us. We'll have to try following him another time.",
    "If you'd prefer, we can follow Khnum some other time.",
    "We should be okay here.",
    "He just went into the old jail – that must be his gang's HQ.",
    "Khnum went into the old jail. We should go in and confront him. Unless you'd rather do it later.",
    "I think Khnum's still in the old jail we trailed him to. You wanna head over there now?",
    "Okay, I'll wait here for you until you are.",
    "Okay, he went in here. Let's have a little chat with him...",
    "No, you're good just there. What are you up to, Khnum?",
    "But at least I have a code. There are some things you just don't do! You were a palace guard, for Het's sake! What happened?",
    "I had no choice – they banished me! I'm sorry we lost touch...but that's no excuse for what you're doing now. Let me help you.",
    "You call being involved in a kidnapping fine? What's that about?",
    "Who's this? Another of your lackeys, Khnum? I have to say, she's prettier than the rest of them.",
    "But you're not getting the old man, sweetheart. He's helping us out.",
    "Hero? So you've heard of me? What am I saying, of course you've heard of me, I'm Ozan...",
    "Whoa, hang on there, er. We're not part of his gang...and if you're not either, than who are you? No wait, don't tell me; I know this. These piercing jade eyes...the full, soft lips...that dulcet voice... the scary looking crossbow aimed at my heart – is that you, princess?",
    "Of course, I'm sorry – it's Leela, right? Look, I may be many things, but we aren't Khnum's Skulls.",
    "Look, Khnum's men are kidnapping someone tied to Al Kharid – we're trying to stop it. We can work together. You have to trust us. I'm lowering my bow; don't shoot.",
    "Or you could shoot...but that'd ruin my favourite shirt.",
    "Wait – what? You've kidnapped Prince Ali? I knew you'd got into some serious stuff...but this?",
    "Yeah, that may be so...but you don't know my friend here. If you won't talk to me or Leela... You can talk to [him/her]...",
    "Khnum and I talked about all sorts back when we were friends, but the one thing almost every conversation we had came back to was food. He loved to talk about food and try new recipes, and boy did he love to eat. Perhaps something around that could work...",
    "I'm not comfortable with that. Whatever Khnum might think, I'm still his friend.",
    "Don't look at me, I'm rubbish at mixing potions.",
    "But what if they don't come, hey? What if they just replace you? Imagine that!",
    "Right, yeah...like you love of food, Khnum. How much is your imagination going to feed you when all we give you is bread and water?",
    "Lady Keli? So, you're just a pawn in all this... Khnum, who is this Keli woman?",
    "It's too late to clam up on us now, Khnum. Where are they?",
    "Catch up as soon as you can, Princess! We'll wait for you at the shore due south of here. Let's go!",
    "We need to get to the shoreline, south of the jail.",
    "I'm gonna stay here. I'll wait for you in Draynor's old jail.",
    "Come on, we need to get to the shore and stop those kidnappers! Ah, but you'll have to get rid of your follower first. Talk to me again when you have.",
    "Everybody stop! Hand over the prince and I might only kill you a bit.",
    "Let's do this!",
    "No time to chat - we gotta take out Keli's thralls!",
    "That last merc dropped a ransom note.",
    "I picked up that ransom note, but I think you should hold on to it.",
    "Well, that's those thralls dealt with!",
    "It's not over yet, Leela. We'll get him back, I promise you that.",
    "Whoa there, princess. I've met your old man, remember...and he's none too fond of me. I'm not exactly welcome in Al Kharid these days, either. Osman would clap me in irons as soon as he caught sight of me.",
    "Why don't you take him the ransom message, and we'll try to track down the kidnappers? Or we could all just go together.",
    "As you wish, princess.",
    "Well, I guess I've got my, er, orders... Look, I know you've kinda been dragged into this far, but... I could really do with your help. Would you come with me to Al Kharid?",
    "Good for you! Just think: it'll be something to tell your grandkids one day - the time you travelled with amazing Ozan! Also, I'm not exactly welcome in Al Kharid these days. I could do with a friend to vouch for me.",
    "I can tell you've visited Al Kharid before. We can use the Home Teleport spell to get there if you'd like. It'd save us some walking. The palace is a straight shot south of the lodestone there.",
    "Unless you can think of a closer teleport, we could Home Teleport to Lumbridge. That'd save us some walking. Once we hit Lumbridge, we just head east over the bridge and into Al Kharid - the palace is at the centre of the city.",
    "I don't think I can do this without you, friend. I'll be here when you're ready to go.",
    "Good idea, I'll follow you.",
    "Well, here we are: Al Kharid! Home, sweet home. Sort of... Come on, let's head to the palace.",
    "That's barbaric! They want the emir's heart in exchange for his son's life!",
    "You have questions?",
    "Al Kharid is where I was born and grew up. I'd say raised, but I never knew my father, and my mother passed when I was very young. I think she worked in the palace, but I can't really remember that far back... So I raised myself the only way I could - stealing to survive. But, er, I had to leave not long into my teens and haven't been back since. Well, not officially... Anything else?",
    "He is... was a good friend. I met him back when he was a palace guard. I was a thieving street urchin; he was the only guard who ever caught me. Didn't turn me in, though, no. Never did tell me why not. But he looked out for me, you know? After all this is done, I might pay him a visit in his new home. There's hope for him yet... More questions?",
    "Ah, Leela, Leela, Leela. I only met her once before, back when we were both kids... She's as headstrong now as she was then. There's no way we'll persuade her not to go after Lady Keli. She's a tough kid, though; ah, she'll be fine... at least until we can get some help out to her. Oh, and in case you were wondering, she's not really a princess. I just say that to wind her up. Got more?",
    "Ah, yeah, Osman. He's the one I'm gonna need your help with the most. He's Leela's father, which I found out all too painfully. He's the reason I got booted out of Al Kharid. Well, okay, I'm the reason; he was just the boot. He was the head of the palace guard back then, but Leela said he's the Spymaster now. If anyone can help rescue Prince Ali, it is him. From what I remember, he's harsh, but fair. I don't think he'll hold my past against me... but it doesn't hurt to have an honest-looking friend to vouch for me... and Leela's passphrase too.",
    "Keep going until we reach Lumbridge!",
    "Keep going west until we reach Lumbridge!",
    "Well, this is Lumbridge. If we head east over the bridge we'll reach Al Kharid. The palace is in the centre of the city.",
    "On the swamp's east coast is a dock that leads straight to Al Kharid.",
    "Ah, good old Lumbridge. Al Kharid's over the river to the east.",
    "Lumbridge farms! Al Kharid is south-east from here.",
    "We're near Varrock. Al Kharid is south of here.",
    "Almost there! Keep going due south.",
    "Well, here we are! Al Kharid! Home, sweet home. Sort of... Come on, let's head to the palace.",
    "Come on, let's head to the palace and find Osman. It's just up the stairs opposite the lodestone.",
    "I'll wait for you on the shore south of Draynor.",
    "But we have urgent business! We must speak with Spymaster Osman immediately.",
    "It's about the kidnap of Prince Ali!",
    "No, he is not! We just saw him being womanhandled into a boat headed for the desert.",
    "And if I'm not mistaken, his kidnappers were wearing blue and gold – the colours of Menaphos!",
    "Lock us up! Take us to your leaders!",
    "Argh! But I am Ozan!",
    "Damn, there's no way we're getting in the front door. But that guard gave me an idea... We're going to break in and find Osman for ourselves! It's not like I haven't broken into the palace before... Come on, we need to get up on to the roof of the crafting store first. It's in the north-east of the city.",
    "I'm gonna stay in Al Kharid. I'll wait for you outside the palace.",
    "Come one, we need to get up on to the roof of the crafting store first. It's in the north-east of the city.",
    "Ah, but you'll have to get rid of your follower first. Talk to me again when you have.",
    "Dommik's crafting store is in the north-east of the city.",
    "Try the ladder in that corner.",
    "Ha! There it is - that plank over to the next roof.",
    "Slide down that awning.",
    "If you go through the building, there's a washing line we can walk across.",
    "Excuse us! Coming through!",
    "There's another ladder.",
    "Over those planks, but mind the guards below...",
    "Whoa, that ladder goes up high.",
    "Jump off that scaffold to the next building. It's a big jump, but I know you can make it!",
    "See that rug? Drop down over there.",
    "Quit monkeying around and swing across.",
    "Jump from the scaffold to the next building.",
    "We need to press on! No going back now!",
    "Okay, you'll have to trust me here - we've got to trampoline off that awning over to the bank.",
    "There's some brickwork we should be able to climb up.",
    "Okay, now we just need to get across to the palace...",
    "I've got this one!",
    "More brickwork.",
    "Hold up, there's a voice coming from that window. I think it's Osman...",
    "Whoa, did you hear that? Things are worse than we thought. But I remember now... The ransom's not for the emir's actual heart, it's referring to a diamond! I saw it once when I was a boy... In fact, it's part of the reason I was kicked out of Al Kharid! The Kharid-ib – it loosely translates to 'The Heart of the Sun' – that's what the kidnappers want! But if the emir won't let us take it... then maybe we should just not ask!",
    "Let's climb down into the vault!",
    "Not that way - too many guards. Let's find another way in.",
    "We'll get caught by the guards if we go that way. Plus, I don't like how that cat's looking at me.",
    "I'll tie off a rope.",
    "Okay, the diamond's in that contraption at the back of the room. But it's locked up tighter than the business end of a camel. And I should know, I've had first-hand experience... Er, to clarify, that's first-hand experience with the diamond. This is the room where Osman found me when I was younger. It's the reason I was banished from Al Kharid...and the reason Khnum got kicked out of the palace guard. Funny how life works out, eh? At least I'm here for right reason now. Problem is, I never did figure out how to get the diamond out – I think it has something to do with these Het scales in the middle of the room. Have a look around, see what you can find. Maybe there's something in those chests that'll help?",
    "Let's get the diamond before heading back to the roof. Unless you did not want to do this right now?",
    "Sure thing. We can always break in again later. It's good practice for me!",
    "Shall we make our way back to the diamond room?",
    "Fine. When you're ready.",
    "It looks like one of the weights from in front of this Het statue goes there.",
    "Yeah, that might have been the wrong weight. The knock-out gas trap was a clue. I had to put all the weights back to reset it... ...but I don't think they're in the same place as they were before. Sorry.",
    "Don't just yank it open...it might be booby-trapped. Pull that sticky-out thing first...yeah, that one. Then jiggle the doohickey and...",
    "Bingo!",
    "What does it say? Does it help? Let me know if you need any help figuring it out.",
    "It's okay, we only needed that one scroll.",
    "Huh, so if this scroll relates to the Het scales, it sounds like they all look identical, but one of them is heavier than the rest. It's the heavy one we need to put on the diamond pedestal. And if I'm reading it right, you can only perform two weighings to figure out which is the heavy weight. The trick to that's got to be in the scroll too.",
    "We have to convince Osman that we're not just petty thieves. Let's tell him about what happened in Draynor. Leela's passphrase will help too. I, er, hope you remembered it. You ready for this?",
    "Sure thing. Talk to me again when you're ready.",
    "Quick, we have to get to the roof before...",
    "...they cut the rope.",
    "Osman, old buddy! Long time no see! Umm, this isn't what it looks like.",
    "Yeah, well, okay, it is what it looks like.",
    "We found out they were involved in the prince's kidnapping, so we tried to intervene. Your daughter was there.",
    "We came straight here to warn you; to pass on the ransom note.",
    "...the palace is in lockdown, so we, er, used a different entrance.",
    "Okay, sure, so we broke in...but on our way in, we overheard the emir ordering you not to trade the diamond.",
    "Those are your orders, not mine. I'm no soldier. I'm not even an Al Kharid citizen anymore, if you remember...",
    "Yes! Leela gave us her passphrase.",
    "Oh, er, what was it again?",
    "She pretty much ordered us here to get some aid.",
    "I am sorry, emir. I am not your son, but I do bring news of him...",
    "...and that is why we must take the diamond, emir.",
    "But you agree with us, Osman! You said yourself it is just a diamond!",
    "No!",
    "We're not leaving until we've convinced you! I don't understand, emir. How can you be so callous?",
    "No! I didn't mean for... Did I do this?",
    "I know, but...I mean...I need some air."
  ],
  "Player": [
    "Umm...",
    "Just fine, I guess. [Baby Troll's name] - that's what it's called.",
    "I ended up getting lumbered with it!",
    "Just fine, I guess. (Baby Troll's name) - that's what it's called.",
    "A kidnapping? I should tell Ozan about this...",
    "I'll lock you up and throw away the key.",
    "What will you take pride in while locked up? Sure, so you have total faith in your men, but what about personal pride?",
    "If you tell us what we need to know, I'm sure your jail time can be made more...palatable.",
    "And where was your crew to lead them?",
    "Don't be so hard on yourself. We did all we could – Keli was just too powerful.",
    "It says: 'Follow the path of the sun into the lion's mouth. The emir's heart for the prince's life. You have until the sun sets on the desert two days from now.'",
    "About Ozan and Al Kharid?",
    "What happens with Khnum?",
    "What about Leela?",
    "Who's this Osman?",
    "That's all.",
    "But we have information that the emir needs to hear.",
    "I guess your paymasters haven't shared that little bit of intel with you, huh?",
    "Yes! Do that! Arrest us!",
    "Ozan said something about another way into the palace... Maybe this is where it starts... He's still loitering outside the palace - I should ask him.",
    "Well, this looks like a crafting store! Let's head in and get to the roof.",
    "Hang on, this is the wrong way.",
    "It's north of there, right?",
    "Well, this looks like a crafting store! Let's head in and get to the roof.",
    "It's locked[sic]",
    "It's locked!",
    "There's a whole history of the Kharid-ib here! One part of it seems particularly relevant...",
    "I've already taken a weight from the scales. If I put it back on the scales, I'll reset the puzzle.",
    "I should try using this weight on the diamond pedestal, see if I picked the right one.",
    "Wait! We're stealing the diamond to save the prince!",
    "We were investigating a gang in Draynor...",
    "Yes, she helped us...but the kidnappers got away!",
    "Well, we did try the front door first, but...",
    "...and you guessed it – that's what the kidnappers want!",
    "She, er, stayed to track the kidnappers.",
    "Without it, the prince – your son – will die.",
    "We've come too far to give up now!",
    "Ozan, maybe we should just go...",
    "I think he went out for some air."
  ],
  "Path 1A": [
    "If you have already met Ozan in Burthorpe and the Baby Troll is following the Player:"
  ],
  "Baby Troll": [
    "Dadda?",
    "YUM!"
  ],
  "Path 1B": [
    "If you have already met Ozan in Burthorpe and the Baby Troll is not following the Player:"
  ],
  "Path 2": [
    "If you have not met Ozan in Burthorpe:"
  ],
  "Path 3": [
    "If you have completed the Blood Pact:"
  ],
  "Bouncer": [
    "Wot d'ya want? Come on, I dun have all day.",
    "Please? Hahaha, I think you've got the wrong place, mate. Get lost!",
    "Got a warrant, mate? No? Din't think so. Get lost, chief.",
    "... Yeah, you seem alright. Come on in.",
    "Oh, it's you again - Miss/Mister Pokey Eyes. Well? Come in if you're coming in."
  ],
  "Khnum": [
    "Hello, stranger. Welcome to the Skullery. I take it you're here to join the Skulls, not for the atmosphere. That is to say, you're surrounded by Skulls; one wrong word and your throat'll be cut before you've finished saying it. That clear?",
    "Good. In which case, my new friend, you'll be wanting to pass my little initiation. It's just a few...theoretical situations you might find yourself in, IF you pass. And if you don't pass...well, use your imagination. Now that the formalities are out the way, first question... You see a wealthy resident leaving Draynor Market laden with goods. They stop and ask for your help carrying their goods home. Suppositionally, what do you do?",
    "Hmm, it's simple and direct - I like it. They might not have much value, but at least you're bringing some loot in.",
    "Clever. You minimise risk, and maximise loot - not too shabby.",
    "Ah, playing the long con. It's slow and risky, but the payoffs can be huge.",
    "Okay, now for question two... A fellow gang member is wrongfully imprisoned. What method do you theoretically use to liberate them?",
    "And smuggle out our gang member in the confusion. It's bold and loud...but that has its own benefits.",
    "Ahh, that would take a long time, but it's a solid plan. And if the tunnel isn't discovered it can be used again..",
    "Ah, the old cadava berry trick. If things went wrong, that gang member could wind up dead. But if it goes right, everyone will just THINK they're dead.",
    "Okay, final question... A stranger disrespects you in public. What do you do, hypothetically speaking?",
    "Hahahaha. Yes, you make an immediate example of them. Plus they know not to fail you again.",
    "Yes, it teaches others to show you respect. Also that you're a leader, not a follower.",
    "Ah, the old unicorn head in the bed trick. You risk looking weak in the short term, but in the long term people will grow to fear you.",
    "Okay, you gave some good answers there. [You've clearly got potential... You're a thinker and a risk-taker; a swindler. With your ideas and the Skulls' resources, we could be rolling in it.]/[A risk minimiser, I'd say, and a steady earner to boot. Don't mess up and I can see you as an underboss.]/[You sound like you'd make a good enforcer. A gang can never have enough muscle.]/[You're something of an artful dodger - a finger in every pie. I'd say you're more of a freelancer than Skulls material, but I'm sure we can throw some jobs your way.] Well done! Welcome to the Skulls, recruit! Do you have any questions about the gang?",
    "As a matter of fact, three of my best are out on a job right now – a kidnapping. It's our biggest job so far, plus I get the bonus of sticking it to my old employer. It's relatively risk-free too; we've got some lady backer doing all the heavy lifting. But you don't need to know any more than that... That's enough questions for now. I've got a task for you. Don't worry, I'm not gonna get you to kill anyone...yet. Just run some supplies to my guys. I'll fill you in when we're at our HQ – this place is just where we unwind. Thing is, I'm not gonna tell you WHERE our HQ is. Consider this one final test – a practical to follow the theory. But if you can't find it, well, I guess you aren't Skulls material after all...",
    "My role? Hahaha! Don't mistake me as a recruiter! I AM the Skulls. This is my gang. Let's just say I got fed up working for 'the man', so I struck out on my own. And it turns out I've got a certain 'finesse' when it comes to crime.",
    "What of it? I've found that taking extreme measures is the only way to make a name for yourself. People around here known to fear us – they aren't going to put up a fight. It's not hard, though – the locals are scared of their own shadows. They're almost happy they're only being attacked by plain old humans. At least we leave them alive...mostly.",
    "Yeah, I know him...at least I thought I did. But then it seems everyone knows him these days. He might colour himself as being on the wrong side of the law, but he's really just a jumped-up do-gooder these days. Why do you ask? Is he still skulking around Draynor? Never mind. Just stay clear of him, right? He'll pretend to be your friend until he gets what he wants, then he'll leave you behind without a second thought. Don't trust him – you're a Skull now!",
    "Ha! No one in here is gonna tell you where HQ is. You have to figure it out yourself. Maybe some fresh air will help you think more clearly...",
    "Who's there?",
    "I guess it was nothing.",
    "I see you!",
    "Here's your money. The shipment arrives tomorrow morning.",
    "Ah, Pigzilla. Tomorrow's dinner will be 'informant'.",
    "Your protection money is due tomorrow.",
    "Yours too, Diango.",
    "Phew! I'm beat. Play something good!",
    "That's better.",
    "Well done, recruit. You found the HQ!",
    "Ozan! Recruit! NOW it's time for you to kill someone! ... Well? What are you waiting for? Unless... You're working together? Damn you! I'll kill you both myself.",
    "Bah! Nothing you're never done, you hypocrite. When we first met, you were nothing but a thief.",
    "YOU happened! That night you snuck into the palace...they blamed me for letting you in! I was disgraced. Turfed out after twenty years of loyal service...all thanks to an impetuous boy's curiosity. And then you just left Al Kharid, not a word to me.",
    "Help me how? To become a 'good' thief, a famous hero? Pah! Me and my gang are doing just fine.",
    "Finished your lovers' tiff? Well, I'm not telling you a thing. Neither of you have the guts to cause me harm.",
    "Ha! Torture me all you want! I'm trained to withstand it. Besides, by the time you get anything out of me, the prince would be long gone.",
    "As if any of you has the skill to just whip up a truth serum. Even if you did, or could find someone to do it, my info would be out of date before the serum was ready.",
    "Trying to attack my pride, eh? Think I might let something slip? That might work if I didn't have complete faith in my men. The three mercs I sent on this job are my best.",
    "They won't be alone, they'll be with- Gah! You're not getting any more out of me!",
    "Sure, that won't be fun... But I was a palace guard for a long time. My imagination will keep my mind occupied until my men break me out.",
    "Bah! I'll...I'll find a way out!",
    "Now, hang on, let's not do anything rash here. A man cannot live off bread alone... I need meat...and cheese... Ale, fruit, wine... Coffee! Oh gods no, don't take away my coffee!",
    "Okay, I'll talk! Just don't deprive a man of food, alright? Besides, the Skulls – we're only hired help. Our benefactor, Lady Keli – this is her camel show!",
    "I don't know who she is! I've never met her, only dealt with her two cronies – some tall guy with an eyepatch and his halfwit friend. The kidnap is all Keli's plan. My guys are just providing support – to act as guides in Asgarnia, and as muscle if it came to that.",
    "...",
    "Fine! There's a staging area directly south of here, on Draynor's coast. My men were to lead them there – there's a boat docked. Once this Lady Keli had the prince safely aboard, we were getting paid and cutting ties.",
    "I've told you all I know. Please, leave me be.",
    "Let me out of here!"
  ],
  "???": [
    "Yes, speak up. If you have got something to say, you can share it with the whole class.",
    "Oh, you are fast...but you will not stop me taking him, 'hero'.",
    "Ozan the bloody marvelous. I know who you are. You are still a smarmy git, and now you've fallen in with this traitorous scum and his gang.",
    "Urgh! Do not call me that! I am NOT a princess!"
  ],
  "Leela": [
    "Ha! You could have fooled me.",
    "...",
    "...",
    "Fine! I will trust you...for now. But only because I need information too. Do not think this makes us friends. But you are too late to STOP the kidnapping – the prince went missing while he was touring Lumbridge. I have followed the trail to Draynor.",
    "I lived in the palace when I was growing up - all the guards knew me. Khnum used to call me 'Little Boss', as my father was head of the palace guard back then. I remember Khnum had unending patience; stood unmoving at the entrance all day. He always took great pride in that. Perhaps you could attack that pride; suggest his failures.",
    "Seriously? After what he's done?",
    "My father might know how, but he's much too far away. We need to get Khnum to talk here and now!",
    "Ah, so there are only three of them...",
    "Get to the shore quick, there may still be time. I will join you once I have dealt with this fool.",
    "What are you waiting for? Go! Get to the shore quick, there may still be time. I will join you once I have dealt with this fool.",
    "Make that three!",
    "Quick! We have to kill these mercs and get to the prince!",
    "Grab the ransom note - we need to know what it says.",
    "Yes, but Lady Keli got away with the prince! On my watch, too!",
    "That's not good enough, I should have stopped them here! I failed. I have to follow after them. Father will never...",
    "I know! You two must deliver the ransom message to my father! His name is Osman, he is Al Kharid's Spymaster – he will be in the palace.",
    "Not if I tell you my passphrase. If you give him that, he will know the message comes from me. He will have to listen; the kidnap of Prince Ali is too important.",
    "No! Someone has to take the message to him and I...I cannot face him, not after falling here. Please...",
    "Thank you. I am sorry I did not trust you before, but I am trusting you now. My passphrase is '<Hamazanama/Kakolookiyam/Scheherazade/Zomorrodnegar>'. Do not forget it! And stop calling me princess!",
    "Please, travel with Ozan to Al Kharid. Meet with my father and get more help. And do not forget... My passphrase is '<Hamazanama/Kakolookiyam/ScheherazadeZomorrodnegar>'. I will talk with the authorities here in Draynor, get some guards posted at the old jail. At least the Skulls should no longer pose a threat to this place. Then I will head to Port Sarim to charter a ship, and follow after that kidnapping hussy, Lady Keli."
  ],
  "Lady Keli": [
    "Not the most convincing demand, little man. Make one wrong move and I'll kill the prince now; save us all some trouble.",
    "Besides, you're outnumbered and outmatched. You two don't stand a chance.",
    "Like it makes a difference. The prince is coming with me; try to stop us and he dies. Apep, Heru: to the boat.",
    "Skulls: kill these fools and deliver the ransom to Al Kharid.",
    "You will do as I command!"
  ],
  "Prince Ali": [
    "Don't give them what they want!"
  ],
  "Apep": [
    "Hold your tongue, boy. The lady's talking.",
    "Yes, Lady Keli."
  ],
  "Heru": [
    "Yer, lady."
  ],
  "Mercenary Joe": [
    "That's not in our contract, love! See, we ain't doin' nuthin' without our money!"
  ],
  "Leela/Ozan": [
    "I'm not dead yet!"
  ],
  "Palace guard": [
    "The palace is under lockdown by order of the emir. Please move along.",
    "Oh, you 'must', must you? And I suppose my orders mean nothing, hmm? No one is to come in!",
    "What's this nonsense? The prince is safely touring around Lumbridge.",
    "So it's spreading dissent and hysteria, is it? You're one of those pro-war nuts, trying to stir up trouble... Go on, tell me some more! Make me arrest you!",
    "... Ha! Nice try. You aren't fooling me; you're not getting in that way either! I wouldn't arrest you even if you were the world-renowned thief, Ozan, and you were trying to break into the emir's very own bedroom to pinch all of his left socks!",
    "Now I've heard it all. Brilliant. Wait till the others hear about this one! In the meantime, you two clear off!",
    "I thought I told you to clear off!"
  ],
  "Woman": [
    "Get out of my house!/Who are you?",
    "Get off my laundry!",
    "About the emir?",
    "Nah, I don't believe that."
  ],
  "Guard #1": [
    "Why the lockdown?",
    "Maybe 'cos of that Menaphite..."
  ],
  "Guard #2": [
    "Osman didn't say.",
    "Ambassador Jabari? Could be."
  ],
  "Man": [
    "Have you heard the rumours?",
    "They say he's ill."
  ],
  "Osman": [
    "There!",
    "That's better, I can actually breathe over here. I find the incense gets up my nose.",
    "Among other things...",
    "Not missing, kidnapped! This was a deliberate act. I wouldn't be surprised to find out that Menaphos was behind it. Employing 'politics' where war has failed you. Rest assured, my people are looking into this.",
    "No, it's just warmongering and slavery these days, isn't it?",
    "Indeed. Menaphos's 'Pharaoh' is proof of such...",
    "Oh, then how should I insult him?",
    "I am sorry, emir. Ambassador, my most sincere apologies.",
    "Oh, but it's so much fun.",
    "I feared as much.",
    "At any cost, emir? Even if the ransom is to be the Kharid-ib?",
    "It's just a diamond, emir.",
    "But it's your son!",
    "... Yes, emir. I will not fail you.",
    "Someone's in the vault! Guards: get this door open! There's no reason for alarm, emir. Whoever's in there is trapped.",
    "Please, don't leave on my account...",
    "...not that you'd get far.",
    "Really? Because what it looks like is me catching the so-called 'master thief' Ozan, who's attempting to steal the Kharid-ib. For a second time...",
    "Guards! Take them away.",
    "Hold. Explain.",
    "Leela...",
    "And yet I find you in here...",
    "Ha! So I see!",
    "So you thought you'd just ignore the emir's orders and steal it...",
    "Yes, and if you remember that's due to a situation very much like this one! Do you have anything to back up this little story?",
    "Hmm, it's true she would only freely give such information to an ally...and only in dire circumstances. Very well. If you can tell me my daughter's passphrase, I'll be more inclined to believe you.",
    "... Okay, let's for a moment say I believe you. Why did Leela not return with you?",
    "Ha! That certainly sounds like her. ... But you must know my orders mean I cannot allow you to leave with the diamond. Hand it over.",
    "Now follow me. You can tell your little tale to the emir...",
    "You embarrass yourself.",
    "You're just guessing.",
    "That's not correct.",
    "Emir, may I present our two intruders?",
    "I am sorry, emir. That was not my intention.",
    "The emir's word is law! Come, let us leave him to his rest.",
    "Hassan, do something!",
    "Don't be absurd, Ozan. You heard yourself he was dying.",
    "Before you say anything, I hold neither you nor Ozan accountable for the emir's death. He has been ill for a long time. Where did Ozan go, anyway?",
    "The emir was a direct man, and yours were words he needed to hear. In light of the situation, I am also ignoring your attempted theft – but don't get any ideas... I am the spymaster here, and it falls to me to form a plan of rescue. Although I may have need of you and Ozan once I have done so. Please tell Ozan that his past deeds are forgiven. He is free to return as a citizen of Al Kharid. And as for your part in this, the city of Al Kharid rewards you."
  ],
  "Jabari": [
    "Osman, you're stalling. This situation is untenable and you know it. The peace between our kingdoms is shaky at best. Between the emir's illness and the prince going missing, you need to establish some stability here.",
    "Be careful with your accusations, spymaster. The Pharaoh sent me here as an envoy of peace. Menaphos is not in the business of kidnapping.",
    "And your 'people' had best steer clear of Menaphos, if they value their lives.",
    "You would leave your city leaderless?",
    "How DARE you!",
    "Hmph!",
    "Very well, wise one. I shall take it back to my Pharaoh."
  ],
  "Hassan": [
    "Enough! Gentlemen, please; keep your tongues civil in the emir's presence.",
    "Osman! You shall not insult our guest like this!",
    "After you, ambassador.",
    "There is nothing TO be done... The emir has passed. If Menaphos hears of this before the prince is returned...we are lost.",
    "Good idea. In fact, you should all go. I must attend to the emir's last rites."
  ],
  "Emir Shah": [
    "It is alright, Hassan, I would hear this plainly. The peace must be maintained. But my answer is no, ambassador. No Menaphite will ever sit on Al Kharid's throne, even if only as custodian.",
    "I am not dead yet, Jabari! And even if I were, leaders would rise, be they of royal blood or not.",
    "Osman...",
    "Even without myself or my son, Al Kharid is strong. You have my answer.",
    "Hassan, please see our guest out.",
    "You shouldn't have riled up Jabari so much.",
    "Ha! Indeed it is. Now, forget what I told Jabari. The truth is I have little time left – I am dying, old friend.",
    "If my son is not safely returned to succeed me, Menaphos WILL declare war again... Find my son and bring him home...at ANY cost.",
    "No. Never. The Kharid-ib belongs in Al Kharid, and here it must stay. If that is the ransom, you must find another way!",
    "I have my reasons...",
    "...and you have your orders!",
    "Well, Osman, who was in my vault?",
    "My son? Is...is this him? Is he returned? Come closer, boy! I can't see you from here!",
    "... Osman, I gave you your orders. Did you think these two might convince me where you did not? I am not one of your assets to manipulate! The Kharid-ib stays here! No exceptions!",
    "Do not presume to judge me, child! I love my son...but I also love my people, and they must come first. It is not for you to understand. If, as you say, you wish to save my son, then I beg you to do so...but you are NOT taking my... ...my... My...heart!"
  ],
  "Cat": [
    "Meow."
  ],
  "The following text is transcluded from Transcript": [
    "History of the Kharid-ib."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Stolen_Hearts?oldid=36226343’"
  ]
}