{
  "Sister Catherina": [
    "Thank Saradomin! You must be the adventurer the abbess prayed for!",
    "Our abbess prayed for an adventurer to come and help us. She asked me to stand here and wait for you to arrive. Will you help us, adventurer?",
    "I don't know any more! Abbess Benita just said she was praying for an adventurer, and told me to wait outside to meet you when you arrived.",
    "Well, I mean, a bit...but we're not meant to question the abbess's decisions.",
    "Well, one of the older sisters died yesterday. Saradomin guide her soul to light. The abbess says she went peacefully in her sleep. It's a bit odd that no one's been allowed to see her body...but it's not my place to question. Oh! Another thing that's happened: a troubadour showed up earlier today. Abbess Benita didn't let him come inside, so he's camping here. We don't often get visitors, so that's a little odd.",
    "Saradomin be praised! The abbess's office is just inside the wall. Go in through the gate and head north.",
    "Oh. Let me know if you change your mind. Saradomin be with you.",
    "Hello again, adventurer! How can I help?",
    "I was in the scriptorium copying a manuscript. I'm still learning how to illuminate the text. I've copied nearly the whole of the Book of Saradomin. I'm quite...well, I know I shouldn't be, but I'm quite proud of it. Perhaps you'd like to see it, after the funeral service, if you're still here?",
    "Alright! I'll have to check if that's allowed, though. Come back and speak to me after the funeral.",
    "Oh well. It's for Saradomin - it doesn't matter if anyone else sees it.",
    "She was so holy. She thought about Saradomin all the time, never about herself. I don't know if I'll ever be as holy as that. She interviewed me when I applied to join the abbey. It was like she could see right into my heart. To be honest, at first, she frightened me. I'm not surprised the other applicant left after she met her.",
    "Oh! Another applicant came to the abbey the other day. Her name was Isabella. She disappeared yesterday noon. She probably went home. A lot of applicants realise the life isn't for them and leave.",
    "Adventurer...if I can ask...why are you asking these questions?",
    "Murdered? Who would - who would want to do something like that? How could Saradomin let this happen? No - no, I mustn't ask that question. Saradomin has a plan for everything. Sister Anna would have told me off if I'd asked that question. Oh, Sister Anna. You've got to find whoever did this, adventurer. If there's anything I can do, anything, just let me know.",
    "Oh. I'm sorry, I shouldn't have asked. I'll never be a full sister if I keep asking questions like that. Sister Anna always told me I shouldn't ask questions. Is there anything else I can do for you, adventurer?",
    "It's so exciting that he's come to visit us! I saw him smiling at me when I was outside waiting for you. I kind of wish I could go out and dance - I used to like dancing - but I'm in the order now and dancing isn't allowed.",
    "Dance with me, adventurer!",
    "It's alright, I'm just a novice. I haven't taken vows. I'm not not allowed! Anyway, I think I might leave the order. I haven't decided yet. With what's happening, it makes me think about how I want to spend my life, and I love Saradomin, and I love the order, but...I don't think I want to spend my whole life not dancing. Come on, adventurer, dance with me for a while.",
    "Aww, alright. See you later, adventurer.",
    "There's no need to be like that. I'm just dancing.",
    "Dance with me, adventurer!",
    "Alright. I should finish copying my Book of Saradomin. I'll be in the scriptorium if you want to talk to me."
  ],
  "Player": [
    "Yes! I've come to answer your prayers!",
    "What do you mean?",
    "I need to know more before I decide.",
    "Weren't you curious about why the abbess had you wait here?",
    "Has anything happened in the abbey lately?",
    "Yes, I'll help you.",
    "No, I won't help you.",
    "Saradomin didn't send me.",
    "What can I do to help?",
    "Of course.",
    "I don't do discreet. Goodbye.",
    "What were you doing between Vespers and Compline yesterday?",
    "I'd like that.",
    "I'm not interested.",
    "What did you think of Sister Anna?",
    "What other applicant?",
    "Sister Anna was murdered.",
    "I can't tell you, sorry.",
    "What do you know about the troubadour outside?",
    "Goodbye.",
    "What are you rehearsing?",
    "No - could you tell me?",
    "Go on.",
    "Could the Ripper demon come back?",
    "Can your music repel demons?",
    "Back to my other questions...",
    "Back to my other questions...",
    "Where were you between Vespers and Compline yesterday?",
    "What did you think of Sister Anna?",
    "What do you know about the troubadour outside?",
    "Goodbye.",
    "What are you cooking?",
    "Where were you between Vespers and Compline yesterday?",
    "What did you think of Sister Anna?",
    "Sounds like you didn't like her.",
    "Arguing about what?",
    "What do you know about the troubadour outside?",
    "Goodbye.",
    "No, I'm an adventurer...",
    "Where were you between Vespers and compline yesterday?",
    "What did you think of Sister Anna?",
    "What do you know about the troubadour outside?",
    "Goodbye.",
    "Where were you between Vespers and Compline yesterday?",
    "Between Vespers and Compline.",
    "What did you think of Sister Anna?",
    "What do you mean?",
    "What do you know about the troubadour outside?",
    "Not a Minotaur, a troubadour.",
    "Goodbye.",
    "What were you singing about?",
    "You were singing about Sister Anna, weren't you?",
    "What are you doing here at the abbey?",
    "How did you hear about Sister Anna's death?",
    "Where were you between Vespers and Compline yesterday?",
    "Sister Anna was murdered.",
    "I can't tell you, sorry.",
    "Goodbye.",
    "I've finished investigating for now.",
    "I've finished investigating for now.",
    "I want to ask you about something I've found...",
    "Do you recognize this cloth fragment?",
    "Tell me about the applicant who was here yesterday.",
    "Is it true you argued with Sister Anna?",
    "I want to ask you a question...",
    "What were you doing between Vespers and Compline yesterday?",
    "Tell me more about Sister Anna.",
    "Tell me about the troubadour outside.",
    "Goodbye.",
    "I've finished investigating for now.",
    "The Ripper demon, back from the dead",
    "Valerio. He had a history with Sister Anna.",
    "Sister Elena. She disliked Sister Anna.",
    "Isabella, the applicant.",
    "You! You killed her to stop her becoming abbess!",
    "Sister Anna killed herself.",
    "It was Sister Catherina.",
    "It was Sister Cecilia.",
    "It was Sister Debora.",
    "I don't know who did it.",
    "Goodbye.",
    "Don't worry, I'll protect you!",
    "Can you tell me exactly what happened?",
    "Goodbye.",
    "I thought your order forbade dancing.",
    "Alright, let's dance!",
    "I don't dance - you have fun, though.",
    "No. You should go back into the abbey.",
    "Do you think this is the work of a demon?",
    "I need the key to Sister Elena's cell.",
    "Goodbye.",
    "Were you having an affair with Sister Elena?",
    "I found letters from you in Sister Elena's cell.",
    "Elena is dead.",
    "I think you killed Anna and Elena.",
    "I'll let you know.",
    "I've finished investigating for now.",
    "The Ripper demon, back from the dead.",
    "Valerio. He had a history with both victims.",
    "Sister Elena. She killed Sister Anna, and then herself.",
    "Isabella, the applicant.",
    "It was you! You killed them both!",
    "It was Sister Anna.",
    "It was Sister Catherina.",
    "It was Sister Cecilia.",
    "It was Sister Debora.",
    "I don't know who did it.",
    "Did you know Sister Elena was seeing Valerio?",
    "Did you know about the secret passage in the kitchen?",
    "Goodbye.",
    "Abbess Benita asked me to bring you back to the abbey.",
    "The Ripper demon, back from the dead.",
    "Valerio. He had a history with Sister Anna.",
    "Sister Elena. She didn't like Sister Anna.",
    "Isabella, the applicant.",
    "You! You killed her to stop her becoming abbess!",
    "Sister Anna killed herself.",
    "It was Sister Catherina.",
    "It was Sister Cecilia.",
    "I don't know who did it.",
    "We should search every hiding place.",
    "We should abandon the abbey.",
    "We should lay a trap.",
    "A huge pile of money.",
    "The holy relics in the reliquary.",
    "Me. I'll be the bait.",
    "A new victim.",
    "They were all thinking of leaving the abbey.",
    "They were all associated with Valerio.",
    "They had nothing in common.",
    "I'll kill everyone and Saradomin can sort it out!",
    "Let her go!",
    "You won't kill her.",
    "Who are you?",
    "Sister Anna? But you're dead!",
    "So the body I found...",
    "Why did you kill all those people?",
    "You were a dancer too, once.",
    "You were jealous of Elena and Valerio.",
    "You're more like the Ripper than Saint Elspeth!",
    "You're insane.",
    "You're possessed by the demon. Fight it!",
    "Listen - can you hear the singing?",
    "They all loved you. The sisters and Valerio.",
    "That's your funeral. Time for you to die!",
    "Enough talk!",
    "Listen - is that the bell ringing?",
    "Are you alright?",
    "You moved pretty quickly!",
    "What should we do with Sister Anna?",
    "Alright. Take a moment.",
    "No. You die now.",
    "It was Sister Anna.",
    "She murdered the applicant and dressed the body in her robes.",
    "She was taking her religion too far.",
    "She was insane.",
    "I think she was possessed by a demon",
    "It was the Ripper demon."
  ],
  "Abbess Benita": [
    "Adventurer. Thank Saradomin you've come.",
    "And yet I prayed for an adventurer to come, and you came. Saradomin works through us in ways we do not realise.",
    "I've called you here for a sensitive task - one that I would prefer to deal with quietly, without involving the Church authorities or the Al Kharid guard. I hope I can trust you to be discreet.",
    "One of our sisters has been murdered. Murdered quite brutally. I would like you to investigate. The killer may still be in the abbey. I last saw Sister Anna at Vespers yesterday. When she wasn't present at Compline, I went to her cell and found her body. The murder must have taken place between those times.",
    "This is the key to Sister Anna's cell, where I found her body. The cells are in the south-east corner of the abbey. I moved Sister Anna's body to the infirmary, in the south-west of the abbey. I cleaned and wrapped it myself, and I've forbidden the other sisters from seeing it. You should also question the sisters around the abbey, but please do so subtly. I don't want them to know that there has been a murder. This notebook will help you keep track of your investigation.",
    "Come back to me when you've examined the crime scene and the body, and spoken to the sisters.",
    "Please help us, adventurer. You'll need to examine Sister Anna's body, search her cell, and question the sisters in the abbey.",
    "You're doing a good job, but I have a feeling there's some information you haven't found yet.",
    "It's not from any of our robes. It looks like it's from some travelling clothes.",
    "Her name was Isabella. She was here for a few days. Sister Anna and I both interviewed her. She wasn't allowed to mix much with the other sisters. She stayed in the applicant dormitory, which is directly to the west of this room. It's not unusual for a woman to decide this life isn't for her. We don't pass judgement if someone doesn't say goodbye.",
    "I wouldn't say we argued. We disagreed about certain theological issues. We had many invigorating discussions that, I suppose, an eavesdropper could mistake for arguments.",
    "You're not suspecting me, are you? Very well. I suppose it's good that you're thorough. I was here, in my office. You might be surprised how much paperwork is involved in running a religious order.",
    "I've never seen anyone as devoted as Saradomin as Sister Anna was. All the other sisters looked up to her. I don't know much about her life before the abbey. All she told me was that she had led a highly immoral life, and she was glad she'd put it behind her. She was my assistant, she would have been my successor when I eventually retired, and she was also my friend. Please, adventurer, bring her killer to justice.",
    "I don't know what he's doing here. I haven't allowed him into the abbey. The sisters are arranging Sister Anna's funeral. The last thing we need is a secular musician tempting them away from their duties.",
    "Please help us, adventurer. You'll need to examine Sister Anna's body, search her cell, and question the sisters in the abbey.",
    "Whom do you suspect?",
    "Did you hear that? Quick! Follow the sound of that scream!",
    "What's happening here? Ohh...great Saradomin. Sister Elena.",
    "Sister Cecilia, go back to the oratory. Get yourself cleaned up. Adventurer, there's no point in my trying to keep this from the sisters any more. I'll let them know what's happening. Please, adventurer, investigate Sister Elena's murder and then talk to me in my study.",
    "Adventurer, thank Saradomin you're still here. Please tell me you're making some progress.",
    "I know that's what most of the sisters think, but I'm not so sure. In this age, most of Zamorak's servants are ordinary humans.",
    "Adventurer, thank Saradomin you're still here. Please tell me you're making some progress.",
    "Whom do you suspect?",
    "I suppose it's possible. I want to be absolutely sure before we move, though.",
    "I suppose it's possible. I want to be absolutely sure before we move, though.",
    "It's possible that she killed Sister Anna, but I don't see how her wounds could have been self-inflicted.",
    "I suppose it's possible. I want to be absolutely sure before we move, though.",
    "I called you to investigate, adventurer. Why would I have done that if I were the killer?",
    "Sister Anna was the first victim. You had better have a good theory about how that makes sense.",
    "I suppose it's possible. I want to be absolutely sure before we move, though.",
    "I suppose it's possible. I want to be absolutely sure before we move, though.",
    "I suppose it's possible. I want to be absolutely sure before we move, though.",
    "Your reluctance to jump to conclusions is admirable, adventurer. I wouldn't want to accuse someone before we're absolutely sure.",
    "Whomever the killer is, I'm worried that they'll strike again. I want to make sure all the sisters are safe in the abbey. Sister Catherina is outside, dancing. I don't want to pass judgement on her, not now, but I think she'd be safer inside. Could you go and fetch her please?",
    "*Sigh* I thought that was over. A few months ago, Sister Anna brought me a stack of letters she'd found in Sister Elena's room. She was furious. Sister Anna wanted to expel Sister Elena, but I decided to give her a second chance. She appeared contrite. As long as she stopped seeing Valerio, I said she could stay in the abbey. It looks like Sister Anna was right. If Sister Elena were still alive, I suppose I would have to expel her. As it is...the other sisters don't need to know.",
    "A secret passage? That could be how the killer got away after murdering Sister Elena. Thank you, adventurer. I'll have the passage blocked immediately.",
    "What was that sound? Adventurer! Oh, merciful Saradomin - Sister Catherina. Is she-[sic]",
    "This must end. Adventurer, troubadour, please meet me in my office. We need a plan.",
    "The killer is going to strike again unless we catch them.",
    "All the sisters of my order are suspects. The two of you are the only people I have seen in the same place as the killer, so you are the only people I can trust. I will not let this defeat us. We must arrive at a plan. Adventurer - after all you've seen, whom do you now suspect?",
    "Then we must pray for Saradomin to be with us.",
    "None of us is Saint Elspeth, but if Saradomin is with us, we will prevail. How do you propose to fight it, adventurer",
    "We were all there right after Sister Catherina was murdered. We each know the others are innocent - that's why it is the three of us having this discussion. It's clear that we don't know who the killer is. What should we do?",
    "If you're right, she must have faked her own death and gone into hiding. We need a way to find her.",
    "If you're right, she must be hiding somewhere nearby. We need a way to find her.",
    "No. A confrontation would lead to more bloodshed. There must be a better way.",
    "Then we will need to catch the killer without knowing who they are. What can we do?",
    "And the order would end, and the abbey would become a dead shell. The sisters would be too frightened to go back. There must be another way.",
    "That could work - but how would we bait it?",
    "In case you hadn't noticed from this building's state of repair, the order is not exactly rolling in material wealth.",
    "In any case, I don't think the killer is motivated by worldly possessions.",
    "The holy cithara. No, I don't think that would work. The killer hid in the basement when they murdered Sister Elena, but they didn't touch the reliquary.",
    "I appreciate your selflessness, adventurer, but if the killer were interested in you, they would have struck by now.",
    "That could tempt the killer out. But who? I don't think the killer is indiscriminate. What do the victims so far have in common?",
    "No - I've never seen anyone as dedicated to the life as Sister Anna.",
    "I know about your involvement with Sister Elena, and perhaps the killer could have seen Sister Catherina dancing and thought that, but what about Sister Anna? She hadn't left the abbey for years.",
    "She never mentioned you to me. All she would say was that her past life was sinful and she wanted to put it behind her.",
    "Enough. We don't need to go through the sordid details. We've established a connection, but how does it help us?",
    "I can't allow her to be put in danger. There must be another way.",
    "In the basement, during the funeral service. All the sisters will be in the oratory, it will be the perfect time for the killer to strike. It seems we have a plan. Valerio, you and I can handle the announcement. Adventurer, you will need to make they dummy in the basement. Once you're ready, you can hide in the robe cabinet and wait. Whether the killer be demon or mortal, I swear they will not kill again. Saradomin go with all of us.",
    "There must be something. Please, try to think!",
    "If that is a joke, it is in very poor taste. Not all of us treat death as flippantly as adventurers do.",
    "Thank Saradomin it's over, adventurer. Sister Debora told me what you did, but she didn't say who the killer was. She said you should be the one to tell us?",
    "What?",
    "That my most trusted friend could do this, and I had no idea... Thank you for telling the truth, adventurer, but this will shake the faith of everyone in the abbey.",
    "I can't remain as abbess, knowing that this evil could sprout in soil that I have tended. I'll look for a replacement, but I don't know how much longer the order will survive. I cannot offer you much of a reward, adventurer, but please accept a set of the order's robes. They are enchanted: wearing them will allow you to meditate on music in order to grow closer to Saradomin.",
    "Then Saradomin was truly with you, adventurer.",
    "Every death was a tragedy, but we should also take this as a confirmation of our faith. Zamorak would only send an assassin demon against someone of exceptional holiness."
  ],
  "Clue added": [
    "Sister Anna's window was broken from the inside.",
    "Cloth fragment under Sister Anna's bed.",
    "Cloth fragment under a bed in the applicant dormitory.",
    "Facial mutilations.",
    "Blunt wound on the back of the victim's head.",
    "Stab wounds in the victim's chest.",
    "Victim's feet mutilated.",
    "Sister Cecilia's hymn to Saint Elspeth.",
    "An applicant visited the abbey recently but disappeared.",
    "Sister Cecilia told me about the Ripper demon.",
    "Sister Cecilia claims she was in the oratory at the time of the murder.",
    "Sister Elena claims she was in the kitchen at the time of the murder.",
    "Sister Elena claims that food had been stolen from the cellar.",
    "Sister Elena disliked Sister Anna. She claimed that Sister Anna argued with Abbess Benita.",
    "Sister Debora claims she was in the clock tower at the time of the murder.",
    "Abbess Benita was planning to retire, and Sister Anna would have succeeded her as abbess.",
    "Valerio's love song.",
    "Valerio had a history with Sister Anna.",
    "Valerio claims he was in Al Kharid at the time of the murder.",
    "Stab wounds on the second victim's body.",
    "Claw marks on the second victim's arms and hands.",
    "Second victim's face not mutilated.",
    "Scratches on second victim's feet.",
    "Wound on the back of the second victim's head.",
    "Second victim's body moved from the reliquary to near the stairs.",
    "Killer may have hidden in the robe cabinet.",
    "Sister Cecilia claims she saw the Ripper demon.",
    "Love-letters between Sister Elena and Valerio.",
    "Secret passage from the kitchen to outside the abbey.",
    "Valerio confirmed he was seeing Sister Elena."
  ],
  "Sister Cecilia": [
    "Look at me...look at me... Okay, that's good. Remember to look at me so you can keep in time. Oh! I'm sorry, I didn't, er...Ladies, keep rehearsing while I talk to this pilgrim.",
    "It's a hymn to Saint Elspeth. I wrote the music, but the words are traditional. Do you know the story of Saint Elspeth and the Ripper?",
    "Saint Elspeth was a holy warrior who lived during the God Wars. She sang and played the cithara, and her music was so holy that no demon could bear to hear it.",
    "Oh - it's an ancient stringed instrument. It's like a lyre. The lyre was a folk instrument, whereas the cithara was a professional instrument. Well, anyway, that's not important...",
    "The Ripper was an assassin demon. It would strike without warning and leave its victims horribly mutilated. Stab them through the heart with terrible claws, tear off their faces... Zamorak sent the Ripper to attack a village where Saint Elspeth was staying. It couldn't approach while she was singing, but it waited on the edge of the village. She sang for days, but eventually she was too weak to go on. She went out of the village to face the demon alone - she thought it might just kill her and spare the villagers. She fought the demon and it mortally wounded her; but, as she was dying, Saradomin granted her the strength to sing one piercing note so perfect that it struck the demon dead. Her remains lay unburied until the present age. Then, seventy years ago, a group of holy women found them and built this abbey in her memory. That's why music is such and important part of our worship.",
    "I don't know. They say some demons can return after being killed...but the God Wars were thousands of years ago.",
    "Well...I'd like to think so, but I don't think we're as holy as Saint Elspeth. I hope we never have to find out!",
    "I stayed in here after Vespers, to rehearse the choir.",
    "She had a powerful voice, and a rock-solid sense of rhythm. The whole congregation could listen to her to keep in time... Oh...I'm sorry, she's dead and all I can think of is how much the choir needed her. I'm too single-minded sometimes... I think she kept us in time in more ways than one, though. She was our moral centre, an example of holiness. We all miss her terribly.",
    "I'm aware he's there. I think the abbess was right to forbid him from coming inside. You've got to understand, the Citharede order considers music to be holy. It should be used for worship and contemplation, not for dancing. Dancing is so often connected with...other immorality. As interesting as it would be to hear a different style of music, I should stay away.",
    "You've got to protect us! The demon is back!",
    "I saw it, abbess! It was the demon! It was the Ripper!",
    "We're all going to die. It's going to kill us all. There's no escape.",
    "There's nothing you can do, adventurer. You should leave - maybe it'll spare you. Everyone in the abbey is dead already.",
    "I...I heard the scream, I heard Sister Elena screaming...so I went down the stairs to see, and...And[sic] it was there. The Ripper. Just like in the stories: it was wrapped in rags, and it had its huge claws, and...It[sic] was bending over Sister Elena. It was cutting her feet with its claws. Why would it do that? Then it saw me. It turned its head - it looked at me! I couldn't see its face, thank Saradomin. If I'd seen its face I think I might have died of fright. It pushed past me - it splashed Sister Elena's blood on my robes - and then it ran up the stairs and away. We can't let it defeat us. Almighty Saradomin, give me the strength to...to not be afraid. ...[sic]",
    "Alright, ladies. The abbess told you what happened. This funeral service will be for two of us now. We're going to trust Saradomin, and we're not going to be afraid. We're going to sing like Saint Elspeth, and the demon isn't going to be able to hurt us. Okay, from the top. Look at me...",
    "We're going to sing a funeral service worthy of our friends, and even a demon isn't going to stop us."
  ],
  "Sister Elena": [
    "What is it?",
    "Cabbage soup. It's amazing what you can do with cabbages if they're all you have to cook with. Do you have an important question adventurer? I'm quite busy.",
    "I was here, in the kitchen. Why, where should I have been? I went down to the cellar to get some supplies at one point, but the rest of the time I was here. Actually, I noticed something while I was down there. I think someone's been stealing food from the cellar. I bet it was Catherina. Novices have to be taught discipline. I've seen her sneaking an extra cup of wine at meal times. She's the one you should be talking to.",
    "She's with Saradomin now. It doesn't matter what I thought of her, and it does no good to speak ill of the dead.",
    "I didn't say that. But she did cause conflict. Most of the sisters didn't see it, but I did. She was always arguing with the abbess.",
    "Sister Anna thought Sister Benita was too lenient with the order's rules. Anna would have enforced silence outside of services. She'd have stopped Sister Cecilia composing - prescribed melodies only. Maybe it's Saradomin's will that Sister Anna never got to become abbess. I don't know. It's not my place to say.",
    "I don't know anything about the troubadour! I didn't even know he was there. What troubadour? Secular music is forbidden, so if there is a troubadour outside then Abbess Benita will send him away. I don't have time to talk about troubadours. Is there anything else you need?"
  ],
  "Feet": [
    "Sister Catherina, is that you?",
    "It's no good, Catherina, I just can't hear you. I'll be out of here in a minute, just need to get the, uh... Could you do me a favor, Catherina? The clock is twenty minutes fast right now. Could you set it to the right time?",
    "Ah yes, that's it. Ah, and you've set the clock to the hour so any moment now it should...",
    "Right, I'm done."
  ],
  "Sister Debora": [
    "Oh, I'm terribly sorry. I thought you were Sister Catherina. She's normally the one who comes up here. What can I do for you?",
    "Eh? Between what and what?",
    "Oh. I came back up here, tried to finish this set of repairs. I was a clock-maker before I joined the abbey. Now I'm the only one who knows how to repair the abbey clock.",
    "A part breaks that you'd expected to hold for years...but that doesn't stop the whole mechanism, it just sets it in a different direction. Saradomin is a better clock-maker than us.",
    "Sister Benita was planning to retire as abbess next year. Everyone expected Sister Anna to become the new abbess. But it seems that wasn't Saradomin's plan, so he's taken her away. The clock runs, just not as we'd expected.",
    "What? There's a Minotaur outside? Have we closed the gate?",
    "Oh, yes, Sister Catherina mentioned something about that. She seemed very excited. I'm too busy with the clock to worry about visitors. It's not like I could hear his music anyway. I don't know if you'd noticed, but I'm a bit deaf! It's spending all my time close to the bell when it goes off that did that.",
    "Poor Sister Elena. May Saradomin's justice find whoever did this, adventurer.",
    "Please help us, adventurer. But if you are destined to fail...may Saradomin help me accept my fate.",
    "Adventurer! Don't!",
    "It's Sister Anna! She's gone mad!",
    "She killed the applicant and dressed her in her robes!",
    "Good thinking, adventurer.",
    "I'm just shaken. I don't normally get that much excitement.",
    "Perhaps Saradomin gave me strength.",
    "As a good Saradominist sister, I cannot take a life. I'll see you downstairs adventurer."
  ],
  "Valerio": [
    "Greetings, traveller!",
    "Ah...it's a song about someone I knew, a long time ago.",
    "I was. I knew here before she joined the abbey. I tried to talk her out of coming here, but when she made her mind up about something, there was nothing that could stop her.",
    "One of the sisters here, Sister Anna, she passed away recently. I knew her before she joined the abbey, so I've come to pay my respects.",
    "I have my ear to the ground. Even a religious order isn't completely cut off from the world.",
    "All yesterday evening I was in Al Kharid. I didn't travel up here until this morning.",
    "Why are you asking all this, anyway? What's going on here?",
    "Anna - murdered? But why? Who would want to kill Anna? Adventurer, if there's anything I can do to help you catch whoever did this, please, let me know.",
    "To Zamorak with you! The abbess can order her sisters not to be curious, but not me! Anna was my friend, and I have a right to know what's happening. This conversation is over.",
    "Greetings, traveller.",
    "I don't know what you're talking about. Why are you asking this?",
    "I didn't write any letters. They must be from someone else.",
    "Elena is dead? Oh, Elena. She wasn't happy here, you know. She could have been so much more, if she'd had the courage to leave...I met her when she came down to Al Kharid to buy supplies. We started writing to one another, hiding letters with boxes of food. I came up to see her last night. There was a hole in the kitchen wall that she used to smuggle me in. That's how I learned that Anna had died - Elena told me. I wanted to publicly pay my respects, so I snuck back to Al Kharid and came here with my band. Adventurer...you don't think Elena could have been killed because of me? Both the victims were people I knew - could someone have found the letters... If there's anything I can do to help bring this killer to justice, let me know.",
    "I loved Elena! How dare you accuse me? Come back when you have some kind of evidence!",
    "It's no good - she's dead. It pierced her heart. Good night, sweet thing. You could have been a dancer.",
    "I am afraid so.",
    "I'm not a member of your order, Abbess. I don't know why you would trust me here.",
    "A demon? Then what hope do we have?",
    "What are we waiting for? Come on, adventurer, let's get her!",
    "Did you see how the killer ran? They would move from hiding place to hiding place as we searched.",
    "That's a good idea. We could take the sisters to Al Kharid, where the guards can protect us.",
    "Don't look at me. I usually sing for my supper.",
    "You mean the ancient instrument, the lyre?",
    "Elena was thinking of leaving, and Catherina might have been, but I don't think Anna would have ever left.",
    "Ah... you do not know? I knew Anna, many years ago. She was a dancing girl, part of the troupe that I joined when I was first a troubadour. Back then she was so full of life. Passionate. Everything she did, she threw her whole body and soul into it. Then when we met that travelling preacher, and she caught religion, she threw her whole body and soul into that as well. We wrote to one another, at first...",
    "Yes, that was the impression I got from her last letters. When I met Elena in Al Kharid and started seeing her, we had to keep our affair secret, so I couldn't see Anna. I wanted to - a part of me was always hoping she'd discover us...",
    "I have a dancing girl travelling with me. If we were to announce that she was joining the abbey...",
    "Ah - she will be in no danger! She will be hiding in my camp. We can make a dummy, dress it in your robes, and our adventurer can hide nearby and wait. But I'm not sure where...",
    "Who was it? Who killed Anna and the others?",
    "No, it can't be!",
    "But why?"
  ],
  "Clues left to find": [
    "[number]."
  ],
  "The Killer": [
    "Stay back! Make any move and I'll kill her!",
    "Let me walk out of the abbey to safety, and then I'll release her.",
    "I don't want to kill her - but you'll force me to if you come closer. Her death will be on your hands!",
    "I am the spirit of Saint Elspeth! Saradomin's voice of justice!",
    "Sister Anna is dead! I am the spirit of Saint Elspeth!",
    "Was that unrepentant dancing-girl who thought she could join the abbey. I killed her and dressed her in my robes.",
    "They were all...dancers! They weren't worthy to be in this abbey. Saint Elspeth commanded me to remove them!",
    "I was repentant! That's the difference! I spent my whole life in penitence for the sins of my youth! And now Abbess Benita lets any dancing-girl join the abbey - lets them go outside and dance when a, a troubadour arrives - turns a blind eye to their affairs...",
    "He means nothing to me. That part of my life is gone.",
    "Spawn of Zamorak! Demons and saints look the same to those whose eyes are blinded by evil!",
    "My mind has never been so clear! I burn with the holy fire of Saradomin!",
    "No! It is Saint Elspeth! Get away from me, tempter of Zamorak!",
    "I...can hear it. The choir...",
    "They all...loved me... No! Worldly attachments...worldly loves...must all be burned away. I am the spirit of Saint Elspeth!",
    "Stay back! Make any move and I'll kill her!",
    "Stay back! Many any more and I'll kill her!"
  ],
  "Sister Anna": [
    "Sister Debora...she did nothing wrong. I have not been the voice of Saint Elspeth. I have been the hand of the Ripper. Please, adventurer, if you have any mercy - give me a moment to pray for forgiveness before I die.",
    "Then give me a moment to pray, before you take me from here.... Almighty Saradomin, creator and ruler of the world, have mercy upon me: for I have sinned against thee with my thoughts, with my voice, and with my hands. As the voice of Saint Elspeth struck dead the demon, may it strike dead the evil in my heart, and may the harmony of the saints drown out the discord of my sin. ...",
    "I hear it! The heavenly choir! I am forgiven! Flights of Icyene, lift me up! Saradomin, guide my soul to light!"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:One_Piercing_Note?oldid=36220943’"
  ]
}