{
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "Dialogue with Ali(/Badir?) without a snake charm and ring of charosYou can discuss this issue on the talk page or edit this page to improve it."
  ],
  "Player": [
    "Hello again.",
    "Who's that then?",
    "Oh really? Where would I find them?",
    "I wouldn't have thought you would have much business down in the sewers?",
    "Thank you Gertrude, I'll be sure to have a look for them.",
    "I'm fine, thanks.",
    "Do you have any more kittens?",
    "Not yet. Can you remind me where to find those two ladies who know a lot about rat catching?",
    "I wouldn't have thought you would have much business down in the sewers?",
    "Thank you Gertrude, I'll be sure to have a look for them.",
    "Oh hello. I was told by a friend that you know a lot about rat catching, I was wondering if you'd teach me a little.",
    "Well I am a great cat owner myself and I'd like to meet other people who are also interested in the same things, and who can perhaps teach me and my cat a trick or two about ratcatching.",
    "How will you know that I've completed your task and what's a fuzzy?",
    "Um... alright I guess.",
    "~*Aside* I can't believe I'm going to do this. But what choice do I have?",
    "Are you alright cat?",
    "Er... Ahemm... Excuse me?",
    "Good job puss, we really showed those rats what for.",
    "Oh never mind, it's just a turn of phrase.",
    "Suppose so.",
    "I got de ratsies for you's.",
    "Hang on a second. I thought you were thick.",
    "Ok you've had your laugh, now will you please show me something about ratcatching?",
    "What? So we've just caught all these rats for nothing?",
    "What can I use it for.",
    "Um... thanks I guess.",
    "No!",
    "Hello.",
    "You have?",
    "An odd couple. Anyway, they said that you could teach me a thing or two about cats.",
    "Maybe I could help you out with something then?",
    "Well, have you anything for me to do, or will that come at a later point?",
    "~*Aside* Gosh those teeth are very white, and... sharp. Well I know where he gets his name from.~",
    "A what?",
    "So he wants me to go to his place and kill some rats? I can sort that – no probs.",
    "Oh, I see. So I have to do this covertly?",
    "Are you going to cast an invisible spell on me? That should make it easy.",
    "Wow. That's some spell. I'd say that comes in handy.",
    "Where did you learn that spell?",
    "...the ticket?",
    "Good job puss, I think that just about wraps things up here.",
    "Really? Why's that?",
    "A what?",
    "I knew you had a dark side.",
    "Well, we had better get out of here and let's do it quietly.",
    "I am?",
    "You'll teach me all about cats now?",
    "You didn't? Well then, what did you promise?",
    "Right. What if I want to know about grown and overgrown cats?",
    "Where would I find him?",
    "Tell me about these pits and where I can find them.",
    "What goes on in these pits then?",
    "~Aside~ I wonder if he can smell around corners with that nose.",
    "Uh, sorry, yeah Jimmy Dazzler told me that you're 'the ticket' if I wanted to learn about grown cats.",
    "You quickly avert your gaze from his face.",
    "~With determination not to show any signs of embarrassment, you look Jack in the eyes.~",
    "No. Should I?",
    "So will you help me? Or do I have to do some task for you first to prove that I'm worthy, or in payment?",
    "What? Oh come on.",
    "Look if you need help catching rats I can lend you a hand, I got some good hands on experience from Jimmy Dazzler, Phingspet and Grimesquit.",
    "~Aside~ What? Does this guy have any taste? Or sense of smell, for that matter?",
    "Uhh... yeah, lovely girls. How about I take some of your workload off you? Then you would have some time to teach me.",
    "So will any type of poison do?",
    "How would I do that?",
    "What are these ingredients then?",
    "Actually I happen to be carrying all that stuff at the moment.",
    "Ok, can do.",
    "Well that's one less rat hole. I had better finish the job off quick before they start to reproduce again.",
    "Hmm, that should do the trick. Those rats should soon die off.",
    "I've completed that task you set me. Now will you teach me?",
    "Oh come on, I've gone and done a job for you, the least you could do is say thanks or something.",
    "Oh!",
    "That's too bad. Good bye",
    "Can I help?",
    "Oh no. I feel somewhat responsible for this. Can I help in any way?",
    "I need to talk to you about cats.",
    "Would you know anything about poisons then?",
    "How about rat poisons and anti-poisons for cats.",
    "Ok, Hooknosed Jack's cat, Pox ate some rats which were poisoned with a Kwuarm and red spider egg based concoction.",
    "Great! What?",
    "Yes, I've got it right here.",
    "No worries there, I'd be sorry to see any cat come to harm.",
    "I did a good job. Didn't I?",
    "Hang on, I thought that all I had to was poison a few rat holes and that was it?",
    "Hang on, that wasn't part of the deal, was it?",
    "Did you now?",
    "~You try to convey a sense of skepticism in your voice.~",
    "Go get him kitty.",
    "Come here kitty.",
    "They're not wrong. I must admit I was getting a little worried for my own cat's safety too.",
    "Yes I had to use it to kill the rat. He was too far out of the way for me to get at it. So I sent in the fuzzy.",
    "That's great! So you know things about grown and overgrown cats then?",
    "Hi! What are you doing?",
    "No not really.",
    "*Aside* Ewww... what a disgusting little dwarf. And whoa look at the size of those ears.",
    "*Aside* Ew!",
    "I could help you.",
    "I could help you. I'm young...ish and have a fairly good set of lungs in me.",
    "What's up with your lungs anyway?",
    "Oh right, anyway where were we?",
    "Of course I did. Now you want to get these rats in there. How should I go about doing that?",
    "*Aside* No way! No way am I touching that. That is soooo disgusting.",
    "Hey Joe would you mind if I made my own? I might break yours.",
    "*Aside* Aghh! How am I going to get out of this one?",
    "You know, you'd probably catch some of my germs. Cross species diseases are incredibly dangerous. I heard of this one village of gnomes who...",
    "*Aside* Sweet.",
    "So how do I make my own rat smoking device?",
    "Great. I'll get to it.",
    "That's too bad. Good luck with that.",
    "This isn't working the way I thought it would.",
    "What's that cat? Can't you see I'm adventuring?",
    "I am? Well then smarty pants what should I be doing?",
    "I know that.",
    "Great idea puss. I'll get right to it.",
    "Hey cat, you know the drill, get going.",
    "What?",
    "Hey cat, great job. What an ambush!",
    "...?",
    "You know you really scare me sometimes.",
    "I got them.",
    "What, what's going on? Do you have an amulet of catspeak as well?",
    "But you were responding in cat.",
    "Maybe you could show me how to do that?",
    "Great stuff. Let's go.",
    "They have ratpits in Port Sarim?",
    "Wily cats?",
    "So where are the Keldagrim pits then?",
    "Ok, where would I find her?",
    "Hello, the face said that you were looking to talk with me.",
    "Well I can't take all the credit, I've had more than a little help from my cat.",
    "Why is that?",
    "Smokin' Joe said that you know lots about training wily cats.",
    "So you will show me how to turn my cat into a wily cat?",
    "*Sighs.*",
    "Well experience has taught me to expect as much, what must I do?",
    "What?",
    "Are you serious?",
    "But why? Why one stroke, why not a slow eradication?",
    "But... I am touched that you want to write an epic poem about me, but why can't you write the poem about seagulls or daffodils or something?",
    "Sorry I don't follow.",
    "So why do you need me to repeat your most heroic of feats?",
    "Umm... ok, I suppose. So can you tell me how you went about achieving this?",
    "*Sigh* Why does it always have to be like this?",
    "What do I have to do again?",
    "I'd better get to it then.",
    "Hello.",
    "*Aside* I wonder what her problem is?",
    "Yes.",
    "That's an interesting looking cat.",
    "I love that story. My favourite part is how she managed to get rid of all the rats. Would you tell it to me?",
    "*Aside* I'll get the story out of her, a little sweet talking should do the trick.",
    "Oh please tell me, I'm sure you'd tell the story wonderfully, you have such a pretty ...",
    "...voice.",
    "*Aside* Dang!",
    "... which compliments your radiant aura.",
    "*Aside* That should do the trick.",
    "*Aside* Perhaps I should pay this snake charmer a visit.",
    "I think I know how to carry out the task.",
    "Oh no, she didn't say a word.",
    "Really she didn't.",
    "Wow, a snake charmer. Can I have a go? Can I have a go? Please?",
    "I want to talk to you about animal charming.",
    "No way.",
    "I've already given you some money. Listen I would like to ask you about someone.",
    "Felkrash the bard.",
    "What's wrong with killing vermin? They're dangerous carriers of disease.",
    "So there's nothing I could do to get you teach me how to charm rats?",
    "What if I offered you a drink?",
    "But would you teach me?",
    "So what's your favourite drink then?",
    "I don't have any beer on me.",
    "So will you teach me now?",
    "But,... but...",
    "What if I offered you some food?",
    "What if I offered you some money?",
    "How much are we talking about?",
    "I don't have that much money.",
    "What if I offered you 50 coins?",
    "Forget about it. I don't care. You know you've blown it.",
    "You'll what?",
    "No!",
    "I mean I'll give you no more than 100 coins.",
    "What if I said I'd kill you?",
    "Hello.",
    "*Aside* I wonder what her problem is?",
    "Thank you, and don't worry, I won't tell Felkrash that you helped me.",
    "Ha! I did it. Did you see me?",
    "Can you show me how to train my cat into a wily cat?"
  ],
  "Gertrude": [
    "Hello, my dear. How are things?",
    "Oh yes, before I forget I think there are some people you should meet.",
    "Well there are these two ladies who know a lot about rat catching.",
    "They generally are to be found in the sewers underneath Varrock, a horrible place, I should know.",
    "I've had to drag Shilop and Wilough out of there more times than I care for, the little rascals.",
    "I don't know which is harder raising kids or cats.",
    "Well, my dear. Is there anything else I can do for you?",
    "Good good, See you again.",
    "Did you ever get to talk to those people I told you about?",
    "They generally are to be found in the sewers underneath Varrock, a horrible place, I should know.",
    "I've had to drag Shilop and Wilough out of there more times than I care for, the little rascals.",
    "I don't know which is harder raising kids or cats."
  ],
  "Grimesquit": [
    "O 'ello what's we gots 'ere?",
    "We know lots about rat splattering.",
    "Wa?",
    "Ha! Everyone knowses only dogsies does trickses.",
    "Set's em a task and we'll sees.",
    "Didn't I tell you they were a bit thick?",
    "Yeah, like what's 'I got de ratsies' mean.",
    "That was funny. We should try that again on the next adventurer who comes along. They're so gullible.",
    "Believe anything you say.",
    "No not much at all, no not much at all.",
    "Ha! Ha!",
    "You should talk to Jimmy Dazzler in Ardougne about the rat pits. He could show your fuzzy a ting o' two.",
    "Ha! Ha!"
  ],
  "Phingspet": [
    "Wot's you want?",
    "Ya we knows. But why should we tells you?",
    "D'you 'ear 'em?",
    "I doesn't tinks dey knows anting 'bout catchin ratsies.",
    "If yous catches 8 rats with y'er fuzzy we'll tells yous.",
    "Y'er cat stupid and we'll smells 'em.",
    "I's bored wit dis chaterboxing, let's splat some more ratsies.",
    "What's up with them?",
    "What a slack jawed mindless creature.",
    "Ha! We were only playing with you.",
    "There's not much we can teach you here.",
    "Here have's a rat pole.",
    "You can stick the ratsies your fuzzy catches onto it.",
    "Will we tell him about Jimmy and the rat pits?",
    "You gots all de dead ratsies with you.",
    "Go on, go on, tell them about Jimmy, go on."
  ],
  "Phingpet": [
    "Dey tinks fuzzys does trickses."
  ],
  "Cat": [
    "I'll live.",
    "What for?",
    "Speaking of turning faces, shouldn't we get back to those ugly sisters?",
    "Yeah 'suppose so, this covert rat killing just comes so naturally.",
    "I'm a cold blooded, claw toting, hitkitty.",
    "A callous cat.",
    "I have many darksides.",
    "Hisss!",
    "Hey Player, hey talk to me.",
    "Look I can't let you keep doing this, you're doing it all wrong.",
    "What we have here is a two cat job.",
    "Every time you try to smoke those rats out they run out of the hole, the only problem is the smoke clears fast enough for them to run back in before you can get over to them.",
    "Well then why don't you let me help out. Tell me when you're going to start the fire and I'll race over and get the rats, while you're smoking them out.",
    "Exterminate! Exterminate!",
    "Sorry, I got a little carried away.",
    "Hu-ha!",
    "You got them? I think I may have had something to do with it.",
    "Well of course you'd hardly expect that human to do a ratcatchers job."
  ],
  "Grimequit": [
    "I doesn' knows. I doesn' know."
  ],
  "Phnigspet": [
    "Ha! Ha, ha, ...ha .......ha."
  ],
  "Jimmy Dazzler": [
    "Ah, Player, I've been expecting you.",
    "I have. Those repulsive sisters from the Varrock sewers sent word.",
    "~At the thought of Phingspet and Grimesquit he shudders.~",
    "I could, but I would need a motivation. I didn't get rich enough to afford clothes like these by giving out help freely to every adventurer who came my way.",
    "Ah, that's music to my ears.",
    "No, no. I've just the ticket right here.",
    "~He gives you a dazzling smile, his pearly whites both pearly and white.~",
    "Yes, this is just the ticket. Here...",
    "Take a good and long look at this map.",
    "Now, a wealthy client of mine, a merchant of high repute, is having a soirée.",
    "A party. ~He gives you a look of disdain.~ Now please don't interrupt me any further. He has a problem, a small furry one.",
    "No, no, no. It's not that simple. He can't afford to have you seen on his premises. If a vermin catcher were to be seen in his manor, think of the damage it would do to his reputation.",
    "That's it, that's the very ticket.",
    "~Jimmy dazzles you with another one of his trademark smiles.~",
    "Now I'm going to cast a spell on you that will allow you to carry out this task with some element of safety.",
    "Not quite. ~You receive an uncertain smile. You can see that his confidence in you isn't limitless.~",
    "The spell will wipe the last few seconds of memory from anyone who spots you, and also teleport you a small distance away.",
    "~Jimmy gives you a knowing smile.~",
    "It's the ticket, my friend, it's the ticket.",
    "If I told everyone all my secrets, would I be as well off as I am now?",
    "Well let's get on with things. Carry out this simple task and I'll aid you.",
    "Now scram, get going. And remember: the map's your ticket.",
    "Oh yes, one more thing. Use a cat to dispose of the rats. Sword-play is really too noisy. Using your cat is...",
    "Ah, Player, aren't you just the ticket?",
    "Congratulations on a job well done.",
    "Ahh, now, that's something I didn't say.",
    "~Jimmy flashes you an unconvincing smile.~",
    "Well I can show you into the rat pits of Ardougne; it's a great place for training kittens. Teach them young, you know.",
    "Ah now. When it comes to grown cats, Hooknosed Jack is your ticket.",
    "He should be in the roughest area of Varrock, knowing him. He likes a good scrap does Jack.",
    "I'll tell him to look out for you.",
    "One question at a time. The pits lie below this very pub.",
    "See that ladder there? Well, that's the ticket.",
    "Here take this, you might find it useful."
  ],
  "Hooknosed Jack": [
    "Ah, it's Player, isn't it? Jimmy D said you'd be along. So what can I do for you?",
    "Do you have a problem with my face?",
    "Uh... I guess not. It's just that most... ah, forget it.",
    "Nah. I'm too busy.",
    "No really, I'm just too busy at the moment. I've got three jobs going at the minute and I just don't have any time for helping the likes of you out.",
    "Ah you've met the sisters. Lovely girls aren't they?",
    "I suppose there is this job I have just south of here. I need to get someone to clear out a warehouse of rats. It should be a simple job of poisoning a few rat holes. Nothing too complicated.",
    "No, you need rat poison to kill rats. You can make it yourself. I'm sure I've seen some lying around.",
    "Argh! Don't worry your little head about it, you're obviously incapable. Just bring me the base ingredients.",
    "Get me some Kwuarm and some red spider eggs. Oh yeah, an empty vial would be good too.",
    "To poison the holes you'll need some bait. Use some cheese for this.",
    "Pour some of the poison on the cheese and then place some of the poisoned cheese in each of the rat holes.",
    "Report back to me when you're done. I want to get this job wrapped as soon as possible.",
    "Give me a sec.",
    "I'm upset at the moment. I just found my cat Pox, and the poor thing's half dead.",
    "They found Pox at the warehouse you were working at. He must have eaten some of the rats you poisoned.",
    "There is an apothecary here in town; seek his help. Tell him that the poison was made from red spider eggs and kwuarm, and he should know what to do.",
    "Go quickly!",
    "Have you got the antipoison?",
    "Thank you, Player, thank you so much!",
    "I have to have a word with you about the job you did in the warehouse.",
    "You didn't quite finish that job I set you.",
    "Well one rat survived, the biggest and nastiest one of the lot.",
    "I'm afraid it was. You said you'd clear the warehouse of rats, I do remember.",
    "I did. Now get to it!",
    "My sources tell me that you were successful in killing the rat?",
    "Your own cat?",
    "Ha, ha! There's hope for you yet. Perhaps I can show you a thing or two in the pits. See that manhole o'er there? Climb down it to enter the Varrock pits.",
    "I'm no expert on the larger cats. If you want to train overgrown cats seek out Smokin' Joe in Keldagrim, the Dwarven city."
  ],
  "Apothecary": [
    "I am the Apothecary. I brew potions. Do you need anything specific?",
    "As I said I'm the apothecary not the vet.",
    "I'm quite the expert, excuse me.",
    "I think I can help you with that. Try me.",
    "Not Pox, what a personality. I remember... Hang on no, I have no time for dilly dallying. I know just the thing that will sort Pox out.",
    "Well cats are simple enough to treat. Just bring me a bucket of milk, some Ground Unicorn Horn and a leaf of marrentill.",
    "Quick, get this to Jack. If I know the man at all, he wouldn't have sent someone else to do this if his cat wasn't seriously ill."
  ],
  "King rat": [
    "Pfssst!"
  ],
  "Smokin' Joe": [
    "Isn't it obvious? *Wheezes*",
    "*Joe splutters a few times, but finally clears his throat.",
    "Bluaaghhaha! Sorry about that.",
    "*Wipes some phlegm from the corner of his mouth.*",
    "I'm trying to smoke these pesky rats out. Bluaaghhaha.",
    "*Joe breaks into another bout of coughing.*",
    "*After two attempts, Joe gets his breath back and eventually manages to speak.*",
    "Anyway I'm trying to get rid of these rats, but my lungs just aren't up for it like they used to be. Bluaaghhaha.",
    "That's ...",
    "Ahhh that's better. Ooohhh boy, *Joe takes a deep breath.*",
    "Ahh sure wasn't it years of blowing smoke into rat holes that has done this to me? *Wheeze* That and probably the pipe I used to smoke. *Wheeze*",
    "*Gulp* You offered to help me.",
    "That's sim... bluaaghhaha... simple. Take this pot light the contents and blow the smoke into the hole.",
    "*The dwarf looks sceptically at you.*",
    "You're right. *Wheeze* With my lungs in their current state I just can't take chances.",
    "Ahheem, ahh ahh, *Splutters*",
    "Just take a simple pot, stick some garden weeds in it. Light it and then use it on a rat hole.",
    "Did you now?",
    "No, I don't need such trinkets. See these ears? I can tune them to any language I like.",
    "Ya well that's not too difficult, it's just really a case of trial and error and being a good mimic. Tuning your ears is the hardest part.",
    "I just don't think you've got the ears for it.",
    "Well good show. Good *Wheeze* Bluaaghhaha. *Wheeze* good show.",
    "I'd better show you our rat pits here in Keldagrim.",
    "They're quite nice, but just don't compare with what they have in Port Sarim.",
    "Why of course! Where else would us ratcatchers train our wily cats?",
    "Look for 'The Face' in Port Sarim. She'll show you.",
    "Try the stairs into the basement of the 'Laughing Miner'. A grand watering hole it is."
  ],
  "The Face": [
    "Ah you, peasant. Felkrash wishes to speak with you.",
    "You should find her nearby.",
    "Oh it's you again. *She glances at you with barely disguised disdain.*",
    "Have you spoken with Felkrash yet?",
    "Ah yes Belle. What a cat. Felkrash trained her for me shortly after she single handedly charmed all the rats of the Port and drowned them.",
    "I don't know, I really shouldn't.",
    "Yes...?",
    "*The face's face perks up at the mention of the word pretty.*",
    "Oh. *And just as quickly turns sour again.*",
    "Oh you're too generous.",
    "Do you know something, I think I'll tell you, mind you, don't tell Felkrash about this, she'd only get sore with me.",
    "She's the story teller not me.",
    "One day ...",
    "And that is how she drowned the rats.",
    "Oh it's you again. *She glances at you with barely disguised disdain.*",
    "I must congratulate you on your performance, I have only ever seen one other display of musicality to match, as you should know."
  ],
  "Felkrash": [
    "Indeed, word has gotten to me from our other ratcatcher chapters that you are quite a talent.",
    "Modesty, a trait seldom displayed by adventurers these days.",
    "Too many more like you and I'll lose half of my business.",
    "Epic poems of bravery and heroics aren't usually commissioned by the shy and retiring.",
    "Indeed I do. It's for this very reason that I requested to talk to you.",
    "No, not yet.",
    "No I need you to carry out just one task for me.",
    "Nothing too difficult, just rid the port of every single rat, with just one action.",
    "Deadly.",
    "I want to write a new poem.",
    "Well seagulls rarely make good central characters. They're a bit too ... uhm... flighty. Besides the poem is about me not you.",
    "I myself carried out the very same feat once upon a time.",
    "It's all about objectivity and integrity. I need to be utterly divorced from the process.",
    "No. Therein lies the challenge.",
    "You haven't completed the task yet.",
    "Rid the port of all its rats with one action.",
    "Has the face been telling tall tales again?",
    "Yes I saw that, now what can I do for you? Don't keep me overly long, I'm trying to complete my poem.",
    "I can only train overgrown cats into wilycats."
  ],
  "Badir the Snake Charmer": [
    "Well what's holding you back then? You have your own snake charming flute.",
    "That depends.",
    "~You can literally see the glint of money light up across his eyes.",
    "No way what?",
    "~The glint begins to wane a little.",
    "Go on. Who?",
    "Pah!",
    "A look of disgust crosses his face.",
    "I taught her all she knows about animal charming, and then she uses the knowledge to kill.",
    "Music should never be used to kill. I remember when we used to sing about love, not war nor killing.",
    "Oh things were a lot better in those days.",
    "Not a thing.",
    "I'd say thank you very much and take it.",
    "That might depend on how the drink tasted.",
    "Beer, just plain old beer.",
    "Well then you'll never know.",
    "*Smacks lips together* Ohhh, that really hit the spot.",
    "No.",
    "I'd say I wasn't hungry.",
    "A glint of gold temporarily flashes across the charmer's eyes.",
    "Now we're talking.",
    "I'll teach you for [X] coins.",
    "You're a resourceful looking adventurer I'm sure you'll work out something.",
    "You see the snake charmer's resolve visibly crumble.",
    "Ok you have a deal.",
    "You've still got that flute I gave you before, I think.",
    "Read the music, and copy what it says when you play the flute. You should attract flies to you like flies to a bucket of dung.",
    "What? I'm offering something invaluable and you'll quibble over a couple of coins?",
    "I'll do it for half the price.",
    "I'll do it for quarter the price.",
    "I'll....",
    "An eighth?",
    "What do you mean by no?",
    "Ummm... alright so.",
    "It's not all that difficult, here take these.",
    "Read the music, and copy what it says when you play the flute. You should attract flies to you like flies to a bucket of dung.",
    "Hah! You'd never get away with it. I've paid up all my protection money this week to the Menaphite and bandit thugs. You'd be doing well to leave this town alive."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Rat_Catchers?oldid=36237702’"
  ]
}