{
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "Missing various miscellaneous dialogue options (e.g. Carpenter's willow log suggestions)You can discuss this issue on the talk page or edit this page to improve it."
  ],
  "Player": [
    "Good day, wanderer.",
    "I'm terribly sorry, come here kitty.",
    "I'm in need of supplies. Is there a town nearby?",
    "I'd like to ask you about something else.",
    "I'm busy, I must be going now.",
    "What are you doing out in the desert?",
    "The usual, you know, seeking fame, fortune and adventure.",
    "Who are you?",
    "How sad, I hope no one will ever forget mine. The bards of Gielinor will learn of my epic adventures and write songs to recount my great deeds.",
    "How do you survive out here in the desert?",
    "Why? What's your problem with it?",
    "What secret passage?",
    "Ok now where is it?",
    "Where does it lead to?",
    "Tell me how I may enter?",
    "What do you want then?",
    "I don't believe such a entrance[sic] exists.",
    "Ok I'll get your supplies.",
    "I have no time for this madness, goodbye.",
    "Good day, wanderer.",
    "What did you need again?",
    "I'd like to ask you about something else.",
    "Tell me about Sophanem, this city of the dead.",
    "So it's not full of evil undead hordes then?",
    "So who's in charge then?",
    "Tell me about this Icthlarin god.",
    "I sense some hostility here.",
    "What are you doing out in the desert?",
    "The usual, you know, seeking fame, fortune and adventure.",
    "Who are you?",
    "How sad, I hope no one will ever forget mine. The bards of Gielinor will learn of my epic adventures and write songs to recount my great deeds.",
    "How do you survive out here in the desert?",
    "I've gotten most of the things you wanted.",
    "No I haven't really bothered getting anything yet.",
    "Yes. I have them all here.",
    "Actually, I seem to have forgotten some of them. I'll be right back.",
    "Ah, my poor head. What's going on? How did I get here? That woman, that wanderer, this is her doing.",
    "What?",
    "But...",
    "Good day.",
    "Yes, but I don't bring it to harsh places like this.",
    "I might, but I have a few things to sort out first though.",
    "No, you are mistaken.",
    "Yes, but I've left mine in the bank.",
    "Good day.",
    "I need help.",
    "What companion? Oh, you mean my pet cat? Well, I'm a little bit confused about 'goings on'.",
    "Well, one second I'm here, and the next things go all black, and then I'm somewhere else. I have a cracking headache and some strange object in my bag which I can't throw away.",
    "None really of much note. Although, thinking about it, things started to go a bit weird once I started talking to a wanderer outside town. She had the strangest red eyes and hair.",
    "Well, thanks. You've been a real help.",
    "Who are you?",
    "Well, now that you've told me what you're not, can you please tell me who or what you are?",
    "Why would they need a guardian?",
    "The Devourer?",
    "I don't understand.",
    "Little to none.",
    "Hang on... Pantheon? Deities? What are you talking about?",
    "Ok, I think I'm getting the hang of all this god speak now.",
    "Does she have anything to do with the river that runs through the area?",
    "That's great but could we get to the point here?",
    "With a name like The Devourer, it's no wonder the kid turned out to be messed up.",
    "So, then, we've got a simple case of good sibling fighting against bad sibling?",
    "I thought you said she wasn't evil?",
    "Um, no, but it also creates heat.",
    "And...?",
    "Ah hah, I see where this is going: the cats are used to protect the dead from The Devourer, like you said earlier. But who protects the cats?",
    "So, then, you are a follower of Icthlarin?",
    "This is all very interesting but I've got to get going.",
    "What's going on in town?",
    "Well, I could benefit from your point of view; you seem the independent type.",
    "What? More than one?",
    "The remaining residents? There are a lot of living people here for a city of the dead.",
    "So how did they get out with all those guards at the gate?",
    "So, what caused the plague to break out?",
    "Hello.",
    "I need some help getting rid of this jar.",
    "Hello.",
    "You seem rather happy for an enslaved labourer with a bad case of spots.",
    "I really don't follow.",
    "So...",
    "But aren't the spots intolerable?",
    "Dermi wha?",
    "...?",
    "I get ya. Now what were we talking about again? Oh, yes.",
    "Tell me about these downsides, then.",
    "What, starvation?",
    "What?",
    "Can I pass through this gate?",
    "I am not afflicted by any plagues, so let me pass.",
    "Good day.",
    "I did no such thing.",
    "Hello.",
    "Don't worry cow, I'm sure someone will find a cure for this plague soon.",
    "I must go to the heart of the pyramid. Did I say that? Something strange is going on. Perhaps I should just go with it...for now.",
    "I'm going to leave the money there. I'm not a grave robber.",
    "Ahh my poor head.",
    "What in the name of Guthix is going on? Was I just dreaming there?",
    "Good day.",
    "I need help.",
    "Can you help me? Please?",
    "I don't like the sound of this.",
    "There's always a 'but', isn't there?",
    "Okay, that sounds fair.",
    "The answer's 9.",
    "Totally positive.",
    "Now will you help me?",
    "I didn't rob anybody's grave!",
    "I didn't. Anyway, there's no proof that I did.",
    "How did you know about the burial jar?",
    "Well, I don't know how it came into my possession. All I know is that one minute I'm entering a tunnel to get into the city and the next I wake up outside this pyramid with a cracking headache and a stinking burial jar in my bag.",
    "Well, as a matter of fact, yes.",
    "Are you sure? Everyone else around here seems to be too upset with me to have a proper conversation.",
    "Well, thanks for your advice...although why did you have to drag me through all that?",
    "I don't know; I don't want to risk my cat.",
    "Good day.",
    "I lost that token you gave me; could I have another please?",
    "Traitor.",
    "I can't find him.",
    "Thanks. Come on, cat.",
    "Hello.",
    "Wait! The Sphinx told me that I should talk to you.",
    "Well, there's this jar that's come into my possession.",
    "I guess so.",
    "What?",
    "What is wrong with you?",
    "What? Come on, spit it out.",
    "What do you mean, 'new'?",
    "Yeah, that was probably me...",
    "Yes... Do you think I should return the jar, then?",
    "So, do you have any tips about the pyramid, seeing as it was probably your priests who built it?",
    "Any other useful advice to go with that?",
    "Have a cat?",
    "She may have.",
    "Ummm...I see. 'Ask my cat', you said. Anyway, I had better return this jar.",
    "No, not yet.",
    "What? Question your sanity?",
    "Hello.",
    "I'm working on that still.",
    "Hey puss! What do you reckon about that cat on the door? Do you think you can open it?",
    "This place feels strangely familiar. I'm sure I've been here before.",
    "I need to get a burial jar for the mistress.",
    "The mistress would not permit me do this.",
    "What did I just say?",
    "Oh no, what have I done? I really did steal that jar. I had better return it quickly before more harm is done.",
    "I should return to the highpriest[sic] and tell him that I have returned the jar.",
    "Wait I want to ask you a question.",
    "I don't think I'll make that jump.",
    "Hello merchant.",
    "People here sure aren't all that welcoming.",
    "Plagues? What do you mean?",
    "Sorry about that. I'm trying really hard at the moment to put that right.",
    "Eeewww yuck!! That's disgusting.",
    "Who are you?",
    "What do you do?",
    "It's worked before.",
    "Umm, sure. I'll do that.",
    "Hello.",
    "Good day.",
    "I'm not a ghoul. Well, not by choice, anyway. I've just put the burial jar back.",
    "I think I detect a touch of resentment from you.",
    "Would an apology cover the damage?",
    "I think I should probably be going.",
    "Hello",
    "Real friendly! No?",
    "Hi.",
    "Nothing in particular; I'm just curious about a few things.",
    "Can you open the gates for me?",
    "I' m working with the High Priest to find a cure for the plague. Now, if you want to be spotty for the rest of your life, don't open the gates.",
    "I need help.",
    "I don't care for your mocking tone.",
    "Come on, cat; let's leave that nasty Sphinx alone.",
    "Yes, but why are you still spotty and why have only some of the plagues lifted?",
    "Look, pull yourself together. Are you the high priest or not?",
    "Do your people need you to lead them in this troubled time or not?",
    "So then why haven't the plagues completely left?",
    "What ceremonies? Why didn't you mention this before?",
    "You forgot? No matter. What has to be done, then?",
    "Sure, no problem.",
    "Okay, so what exactly do you want me to do, then?",
    "Sure, for a price...",
    "So, what kind of reward are we talking about? It's not as if I'm going up against a couple of cave crawlers or anything. So far, a god or something has hypnotised me and made me run through a mummy and trap infested pyramid to steal the internal organs of some dead priest. This reward really better be worth a lot. What are we talking about? Gold? Weapons? Pointy hats? I've got to know before I make a decision to help or not.",
    "You're kidding me, right?",
    "Hang on, I think you have that one wrong.",
    "When you say, 'all that glitters', you imply that everything that's flashy isn't valuable - like gold. Now this...",
    "You're not really selling this to me. I'd rather go fishing or chop down trees for a while.",
    "I've played out my part in this mess already; I was forced to steal a jar but now I have returned it. Job done, thank you very much.",
    "I have plenty of things to do yet.",
    "I just need to get the carpenter some logs. I should be ready soon.",
    "Thank you.",
    "Hello.",
    "Is it?",
    "No thanks.",
    "Don't worry about it...too much. We've got to work together now to put that dreadful spirit to rest.",
    "Of course you're right. Now, can I help you with anything?",
    "I think entering and leaving the city shouldn't be a problem.",
    "Where will I get those?",
    "How about the sap?",
    "Coniferous?",
    "But where would I find one of those trees here in the desert?",
    "No, not yet.",
    "No, not yet.",
    "No, not yet.",
    "I don't think everything's ready just yet; the carpenter still has to finish some work.",
    "I have to get a symbol from the carpenter. I think the priests can start the ceremony once they have that.",
    "Hello",
    "Real friendly! No?",
    "Hello.",
    "Is it?",
    "I've met with the town's embalmer and he mentioned that he needed a few things, linen being one of them.",
    "What the..?",
    "I have better things to do than mess around with suntraps.",
    "Hello.",
    "It's a bit hush hush.",
    "Ummm....",
    "Uh, I've got to go now.",
    "Good afternoon.",
    "Thank you for your understanding. If I had been given a dose of acne, had my business ruined and my town turned upside-down by hordes of plague creatures by some outsider, I would be more than a little angry too.",
    "He said he needs you to craft a new holy symbol for the ceremony.",
    "Oh, great. Here's the bit where you say you need me to get you something.",
    "Why should I help?",
    "Well, I suppose you may have a point. Now, do you have any idea where I might find some willow trees around here?",
    "Great.",
    "Alright, I'll get the wood for you.",
    "Now do you have any idea where I might find some willow trees around here?",
    "Great.",
    "Good afternoon.",
    "No, I'm still working on that.",
    "Do you have any idea where I might find some willow trees around here?",
    "Good afternoon.",
    "I have some in the bank. I'd better nip off and get them then.",
    "Good afternoon.",
    "Yes, I have some here for you.",
    "Hang on, what do you mean you'll have it ready for me shortly?",
    "Okay, I'll be back.",
    "Good afternoon.",
    "Is the symbol ready yet?",
    "Thanks, I guess.",
    "Yeah, yeah, yeah.",
    "I would have if I could have found him.",
    "Actually, there's a slight problem with the holy symbol.",
    "Look, calm down; I'm sure there's nothing wrong with the symbol you made. I've just lost it.",
    "Can you please calm down? I gave you plenty of willow wood. I'm sure there's some left over for another symbol.",
    "I must hide the mistress's symbol somewhere in the ceremonial room so that she can enter the pyramid when ever she pleases.",
    "No this isn't a good enough hiding place, I need to put the symbol somewhere more secret.",
    "Ha! Those foolish priests will never find this here. She will be able to enter the Pyramid now at her whim. Those preposterous priests won't know what hit them. I must now return to the mistress with the jar.",
    "Noooo. This is ridiculous even my memory is working against me. I have to warn the priests about the Devourer. I hope I'm not too late already.",
    "Wait, wait, wait, there's something wrong!",
    "But the devourer, she's coming!",
    "Your spells won't work on me again now that I see you for what you are.",
    "Ack, strange magic again. I suppose I have to go along with the conversation 'til it ends. Time to go back to that room.",
    "Then why are you still covered in spots?",
    "So what happened? I returned the jars and we performed the final ceremony... Why will Klenter's spirit not rest now?",
    "So what do I have to do now?",
    "What? I can sort this; come on, tell me what to do and I'll sort it.",
    "So this cycle could repeat itself endlessly?",
    "You'd better keep this holy symbol, not that it did much good.",
    "I'll hold onto my doubts. Anyway, you should take this.",
    "I still don't feel right, though, about this whole thing. There are still so many loose ends untied.",
    "Well, for one, I still don't know why I didn't complete my task for The Devourer. I have a feeling that I'll get my answers soon enough.",
    "I must return the jar to the mistress.",
    "Never! The mistress will have the jar and the high priest's soul.",
    "Aghhhh!!! Nooo.",
    "I'm sure the frog problem could be solved easily enough. A few cats could go a long way in reducing their numbers.",
    "I guess you're right. I could do with dropping some of this junk. I'll be back; just don't lose my reward.",
    "Hello.",
    "I need help.",
    "I need help with The Devourer. I haven't defeated her.",
    "Hi!",
    "What's wrong?",
    "What, you're upset that I tried to put the high priest's soul to rest?",
    "Doesn't everyone?",
    "I was just trying to help and, as it turns out, I've not achieved not a whole lot.",
    "Hi there.",
    "I can see you're a bit down. I'm sorry that the plague hasn't lifted just yet.",
    "I really hope for your sake he cannot.",
    "Hey there, how're you holding up?",
    "I suppose that makes two of us.",
    "Are you in need of any willow logs at the moment, or any other wood for that matter?",
    "Grey economy?",
    "Hello.",
    "Why do you say that?",
    "Unfortunately some other hapless adventurer was tricked in the same manner as me.",
    "In what way?",
    "No thanks.",
    "It was nothing, really. I'm quite good at that type of thing.",
    "You know I'm still confused about all that business with the devourer.",
    "I did? I thought I had all my memories back.",
    "Actually, that part of my memory is still a little bitty.",
    "I will do your bidding mistress.",
    "Yes Mistress.",
    "Yes Mistress.",
    "Yes mistress.",
    "Yes mistress.",
    "Did you understand what went on in that quest with the devourer and Icthlarin?",
    "Really? I was, no actually am, still confused.",
    "Great! Story time.",
    "What, a religion called Klenter? What kind of name is that?",
    "Ok, I'm with you that far.",
    "Ah - the wanderer.",
    "So who was that?",
    "Oh. So why doesn't she have a high priest too like Icthlarin?",
    "So if she's so powerful why does she need this gullible fool's help?",
    "Your kind?",
    "What? Why would she care about you? All you ever want is a bit of attention and the odd fish or two.",
    "Vaguely, I think. Why did she choose me to help her then.[sic]",
    "I don't understand.",
    "Ahh I think I'm beginning to get a better understanding.",
    "The guy with the head of a dog?",
    "Klenter? I thought he was dead.",
    "So that's when I woke up with that jar in my inventory and had that intolerable ghost harassing me.",
    "So then I remembered about the devourer's symbol which I placed in the ceremonial room and had to rush back and warn the priests about the devourer.",
    "Thanks cat, you know you're quite smart for a fish-eating animated ball of fluff.",
    "Can you explain to me about Icthlarin and the devourer again?",
    "Aw come on. Just tell me one more time.",
    "Alright puss."
  ],
  "Wanderer": [
    "Hello to you too adventurer.",
    "Agh! Get that cat away from me. Quickly please.",
    "Yes, Sophanem to the south, but it is closed to all outsiders.",
    "Wandering, drifting and just surviving. What about you?",
    "Just a nameless one. I had a name once, but it's been long forgotten.",
    "I don't doubt that.",
    "I survive off what little the land provides and the generosity of strangers and fellow travellers.",
    "Just take it away please. Take it away. If you do I'll tell you of the secret passageway.",
    "Get the cat away from me first and then I'll tell you.",
    "It's over yonder by the group of rocks to the east. But you won't be able to enter, well not just yet anyway.",
    "To Sophanem, the city of the dead.",
    "First bring me some supplies and then I'll tell you. I'm running low and am about to embark on a long journey.",
    "Give me a full water skin and a tinderbox. I seem to have lost my own and these desert nights are cold.",
    "Fool! It's the only way into the city. Wander the desert and die of thirst, see if I care.",
    "Hello to you too adventurer. Have you gotten my supplies?",
    "Bring me a full waterskin and a tinderbox.",
    "It's the second city of the Menaphites, full of giant monuments to their dead.",
    "No but there is still plenty of adventure and gold to be had, plundering the graves of the rich and powerful.",
    "The pathetic new high priest of Icthlarin. The wanderer spits the last name out as if it were a curse.",
    "No!",
    "Wandering, drifting and just surviving. What about you?",
    "Just a nameless one. I had a name once, but it's been long forgotten.",
    "I don't doubt that.",
    "I survive off what little the land provides and the generosity of strangers and fellow travellers.",
    "I need both of them now. Hurry back when you have them.",
    "Do you want to enter the city or not? Hurry up and get my supplies, I intend to leave soon.",
    "Give me the supplies first and then I'll show you the entrance.",
    "Look into my eyes. Look deeply into them. Don't blink.",
    "My thanks adventurer. You have been most helpful. I will have my soul now.",
    "Adventurer I command you to kill these priests.",
    "No matter, I will just create another minion to destroy all of you. You've already served your purpose. You priest of the dog lord, kill your brethren.",
    "Kill them all!",
    "Look into my eyes. Look deeply into my eyes. Don't blink. You will do what I say.",
    "You will travel to Sophanem and enter the pyramid of the priests of Icthlarin.",
    "You will find a room within containing four jars take one of them and return to me.",
    "Take this symbol. You know what to do with it when the time comes.",
    "Don't fail me, or else I'll eat your soul.",
    "Now go."
  ],
  "Cat": [
    "Hiss!",
    "Meow.",
    "Meow.",
    "Meow.",
    "Meow!",
    "Meeeow.",
    "I suppose that is understandable, you did miss out on a little bit of the adventure.",
    "Do you remember being hypnotised then?",
    "It wasn't all that difficult to understand.",
    "Ok, I'll tell you what I think happened.",
    "There once was a high priest of some crazy religion called Klenter.",
    "No, no. The high priest was called Klenter and he was the high priest of Icthlarin, god of the dead.",
    "He dies, and a struggle starts for his soul. Another god - the Devourer - wants to destroy his soul because she has some dispute with Icthlarin. So she takes on the guise of a human.",
    "Very good. Now she needs help in getting Klenter's soul so she tricks some gullible fool into helping her.",
    "You!",
    "Well she's the god of destruction. If she had a priest or a temple or anything she would just destroy it.",
    "Because of my kind.",
    "Cats!",
    "We have other powers, not clear to you. Anyway I'm moving away from the story. The wanderer recruits your help by hypnotising you. Do you remember that?",
    "Because of me.",
    "Cats are the only things that can open the pyramid's door, so she needed an adventurer with one. So you entered the pyramid with me - under her mind control - and stole a canopic jar containing and organ belonging to Klenter.",
    "You then started to return with the jar to the Devourer, but as a sting on the tail she made you plant one of her symbols in the ceremonial room of the pyramid. You then tried to flee the pyramid but Icthlarin appeared just as you reached the exit.",
    "Yes Player. Well he either broke the devourer's hold on you or else Klenter did.",
    "He was, and still is. Ok, Icthlarin summoned Klenter's soul to torment you into returning the jar, the end result was that you were freed from the devourer's grasp.",
    "You then bumbled around for a bit and returned the jar, discovered that the high priest still hadn't completed the final ceremony so you got him all the bits and pieces.",
    "And the rest is simple enough to piece together.",
    "You say the sweetest things. Hiss.",
    "I'm getting a little bit sick of talking about Icthlarin and all that stuff. If you didn't understand it the first time around, nor when I filled you in on a few details and then when I spelt it out to you what happened I don't think you'll ever get it.",
    "Look, can we just leave it. Ask one of your adventuring friends."
  ],
  "Klenter": [
    "Agghhh!",
    "Aieee!",
    "Waghhhh!",
    "Wooo!",
    "You foul thief, return what is mine.",
    "You heard me, restore what you have stolen from my tomb!",
    "You worm! May the Devourer take your soul.",
    "Give me my guts back, thief.",
    "You pathetic excuse for a thief.",
    "Return what is mine.",
    "Grave defiler.",
    "Thief.",
    "Evil doer.",
    "Spawn of evil.",
    "Graverobber.",
    "Organ snatcher.",
    "Thank you adventurer, you have given my soul some respite, I will cease to haunt you and the plague creatures will no longer seek you out."
  ],
  "Menaphtie guard": [
    "Halt! Take another step and we'll fire you with arrows. Menaphos is closed to you Sophanites. Turn back and take whatever plague you have with you."
  ],
  "Sphinx": [
    "You have the feel of a cat person about you. Do you look after one?",
    "A pity; they can be of great help in some adventures. I would like to talk to your cat. Would you bring it to me?",
    "Really? I'm generally quite good at knowing these sorts of things.",
    "What? That's no place for a cat!",
    "Ah, how interesting...a cat. Come here to me, kitty.",
    "Your companion tells me that you are in a spot of bother.",
    "What do you mean by goings on?",
    "Have you taken a bang to the head recently?",
    "Interesting, very interesting. I'd like to help but I'm not going to get involved. Well, not just yet, anyway.",
    "I will tell you one thing, though: some important objects and locations can trigger memories, no matter how repressed they are.",
    "I am an agent of neither good nor evil. I am concerned with the plight of mankind and their petty wars and beliefs.",
    "I am the guardian of feline kind.",
    "Cats play a significant role in the religion of this area, particularly when it comes to guarding the dead from The Devourer.",
    "She's the very incarnation of destruction.",
    "What understanding do you have of the Menaphite gods?",
    "The Menaphite pantheon is made up of four main deities.",
    "Sorry. I'm getting a bit ahead of myself. A pantheon is the collective name for the gods or deities of a group of people.",
    "The main god which the Menaphites worship is called Tumeken. His wife, Elidinis, is the goddess of fertility and growth.",
    "That's very observant of you. The river Elid is named in her honour as it brings growth and life to the area during times of flood.",
    "Patience. You humans are so impatient; no wonder your life only spans a number of decades.",
    "Tumeken and Elidinis had two children: Icthlarin and The Devourer.",
    "She was not always called such. She is thought of by her deeds, now, rather than her name.",
    "No, it's not really that simple. Neither are either good or bad. Icthlarin is the god of the dead and takes care of the passing of souls from one plane to another. Once long ago, he even was worshipped by the Mahjarrat but they have since turned away from him. The Devourer is the goddess of destruction; she craves only to destroy things.",
    "Fire destroys, but is that evil?",
    "Okay, we could have an overlong theological debate now, but to get to my point, recently - well, in the last age or so - The Devourer has taken to destroying humans.",
    "Not just killing them; totally destroying them, body and soul. This has brought her into conflict with Icthlarin.",
    "Well anticipated. The Devourer is terrified of cats for reasons I will not explain, but her followers - although few in number - are not. I ensure the survival of cats and, for this service, Icthlarin grants me eternal life.",
    "Nothing of the sort. As I've said before, I have no interest in humans. I look after my kind and, for that, Icthlarin looks after me.",
    "I thought that this would be pretty obvious.",
    "Flattery, my adventurer, will get you everywhere. But to answer your question, Sophanem has been struck down with plagues.",
    "Quite a number; there's a plague of frogs to the west of town and, in the east, you can find locusts. The livestock are diseased, the cows have only been producing sour milk since the outbreak and the remaining residents have been struck down by some rash of spots.",
    "Sophanem is called the city of the dead because the dead are brought here. Death plays a rather large role in the beliefs of the people and, as a result, the business.",
    "When the plague first broke out, many of the resident tradespeople fled before the priests of Icthlarin decided to quarantine the city to prevent the plague being passed on to others living nearby.",
    "Some irritated god or other...or, perhaps, some peevish human; their grievances interest me little.",
    "Ah, how interesting...a cat. Come here to me, kitty.",
    "Your cat tells me you're in a spot of bother; something to do with grave-robbing, tisk tisk. So unbecoming of a guardian of cats.",
    "Well, I have to say I enjoy a laugh at someone's expense now and again...so let's have a bit of fun.",
    "I'll help you if you can answer a simple puzzle of mine, but...",
    "...but if you answer incorrectly, I get to keep your cat.",
    "A husband and wife have six sons and each son has one sister. How many people are in the family?",
    "Are you sure?",
    "Well answered, human. I guess you get to keep your cat.",
    "Now what was it with which you needed help? Oh yes, I remember; your cat mentioned something about grave-robbing.",
    "Too true, you didn't rob just anybody's tomb, you robbed the grave of the late high priest of Icthlarin.",
    "Really? So explain why the shade of the high priest is ranting about you to the west of here...or how about explaining why you have a burial jar in your possession?",
    "Simple. I can smell the rotting organs from here.",
    "Have you had any strange turns, flashbacks or out-of-body experiences recently?",
    "Ah hah. It sounds like someone hypnotised you and forced you to carry out their bidding. I won't get any more involved with your petty human bickerings; I have my own kingdom to look after. However, I will give you one bit of advice: seek out the new high priest to the south-west of this town. He will help you.",
    "Here, I have a token that he will know is from me. Take that to him and I'm sure he will talk to you.",
    "The trials of humans concern me not, but I do make exceptions for guardians of my kind.",
    "How disappointing; well, nothing ventured, nothing gained. Goodbye, then.",
    "Ah, how interesting...a cat. Come here to me, kitty.",
    "Ahhh, you humans.",
    "Your cat tells me that you have yet to speak to the high priest. I wonder why I tried to help at all!",
    "Try the large building to the south of Sophanem.",
    "How go things, great guardian of cats?",
    "I have helped you enough, or at least as much as I'm willing to.",
    "What with? Your cat tells me that you have held The Devourer at bay.",
    "I hope that you will come to the understanding that not all the world's problems can be solved by an individual. You've done your bit; it's now up to the Menaphites and the priests of Icthlarin to solve this standoff. I have to confess that, despite myself, I am impressed by your actions. I may have some work for you at a later date."
  ],
  "[Raetul/Siamun]": [
    "Clear off you despicable vagabond."
  ],
  "[Jex/Priest]": [
    "What business does the cursed one have with a servant of Icthlarin?",
    "I will not aid a defiler of the dead. Get ye gone; your presence is soiling my austere aura.",
    "Bother me not, I am in preparation for the burial ceremony. I'm sure even you can curb your trivial demands until after that.",
    "Greetings, non-believer. May the blessings of Icthlarin rest on your tired shoulders and may they set you at ease during interesting times."
  ],
  "Slave": [
    "Hey there!",
    "These spots are the best thing since log rollers!",
    "Well you see, since the outbreak of the plagues, the city has been under quarantine and has been unable to import anything.",
    "So, no quarried rock has been able to get in. So, we have had no work to do. I hope the plague lasts forever.",
    "I would take a dermatological irritation over back-breaking, mind-numbing labour any day. Although, there are other downsides.",
    "You know - when your epidermis...",
    "Your hide? Your skin? Your bark?",
    "Well, the cows have the plague too, so all they produce is sour milk...and plagued beef has me considering the unthinkable.",
    "No, something far worse!",
    "Vegetarianism!A visible shiver runs down the back of the slave.[sic]",
    "What do you want?",
    "Word has it that you very nearly spoiled our fun!",
    "So that we could get back to work again? What makes you believe that he even deserves such a burial?",
    "What, even those that gain through the blood, sweat, tears and misery of others?"
  ],
  "Priest": [
    "I cannot permit you to leave. The city is under quarantine due to the outbreak of plagues.",
    "No!",
    "Cursed one, why have you not yet returned the burial jar of our old leader?",
    "I wonder how someone as insignificant as you even managed to get inside the pyramid, never mind reach its heart.",
    "Yes mistress! Kill them all.",
    "Thank you, unbeliever; your heroic efforts have saved the day. I shudder to think of the fallout if we were to have lost another high priest so soon after the last."
  ],
  "Carpenter": [
    "Get away from me you filthy grave robber.",
    "So explain why that spectre is accusing you of such a crime. The dead rarely have need for lies.",
    "Sorry, adventurer, I have nothing to trade with you.",
    "Good day, grave robber. What do you want?",
    "Well aren't you wonderful! Do you want a medal for your efforts.",
    "I'd hope so. Because of your actions, I'm covered with the most awful spots, I've been forced to close my business down, there are hordes of giant frogs and locust roaming the streets and all the nearby livestock are sick.",
    "Hello, adventurer. Apologies if I was a little on the cold side earlier, but the high priest said that you're working with him and that's good enough for me.",
    "So, does the high priest have any instructions for me?",
    "Yes. I remember he gave me some drawings a few days ago. Now what wood was it to be made of again? Give me a second.",
    "Ah yes, I remember now, it was to be made of willow. Though there's a small problem with that.",
    "Wow, you're quick. I'm all out of willow wood and seeing as I'm unable to get any more due to the quarantine, I'm going to need some help with this.",
    "Well, seeing as I have gotten this dreadful dermatological disease as a direct result of some of your antics, I think you should be duty bound to help me.",
    "Not a notion.",
    "Great.",
    "Not a notion.",
    "Hello, adventurer.",
    "Have you got the logs yet?",
    "Well then, hurry up and get me those willow logs.",
    "I know of no willow trees that grow in the desert. They're a fairly common tree in the more verdant climates of Misthalin and Asgarnia. A good place to start's between Varrock and Lumbridge.",
    "Hello, adventurer. Have you got the logs yet?",
    "In your on good time. don't rush on my behalf; I'm only half crippled with these pus-filled pustules of penance.",
    "Hello, adventurer. Have you got the logs yet?",
    "That's good. I'll have the symbol ready for you shortly. I'm sure you have plenty of other important things to do in the meanwhile.",
    "Well, last time I checked, the job description for a carpenter is to craft things out of wood, while you, being an adventurer, need to run around doing thankless tasks for people in need...and right now I need you to do this.",
    "Hello, adventurer.",
    "No, now look... I'm busy trying to get this thing finished. If you don't stop annoying me, it will never get done.",
    "Just adding the finishing touches.",
    "Okay, it's finished here you go.",
    "You should get that to the high priest as soon as possible. We're all ready[sic] getting sick of these plagues.",
    "Oh, one more thing. I think that the high priest has had a particularly bad dose of these spots so he's gone off to start the ceremony already.",
    "Have you given the symbol to the high priest yet?",
    "Well, if he's not in town, then I'm sure he must be down in the pyramid getting the ceremony underway.",
    "Have you given the symbol to the high priest yet?",
    "What? What? I made that symbol to exactly match the drawings I was given. I can't believe this.",
    "Aghhh!!! You stupid man. Will I ever be free of these plagues? First it was the spots, now it's stupidity.",
    "Sorry, it's just these spots. They have me half demented. Just hang on a second and I'll make up another one.",
    "There you go. Now, do hurry up and get this to the ceremony.",
    "Well, I suppose things could be worse, though I really did have my hopes up I thought you could fix things up.",
    "Well, I've got a business to run here. I can't keep feeling sorry for myself for ever.",
    "Sorry, no. I've recently worked out a decent supply which bypasses the grey economy.",
    "It's selling bits and pieces through unofficial channels, avoiding taxes and import duty. Since I'm trying to keep on the good side of our esteemed rulers, I don't trade that way these days."
  ],
  "Doorman": [
    "Nobody may enter of leave Sophanem for any reason, so says the new High Priest of Icthlarin.",
    "What do you want?",
    "Why would I do that? I'm under orders not to let anyone in or out of the city.",
    "Okay, one second.",
    "You're the adventurer who's helping the High Priest, aren't you? You can pass through the gate if you wish.",
    "Good day, adventurer. I must thank you for protecting our High Priest. Word has it that it was quite the battle.",
    "Don't let us keep you. I'm sure you've got plenty of other important questing to get on with."
  ],
  "Embalmer": [
    "Clear off, you evil body snatcher. You won't get any of my wares.",
    "Sorry, adventurer, I have nothing to trade with you.",
    "Hello. ~The embalmer replies warily. What can I do for you?",
    "Well, you can take your curiosity elsewhere.",
    "Good day to you. I won't say you're welcome into my workplace, because you're not. However, I must apologise if I was outrightly hostile towards you earlier.",
    "I'll admit that I shed no tears when he passed away. He was a rather cruel and hard leader. Well, there's no point in complaining about him. I want rid of his cursed plague as soon as possible and, according to the high priest, the best way to do that is to carry out the final ceremony.",
    "Yes, because of the quarantine I cannot leave Sophanem. You seem to have been left unaffected by it so perhaps the guards will let you out of the city.",
    "Good, that's what I like to hear. Now, to carry out the ceremony, I need three things. I need some linen to wrap the corpse up. That should be easily obtained from Raetul the cloth salesman here in the town. His silk stall's north-east of here. I also need some salt and some sap. I need the salt to preserve the body and the sap for sealing the bandages.",
    "Well, with an empty bucket, you can get salty water from the shore of the salt lake, immediately north-west of Sophanem's north gate. I also hear Slayer masters sell salt to disintegrate rock slugs. That's work that too.",
    "The sap you should be able to get easily enough from any coniferous tree. You'll need something to collect the sap. Here, have a bucket or two.",
    "Evergreen, cone shaped, you know the ones I'm talking about.",
    "Evergreens don't grow in the desert, but you can also get sap from acadia trees in the imperial district of Menaphos. If you can get into Menaphos. Otherwise, there's evergreens in Asgarnia, north of Falador and on White Wolf Mountain.",
    "Have you got the linen I asked for?",
    "Well, can you get on with it?",
    "Have you got the salt I asked for?",
    "So hurry up! There's a salt lake just north of the city. You can get salty water from it with a bucket.",
    "Have you got the sap I asked for?",
    "Well, can you get on with it?",
    "That's everything I need to get the ceremony underway. I'll send word to the high priest to get things started.",
    "Never-the-less, I'll let the high priest know that everything's sorted from this side.",
    "Well, you've collected all the things that I need, so when's this plague going to end?",
    "Heh!!",
    "Hrmph!!",
    "Keh!!",
    "Pah!!",
    "Hello.",
    "Well, I suppose that's only to be expected. The old high priest was a vindictive sort. He could hold a grudge forever.",
    "He might just make this city of the dead a dead city if he does carry on for much longer. Anyway, I'm rambling."
  ],
  "High Priest": [
    "I will have no dealings with those who plunder the houses of the dead. Get thee gone from my presence.",
    "I will have no dealings with those who plunder the houses of the dead.",
    "The Sphinx? Is it possible? That contrary old cat has never done anything to help us. Prove it!",
    "Hmmm... So, what do you want then.",
    "What, a burial jar?",
    "Oh no! What am I going to do? What am I going to do? Umm, yes, I have it. Um...",
    "Um. What what?",
    "Sorry, I'm still well...you know?",
    "You know...new.",
    "It's my first week on the job and already I've had an outbreak of plagues, half the population has fled the town and, to top it off, some adventurer has desecrated the tomb of the old high priest.",
    "You did?",
    "Um, yes. That would be a good idea...wouldn't it?",
    "Well, um...you could try to avoid the traps?",
    "Oh yes, how could I forget! The key to getting into the pyramid is to have a cat.",
    "Didn't the Sphinx tell you that cats act as guardians against The Devourer?",
    "So, it stands to reason that only they should be able to open the pyramid door. Ask your cat to help when you intend to enter.",
    "Have you managed to return the jar yet?",
    "Can you please hurry up? The people are beginning to...erm...",
    "Um...well, no, just my authority. Don't forget that to enter the pyramid, you need a cat.",
    "Have you managed to return the jar yet?",
    "Ummm, ah, well...um...",
    "I am.",
    "By Icthlarin, they do and I will lead them.",
    "Because all the ceremonies haven't been completed yet and Klenter, the old high priest, grows weary of the mortal realm.",
    "Umm...I guess I forgot.",
    "Actually, very little is left to be done. Most of the prayers have already been said but the embalmer still has a bit of work to do. I have my own preparations to make, but could you help out the town's carpenter and embalmer?",
    "Thank you, [Player]. You'll be handsomely rewarded for your services to Icthlarin.",
    "I need you to tell the carpenter to create a new holy symbol for the ceremony. Also, you should talk to the embalmer. I know that he's having problems getting supplies into the town with the quarantine.",
    "Don't worry; you will be handsomely rewarded.",
    "It's none of those things and it's of no monetary value whatsoever.",
    "To quote someone else, 'all that glitters is not gold.'",
    "I have?",
    "Oh, just listen. What I'm offering you is something a bit different but quite useful, nonetheless. So, will you help or not?",
    "So much for Gielinor's greatest adventurer.",
    "Have you helped the embalmer and the carpenter to get all they need yet?",
    "Do hurry up; I'm being driven demented with these infernal spots.",
    "I have nearly completed my preparations too. I will probably see you inside the ceremonial room in the pyramid.",
    "Mighty Icthlarin, set Klenter's soul to rest.",
    "Mighty Icthlarin, set Klenter's soul to rest.",
    "Don't interrupt adventurer.",
    "You will not as long as I draw breath.",
    "Adventurer, protect us so we may finish the ceremony.",
    "Thank you so much, adventurer. We have defeated The Devourer; the plagues should abate now.",
    "What? So I am. Somehow, I don't think this is over. The Devourer will not concede defeat so easily, after all.",
    "The only explanation I can think of is that some other adventurer has repeated your mistakes and stolen a burial jar whilst we were here.",
    "Nothing, nothing. You've done all you can.",
    "We must find the adventurer who has carried out the this theft and get him to return the jar. Then, we will have to perform the ceremony again.",
    "Well, until one of the sides gives up, that is. Anyway, I have a gift for you back in town. But first, I have a few things to sort out here.",
    "You might be surprised to know that we wouldn't have been able to complete the ceremony without that in our presence, nor would you have been able to defeat The Wanderer's minion so easily.",
    "What do you mean?",
    "Ah, there you are, Player. I've been waiting for you. I must thank you again; your victory over The Devourer's beast was magnificent. It's only a pity that we haven't won an outright victory over her. Well, I'll just have to get used to these spots and the sour milk the cows are producing, not to mention those darned frogs outside.",
    "You're right, of course. Anyway, where did I put that trinket I promised you?",
    "I would reward you but, by the looks of you, I doubt you could carry any more baggage.",
    "Ah, yes, I have it here. I'm sure you'll get a huge amount of enjoyment out of it."
  ],
  "Plague cow": [
    "Moo."
  ],
  "Raetul": [
    "Hello. ~ The merchant replies guardedly.",
    "Well seeing as you caused us to suffer from these cursed plagues can you blame us?",
    "What? Do you think everyone in this town is naturally spotty and that this place is always under quarantine? Get away from me you fool, your stupidity might be catching and then where would I be.",
    "Well you're obviously not doing a great job, my spots are getting worse. I've got one right inside my left ear and if it bursts I think it could flood my brain.",
    "My name's Raetul.",
    "Well I wonder, I stand in front of a clothes stall and I sell clothes all day long. Do you really think that asking me all these pointless questions is going to achieve anything?",
    "Oh get away from me, I don't want to give your stupidity the chance to dull my razor sharp intellect and wit.",
    "Good afternoon.",
    "It's hot and sunny, which is good enough for me. So can I help you with anything?",
    "Good afternoon.",
    "It's hot and sunny, which is good enough for me. So can I help you with anything?",
    "Ah yes, very good...., very good.... here I have just the thing for you. That will be 30 coins please and thank you.",
    "Thank you come again.",
    "Hello again, any news on the ceremony?",
    "Oh I see so you're just floating around here and doing nothing about it then. Is that it?",
    "I see you have managed to mess things up again.",
    "Well the ceremony should have been over by now, yet the plagues remain.",
    "All you adventurers are alike!",
    "You're all trouble. Well I could hold it against you, but then again adventurers are my best customers and because of this quarantine my only customers. So may I interest you in any of my wares?"
  ],
  "Siamun": [
    "Heh!!",
    "Hrmph!!",
    "Keh!!",
    "Pah!!"
  ],
  "[Priests]": [
    "Hail mighty Icthlarin!",
    "Hail mighty Icthlarin."
  ],
  "The Wanderer's voice echoes in your mind": [
    "Kill them all."
  ],
  "Possessed Priest": [
    "Grrrr."
  ],
  "Icthlarin": [
    "What's this? A mortal thieving from my domain? This will not do. I command you to halt.",
    "This is no mere mortal in front of me. Amascut, release your hold on this human.",
    "Arise, spirit of Klenter, protect your soul."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Icthlarin%27s_Little_Helper?oldid=36206498’"
  ]
}