{
  "Cook": [
    "What am I to do?",
    "Oh dear, oh dear, oh dear, I'm in a terrible, terrible mess! It's the Duke's birthday today, and I should be making him a lovely, big birthday cake using special ingredients... ...but I've forgotten to get the ingredients. I'll never get them in time now. He'll sack me! Whatever will I do? I have four children and a goat to look after. Would you help me? Please?",
    "Oh, thank you, thank you. I must tell you that this is no ordinary cake, though - only the best ingredients will do! I need a super large egg, top-quality milk and some extra fine flour.",
    "That's the problem: I don't exactly know. I usually send my assistant to get them for me but he quit. I've marked some places on your world map in red. You might want to consider investigating them.",
    "Fine. I always knew you adventurer types were callous beasts. Go on your merry way!",
    "*sniff* Don't talk to me about cakes.",
    "No, I'm not. The world is caving in around me. I'm overcome with dark feelings of impending doom.",
    "No, that's the worst thing I could do. I'd get in terrible trouble.",
    "That would be nice, but the Duke doesn't allow holidays for core staff.",
    "My wife gets seasick and I have an irrational fear of eyepatches. I don't see it working.",
    "I know, I'm doomed.",
    "Er, thank you. It's a pretty ordinary cook's hat, really.",
    "It's all standard-issue cook's uniform.",
    "I AM a real cook! I haven't got time to be chatting about culinary fashion, I'm in desperate need of help!",
    "The castle really did suffer in the battle of Lumbridge. I'm glad it's over! People came from all over the world to help rebuild, and now things are getting back to normal. I'm glad - I have important things to cook and I'm not letting anything get in the way! In fact, even now I'm preparing a cake for the Duke's birthday! Although... umm...",
    "Hey, it's you! Have you come back to help me?",
    "How are you getting on with finding the ingredients?",
    "Please get the ingredients quickly. I'm running out of time! The Duke will throw me out onto the street!",
    "Thanks for the ingredients you have got so far; please get the rest quickly. I'm running out of time! The Duke will throw me out onto the street!",
    "Thanks for the ingredients you have got so far; please get the rest quickly. I'm running out of time! The Duke will throw me out onto the street!",
    "You've brought me everything I need! I am saved! Thank you!",
    "I'm afraid not. Only the big cheeses get to dine with the Duke.",
    "Maybe, but I won't be holding my breath.",
    "Ah, I have some rewards for you, but your inventory seems to be full."
  ],
  "Player": [
    "Where can I find those, then?",
    "Well, maybe you need to take a holiday.",
    "Hmm, why not run away to the sea and start a new life as a pirate?",
    "I'm afraid I've run out of ideas.",
    "Still, it suits you. The trousers are pretty special too.",
    "The whole hat, apron and stripy trousers ensemble...it works. It makes you look like a real cook.",
    "Hmm, I'm not sure if this is top-quality milk. Maybe that lady over there can help me.",
    "Most certainly! It's for the cook to make a cake for Duke Horacio!",
    "Which one's that?",
    "Do you have any buckets of milk spare?",
    "Thanks.",
    "How do I find a dairy cow?",
    "What about top-quality milk?",
    "Hmm. I should probably ask that lady downstairs how I can make extra fine flour.",
    "Well, I'm no expert chef, but apparently it makes better cakes. This cake, you see, is for Duke Horacio.",
    "What is this place?",
    "Who are you?",
    "Don't you ever get fed up with flour?",
    "How do I mill flour?",
    "Then I bring my wheat here?",
    "So, where does the flour go then?",
    "Great! Thanks for your help.",
    "I need an empty pot to hold the flour.",
    "I haven't got any of them yet, I'm still looking.",
    "Here's some top-quality milk.",
    "Here's the extra fine flour.",
    "Here's a super large egg.",
    "So, do I get to go to the Duke's party?",
    "Well, maybe one day, I'll be important enough to sit at the Duke's table."
  ],
  "Gillie Groats": [
    "Hello, I'm Gillie. What can I do for you?",
    "Really? Is it for something special?",
    "Wow, it's quite an honour that you'd pick my cows. I'd suggest you get some milk from my prized cow.",
    "She's on the east side of the field, over by the cliff. Be gentle!",
    "My name's Gillie Groats. My father is a farmer and I milk the cows for him.",
    "I'm afraid not. We need all of our milk to sell to market but you can milk to cow yourself if you need milk.",
    "It's very easy. First, you need an empty bucket to hold the milk.",
    "You can buy empty buckets from the general store in Lumbridge, south-west of here, or from most general stores. You can also buy them from the Grand Exchange in Varrock. You look like you could do with an empty bucket. Here, take this spare one.",
    "Then find a dairy cow to milk - you can't milk just any cow.",
    "They are easy to spot - they have a cowbell around their neck and are tethered to stop them wandering around all over the place. There are a couple in this field. Then you just need to use your bucket on the cow and you'll get some tasty, nutritious milk.",
    "Ah, for that you'll have to see my prized cow, on the east side of the field, over by the cliff. Then you just need to use your bucket on the cow and you'll get some tasty, nutritious milk."
  ],
  "Millie Miller": [
    "Hello adventurer. Welcome to Mill Lane Mill. Can I help you?",
    "What's wrong with ordinary flour?",
    "Really? How marvellous! Well, I can sure help you out there. Go ahead and use the mill and I'll realign the millstones to produce extra fine flour. Anything else?",
    "This is Mill Lane Mill, source of the finest flour in Gielinor, and home to the Miller family for many generations. We take the wheat from the field nearby and mill it into flour.",
    "I'm Miss Millicent Miller, the Miler of Mill Lane Mill. Our family has been milling flour for generations.",
    "It's a good business to be in. People will always need flour.",
    "Making flour is pretty easy. First of all, you need to get some wheat. You can pick some from wheat fields. There is one just outside the mill, but there are many others scattered across the world. Feel free to pick wheat from our field! There always seems to be plenty of wheat there.",
    "Yes, or to one of the other mills in Gielinor. They all work the same way. Just take your wheat up two levels to the top floor of the mill and place some into the hopper. Then you need to start the grinding process by pulling the lever near the hopper. You can add more wheat, but each time you add wheat you'll have to pull the hopper lever again.",
    "The flour appears in this room here. You'll need an empty pot to put the flour into. One pot will hold the flour made by one load of wheat.",
    "You can buy empty pots from the general store in Lumbridge, south-east of here. You can also buy them from the Grand Exchange in Varrock or make them yourself. You look like you could do with an empty pot. Here, take this spare one.",
    "That's all there is to it and you'll have a pot of flour.",
    "Flour is ideal for making tasty cakes, pies or delicious bread. I'm not a cook so you'll have to ask a cook to find out how to bake things. You could also sell it on the Grand Exchange in Varrock for a profit! Likewise, if you need flour and do not have time to make it yourself, you can buy some there."
  ],
  "You still need to get": [
    "Some top-quality milk. Some extra fine flour. A super large egg."
  ],
  "Congratulations! You have completed": [
    "'Cook's Assistant' - Complete this Novice quest."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Cook%27s_Assistant?oldid=35329505’"
  ]
}