{
  "Mabel": [
    "Oh dear, oh dear, oh dear. It's lost! I'll never see it again!",
    "Oh, could you? Thank you! It feels like I've been waiting an age for an adventurer like you to come along.",
    "It's my ring, my precious ring. I left it upstairs in this barn, and now I can't get it back. Please get it for me.",
    "G-g-get it myself? Adventurer, can't you see I'm distraught? I lost my precious ring, and I need your help to get it back! Please help me.",
    "No, I'm too distraught. Please help me!",
    "Oh, I promise you'll be rewarded. Just please get my ring back for me.",
    "P-p-please leave me alone.",
    "I b-bet she's still angry though. I'm staying in here.",
    "What? N-n-not coming out, too scared.",
    "Waaaa!",
    "No! I'm staying here until you've sorted out that scary old woman.",
    "P-p-please leave me alone.",
    "What about my precious ring?",
    "Really? Shut your eyes for a moment while I get out of this sack.",
    "Thank you, adventurer, thank you so much! I have little to offer you in return, but please accept this old lamp."
  ],
  "Player": [
    "Can you tell me what's wrong? Maybe I could help you.",
    "Can't you get it yourself? It doesn't sound very difficult.",
    "Have you even tried to get it yourself?",
    "What's in it for me?",
    "Okay, off I go.",
    "Uh..you just took Mabel's ring off me.",
    "Who are you?",
    "Is that all you have to say about yourself?",
    "You seem to know me.",
    "What happened to Mabel?",
    "Did you attack Mabel?",
    "Are you going to give Mabel her ring?",
    "What do you want me to do?",
    "Why do you want a twig?",
    "That sounds exciting.",
    "Can't you get your own twig?",
    "This is silly.",
    "Yes, I have it here.",
    "I got the twig you wanted.",
    "Well, aren't you supposed to do something?",
    "Do you need me to get something else?",
    "Okay, off I go.",
    "Will you return Mabel's ring and leave now?",
    "You're upsetting Mabel. Go on, return her ring and leave her alone.",
    "You're being really mean!",
    "I'm trying to complete this quest, and you've stolen the ring I'm supposed to be fetching.",
    "Are you going to reward me?",
    "The Wise Old Man of Draynor Village?",
    "You've been watching me?",
    "Challenge us?",
    "You're wrong about me. You're a twisted cynic, and you don't know me.",
    "Where will we find you?",
    "Can I fight you alone?",
    "What if I don't want to fight?",
    "Alright, I accept. I'll make you regret this!",
    "She's gone away, you can come out.",
    "I fetched your ring from the barn.",
    "Stop being silly! Everyone knows you're in there.",
    "you'll be perfectly safe, come on out",
    "A woman called Zenevivia wishes to challenge us.",
    "I was doing a little quest for a woman named Mabel when suddenly, Zenevivia turned up and scared Mabel into hiding. She persuaded me to do a pointless task, started ranting about adventurers, and finally challenged us both to a fight to the death!",
    "Dear little Zinny? She wants to kill us both!",
    "You were in love with that lunatic?",
    "Your house?",
    "She stole your house? How was that possible?",
    "So, we've got to go to the Rimmington portal, and find her in your house.",
    "Yes, let's go.",
    "No, not at the moment.",
    "Where are we going?",
    "Ah, yes.",
    "Can you stop following me, please?",
    "Hello?",
    "I won't be long.",
    "What does that mean?",
    "Why didn't you return to your house years ago? If you could find a new way in there, you could have taken the house back when she first stole it!",
    "Why is she trying to keep us out? Surely we're only going there because of her challenge.",
    "How can we get in there?",
    "[If you have a chisel] Hey, I've already got a chisel. Oh, he's gone, Huh.",
    "What is this place?",
    "Yes, I'm ready.",
    "What isn't good?",
    "Thanks for the warning. I'd better make sure I don't die.",
    "Why doesn't she come out here? We're only here because she summoned us!",
    "What's in the dungeon?",
    "Okay, let's get in there.",
    "Can you teleport me somewhere useful?",
    "Send me to Falador, please.",
    "Send me to the Grand Exchange, please.",
    "Just put me outside this house.",
    "Actually, forget it.",
    "I'm not afraid, I'm going in.",
    "We'll have to get through that dungeon somehow, regardless of the traps.",
    "Why would she leave us access to her workshop?",
    "What are we going to build?",
    "[if you have the materials] You may be surprised to hear that I'm already carrying all that stuff.",
    "Can you teleport me somewhere useful?",
    "I have them all.",
    "Okay, I'll get on with it.",
    "Okay, I understand.",
    "Yes, I'm sure I found them all. Let's enter.",
    "We've just passed through a dungeon full of traps and big monsters! Have you forgotten she wants to kill us? She said she hated you!",
    "Violent crime is a bad way to have fun.",
    "Yeah, your bank robbery was awesome!",
    "You're insane; she'll never fall for you again.",
    "She's insane; let's kill her and leave!",
    "This is self-centered obsession, not love. You're not considering how she feels or what she wants; you just fantasise about getting her back!",
    "So, do you still want to make up with her?",
    "Why would she listen to you now? She's only interested in killing us.",
    "Okay, let's go and face her.",
    "Come on, let's get this over with. I'll talk to her first.",
    "I thought this wasn't your house.",
    "I don't remember it being optional!",
    "Good luck.",
    "You're making a mistake.",
    "I'm still here, you know!",
    "I see you've made up with Zenevivia.",
    "Can I have that hat? Please please please please please!",
    "Can't you lend the hat to me when she's finished wearing it?",
    "...",
    "I don't really need a reward.",
    "Okay, what's my reward?",
    "So, when will I get this reward?",
    "Have you still got Mabel's ring?",
    "When will you give me Mabel's ring?",
    "You're going to rob the Wizards' Tower?",
    "Stealing is wrong! There must be some other way for you to get runes. Haven't you been to the Grand Exchange?",
    "...",
    "Can I help?",
    "When are you going to attack?",
    "Wow, that was a huge... thingummywut!",
    "I see your little robbery didn't go very well.",
    "Are you going to try any more robberies?",
    "Can I have Mabel's ring back now?",
    "Will you reward me now?",
    "I've dealt with that old woman. She's promised not to bother you again.",
    "Yes, I've got it here. It took me a bit more effort than you'd think.",
    "You're welcome. Thanks for the lamp."
  ],
  "Zenevivia": [
    "So, Player, the great adventurer, returns with the lost ring of Mabel, the damsel in distress, and the world is once again saved. All hail Player!",
    "Well?",
    "I'm Zenevivia.",
    "Yes.",
    "Aren't you Player, the saviour of the Piscatoris Fishing Colony? Aren't you Player, who grew a beautiful garden for an arrogant queen? Aren't you Player, who traipsed across Runescape, doing favours for dozens of people on behalf of a shopkeeper who just wanted some special wood? I'm sure plenty people know you, Player.",
    "Her cry was annoying me, so I whipped up a bit of magic to scare her into shutting up. It worked; she's now hiding in that sack, and she's too afraid to come out.",
    "If I'd attacked her, there wouldn't be enough Mabel left to fill the sack. She's fine.",
    "You really care about that silly girl's ring, don't you? Well, perhaps you'll do a favour for me. Just one small favour. I know you do favours for people.",
    "Inside one of these hay bales is a twig. Bring it to me. Help me, Player, you're my only hope.",
    "Perhaps I'm preparing a mysterious ritual that requires strange items than can only be obtained by adventurers...",
    "..or maybe I'm not. Are you going to get me the twig now?",
    "Couldn't Mabel have got her own ring? Go on, get me a twig.",
    "You've done stranger favours before, like that time you agreed to help a gangster dwarf become a druid.",
    "Have you managed to get me a twig from the hay yet?",
    "What?",
    "And?",
    "What had you in mind?",
    "Something else? Okay, I'd like another twig please.",
    "Why would you care what I do?",
    "Oh, stop flapping. I haven't touched her; I said I'd cast Bones to Peaches on her skull if she didn't stop crying, and she screamed and dived into the sack. I might have cast a few explosion spells too, but that was just for effect.",
    "You think I'm mean, so you yell at me. I think Mabel's an incompetent fool with no backbone, so I gave her a bit of a fright. So there. Now, what do you want to talk about next?",
    "Bah, you adventurers make me sick! If you really wanted to make the world a better place, you'd have kicked Mabel until she got her own stupid ring. But no, you have to encourage her incompetence by doing what she asks. Of course, we all know what adventurers expect in return! Adventurers always expect rewards whenever they've done a favour for someone. Then they swan off into the sunset, feeling like a good boy/girl for helping the damsel in distress. I've seen plenty of adventurers in my time, and they're all the same. You're as bad as Dionysius, that so-called Wise Old Man.",
    "Yes, that old fool. I had been watching him. When he announced that he'd retired, having worked with you to save the Fishing Colony, I started watching you instead.",
    "Following the tales of your adventures, yes. When I saw you helping that idiotic Mabel, I couldn't stand it anymore, so I decided the time had come to intervene. You and Dissy - I mean Dionysius - are the two adventurers whom I most hate, so I've decided to challenge you both, to prove that I'm mightier than the world's two most famous adventurers.",
    "Yes. The two of you must find your way to me, and then we'll fight to the death.",
    "Bah! I'll consider changing my mind if you put up a good fight. But I'll kill you anyway.",
    "No, bring Dionysius. Then I'll prove that I'm mightier than the world's two most famous adventurers. Hahaha!",
    "Then I'll kill you anyway.",
    "I'll be ready for you!",
    "Hey, I didn't invite you to explore my house!",
    "'Tis now.",
    "So, you've dared to accept my challenge.",
    "Dionysius, you old fool. You ignored me, you fought me, then you didn't have the guts to speak to me for years. Now you say you're happy to see me?",
    "All you ever talk about is how amazing you are, saving yet more helpless idiots from their perils. Now, shut up! Soon, the world will see its two greatest adventurers defeated by my hands. All quest-addicts shall learn that their accomplishments mean nothing compared to my power. Now, we FIGHT!",
    "Okay, maybe you quest-loving freaks aren't as useless as I thought. You have my attention now; what are you going to do with me?",
    "If it's about another stupid quest that you've done, please kill me instead.",
    "You robbed a bank, Dissy? You used to be a reward-hungry hero who was obsessed with doing quests to help incompetent idiots. What happened to you?",
    "Really? No more questing? No more Mister Goody-two-shoes?",
    "Why, Dissy, you've finally learned to be interesting. And you've proven to be a respectable fighter. Of course I'll come with you. Also, I've missed you...",
    "This one's not as impressive, but I'd rather be fighting stuff than sitting at home anyway, so that's alright.",
    "Borrowed items cannot be traded.",
    "You're not fooling anyone, Player. I know what adventurers are like; you expect rewards from your quests! Don't worry, we'll reward you soon.",
    "See, Dissy, little Player is a truly professional adventurer. He/She does the quest, then she expects a reward. Typical.",
    "Don't worry, I haven't lost it. I'll give it to you soon, although I think you should just kick the girl until she stops crying.",
    "Dissy and I are busy preparing for a trip to the Wizards' Tower. We'll talk to you again when we get back.",
    "Boring! What kind of person stands in the Grand Exchange merchanting when they could be fighting people instead? How is that fun?",
    "Why, Dissy, you're so sweet!",
    "Yah!",
    "Eek!",
    "Nice try.",
    "Too easy.",
    "Let's scram.",
    "No. No, it certainly didn't.",
    "So, we thought we'd better give up on crime as a hobby. Don't worry, we can find other exciting ways to amuse ourselves.",
    "It'd be no fun if those wizards are going to interfere. We can find other amusing hobbies to pass the time.",
    "Please note that I never wanted to go on adventures.",
    "Oh, are you still fussing about that stupid girl's ring? Yes, I'll give it back, and I promise I won't bother her again.",
    "I'll even give you back that stupid girl's ring that you were fussing about earlier. I promise I won't bother her again.",
    "Estate agents will offer to redecorate your house in the amazing dark stone style I invented, and you should be able to build dungeon pits now, as long as you are skilled enough. I'll also grant you discounts when employing servants. You know how I hate quest rewards, so be grateful."
  ],
  "Zenevivia'": [
    "Oh, Dissy knows where I live. He won't have forgotten that. But you'll have to find a way in."
  ],
  "Wise Old Man": [
    "Greetings, Player.",
    "Zenevivia? Y-y-you've met Zenevivia?",
    "Ah, dear little Zinny. She hasn't changed one bit. Doubtless, this 'pointless task' was her little joke, a way of proving that adventurers would do any meaningless job for a reward. I'm sure she enjoyed watching you do it.",
    "Ah, but she was the love of my life.",
    "A long time ago, yes. She has an incredible spirit, such an awe-inspiring magical power, such flowing hair..",
    "..although I'd won the fight, I had lost. I had lost her. Then, the next time I went to my house, I couldn't get in. She'd found a way to lock me out and steal the house!",
    "I mean the house that I designed myself, like your house in [poh location]. Mine was accessed via the portal in Rimmington. She stole it, and I haven't seen her since.",
    "Zenevivia was an extremely talented mage, like me. Stealing a house was easy for her. In fact, she's probably there now.",
    "I suppose so. Meet me outside when you're ready to walk to Rimmington.",
    "Are you ready to go to Rimmington?",
    "As you wish, Player, Hopefully, Zenevivia won't get bored of waiting and come here to kill us all.",
    "Heh heh heh.",
    "Ah, it's good to get out in the fresh air.",
    "To Rimmington! We're trying to gain entry to my old house via the Rimmington portal. Then we can see what challenge Zenevivia has prepared for us.",
    "Oh? Yes, if you say so. I'll wait outside my house.",
    "I'd kick your scabby bottom right out of my village, but you're not worth the time it'd take me to clean my boots afterwards.",
    "Heh heh heh.",
    "A good day to you, Martin.",
    "You really shouldn't be talking to necromancers, Player.",
    "Now, let's see if I can get back into my old house.",
    "Hmmph. She hasn't reconnected the house to the teleportation matrix.",
    "Houses exist in folded-space regions. When you use these portals or a Teleport to House spell, the teleportation magic must find your house before it can take you there. Zenevivia stole my house by disconnecting it from the matrix of teleport destinations. This broke the standard methods of teleporting to it. I'm sure she invented her own way to teleport there, so she could use the house herself. I've got an idea of how to do it too, but I haven't tried it yet.",
    "I was, um, too embarrassed to see her again after our fight. I never used the house much anyways, so it just seemed easier to let her keep it. Besides, I'm quite fond of my new house in Draynor Village.",
    "If I could use this portal to enter the house in Building Mode, I could probably delete all the rooms she's set up. She won't want that.",
    "I believe we'll be able to do it by chipping a teleport spell to change its destination manually. Magic is so flexible if you know these tricks! Fetch a chisel. I'll wait for you in the house of my friend Hengel, south-east of here.",
    "Ah, here you are. Now, I'll give you some teleport tablets. Use them sparingly; I can't spare any more if you lose these.",
    "Now, are you ready to try this?",
    "This is the house of my friends Hengel and Anja. They don't mind me popping in here occasionally. Now, are you ready to proceed?",
    "Now, listen carefully. You've got to access the core of the tablet - where the spell is stored - so that you can modify it manually.",
    "Well done, Player! Open it up now, and modify the spell.",
    "There, that wasn't too hard.",
    "Now that you've successfully modified the tablet, you can use it to reach Zenevivia. If you stand next to me and break the tablet, I'll be able to follow you through the teleport spell.",
    "She's redecorated it!",
    "Oh dear, this isn't good at all!",
    "Zenevivia has disabled the house's safety measures. If you die in here, you'll drop most of your items and go to your usual respawn point. Your gravestone should appear in Rimmington.",
    "I can see Zenevivia in the middle of the house, but it looks like we can only reach her by going through the dungeon.",
    "She probably thinks it's more dramatic if we fight our way through her dungeon, facing increasingly tough challenges, until we finally come face-to-face with her at the end.",
    "Who knows? Zenevivia is extremely talented at both Magic and Construction, so don't be surprised if her dungeon contains things you aren't able to build yourself.",
    "Your enthusiasm does you credit, Player!",
    "I suppose so. I have a few runes. How about Falador or the Grand Exchange?",
    "Remember, there may be traps in there, and you'll drop your stuff if you die.",
    "Oh dear! Clearly, we mustn't go back in there until we've dealt with the traps.",
    "The trap was magical, not mechanical. The spell works on biological matter, carefully ignoring the dungeon monsters, so it will break if it hits something that's not-biological. Zenevivia left us access to her workshop. By combining my magical knowledge and your young fingers, we should be able to build something to disable her traps.",
    "I really couldn't say. Perhaps she liked having it near the portal.",
    "You'll need a mithril bar, 2 oak planks and either a clockwork mechanism or a steel bar. Bring them to Zenevivia's workshop and I'll show you what to do next.",
    "What? Why in the name of Saradomin's most bushy beard would you be carrying that stuff around? Actually, don't bother answering. Just use Zenevivia's clockmaker's bench to turn the steel bar into a clockwork mechanism. Then I'll tell you what to do next.",
    "I suppose so, I have a few runes. How about Falador or the Grand Exchange?",
    "Have you got the materials I told you to fetch?",
    "Good. Now, sit yourself down at Zenevivia's clockmaker's bench, and I'll tell you what to do next.",
    "Now that you've made a dummy, we can put it into the dungeon to trigger the traps. My magic will let us control it from outside the dungeon.",
    "Trigger as many traps as you can find. If you miss any, you'll risk taking a lot of damage when we enter the dungeon later. Fortunately, the dungeon monsters won't be interested in attacking our little dummy. They'll become far more active when we go in ourselves.",
    "It works!",
    "When you've finished using the dummy to disable the traps, we can enter the dungeon ourselves and fight the monsters.",
    "Do you think you found all the traps? You could get severely hurt if there are any left, and you'll drop your items if you die.",
    "Ahhh, she certainly knows how to build a dungeon! It'll be nice to see little Zinny again. I've always missed her, you know.",
    "Oh, yes. Well, at least I'll have a chance to talk to her. I want to apologize for the way things ended between us. Also, I'm different now. I used to be a young fool, seeking fame by doing impressive deeds to help people. Her ambition was to be a great fighter, and I didn't respect that. Now I'm old, and my fame is worth nothing. Apart from the Fishing Colony quest, the most fun I've had recently was robbing that bank!",
    "Oh, I think I'm old enough for people to allow me my little eccentricities. It was great fun, just the sort of thing Zinny used to love...",
    "You think so? How kind of you! Zinny would have enjoyed it so much...",
    "Actually, that gives me an idea! Maybe if I tell Zenevivia about the bank robbery, and invite her to rob the Wizards' Tower with me, she'll realize how I've changed, and she'll like me again!",
    "Perhaps. But I'd really like to try. I assure you, Player, love is worth a bit of groveling.",
    "She may not be everyone's idea of the perfect partner, but I love her, and I want her back.",
    "Oh.",
    "I think... I think I'd like to talk to her, and see what she wants to do.",
    "Yes, I imagine it will be hard to get her attention. I suppose we'll just have to try very hard to get her to listen. And don't kill her!",
    "It's her! After all these years... She doesn't seem very happy to see me.",
    "I don't think we've got time to mess around, Player.",
    "Zinny! It's so good to see you again. I couldn't believe it when Player told me he'd/she'd met you.",
    "Listen, there's something I've got to tell you-",
    "We won! Now I can tell her how I've changed since she knew me and, hopefully, she'll be willing to give our relationship another try.",
    "Thanks. Go and talk to her now.",
    "She's worth it. Now, no more of your gloom. Go and talk to her now.",
    "Zinny, I want to tell you something.",
    "Look, you know that bank robbery in Draynor Village? That was me. I stole lots of money and got this hat.",
    "I changed, Zinny. But I still love you, and now I'm a fun-loving, self-centred[sic] battle mage just like you are. Can we try again?",
    "I'm planning to rob the Wizards' Tower! Will you come with me?",
    "Greetings, Player.",
    "Yes, yes, we have. Zinny and I have decided to live here, since the other house holds unpleasant memories for us.",
    "We owe you so much for helping us find happiness.",
    "I don't think Zinny is ever going to get tired of wearing that hat.",
    "You're never going to let that go, are you? Don't worry, Player, we'll reward you soon.",
    "Yes, that's right. We used up a lot of runes in our recent altercation, and we'd like to restock. The Wizards' Tower must have plenty of runes.",
    "If you don't mind, Player, we'd like this to be a trip for just the two of us.",
    "Quite soon, I think. Go upstairs and look through our telescope, you should get quite a good view.",
    "Please step aside.",
    "We give up!",
    "Greetings Player.",
    "Indeed. Sedridor sent us a message saying that his wizards are watching us, and they'll stop us if we ever try anything again.",
    "Besides, now that we have each other, we're not so interested in getting more wealth or more items, nor going on adventures.",
    "Also, we'd like to reward you for bringing us together. We owe our happiness to you.",
    "Yes, we must reward you for bringing us together. We owe our happiness to you.",
    "I'll teach you to chip Teleport to House tablets so they go to any house portal you like. Just use a chisel on them. I might be able to unlock other destinations for you in the future, if I feel inspired to do so.",
    "Finally, we'll share some of our knowledge of Construction, Crafting, Smithing and Magic, and offer you some cash to cover your costs."
  ],
  "Bank guard": [
    "Sorry, I can't talk to you just now, due to security considerations."
  ],
  "Guard in Tree": [
    "Shhh! Pretend I'm not here!",
    "Subject is on the move!"
  ],
  "Shady stranger/Suspicious outsider": [
    "Sheesh!"
  ],
  "Miss Schism": [
    "Aaaargh! He's following you! Make him go away!"
  ],
  "(Attempting to use stairs without consulting Wise Old Man": [
    ") Wise Old Man: Before we go up there, there's something I need to say to you. [Overhead text: Wait a moment!]"
  ],
  "Archmage Sedridor": [
    "He'll be here in a moment. Elriss is sealing the Guild now. Are you all ready to fight?",
    "Um...Traiborn, were you listening?",
    "Everyone else get into position.",
    "Get back!",
    "Get back!"
  ],
  "Wizard Grayzag": [
    "I'll send him packing, never fear.",
    "Ooh! Help!",
    "Coward! Meet my army!",
    "Oh, drat."
  ],
  "Wizard Traiborn": [
    "Eh? A thingummywut? Where?",
    "A thingummywut! I told 'em!",
    "I've got a thingummywut!"
  ],
  "Wizard Mizgog": [
    "I don't think Traiborn will be much help."
  ],
  "Archmage Sedridor/ Zenevivia/ Wise Old Man": [
    "WHOAH!"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Love_Story?oldid=36206708’"
  ]
}