{
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "Not resetting the largest crate puzzleYou can discuss this issue on the talk page or edit this page to improve it."
  ],
  "Adrasteia": [
    "Ah, good. I had hoped to see you, Player. I need your help.",
    "I understand. When you have the time, please come speak to me. We are all in danger.",
    "Wonderful. Let me tell you the situation.",
    "I am soon to be crowned. It is a burden that I do not take lightly.",
    "As Basilissa, it is my duty to see that the kingdoms are protected.",
    "Right now, there is one looming threat that haunts me; that threatens us all.",
    "The Civil War is over. Bilrach won.",
    "The demons, defeated, fell in line and joined the ranks of his army.",
    "Bilrach is in a position to launch a full-scale invasion.",
    "But it is not enough. The powerful always crave more power.",
    "He greedily seeks more ways to expand his influence and cement his dominance.",
    "Even now, he gathers his forces and spreads out across the world in search of something.",
    "Lost magic? An artefact?",
    "Whatever he is trying to do, it represents a terrible threat to the rest of the world.",
    "We must stop him. We must put an end to his reign, before it begins.",
    "As you can see, while the threat of the Civil War is over, we are still not safe. Bilrach is planning something and I believe we're all in danger.",
    "Our spies have kept tabs on his forces, trying to get a glimpse of his plans. But we've learned nothing.",
    "At least, until recently.",
    "We've tracked down a contingent of Bilrach's forces sneaking into the prisons of Senntisten. We don't know what they were after, but it can't be good.",
    "Soon I will be coronated. I shall be named Basilissa.",
    "I have a duty to safeguard my people. To protect them.",
    "I do not accept this role lightly. But once I am crowned, I will not be able to face these threats directly. As a ruler I must rely on others to risk themselves on my orders.",
    "So, now, I would like to join you. This is my last chance to get my hands dirty and to stand directly before the threat.",
    "I'm no fighter, but I want to help.",
    "Are you ready to go?",
    "Great. It will feel good to get out of here for a bit. Let's go to Senntisten.",
    "The entrance to Senntisten is east of Varrock, between the lumber yard and dig site.",
    "I accept my duty and will rule with everything I have. But I'm not sure 'looking forward' to it is the right term.",
    "I've spent my entire life in education - studying Saradominist doctrine and law, the art of statecraft... everything I could possibly need to succeed my father.",
    "I am what my father made me, and I was made to rule. But I've never known anything but study, and the great, wide world has never seemed...well, greater. Or wider.",
    "I won't deny that I've wondered what possibilities lie beyond my world of scrolls and tomes. But honestly, I've lived a privileged, comfortable life with opportunities most can only dream of.",
    "Plus, I REALLY like books.",
    "Do not think unkindly of my father. He only wants what is best for me, and he believes I am best for this world.",
    "I am honoured by his trust, and grateful for all he has taught me. I shall do everything in my power to prove him right.",
    "But as my coronation looms, I feel the weight of an invisible crown. Sometimes it feels too much to bear.",
    "Sorry, I'm sure you don't want to deal with my worries. There are more pressing matters afoot.",
    "To rule as justly and as fairly as I can.",
    "Not exciting, I know, but it's the honest truth.",
    "There is much work to do here. Old grudges to patch up, ancient wounds to heal.",
    "And new threats to thwart, of course. I'm not sure I have time for long-term plans at the moment.",
    "Not until we fix a few things.",
    "He is the leader of the Zamorakian forces. A religious order bent on pure chaos. That can't be good for the world.",
    "Now that he stands unopposed by the demon army, he will turn his attention to the rest of the world.",
    "He's planning something big. All our intelligence suggests he's gathering a larger force in preparation for something terrible.",
    "Bilrach cannot be allowed to harm the innocent people of Gielinor.",
    "Okay, let me know when you are ready.",
    "Alright, we'll talk later.",
    "Here we are. Isn't Senntisten a marvel?",
    "Here we are. Isn't Senntisten a marvel? So much history. So much knowledge just buried beneath the surface.",
    "I would give anything to grab a mattock and sift through the memories of this place.",
    "But there's no time for that. Right now we need to find out what Bilrach's forces were up to here.",
    "We need to discover what Bilrach's forces were up to here.",
    "Look at it! The design is so elegant. The techniques these ancient architects used were astounding.",
    "But there's something else...Look, do you see it?",
    "Shadow magic. Expertly - and recently - wrought.",
    "I'm normally of the opinion that magic is neither good nor evil, only a tool to be used. But I can think of very few positive uses of shadow magic here.",
    "Look at their wounds! The damage is brutal.",
    "Well, someone larger than a human was here. I'd wager a good eight feet tall or so.",
    "They took something large and heavy out of here. Some ancient device perhaps? A buried object of power?",
    "Those scratch marks are deep.",
    "Okay, I can see how all of this fits together. From what I can tell, I think it went down like this...",
    "I may have indulged in a teeny bit of artistic license. But you get the idea.",
    "Alright, you got me. General Khazard isn't a murderous, cackling overlord whose hobbies include pushing puzzle blocks with his mind. But go with it.",
    "Look - when you've been buried under legislative documents for the last week, you find your own fun.",
    "Come on - that's definitely what he's saying! He's...",
    "Oh, fine.",
    "A new ritual marker? One that Zaros had been experimenting with? But why?",
    "Mahjarrat no longer need to sustain their lives with rituals. So what's it for?",
    "You're right. There's more to this puzzle. Thinking about it, what we've learned lines up with some other intelligence we've received.",
    "There were reports of strange figures seen in the Menaphos library. I'd put it aside as the data was unclear, but I think we need to investigate this now.",
    "Our next lead is to investigate the Grand Library in the Imperial District of Menaphos.",
    "We need to head to the library. Access is through that little door on the side of the pyramid, if you get lost.",
    "I love this library smell.",
    "Books!",
    "I love them so much.",
    "My most loyal and trusted friends.",
    "My paperback buddies.",
    "I've spent all day reading.",
    "It was bound to happen.",
    "I have no shelf control.",
    "I'm blinded by library science.",
    "I couldn't reach some of these books...",
    "...I had to use a shelfie stick.",
    "I wanted to visit the world's biggest library...",
    "...but it was overbooked.",
    "Libraries make shhh happen.",
    "What's the tallest building in Menaphos?",
    "The library, because it has the most stories.",
    "Bibliotherapy is a novel prescription.",
    "Sorry for all of the library jokes...",
    "I'll put them on hold.",
    "Look at this place! Isn't it neat? Wouldn't you think all these books are so... Wait, where was I?",
    "There's so much knowledge here. Walls of stories, aeons of history all pressed tightly together. I could stay here for weeks.",
    "But right now we have bigger issues to deal with. Our intelligence suggests that Zamorakian forces were sighted in this city.",
    "There are three places of interest that we should investigate. The Magister's chamber, the Soul Altar and - of course - here, in the Grand Library.",
    "My reports say Enakhra was here.",
    "Yes... The Mahjarrat do have a way of crawling out of the woodwork, don't they? The question is why? What was she looking for?",
    "According to her dossier, she's not a subtle creature - even for a Zamorakian.",
    "Apparently she holds scholars in particular contempt, and has been known to wilfully damage books.",
    "Reprehensible. But perhaps we can look for any damaged books as clues.",
    "Hopefully the librarians can repair any damage she caused.",
    "Our intelligence agents reported seeing someone scouting the area. What they were looking for we don't know.",
    "The Magister's chamber is a place in the dungeon of Sophanem. It's where a powerful necromancer can be found.",
    "Perhaps they were looking to recruit him? Seems unlikely, but we should investigate anyway.",
    "I'm not keen on anyone dealing with something like that. I know soul runes aren't actually stolen human souls, but still, unpleasant.",
    "But the Zamorakians messing around with it can't be good. Our intelligence suggests some sort of monster was seen breaking in there.",
    "Exaggeration most likely, but we should take a look around just in case.",
    "Enakhra isn't subtle. She apparently just waltzed in here and began looking through books.",
    "It should be easy enough to find what she was looking at and what books she might have taken.",
    "My reports say the Zamorakian Mahjarrat Enakhra was here, and thanks to your clues, I think I know what she was looking for.",
    "Hopefully the librarians can repair the books she damaged.",
    "They're investigating the Teragardian Magister? Why?",
    "They were my father's people. Long before he became a god. He rarely spoke of them, though.",
    "We don't know a great deal about them, but we do know that they had great insight into the manipulation of mortal souls.",
    "Quite.",
    "Hmm. Why are they interested in Amascut and her corruption?",
    "May I see?",
    "Huh. Verbose, but well argued.",
    "It's a theory about what happens when souls are 'devoured', as common parlance would have it. Crucially, the various ways they might empower the devourer...",
    "Necromancy. It's a staple of the Zamorakian forces, so why do they need to read up on it here?",
    "No, I don't think so. This is more of a discourse on what it means to be undead, what happens to trapped souls... Terrible, really.",
    "Indeed. And I don't like it.",
    "I think I'm starting to see a pattern. We should investigate somewhere else.",
    "Well, it doesn't look destroyed, which is good, and they haven't taken the soul obelisk.",
    "Still, let's look around and see what we can find.",
    "I think we've found everything out of place here. Let's look for more clues elsewhere.",
    "Look at these. You don't often see bones that are so strongly imbued with magic.",
    "Necromancy.",
    "They broke a bit off the soul obelisk? But why? Surely they'd want the whole thing?",
    "Both of those ideas are plausible. And terrifying.",
    "Hmm, this seems to be the lingering residue of some powerful magic. Not normal rune magic either.",
    "Yes. Let's be careful.",
    "I think that's probably everything we're going to find here. We should look somewhere else.",
    "Well this place is disturbing. I'm not sure what I expected, really.",
    "I don't see any obvious damage or Zamorkian interference. Let's look around.",
    "I think we've found everything of note at the Soul Altar. Let's move on.",
    "Look at these. There was some sort of struggle here. Look at the depth of the groove. Someone powerful did this.",
    "Wait, this damage looks recent. It looks deliberate. Are those claw marks?",
    "Were they taking a piece of the Soul Altar? But why?",
    "Hmm, I'm beginning to get a better sense of what went on here. I think we've got enough from here. We should investigate elsewhere.",
    "Okay, I've been thinking through everything we've found.",
    "I'm going to need your help to re-enact what happened. So you have freedom of movement, I'll happily get an aide to run everything you're wearing and carrying to your bank.",
    "Lovely. This is what I've got so far...",
    "I don't like this, Player. From what we've found, it seems that the Zamorakians are researching soul magic and necromancy.",
    "That sort of power is invariably misused. But when you add in the ritual marker they stole from Senntisten... the big picture starts to get even scarier.",
    "Come on. Let's return to Falador and see if we can plot our next move.",
    "We should head back to the throne room in Falador.",
    "Meet my intelligence agent.",
    "No, Trindine. You will not insult us here, in my throne room. Unless you want to see the sunrise tomorrow through a barred window.",
    "Why are you here, Trindine?",
    "Well, we can't smuggle any Daemonheim armour out from the dungeons. So we need to think of a new way to get a disguise.",
    "Perfect. Player, let's see if we can find that ore and get ourselves a disguise.",
    "For both of us, we're looking at 28 argonite ore to smith what we need.",
    "Of course I am. I can't very well let Player have to deal with everything on their own.",
    "I think we should go before Trindine somehow makes this more awkward.",
    "Are you ready to go?",
    "Okay, let's go!",
    "We need to find the argonite ore that's emerged from the surface near Daemonheim. According to the directions Trindine gave me, we're about [number] paces away.",
    "Somewhere in the south-east Wilderness near the Daemonheim peninsula, I would expect.",
    "We need [number] more ore.",
    "Okay, let me know when you are ready.",
    "There's no reason for me to go back up there.",
    "That looks somewhat like argonite ore to me. Let's get to work. I'll keep hold of the ore for you just in case anything happens in the Wilderness.",
    "We need [number] more ore.",
    "That...looks like hard work.",
    "I've not seen that metal before.",
    "You know, for science.",
    "Could you save me a bit",
    "Let's hurry. Don't want to be noticed.",
    "Nearly there.",
    "Good yield from these rocks.",
    "Good work - keep going!",
    "That looks like enough ore to me. There's a furnace to smelt this ore in the gargoyle-infested ruins between the Wilderness Crater and Daemonheim.",
    "I have no idea what you could do with that.",
    "You'll need to smith all the ore into bars, so we can make the outfit. I'll keep hold of any bars you make to keep them safe.",
    "This metal has some fascinating properties.",
    "Melting point around 1032...give or take.",
    "Mind you don't burn yourself.",
    "Could you save me a bit",
    "Let's hurry. Don't want to be noticed.",
    "Nearly there.",
    "Good yield from these rocks.",
    "Good work - keep going!",
    "It... It's almost relaxing to watch.",
    "Should make for some sturdy armor",
    "We should keep a low profile and smith our outfits near where recruitment is taking place. I think there's an anvil near the Mage Arena. We should use that.",
    "Wilderness monsters get nastier the further north we go. A safer route to the deepest wilderness is to pull a lever south of Edgeville, near the Slayer master.",
    "If the rumours I've heard are true, that lever should teleport us to a deserted keep, east of the Mage Arena. The anvil should be north then west of there.",
    "Now we need to smith the bars into disguises for the two of us.",
    "We'll each need a full set of armour. You should smith a platebody, helm, gauntlets, boots and platelegs for yourself.",
    "I'd like a helm, a chainbody, a plateskirt, gauntlets and boots, please.",
    "Ooh, throwing knives. Make me throwing knives.",
    "Not even a little bit.",
    "Sounds like a plan.",
    "If you lose anything you've made, come chat to me. I'll keep an eye out for...things.",
    "This is a pickaxe?",
    "Ah well, it's mostly for show anyway. I'm not really much of a fighter. I'll be relying on your skills there.",
    "Well, regardless, thank you. I'm going to head to the Mage Arena now and try out this disguise. I'll meet you there.",
    "I wish there was something I could do to help. But I'm no fighter.",
    "Bilrach didn't think to inspect the marker before his ritual, and it cost him dearly.",
    "He sought the power he felt was owed to him.",
    "He dreamed of draining souls from across the world, becoming unrivalled in his power.",
    "In a world without gods, he would rule without opposition.",
    "Unrivalled. Untouchable. But it was not to be.",
    "Your sabotage turned the power Bilrach summoned into the marker against itself.",
    "Magic surged until the structure could contain it no longer.",
    "In a great thunderclap, the marker exploded, shattering across the Wilderness like a bad dream.",
    "The power contained returned to the dirt and the soil. The shards of soul it harnessed returned to the underworld to await their afterlife.",
    "Bilrach had failed. His plan ruined. His dreams of glory shattered like the marker.",
    "In one act of sabotage, the world was safe once more. None even knew they'd been at risk.",
    "Bilrach's army remained. It was still a threat. Still a terrible danger.",
    "But the infallibility of his leadership was gone; his authority lost, like his dreams of dominion.",
    "We did it! We stopped his evil scheme. I never doubted you, though I wasn't sure I would be any help. But we did it.",
    "Oh I don't know; we saved the souls of half the human kingdoms. I think it's a good adventure to end on.",
    "Oh. I thought we worked well together.",
    "Regardless, this is the last time I can really be out in the field like that.",
    "Soon I will be crowned as Basilissa and will have no more time for such adventures.",
    "I shall enable others to become heroes. I shall use my power to lift them up and let them save the world.",
    "A far better use of my time.",
    "Though we have to actually have the coronation first. I never knew how much organisation goes into one of these.",
    "We have guests coming, dignitaries from all the human kingdoms. Each of them needs to have a seat at the table and each one of them thinks they're as important as the last.",
    "I have to try and place them all on the head table, for the banquet, but it's much more of a headache than I expected.",
    "I'd really appreciate it, but are you sure? It's not exactly saving the world.",
    "As always, your help is welcome. Though I apologise if you start to look back fondly on the world-ending threats after talking to these dignitaries for a few minutes.",
    "There are times during diplomatic meetings I have longed for an apocalypse.",
    "There are four dignitaries and only four seats at the table. The table is long and sits at the top of the room, with all guests on it facing the same direction, out to the crowd.",
    "As Basilissa I am seated in the middle and the other guests are seated around me.",
    "Sounds simple right? People can just sit either side of me?",
    "Wrong! If we sit people in the wrong place, it might offend them, or they might conflict with their neighbour.",
    "The slightest mistake and we could turn dinner into a diplomatic disaster!",
    "So no pressure or anything.",
    "Have a chat with each of the guests and see if you can work out where they should be seated.",
    "When you're happy with your decision, come and speak to me.",
    "How is it going?",
    "We need to work out the seating plan for the ambassadors. It might sound silly, but the wrong person in the wrong place could spark a diplomatic incident.",
    "Wars have been started over the wrong person saying the wrong thing in the wrong ear. So we need to be careful.",
    "Everyone will be seated on a single table facing out in the same direction. There will be two places to my left and two places to my right.",
    "All you need to do is talk to the ambassadors and work out which are the right places to put each of them in.",
    "When you've decided on your order, come back and talk to me.",
    "Excellent, I'd love to hear your thoughts. Let's start with who will sit furthest away from me on my left.",
    "I understand, it's a difficult decision to make. Why not go and talk to them again to see if you can work out the best way to seat them?",
    "Great, what about the person nearest me on my left?",
    "I think you confused yourself. That's the same person in two seats. Maybe take a minute and come back to this with a clear head. I know it's a headache, believe me I know.",
    "I think you confused yourself. That's the same person in two seats. Maybe take a minute and come back to this with a clear head. I know it's a headache, believe me I know.",
    "I think you confused yourself. That's the same person in two seats. Maybe take a minute and come back to this with a clear head. I know it's a headache, believe me I know.",
    "I think you confused yourself. That's the same person in two seats. Maybe take a minute and come back to this with a clear head. I know it's a headache, believe me I know.",
    "I understand, it's a difficult decision to make. Why not go and talk to them again to see if you can work out the best way to seat them?",
    "Now, what about the person furthest from me on my right?",
    "I think you confused yourself. That's the same person in two seats. Maybe take a minute and come back to this with a clear head. I know it's a headache, believe me I know.",
    "I think you confused yourself. That's the same person in two seats. Maybe take a minute and come back to this with a clear head. I know it's a headache, believe me I know.",
    "I think you confused yourself. That's the same person in two seats. Maybe take a minute and come back to this with a clear head. I know it's a headache, believe me I know.",
    "I think you confused yourself. That's the same person in two seats. Maybe take a minute and come back to this with a clear head. I know it's a headache, believe me I know.",
    "I understand, it's a difficult decision to make. Why not go and talk to them again to see if you can work out the best way to seat them?",
    "And the last seat?",
    "I think you confused yourself. That's the same person in two seats. Maybe take a minute and come back to this with a clear head. I know it's a headache, believe me I know.",
    "I think you confused yourself. That's the same person in two seats. Maybe take a minute and come back to this with a clear head. I know it's a headache, believe me I know.",
    "I think you confused yourself. That's the same person in two seats. Maybe take a minute and come back to this with a clear head. I know it's a headache, believe me I know.",
    "I think you confused yourself. That's the same person in two seats. Maybe take a minute and come back to this with a clear head. I know it's a headache, believe me I know.",
    "I understand, it's a difficult decision to make. Why not go and talk to them again to see if you can work out the best way to seat them?",
    "Hmm, no, that seems wrong somehow. Maybe chat with them again and see if you can find the best positions for everyone.",
    "Oh yes, that sounds perfect! Are you sure you want to be an adventurer, Player? You'd be great as a diplomat.",
    "Well, adventuring suits you. Right, it's time. I'm ready. Are you ready? Maybe I'm not ready?",
    "Saradomin's light, it's really going to happen, isn't it? I'm going to become Basilissa.",
    "I was, I AM, it's just... well, it's real now, isn't it? Not just a phrase, not just a future thing. It's here. It's now.",
    "No, I'll be fine. It's probably good that I'm nervous. As I think anyone stepping into a position such as this should be.",
    "I have the weight of so many lives in my hands now. I need to make sure I treat the role with the gravity it deserves.",
    "Just, promise me one little thing, okay? When I'm this big, powerful, empress. Come say hello from time to time?",
    "Thank you. I know it sounds silly, but that means a lot. It's going to be difficult to find real friends when I'm wearing that crown.",
    "Oh, yes, I suppose you're right. Keep the heroes away from the political, that makes sense. Still, I will miss having you around my friend.",
    "Right. There's no point putting this off any longer. It's time to face destiny.",
    "My people, it is a heavy responsibility to wear this crown. To bear the burdens of serving you. But I do so not with fear, not with glee, but with tremendous love for you all.",
    "As I have walked the cities, I have seen compassion, joy and kindness at every corner. I have seen the bravery of everyone from the armoured knight to the tireless shopkeeper.",
    "I have visited worlds made of crystal and and seen stars made of music, but in all my travels I have never seen anything as wonderous as all of you.",
    "I promise that I shall do everything in my power to keep you safe. Everything I can, to make your lives just a little bit better each and every day.",
    "I cannot do this alone, but I know that I am not. For just as I stand with each of you, so do I know, in my heart, that you all stand with me.",
    "Thank you. Thank you for letting me bear the burden of this crown. I will try my best to live up to it.",
    "Thank you, thank you all. I have no words for a speech. What words could possibly convey the gratitude I feel right now? For your respect and your love?",
    "There is a song that is sung on Hallow. It is memorised and passed on from parent to child. Each time we add our own voice to it, to change it and make it part of a living story.",
    "I would like to share mine with you all. As the story now grows with you.",
    "Almighty Saradomin",
    "Welcome a new dawn on this horizon",
    "Almighty Saradomin!",
    "Come my divine spirits to glory",
    "Goodbye.",
    "We are the holy light Strength of a burning sun Heroes of Gielinor",
    "Look to the sky Hope never dies",
    "Come, do not be afraid The light shall be your guide The sun shall conquer all",
    "Look to a star Call it a name",
    "Gaze to the light Defeat the night Beacons of hope and fire",
    "Strike down the dark Come make your mark Be the righteous and the hope",
    "Open your power from within",
    "This is our song of hope and dreams",
    "My spirits of this land",
    "This sunset will open a new age",
    "Almighty Saradomin",
    "Welcome a new dawn on this horizon",
    "Almighty Saradomin!",
    "Come my divine spirits to glory",
    "Something worrying. I'll have our...my spies investigate. Perhaps it was nothing, just a random convergence of magical energies. But I suspect not.",
    "Not a terribly auspicious start to my rule.",
    "But it's done. I am Basilissa now and all that comes with that. You would not believe the paperwork I have to complete.",
    "It was wonderful, being on this last adventure with you. We will work together again - often, I hope - but perhaps not in quite the same way again.",
    "It was an honour to stand beside you. To fight beside you. Even if I did only have a pickaxe.",
    "Thank you, Player. The world doesn't tell you that enough, so let me tell you again. Honestly, and with everything I have, thank you.",
    "I appreciate your support in these challenging times, Player."
  ],
  "Player": [
    "Haven't you ever wanted to follow your own path?",
    "The light...it's refracting...almost as if it were shying away.",
    "The question is...what was it used for?",
    "Whoever did this was large and dangerous. We should be careful.",
    "Probably in heavy armour, too, given the depth of the print.",
    "Looks like it took a huge effort. Whatever it was, it must've been worth a great deal to them.",
    "They must've dragged something huge out of here.",
    "Hang on. Adrasteia, are you sure this is what happened?",
    "If General Khazard behaved this way, his guards wouldn't remain loyal to him.",
    "'Oops'? Adrasteia. For the love of Guthix. I don't think you're taking this seriously.",
    "If Khazard was this petty and cruel, he'd be poisoned by his own soldiers within the year.",
    "Why are you like this?",
    "*Sigh* Really?",
    "Whatever the reason, Bilrach seems like he'll go to any lengths to get this thing. There's something we're missing.",
    "Enakhra?",
    "What do you know about the Teragardians?",
    "Sounds like something a Zamorakian Mahjarrat could have any number of uses for.",
    "This passage here... Something about devouring souls? I only know about half the words.",
    "So one of Bilrach's cronies was after information on how souls are consumed and used? Great.",
    "Are they looking for new techniques and rituals?",
    "Sounds like they're branching out from their usual tricks, then?",
    "Feels...cold. Like everything's coming to an end...",
    "Could they be trying to figure out how it works? Or using it to make something else?",
    "Hmm, touching the obelisk merely lowered those purple barriers. I guess the Magister is indisposed.",
    "They must've been powerful to do this.",
    "Hello, cat. I don't suppose you saw what happened here?",
    "Cryptic, but not particularly helpful.",
    "How am I able to understand you? I'm not wearing my amulet of catspeak.",
    "Are you wearing an amulet of humanspeak?",
    "Kindly remind me what you saw happen here.",
    "Trindine. What are you doing here?",
    "You trust Trindine's information?",
    "Repeatedly and at length. You're lying right now by pretending again to be Anne Dimitri.",
    "A little help would be nice once in a while.",
    "I mean... I am useful...",
    "Do we need weapons?",
    "Can you use throwing knives?",
    "Let's pick something else, then.",
    "I'll make myself a kiteshield and a battleaxe. Seems to be what all the cool Daemonheim recruits are wearing this season.",
    "I'll make you an axe with what's left over.",
    "Oh, I only have one bar left. That's not enough for Adrasteia's battleaxe.",
    "Eh, that'll do.",
    "I didn't have quite enough bars to make you a battleaxe. So I made you this instead.",
    "Right! It's still an axe and it'll do some decent damage.",
    "Let us prove ourselves.",
    "That's...not a question.",
    "Magic, then?",
    "I see it. Those patterns...made by someone's heels?",
    "Imagine the possibilities. You could consume magical spells. You could eat curses; unravel ancient enchantments.",
    "What?",
    "Can't what? You need to tell me what you've worked out.",
    "There's a cave beneath the Mage Arena. Would that do?",
    "I'm not carrying anything I could offer.",
    "I should open this near Bilrach's device where I can put it to use.",
    "It'll slip through my fingers like this.",
    "I'm not carrying anything I could use on this.",
    "I'm not carrying anything I could use on this.",
    "Is that safe? For us, I mean.",
    "I'm not carrying anything I could use on this.",
    "I'll meet you back in Falador castle. Good luck!",
    "We make a good team. It's a shame this will be your last adventure.",
    "You were useless. It was all me.",
    "Can I help?",
    "It will be a nice break from the world ending struggles. Sure, I'll help.",
    "I'm good.",
    "I thought you were ready for this.",
    "Do you want to back out?",
    "What was that?"
  ],
  "Found clue": [
    "[number]/5.",
    "[number]/5.",
    "[number]/5.",
    "[number]/5.",
    "[number]/5.",
    "[number]/5.",
    "[number]/5.",
    "[number]/5.",
    "[number]/5.",
    "[number]/5.",
    "[number]/3. Total: [number]/9.",
    "[number]/3. Total: [number]/9.",
    "[number]/3. Total: [number]/9.",
    "[number]/3. Total: [number]/9.",
    "[number]/3. Total: [number]/9.",
    "[number]/3. Total: [number]/9.",
    "[number]/3. Total: [number]/9.",
    "[number]/3. Total: [number]/9.",
    "[number]/3. Total: [number]/9.",
    "[number]/3. Total: [number]/9.",
    "[number]/3. Total: [number]/9.",
    "[number]/3. Total: [number]/9.",
    "[number]/3. Total: [number]/9.",
    "[number]/3. Total: [number]/9.",
    "[number]/3. Total: [number]/9.",
    "[number]/3. Total: [number]/9.",
    "[number]/3. Total: [number]/9.",
    "[number]/3. Total: [number]/9.",
    "[number]/4.",
    "[number]/4.",
    "[number]/4.",
    "[number]/4.",
    "[number]/4.",
    "[number]/4.",
    "[number]/4.",
    "[number]/4."
  ],
  "General Khazard": [
    "Move, you slovenly dogs! What am I paying you for? I don't want to be here any longer than I need to.",
    "We are right on the edge of one of their biggest and nosiest cities. Even these fools will work out something is up soon.",
    "Now hurry up and find the artefact!",
    "What did I say? You were supposed to move the largest crate out of here, first and foremost!",
    "It contains a unique artefact. A ritual marker created by Zaros himself.",
    "An ancient marvel, yet here it sits unmoved like all this other cargo. Am I talking to myself?",
    "The ritual marker is of paramount importance to Bilrach. It must be in the ritual circle to activate his portal.",
    "Heavy enough to crush you where you stand.",
    "Honestly, where do they find these feckless hicks?",
    "We've wasted enough time here. I'll move the largest crate onto the ritual circle myself.",
    "Alas, only the largest crate is heavy enough to flatten these fools.",
    "Actions have consequences.",
    "Oops.",
    "Help. Police. Murder."
  ],
  "Khazard guard": [
    "But the biggest crate is the heaviest, general.",
    "Have mercy!",
    "Nooo!",
    "We should've unionised!"
  ],
  "Ka": [
    "I see many things.",
    "It is not the way of cats to be helpful. But I suppose I can make an exception.",
    "There was a beast that arrived here. Tall and dark and stinking of dog.",
    "It argued with a man who stank of death. He was injured and bleeding but seemed to only inconvenience him.",
    "There was a woman made of metal with him. She was filled with shadows and hatred. Her spirit was made of knives.",
    "They did something to the altar, but I didn't stick around to see exactly what.",
    "Maybe I'm wearing an amulet of humanspeak.",
    "No. Icthlarin made it so everyone here can understand me without a catspeak amulet.",
    "I have this strange feeling of deja vu. Haven't we discussed this before?",
    "Anyway. Anything else?"
  ],
  "The Magister": [
    "There is nothing for you here. You are no master of the arcane arts. You reek of death, but I do not sense the Underworld upon you.",
    "Though there is a shadow. A darkness that lingers within you that is not quite your own.",
    "And if I don't?",
    "Is this where you threaten me with death, little warrior? Because I have overcome that problem.",
    "And who is your commander? Are they too cowardly to face me themselves?",
    "No. No, I don't think I will. Leave this place while I still allow it.",
    "Enough. Enough! I yield. I yield."
  ],
  "Vengeance": [
    "I am not here for you to study. You will give me the knowledge that I want.",
    "You will.",
    "You will wish you hadn't. Enough posturing. I am here for the secrets of that soul obelisk. My commander would know how it works.",
    "Too busy. You are not as important as I'm sure you believe yourself to be. My commander has other things that demand his attention.",
    "You will deal with me.",
    "The arrogance in this world astounds me. Around every corner, every street, there are people who believe themselves above it all.",
    "Nobles who believe that happenstance of their birth elevates them. Mages who believe their magic is more important that[sic] a carefully learned trade.",
    "Adventurers calling themselves a 'World Guardian' because they were in the right place at the right time.",
    "You all bring bile to my throat. So, let me show you. Let me prove to you just how small you really are.",
    "I have no spells, nor fancy enchantments. No demon pacts guide my hands.",
    "Let me show you what one woman can do with a blade, a shield and a lifetime of rage burning inside her.",
    "Of course you do. Now, you will tell me of this obelisk and about the power of souls.",
    "Then you will meet my associate, Jerrod, and you will learn just how merciful I have been.",
    "Go no further. Let me look at you.",
    "Hmm. The armour is sloppily equipped. You lack the stance of a soldier. But there's potential at least.",
    "You on the other hand. You look nothing like a soldier.",
    "Too many of you think that's enough. That war is just swords and bloodshed.",
    "But war is discipline. War is practiced. War is when you take a knife and slowly insert it into their liver rather than chop off their head.",
    "So you have the patience for war? Do you have the resolve?",
    "Very well. Answer me this...",
    "You stand in a field. The weather is crisp and the grass blows freely. There is a girl in front of you and a sword in your hand.",
    "The response of a murderer; not a warrior. Why do you stab her? You have no reason, other than a blade in your hand.",
    "That is not the mindset of a soldier. Be gone from here. You are not who we seek.",
    "The response of a fool; not a warrior. Perhaps she is a scout? Perhaps she is your target? You lack information and now you have no purpose.",
    "That is not the mindset of a soldier. Be gone from here. You are not who we seek.",
    "Yes. An easy answer, I confess. But it separates the monsters from the hopefuls.",
    "A soldier is part of the machine. A cog in the system; not the system itself. A warrior wins battles. A soldier wins war side by side with other soldiers.",
    "Knowledge is power and discipline gives us strength.",
    "A child's interpretation. Zamorak promotes freedom, not chaos. Though to those holding the chain, the two can seem the same.",
    "So let me ask you another question.",
    "You have been told to hold a location. It is far from the battle and of little strategic importance.",
    "As you stand there, you spot an enemy scout limping away from you, a missive in her hand.",
    "Good. The location lacks strategic value. That missive could alter the war.",
    "A soldier needs discipline, but a soldier that lacks initiative is no better than a golem. And golems need neither food nor sleep.",
    "Perhaps there is a place for you here. One last question.",
    "Kill your friend.",
    "Is it not? I am your commanding officer. I have told you to kill her. What will you do?",
    "Then you would die. I have little use for dead soldiers.",
    "I have no use for idiots. Go.",
    "Blind obedience has its place, but when it weakens the war effort, it is misplaced. I have given you no reason to kill her. She has committed no crime. Broken no oaths.",
    "But now we would be down a soldier and I would know that you have no loyalty. Wars are won by the bonds we have with one another. Loyalty is stronger than any steel.",
    "You would betray a friend on the random whim of a stranger. I have no use for traitors. Go.",
    "Good. I gave you no reason to kill her, except my whim. It is right to refuse until I give you a real reason.",
    "As soldiers, we are bound together by our loyalty. A shared vision and the absolute knowledge that we are there for one another.",
    "By refusing to kill her without reason, you prove you're willing to stand up for your fellows. I can use this.",
    "Welcome to the recruitment trials. They will not be gentle, but if your blade is as strong as your mind, then perhaps you will prevail.",
    "Perhaps.",
    "You've shown you have a temperament we can use. Now let's see if your blade is as sharp as your mind.",
    "You will be challenged against several waves of our soldiers. Starting you with the weakest, we'll see if you have what it takes to join the elite ranks.",
    "Failure will mean your death. If you have any pieces of unfinished business with friends or family, now is the time to resolve them.",
    "Are you ready?",
    "Very well. Let us begin.",
    "There is no shame in being prepared. Return to me when you are ready.",
    "Did you think all the answers would be the same? That you need only parrot obedience?",
    "No. A soldier needs to show they have what it takes to make a judgement call. If we wanted mindless watchmen, there are more efficient methods.",
    "You do not have what we are looking for. Go.",
    "And if it misses? They are aware of you. If you hit them, you still need to leave your spot.",
    "And what if the letter is encrypted? What information may they know of our enemy's operations?",
    "Murder passes the time and sometimes it has its place. But wars are won via information, not bloodshed.",
    "You do not have what we are looking for. Go.",
    "Passable. You have defeated the weak and the feeble. Perhaps you are not completely useless. But let's see how you fare against real warriors.",
    "Good. You are proving yourself to be quite the asset. But now let us see how long you can stand against a real threat.",
    "Excellent. You are a skilled warrior. I commend and salute you. Perhaps in time you will stand beside me in the Officer's Mess.",
    "But for now, we must all climb the ranks. Go and meet your fellow soldiers. You've earned a rest.",
    "Welcome to the army. Together we shall build a better world. Free from the chains of our oppressors.",
    "..."
  ],
  "Anne Dimitri": [
    "You took your time.",
    "Come now. I'm hurt. When have I ever lied to you?",
    "This is just a costume; hardly a lie. Lies are much more fun. Besides, I've no reason to lie about any of this.",
    "You think I have anything to gain by keeping the Zamorakians' secrets? They're as much a threat to the followers of Zaros as they are Saradomin's stooges.",
    "Ah, there we are. A little backbone. Good. That's what I want to see. Can't have the future ruler be a pushover.",
    "The same reason I always am. I have information. Specifically, I have information about Bilrach and his army.",
    "There's soldiers, in Daemonheim equipment, gathering in the Wilderness. At the Mage Arena, to be precise.",
    "They're recruiting.",
    "If I were you, I'd think about getting someone there on the inside. Daemonheim armour is very slimming and in fashion this season.",
    "It also has the added advantage of completely hiding your face. Anyone could sneak in among those recruits. Anyone.",
    "Luckily for you, I've tootled around the Wilderness a fair bit recently and I might have something to help you there.",
    "While I was out watching Team Chaos murder one another for stupidity's sake, I spotted a couple of places where Daemonheim ore had found its way to the surface.",
    "There's some veins of argonite that've somehow found themselves pushed to the surface near the Daemonheim ruins.",
    "Mine yourself some of that and then a little elbow grease in a smithy will sort you a disguise out lickety-split.",
    "Wait! You're going with them? Seriously? You?",
    "Why not? Everyone else does. Your father always did. My father always did. I always do. They like it. Makes them feel useful.",
    "Oh, don't try and do the whole humble modesty nonsense. You enjoy being the solution to everyone's problems. Makes you feel useful.",
    "Of course you are, sweetcakes. You're invaluable.",
    "Oh, I absolutely can.",
    "But I'll save that for later."
  ],
  "Adrasteia the Forgotten": [
    "You need to fully disguise yourself in argonlike armour, or we'll arouse suspicion.",
    "We'll arouse suspicion if we bring in anything other than our disguises. I can get someone to run anything else you're carrying to your bank.",
    "Looking good. Well, as good as one gets in Daemonheim armour. Are you ready to infiltrate the Mage Arena?",
    "We need to find the recruiter and convince them to let us join.",
    "See if you can spot someone that looks like they might be in charge.",
    "I may not have been conscripted, but I can fight.",
    "I thought Zamorak was all about chaos?",
    "Thank you for refusing to kill me. I would've found that most inconvenient.",
    "The 'recruitment trials' she mentioned sound suspiciously like a trial by combat. I hope you're ready for this.",
    "As much as I'd be a danger to myself and others, I'm starting to wish I'd insisted on throwing knives!",
    "Well done. I'm sorry I wasn't much help. I'm not really much of a soldier. Besides all I had was this pickaxe.",
    "Anyway, now that we're here, we should look around for clues to Bilrach's big scheme.",
    "There must be a reason he chose this place to set up his army.",
    "Likely bluster, but it's disturbing if it's true.",
    "Yeah, I don't think we want to listen to any more of that.",
    "Still, they took a prisoner. That means Bilrach needs something from someone. Someone from here. The question is whom and why?",
    "No normal fire could have left these marks.",
    "Yes. And powerful magic at that.",
    "Someone was dragged away here.",
    "I'm inclined to agree.",
    "Okay, so looking at all the evidence, I have a pretty good idea of what was going on here...",
    "Bilrach was here and he wanted something from the most powerful mage present, Kolodion.",
    "That's what the evidence suggests. Bilrach wanted Kolodion because Kolodion knows a fascinatingly unique magical ability.",
    "Of course, Bilrach is likely only thinking of the military implications of it all.",
    "...",
    "Oh no!",
    "The pieces, they're all falling into place. By the Light, it's horrible. He can't... He CAN'T!",
    "The ritual marker, the soul obelisk and now this. Bilrach is looking to consume vast amounts of magical power. Vast amounts of anima.",
    "If he performs the right ritual, with all those components, he could consume half the souls in the human kingdoms.",
    "We have to stop him!",
    "We need to find the ritual marker - that's the focus.",
    "We need to find it and sabotage it. Somehow. Put a stop to this madness.",
    "I'll be somewhere nearby. Somewhere reasonably secure and safe from prying eyes.",
    "Perfect. We should leave here and give that a look. Hopefully it will be there and we can work out what to do next.",
    "Come on. Let's get out of here and search the nearby caves. One of them should lead to the underside of this arena.",
    "We need to find the ritual marker and put a stop to Bilrach's madness.",
    "By the stars. Look at it. If it wasn't such a nightmarish abomination, I'd be almost impressed.",
    "The blasphemous union of Teragardian soul sorcery, Kolodion's thaumaphagic[sic] secrets, and all of it wrapped around a modified version of the Mahjarrat ritual marker.",
    "No one should be allowed to use this. We have to destroy it.",
    "The good news is that something like this is going to be incredibly unstable. Three alien magical techniques working together is a recipe for catastrophe.",
    "We should look for ways we can rig all these effects to turn against one another.",
    "What's in that pouch? Open it and take a look.",
    "Sometimes, a container is just as useful as what it once contained.",
    "Is there a way to break that rune down a bit? Make it into smaller pieces? I can imbue them with magic to make them more volatile, but they'd need to be smaller if we're going to hide them.",
    "I'd use my pickaxe but, well, I have no experience in mining. I'd rather not injure us both. Maybe there's something else sharp in this cave you could use?",
    "I don't think it's useful like that. Maybe you can do something to it?",
    "That reminds of a fairy tale my father used to read to me.",
    "Something about painting roses a different colour, so a nasty queen wouldn't explode with rage.",
    "Okay, give me a moment.",
    "There. I've infused them with an abundance of magical charge. They just need a sudden influx of magical energy and then well - cover your ears!",
    "Careful there. That's likely to explode with very little provocation.",
    "Bring the pieces to me. I can imbue them with some volatile magic to make them a little more dangerous.",
    "Not remotely!",
    "A bit obvious, but I can see where you're going with that. If enough magic were flowing into those runes, they might explode.",
    "Is there a way to break that rune down a bit? Make it into smaller pieces? I can imbue them with magic to make them more volatile, but they'd need to be smaller if we're going to hide them.",
    "I'd use my pickaxe but, well, I have no experience in mining. I'd rather not injure us both. Maybe there's something else sharp in this cave you could use?",
    "That white dust isn't explosive. You'll have to find something else to sabotage the device.",
    "They won't do anything like that. Here, give them to me. I have an idea.",
    "Alright, that should have an unpleasant side effect once they start their ritual.",
    "Problem is our sabotage is a bit obvious at the moment. We need to disguise those volatile rune fragments.",
    "Good thinking, but for that white dust to conceal what we've done, we need some way to stick it to our explosives.",
    "Is there a way you could wet the pouch of white dust?",
    "Perfect! That's going to be a surprise they won't quickly forget.",
    "Come on. We'd better get out of here before they start looking for saboteurs.",
    "Let's split up to make it easier to escape."
  ],
  "Wave 1": [
    "Defeated [number]/4.",
    "Defeated [number]/4."
  ],
  "Wave 2": [
    "Defeated [number]/4.",
    "Defeated [number]/4.",
    "Defeated [number]/1."
  ],
  "Wave 3": [
    "Defeated [number]/1."
  ],
  "Defeated forgotten archer": [
    "Did you see that?",
    "When the mages attacked that Kolodion person.",
    "It's like their spells just fizzled out. Like he was eating them.",
    "That's what I saw!",
    "They threw great spells at Kolodion and then...",
    "Phwoomf! Nothing."
  ],
  "Defeated forgotten warrior": [
    "See what?",
    "That's nonsense."
  ],
  "Defeated forgotten mage": [
    "It's not normal, I tell you. Taking prisoners.",
    "Well, when you defeat a foe, you kill 'em, right?",
    "Honourable thing to do an' that."
  ],
  "Defeated necrolord": [
    "Why's it not normal?",
    "Yeah, but not if you want to get info from them.",
    "That's when you need to get the pointy things out."
  ],
  "Kolodion": [
    "Here to compete in the arena, Mahjarrat? I thought your lot were above this sort of thing.",
    "Oh? Do you want my cheesecake recipe? Because I'll never share it.",
    "Or perhaps, you're looking for my secret hide-and-seek spot? It's much less interesting than you think.",
    "We find our joy where we can, I suppose.",
    "I don't know what you mean...",
    "Ah, I'm sure you would. I'm sure you would. But this secret has been mine for too long for me to just give it away.",
    "What would you give me in return that could match the power and knowledge I possess?",
    "Money? What use do I have for money? Wealth is a fool's game. No, I want power. Absolute and unmistakable.",
    "I want a kingdom. Promise me Asgarnia and in return I will give you what you seek.",
    "Quite the fair trade, I think.",
    "Then we're done here. I will not share my secrets for anything less.",
    "Enough! I-I yield. Please."
  ],
  "Bilrach": [
    "I am not here for your petty tasks, wizard. I am here for your secrets.",
    "Does everyone get bored of your pointless wittering? It must be a lonely existence.",
    "Then I will be happy to return you to your solitude. Just as soon as you tell me the secret of absorbing magic.",
    "No games, wizard. I have seen you defeated time and time again by weakling magicians with a fraction of your power.",
    "I have watched as the strands of magic around their spells wither and die at your touch. Consumed as you feign defeat.",
    "I would know this secret.",
    "I am no mindless villain, Kolodion. The price will be fair. You can name your weight in gold, or gemstones.",
    "It is. If it were any other time, I would give you what you ask. But I cannot afford to surrender territories now.",
    "Unfortunate. I had hoped you would be reasonable; that we could reach a compromise.",
    "But I shall pay your new price. You have, after all, asked for a lesson in pain.",
    "It is unfortunate that you forced my hand in this. I am not unreasonable.",
    "But no matter. You will tell me what I need to know, or you shall have a stark lesson in just how restrained I have been so far.",
    "Soldiers! Take him away.",
    "She returns! I can't wait to hear where in the ABYSS YOU'VE BEEN.",
    "Silence! You know very well what happened. If it wasn't giving you too much credit, I'd say you had something to do with it.",
    "Obstinate, conceited child. Guards - kill her!",
    "Stop her!",
    "Enough. Nymora, Jerrod, Vengeance... Destroy her - NOW!",
    "And this is your 'vision'? All this destruction? All this waste?",
    "If we had combined our strength. If you had just- Think what we might have accomplished.",
    "I suppose the old ways die hard. Zamorak... He would have been proud.",
    "So be it. Prepare yourself, Moia. For you face one of the Children of Mah!"
  ],
  "You very, very gently press the volatile fire rune fragments into the structure's weak points": [
    "for maximum destruction."
  ],
  "Moia": [
    "Bilrach. Did something happen while I was away? You look terrible.",
    "Me? Hahahaha! As if you need MY help to scupper your plans.",
    "No. I merely watched while two mortals brought it all crashing down. And you just let it happen.",
    "Is that all? Clearly it's not just you who's grown weak.",
    "Still with the puerile insults, Zemouregal? You always were rather dull.",
    "I think not. You Mahjarrat may think yourselves masters of soul sorcery, but you lack imagination. Observe.",
    "Just a little twist on an old classic. Say what you like about us mongrels...we know how to adapt.",
    "Their silence speaks volumes. You failed to see their potential, but they saw you. Your weakness. Your ineptitude.",
    "Your rule is at an end, old man. It is time for your crown to pass to another. One with the vision to change the world.",
    "And serve as a vassal in your stagnant kingdom? No."
  ],
  "Asgarnian Ambassador": [
    "Well met World Guardian.",
    "Oh I'm not fussy. I'm happy to sit anywhere.",
    "Honestly, I'm surprised how fussy some people get over all of this. We're all on the head table regardless.",
    "Unfortunately, I'm fairly new at this job. I'm not sure I'm quite qualified to give you the advice you seek on the others.",
    "I don't trust the Misthalinian Ambassador though. Something about them just makes me uneasy. If you could seat them away from me I'd appreciate it.",
    "Goodbye."
  ],
  "Misthalinian Ambassador": [
    "Ah, hello.",
    "Hmm, seats? I'll sit anywhere. Don't worry about me. Although I do have some business with the Menaphite Ambassador, if that's any help.",
    "Hmm, look, I didn't tell you this, but I'd be a little wary of the Asgarnian Ambassador. They may be new to the job, but they got there through some fairly shady dealings.",
    "It's politics, so I wouldn't worry too much. But I'd be wary about giving them the Basilissa's ear if I were you.",
    "Goodbye."
  ],
  "Kandarian Ambassador": [
    "A pleasure to meet you.",
    "I'm not particularly concerned myself. I'm happy seated anywhere. Others may be more discerning.",
    "Well, you didn't hear this from me, but the ambassador for Menaphos is a very paranoid person.",
    "They're convinced that there is danger waiting around every corner. So if you want to keep them calm, you should sit them near an exit.",
    "So near the ends of the table if possible.",
    "Goodbye."
  ],
  "Menaphite Ambassador": [
    "Hello.",
    "I'm deaf in one ear, so if you could put me on the Basilissa's right side, that would be appreciated.",
    "I am not a big fan of the Asgarnian Ambassador. They once made terrible fun of my prize-winning cabbages and I have never forgiven them.",
    "Goodbye."
  ],
  "Enemies defeated": [
    "[number]/10",
    "[number]/10",
    "[number]/20",
    "[number]/20"
  ],
  "Zemouregal": [
    "Are you going to let this mongrel talk to you like that, Bilrach?",
    "Keep yapping, cur. If Bilrach won't put you in your place, I will.",
    "What- What have you done?"
  ],
  "Zemourgeal": [
    "AAAAAAAAAAAAaaaaaaaaaaaaaaargh!"
  ],
  "Jerrod": [
    "..."
  ],
  "Nymora, the Vengeful": [
    "..."
  ],
  "Congratulations! You have completed": [
    "'Succession' - Complete this quest."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Succession?oldid=36023323’"
  ]
}