{
  "Wizard Myrtle": [
    "Well met, traveller.",
    "Oh this? I specialise in a type of magic based on the manipulation of water, I'm just practicing my technique. My name's Myrtle, I'm a hydromancer!",
    "You might say I'm affiliated, but I'm just visiting really. I'm in need of some help, perhaps you'd be able to lend a hand?",
    "Well, it's quite sad you see. I lost contact with my old mentor, a wizard by the name of Terrova. He lived on an island a stone's throw from here but... It seems to have completely vanished.",
    "The locals knew it as 'Tutorial Island'. They say that it sank into the ocean and disappeared beneath the waves, never to be seen again.",
    "It was once a place where all new adventurers started their travels. They would learn the basics of various skills before leaving the island. The inhabitants were all tutors that specialised in different areas. Hence the name 'Tutorial Island'.",
    "No one even knows what happened to the inhabitants, everyone just assumes the worst... I've been studying the art of hydromancy for years now, developing an underwater breathing spell that would allow me to dive down to the island and find out exactly what happened.",
    "Hmm, it's a little embarrassing. Ironic, really. I've got a crippling fear of deep water. If you could go down to the sunken island for me and find out Terrova's fate I'd be eternally grateful. What do you say?",
    "Oh, that's a shame. I don't think I can do this on my own. Please come back if you change your mind!",
    "Oh thank you, this is great news!",
    "There are still some finishing touches I need to make to the spell, but there's something you can do in the meantime.",
    "Oh you know, just tweaks here and there, nothing to worry about. I've only tested it on rats so far, but I'm sure it'll be fine! Now, I've managed to track down the only known survivor of the original islanders. A man called Vannaka.",
    "Ah, it would seem I found the right person for the job then! Clearly Vannaka has been hard at work to earn himself the title of slayer master since leaving the island.",
    "Apparently he's been hard at work since leaving the island. He's earned himself the title of slayer master!",
    "You'll find Vannaka in Edgeville dungeon. See if he knows anything about the fate of the island or if...anyone else...survived.",
    "You'll find Vannaka in Edgeville dungeon. See if he knows anything about the fate of the island or if...anyone else...survived.",
    "...a whole island vanishing, almost entirely unnoticed. There's just something fishy about all of this.",
    "Yes alright, I think we've got enough amusement our of that one today.",
    "It won't be ironic when I submerge you in water and suspend you ten feet in the air.",
    "Right back at you, you should have seen your face!",
    "The plan is to go to Mudskipper Point. It should be a smooth swim down to the island from there, not too many rocks to navigate. Once we're all there I can explain everything to you and tell you a little more about the underwater breathing spell. Any questions?",
    "Just head west around the bay, through Port Sarim and from there keep heading south to the furthest spit of land. You should see a single palm tree rising out of the sand. Anything else?",
    "We have a task to focus on! Now, I've managed to get the spell working-",
    "Well, you will be the first human trials, but I'm very confident there won't be any side effects! The only issue is that it draws power from the Wizards' Tower in order to work, so I'm afraid it will only work in this bay. You won't be able to use it anywhere else.",
    "Great, I'm glad we're all in agreement.",
    "Don't worry, I have years of practice in hydromancy. I promise you're in safe hands.",
    "Well that's all and good, but Vannaka is still going to need my spell.",
    "If you have other underwater breathing methods let me know which you plan to use, then we'll get you both ready to begin your descent.",
    "Great, I'll cast my spell on you so you can breathe without any diving apparatus.",
    "Great, you can use the diving suit from your house!",
    "Great, the fishbowl helmet and diving apparatus should work perfectly!",
    "If you want to use the fishbowl helmet and diving apparatus you'll need to go and fetch them first.",
    "Are you ready to dive to the sunken island now?",
    "Great, I'll cast my spell on you so you can breathe without any diving apparatus.",
    "Great, you can use the diving suit from your house!",
    "Great, the fishbowl helmet and diving apparatus should work perfectly!",
    "If you want to use the fishbowl helmet and diving apparatus you'll need to go and fetch them first.",
    "You should unequip your weapons before you go, the water could damage them.",
    "You should dismiss your follower before you go, we can't be sure they'll be safe.",
    "Excellent, us hydromancers are used to looking into murky water so hopefully I'll be able to keep an eye on your locations through the waves.",
    "Ok, just let me know when you're ready to go.",
    "I can deposit some items for you if you want.",
    "Hello, player! I wasn't expecting to see you back here just yet. Hope the search of the island is going well.",
    "I AM!",
    "Nevermind that now. It's time to make this evil old man pay for what he's done!",
    "Player, I can only do this with your help. Keep his minions off me and lend me your power when you're able!",
    "Ow!",
    "Get back creature!",
    "It's on me!",
    "Well he doesn't seem to have four legs so... Does that mean he's confined to the island forever?",
    "Yes, yes. Enjoy your time at the bottom of the ocean, Vivian.",
    "Oh my, I almost forgot! I suppose it's not so bad down here... Ok that's enough for me I think! Let's go back to the surface now.",
    "It wouldn't have been possible without everything you did for us, Player. Thank you.",
    "I couldn't agree more, the warm sand between my toes has never felt more comforting.",
    "I'm inclined to agree, but we got the job done and that's what counts.",
    "I don't know what came over me diving into that water...",
    "Come on now, Vannaka. You would have done the same for me.",
    "Terrova should be arriving with them any minute! With the curse lifted their appearances should be restored when they emerge from the water.",
    "Terrova, I thought I'd lost you forever... It's so good to have you back.",
    "We'll see you soon, Player, if you ever want to revisit the island come and see me at the fountains outside the Wizards' Tower. I'll be able to send you back down."
  ],
  "Player": [
    "Hello, what's that you're doing?",
    "Nice to meet you. Are you a member of the Wizards' Tower?",
    "What is it you need help with?",
    "What happened to it?",
    "So, why do you need my help?",
    "Erm, what do you mean 'finishing touches'?",
    "I know Vannaka, he's a slayer master!",
    "Vannaka? I haven't heard of him before.",
    "I wanted to ask you about Tutorial Island, you used to live there didn't you?",
    "Do you know anything about what happened to it?",
    "Were you there when it happened?",
    "Why did you leave Tutorial Island?",
    "How did you become a slayer master?",
    "How do you wield that two-handed sword in one hand?",
    "I was sent by a Wizard named Myrtle. She's created an underwater breathing spell, wants me to go down to the island and find out what happened.",
    "She claims Terrova was her mentor. Everyone assumes the worst but she seems to hold out some kind of hope.",
    "She's waiting by the fountains outside the Wizards' Tower, practicing her water magic.",
    "You mean because of her fear of deep water?",
    "If you two are finished flirting I'd love to know what the plan is.",
    "Nope, I'm ready to go! See you at Mudskipper Point!",
    "Umm, hello.",
    "Suuuuure.",
    "On humans I hope...",
    "Ok, you too Vannaka.",
    "So an evil wizard cursed the island and only one last adventurer completing it can break that curse? Maybe some of the islanders are still alive!",
    "Woah! Y-you're alive?",
    "You've been down here so long... I've come to try and save you. Have you tried swimming to the surface?",
    "But I already know how to make a fire!",
    "Erm, it's okay... I have my own.",
    "How do you expect me to light a fire here? We're underwater!",
    "Hmm, well I guess if I'm to break the curse I'll figure it out.",
    "Hmm, it looks like the vent is losing pressure through that hole. If I were to block it I reckon I could make this vent a lot hotter.",
    "What?",
    "No! I cooked it over there on that steam vent.",
    "But...",
    "Sure...",
    "Umm, hello?",
    "Um, yes.",
    "Can't argue with that, I'm out of here.",
    "Your friend Brynna told me of the problems you're all having. I think I can help you but I'll need you to take me through one of your cooking classes first.",
    "Trust me, just go with it.",
    "How does making bread underwater work anyway?",
    "You guys sure do like seaweed down here don't you...",
    "What's this for?",
    "Okay, but that still doesn't answer the question of the music box.",
    "So you want me to risk my life at the hands, err tentacles, of an enraged jellyfish with nothing but a music box that might calm it down?",
    "*sigh* Fine.",
    "Um, I seem to have misplaced your music box.",
    "That's good to hear. Can I get some of that seaweed now?",
    "Hmm, better not risk it. Who knows what could set that crazy jellyfish off again.",
    "Err, nothing...",
    "Here's your music box back, it seemed to calm the jellyfish eventually.",
    "I've got the seaweed.",
    "I've got the seaweed.",
    "Of course. Here you go.",
    "Underwater.",
    "We're underwater. Haven't you noticed?",
    "This isn't going anywhere quickly. I'll find a way to light the furnace on my own.",
    "Can I at least bring my own ores?",
    "That's a no then.",
    "I already am a master smith.",
    "Vannaka! Have you seen what's happened to the people here?",
    "They were cursed by a dark wizard. The only way to break it is to complete each tutor's task one last time. I've already done a few of them.",
    "Yes, senpai.",
    "What will you do?",
    "I don't want to be rude, but I've got people to save. Can we stick to what IS viable?",
    "I got the vault open.",
    "I was one of those adventurers!",
    "That would be me.",
    "I'm sure I can find it for you, any idea where it went?",
    "Friends? You mean the other tutors?",
    "How am I supposed to know their names?",
    "Great, I'll go see if they know anything.",
    "I'm still looking at the moment.",
    "I seem to have misplaced the list you gave me.",
    "Hello, Fish Name 1.",
    "No need to be alarmed, Brother Brace sent me to see if you might have seen his missing prayer book?",
    "Hello, Fish Name 1.",
    "Hello, Fish Name 2.",
    "Sorry. Do you know where Brother Brace's prayer book might be?",
    "Hello, Fish Name 2.",
    "Hello, Fish Name 3. I don't suppose you have any idea where Brother Brace's prayer book might have gotten to?",
    "Are you sure you don't know anything else?",
    "Are you sure you don't know anything else?",
    "I think I'm getting closer, one of your friends said something about the coral east of the chapel / the anchor east of the bank / the cannon to the west of the ladder to the caves.",
    "Good news, I've found your book.",
    "Erm, it was me that went out there and found it...",
    "Erm...",
    "Cast a magic?",
    "Really? I'd rather not traipse all the way back to the bank to get some.",
    "Unmentionable? Not even a little mentionable?",
    "Let him go.",
    "Myrtle! What about your fear of-",
    "Bloop.",
    "You won't be casting any more curses from inside that bubble, Vivian.",
    "You conquered your fear of deep water Myrtle!",
    "Ahem! So, erm, where are the islanders? Shouldn't they be here by now?",
    "Ok, enjoy the fresh air everyone."
  ],
  "Vannaka": [
    "'Ello, and what are you after then?",
    "Aye, you aren't wrong. I was an instructor there back in the day.",
    "A terrible thing... Terrible. The whole island just slipped into the ocean, taking all my friends - my family - with it. How can an entire island just disappear like that? It's not right.",
    "It happened sometime after I left the island to become a slayer master. To begin with I just thought I'd lost contact with everyone, but I'll remember the fateful day I received word of the incident for the rest of my life.",
    "To be honest with you, I was bored. Teaching new adventurers was rewarding, but I was never challenged. I sought the excitement of battling monsters toe-to-toe, head-to-head. Nothing save my blade and shield separating me from death. What better way to combine that with my teaching experience than becoming a slayer master? I was born for this. So I left the island to pursue my dreams. If I'd known what would happen... I don't know. Maybe I would have stayed, maybe I could have made a difference.",
    "Duradel mentored me in the art of slaying, I learned much of what I know from him. When I left Tutorial Island I met with he and the other slayer masters who initiated me into their order. Since then I have resided here in Edgeville. Not the cosiest of places but there's a certain...dankness...to it.",
    "Haha! Aye, you are not the first to ask me that question. It is a special style of swordsmanship I developed over many years. Perhaps I will teach it to you some time.",
    "Now it's my turn to ask the questions. Why have you come here? What interest do you have in Tutorial Island?",
    "She must be the wizard who's been asking after me then. People talk around here. What makes her so interested in the island?",
    "Hmm, I had not allowed myself to entertain the thought of anyone surviving... So you intend to go down to the island?",
    "Then I will accompany you, I must see what became of my friends. Where will I find Wizard Myrtle?",
    "Perhaps we should go down together, I need to see what became of my friends. Where will I find Wizard Myrtle?",
    "Then I will meet you there, adventurer. I won't be long, just have a quick slayer task to finish off first...",
    "'Ello, and what are you after then?",
    "We should go and meet Wizard Myrtle at the Wizards' Tower. I'll see you there.",
    "Ah, Player. You made it!",
    "Aye, Myrtle here was just telling me why she can't go and investigate the island herself.",
    "Yes! A hydromancer who's scared of water, real thigh slapper that one.",
    "I'm sorry, really. It's just a little ironic is all.",
    "Ok, ok, I was only jesting lass.",
    "Flirting? Me? I- well, I want to know what the plan is as well!",
    "-would be a lovely spot for a picnic, don't you think?",
    "Oh, Player, I didn't see you there! We were just discussing the plan of action...",
    "I'm going to swim down to the cave where I used to be stationed, Player. I must find out what happened to my old mate Dezzick. Meet me there once you've explored a while, and be careful.",
    "I have. I never imagined there would be survivors, let alone that they would be bound to such a fate. Dezzick barely seemed to know who I am. It seems like what ever changed him physically has also affected his mind... How could this possibly have happened? Who could have done this to them?",
    "Is that so? Well, if you need to complete every tutor's task then you'll need to complete mine too. Perhaps I should set you one?",
    "Great. If it's a challenge you're looking for then I've got something that might intrigue you.",
    "Aye, it does. I've got something a little more interesting than my original task too.",
    "How quick it is will be up to you. I've got something a little more interesting than my original task for you.",
    "You're a fully fledged adventurer now, I think you're a bit past using that butter knife. It's about time I taught you how to wield my two-handed sword in one hand. Like I mentioned before, it is an art which can only be performed with a perfectly balanced blade like mine. Underwater is actually the perfect place to learn to wield the larger blade as it will relieve some of the weight for you.",
    "The water will also help to amplify your senses. You must not use your sight, but instead sense sound and movement as ripples in the water. This sensory information will help you determine the opportune moment to strike a deadly blow. Choosing the wrong moment is extremely costly with a larger weapon as recovery is much harder. Understand?",
    "Ok, when you're ready to begin the task enter the arena and pick up my spare sword and shield. Don the blind fold I've wrapped around the hilt. Use only your senses to dispatch every giant sea rat that comes at you.",
    "Empty your mind. Focus only on the sensory information you are receiving and the blade in your hand. These core focuses should be amplified whilst underwater. Your movements will be slower, but you will feel the ripples around you. The key to mastering the larger blade is not though strength alone. You must choose your attacks carefully, only striking when the moment is right. Feel the weight of the blade and work with it, not against it. Only then will you understand the art of wielding a heavy weapon. It is a... double-edged sword.",
    "Remove the blindfold, look!",
    "Wow, you did it! You're a natural.",
    "Aye, there are a few that know this skill as well as I do. You have the potential to be one of them.",
    "Clearly! Who knows, maybe one day you'll wield a larger blade as well as I do.",
    "Clearly! Who knows, maybe one day you'll wield a larger blade as well as I do.",
    "Now, you have islanders to save. I am confident, now more than ever, in your abilities. Go forth and complete the remaining tasks.",
    "I'm going to try speaking to Dezzick and the others you've already met. Perhaps doing their tasks has helped to jog their memory a bit. And don't worry, once we reach the shore again I'll tell you how to wield that sword on dry land!",
    "Aye, lass. You made me feel like a damsel in distress - saved my hide!",
    "Dived to the depths of the ocean to save you? Yes, Miss Myrtle, I believe I w-",
    "Look, here they come!"
  ],
  "The following text is transcluded from Transcript": [
    "Message in a bottle (Beneath Cursed Tides).",
    "Calendar (Beneath Cursed Tides).",
    "Memo."
  ],
  "Brynna": [
    "Ah! Oh, sorry... I've not seen anyone come through these parts in years. I'm sure there was something I'm supposed to say, it feels like a forgotten memory though. Your clothing sure is fancy, I've not seen the likes of that before! Most people that came through here back in the day wore that horrendous green clothing - never really understood the fashion back then.",
    "In fact, I remember tutoring someone that looked a little like you back then.",
    "The...surface? I have tried to swim up there towards the sun, but no matter how hard I kick my legs I never seem to get past a certain point. Any way, at least I have my friends to talk to down here.",
    "I know, I know, only two legs!",
    "Oh yes, of course! I almost forgot. I'm supposed to teach you the skills you need to survive! First up, the most basic survival skill of all: making a fire.",
    "Please do not interrupt me Player! As I was saying, the most basic of survival skills is making a fire. Your first task is to light one for me!",
    "Oh, come prepared have we? Right then, I'll keep these fine tools for the next person!",
    "Hmm, so we are... Well, the most important thing is that you cook a shrimp. You should find some swimming around the area.",
    "It's fine Gerald. You're a prawn not a shrimp, silly. Now then, you must cook me a shrimp before continuing through the island. You may go no further until the task is complete.",
    "I still need you to cook me a shrimp, Player. You should find some swimming around the area.",
    "Great Saradomin's beard! WHAT HAVE YOU DONE?",
    "Nobody - and I mean nobody - has ever cooked a shrimp the first time before! Did you buy this from one of those dodgy bank sales?",
    "Well, I'm afraid to complete my task you must bring me a burnt shrimp first. It's the way it has always been.",
    "No buts! Get cracking!",
    "Oh no, it looks like you've burnt that one!",
    "I mean, I know that shrimpin' aint[sic] easy but let's try again. Catch another one and make sure you don't overcook it this time!",
    "I need to see progress! Catch a shrimp and make sure to cook it before you bring it to me.",
    "Oh lovely, that's cooked to perfection! What do you think of that, Gerald?",
    "Oh shush. Player, you've completed my task! Now you can move onto the next one with Chef Lev, I wish you the best of luck.",
    "You've completed my task, Player. Now you can more onto the next one with Chef Lev, I wish you the best of luck!",
    "Please leave the shrimp be, I need to make sure their numbers are plentiful enough for future adventurers."
  ],
  "[Prawn]": [
    "...",
    "...",
    "!!!",
    "..."
  ],
  "Large Jellyfish": [
    "Do you like your face?",
    "In that case I suggest you leave. OR I'LL STING IT OFF!",
    "What is that?! PLAY SOMETHING ELSE!",
    "Ah, this is one of my favourites. PLAY ME MORE BEAUTIFUL SOUNDS!",
    "That's not how it goes. DO IT PROPERLY NEXT TIME!",
    "I haven't heard this in an age. DON'T KEEP ME WAITING!",
    "What a great piece, I've not felt so relaxed in a long time.",
    "Hmm? Oh sure, go ahead.",
    "Well that just ruined it. WHY DO YOU SPOIL EVERYTHING!?",
    "You what?"
  ],
  "Master Chef": [
    "Well well, a new face. That's something of a rare sight these days.",
    "Hmm, it's been a while since someone has sought my culinary teachings.",
    "Haven't I taught you before?",
    "Haha, no one makes bread any more, it's so last age! Everyone is into far more healthy options like salads. First I'll need you to fetch some of my especially delicious seaweed from outside, it's the basis of any good sea salad. Once you have that we can get started.",
    "It's the most versatile ingredient around!",
    "So here's the thing. A rather large and angry looking jellyfish seems to have taken a liking to my seaweed.",
    "Ah yes, well I'm hoping that the music might be used to make the jellyfish a little less on edge. Also, I'm totally scared of it if I'm honest which is where you come in.",
    "Exactly.",
    "We can't continue the lesson without the finest seaweed.",
    "Luckily I found it floating past my door, please do be careful with it this time.",
    "You can't leave yet, I still have valuable techniques to teach you.",
    "Good, I was getting worried I must admit.",
    "Fantastic, go place the seaweed on the table over there and we can get started.",
    "Fantastic, go place the seaweed on the table over there and we can get started.",
    "Great, now we have the seaweed I am going to give you access to my wide variety of caviar to make some delicious sea salads! First, I want you to create something sweet and sour with a bit of spice. Think you can handle that?",
    "Great, now Head over to the table and show me what fish you feel best complement each other.",
    "Fantastic, that's exactly what I was looking for!",
    "Now, I want you to create something mellow yet sour with some bitter undertones. Think you can handle that?",
    "Now, I want you to create something spicy with a salty bitterness. Think you can handle that?",
    "You've done well my friend. I hope that what I have taught you will aid your efforts to help us, good luck!",
    "That's not quite right. (Repeats instructions)",
    "You've done well my friend. I hope that what I have taught you will aid your efforts to help us, good luck!",
    "Before you go, could you return my music box?",
    "There's all this fresh crab floating about, we could have a barbeque to celebrate! Hero, I won't be needing my seaweed patches or fishing spots on the island any more, you're welcome to them. You'll learn a lot from harvesting them and can feed the produce to the giant oyster for some delicious rewards! The resources take a month to regrow, so you only have to go back and visit every once in a while."
  ],
  "Mining instructor": [
    "Greetings adventurer! I suppose you'll be here to learn about Mining and Smithing?",
    "You must!",
    "I need you to make a bronze dagger. You'll need to mine some tin and copper ore, then use the furnace to smelt it. Any questions?",
    "Under-WHAT-er!?",
    "Under-WHAT-er!?",
    "Under-WHAT-er!?",
    "Don't be ridiculous! I'd have no way of knowing you actually made it yourself!",
    "Oh, you are a funny one!",
    "I see you've got the ores you need. That's a great start. You should next look at giving the furnace a kick-start to smelt some bronze bars.",
    "You're making good progress, Player. All that's left is to make the dagger at an anvil.",
    "Splendid work, Player! I'm sure that dagger will serve you well for many battles to come! You should seek out your next tutor.",
    "I'm proud of you, Player. We'll make a master smith of you some day.",
    "Ok, enough of this talk, we have lost years to make up for."
  ],
  "Financial advisor": [
    "Okay, making money. Quite. Well, there were three basic ways of making money here: combat, quests, and trading. I will talk you through why each is no longer viable very quickly.",
    "Let's start with combat as it is probably still fresh in your mind. There are barely any monsters to fight underwater, so it isn't a steady job. Now, the next way to earn money quickly is by quests. Many people on Gielinor have things they need doing, but very few of those are underwater. By getting a high level in skills such a Cooking, Mining, Smithing or Fishing, you can create or catch your own items. No matter the quality of your goods though, an underwater bank sale is never going to be especially well attended.",
    "Well, there is one money making method I can still think of... The local banker, Jed - gods rest his soul - passed away a few years ago. Which does leave the bank vault somewhat undefended. Figuring out the combination would certainly prove a lucrative venture. I'm sure if you rifle through Jed's notes you'll find some clues.",
    "The only remaining method of making money on the island is to go on the rob. In order to prove you understand the money making process, I'm going to need you to open the bank vault. I'm sure there are clues to the code littered around the bank booth.",
    "Excellent! I'll go and... evaluate your work. Consider your work here done though, Player. Go and seek the next tutor. Take the east door out of the bank.",
    "Excellent work, my fellow... finance expert.",
    "True. Adventurer, you have our gratitude, but we must be off."
  ],
  "Brother Brace": [
    "Praise Saradomin, our saviour has arrived! My my, you certainly look more accomplished than the adventurers we used to get through here.",
    "It's a compliment! You're clearly more accomplished these days!",
    "Now then, if I'm not mistaken you must be the individual who has come to rid us of this terrible, terrible curse. Word spreads quickly around our small community.",
    "I knew this day would come! Saradomin spoke to me in my dreams, told me a hero would come if I just kept faith in him. Unfortunately the prayer book I need to conduct my services floated away some time ago. I'm afraid I just can't help you without it.",
    "Splendid! What a helpful soul you are. I suggest you ask some friends of mine, they may have seen it drifting by.",
    "Oh no, not them - one must make new friends every now and then. The local fishies attend my services, it seems most of them have petty crimes they wish to repent for. They are a bit skiddish around strangers however, won't talk to you if you don't address them by name.",
    "Here, take this. Every time I make a friend I write their name down on the list so I don't forget. It should help you identify them!",
    "Lovely, I held mass not too long ago so they shouldn't have strayed too far from the chapel.",
    "How goes thy search, chosen one?",
    "Please do let me know as soon as there are any developments. You should find my friends in the area surrounding the chapel.",
    "How goes thy search, chosen one?",
    "Not to worry, here is another.",
    "How goes thy search, chosen one?",
    "That is good to hear, I would suggest you now search the area that was mentioned.",
    "How goes thy search, chosen one?",
    "Oh thank goodness, I knew great Saradomin would bring it back to me!",
    "Yes, of course, but our lord was working through you. I am absolutely certain he brought you here.",
    "Ah ha, here we go. I should really keep my door key in a more sensible place in the future.",
    "Now, I'll unlock the door and you can be on your way. My fellow tutors await the help of the chosen one! Go with faith, my friend. You are walking a righteous path!",
    "I'm looking forward to seeing the surface again!"
  ],
  "Fish": [
    "Oh, um, hello stranger.",
    "I haven't seen anything, honest. Ask someone else?",
    "I don't know where the book is, find someone else to question!",
    "Urk, you shouldn't sneak up on people like that!",
    "I didn't do anything, it wasn't me! Go interrogate someone else!",
    "I don't know where the book is, find someone else to question!",
    "Erm, I think I saw something in the coral east of the church / around the anchor east of the bank / in the cannon to the west of the ladder to the caves. Can I go now?/That's all I know!",
    "Shouldn't talk to strangers, don't talk to strangers. Strangers bad.",
    "While we devotin', full time to floatin', under the sea... Ah, I don't know you!",
    "I heard talk about the coral east of the church / the anchor east of the bank / the cannon to the west of the ladder to the caves, I don't know anything else!",
    "You have the book now, what more do you want from me!?"
  ],
  "Wizard Terrova": [
    "Welcome adventurer-to-be. Are you ready to face your final test?",
    "I do love an eager candidate! (Continues below)",
    "You must learn to harness the wiiilllld forces of magic.",
    "You cannot pass this trial until you have cast a magic upon those chicken prisoners.",
    "You must blast them with a strike of air.",
    "I can, but shall not!",
    "Should place your focus upon your intended chicken and clear your mind, you'll find you have no need of runes here.",
    "Each of these chickens has engaged in a spree of crimes unmentionable. To give back to the community by serving the education system is their punishment.",
    "Very well, Step closer. The largest grain heist in known history was perpetrated by some of these birds. To this day we still don't know where they hid their bounty.",
    "Sorcelations!",
    "Excellent work on the chickens. Consider yourself tutorialised.",
    "Welcome traveller. I can't help but notice that you let yourself into my house and bubbled my chickens uninvited. Excellent work. I like your style. Consider the tutorial completed.",
    "Vivian? It's you?",
    "I will focus a spell to reverse the curse onto Vivian. You must overcome him Myrtle, I have faith in you.",
    "You must put a stop to him, Player!",
    "I believe the spell was a success, heroes. I was able to save Vannaka from the curse and reverse a component of it onto Vivian.",
    "Correct, my child. His terrorizing days are over.",
    "I'll round up the other tutors, we'll be right with you!"
  ],
  "Hector Vivian": [
    "STOP! How dare you try to break my curse. Come out here where I can see you!",
    "Ahahaha! You remember me then? Yes, 'twas I who cursed you! Who is this arrogant fool trying to put an end to your punishment?",
    "Pfff, it matters not. I've caught you at the last moment, your plans to break the curse are foiled! And you've brought Vannaka right to me! The final piece of the puzzle. The one who got away... Finally I can transform him, the curse will be complete!",
    "Who's going to make me?",
    "Haha, I was once a hydromancer like you Myrtle. Look how far I've come, see where hydromancy has led me! I've perfected my curse since leaving here. You'll be no match for my minions!",
    "No, please don't! No! Noooooo!",
    "Arrrrgh curse you!",
    "Blasted bubbles... I would have got away with it if it wasn't for your meddling!",
    "Damn you all to hell! I WILL have my revenge, mark my words."
  ],
  "Magic instructor": [
    "Don't worry child, I am here now. I feel like I've just awoken from a hazy dream."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Beneath_Cursed_Tides?oldid=35806903’"
  ]
}