{
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "Dialogue with Senliten about aspects of her tomb that haven't been restored, misc dialogue. Missing dialogue when returning to Leela after finding all items except the Scroll of the dead.You can discuss this issue on the talk page or edit this page to improve it."
  ],
  "Leela": [
    "Thank you. Al Kharid will forever owe you a debt for your help. In fact, I have something else I am working on, and you seem to have the first-hand knowledge of desert religions and burial rites to help me. Would you be interested in this quest?",
    "Maybe later then.",
    "Well, I guess you want instructions then. I want you to head off to an ancient pyramid and talk to the inhabitant.",
    "The pyramid we are after is on the coast, close to Uzer; in fact, it pre-dates Uzer, so is[sic] very ancient indeed. In those days, the pyramids did not have tops so are[sic] more properly called mastaba. We will stick with pyramid though, it is easier that way.",
    "That could be more of a problem, I admit. The inhabitant I wish for you to contact is the mummy who was buried there, or whatever part of her turns out to be capable of communication. She is an ancient, wise Pharaoh Queen and I guess that she will be well guarded in the usual fiendish ways.",
    "I do not think I ever mentioned that it would be totally safe, that is why I am offering a nice cash bounty for you if you can make satisfactory contact. You will find that I have enabled you to access some doors and passages that mere robbers would not be able to use, though, so it should be relatively easy where entry is concerned.",
    "Worry about it not – trust me when I say it has been sorted out. Enough chit-chat, though, you have a journey to make.",
    "Ah, you are back. Do you have any news of the pyramid and its inhabitant?",
    "Well, I guess you want instructions then. I want you to head off to an ancient pyramid and talk to the inhabitant.",
    "Ah, you are back. Do you have any news of the pyramid and its inhabitant?",
    "This is very bad news indeed, if the mummy has been dismembered - or even destroyed - my plans will be set back months. You really must try to find out what caused this dismemberment and whether the rest of the mummy is still present in the pyramid.",
    "Hmm, this is not a good sign, it suggests the pyramid has been at least partially looted. You had best get back there quickly before any more damage is done. Unless you have more evidence, that is.",
    "That is quite vague. What exactly is in this journal?",
    "Trust me, you shall not be affected by the curse; you are not just there to loot so will be fine. It does lessen the chances that the place has been fully looted, though, so this is good news of sorts.",
    "Excellent, can I just look at that for a moment?",
    "Oh my, this does shed a whole new light on matters. It seems that the burial rituals performed on the Pharaoh Queen within the tomb will have split her up into various parts. You must reconstruct her presence before contact can be made properly. I am guessing that you will not have to totally reconstruct her, though.",
    "The scroll mentions that body, body double, spirit, shadow, personality and name were each split up. You will have to look for ways to re-unite these with the Pharaoh Queen.",
    "You need to gather all of the mummy's physical parts in order to complete the body. I imagine this means collecting the mummy and any canopic jars and replacing them in their original position. The canopic jars contain organs from the mummification process.",
    "The document you have states that the deceased was supplied with grave goods, which would be used to replace them in the hard labour required in the afterlife.",
    "Indeed, was there anything else you wanted to discuss?",
    "The text is quite vague here, referring to the desert deities as contributing to the spirit of the land. I can only suspect that you will need to ensure that any religious sites in the pyramid are suitable for communing with Tumeken and his cohorts.",
    "The documents you supply were an academic study, not a manual for our work, I am afraid. Guesswork is the best you will be getting.",
    "Indeed, was there anything else you wanted to discuss?",
    "The name of the Pharaoh Queen will probably need to be her full, ceremonial name, which will doubles be written down somewhere. Similarly, there must be some record of how she spent her life, which would be a start as far as rebuilding some idea of her personality.",
    "The pyramid pre-dates even Uzer, and that is pretty ancient. My research showed up very little of any use, so I am led to believe that any documents were interred in the pyramid and have not yet been recovered or translated.",
    "Indeed, was there anything else you wanted to discuss?",
    "I have no idea.",
    "If that was a pun, you are not very funny. On the subject of shadow rebuilding, I know nothing much; no need to act as if you are any more informed.",
    "Indeed, was there anything else you wanted to discuss?",
    "Farewell and good luck then.",
    "Hello again. Now we know what we are doing, things should progress speedily.",
    "That you have; she contacted me in a vision and seems most lucid. The information she will be able to impart will be of incalculable value. As promised, there is a reward for you."
  ],
  "Player": [
    "I'd rather not be involved in another quest just now.",
    "Yes, I am glad all my time wandering around pyramids was useful. Another quest seems just about right for me now.",
    "Sounds simple enough, if a less than complete description. Where is this pyramid situated and what sort of information do you want from the inhabitant?",
    "And the inhabitant?",
    "How can you be sure that this mummy won't decide to dismember me?",
    "How can you be sure of that?",
    "Nothing yet, sorry.",
    "I'm here to find the inhabitant of this pyramid, would that be you?",
    "Curse? What curse?",
    "So I'll turn into a skeleton, or something? This is terrible, no one warned me about this at all!",
    "What happened to you then?",
    "You aren't like the golems I met in Uzer.",
    "Well, I certainly saw some there. They looked different and had keyholes in their heads.",
    "No, no, no. These were definitely golems just like you. Well, not quite like you, obviously, they could be given new orders through the holes in their heads after I repaired them.",
    "I have nothing more to say.",
    "I must speak to the Pharaoh Queen.",
    "Don't you understand? I am here on a legitimate mission.",
    "Seems like mindless violence may be the only solution to this mindless lump of rock.",
    "I found a mummified hand, that must be something to do with this inhabitant.",
    "I [also] found a plain canopic jar.",
    "I found a journal too, which explains a few things.",
    "It seems the tomb robbers became trapped and succumbed to a curse. I am rather worried that the curse will affect me.",
    "Finally, I found a translated text.",
    "So what am I supposed to do next? How do I reconstruct a mummy?",
    "Can you tell me about the body and body double?",
    "Yes, I know about canopic jars from my dealings with Icthlarin. What about the body double?",
    "I'll have a read of it again, it sounds like the document has some potentially useful information.",
    "What do you know about the spirit of the Pharaoh Queen?",
    "Can't you be a bit more precise?",
    "True, but I am ever hopeful that I'll be talking to someone with mystical knowledge beyond their apparent experience. Sometimes I've been lucky.",
    "Personality and name? How can I find these?",
    "So, documents it is. No one would know already?",
    "I'll see what I can find, then.",
    "How can I reunite a shadow?",
    "So you are totally in the dark on this?",
    "I'll see what I can find, then.",
    "I think I can deal with this myself.",
    "I have some questions about a tomb.",
    "I've come across a journal in the tomb in question – it's conclusive proof that you are organising the looting that's going on there.",
    "I'm after ways to reunite the mummy in the pyramid. I need to know about the name or personality in particular.",
    "I can see where this is leading. What's your price?",
    "What's the price for the original, by the way?",
    "I just happen to have a glass of [Winter/Autumn/Summer/Spring] sq'irk juice here, hand over the document!",
    "Where should I obtain this juice?",
    "(Persuade)I am sure no one else will ever need it, it's just taking space you could use for more profitable items.",
    "What exactly are your men after in the pyramid?",
    "Can you tell me more about these documents?",
    "Well, they seem to be dead now. I think they fell victim to the pyramid's curse.",
    "You certainly know how to run a business.",
    "How can you be so callous?",
    "Did you know that your gear seems to break easily?",
    "The pyramid is littered with broken gear, all AMCE stuff that you supplied.",
    "I can't think of anything sensible to ask.",
    "I have some questions about a tomb.",
    "I lost the document copy you gave me.",
    "I seem to have misplaced a document you passed to me.",
    "I'd like to talk about a pyramid.",
    "I need information about the personality or name of the mummy inhabiting this pyramid - so it is quite specific information.",
    "Ah, but I have reason to believe that you know about certain documents from this pyramid, the ones that Ali Morrisane sold to you.",
    "Great, I need this information pretty desperately, could I have them, please?",
    "Well, I need to know about the name or personality of the Pharaoh Queen who inhabits the pyramid, so I can reconstruct her from her separate parts.",
    "What's the problem, then, you seem less than happy?",
    "Would it matter if the documents were damaged? Ali mentioned that he made some into fliers, but he had the papyrus scraped clean first.",
    "I certainly do, feel free to take a look.",
    "A what?",
    "Is this good?",
    "Many thanks, Reldo.",
    "Sorry, not at the moment, but it's not so far to get one.",
    "I'd like to talk about a pyramid.",
    "I've lost the document you provided.",
    "I've made no progress since we last met, in fact.",
    "Greetings, your Majesty. Is this papyrus of any use to you?",
    "I also have this papyrus, even better than the last.",
    "Furthermore, is this scroll of any use to you?",
    "Can I talk to you about your reconstruction?",
    "Can you tell me about the body and body double?",
    "What would you know about bolstering your spirit?",
    "Personality and name? How can I find these?",
    "How can I reunite your shadow?",
    "I think I can deal with this myself.",
    "Can I talk to you about Leela?",
    "She is the one who sent me here to make contact with you.",
    "Why did she contact you and what is all this about respect?",
    "Can I talk to you about the tomb robbers?",
    "Will I be cursed, too? I don't want to become a skeleton.",
    "Well that is a relief, at least.",
    "Will I be cursed, too? I don't want to become a skeleton.",
    "Well that is a relief, at least, while still remaining confusing.",
    "Can I talk to you about history?",
    "Can you tell me about your lands and palaces?",
    "You talk of forests and plains, what kind of lands were these?",
    "Well the lands are now mostly deserts and, although Sophanem is a town, the rest are ruins, I think.",
    "Who would these enemies be, then?",
    "I thought that Zamorak was always the root of evil?",
    "Well, he's an immortal deity, I guess you'll find out about him soon enough. What was that about Stern Judges?",
    "What was that about rebirth through death, and why are they called faceless ones?",
    "I don't doubt. Were these Judges minor deities, spirits or something else? It all seems a bit strange that I haven't heard of them before.",
    "So, where are they now?",
    "Can you tell me of religion?",
    "Icthlarin seems very popular, too.",
    "Amascut and Icthlarin seem to be in opposition now. Amascut is known as 'The Devourer' and didn't seem very friendly to me at all.",
    "What do you know of Scabaras?",
    "I think that, like Amascut, Scabaras has changed since you last were able to communicate with the world.",
    "I am pretty sure I have annoyed Amascut and having a deity as an enemy isn't my idea of sensible. I would hope to be involved if ever you plan to return her to her old, friendly ways.",
    "Can you tell me of your life and deeds?",
    "Were there any notable occurrences in your reign?",
    "So this is the first pyramid? Do you know that they are quite common now?",
    "Well, the others are somewhat differently shaped, so you are distinguished by that, at least. Is there any other legacy you are proud of?",
    "I see, or rather I see the extent that you seem to wish me to.",
    "Can you tell me of life after death?",
    "Why were you split up when you died, though? It all seems rather odd to me.",
    "What effect does reassembling you have?",
    "Who performs these rituals?",
    "What if mistakes are made by the priest?",
    "Twisted? What sort of effect would this have?",
    "Quite so, it sounds horrible.",
    "I have nothing more to say.",
    "I have reconstructed the Pharaoh Queen; my task is done.",
    "I have some questions about a tomb.",
    "I've just come to say that I solved the problem of the mummy, so all has ended well."
  ],
  "Golem's remains": [
    "You should not be here, yet it is beyond my powers to evict you.",
    "That is not the case. The true inhabitant is the Pharaoh Queen on the lower level. You are denied access to her. The curse will protect where I have failed.",
    "Those who spend time here will be cursed to live and not die though their flesh withers away. Only those welcomed by the Pharaoh Queen are immune to the curse.",
    "Only the Pharaoh Queen, her family and their direct employees are immune. Or those without flesh. You may hope you are classified in one of these categories. Go now, I have no more to say on the matter.",
    "Robbers like you assailed me with blunt weapons. I am physically destroyed. The curse claimed them as it will claim all.",
    "Uzer is a small village of no importance. There are no golems stationed there.",
    "I think your doom is upon you, for what you say makes you appear insane.",
    "Are you sure your mental faculties are not disturbed, mortal? Do you feel that your cerebral tissues are rotting within your skull? Perhaps you have the curse?",
    "Your fate will be deservedly grisly."
  ],
  "Golem Guard": [
    "Halt, you are not permitted to pass.",
    "Halt, you are not permitted to pass.",
    "Halt, you are not permitted to pass."
  ],
  "Ali Morrisane": [
    "Hello [Player]. How's the adventuring going?",
    "Well, I'm not sure why you'd think I know anything about tombs, or tell you if I did.",
    "What exactly do you need to know, then?",
    "The documents I sold to Reldo might help you with the personality side of things, I don't know, but the name I can certainly aid you with. I have a copy of Senliten's full, official name which I made from the original.",
    "The official Osman has a great fascination with the juice of sq'irks, which I sense might lead to some profit for me. If you can hand over a glass of sq'irk juice, I'll pass over a copy.",
    "Oh, I don't think any human could persuade me to part with it. If you are willing to pay me for a copy, I consider keeping the original an investment.",
    "There you go, may it profit us both.",
    "There is a sorceress who lives in a tower to the south of here, within Al Kharid. You should talk to her, or her assistant.",
    "The documents I sold to Reldo might help you with the personality side of things, I don't know, but the name I can certainly aid you with. Then name you have a copy of, but I guess I could part with the original - for a fee, of course. It's a very nice looking item, though, you'd have to be more than humanly persuasive for me to part with it.",
    "You are right. Take the old thing away.",
    "Loot. All they found was some old documents, so I sent them back for gold.",
    "Some I kept – they were quite decorative – some I sold to Reldo for translation as they were gibberish to me, and some I had scraped clean and used as fliers for the businesses of Al Kharid. I get a commission on that last deal, of course.",
    "Perils of their job, I guess. I suppose it will save me wages, but the lack of loot is very distressing.",
    "Indeed – no time for squeamishness when you need to make cash. I won't have a comfortable home if I act all soft-hearted.",
    "It's the case of me versus the world, you know? I'd rather they be dead than me starve, if it comes down to it.",
    "What makes you say this?",
    "The men I sent clearly ignored the instructions. I can't be held responsible.",
    "Hello [Player]. How's the adventuring going?",
    "What exactly do you need to know, then?",
    "Well, you'll just have to buy it again, I'm not a charity. The official Osman has a great fascination with the juice of sq'riks, which I sense might lead to some profit for me. If you can hand over a glass of sq'irk juice, I'll pass over a copy.",
    "Indeed. You seem to have misplaced these documents and I have a strange urge to pass them to you for no charge.",
    "Hello [Player]. How's the adventuring going?",
    "What exactly do you need to know, then?",
    "Bah, where's the profit for me in all of this! Get out of my sight, you gloater!"
  ],
  "Reldo": [
    "Hello there. How can I help you today?",
    "I'm afraid I'm a busy man. I can't just answer general questions, you know.",
    "Oh, yes. I have been sold some documents recently by that rascal Ali Morrisane.",
    "Oh, sorry, those documents and that pyramid, yes, yes.",
    "It's not quite that easy - firstly explain what you need exactly.",
    "Well, that sounds fascinating and I'd love to help. The documents Ali Morrisane sold to me do indeed contain the information you seek.",
    "The documents appear to be a partial life history, which would go a long way to explaining the personality of this entity. If I can copy the document you can certainly have the original, but I need to be sure I am copying it correctly. In order to ensure that certain symbols are as they should be in my copies, I would require some other documents of the same period, in the same hand.",
    "If you have one of those Al Kharidian flyers I can see what I can do in order to help with my studies. Do you happen to have one in your bags?",
    "Excellent, yes, this is certainly an example of a palimpsest.",
    "A document where you can see several sets of writing on top of one another. Ali's cheap nature means the papyrus wasn't fully cleaned, so I can make out the writing below. This flier looks like it also contains a series of ritual praises for the Pharaoh Queen.",
    "It is great, not only have I some additional script to work with, but my initial copies were accurate. You may take the original if it is of use to you, with my thanks.",
    "Quite so, I believe the flier lad plies his trade at the far northern part of Al Kharid, a mere stroll from here. I'll wait while you fetch one.",
    "Hello there. How can I help you today?",
    "How goes the matter of the mummy's personality?",
    "Luckily for you, I have obtained it once more through channels you need not be concerned with. Try not to mislay it again.",
    "I have important matters to deal with, try not to bother me with idle chit-chat."
  ],
  "Pharaoh Queen": [
    "Greetings, traveller.",
    "Yes indeed, this reminds me of my name, although I can tell there is much wrong in this version.",
    "Yes indeed, this reminds me of my name, this version seems perfect.",
    "Yes indeed, this reminds me of my personality and deeds. I thank you for this gift.",
    "I am anxious to converse with the one who sent you and see why she seeks my wisdom. What is it you wish to work upon?",
    "You must restore all four canopic jars, my body and my hand to their places in this chamber. By this I will be physically complete.",
    "My body is restored fully, there is nothing more you can do.",
    "By restoring all of my grave goods, my body double will be able to replace me in the afterlife so that I may concentrate upon the realm of the living. You must restore the statue of me, the ushabti, to its former glory. You must also replenish the spiced wine and the pot of wheat, and repair my furniture. When all of this is done, you will have served well.",
    "My body double is restored fully, there is no more you can do.",
    "My spiritual place is restored fully, there is no more you can do.",
    "My use-name, Senliten, is not the full name that identifies me in the great scheme. This name was written upon a papyrus on the upper level of this tomb. You must recover this and return it to me or its contents in order to give me a sense of my place in the cosmos.",
    "My use-name, Senliten, is not the full name that identifies me in the great scheme and the papyrus you have supplied is flawed. This name was written upon a papyrus on the upper level of this tomb. You must recover this and return it to me or its contents in order to give me a sense of my place in the cosmos.",
    "My name is restored fully, there is no more you can do.",
    "The deeds of my life are forgotten with the passing of years. These deeds were written upon a papyrus on the upper level of this tomb. You must recover this and return it to me or its contents in order to remind me what I once was.",
    "I am fully reminded of my past deeds, there is no more you can do.",
    "Even a Pharaoh is but a shadow of Tumeken's glory. Go to the shrine of Tumeken, ignite the flames there and defeat the shadows. This will reinforce my shadows as you symbolically defeat the darkness.",
    "I am fully reunited with my shadow, there is no more you can do.",
    "Tread softly in the land of the living.",
    "I have no memory of such a name.",
    "I am glad to be remembered. The solitude of the centuries weighs heavily upon the bearing of a Queen.",
    "I have talked with Leela now, she should be treated with respect by those who wish to go far.",
    "All will be revealed when the momentous times are come. Have patience and ancient wrongs will be righted.",
    "The ones who seek to steal are beset by my curses and become guardians. Irony is served as revenge.",
    "You were protected before you set foot in here, young one. There are conclusions to be made which may or may not be reached.",
    "You were protected before you set foot in here, young one. Once I would have said an excess, now my silence may tell you more than my words once did.",
    "I will answer to the best of my ability, but note well that until reunited my faculties are dulled.",
    "What history would you like to know?",
    "I was in life, ruler of these lands from the plains of Uzer to the forests of Ullek. From the new settlement of Sophanem to the untamed hunting grounds of the Bedabin.",
    "Lands rich in resources, granite, sandstone, timber and game. You seem surprised by this?",
    "I fear our enemies must have fallen upon us after my demise. We were ever beset from the North.",
    "Dark forces of which you are happily not fully aware. Ever plotting in the dark lands of Morytania. During my reign we defeat them temporarily with the aid of the Stern Judges. Icthlarin be praised for his strength and wisdom.",
    "If you wish to know more, you must further restore my faculties.",
    "I have never heard of this Zamorak you speak of, I assume he is a newcomer to this world.",
    "The Stern Judges, the facelss ones, are Icthlarin's workers in the lands of the living. They see all, wield great power and are reborn through death. What more fitting servants could he have?",
    "The Judges have a central mystery in that one of their numbers must die in order to give life to the others. You can see how this appealed to Icthlarin. They can also take any form they choose, any face that is of use. The power to rule is much enhanced when one's advisors can speak with traitors using the face of another.",
    "Like many of the servants of the gods, and indeed like the newcomer gods worshipped by most in the North, the stern Judges were not native to this world. Icthlarin, in his wisdom, foresaw that he would need servants to do his bidding among mortals. He thus transported the faceless ones to these lands.",
    "I am still recovering my knowledge in some areas and must admit that I do not know. Perhaps they were no longer needed and returned to their own plane. Perhaps they were freed by Icthlarin from their vows of obedience. It is a subject I will look into in due time.",
    "As you will know, the chief deities of these lands are Tumeken, the sun that gives life and punishes, and Elidinis, the water that gives life and soothes.",
    "Icthlarin is indeed powerful and exerts his force on the mortal world. While he is the force that brings life through death, Amascut is she who brings death through life. Together they maintain the balance.",
    "You may think this, yet mortals do not always see the purpose behind the ways of the immortal. For all that death is undesirable to the living, we must die or the lands would be overrun with our children and our children's children. Do not judge the deathbringer lest she judges you.",
    "Scabaras cleanses mind and body through solitude. His followers are always deep thinkers, coming to conclusions tempered by lack of distractions. If you wish for a life of study, you can do no better than to follow his ways. By example of the dunge beetle we learn that the unpalatable may be transformed into life through a proper attitude.",
    "I sense things are not as they were, that there is dissent where there once was cooperation. The ways of the greater powers are mysterious, yet this is something that worries me greatly. Perhaps the situation is able to be altered by you mortals, we will see in time.",
    "Friendly is not the phrase I would use to describe Amascut. You will be contacted, however, if ever I have plans to investigate this situation.",
    "I lived in defence of my realms, as all rulers do. I provided an heir in my son Osmumten, as a good ruler does, and guaranteed the continuation of both the realm and the bloodline.",
    "I pride myself that no notable occurrences occurred. This mastaba, however, my burial place and testament to my power; this was a thing not seen before.",
    "That is gratifying, imitation is flattery indeed. It is dissapointing, however, that my creation of such a thing is blurred by these later copies.",
    "I mention my bloodline, the power that is transmitted to this day. Interruptions and diversions are inflicted upon the true flow of power but you are righting the course, albeit unwittingly.",
    "Ichtlarin takes those who die into new life. Whether this is new life after death or new life instead of death is something only he can decide.",
    "In order to enter the afterlife in a full existence and not be reborn as a mortal, the deceased must be both mentally prepared and physically treated in their correct fashion. As a member of the royal bloodline, I was prepared mentally and destined to be worthy.",
    "As you will have realised, I am merely being returned to my proper state of burial. It is sometimes the case, for wise rulers such as I, to make themselves available to their descendants. By reassembling my burial place you will make it possible for me to contact the world of the living, even to talk to those not directly related such as yourself.",
    "A priest of Icthlarin is trained from their earliest days to be adept in these opreations, which they will only perform upon the devout and deserving. In most cases, of course, simple burial suffices. Most are not worthy enough to enter the afterlife.",
    "The process is more often twisted rather than mistakes being made - after all, Icthlarin is a deity and thus ratehr able to make good any minor mistakes by his devout followers.",
    "If certain parts of the separation process are performed out of order or upon a living victim, the victim will be caught in a state between living and death. They may also be bound to the will of a person who controls certain parts of the ritual or physical portions of the one so afflicted. Such things are not good to discuss without good reason however.",
    "Horrible, maybe; although the Stern Judgers were masters of the art. Sometimes foul deeds must be done in the pursuit of further good.",
    "Tread softly in the land of the living."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Missing_My_Mummy?oldid=35853599’"
  ]
}