{
  "Xenia": [
    "You're looking well, adventurer. Do you remember me?",
    "I'm Xenia. We met in Lumbridge, when you were rescuing a woman from some cultists in the catacombs.",
    "Ceril Carnillean wants his son, Philipe, to become an adventurer like we are. He tried to hire me as a tutor for the boy. I refused, on the grounds that I would never work for that windbag, so I recommended you instead. After all, you did such a good job in the Lumbridge catacombs.",
    "And I hope you'll act more responsibly in the future! Fortunately, Ceril doesn't know the truth. I told him that you saved his family from the cultists. He believes that he'll be in danger if he learns the secret of the cult, so he won't ask any awkward questions.",
    "You're welcome.  So, will you take the job?",
    "You're the right person for this job, so it had to be done. Will you accept?",
    "Yes, he remembers you. So, will you take the job?",
    "That's a shame; I really think you're the right person for the job. I shall keep the offer open.",
    "Excellent. Go and see Lord Carnillean for your instructions. I wish you all the best.",
    "Ceril Carnillean still wants you to train his son as an adventurer. Will you take the job?",
    "How did Philipe get on with the Cave Wolf Matriarch?",
    "When Ceril first offered me the job, I explored the cave and found her with her pups. Ceril's quest was completely ridiculous - stylised romantic rubbish and entirely safe. Philipe would only learn to be an adventurer if he were faced with a real threat. I stunned the Matriarch and buried her under a pile of rubble, so that she could emerge while Philipe was doing the quest. The ruse seems to have worked, from what I see. Philipe fought the Matriarch and found a little self-respect.",
    "Stop fretting. You were there to save the day if Philipe turned out to be useless.",
    "Thank you.",
    "I wanted Philipe to come face-to-face with the unexpected. If he'd known about the Cave Wolf Matriarch, it wouldn't have been the same at all.",
    "Philipe has grown from a spoilt brat into a hero. Claim your payment from Ceril; you've earned it."
  ],
  "Player": [
    "Oh yes, you pretended to be hurt, then you guided me through defeating the cultists myself. What do you want this time?",
    "Doesn't Ceril hate me? When he hired me to find his armour, I joined the cult that had stolen it, and poisoned his dog.",
    "He hired me before, to retrieve some armour that had been stolen by cultists. I found that his own butler was part of the plot.",
    "Xenia mentioned something you needed doing.",
    "Yes. I haven't given her an answer yet.",
    "I haven't agreed to do it yet.",
    "...",
    "Hey, Philipe...",
    "I'll talk to you later.",
    "I'll talk to you later.",
    "Yes, I am.",
    "Thanks.",
    "I've agreed to train your son as an adventurer.",
    "Tell me more about the job.",
    "I see.",
    "Sure, sure.",
    "Sure, sure.",
    "How convenient.",
    "I'm making a quest for Philipe in the cave below this cellar. Will you help?",
    "I'd like you to walk back and forth in the cave, so that Philipe can sneak past you.",
    "I'd like you to guard the cave. Philipe will bring you a drink, you get drunk and pass out.",
    "Okay, I'll make sure Philipe brings the right wine. So, do we have a deal?",
    "I'd like you to pretend you're a dragon. Philipe will come along and slay you.",
    "...alright, I'll offer you a different job.",
    "I'd like you to be the damsel in distress.",
    "I'll tie you up, and Philipe can rescue you. Then you... uh... embrace him.",
    "Perhaps you could help. I need a damsel in distress for Philipe to rescue.",
    "Construction is in progress.",
    "So, if you like acting, would you want a part in the drama I'm directing?",
    "You'll be a guard, patrolling your base to watch for marauders.",
    "You'll be a lazy guard who gets drunk and passes out on the job.",
    "You'll be a dragon.",
    "No, you're a dragon, and you get killed.",
    "You'll be a damsel in distress, held in a cave. A hero will slay the dragons, untie you and carry you out to safety.",
    "Great. It's an improvised play, so there's no script to learn.",
    "There's bound to be something suitable in this mansion somewhere.",
    "Yes, I have some twine.",
    "Hey, Philipe...",
    "I'm just looking around.",
    "I'm making a quest for Sir Ceril's son.",
    "But you're not human-shaped.",
    "Wow. I wish all goblins would agree so easily.",
    "I want you to patrol the corridor. A boy will walk through the cave later. If you see him, I want you to shout.",
    "No, I just want you to patrol the corridor and shout if you see him.",
    "I want you to guard the bridge. A boy will come and offer you some wine. Drink it and pass out.",
    "I want you to pretend you're dragons, so that a boy can come slay you.",
    "That would, indeed, be what the job requires.",
    "I want you to be a damsel in distress. I'll tie you up, and, when a boy rescues you, I want you to embrace him.",
    "It'll come.",
    "Hold on to it, please.",
    "Okay, this is where you're supposed to be tied up.",
    "I haven't got anything with which to tie you up.",
    "Actually, it's a prop. When your hero rescues you, you can give it to him in thanks.",
    "Hey, Philipe...",
    "Please listen, brave adventurer. An innocent girl is being held prisoner in a cave, deep below Ardougne. Will you take up arms and rescue her?",
    "Oh. Will you do the quest anyway?",
    "It's not pointless. Listen...",
    "Let me talk to you about that quest again.",
    "I...do not have your sweets.",
    "Come on, climb over the ledge. It's not that hard.",
    "Quiet now, there are some guards here. You've got to sneak past them.",
    "Just sneak past them, okay?",
    "Um, I'd better go and get the guards to adjust their patrol slightly.",
    "Wait a moment, I need to talk to you.",
    "No, please stop for a moment.",
    "...",
    "Wait a moment, I need to talk to you.",
    "Thanks, that was very helpful. You two can stop patrolling now.",
    "Well done getting past the goblins.",
    "Don't you have anything on your toolbelt?",
    "This should help you cut through the tripwire.",
    "There's a guard at the bridge.  You've got to disguise yourself so you can approach and get him drunk.",
    "Oh, right, I see.  Well, he'll see you and sound the alarm.",
    "There'll be combat soon enough. Now, you need a disguise and some of your father's fortified wine.",
    "Here's your disguise.",
    "Your father suggested it.  If the guard recognizes you, he won't accept the drink.",
    "This isn't part of the quest! Get away from that thing!",
    "Philipe has completed the quest! He defeated a Cave Wolf Matriarch!",
    "It wasn't there when I set up the dungeon...",
    "You knew about the Matriarch? Why didn't you tell me?",
    "Speaking of Philipe, where is he now?",
    "I'm glad it worked.",
    "Philipe gave it to me in thanks for my help.",
    "I see you're still here.",
    "That's nice."
  ],
  "Ceril Carnillean": [
    "That's right. That dratted woman took the job, poked around my cellar for a bit, then said she was too busy! Has she offered the job to you?",
    "Bah! Opportunities like this don't come along every day. Go tell her that you will do the job I gave her.",
    "Good. That dratted Xenia woman took the job, poked around my cellar, then said she was too busy! The old bat is obviously losing her marbles. She kept forgetting to address me as 'Sir'.",
    "Henryeta and I have been concerned about the lad for a while now. We're not getting any younger, you know, and it will soon be Philipe's turn to represent the noble Carnillean family. Thing is, the lad just hasn't got the spark. He doesn't take the blindest bit of interest in anything beyond the next meal. Henryeta and I hired tutors to teach him natural philosophy, sports, art - everything. He just isn't interested. We thought Philipe would buck his ideas up if he had a girl to impress, so we invited a friend's daughter to stay here. Sarsaparilla's a good match for Philipe: very good bloodline. But Philipe claims she's boring, and she's hardly happy with him either.",
    "If Philipe can pass himself off as an adventurer, he'll be respected in the king's court. So, I want you to create a quest for him.",
    "These quest things are all the same, aren't they? I know how they work. Creep through cobwebs, perform a death-defying stunt, sneak past guards, disable fiendish traps... Disguise yourself as a humble maid to get a jail guard drunk, slay some dragons, untie the damsel in distress and return home loaded with riches! The cellar wall collapsed recently, and we found a passage leading into a cave. I'm sure you can create the quest down there.",
    "Use anything from the mansion, but don't bring your own supplies. If I let you bring materials in, you'll expect to be reimbursed later. I'm not having that. Crichton, the butler, knows what I expect. He will supervise your work. Go and meet him now.",
    "Create a quest for Philipe in the cave beneath my cellar. The butler knows what I expect. He will supervise your work.",
    "What? How dare you suggest we've neglected the boy! I'll have you know that he's wanted for nothing. All his life, he's had the best nursemaids, servants and tutors that my money can buy.",
    "You haven't even done anything yet. I'm not paying you to waste time.",
    "Let me know when Philipe's completed my quest.",
    "Ah, it's you again.",
    "Have you finished yet? Crichton should be able to help you with anything you need.",
    "Have you two finished yet?",
    "So, get on with it!",
    "Jolly good. Let me know when the kid's finished.",
    "I see you've returned. How was it, Philipe?  Do you feel like an adventurer?",
    "What's this?  I didn't say anything about a wolf. Why was there a wolf in my quest?",
    "A Cave Wolf Matriarch, eh?  That's...most impressive. Jolly good show. Jolly good show indeed.",
    "Bah!  It's that adventuring woman again. We don't need her anymore.",
    "You, go get rid of her. I want some quality time with my son now. I need to tell him how proud I am of him.",
    "Adventurer, I cannot thank you enough. You've completely transformed my son.",
    "Philipe's left home; he said he 'wanted more adventures'. Couldn't be more proud of him. You have certainly earned your reward. I've had Crichton set out your reward in the chest, just here. Philipe's left something for you too. Search the chest to claim it all."
  ],
  "Butler Crichton": [
    "'Ello, mate. Welcome back to Sir Ceril's mansion.",
    "You know more than me. Butler Jones got arrested after you exposed him as a spy. Still locked up somewhere, I suppose, but we needn't worry about him. Ceril might have tried other butlers after 'im; I don't really know. Still, he seems happy enough with me.",
    "Butler Jones? He quit his job and left. Said his 'work here was complete', whatever that means. Weird chap.",
    "The Carnilleans are one of Ardougne's richest families. They're snooty, but there's no harm in them. They're bound to have a book on their history somewhere in the house, if you want to know more.",
    "Oh, I save all the formal stuff for Sir Ceril and the family.",
    "'Ello, mate.",
    "That's right. His Nibs told me the plan. If you're ready, let's get started.",
    "Okay. Let's start by going down to the cave to have a look around. Then we can plan the quest.",
    "Okay.",
    "Okay.",
    "What's up?",
    "We're supposed to be going down to the cave, through the hole in the cellar wall. We can plan Ceril's quest once we're down there.",
    "Sure thing, mate. Catch you later.",
    "Okay.",
    "Shall we get on with the job?",
    "Okay. Ask me if you need any advice.",
    "Okay.",
    "I regret that our work is not yet complete, my Lord.",
    "Oh yeah, this place is great for the quest. You can decorate the hole, in the kitchen, with a cobweb for the young master to creep through. His Nibs wants the brat to do some 'feat of agility'. There's a ledge he could climb across. There's a nice junction here for guards to patrol. Gah! A goblin camp.  Goblins get everywhere. The arches are supported by flimsy struts. You could set a trap here. Huh. It sounds like there are creatures living in here. Smells like it too. Get someone to guard here and the kid can get 'em drunk. This area would be a grand place to put the damsel in distress, guarded by some dragons.",
    "Oh, Ceril may have no idea what he's doing, he gets things right occasionally. Law of averages, y'know. Now, let's get to work!",
    "What's up?",
    "Let me think... No, there's more work to be done.",
    "Well, you could look for fabric that might be arranged to look like a cobweb over the entrance to the cave.",
    "Perhaps you could arrange that netting to look like a cobweb over the entrance to the cave. It wouldn't fool a fly, but it might fool the brat.",
    "You've already put up a pretty nice cobweb, mate.",
    "There's a narrow ledge just inside the cave. Stick an obstacle beneath it and the kid will have to climb across.",
    "Now you've got your pool of water, the brat will have to climb across on the narrow ledge.",
    "Now you've got your pit of spikes, the brat will have to climb across on the narrow ledge.",
    "There are two goblins in the cave. I'm sure you can persuade them to do the job.",
    "Those two goblins seem willing. Give them Ceril's old heraldic kit; he's too fat to wear it, anyway.",
    "You've got those two goblins, ready to patrol.",
    "Have a look at the crumbling arches where the goblins live. I bet some tripwires would make 'em fall down on the brat's head, if he isn't careful.",
    "You've set up a nifty pair of tripwire traps.  They should bring the arches down on the brat's head.",
    "We need a volunteer who'll get drunk. Claus, the chef, is always up for a drink.",
    "You'd better lead Claus to where he needs to wait.",
    "You've got Claus in position. Make sure you've got a disguise for the brat.",
    "I doubt you'll find dragons in the cave. You might find creatures to dress up as dragons, though.",
    "You've led some wolves to the right place. Now, disguise them as dragons with the stuffed heads you found.",
    "That's one dragon sorted. Dress up the other one and we're done.",
    "You've made a couple of dragons for the brat to fight.",
    "There are only two women in the house. See if you can get one of them to help.",
    "I'd get Miss Snotty-nose down to the cave. If I were you, I'd leave her there.",
    "You've got Miss Snotty-nose tied up in the cave. If I were you, I'd leave her there.",
    "You'll need to place something valuable in the dungeon where the brat will find it.",
    "The brat could loot the guard once he's drunk. Or the distressed damsel could hand him some jewellery.",
    "Perhaps you could give the money pouch to the jail guard. The brat can loot him once he's passed out.",
    "Perhaps you could give the necklace to the distressed damsel. She can hand it to him as his reward.",
    "You've given Claus a bag of money. The brat can loot it from him.",
    "You've given Miss Snotty-nose a shiny necklace. She can 'bestow it on her gallant saviour' when he rescues her.",
    "Look out for places where you can build decorations in the cave. Try to make 'em scary; I want to see the brat squeal.",
    "You've put up some decorations. That'll satisfy His Nibs, but you could put up more if you liked.",
    "You've put up three decorations. That's plenty.",
    "Okay.",
    "Okay, follow me.",
    "Okay.",
    "She thinks you're a servant! Haha!",
    "Wow, she yammers on and on.",
    "Kids these days are always thinking about breeding. One-track minds, that's the trouble. I blame the parents.",
    "Let's leave the brat alone until we've set up the quest.",
    "Let's leave the brat alone until we've set up the quest.",
    "Ooh, Ceril's money would be a nice reward for the brat to find. Go on, take it!",
    "You've already got Henryeta's necklace. You don't need any more of the family's valuables.",
    "Ooh, Henryeta's necklace would be a worthwhile reward for the brat to receive. Go on, take it!",
    "You've already got Ceril's money pouch. I don't think you need any more of the family's valuables.",
    "Maybe you shouldn't drop the mouse. While you're carrying it, you can lure those little wolves around the cave.",
    "...and you've finished! Great work. Let's go get the brat.",
    "What's up?",
    "We need to get the brat, so he can do the quest.",
    "The quest has been created in accordance with your specifications, my Lord.",
    "The quest has been created in accordance with his Lordship's specifications, my Lady.",
    "Philipe will require:Shears or secateurs to cut the tripwireA disguise and a drink for the jail guardA sword to fight the dragons",
    "The quest has been created in accordance with his Lordship's specifications, my Lady.",
    "What's up?",
    "You need to lead the brat through the quest, otherwise he'll get lost. I'll narrate as you go along.",
    "Let's go and tell Ceril what happened.",
    "Okay.",
    "An unfortunate oversight, my Lord. Nevertheless, Master Philipe defeated the Cave Wolf Matriarch and saved everyone."
  ],
  "Henryeta Carnillean": [
    "Ah, it's you again. How are you getting on with Ceril's project?",
    "What? But you must! Ceril and I are counting on you.",
    "Philipe? What do you want to know about him?",
    "I expect he will rise to the challenge. After all, he is a Carnillean; we are a very distinguished family.",
    "I resent the implication that the boy has been neglected. We have always hired the finest nurses and tutors for him-",
    "One of Philipe's tutors referred to him as such. The man was immediately dismissed. Be warned.",
    "Very well. Carry on.",
    "I should think so, too.",
    "Ahem. More work and less chit-chat will help you along, don't you think?",
    "Ah, it's you again. How are you getting on with Ceril's project?",
    "I am afraid I don't have time to play in Philipe's little games.",
    "Do keep Ceril informed of your progress.",
    "I do not recall asking for your advice! Now, get on with your work.",
    "Ah, it's you again. How are you getting on with Ceril's project?",
    "Oh? I am glad to hear it. Carry on.",
    "Ah, it's you again. How are you getting on with Ceril's project?",
    "Very well. Carry on.",
    "Ah, it's you again. How are you getting on with Ceril's project?",
    "I was not talking to you, child.",
    "Very well. Carry on.",
    "Ah, it's you again. How are you getting on with Ceril's project?",
    "I am glad to hear it. Carry on.",
    "My family does not indulge in gratuitous displays of emotion in front of the staff.",
    "Yes, he will wish to hear your report.",
    "Ah, it's you again.  You certainly made a strong impression on Philipe.",
    "I see you have my necklace.",
    "I see.  Nevertheless, would you be willing to return it?  I would pay you handsomely.",
    "Very well.  My offer remains open."
  ],
  "Philipe Carnillean": [
    "What do you want?",
    "Nothing.",
    "I'll inherit this mansion, of course. Not that it's any of your business.",
    "What do you want?",
    "Nothing.",
    "I'll inherit this mansion, of course. Not that it's any of your business.",
    "Not interested!",
    "I overheard my parents planning this - that they'd hire someone to build a fake quest for me. They think it'll build character.",
    "That's lame! Now, go away. My father's bought me some sweets, and I want to eat them in peace.",
    "You again? I hope you're not trying to make me do that pointless quest.",
    "You again? Have you seen my sweets? I had a whole bag, but they've gone missing.",
    "A beautiful girl? You mean Sarsaparilla? She's boring, never wants to play. Besides, girls smell. And they've got cooties.",
    "Why bother? My parents are richer than you could imagine, and this mansion will be mine one day!",
    "My parents never notice anything I do.",
    "My sweets? Do you have them?",
    "Huh. Alright, I'll do your stupid quest. You can be my sidekick, and carry my equipment. Have you got the items I need?",
    "Well, get a move on. I want those sweets you promised.",
    "Well, get a move on. I want those sweets you promised.",
    "Good, leave me alone. My father's bought me some sweets, and I want to eat them in peace.",
    "Good, leave me alone.  I've lost my sweets, and I want to look for them.",
    "You got the required items? Then you can show me where I'm supposed to go.",
    "Are we there yet?",
    "Stop wasting my time.",
    "Stop wasting my time.",
    "Hello, mother.",
    "Okay, mother.",
    "Ugh, this place is filthy.",
    "Show me where we're supposed to go next.",
    "I'm supposed to cross this, am I?",
    "Can you make Butler Cretin shut up? I bet real adventurers don't have to put up with lame voice-overs on their quests.",
    "I know! This whole quest is fake. How can I feel like an adventurer when I'm just in a stupid playground?",
    "Yuck - it's Sarsaparilla, isn't it? No thanks.",
    "Boring!",
    "Ewww, there's blood everywhere!",
    "Woah!  There's something inside the wall!",
    "A load of skulls on spikes! Grim!",
    "Can't we kill them instead?",
    "I think you're supposed to turn me into an adventurer, not a vegetarian.",
    "Not if I can kill them really, really fast. Can I try?",
    "Can't go now...",
    "Can't go now...",
    "I give up! This quest is broken. There's no way to get past those guards; one of them is always watching. Is it a glitch?",
    "Bet you didn't test it.",
    "Go and fix those guards.",
    "Thanks. But it wasn't that hard. Show me where to go next.",
    "What's this supposed to be?",
    "I'm not stupid, and you're not funny. It's a trap. Give me something to cut it.",
    "Toolbelts are for the working classes.",
    "You're not supposed to give out spoilers. Anyway, give me something to cut it.",
    "Phew, I did it!",
    "Huh, it's not hard.",
    "Why can't I just kill him?",
    "Father says that, if adventurers didn't kill guards, Ardougne would get a budget deficit from pension funds. The global economy would be ruined.",
    "Who designed this quest? It's got no combat at all?",
    "You're kidding me.  I'm not wearing that!  Whose idea was this?",
    "My father wants me to wear a dress?  I knew it!  They wanted a daughter instead!",
    "Ahem?",
    "Brave guard, you must be weary from your long vigil.  Pray take your rest and sup with me awhile.",
    "Just take the drink!",
    "Hey, I found a big bag of money!",
    "Now I can get this stupid dress off.",
    "We will never, ever, tell anyone that I wore that dress.  Now, what are these creatures supposed to be?",
    "Mighty dragons?  Come on, dragons are meant to be terrifying beasts, with wings and fangs and flames.  They shouldn't smell of wet dog fur!",
    "Lame! Give me a sword anyway.",
    "I'm fed up with everyone treating me like a kid! Give me a sword anyway.",
    "Come on, let's get this over with.",
    "Your quest is finally getting food.  You should have let me skip all that Agility rubbish and jump straight to this boss monster.",
    "No way – I'm going to kill it!",
    "Don't tell me what I can't do!  Just try to distract the wolf for me.",
    "Yes! Try to distract the wolf for me.",
    "I did it! I killed the Cave Wolf Matriarch!",
    "Too right! Now, I'd better untie Sarsaparilla.  She must have been terrified of that thing.",
    "Oh, it wasn't that difficult.",
    "Um … thanks!",
    "Ooh...",
    "Let's go and tell my father what happened.",
    "I can't wait to tell him.",
    "Yes sir, I had an incredible time.",
    "Thank you, father..."
  ],
  "Sarsaparilla": [
    "What is it?",
    "My name is Sarsaparilla. My father is a close friend of Sir Ceril and Lady Henryeta.",
    "Sir Ceril and Lady Henryeta have kindly invited me to stay in their mansion. My parents were pleased by the invitation; they wish me to spend a season in the city to experience the social scene.",
    "Oh? Very well, be about your business.",
    "What is it?",
    "I would prefer to have no dealings with that boy! Please leave me alone now.",
    "What is it now?",
    "It would be improper for a guest to pass comment on her hosts, especially to a servant.",
    "If you aren't capable of fulfilling your duties, Sir Ceril will have you replaced.",
    "I must confess, there is very little of interest in this city. My parents said I would meet young men of good family, and maybe find a husband. However, I do not feel ready for marriage. I am still only fifteen, and I have other ambitions.",
    "Ahem. I'm sure our parents would consider us to be an excellent match for each other, but I find him a bit juvenile.",
    "When I was a little girl, my father took me to the theatre. There was a girl in the play: young, but incredibly talented. She held the audience spellbound with her every gesture, and her voice could reach the farthest corners of the theatre, clear as a bell. Ever since that day, I have longed to be an actress; to don the guise of a romantic heroine and tread the boards, even just once. However, while such a career is considered suitable for peasants and people of no importance, I must take a husband and continue my family line.",
    "Do not speak to me of destiny, servant! I know my role in life, and I shall act my part faithfully.",
    "Oh? Please tell me more. What sort of role is it?",
    "Oh no, that sounds terribly mundane. I need a role with passion and drama.",
    "I think I'd rather not!",
    "Am I a maiden who's been transformed into a dragon by an evil witch? Will the hero undo the curse and save me?",
    "Oh, I'd rather not!",
    "How simply marvellous! I shall certainly accept the role, my dear Director.",
    "Will you take me to the place where I'll be performing this drama?",
    "Splendid. Now, you said that the hero would have to untie me. I hope you've got something suitable to tie me up.",
    "I shall work on my motivation while I wait.",
    "Do come back soon. I have enjoyed our conversation.",
    "Hello again.",
    "What is it, Director?",
    "I shall wait in my room.",
    "It's an inspiration to watch you work, Director.",
    "My dear Director, are you ready to show me where I must stand for this drama?",
    "Certainly. Whatever our Art requires.",
    "Please don't touch my clothes.",
    "What are you doing, Director?",
    "If this is what our Art requires, I have no objection. Search away, my dear Director.",
    "My dear Director, while I understand that artists are entitled to whimsies, I would nevertheless prefer that you leave my clothes alone.",
    "I am ready, Director.",
    "Director, if I am to play this part with the dramatic intensity it deserves, I shall require adequate props. Please find something!",
    "Mmmmph!",
    "Mmmmph!",
    "Mmmph?",
    "Mmhmm.",
    "MMMPHH!",
    "Philipe! You saved me!",
    "Take this necklace as a token of my eternal appreciation.",
    "My hero!",
    "We should go and inform Philipe's parents of his triumph.",
    "Very well.",
    "He was amazing, Sir Ceril. He killed a huge, spellcasting wolf with just a sword!",
    "Yes, we've got our own adventurer now.",
    "Hello again.",
    "Yes, Sir Ceril and Lady Henryeta let me stay.  I get to see Philipe whenever he passes through Ardougne."
  ],
  "Claus the Chef": [
    "Hello. I see you're working for Ceril again.",
    "I hope he pays you. He can be proper stingy sometimes. You know he won't build stairs up from this kitchen? I have to carry his dinner up the ladder!",
    "Hey! No-one's given you permission to go down there.",
    "It'll make a change from slaving in this kitchen, I suppose. What do you want from me?",
    "Walk back and forth? Sounds like exercise to me. Can't I do something else?",
    "Eh, I can get drunk any time I like. I might even be drunk now. If you want my help, bring me some of Ceril's fortified wine.",
    "Since you've asked so nicely, I will drink the wine as a personal favour to you! See you in the cave.",
    "How stupid do you think I am? I'm not having that kid come and kill me! When I die, I want to be ninety years old, and so drunk that I don't even notice I'm dead.",
    "...why?",
    "I don't think I'm the right person for that job.",
    "You'll have to show me where I'm supposed to be.",
    "You're the boss.",
    "You're the boss.",
    "You'll have to show me where I'm supposed to be.",
    "Alright, but you'll have to show me at some point.",
    "You're the boss.",
    "Another hour of this and I'm off – Oh, hang on, what've we got here?",
    "Heavens preserve us, it's the kid. In a dress.",
    "Do what with you awhile?",
    "The drink! Finally! Give it here, kid.",
    "* snore *"
  ],
  "Nostrillia": [
    "What you doing here, human?",
    "I already asked that.",
    "Humans not come here much, 'cept for old woman earlier.",
    "You sweetiepie, Slimepits.",
    "She look around cave earlier. We heard her set off rockfall somewhere, but she came out alright.",
    "You sweetiepie, Slimepits.",
    "This is our home! You make quest here, you work around us. We not going.",
    "Wait, we not work for free. Human must pay us.",
    "Ignorant hippie! World not work like that. Now, shut up and let Nostrillia do talking. We help if you help us. We hear goblins on surface got armour, but we got none.",
    "So, we want armour. Not the same as surface goblins, though. We want human armour. Armour for me, and helmet for Slimepits.",
    "Goblins on surface wear goblin armour. Human-shaped armour better, though, so we want that.",
    "But purple is a stupid colour for armour!",
    "So, what you want us to do, human?",
    "Yes. But we getting paid, so we do it anyway.",
    "No, Slimepits. Alcohol rots the liver and soul.",
    "We do something else instead.",
    "We not that stupid. Offer us different job instead.",
    "Not embracing human boy. Boys smell bad. Offer us different job instead.",
    "You got human armour for us, human?",
    "It okay, human, we patrolling like you said.",
    "It's okay, human, we patrolling like you said.",
    "Nostrillia busy patrolling. Talk later.",
    "We talk later, human. Nostrillia is smart goblin doing good job, not stupid goblin like Slimepits."
  ],
  "Slimepits": [
    "Yeah, what are you doing here?",
    "Oh.",
    "Old woman human not as pretty as Nostrillia.",
    "Huh. Old woman came earlier and said that, but she's gone now.",
    "Old woman human not as pretty as Nostrillia.",
    "Human should listen to Nostrillia. She clever as well as beautiful.",
    "Ooh, we get to help human! Sound fun.",
    "Why we want paying? We got plenty of time. I say we do it to be nice.",
    "Nostrillia look pretty without armour on.",
    "Why would Slimepits want Nostrillia to be human-shaped? She a lovely shape already.",
    "We not know much about human armour. Just bring us armour that a human wears.",
    "What colour that supposed to be? Proper armour should be purple.",
    "Okieday, Slimepits agrees with Nostrillia.",
    "Shout if we see a little human? We kill him for you now. Much easier.",
    "This sound stupid to you?",
    "We get drunk? Slimepits like this job.",
    "Aww.",
    "Slay us? You want him to kill us?",
    "Slimepits not like the sound of this.",
    "You be careful, human. Dangerous things in this cave.",
    "What now, human? You still making quest?",
    "It okay, human, we patrolling like you said.",
    "It okay, human, we patrolling like you said.",
    "Okay, Slimepits listening."
  ],
  "[Nostrillia/Slimepits]": [
    "It's okay, human, we start patrolling in a bit.",
    "It's okay, human, we patrolling like you said.",
    "Thanks for armour, human. Hope your quest turned out alright."
  ],
  "Claus The Chef": [
    "Right, I'll wait here.",
    "Come on, you promised me a drink!"
  ],
  "Claus the chef": [
    "Cash? What's this for?",
    "Right on!"
  ],
  "Narrator": [
    "Young Master Carnillean gingerly brushes aside the cobwebs that veil the ominous cave, and embarks on his great adventure.",
    "Young Master Carnillean gazes, undaunted, at the trials set before him.",
    "Young Master Carnillean and his loyal sidekick fearlessly cross the Chasm of Certain Death.",
    "The intrepid Master Carnillean waits for his moment. He waits...",
    "...and waits...",
    "...and waits some more...",
    "Master Carnillean seizes his opportunity, and makes a bold dash for it!",
    "The dexterous Master Carnillean craftily severs the Lethal Tripwire of Ultimate Doom!",
    "The dexterous Master Carnillean craftily severs the Second Lethal Tripwire of Ultimate Doom!",
    "Master Carnillean adopts a brilliant disguise to bamboozle the foolish guard.",
    "Young Master Carnillean finds himself confronted by two mighty dragons, towering over him with fire dripping from their jaws.  He steels himself for the ultimate battle.",
    "Master Carnillean fearlessly plunges into the fray against the terrifying dragons!",
    "The fearsome Master Carnillean proves his might by dispatching the deadly foe!  All hail Master Carnillean!",
    "As the triumphant Master Carnillean escorts the fair Sarsaparilla to safety, the handsome narrator returns his bag of sweets."
  ],
  "Philipe": [
    "Take that. Too easy."
  ],
  "Congratulations! You have completed": [
    "'Carnillean Rising' - Complete this Intermediate quest."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Carnillean_Rising?oldid=36076700’"
  ]
}