{
  "Due to (an) update(s), this article may be out of date.Reason": [
    "updated dialogue with Kenel, Philop and Gertrude after sawmill removal You can help improve this page by editing it."
  ],
  "Postie Pete": [
    "Hey there! Player!",
    "Got a letter for you, boss.",
    "Not if I see you first!"
  ],
  "Player": [
    "Thanks, Pete, see you later.",
    "Not right now.",
    "Aaarrrrrr!",
    "I dunno, I thought you might be an...'Aaaarrrmadeeelean'.",
    "So, how are things?",
    "I mean, how are you? Everything good? How are the wife and kids?",
    "That's...yeah, I have no idea what that's even supposed to mean.",
    "Still catching pirates?",
    "You mean their rehabilitation, right?",
    "Why are you saying that in such a creepy monotone?",
    "That's...that's not even an answer. So, moving on...",
    "You look a little pale, are you coming down with something?",
    "But it's warm and sunny outside.",
    "Touché.",
    "I would like to confess!",
    "What?",
    "Yeah...no...sorry, I don't think of you like that.",
    "...",
    "Err...well...this is awkward now...",
    "Really? No one? Ever? No one who looks eerily familiar?",
    "Hey! You! Let me out!",
    "I was so sure that would work.",
    "That's a lot of angry looking crabs. Those pincers look frighteningly sharp. I wonder if I can make any sort of convoluted use of that...",
    "Pssst.",
    "SHHHH! Over here!",
    "By which you mean pirate.",
    "You're fooling no one. You have the stereotype 'arr' compulsion and everything.",
    "Where?",
    "Hello?",
    "I asked you that...",
    "No, that's why I asked you.",
    "Are you just copying me?",
    "Psssst, Bill! Over here.",
    "I got your letter. I take it your investigations didn't go well?",
    "What's going on?",
    "Any idea how we get out of here?",
    "On it! Hold tight, I won't be long.",
    "What am I doing?",
    "Well, hey. Look who's going to rot in their cell for the rest of time.",
    "Don't suppose you know what's going on?",
    "Curses! Arbitrarily squishing random objects against this door has failed to grant me freedom!",
    "No, you can't.",
    "Urgh, FINE! I mean, you do realise there's a massive hole behind me, so escaping is trivial, right?",
    "What? Dee-de-dee, nothing to see here.",
    "Hrmm, this gives me an idea, but I need a creature other than a rat to distract these guards.",
    "This is accomplishing nothing. I'm not sure why I thought it would.",
    "Baron von Hattenkrapper?",
    "Ow! The little blighters nipped my fingers and I've dropped the hook. I wonder if Eric has any spares.",
    "Sharpening it further might tear open a hole in the fabric of the universe. Probably best not.",
    "I offer this sacrifice to thee, oh mighty crab overlords.",
    "Well, that was fruitless. Oh no! I dropped the hook in with the fish. I regret all my decisions.",
    "I dread to think what these crabs would do with such an offering.",
    "Erm...something useful?",
    "Hrmm. I could probably get more mileage out of that fish if I didn't just throw it down a gull's throat.",
    "Without the seagull, this is just a rock. I probably can't get much more use out it. Best let it be.",
    "Chinchompa blood can't melt steel beams!",
    "I'm lonely and confused and like shouting for no reason!",
    "If Gielinor isn't flat,how come water doesn't roll away?",
    "The Great Brain Robbery was an inside job!",
    "There was a second stabber at Zamorak's ascension!",
    "That achieved nothing, but I did enjoy it.",
    "Ah, sweet freedom.",
    "What now?",
    "I should probably deal with the guards before I try to pick any more locks.",
    "I have all the crate I could ever need right now.",
    "There's nothing more in here except...urgh...why are there barnacles growing on the inside of this thing?",
    "I'm not sure what use that would be right now.",
    "I probably shouldn't risk being captured by the guards.",
    "Moving these would let the guards back in, which seems counterproductive.",
    "What now?",
    "I should try and set Bill free first.",
    "Oh, come on! How am I going to get the doors open now?",
    "Pssst.",
    "SHHHH! Over here!",
    "Er, right, fine, I'll think of something else.",
    "Nope. Stop talking. I'm... Nope. Nope, nope.",
    "Big fish, little fish, wooden box... Nope, all this does is give me ideas for a dance move.",
    "Mmmm, a delicious raw fish sandwich...",
    "Oh, dear. I think I'm gonna throw up. *Hlerg huey blehrgle*.",
    "Rats don't really like fish, do they?",
    "Hmm, he doesn't seem interested in fish.",
    "While this guard outfit is an unforgivable fashion sin, I don't think boxing it up and throwing it away is helpful right now.",
    "Though, it is really tempting.",
    "Should I stir the outfit? Hide a spoon up a sleeve? Eat the hat? None of this seems like a sensible plan right now.",
    "That seems like it would be a horrible sandwich...",
    "Hrmm, I don't quite think this works as bait.",
    "I've been told off for trying to squeeze random things into tight holes before.",
    "That seems like it would be a horrible sandwich...",
    "Odd, the rat doesn't appear to just want to leap into the box.",
    "That seems like it would be a horrible sandwich...",
    "I've been told off for trying to squeeze random things into tight holes before.",
    "I don't need a packed lunch just yet. But I get the sense that I'm on the right track, just missing a step. Hrmmm.",
    "Ouch! The little blighter stole the sandwich from me. If only I had some way of catching it.",
    "You bait the trap with a delicious cheese sandwich. It's almost irresistible.",
    "I cannot for the life of me think what value a pineapple in a box could offer in this situation.",
    "While it looks delicious, I think I need to use this pineapple somewhere else.",
    "It's a bit big to add to the sandwich.",
    "Is pineapple really the best bait for a rat trap?",
    "OI! YOU IN THE HOLE! GIVE ME THE HOOK BACK!",
    "DON'T YOU IGNORE ME!",
    "Meow!",
    "Meow?",
    "Meow...",
    "AHA! Got you!",
    "You're an ugly little ball of hate, aren't you!",
    "Hey there. Calm down, little buddy. Let's talk through this.",
    "Welp, that didn't work.",
    "Look, you. I'll be having none of this uppity nonsense. You and I are going to have a nice civil chat. Okay?",
    "No, you little...rat! What do you think you're doing stealing from me? Don't you know who I am?",
    "Charge! Go forth my ratty minion and destroy the guards!",
    "Right, give me the hook back, you horrible little rodent!",
    "So that would be an no then?",
    "Look, I'll level with you. We're all trapped on this tiny island with some really weirdly acting guards. People keep being taken away and then are never seen again. And there's something very strange about the guards down here.",
    "Here you go, little guy, have a nice little treat.",
    "Oh, I'm sorry, how terribly rude of me. My name is Player, it's a pleasure to meet you.",
    "It's a pleasure to meet you, Wilson",
    "Though, I'm not sure how I know your name is Wilson.",
    "Wait, what? What was that?",
    "Can I have the hook back now?",
    "Now my tiny rat minion. Go forth! DESTROY THE GUARDS!",
    "Quick, Wilson, show me the way out. I need to get out of here!",
    "I know, I'm sorry, I'm at terrible person.",
    "Wilson, help me, can you find a way to free my friends?",
    "Thanks, buddy, we've got this!",
    "Who's a cute little rattypoo? You are, yes you are...",
    "Okay, not cute. Very much not cute.",
    "I'm not sure what I was expecting there.",
    "Why won't this pineapple stick to this rat? What's coming to this world when fruit won't magically adhere to rodents?",
    "Yeah, Wilson doesn't seem to like me prodding him with that.",
    "Nothing happens. Why on Gielinor did I think it would?",
    "That seems like it would be a horrible sandwich...",
    "Hrmm, I don't quite think this works as bait.",
    "I'm sorry, you're right, a life behind bars is no place for a little rat like you.",
    "Hey, buddy, ready to break out of prison?",
    "I don't think bellowing into a rat hole is terribly useful.",
    "Meow!",
    "Meow?",
    "Meow...",
    "Okay, good, that's everyone free.",
    "Yeah, me too. Something fishy is going on here and I'm not leaving until I find out what.",
    "OW!  There's some sort of ward on this door, I can't open it.",
    "So, the door is warded in some way.",
    "Sensed?",
    "Okay, Jimmy, before you start repeating everything I say, shut up.",
    "Good lad. Now, I'm going to assume you've heard everything the guards have said. Do you remember the phrase they used before going through the stairwell door?",
    "Good work! When I check the door, I want you to repeat it, okay?",
    "Okay, Jimmy you're up.",
    "Okay, that was creepy, but at least we're through now.",
    "Nope, nope, nope.",
    "Okay. There's a terrible crab-thing guarding the stairs up. I need a way to sneak past it.",
    "Nope, nope, nope.",
    "Rats - locked.",
    "Curses, there's no more 'rum' in here.",
    "Nothing happens. Why on Gielinor did I think it would?",
    "That seems like it would be a horrible sandwich...",
    "I'm not sure there's much point in getting a rodent completely squiffy.",
    "Eeeeeegads, that's some strong stuff. I wonder if there's better uses for it, though.",
    "Maybe if I keep drinking it I'll get superpowers. Or liver poisoning.",
    "Do I have a problem? I mean, I'm in a prison full of monsters and I'm getting drunk?",
    "No, more, please. I'm begging you, oh invisible puppet master, don't make me drink more of this!",
    "Oi, *hic* whosh putsh that there? Shtop being there. Rude.",
    "Heeey *hic* yoush is really pretty. Give Player a kish.",
    "I deserv*hic*ed that.",
    "Hyuuuurrrrgh.",
    "Zzzzzzzzzzzzzzzzzzzzzz",
    "Oh gods, I feel so unwell.",
    "Dang, doesn't fit the lock.",
    "Dang, doesn't fit. I mean, maybe If I wish really, really hard and keep pushing it at the lock it'll work?",
    "I don't think this would make much of a distraction.",
    "There's a guard in that room. I don't think he'll fall for my disguise at all.",
    "I'm not sure I want to get that sticky right now.",
    "Nothing happens. Why on Gielinor did I think it would?",
    "That seems like it would be a horrible sandwich...",
    "Okay little buddy, I have a plan. It's a weird plan, but go with it, okay?",
    "There's nothing under here but dust and a rather angry-looking spider...",
    "While I do love me a fried egg, I should probably get out of here.",
    "Hrmm, this 'rum' does seem quite strong, I could probably set fire to these eggs.",
    "That should prove an appropriate distraction.",
    "I'm not sure what you... I mean, I... Existential crisis... WE? That'll work. I'm not sure what we're trying to accomplish here with that.",
    "We've got to go. NOW! Everyone, to the jetty, we can swim from there.",
    "Have some respect, they might be dead. If it wasn't for Eric and Jimmy we'd have never made it out of that prison.",
    "You're right, they were weak.",
    "We're on the coast of Karamja.",
    "Well, that was a surprisingly pleasant trip, almost no attempts at mutiny. I should go meet up with Bill in the secret basement.",
    "A Long Drop.",
    "Aye. Drop me...",
    "Aaaaah!",
    "Er, nothing?",
    "Okay, that's enough, guys. We have bigger fish to fry than noxious odours.",
    "We just escaped from the Customs and Excise prison, where they appear to be working with Mi-Gor to transform people somehow.",
    "AND Mi-Gor was talking to someone he referred to as his superior, which I think we can all agree can only be one person.",
    "If only there were one of those undead pirates with us now... Someone who was once a loyal soldier... Perhaps even one of the barrelchest monstrosities and has now been...rehabilitated.",
    "That, Madame Shih, is the information source we need. So, my decomposing friend, you're going to tell us everything we need to know!",
    "So, my decomposing friend, you're going to tell us everything we need to know!",
    "Okay, you sorry excuse for a head. You're going to tell me what I want to know, or you're going to be sorry!",
    "You're enjoying it?",
    "Okay, okay, I think we're starting on the wrong foot. We can be reasonable about this.",
    "I like your makeup, it's very...er...cute?",
    "Why don't pirates shower before they walk the plank?",
    "Because they'll just wash up on shore later!",
    "Why is piracy so addictive?",
    "They say once you lose yer first hand, ye get HOOKED!",
    "I know, I'm a terrible person.",
    "How do philosopher pirates know that they're pirates? They think, therefore they ARRRRRRRR!",
    "Did you hear what happened to the pirate that fell into the Red Sea? He got MAROONED!",
    "Errr, go past the fourth wall and turn left?",
    "How did the pirate get his Jolly Roger so cheaply? He bought it on a sail!",
    "I regret nothing. I still have more.",
    "What has eight arms, eight legs and eight eyes?",
    "EIGHT pirates!",
    "What lies at the bottom of the ocean and twitches?",
    "Oh, you know that one.",
    "How much did the pirate pay for his piercings? A buck 'n' ear!",
    "It's a joke, don't overthink how it fits into the canon.",
    "Canon, not cannon.",
    "Never mind.",
    "Where can you find a pirate who has lost his wooden legs? Right where you left him!",
    "Why did nobody want to play cards with the pirate? Because they were standing on the deck!",
    "When you've just got back into Mos Le'Harmless after a long voyage and you're hungry and broke, you know what's criminal? The pie-rates!",
    "Have you heard about the cannoneer that couldn't stop messing around on the job?",
    "He got fired!",
    "Oh, that actually happened to someone? Sorry...",
    "Why was the pirate banned from boxing?",
    "That's... actually better than what I was going to say.",
    "Nah, I'm no boxer myself, I couldn't deliver a better PUNCH line that that.",
    "Why can't you tell when the Eastern pirates get food poisoning?",
    "Because they have invisible salmon-ella!",
    "Err...that may be a little beyond my power.",
    "We could visit a pet shop, sure.",
    "Okay, that's one. What's the other thing?",
    "Do your worst!",
    "Didn't I just say that?",
    "Really? This is your tactic, repeating everything I say?",
    "What is this, interrogation by five-year-old?",
    "Lemons are just oranges that failed in life!",
    "Oh, ho! I see. I know who wore the green jumper - I KNOW, I KNOW!",
    "The world is flat! If it was round we'd all fall off!",
    "MAY THE RATS EAT YOUR EYES! THE DARKNESS COMES!",
    "My worst? Oh dear, how unfortunate for you. Such a proposal, why it fills me with such monstrous whimsy.",
    "I could tease you with just enough bare hints of lore that you feel you are on the cusp of the answers you so seek...",
    "And then I rip that joy away with an answer just vague enough to be meaningless.",
    "A monster? Oh, my dear zombie head, you haven't even begun to dream of the cruelties I could inflict upon you.",
    "Tell me. Is there anyone you care about? A friend...a lover...an ally in all of Gielinor that you want to see do well?",
    "Because I could tear them from you! I could submit them to the cruellest of torture and feast deeply on their delicious tears.",
    "The tears of agony are the sweetest, I think. Suffering, and just the subtlest hint of hope.",
    "I love hope. The most exquisite of torture devices. People will suffer so much longer, so much deeper, if they believe there is hope.",
    "But you shouldn't have hope, my friend. Oh no. No hope for you, you see I'm going to...no...I better not say...",
    "Spoilers!",
    "CURSES!",
    "I'll talk to you later.",
    "No yet, we're in a secret location now, it's time to tell us everything zombie head.",
    "Focus.",
    "Where's this island? Can you take us there?",
    "How's Wilson settling in?",
    "I don't see him.",
    "I may throw up.",
    "Hi, Gertrude. Don't suppose you have any more kittens lying about do you? My friend here would really like one.",
    "Soooo...kittens? Do you have any kittens?",
    "Okay, thanks, I'll go have a chat with them.",
    "Hey there fellow kids.",
    "Your mother tells me that you've found an adorable fluffy critter for my friend here?",
    "Hi there.",
    "Oh, come on, not this again. I mean, yes, of course you are. Oh, terrible and powerful dwag...dragon. Your mother tells me that you've found another kitten?",
    "Yes, yes, terrible monster. Where is this monster?",
    "The sawmill. It's at the sawmill isn't it?",
    "Where did you say the kitten was again?",
    "Sawmill, yep, got it. Thanks.",
    "Hi there.",
    "Your mother tells me that you've found another kitten!",
    "Small cat. Cute and cuddly?",
    "Of course that's where it is. Why didn't I just go straight there?",
    "Symmetry. Never mind, come on, we're off to the kid's hideout.",
    "Just east of here, it's an abandoned house near the Apothecary.",
    "Where did you say the kitten was again?",
    "Sawmill, yep, got it. Thanks.",
    "Oh, Wilson, thank the stars it's you! Why are you sticky?",
    "Oh, the pineapple thing. Yeah, sorry about that.",
    "I'm sorry we left you in that prison, but we needed to escape.",
    "I know you're angry, but that is no way to talk about my mother!",
    "Why are you so MEAN?",
    "What? Did I miss something here?",
    "I said I was sorry.",
    "You're just a head...",
    "Right, and he's a rat. A rat that smells of pineapple.",
    "Confusing perfumes?",
    "How exactly?",
    "Why exactly?",
    "It's not like you're going to go very far... Okay, fine, I'll get the leather and the gold. I'll be back here shortly.",
    "Which I just so happen to have on me!",
    "Would you believe divine providence?",
    "Hi, Wilson, I'm back.",
    "What?",
    "I forgot the stuff, didn't I?",
    "I'll...er...I'll come back with two pieces of leather and a gold bar.",
    "Also, you're in my backpack...",
    "Swimming with dolphins?",
    "Build the mightiest sandcastle ever known?",
    "Amazing. Every word of what you just said was wrong. Fine, what do you want to drink?",
    "That's...very specific.",
    "I'll see what I can do.",
    "I've brought you a Blurberry Special. It's made from all the ingredients you like, plus it has that leafy citrus flavour.",
    "Really? You couldn't have said that earlier?",
    "Sooo, I happen to already have one of those on me.",
    "I always come prepared.",
    "I think I will hold onto it for now.",
    "I've brought you a Drunk Dragon. It's got pineapple and dwellberries in it and it's mixed in with cream.",
    "Oh, come on, really?",
    "Well, what do you know, I've got a Chocolate Saturday on me right now.",
    "I'd say that this fits all your criteria.",
    "I think I will hold onto it for now.",
    "I've brought you a Chocolate Saturday. It should meet all your alcoholic needs.",
    "Yes, it is. I've always thought so.",
    "It helps to be drunk as well, of course.",
    "No, it's horrible! I hate it!",
    "But the darkness creeps in and eclipses the light. Anything could be hiding in those shadows. ANYTHING!",
    "Everyone...",
    "Meh.",
    "It happens every day, no biggie.",
    "I think I will hold onto it for now.",
    "What books are you reading?",
    "Whatever. So you're going to tell me about Rabid Jack's base?",
    "Not yet...but none of these pirates have made a move yet either!",
    "I'll bet it's something to do with the black rock.",
    "This.....",
    "...is...",
    "...going...",
    "...to...",
    "Ow!",
    "I can't abandon the pirates of Mos Le'Harmless to Rabid Jack's forces!",
    "I'm a little busy right now...",
    "There's no fighting over this way.",
    "I've repaired all the barricades!",
    "Let's get you up.",
    "FIRE!",
    "That's one bridge down!",
    "I've destroyed all the bridges!",
    "I've damaged the BF cannon!",
    "I've destroyed the cannon!",
    "I think that's the last of them.",
    "He did leave early into the fight. I did wonder where.",
    "The 'rum'. They're after the 'rum'.",
    "They're planning on turning people into monsters and if they have the distillery...",
    "Not to mention a delivery system. That 'rum' shifts to just about every port in Gielinor.",
    "If we don't stop him, it'll be no more world.",
    "Ruining things is what I do best. Wait, that came out wrong.",
    "Quick! I need to get to Braindeath Island!",
    "How come you're still here, Luke?",
    "But why, there's nothing out there.",
    "Cawing? What, like a crow?",
    "Gulls don't caw, they, um...how do you describe the noise gulls make?",
    "And you're scared of it?",
    "Remind me again what it is that you are made of.",
    "I meant more 'the left stuff'?",
    "Hey!",
    "I said hey...",
    "Hmm, that didn't work.",
    "Oh, yeah, I'll go do my scheming out of earshot. Bye!",
    "Who? Me?",
    "Why's he done that?",
    "What's going on here?",
    "With your 'rum', more like sedated.",
    "What do they want with the distillery?",
    "I've heard all I need to. Better not risk getting spotted.",
    "It's Mi-gor and Mechanical Murphy! They're interrogating Captain Braindeath for his recipe for 'rum'. I suspect they plan to brew a vast batch, mix it with some black stone, and use it to turn masses of people into zombies! Mi-Gor coerced him by pushing the brewers into the fever spider pit one-by-one.",
    "Any suggestion how? Did Braindeath give them anything? That's the odd thing - Braindeath saw me. He looked right at me when he told them the last ingredient was witchwood?",
    "What's Operation Witchwood?",
    "I guess it's worth a shot. I'll find a way to get past Luke.",
    "What?",
    "Huh?",
    "Er, yeah, they were. I was sent on a mission to the mainland.",
    "Er, no. Definitely not him. So...can I go into the distillery?",
    "Ha! Through and through. Good one.",
    "You know, because of how he died?",
    "He took a cannonball to the chest...",
    "Never mind.",
    "Er, sure... He said to, um...",
    "I shall pass on your message to Mi-Gor...",
    "Considering what else goes in it, you're suprised by a bit of wood?",
    "Then that's exactly what you'll do, captain!",
    "Sure, I'll just go do that. Bye!",
    "Nice porthole.",
    "Nice anchor.",
    "Nice wheel.",
    "Doesn't the constant rotating DRVE you nuts?",
    "Oh. Sorry if I SPOKE out of turn.",
    "You know, you're not sucha  bad FELLOE.",
    "...",
    "Nope, I'm out.",
    "Okay, 66.6...% Luke is out of the picture and I can access the north of the island.",
    "I've also gained access to the distillery floor.",
    "Mi-Gor, Murphy and Giles are all 'rum'-soaked, awaiting a good crabbing.",
    "I ran into an old ally who's helped me blow up barrelchests before. They've offered to assist, I just need some explosives.",
    "We're all set on the bombing front too. The Baron has some explosive 'rum' barrels.",
    "On it. You should probably take cover somewhere just to be safe.",
    "Hah, must have been someone else, oh wait, is that the time, gotta go, bye!",
    "Can I get past, please? I need to talk to Mi-Gor.",
    "I'm not carrying anything that would get the job done here.",
    "Hey, this leg would bend perfectly around these pipes! That should stuff up the works!",
    "There's probably a joke here about being legless...but I can't think of one right now.",
    "Here goes nothing...",
    "Right, that's the zombie pirates covered in 'rum'. What was next? Davey will know.",
    "One soaking should suffice.",
    "Hey Luke! Look over there, a three-headed monkey!",
    "Hey Luke! Look an eagle!",
    "Hey Luke! Is that Rabid Jack over there?",
    "Hey Luke! That thing by the trees is the most amazing thing I've ever seen.",
    "Hey Luke! Would you kindly be distracted and look away for a second?",
    "Hey Luke!",
    "Hey, Luke, what's up? Everything good with you?",
    "But your leg, er...",
    "But you're still only half you.",
    "Why 66.6...% Luke, though?",
    "I dunno, maybe...2/3rds Luke?",
    "I have some more name suggestions for you. Want to hear?",
    "Mostly Luke?",
    "More Luke Than Wood?",
    "Lukey Lukey Luke?",
    "Deck Hand Luke?",
    "R Luke?",
    "G Luke?",
    "B Luke?",
    "Y Luke?",
    "Fluke?",
    "Lukey Loo?",
    "Woody?",
    "Argento?",
    "Luke Crybalker?",
    "Luke Highwalker?",
    "Luke Eyegawker?",
    "Luke Lieporker?",
    "Luke Trywalker?",
    "Luke Wrytalker?",
    "Tree Person?",
    "Frank?",
    "Samantha?",
    "Woodguy Threepbrush?",
    "Treebeard?",
    "Groot?",
    "Major Oak?",
    "The Old Man?",
    "Whomping Willow?",
    "Mokujin?",
    "Grandmother Willow?",
    "Half Bark, No Bite?",
    "Beechlanding?",
    "Lukey Lumber?",
    "Willow?",
    "Xander?",
    "Giles?",
    "Oi Yew?",
    "Yes Yew?",
    "Yew Over There?",
    "It's Behind Yew?",
    "The Pa-tree-archy?",
    "The Tree-umphant?",
    "Luke-alyptus?",
    "The Sen-tree?",
    "The Gatekeeper?",
    "The Treemaster?",
    "The Pirate Formerly Known as Luke?",
    "TPFKAL?",
    "[Icon]?",
    "Shiver Me Timmmmmmbbbeerrrrrrrrrrrs?",
    "T.R.E.E.?",
    "Mod Oak?",
    "Mod Beech?",
    "Mod Ash?",
    "Aspen?",
    "Hawthorn?",
    "Salix?",
    "Sylvan?",
    "Marlow?",
    "Linden?",
    "Forrest Chump?",
    "Reanimated Copse?",
    "The Lonely Tree?",
    "Ishmael?",
    "The Anti-Timbo?",
    "Jungle Jim?",
    "Woods Rogers?",
    "William Beech?",
    "Jiminy Thicket?",
    "Sir Francis Brake?",
    "Black Stone Bart?",
    "Henry Morgan?",
    "Justin Timberland?",
    "Weald-iam Kidd?",
    "Ca-Luke-co Jack?",
    "Long Fen?",
    "Woody Bones?",
    "Anne Bonsai?",
    "Luke McKraken?",
    "Horrorbane?",
    "The Luke-rax?",
    "Grover?",
    "Luke?",
    "Hey, Luke!",
    "Hey, Baron, fancy meeting you here!",
    "You have? Well, thanks for not decorating my armour, I guess...if you get my meaning.",
    "An arrangement of convenience, nothing more. You know you're my go to gull for blowing stuff up.",
    "As a matter of fact, there is. See that dungeon over there? Fancy blowing the doors off? There's some crabs in it for you.",
    "Big, juicy, 'rum'-filled crabs at that.",
    "Cannonballs, coming right up!",
    "Will these 'rum' barrels work?",
    "There's something I need to take care of in the distillery first. I'll be back soon.",
    "We're set!",
    "Not close enough.",
    "That's a hit!",
    "That's a hit!",
    "That's a hit!",
    "You look pretty defeated to me. There's no BODY to your argument!",
    "You're a zombie for Pirate Pete's sake. You're already dead...and you're decomposing, smell funny and your arm's fallen off. Why would anyone want that?",
    "I'll pass, thanks. I prefer not to fall apart in a strong breeze.",
    "Kraken Tooth Island again. Gotcha.",
    "We set sail...for Kraken Tooth Island! We'll just need to keep an eye out for giant sea monsters this time.",
    "Pretty certain. He seemed really frightened to reveal the information, genuinely afraid for his life. Unlife?",
    "What was that noise?",
    "What's going on?",
    "Another one of those squid things?",
    "Where is everyone? Why is everything on fire? I need to get off this ship somehow!",
    "I can't do that yet, I'll drown.",
    "Okay, here goes nothing...",
    "Are you real?",
    "How are you breathing underwater?",
    "What is going on here? How did I get here?",
    "Rabid Jack?",
    "What is this place?",
    "That doesn't really answer my question.",
    "What's ahead of me here?",
    "You're not really a kitten, are you?",
    "Be gentle.",
    "Not if I can help it!",
    "It's over, Jack! No matter what you throw at me, I'll always come back to stop you!",
    "I'm not afraid of you Jack. It's just you and me here!",
    "What the heck was that?",
    "You underestimate me. I'll always find a way to beat you!",
    "I should check on Madame Shih before running off.",
    "Getting a little tipsy here.",
    "Wooh, that's *hic* the shtuff!",
    "*Hic* I don't feel sho*hic* good.",
    "I think I'm good thanks.",
    "Awww. Rabid Jacksh. I *hic* love you, man.",
    "*Hic*",
    "*hic* The Falador Massacre was an *hic* inside job!",
    "Hlurghbleffergle",
    "Oooooooh, seeeeee the little goblin.",
    "See*hic*eeeee his little legs,",
    "Seeeee *hic* how he shuffles, like a chicken on 'er eggs.",
    "Oooh, see the little goblin, isn't *hic* he suuuuuch fuuuuuun,",
    "'Cos the goblin is my beshtest friend, I'm tellin' everyone.",
    "Woo! *hic*",
    "Keep it flowing, *hic* we want more,",
    "The great booze of Gielinor.",
    "I won't *hic* stop 'til I'm on the floor ! *hic*",
    "The great booze of Gielinor.",
    "Ugh, I hate thish shtuff *hic* I dun wanna *hic* wear it.",
    "Are you okay?",
    "But there are so many questions I have about all this!",
    "That seems too simple a solution.",
    "There were kittens everywhere, didn't you see them?",
    "Or perhaps not enough.",
    "I need a higher sailing level before I can just row off into the emptiness of the ocean.",
    "Also, there's nowhere I need to row to right now.",
    "You're alive! For a moment I thought you were all done for.",
    "You're right. But it's done now, right? Mos Le'Harmless is safe?",
    "What've you done with Mi-Gor?",
    "HAHAHAHA Relax! What's that?",
    "What? The Holy Wrench? But I lost it somewhere...",
    "Thanks...",
    "Yet you're still here, in pretty much the same spot?",
    "I mean I literally had no choice.",
    "Oh gods!",
    "It was very strange, there was 'rum' involved and kittens all over the place.",
    "Yeah I'm not sure I get it either.",
    "See you around cap'n.",
    "A Long Drop.",
    "Er, nothing?",
    "This mural depicts dragonkin performing some sort of ritual.",
    "There's a name mentioned: Kranon. However, it's crossed out and surrounded by multiple crude carvings of the dragonkin word 'Vek'.",
    "Then there's some other words: 'Kranon Cras Roake Pthen'.",
    "This mural depicts black hands grabbing at the dragonkin.",
    "I think Kranon is the one being dragged away, and is that other dragonkin maybe dying?",
    "There are more words written beneath the mural: 'Kreath Lac Roakin...Drakkerkin Skek...'",
    "This mural shows a dragonkin burning other, strange-looking dragonkin with its fire breath.",
    "The words below this mural are: 'Skekkin Kath Rath! Kranon Roakin Rak.'",
    "This final mural just depicts rubble...destruction... I can't quite make it out.",
    "There's only a few words I can still read here: 'Vek... Skek... Chen... Ulthven... Fia...'",
    "Ow!",
    "Why?",
    "Wow! Thanks for the warning!",
    "Hi there.",
    "Your mother tells me that you've found another kitten!",
    "Small cat. Cute and cuddly?",
    "Of course that's where it is. Why didn't I just go straight there?",
    "Symmetry. Never mind, come on, we're off to the sawmill."
  ],
  "Pirate": [
    "Yarr, Bill Teach not be here matey. Want to sail to Mos Le'Harmless?",
    "Yarr Bill Teach not be here, do you want to be sailing to Port Phasmatys?",
    "Arrr, all these ghosts doesn't exactly put me in high spirits.",
    "I don't be wanting that matey.",
    "Yarr, what be a pirate's favourite letter?",
    "Nay, ye scallywag. A pirate's first love be the C!",
    "What you be giving me that fer?",
    "Get away from me, ye weirdo.",
    "Too many zombies!",
    "I'll hold them here, matey."
  ],
  "Customs Sergeant": [
    "What things?",
    "They are adequate.",
    "Yes. Criminals will be incarcerated to facilitate their assimilation.",
    "Yes, they will be...rehabilitated.",
    "Yes.",
    "I'm fine. Perhaps it's the cold.",
    "How can you tell?",
    "To what crime?",
    "I knew you had a funny look to you. Right then, you're going away for a long time.",
    "I see. Very well, you're coming with me. I'll make sure you can never hurt anyone ever again.",
    "That's right, you stole my heart!",
    "What?",
    "THEN IT'S PRISON FOR YOU!",
    "I did think you were hot.",
    "PRISON!",
    "You monster!",
    "What's wrong with you?",
    "You monster!",
    "You monster!",
    "What's wrong with you?",
    "What's wrong with you?",
    "What's wrong with you?",
    "You monster!",
    "You monster!",
    "You monster!",
    "You monster!",
    "You monster!",
    "What's wrong with you?",
    "You monster!",
    "You monster!",
    "What's wrong with you?",
    "You're going to Rock Island Prison, where no one has ever escaped!",
    "Not a single soul.",
    "You'll be going to Rock Island Prison for a very, very long time."
  ],
  "Two-Eyed Eric": [
    "Oh no, oh no, oh no, oh no.",
    "AAAAAArgh! WHO SAID THAT?",
    "Oh. Hello?",
    "Yarr, me name be Two-Eyed Eric. I be a...erm...legitimate businessman.",
    "What? I never, how dare ye. How dare ye! I be a legitimate trade-arr.",
    "Arr, I not be a stereotype. I be a special unique butterfly, me mother told me so.",
    "Yarr, it be a terrible tale. We was sailing out across the great blue sea, when all of a sudden the sea herself rose up to take us. 'Twas as if a great beast had risen from the depths and scuttled me ship. All went black. When finally, we came to, we found ourselves locked behind these bars, doomed to walk on solid land, rather than the calming rocking of the mother sea. Oh, but that not even be the worst of it. There were four of us in this cell. Four. But one by one the guards came and took 'em away. All we heard were screams, then silence. There be something terribly wrong with those guards. Terribly wrong. Their eyes be glazed over and I ain't never seen one blink. It's as if they don't know that blinking be a thing ye do.",
    "Aye, as luck would have it, I just so happen to have a spare hidden about me person.",
    "Yarr, ye not be wanting to know, laddie.",
    "Arr, but ye already have me hand.",
    "Oh no, oh no, oh no, oh no.",
    "AAAAAArgh! WHO SAID THAT?",
    "Oh. Hello?",
    "Yarr, I, er, do have a spare somewhere... But, er, well, it's kinda stuck.",
    "I'm sure I can get it soon, just...need...to...jiggle a bit more.",
    "Yarr, so let's get out of here, me mateys.",
    "I don't like it here, can we go home now?",
    "I'm going to give up piracy and become an accountant!"
  ],
  "Jimmy the Parrot": [
    "Hello?",
    "Who are you?",
    "I asked you that...",
    "Do you know what's going on?",
    "No, that's why I asked you.",
    "Do you know how to escape?",
    "Are you just copying me?",
    "Talk later.",
    "...",
    "*Jimmy the Parrot nods*",
    "*Jimmy the Parrot nods*",
    "What dwells below in deepest dark,betwixt the corpse of squid and shark,",
    "With flesh of stone and midnight black,We cry his name, we cry...",
    "MOVE OUT!"
  ],
  "Bill Teach": [
    "Player, is that you?",
    "Not exactly. I mean I found out that there's definitely something up with the Customs Office. Unfortunately, the Customs Office found me just as I found out.",
    "Something strange. The customs officers are rounding up pirates and then dragging them upstairs, after which we never see them again. We do hear the screams, though...",
    "Not off the top of my head. Look around, see if you can find a way to get out of your cell. Maybe ask those guys in the other cell?",
    "Look around for a way to pick the lock on your cell door.",
    "You have to get your cell door open and find a way to keep the guards outside!",
    "Get me out of here! Pick the lock on my cell!",
    "Haha, that rat sure got you!",
    "You'll probably want to get your hook back off it, though.",
    "I get the impression that rat knows more than he's letting on. Maybe you should talk to him a bit?",
    "Okay, everyone's free, but we still need to know what's going on. Player, see if you can get upstairs.",
    "Hrmm, warding magic. I hear that Madame Shih is a bit of an occultist, you should talk to her.",
    "Hrmm, Madame Shih said the warding on the door was voice activated. If only we knew someone that could mimic voices...",
    "Try the door again, Jimmy might know the code.",
    "Get upstairs and see if you can find out what's going on!",
    "Why the rush?",
    "I'm not sure, there was something in the water with us. Did you feel it?",
    "Show some respect, Player. Without them we might never have made it out.",
    "Mos Le'Harmless. But don't worry, I can get us a boat ride from here.",
    "Very good, Madame. Shall we, Player?",
    "Very well, I'll meet you back in Mos Le'Harmless, we'll await you in the secret basement after a 'long drop'.",
    "Hey! Democracy has served us well so far.",
    "What's wrong with the smell? This is a proper, rugged, piratical smell!",
    "Don't you badmouth Bessie, I won't hear no one badmouth Bessie.",
    "Sorry, I got nervous...",
    "A good plan, with only two drawbacks... The first is that we don't know where he is. The second is that WE DON'T KNOW WHERE HE IS! I know that's technically one point, but it's so big that I thought it worth repeating.",
    "Come back here once you've got that zombie head to start talking.",
    "We're very sorry for interrupting, please continue.",
    "I thought you said you knew this place like the back of yer hand. How've we run aground?",
    "Lads, he's here! Get 'im!",
    "What was that beastie?",
    "Jack took her, I think; I can't see her in the water.",
    "I'll call for Pirate Pete, he'll ferry us back. Hang on..",
    "That madman. Come on, if we don't stop them, these barrelchests and zombies are going to destroy everything. No one destroys my home and gets away with it. Come on, Player... LET'S KICK SOME BOOTY!",
    "I can't believe we did it. We fought back Rabid Jack's entire army! It was a tough fight and we lost a lot of good men, but we prevailed.",
    "You're kidding, right? You were in the same fight as the rest of us?",
    "Izzy, what happened? You look exhausted!",
    "What? Why would they want that place?",
    "Holy mackerel, they'd have enough of the stuff to infect the whole ruddy world.",
    "I'll get the fleet ready. Player, you'll need to infiltrate the distillery. Get in there and see if you can ruin their plans.",
    "NO!",
    "Some good friends, heading to Davey Jones's locker.",
    "It's Rabid Jack! His fleet just appeared out of nowhere, like it was the mist...and there was something in the water...",
    "No...something else. Something huge, like hands of black stone...so many hands... HE'S AIMING AT US! BRACE FOR IMPACT!",
    "We're harder to get rid of than that, Player, you should know that by now.",
    "I think so, Player. At least for now. Rabid Jack's forces have been defeated. Mi-Gor has been decapitated. And you sealed up whatever weird breach was under the Cursed Archipelago. I think we can rest easy for a bit and celebrate with a good drink, or twelve.",
    "Wait! Before we do that, you should clear some inventory space, Player. We've got to properly celebrate your victory with some loot.",
    "Now that Rabid Jack and his minions are dealt with, we can all sit back and relax a bit.",
    "I think you've earned yourself the right to kick back, have a drink and just be still for a bit.",
    "Aye, you've earned it.",
    "Time spent enjoying yourself is never time wasted.",
    "I went down beneath the waves. There were things down there, horrible things swimming in the waters. It makes me shiver just to think about them.",
    "It seems that by mixing the 'rum' with that strange black stone, Mi-Gor could transform people into monsters. Monsters under Rabid Jack's control. By taking over the distillery he was going to ship vast quantities of this serum all across the world. Anyone who drank the 'rum', and there be a lot of sailors who won't look at what they're drinking, would become a monster. We'd get complete chaos as his army would just appear in every major port across the world. If we hadn't stopped him when we did, I'm not sure we would have been able to fight against that.",
    "She took off really as soon as this was all dealt with. Said she had business off in the Eastern Lands. Something odd about the way she carried herself, like she was distant somehow, distracted. Weird thing is, I saw her loading a chest onto her ship before she sailed off. Weird old thing it was. Covered in barnacles and seaweed, as though it had been on the ocean floor for years. Oh well, probably not important."
  ],
  "Madame Shih": [
    "You there! Release me at once. Don't you know who I am?",
    "Hrmm, normally my reputation precedes me. I am Madame Shih, scourge of the Eastern Lands. Commander of the greatest fleet in the east. And if you do not release me RIGHT NOW, my revenge shall level this entire region!",
    "Oh, but you will. When I am free, and I will get free, I will bring my fleet to this region. I will start with the fishing towns, where your defenceless peasants live and I will rain such fire down upon them. Once they are nought but ash, I shall turn on your harbours and your ports. I will cut you off from the rest of the world, so you can never find aid. Finally, I will let your fleets face me directly and I will laugh as I sink them one, by one. And then, when there is only you left, I will allow you to kill yourself and you will thank me for my boundless mercy.",
    "I've never been one for subtlety. You cross me, you pay for it...dearly.",
    "No. I suppose not. You certainly don't look like much. I doubt you would have the wits to catch a cold, let alone hardened pirates.",
    "Ha, I like you. You're right, of course, I was rude and it was uncalled for. Please accept my sincere apologies.",
    "There's a dark presence here. Something foul has infected this place and the guards who work here. I don't like the Customs Office at the best of times, but something very strange is going on here. Sadly, I see no immediately obvious way out of here just yet.",
    "Not yet. No one imprisons Madame Shih and gets away with it. I want to know what's going on here.",
    "While normally I would be delighted to have a little chat, I suspect our efforts should be focused on finding out what's going on here.",
    "Yes, I sensed the magic as it flared up. A complicated warding spell, voice activated if I'm not mistaken.",
    "Let's just say that I...dabble, in the occult from time to time. I've got a knack for understanding magical wards and enchantments. It comes in very handy when trying to crack into certain vaults. But now is not the time to discuss my colourful past. You want to find some way to replicate the passcode used to get past that ward.",
    "You need to find something to reproduce the passcode to open the door.",
    "You head upstairs and find out what's going on here, I'll make sure the guards don't get back in down here.",
    "That should be obvious, we've been discovered.",
    "MOVE OUT!",
    "Where are all the others? Did they get lost along the way?",
    "Bah! Pathetic excuses, is this what I should expect from all the pirates here?",
    "Oh, we'd have escaped alright, it just might have taken a little longer.",
    "No, no. Young Player is right, we owe the weak nothing except to conquer them. It is good to see that these lands are not filled exclusively with snivelling children.",
    "But let us talk of them no longer. Where are we?",
    "Far from your port then, Mostly Harmless, was it?",
    "You two sort yourselves out, I need to reclaim my ship first anyway. I'll make my own way there.",
    "These are the dread captains of the western lands? A grubby bunch of drunkards and lunatics?",
    "How Rabid Jack hasn't already wiped you all out I have no idea.",
    "Really? Where's your discipline? Who's your leader? Do you resolve all your problems via committee?",
    "Ah yes, but how much has it held you back? I command the mightiest pirate fleet to ever sail the oceans of the Eastern Lands. I have scores of loyal pirates who dance to the tune I set. I could take this island from you all in a heartbeat. If I wanted it...I'm not sure I could stomach the smell.",
    "It smells as though a flatulent cow with alcohol problems has died down here.",
    "The cow is REAL?",
    "So, let's strike him now!",
    "So, find out! He must have agents we can capture. Soldiers we can kidnap. Lovers we can torture?",
    "What in the Hell-of-Being-Flayed-By-Knives is that thing?",
    "So, did you learn what you needed to learn from our strange decomposing head here?",
    "One of my ships can take us there. I've got a rowboat anchored at the south-west beach. Prepare for a fight and head there when you are ready.",
    "This Kraken Tooth Island sounds dangerous. You'd best prepare for a fight. When you are ready, use the rowboat I've moored on the south-west beach of Mos Le'Harmless to row out to my ship. I shall ferry you all there.",
    "Do not take that tone with me on my own ship, Bill Teach. We must have hit a coral reef. Make yourselves useful.",
    "Please, Player, if you could check below decks for any damage...",
    "Have you checked below decks yet? We could be sinking! Use the deck door towards the rear of the boat.",
    "Pirates are often slow to get started. Don't be a pirate. Show them the way.",
    "Um, gentlemen, you might want to look behind you...",
    "Bah are all you western pirates so uncultured? It's a simple charm.",
    "I'm nothing like you!",
    "I'll never serve you!",
    "I've seen better days. Rabid Jack...I never expected something so...strange. But he's gone now. You fought well, Player; you'd make an excellent pirate. If you're ever in the Eastern Lands, you'll have to look me up. I'm sure we'll have a good many adventures to discuss. But enough chit chat, let's get out of here.",
    "Somewhere ancient. Somewhere long forgotten and with good reason I shouldn't wonder.",
    "I am not sure. I sensed tremendous power, but there was a wrongness to it. Like touching fire and it being cold. Whatever it is, it seemed Jack sealed it away with him. Praise the gods for small mercies.",
    "Oh, no doubt. I'm sure it's just a temporary fix, something like that won't be so easily kept at bay.",
    "Oh, I doubt it. He's gone for now, that much is certain. But I don't even think he can die anymore. No, I'm afraid we likely have not seen the last of him.",
    "What kittens? What are you talking about?",
    "There aren't any kittens, Player. I think you've had too much 'rum'.",
    "But enough of that, come on, we need to get moving.",
    "I think that's enough scaremongering for now. We're all out of the water and we're on dry land, and being scared of the sea is quite silly for a pirate.",
    "Don't get too complacent. Rabid Jack may be gone, but he's not dead. It will take time, but I doubt we've really seen the last of him.",
    "Fiiiine. Well, let's give the credit where it's due. Three cheers for Player, the saltiest of all seadogs!",
    "Hip, hip!",
    "Hip, hip!",
    "Hip, hip!"
  ],
  "Prison guard": [
    "I can see you trying to pick the lock, you know?",
    "I'm right here!",
    "What?",
    "I hate birds! They're horrible!",
    "Argh! Get the bird!",
    "I'm on it!",
    "What is that?",
    "Am I going mad?",
    "How are you moving?",
    "Is that a pineapple?",
    "What in the world?"
  ],
  "Seagull": [
    "Squawk squaw squawk. (My, what a delicious-looking fish. Are you eating that?)",
    "Squawk! SQUAWK! Squaw. (How dare you! Do you think all seagulls look alike? You birdist.) Squaw squawk squawk. (I am Count Ludwig Koppenploppen! Scourge of the seven skies and befouler of masonry.)"
  ],
  "Count Ludwig Koppenploppen": [
    "Squawk SQUAW! Squawk! (That you could mistake my beautiful countenance for that lowlife crab-botherer offends me to my core.) Squaaaaaaaawk. (You have made a powerful enemy this day. Now give me that fish, or FACE MY FURY!)",
    "Squaw? (What on Gielinor do you want me to do with that?)",
    "Squawk. (Go away. Weirdo.)",
    "Squawk. Squaw. (Silly human, seagulls are immune to mesmerism.)",
    "Squawk! Squaw SQUAW! (You dare threaten me with the sharpened appendage of a seafaring human?) Squawk. (I am not so easily intimidated. I will not flinch in the face of your pathetic attempts to frighten me.)",
    "Squaw. (This morsel will abate my fury...for now.)",
    "SQUAAAAWK! *That fish, IT SHALL BE MINE!*"
  ],
  "Player receives missing pieces of the following": [
    "a customs shirt, customs trousers and a customs hat."
  ],
  "Crassian guard": [
    "Reeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeek!",
    "Reeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeek!",
    "Reeeeeeeeeeeeeeeeeeeeeeeeee",
    "*Click chitter click*",
    "Eeeeeeeeeeeeek",
    "Nyaaaaaa reeeeeeeeeeee",
    "Reeeeeeeeeeeeeeeeeeeeeeeeee"
  ],
  "Pineapple Wilson": [
    "Squeak",
    "Chitter",
    "Chitter chitter",
    "Squeak",
    "Squeak squeak"
  ],
  "Kitten": [
    "Your real prison is your body.",
    "From beneath it devours.",
    "It has risen!",
    "Join me in death!",
    "What is dead may never die.",
    "The 'rum' must flow.",
    "Are you?",
    "Have you considered that we're not - that we don't need to?",
    "All drowned pirates dream of breathing.",
    "Something led you here. Pulled your strings and made you follow.",
    "That is but the name of one of the strings.",
    "This is Ulthven Kreath, or at least a gateway to it.",
    "No, it does not.",
    "Inevitablity.",
    "I am not.",
    "But then, you're not really a human either.",
    "Neither of these things matter.",
    "Do you really think you can save them?",
    "Your life is spinning out of control.",
    "Do you suffer from motion sickness, vertigo, epilepsy, seizures or other such conditions?",
    "Only death is truly gentle."
  ],
  "Mi-Gor": [
    "The serum is working perfectly. Injected directly into their veins the subjects are transforming into these strange creatures. They demonstrate superior strength and the latest addition of 'rum' has warped their minds an the process, making them pliable and docile.",
    "Once all the pieces are in play, yes.",
    "YOU!",
    "...we must know the final ingredient, Captain.",
    "Precisely why they are expendable! If you'd only tell us your recipe, they will be spared.",
    "There, that wasn't too difficult now, was it?",
    "You are far too trusting. Witchwood is too rare a resource to be the final ingredient, but we will know it, Captain.",
    "Is this your doing, Braindeath! What are you playing at?",
    "I'll get you next time, Braindeath!",
    "You think, you've won, don't you! This is just a small setback.",
    "Make your terrible puns, it won't help you. We have all the 'rum' we need to start the ascendance of mankind. Enough 'rum' for the serum to infect THOUSANDS of people! Elevating them from their pathetic, mortal forms and towards something greater. Free from the shackles of death and the limitation of the human form. We can be so many different shapes, so many different permutations. Why fight that? Why stand against us? We offer a new future a BETTER future, where death can never touch anyone again.",
    "Makes it much easier to scratch the hard to reach spots on your back...",
    "As if your opinion means anything! You're too late, Rabid Jack already has what he needs! Even now, my factories on Kraken Tooth Island are pumping out vast quantities of the serum. Soon we will...",
    "Oh, heck. I meant, er...Bloodsplatter Isle? Murderfang Reef? Skullsplitter Bay?"
  ],
  "Mysterious figure": [
    "Exquisite. And you can make enough of this serum for our needs?",
    "Be sure that you do. Let us not allow ourselves to be anchored down by ego, we do this right. We must be meticulous. We must be precise. We must show good form... But no mercy. I have waited so very long for my revenge and I will not allow anything to get in my way. Mos Le'Harmless will burn and all the treacherous sea dogs with it. Even the wretched cur that thinks we cannot see them spying on us.",
    "Please, don't leave on my account...",
    "Ha! Meet me new pet; I think she likes ya, boys."
  ],
  "Joe": [
    "What'll it be?",
    "Ye sure?",
    "Take a seat.",
    "Then stop tryin' te take up me table space!",
    "What'll it be?",
    "Sorry, lad, I think you've had enough of those. I'm cutting you off.",
    "Then stop tryin' te take up me table space!"
  ],
  "Cap'n Izzy No-Beard": [
    "Hey! We may not look like much, but the pirates of Mos Le'Harmless are a sturdy bunch.",
    "His forces are the decomposing dead. So, I'm not sure they'll be more helpful.",
    "*pant* I know where he *wheeze* went...",
    "Just *wheeze* swam back from my what's left of my *wheeze* ship. Rabid Jack obliterated her with cannon fire, I'm lucky to escape. This whole invasion, the massacred pirates, it was all just a cover. He and Mi-Gor have taken control of the distillery.",
    "Exactly. They're mixing it with some of that strange black rock we've been finding all over the place. Apparently, it's the key ingredient in some sort of serum.",
    "I still can't see any island anywhere. Just vast emptiness everywhere.",
    "But there's nothing here. Nothing at all.",
    "There's definitely something down there alright.",
    "Oh, lighten up. There's always the potential of doom and gloom, but right now let's enjoy ourselves.",
    "It's done! It's over with! Rabid Jack will threaten us no more! Thanks, Player. We couldn't have done it without you."
  ],
  "Brass Hand Harry": [
    "Yeah, we've fought off hordes of undead pirates and Mi-Gor's mad machine men. We know what we're doing!",
    "Yeah, she were a good cow, she were. Her milk was always just alcoholic enough to start the day right.",
    "Which means he's finally bringing the fight to us.",
    "Oh, just get on with it!",
    "And I the stern, madame.",
    "We've killed yer once, we'll do it again!",
    "It's some sort of crassian, I reckon.",
    "Madame Shih, do you know- Oh...",
    "We've got to save Mos Le'Harmless!",
    "It was too easy.",
    "Rabid Jack has been preparing for this fight for years. He's building an army of the undead and transforming people into horrible monsters. And we fought, what, several undead pirates and one or two of those barrelchest things? Where were the sea monsters? Those weird crab people? The mutating zombies? Where did Jack go?",
    "No more 'rum'?",
    "Are we sure that zombie head wasn't just lying to us?",
    "Unless...I mean...they're all these weird undead sea devils, right? What if the island isn't...you know...above sea level?",
    "Yar, we be tough nuts to crack. Though I can't say I want to be in those waters again any time soon. There were definitely things down there. More than fish and far from human. I swear I caught sight of one of them horrors, but swimming.",
    "I'm glad all that's over. Can't be letting Rabid Jack turn all me mates into monsters now.",
    "No, no no. I don't want to talk about it. I don't want to think about the things down there...",
    "I dunno. I'd like to say yes, but he's like one of those old ghost stories. I hate ghost stories."
  ],
  "Everyone": [
    "Rabid Jack!",
    "AMEN!",
    "Hooray!",
    "Hooray!",
    "Hooray!"
  ],
  "Zombie pirate head": [
    "Oh, rats. I was hoping you'd forget about me.",
    "I'm not telling you anything!",
    "Oh,yeah? And what are you going to do to me huh?",
    "I'm a decomposing head. Do you think I even feel pain anymore? And if I did, do you think a punch would even register when compared to nerve endings slowly eroding away to nothing? You don't get it, do you? There's nothing you can do to hurt me. Nothing.",
    "Ooh, nice one. Very visceral there, nice and sinister. Of course, I'm a decapitated zombie head, so mutilation isn't really high on my list of concerns. Good effort though.",
    "I mean, that's just weird. It might make me sneeze I suppose. I mean, it's not like there aren't already things crawling around in here. A few more won't really matter.",
    "Really? You dress me up like this and then just as I'm enjoying it you threaten to rip it off again? That's not scary, just rude and confusing.",
    "Of course I am. If I can't love myself, how the hell am I gonna love anyone else? Can I get an 'amen'?",
    "Hah! Fat chance!",
    "Cute? CUTE! I don't look cute! I do drop-dead GORGEOUS!",
    "I don't know?",
    "Laughing about the death of pirates at sea? That's low, dude, and I'm a decomposing zombie head.",
    "The rush of adrenaline as you pillage and plunder?",
    "Wow, dude, joking about people living with handicaps now?",
    "Where's this Red Sea? I've never heard of it before.",
    "Wow, that's bad.",
    "Oh, gods...",
    "Arr, that be the dread sea spider. We do not speak her name in fear that she mi-",
    "That's a terrible stereotype.",
    "A nervous wreck.",
    "Why are they paying in deer?",
    "Why are you putting a poor little deer into a cannon? What kind of monster are you?",
    "What?",
    "Oh Ken. he[sic] was burned horribly and-",
    "...",
    "He had a mean right hook!",
    "Go on, tell me.",
    "Damn you.",
    "Hmm... I don't know, why is that?",
    "Hrmm, okay, now you're talking my language matey. Okay, here's the deal. I'll tell you the location of Rabid jack's secret base. IF... You help me to find true meaning in life. I want to feel truly alive again!",
    "Nonsense! I've looked into it. I've done extensive research and I've come to the conclusion that I need but two things to be fulfilled... One. I need someone that I can care for and consider a true companion.",
    "Oh no. Oh no, no, no. I'm sorry but you are definitely not my type. But no, it doesn't need to be romantic. Just someone I can care for, like a child, or perhaps a pet.",
    "You can't buy affection, what sort of zombie head do you take me for? No, no, no I need to find a true friend. Maybe you know someone who's giving away pets to heroic adventurers or something?",
    "I want to watch the sunset on a tropical beach. Somewhere with the sound of nearby jungles and a nice west-facing sea. There I need to drown myself...in culture. Get me these things and I'll tell you everything you need to know. Deal?",
    "Excellent, let's get going!",
    "Suit yourself.",
    "Do your worst!",
    "Didn't I just say that?",
    "Really? This is your tactic, repeating everything I say?",
    "What is this, interrogation by five-year-old?",
    "...",
    "Do your worst!",
    "Wait, what?",
    "Are you feeling okay?",
    "You know that makes no sense, right?",
    "Yeah, this is just nonsensical rubbish. I'm not sure what you thought would happen here.",
    "Err...nice moves?",
    "What's going on here?",
    "Yeah...I don't know what your plan is, but it's not working.",
    "Haha! Do your worst!",
    "You monster!",
    "Well, I have been getting on well with this one pira-",
    "While that was an impressively hammy performance, I'm still not going to tell you anything.",
    "I'll still have nothing to say to you.",
    "Shall we go then?",
    "Well, you'll need to make space for me in your backpack, then we can continue.",
    "Fine, let me know when you want to go.",
    "Okay. What I'm about to tell you is one of Rabid Jack's biggest secrets. If he ever finds out I told you, his revenge will be unspeakable.",
    "Rude. Here I am, about to betray my own captain and you can't even give me the decency of a bit of respect.",
    "Well, Rabid jack has a hidden island just off the Cursed Archipelago. Kraken Tooth island, he calls it. It's a terrible place. Shrouded in fog so dense that you can't see the person next to you. Cold as ice and... There are things in the fog. Things that skitter. Things that slither and writhe. The noises they make...oh gods, the noises...",
    "Sorry, yes. Well this island is where he's building up his forces and conducting his most terrible experiments. He's turning people into monsters. Innocent people, not even the undead like us, just people.",
    "I am not going back there, no way. But I'll mark it on a map for you.",
    "Maybe you know of some nice, kindly old person with a plethora of adorable pets to hand out to lonely adventurers?",
    "Gertrude said to go and speak to her kids. She had some in her house and I think I heard some in the Varrock Market Square.",
    "So, we're off to the lumber yard, right? That's what the kids were saying.",
    "We need two pieces of leather and a gold bar. We should bring them to Wilson when we have them.",
    "HAHAHAHAHAA he's tickling me!",
    "He's crawling all over my brain!",
    "I want to see the sunset on a beach somewhere. I'm thinking somewhere tropical, with the ocean to the west. Maybe with some music playing nearby, you know, set the mood. A nearby shop, something local. Just outside a bigger village, so we can escape to civilisation if we need to.",
    "That was *hic* great. Lessgo find me a nice new friend somewhere.",
    "Oi! Don't talk about me like I'm not here. How rude!",
    "Another kid maybe?",
    "Don't be revol-",
    "Actually, that's a common misconcept-",
    "We're done here.",
    "I hate these kids.",
    "Look, kid, have you seen a stray cat or what?",
    "Am I missing something?",
    "Where is it?",
    "You're being bullied by a rat?",
    "I see. I understand now.",
    "Wilson and I have come to an agreement. While you abandoned him to a terrible fate in a prison full of monsters...",
    "Like I said, you abandoned him, but gave him a taste of the adventuring lifestyle. He agrees that he and I should become adventurers ourselves, together. We would make an unstoppable duo!",
    "A FABULOUS, albeit slowly decomposing, head.",
    "Indeed. No one would expect us. We would face all our foes with the greatest weapon of all!",
    "The element of SURPRISE! No one expects a zombie head and a rat to defeat them. By the time they realise we're upon them, their fate will already be sealed.",
    "We're...er..still working on that. Arr, but before we can begin to conceive of such a partnership, we must first make sure none can claim Wilson here as mere vermin. He must be clearly displayed as my faithful animal companion. We will need two leather pieces and a gold bar. None of this hard leather, nor any of that scaly stuff. It needs to be plain old normal leather so it doesn't scratch his little neck.",
    "Because every good pet needs a collar. What if he gets lost?",
    "That seems awfully convenient...",
    "I would certainly believe a guiding hand was involved. Anyway, that's all we need.",
    "Arrr, and ye've got the leather and the gold, I can smell it on yer.",
    "Aye, that too.",
    "So, now that you're suitably dressed me matey, yea be ready to sail the seven seas with me as me first mate?",
    "Excellent! Then the oath be sealed. Come, Player, let us sail on!",
    "STOP! This. Is. PERFECT!",
    "We'll come back here later, I've got things I want to do first.",
    "Arr, but it be so pretty here.",
    "Arr, this be perfect. The sun on my face, the wind in my hair. But it needs more. Something is missing.",
    "I be of the sea, matey. I swam with my fair share of cetaceans.",
    "Bah! What would be the point? The sea is a cruel mistress, she'd claim it soon as we build it. No, I need something more cultural. Something pure. Something that makes a lasting memory. I NEED COCKTAILS! They're cultural, they're pure and they give you long-lasting memories!",
    "I want something with vodka, gin and brandy. I think they'd go well together. I like citrus flavours as well. I'd like it to have that. Finally, it should have a faint leafy flavour to it. Yeah, that should do it.",
    "What can I say? It's what I crave!",
    "Marvellous! Hand it over, matey!",
    "Ahhh. Delicious... Hrmm... No... No. Doesn't quite hit the mark. I think I need something else.",
    "I want something alcoholic. With berries and a sweet, sticky taste. Oooh, and I want it to be creamy. Deliciously creamy, like a cake in liquid form.",
    "That's convenient.",
    "Suit yourself.",
    "Sounds marvellous! Let me try it!",
    "Ooh, yes, that hits the spot. And yet...",
    "Yes, yes. The cream is nice, but I want something sweeter and yet a tinge of bitterness.",
    "I'm tired of gin, I want something with a woodier flavour. Keep it creamy. I love the creamy flavour of these cocktails, but I want a touch of sweetness as well.",
    "Of course you have...",
    "Suit yourself.",
    "Sounds marvellous! Let me try it!",
    "Ahhh, yes, that hit the spot. That's just what I needed.",
    "Nothing left to do but to stare out across the sea and watch the sunset.",
    "It's really quite beautiful, isn't it? The sunset?",
    "When you're sailing out across the great seas - plundering, murdering and all that - you never really stop to appreciate it. The colours as they dance across the waves. The sounds as they change. The night animals taking over from the day. There's a special sort of magic there.",
    "Oh, hells to the yeah! WOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOAH!",
    "Really? But it's so peaceful and beautiful!",
    "Who hurt you?",
    "Meh! MEH? You have the wonders of creation right before you? The dazzling colours as day passes into night? The strange energies as twilight approaches and the eldritch strangeness of darkness arrives and you say 'meh'?",
    "I feel oddly sorry for you.",
    "Suit yourself.",
    "Okay, that's it. That's everything that books say I need for a full and complete life.",
    "Hey, they're my secrets to a happy life, get your own!",
    "Not here. Let's go back to the secret basement so no one overhears us.",
    "Hahahahaa, stop it Wilson, that's my optical nerve you're chewing on. It tickles!",
    "Look, kid, have you seen a stray cat or what?",
    "Am I missing something?"
  ],
  "Gertrude": [
    "My word. What on Gielinor is that thing? Is that...is that a talking head?",
    "You're right, how terribly rude of me. I am so sorry.",
    "I'm afraid not, no. All my remaining kittens are reserved for brave adventurers who need a feline companion. Though, come to think of it, the kids were talking about something they've been playing with. Perhaps they can help?",
    "Hello dear. I thought you were going to chat to the kids?",
    "I hope you found what you needed at the sawmill."
  ],
  "Wilough": [
    "What?",
    "Nope. Not me.",
    "Oh, wow! Is this a zombie head? Is it full of writhing worms and insects?",
    "If it bites people, do they become whole zombies or is just their head zombified?",
    "I bet it smells real bad. Can I hide it under Philop's bed?"
  ],
  "Kanel": [
    "RAAAAAAR! I am a deady dwagon. RAAAR!",
    "No. I found a big and terrible monster!",
    "It hides in the secret lair. A place so secret no one could ever guess where it-",
    "Oh, you've seen it, then.",
    "In a secret place. You'll never gue-"
  ],
  "Philop": [
    "Hel-lo?",
    "Kit-ten?",
    "Cute and cuddle?",
    "Cat? Like at the saw-mill?",
    "In a secret place. You'll never gue-",
    "Hel-lo?",
    "Kit-ten?",
    "Cute and cuddle?",
    "Cat? Like at the saw-mill?"
  ],
  "Izzy No Beard": [
    "Aye, aye, captain. I'll check the bow.",
    "Aye, and this time ye stay dead.",
    "More importantly, how was Jack able to control it?",
    "Where'd she go?"
  ],
  "Captain Braindeath": [
    "And I the bottle... *hic*",
    "And then we'll drink ter[sic] it! *hic*",
    "Well, what now? This boat's a wreck, and Jack's off invading our homes!",
    "Aye, and me my brewers!",
    "Never! If I'd have known what you were doing with it I'd have destroyed this distillery!",
    "You monsters! Leave my brewers alone! They don't know anything.",
    "I... I... Fine, I'll tell you... It's..",
    "Witchwood! The final ingredient is witchwood.",
    "What? But I told you the last ingredient!",
    "Don't get CRABBY with me, you 'rum' dandy! This is what you get when you push all my brewers in a pit. This is YOUR fault!",
    "Well I don't want to be doing any of that again. Being held hostage by an undead mad scientist isn't exactly fun. Ha ha. The look on his face as those crabs tore him apart. Hilarious! I'm going to look into that black stone effect on the 'rum', maybe a change of recipe will fix that. Don't want people turning into monsters after all.",
    "He's being acclimatised to his headless state by our good friend the zombie head. I hear they're getting on quite well."
  ],
  "Rabid Jack": [
    "Now, madame, I don't believe I've made yer acquaintance. Rabid Jack's me name.",
    "Right! You boys have fun! I'm off - Mos Le'Harmless ain't gonna invade itself with zombie pirates!",
    "Arr, here we are at last and each landlubbing one of yer is rightfully cowering before me. Ye all left me for dead. Left me for the crabs and fishes. But I didn't die, I'm Rabid Jack! I'll NEVER die! Arr, but what I did do is I held a grudge. I held a grudge and it sustained me, fed me better than any banquet. As I fell into the dark embrace of the ocean, her cold clammy hands clasping round my lungs. I swore revenge and the sea, she answered my prayer. Haha! She changed me she did, the sea. Took my frailty and human weaknesses and gave me life anew. And oh, how I harboured that hate. Oh, how I grew fat upon it. Seething in the ocean depths, and preparing. All for today! Witness, my pathetic brethren! Witness as I reclaim what is rightfully mine! I am Rabid Jack and everything you own belongs TO ME! Pray to your gods if you like. Not that it matters you understand. I've seen death... And there are no gods listening for our prayers.",
    "Quite remarkable, miss Shih. You really are quite resilient, aren't you? I've never seen a human hold their breath for so long.",
    "Oh, charm you have in abundance, my dear, but I think it's something else, don't you? Perhaps we're not as different as you like to pretend?",
    "Ha ha ha. Of course you are. Like me you feel the call of the sea, but deeper than any pirate before. You don't just yearn to sail the seas. You yearn to tame them, to break them and to rule them. I could help you with that you know. I ask only obedience in return, a small price considering.",
    "Hahaha. So strong a spirit you have, so very strong. It shall be such a delight to break it.",
    "You! You're like the jellyfish sting that I can't get rid of no matter how much I pi-",
    "Aye, my little starfish, it seems that way, doesn't it? But then, so far, you've always been up against my agents and my brainless lackeys. I apologise for that. Had I known you would make such an interesting foe I would have given you the respect you deserved... And faced ye myself!",
    "Oh, how I wish that were true. But you don't understand, do you? We're not alone here. Listen...do you hear? Do you hear it? The song? That terrible, terrible song?",
    "Look, Player. Follow the song. Follow it and behold... Witness the terrible truth that we all deny. The darkness isn't empty... It hungers!",
    "Just a glimpse! A mere fraction of something ancient, something powerful and wonderful! Enough to fracture at least a small piece of your mind. Just enough to hear the song, to create a wedge in your psyche that we can claw open. You'll be mad long before you can defeat me!",
    "Let us put that to the test! It's been a delight talking to you, my dear Player.",
    "But now I'm afraid that it's time for you to join the rest of your crew in Davey Jones's locker!",
    "I will hang you out to dry!",
    "I'll grind you into dust!",
    "It's not over yet matey!",
    "FOOL! I am Rabid Jack, I cannot die!",
    "I am immortal, like the sea!",
    "The stars are not right! You cannot win!"
  ],
  "Pirate Pete": [
    "*phew* This teleporting malarkey is hard work!",
    "Alright, then. Close your eyes and count to five.",
    "That spell won't work here. You need to walk away until you can't see me.",
    "There's too much magic interference in this particular area. Could make your head explode!"
  ],
  "Invading boat": [
    "Glug, glug, glug!",
    "Ooh, a kitty!",
    "You sunk my barrel ship!",
    "Wait, I left the oven on!"
  ],
  "Barrelchest Mk I": [
    "You look a little flushed for a zombie pirate. Are you one of Captain Donnie's crew or an escaped distillery worker? Note that if you are a distillery worker, I will have to take you hostage. There is also a good chance you'll be thrown into the basement with the fever spiders.",
    "I thought as much. Trying to disguise yourself as a living person to sneak into the distillery won't work - I'm smarter than that, you silly zombie pirate.",
    "Pull the other anchor. Clear off and tell Captain Donnie to stop trying to sneak spies in. Mi-Gor is in charge here now.",
    "Player, the scourge of Mi-Gor - [he/she] would not dare to show [his/her] face around here. So, obviously, you are not them.",
    "It's not very convincing human disguise. The face is all wrong for a start.",
    "And then there's the misshapen body.",
    "Did you just say 'Hmm, that didn't work' right in front of me?",
    "Aren't you a little bitty for a barrelchest?",
    "I thought all the Mk IIs were destroyed on Bloodsplatter Isle, anyway...",
    "Hmm, like that mutinous assassin Mi-Gor sent out?",
    "Only if you give me the passcode. Challenge: 'You fight like a distillery brewer.' Response: awaiting...",
    "Incorrect. You may be a superior model, but I am a pirate through and through, just like Bosun Giles.",
    "...",
    "...",
    "...",
    "Incorrect. Also: yeah.",
    "Incorrect. Perhaps you are malfunctioning.",
    "Incorrect. What are you, eleven?",
    "Correct. You may pass.",
    "Go join the queue, human brewer. Don't make me smash you.",
    "Don't make me report you to HR.",
    "All the better to smash you with.",
    "Thanks.",
    "Nope. This thing hasn't STEERED me wrong yet.",
    "It's fine, I can HANDLE it.",
    "Kind of you to say, but don't put me on a PEDESTAL.",
    "...",
    "Me too.",
    "Challenge: Argh. No. Please don't hurt me."
  ],
  "Captain Donnie": [
    "Hey! You!",
    "Aye! Ye! Got any more 'rum'? Argh, who am I kidding? Of course ye don't. Mi-Gor and his goons have taken control of the distillery, and sent me ship 'n' crew off ter invade Mos Le'Harmless.",
    "He's trying ter show me who's boss fer one, and he wants ter increase the production of 'rum' so he can turn all the captives into a black stone-controlled invasion force. Apparently, me progress wasn't fast enough, and he found me 'rum'-pumped crabs laughtable. Something's lit a fire under Rabid Jack's plans for global zombification and oh I've said too much.",
    "Urgh, what now? Does Mi-Gor have more orders fer me? More ingredients ter source, perhaps?",
    "He wants me ter leave? With what? He sent me ship 'n' crew off ter assault Mos Le'Harmless. An' I ain't swimmin'! Ye tell that sawbones if he wants me ter leave he can call back me ship!",
    "Yeah, well, I don't want to see him! You can go tell him that I want me ship 'n' crew back, and that I wish he and that Murphy fella would circle the drain! He'll know what I mean.",
    "Actually, don't bother. I wanna tell him right to his ugly mask! Hey, barrelchest! Step aside, ye swabbie cur, I want a word with yer boss!",
    "'How appropriate. You fight like a zombie sea cow.'",
    "Felt good gettin' that off me chest.",
    "Worth it!",
    "Fine, seeing I can't tell 'im meself. Just make sure ye include the contempt in me voice when ye tell him.",
    "That ye'd willingly mutiny against that mini mouth-breather and his pet grease zombie would bring a smile ter me face, aye... But I'd not willingly take a backstabber fer me own crew - can't be trusted.",
    "Witchwood? That's an ingredient in the 'rum'? Blimey.",
    "It's not that, just witchwood is really hard to come by is all. Certainly ain't none of this here island. Anyone with half a brain would know how scarce it is, and oh my gosh, he means Luke, doesn't he? If that jumped-up little necrosurgeon thinks I'm gonna chop up me own crew for his experiments...",
    "Fine! If those're me orders, then fine, but doesn't expect me ter be liking 'em. Ye wait here.",
    "Ye'll need to make space before I can give ye anything.",
    "There ye go - yer witchwood. Luke's taking a break from guarding the gate.",
    "Yer not getting any more outta Luke!",
    "Urgh, he sent you out here to order me to keep doing nothing? And here's me thinkin' I couldn't dislike that surgeon sycophant any more than I already did.",
    "I've had enough of you barrelchests. If Mi-Gor's got more orders fer me, he can deliver 'em himself.",
    "Avast, ye scurvy devils! Avast!"
  ],
  "Davey": [
    "Oh, thank goodness! Are you here to help? I need help.",
    "We were doing fine when it was just Captain Donnie - we were able to produce enough 'rum' to keep his crew, er, happy.",
    "But then these two other zombie pirates showed up with these monstrous barrel-chested constructs. At first, it seemed like a good thing. They sent Donnie's ship and crew off somewhere, things quieted down a bit. That is until they stormed the distillery! They took the brewers hostage and are interrogating Captain Braindeath. It was just dumb luck that I was in here at the time. I hid to avoid capture.",
    "That's just it, I don't know! Maybe you can sneak to the side window of the office and listen in?",
    "Oh no, we have to stop them!",
    "Well, that's not right. We don't use witchwood in the recipe. Unless he was giving you a clue... Of course! He was referring to Operation Witchwood! That might just be crazy enough to work!",
    "First off, you'll need to make room for this disguise I made...",
    "First off, you'll probably need this... I've been sneaking about for parts to build a makeshift disguise. Figured it'd come in handy.",
    "It's a plan the Captain and I hatched to get rid of Donnie and his crew. It's named that because we need to get past 50% Luke, but he won't let us. Recently, we've having issues with 'rum'-pumped crabs escaping from the dungeon on the north of the island. They don't often come out of the dungeon, but when they do, they're drawn to our vats of 'rum'. We figured If we could find a way to lure a load of them out, they'd be attraced to Donnie's 'rum'-soaked reprobates and we'd have an army of crabs on our side to chase them off.",
    "You'll also need to figure out how to soak the pirates in the distillery with 'rum', oh, and also how to blow up the dungeon entrance.",
    "Tell you what - if you can find a way to get past 50% Luke, come back here and we'll discuss the finer points of the plan if you need to.",
    "Looking good! That should be enough to fool the guards at least.",
    "66.6...% Luke? You know what, never mind.",
    "You'll still need to gain entry to the distillery somehow. That disguise I gave you should help with that.",
    "Once inside the distillery, you'll need to figure out a way to soak the pirates inside with 'rum', but not Captain Braindeath if you can help it.",
    "Finally, you'll need to head to the north of the island and find a way to blow the dungeon entrance.",
    "You should search the north island to see if there's anything to help you with that...",
    "Good job there's a distillery full of 'rum', then. That stuff is strong enough to blow the doors of a dungeon. If you can nab some barrels from the brewery, I'm sure your friend could make use of them. There'll be some small barrels stored on the upper floor.",
    "Fantastic! Everything is in place. Head to this Baron friend of yours and let's do this thing!",
    "Ello again guv/miss. I take it you're here about the wrench?",
    "Well guv/miss, maybe thats[sic] what I want you to think.",
    "There you go. I've kept it nice and holy for you.",
    "Phew! I'm glad all that's over with. Zombies everywhere, great monsters murdering my friends. Horrible stuff.",
    "I'm not really a fan of change."
  ],
  "Mechanical Murphy": [
    "Giles: the Captain here needs some more convincing.",
    "Just tell us, Braindeath. End your suffering. You've held out long enough.",
    "Throw them all in.",
    "Giles: you may smash when ready.",
    "We're covered in 'rum'! It's sticky.",
    "This is the end!"
  ],
  "Bosun Giles": [
    "Yes, sir. Time to feed the spiders...",
    "What about the rest of the brewers, sirs?",
    "Argh!",
    "Crabs! No, my only weakness!"
  ],
  "Brewer": [
    "I love you, Sarah!",
    "I died brewing what I love!",
    "I like spiders!"
  ],
  "Barrelchest MK I": [
    "Only if you give me the passcode. Challenge: 'You fight like a distillery brewer.' Response: awaiting...",
    "Mi-Gor has barred you from entering, Captain Donnie."
  ],
  "(Without 100% Luke's leg before using one": [
    ":)"
  ],
  "Barrelchest Giles": [
    "Wait, didn't I knock you into the spider pit already?",
    "What is it, crewman?",
    "Entry denied. Only other captains may parley with Mi-Gor. I can pass on a message if you like?",
    "Tell Player that Mi-Gor says hello back.",
    "I'm not telling him that, even if it's true...which it can't be.",
    "Tell Donnie Mi-Gor knows, and that the feeling is mutual.",
    "Do you want me to punch him on the arm too?"
  ],
  "Baron von Hattenkrapper": [
    "Squawk! (Incoming!)",
    "Squawk! Squawk, squawk! (Well met, Player. This is no mere coincidence. I have been keeping a close eye on your exploits ever since Bloodsplatter Isle.)",
    "Squawk! Squawk, squawk! (Of course I get your meaning. You aren't as subtle as you imagine.) Squawk! Squawk, squawk! (Including how you conspired with my greatest enemy, Count Ludwig Koppenploppen.)",
    "Squawk! Squawk, squawk! (Don't try to talk your way out of this...unless, is there something you want blowing up right now?)",
    "Squawk, squawk! (Sweet, delicious crabs, you say?)",
    "Squawk, squawk! (I'm in!)",
    "Squawk, squawk! (I will, however, need some explosives!)",
    "Squawk, squawk! (No...this job will require a little more finesse.) Squawk, squawk! (The attack vector needs to be horizontal. Bombs from above will not suffice.) Squawk, squawk! (Find me wooden barrels filled with explosive materials. I shall skim them off the water to maximize their impact.)",
    "Squawk! (Perfect!)",
    "Squawk! (I am locked and loaded, and ready to go - just give the word!)locked-and-loaded"
  ],
  "Redbeard Frank": [
    "Arr, Matey!",
    "Arrr ye really left me out of all of that? Did ye not be thinking I would have liked to take me knife to Rabid Jack's throat?",
    "Aye I be forgotten about a lot these days.",
    "Bah, first rule of be'in a pirate, always bring more than ye need.",
    "Aye, but ye didn't say anything about it did ye?",
    "Bah!",
    "What do ye think I am? An idiot? If I blame him he'll put me on his list!",
    "I'm too ginger to die!",
    "Arrr but there be no point in holding a grudge o'er this. Was it at least a glorious battle?",
    "Kittens?",
    "Strange tales indeed. Go on, be off with ya. I've got pirating to be doing."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Pieces_of_Hate?oldid=36176786’"
  ]
}