{
  "Due to (an) update(s), this article may be out of date.Reason": [
    "\"Typos\" fixed as of an update on 14 August 2023 You can help improve this page by editing it."
  ],
  "Kili": [
    "You must be Player?",
    "We haven't, but only a few people own those robes I've seen you sauntering around in. And word travels fast when someone from the land of living manages the end up in the underworld.",
    "I have. You think you can stand in his way, then?",
    "Well, first things first, you won't stand a chance against him with that substandard equipment of yours.",
    "Well, first things first, you won't stand a chance against him with that substandard equipment I've seen you in.",
    "Lucky for you, I can teach you how to upgrade it.",
    "Well, I'll be here should you change your mind.",
    "Thought you might be. Now, I can help you to upgrade both your necromancer's robes, as well as your guard and lantern.",
    "It's a lengthy and complex process - we'll need to do a bit more than just hammer away at a bronze bar and be good to go.",
    "I'm of the Imcando clan - you may have heard of my kind. In life, I was born and raised to smith, tutored by only the most skilled.",
    "Along with my partner Thalmund, we designed and forged a multitude of weapons, armour, and tools for folks - including nobles and aristocrats.",
    "Ah, yes, my Thalmund...",
    "He still returns here every so often, but it's mainly me manning the smithy nowadays.",
    "For each upgrade, you'll need to gather some materials - items ensouled with energy from the living world, as well as some other specific things...",
    "To ensoul items, you have to perform an ensoul ritual on them, which I can teach you.",
    "Slow down there! Did you not just hear me say it's a lengthy process?",
    "Er... Come back when you have a free space in your backpack, then I can give you the tools.",
    "Back again, Player. Have you decided that you want to learn how to upgrade your equipment yet?",
    "Er, it seems you already have some... Moving on.",
    "Have you ensouled my tools yet?",
    "How did you manage that? They're hulking bulks of metal!",
    "Come back when you have a free space in your backpack, then I can replace them.",
    "Nevermind, I have plenty more.",
    "Try not to lose these!",
    "Take the tools I gave you to the ritual site on the west side of the city. From there, perform a lesser ensoul ritual on them.",
    "Once you've ensouled the tools, return them back to me.",
    "Are you sure? You should go and check inside the ritual chest at the ritual site.",
    "Have you ensouled my tools yet?",
    "That's the first step out of the way. Now I need you to take this empty urn.",
    "Ah. Come back when you have free space in your backpack, then I can give you the urn.",
    "Er, you somehow already have one... Anyways.",
    "I hope not!",
    "You see, this is a specialised urn. I've altered it so it has the ability to hold souls.",
    "The energy from the contained souls powers the soul forge over there - this is a unique forge that can upgrade your necromancer's equipment.",
    "We'll only need weak souls for your first upgrade, so you can simply kill 5 chickens, or perform 1 lesser communion ritual.",
    "Perfect. Come back to me when you've filled the urn.",
    "Have you filled up the soul urn yet?",
    "Oh. Well. That should be fun for someone else to stumble across.",
    "I'd give you another one, but you don't have enough space in your backpack. Come back when you do.",
    "Here's another one.",
    "I need you to fill it up with either 5 chicken souls, or 1 soul from a lesser communion ritual.",
    "Right, let's get the soul forge powered up, and I can teach you how to upgrade your equipment. We'll start with tier 20, for now.",
    "Not just yet!",
    "Now, give me one moment...",
    "...Then you bind the plates to the cloth like so...",
    "...And you've made yourself a piece of gear even the most infamous necromancers would wear!",
    "Now, that's the knowledge section of the upgrade out of the way.",
    "Actually performing the upgrade! This is where the work falls on you.",
    "Each upgrade will require some ensouled items - such as bars, cloth, and thread - as well as your current set of equipment. As I mentioned earlier, you can obtain these by performing ensoul rituals on various objects from the living world.",
    "It's worth noting that for bars, you'll first need to smelt their unensouled versions at a furnace to be able to perform the ensoul ritual on them.",
    "You can see what items are required through the soul forge. Later upgrades may also need some additional items, such as necromantic runes.",
    "Once you have all the items you need, simply return to the soul forge to perform the upgrade.",
    "You're a natural!",
    "Make sure to come back and check in with me when you want to learn how to upgrade your equipment past tier 20, as improving it further will require different supplies each time.",
    "I'll be here if you need a reminder on anything."
  ],
  "Player": [
    "Have we met before?",
    "So, I guess you've also heard about my encounter with Rasial?",
    "I'd like to give it a shot.",
    "...",
    "Not right now, sorry.",
    "I'm all ears.",
    "How do you know how to do this then?",
    "Kili... Wait... You're the one who Thalmund wrote to?",
    "So what do I need to do to upgrade my equipment?",
    "Sounds good! Just teach me the ritual, let me know what to get, and I'll give it a go.",
    "I don't suppose this highly specialised knowledge is something you'll be teaching me?",
    "...",
    "I guess I don't.",
    "Er... Yep! Should be a breeze.",
    "Bye for now then!",
    "Not yet. I guess I lost them.",
    "...",
    "I'll try...",
    "What do I need to be doing again?",
    "Got it!",
    "I think I lost your tools.",
    "Oh, okay. Thanks!",
    "Yep! It was a piece of dwarven rock cake.",
    "Er... I don't have to cremate anyone, do I?",
    "I see. So how can I fill it with souls?",
    "Sounds easy enough.",
    "About that... I must have misplaced it.",
    "Thanks!",
    "What should I be doing with this soul urn again?",
    "Thanks, I'll be on my way again then.",
    "That's the soul urn filled up! I should return to Kili.",
    "That's the soul urn filled up! I should return to Kili.",
    "I've filled up the soul urn!",
    "Phew, and here I was thinking I'd have to go bake you a redberry pie.",
    "So what's left?",
    "Got it.... Learn the knowledge from you first, then gather ensouled items to carry out the upgrade at the soul forge.",
    "Will do, thank you!"
  ],
  "This soul urn has the following souls stored": [
    "[number] / 5 chicken souls0 / 1 lesser communion soul",
    "5 / 5 chicken souls",
    "1 / 1 lesser communion soul"
  ],
  "Congratulations! You have completed": [
    "'Kili Row' - Complete this quest."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Kili_Row?oldid=36191332’"
  ]
}