{
  "Note": [
    "Throughout the quest, the Player will be referred to as JalYt-[Your Caste]-[Display Name]."
  ],
  "TzHaar-Mej-Jeh": [
    "JalYt-[Caste]-[Player], help. My egg is dying.",
    "The egg is cold. Our Mej have tried to heat it, but they say it is too late to save it. But they are wrong. Although many TzHaar eggs are dying now or being born... different, this is big strong egg. It will grow into good strong TzHaar. I just need help. Will you aid us?",
    "You would make good TzHaar, JalYt-[Caste]-[Player]. TzHaar-Mej-Ak. Will you help us?",
    "We must work together to make the egg hatch. Use fire magic to heat the egg and water magic to cool it down. When egg is at right temperature, it will start to hatch.",
    "You JalYt are cold creatures.",
    "It hatches!",
    "No, it cannot be. TzHaar, what is your caste?",
    "No...",
    "But-",
    "TzHaar should not feel a bond with their egg. No one TzHaar is more important than another. But... Through our eggs we live on – new TzHaar carry dead parent's memories. Now, my memory will not pass on. I am old TzHaar. I will not lay another egg.",
    "TzHaar-Mej-Ak will gather Ga'al and have them fight in the Fight Pit. Ga'al do not know how to fight, so they die.",
    "To die in the Fight Pit is to die with honour. It is far from cruel to a TzHaar.",
    "The Ga'al are weak and useless without memory. They serve no purpose in TzHaar society.",
    "Teach is for JalYt, not TzHaar. How can we teach Ga'al all our years of knowledge? But it has become big problem for TzHaar. So few TzHaar are born now... just more and more Ga'al. We do not know what the cause of it is. TzHaar-Mej have investigated, but to no benefit or great discovery. I have been thinking of something for some time, JalYt-[Caste]-[Player], but it is dangerous and uses old magic. Other TzHaar might not agree. They will say TzHaar-Mej-Jeh does it for his own memories, not for good of TzHaar.",
    "It is a way of giving Ga'al back their memories. Other Mej will not like it. Many think we should not go back... there. But it is the only way. Otherwise, our memories will be lost. We will need a Ga'al – my Ga'al – to test this on. You will need to stop him entering the Fight Pit. Bring him to me at the library. There is research I must do before I speak to other TzHaar-Mej about this. Go to Main Plaza in the centre of TzHaar City, west of here, and bring Ga'al back. Convince TzHaar-Mej-Ak if you must.",
    "Thank you, JalYt-[Caste]-[Player]. Bring him to me at the library.",
    "If something has no purpose it must be destroyed. It TzHaar way. We must think of strength of TzHaar society as a whole, not the weakness of separate creatures. (continues above from \"But it has become big problem for TzHaar.\")",
    "Bring my Ga'al to me at the library. TzHaar-Mej-Ak will have taken him to the Main Plaza in the centre of the city.",
    "Ga'al are disease on TzHaar society, JalYt.",
    "Our ways are not your soft ways, JalYt. To die in Fight Pit is great honour for any TzHaar.",
    "We must talk, TzHaar-Mej-Ak. I know how to give memories to the Ga'al.",
    "No!",
    "He died in the Pit. Death in the Pits is not murder, and, if you listened to us, this would not have happened. I have a plan, TzHaar-Mej-Ak...",
    "There is a way to bring the Champion back! [Player], what do you know about TokKul?",
    "When TzHaar die we turn into TokKul: small rocks with our memories trapped inside.",
    "Our memories make it valuable, so TzHaar trade it with each other as currency.",
    "It has never been possible to get memories from TokKul. And TzHaar who have not laid eggs before they turn to TokKul... their memories are lost forever.",
    "What would you say if I told you there was a way of recovering these memories?",
    "It is! Our Kiln has that power, TzHaar-Mej-Ak. The power to forge TokKul, fusing them with the body of another. The Ga'al are empty bodies that we can use.",
    "The Kiln is where TzHaar were first made. Its lava is able to give life and melt down even the hardest of metals.",
    "But it has the power to join TokKul with Ga'al! To bring back lost memories! The JalYt – it would not have to break our rules – it could go.",
    "Think of all the TzHaar born without eggs – all the Ket-Champions, the Mej-Elders whose memories we have in TokKul. We can bring them back.",
    "What else can we do? More and more Ga'al keep being born. If we cannot pass on our memories then it is the end of the TzHaar.",
    "You must journey to the Kiln. You will need to travel through many tunnels, east of Main Plaza. Just south of Birthing Pool there is passage heading to the Kiln entrance. Guards will let you pass.",
    "No, [Player] is right. Ga'al must have its say.",
    "Here is TzHaar-Ket-Yit'tal's TokKul. Take it with you to the Kiln. We shall speak to the other TzHaar-Mej about our plan whilst you are away.",
    "Kiln is very old. The lava inside is powerful and ancient. That we know. Lava will be able to join Ga'al and memories inside TokKul as one.",
    "It is where TzHaar came from in the beginning. We protect it, but do not go inside. It is sacred ground. TzHaar have not even walked down the tunnels leading to Kiln for very long time. They may have become dangerous.",
    "You lost TzHaar-Ket-Yit'tal's TokKul? Lucky we kept some spare.",
    "I trusted you with my plan, [Player]. My trust has not been misplaced.",
    "TzHaar-Ket-Yit'tal, it is you. You have all of your memories?",
    "Then my plan worked! We can turn Ga'al into TzHaar! Our memories will not be lost.",
    "The pain will go; you are strong now. Think of all the TzHaar trapped in TokKul who now can live again. This is the right thing to do.",
    "From now on, we shall call you TzHaar-Ga'al-Xox'tal.",
    "If it is as you say, then it is cruel to leave TzHaar trapped in TokKul. We must free them!",
    "And would you want us to die out, [Player]? This is the only way.",
    "If it is as you say, then it is cruel to leave TzHaar trapped in TokKul. We must free them!",
    "He will come back in time. Thank you, [Player]. As acknowledgement of your help, we now call you Yt'Haar. That mean sacred-cold in TzHaar. Big honour.",
    "We shall send more Ga'al to Kiln. Now Mej will get to work and collect as much TokKul as we can to send with them. You have helped save our race, [Player].",
    "It is good to see you, Yt'Haar-[Caste]-[Player].",
    "You want to know more about TokKul-Zo?",
    "This ring has a piece of TokKul in it. When wearing it, it will guide your hand and make you better when fighting TzHaar, fire creatures and maybe even TokHaar.",
    "My magic taps into the memories in the ring, so you better at fighting like a TzHaar. The magic will fade after time. When this happens, return to me and I will recharge it for you... for a price.",
    "50,000 TokKul for a full recharge. Normally I would do it for free, but we need all the TokKul we can get, as we will soon be sending more Ga'al to the Kiln.",
    "Why do you feel bad, Yt'Haar-[Caste]-[Player]?",
    "Spending TokKul in shops means we have more TokKul to send to the Kiln. TokKul has always been currency, this will not change. You want to know more about TokKul-Zo?",
    "Soon, we will send more Ga'al to the Kiln. As you cleared the way, it should be safe for them now.",
    "It is a good thing you've done. Now, Ga'al can live with TzHaar.",
    "They helped you with Ga'al? Why would they do this if they want to threaten TzHaar?"
  ],
  "Player": [
    "What's happened to it?",
    "I'll help.",
    "I don't have the time, I'm sorry.",
    "What's a Ga'al?",
    "It hatched, isn't that good?",
    "What will happen to the Ga'al?",
    "That's barbaric!",
    "Why do you do this?",
    "Can't you teach them your ways?",
    "What is it?",
    "I'll help.",
    "But why kill them?",
    "Come with me. You'll die if you stay here.",
    "Come with me – now!",
    "Wow...you can talk.",
    "You've taught yourself to speak. That's impressive.",
    "What are you doing here?",
    "Er-",
    "Can you help me convince that Ga'al to come with me?",
    "But TzHaar-Mej-Jeh has a plan that will be able to get the Ga'al's memories back.",
    "I need a Ga'al. Would you come with me? Jeh wouldn't know the difference.",
    "TzHaar-Mej-Jeh said he wanted his Ga'al, but you would do just as well. I'm sure he wouldn't know the difference.",
    "So, Ga'al, will you come with me? TzHaar-Mej-Jeh thinks there is a way of giving you back your memories and turning you into a real TzHaar.",
    "I need to go.",
    "What are you doing?",
    "I've come for that Ga'al.",
    "But TzHaar-Mej-Jeh has a plan; he thinks he can return the Ga'als' memories.",
    "But he is thinking of the future of the TzHaar society! We have to protect that Ga'al. TzHaar-Mej-Jeh needs him.",
    "Yes.",
    "No.",
    "What you're doing to the Ga'al is wrong.",
    "But you can't just kill them!",
    "Regardless, I will need that Ga'al.",
    "What's going on here?",
    "I suppose you're protecting your society.",
    "What's going on here?",
    "It's the remains of your dead that you use as currency.",
    "It's a type of money, right?",
    "Not that much.",
    "Hold on – your Kiln?",
    "This only helps the TzHaar, not the Ga'al!",
    "Fine, I'll help, but only for the good of the Ga'al.",
    "Of course I'll help the TzHaar.",
    "Shouldn't you ask the Ga'al if he wants to go?",
    "What should we do when we arrive at the Kiln?",
    "Is there anything I should know about the Kiln?",
    "I had better be on my way.",
    "Okay.",
    "The kiln sounds powerful – I'm there.",
    "I can't be part of this right now.",
    "How do I get to the Kiln?",
    "Are you sure about this?",
    "But why? What do you owe the TzHaar?",
    "I suppose that's your choice.",
    "Yes, follow me",
    "You're the first TzHaar to walk in these tunnels for a long time.",
    "I think so.",
    "Hmm, you're right, you're not big enough.",
    "Come on, Xox!",
    "But it continues over here.",
    "You need to jump across!",
    "It's what I just did!",
    "All you need to do is run, bend your legs and spring up. Go on – try to jump the chasm.",
    "Yeah – go for it!",
    "Great work!",
    "Why aren't you following?",
    "It looks like a skeleton. Maybe we should take a closer look.",
    "There. What's that?",
    "Yes... and some flying discs. A TzHaar-Xil must have died here. I thought TzHaar weren't allowed down these tunnels.",
    "You'd better take these discs.",
    "It'd be safer if we both have a weapon.",
    "Yeah, do you know how?",
    "Let me show you. Just watch me.",
    "These caves are full of monsters.",
    "What were you doing in the city before we met?",
    "So what do you think about the TzHaar?",
    "Even after they threw you in the Fight Pit?",
    "Well that's cleared that up.",
    "Are you worried about what will happen in the Kiln?",
    "Let's head on.",
    "What do you make of those gates?",
    "I don't think that was the right amount.",
    "Do you understand the symbols on those scales?",
    "So what do you think of the TzHaar?",
    "Even after they threw you in the Fight Pit?",
    "Well that's cleared that up.",
    "I think so. We'd better step carefully - who knows what could be in there.",
    "I'm ready.",
    "You could turn back. You don't need to do this.",
    "That's a brave decision.",
    "Why did they attack me?",
    "Who are you?",
    "The TzHaar?",
    "How can you speak my language?",
    "How long have you been here? What have you been doing?",
    "Who are your masters?",
    "Do you remember your masters?",
    "Can we speak of something else?",
    "What is this place?",
    "Why did you attack us?",
    "Are you related to the TzHaar?",
    "I don't understand.",
    "I need your help.",
    "The TzHaar wish to infuse my friend, a Ga'al, with memories stored in their dead Champion's TokKul. Many of the TzHaar's new eggs are being born as Ga'al, and they want to fill them with the memories from the TokKul.",
    "If this works, then the TzHaar hope to bring new Ga'al here and repeat the process.",
    "I think he should, for the good of the TzHaar.",
    "I think he should, so the Ga'al can live good lives.",
    "I don't think he should. He doesn't need TzHaar memories.",
    "Let's see what rock you're forged from, then.",
    "What have you done to him?",
    "What's wrong, Xox? What's happened?",
    "Why did you attack us?",
    "I'll go then.",
    "What's wrong?",
    "But -",
    "So what do you think about the TzHaar?",
    "What do you think of the Ga'al?",
    "Let's head on.",
    "What happened? Did it work? Do you have the Champion's memories?",
    "But the transformation hurt you?",
    "Then wha-",
    "How are you feeling?",
    "So what do you think about the TzHaar?",
    "What do you think of the Ga'al?",
    "Let's head on.",
    "Watch out! More TokHaar are coming!",
    "What did it feel like?",
    "Will they listen to you?",
    "Are you hoping they'll stop sending the Ga'al to the Kiln?",
    "Yes we have, and the forging is complete.",
    "Even after all we've done, you can't trust the Ga'al?",
    "I understand that you need to be sure.",
    "You're right to be suspicious, trust is weakness.",
    "The TzHaar can't put the Ga'al through this pain, it's cruel.",
    "Turning Ga'al into TzHaar will help both groups.",
    "I'm only interested in the power of that Kiln.",
    "About this ring...",
    "What does it do?",
    "How does it do that?",
    "What's your price?",
    "I feel bad about using TokKul as currency now.",
    "Well now I know that the TzHaar trapped in TokKul are in pain it doesn't feel right.",
    "Okay.",
    "Can you recharge it?",
    "Let's talk about something else.",
    "I have to be going.",
    "What's happening now with the Ga'al?",
    "I'm not sure if the TokHaar would appreciate that.",
    "Doesn't Ga'al-Xox's reaction to all this worry you at all? He seemed a little unhinged.",
    "Have you seen him since he left?",
    "Are you concerned about the TokHaar?",
    "I'd like to talk about titles",
    "I'd like to talk about something else.",
    "Who are you?",
    "So, you're like a leader?",
    "So what's your role?",
    "What's TokKul?",
    "You use rocks as currency?",
    "I see.",
    "What's there to do here?",
    "I'll be going now.",
    "Why did you chase us?"
  ],
  "TzHaar-Mej-Ak": [
    "TzHaar-Mej-Jeh, it is too late... but I will help, even just to show you this.",
    "It is like I said, TzHaar-Mej-Jeh! Another one born as Ga'al.",
    "TzHaar-Mej-Jeh, egg is Ga'al, like all the others...",
    "TzHaar are born with memories of all ancestors that came before. That is how we know our caste, how to do our work, what our laws are. Ga'al are born without memory of what came before. Without memory, Ga'al cannot do work; they are clumsy, lazy and lawless. Almost all TzHaar are born this way now... those that do not die in the egg. We do not know why.",
    "I shall take this Ga'al... away.",
    "We must, TzHaar-Mej-Jeh. This you know. Follow me, Ga'al.",
    "I said follow.",
    "Yes, egg hatched, but we might as well have left it to die. Egg has been born Ga'al. Ga'al are no use to TzHaar.",
    "TzHaar! JalYt! Gather here for the Fight Pit!",
    "Mighty warriors, prove your worth in fight to death!",
    "Ah, you again. You want to fight in Fight Pit?",
    "This is not your concern, JalYt.",
    "TzHaar-Mej-Jeh is not behaving like good TzHaar. Good TzHaar think of TzHaar society first. TzHaar-Mej-Jeh thinks of nothing but his little Ga'al.",
    "TzHaar-Mej-Jeh's Ga'al will die in Fight Pit. This beyond your control...",
    "...unless you think you could protect him in the Fight Pit.",
    "I thought not.",
    "You smart for JalYt. Most JalYt think what we do to Ga'al is wrong.",
    "TzHaar organise big fights in the Fight Pit for TzHaar, JalYt and Ga'al.",
    "It about to start.",
    "You joining Fight Pit?",
    "Fine! Let's get started. Crowd getting rowdy.",
    "Let the fight begin!",
    "You think you can save this... Ga'al?",
    "TzHaar-Mej-Jeh? All you talk of now is Ga'al. You have forgotten what it is to be a TzHaar. It is my duty to remind you...",
    "Enter, Champion!",
    "Kill his Ga'al!",
    "Now, TzHaar-Ket-Yit'tal, let's finish this fight. Empty the Fight Pit!",
    "Now, champion TzHaar-Ket-Yit'tal is dead, TzHaar-Mej-Jeh. Like you, his memories are lost. He did not lay an egg.",
    "You and your JalYt have murdered a good TzHaar. His memories die with him!",
    "Enough of this madness! Your Ga'al is dead! These plans, these schemes... they are not work of good TzHaar. Our Champion dead, because of your plans.",
    "It – it is not possible.",
    "And we are not permitted to visit it! Kiln is sacred to TzHaar. It is out of bounds!",
    "This is too drastic, TzHaar-Mej-Jeh, we must think on this.",
    "You are... right, TzHaar-Mej-Jeh, we must take action, but only if the JalYt will help. TzHaar will not step foot in there.",
    "Once Ga'als have memories of TzHaar, they will be able to work and be real TzHaar. This will help both the Ga'al and the TzHaar.",
    "You good ally of TzHaar, JalYt.",
    "This Ga'al that survived the Fight Pit – it can go with you. It will meet you at entrance.",
    "It only Ga'al.",
    "Be careful - Kiln is sacred. Do not think you can use it for your own means, JalYt. Do just what we say or regret it.",
    "That is your choice, JalYt.",
    "JalYt, Ga'al. You have found the Kiln?",
    "We must test this claim, JalYt. This not a slur on your word, but Ga'al-Xox could have tricked you.",
    "He glows like us now, but Ga'al cannot be trusted. (continues below from \"If memories...\")",
    "As I said, no slur on your word.",
    "If memories of TzHaar-Ket-Yit'tal burns within the Ga'al, it will have knowledge of how to fight. TzHaar-Ket, attack.",
    "Hello Yt'Haar-[Caste]-[Player].",
    "They helped you with Ga'al-Xox, they will help again.",
    "Ga'al-Xox was Ga'al for a long time. He is bound to react to the change, but in time he will accept it. What matters is that it worked!",
    "No, no-one has seen him since he returned from the Kiln, but he will come back. He is TzHaar now.",
    "TokHaar are old TzHaar. TzHaar like to keep to themselves.",
    "I am TzHaar-Mej-Ak – we met at Birthing Pool. I am one of the elders of the TzHaar City.",
    "No, no. TzHaar have no leader. All TzHaar equal, all TzHaar have their role. No need for leaders.",
    "I guide the TzHaar when there's change. TzHaar do not like change. If it were up to us, we would not allow it. But sometimes, the world changes and we must think how TzHaar must react.",
    "We use TokKul like you use gold. Only TokKul is the remains of dead TzHaar.",
    "Not rock! Dead TzHaar! Trapped in each TokKul is dead TzHaar's memory. That's what make it sacred to us.",
    "If you in the mood to kill, you could go Fight Pits or Fight Cave. They both to the south-west. If you interested in TzHaar history, go west to library. Or maybe you visit shops for top quality TzHaar goods."
  ],
  "Ga'al-Jeh": [
    "Guh?",
    "Guh-huh?"
  ],
  "Ga'al Jeh": [
    "Guh?",
    "Guh-huh!"
  ],
  "Ga'al-Xox": [
    "JalYt?",
    "Ga'al-Xox been here for long time. Ga'al-Xox one of first Ga'al.",
    "Ga'al-Xox speak good. Ga'al-Xox real TzHaar.",
    "Ga'al-Xox here to die with honour!",
    "Ga'al-Xox fight in Fight pit with great honour!",
    "No, no. Ga'al here to die with honour!",
    "Ga'al meant to stay here!",
    "Why JalYt need Ga'al?",
    "Ga'al-Xox meant to stay here. Ga'al-Xox die with great honour!",
    "If this make Ga'al-Xox real TzHaar, Ga'al-Xox go.",
    "Ga'al-Xox meet you at cave east of here.",
    "Ga'al-Xox and [Player] go now?",
    "Ga'al-Xox must be good TzHaar.",
    "All TzHaar put TzHaar before their self. Even Ga'al. Ga'al follow you now.",
    "Ga'al follow you now.",
    "Ga'al follow you now.",
    "Ga'al follow you!",
    "Ground stop here.",
    "Ga'al Xox not there.",
    "Jump? What jump?",
    "Don't think TzHaar can jump.",
    "The no-ground?",
    "I jump! I jump!",
    "What that there?",
    "It TokKul.",
    "Ga'al-Xox use this?",
    "No.",
    "We be careful.",
    "Ga'al-Xox hid lots.",
    "Sometimes Ga'al-Xox talk to other TzHaar. Some gave Ga'al-Xox food.",
    "Ga'al-Xox watched Fight Pit lots too.",
    "One day TzHaar-Mej-Ak said put Ga'al-Xox in Fight Pit for honourable death.",
    "TzHaar strong, TzHaar good.",
    "TzHaar right to throw Ga'al in Fight Pit. Only way Ga'al have honour.",
    "Ga'al-Xox should die in Fight Pit. Now Ga'al-Xox helping TzHaar and all other Ga'al.",
    "If Ga'al-Xox die in kiln, he die with honour.",
    "Gates big like Ket.",
    "No, TzHaar-Mej-Ak say books good for finding things out. Ga'al-Xox has no book.",
    "Ga'al-Xox is jump master. Best jumper of all TzHaar!",
    "TzHaar strong, TzHaar good.",
    "Maybe TzHaar should not do that to Ga'al. Ga'al-Xox is not real TzHaar, but Ga'al-Xox got here with [Player]. Ga'al-Xox not useless.",
    "This is Kiln?",
    "Ga'al-Xox ready, if [Player] ready too.",
    "We go.",
    "No, [Player], Ga'al-Xox must. Even if Ga'al-Xox not want this, we must for all other Ga'al.",
    "I think I can.",
    "Arrraaagh",
    "[Player]!",
    "It...",
    "It's the pressure... The pressure... I will explain when we're away from here...",
    "We must keep moving, [Player]. Must speak with elders.",
    "Please, [Player], just keep moving.",
    "The TzHaar have treated the Ga'al poorly. the TzHaar are - we are - suspicious of others, slow to change, unaccepting of the weak.",
    "But we did not act cruelly, to die in the Fight Pit is an honour.",
    "The Ga'al are weak and naive without memories. Part of me hates their weakness, but I cannot help but feel a bond with the Ga'al.",
    "Agreed.",
    "I have memories now.",
    "Transformation was painless.",
    "We must move quickly, [Player]. To disturb the TokHaar was mistake. TokHaar will hunt us down now that they know we strong opponents.",
    "We are too late! They have caught up with us! Your choice, [Player], do we run or fight?",
    "The worst pain I have ever felt.",
    "Constant, crushing pressure, [Player].",
    "It hurts still, it does not numb.",
    "The TzHaar have treated the Ga'al poorly. the TzHaar are - we are - suspicious of others, slow to change, unaccepting of the weak.",
    "But we did not act cruelly, to die in the Fight Pit is an honour.",
    "The Ga'al are weak and naive without memories. Part of me hates their weakness, but I cannot help but feel a bond with the Ga'al.",
    "Agreed.",
    "If the TzHaar - if the others - knew that this is what happens when TzHaar die...",
    "As the lava poured down I was flooded with memories...",
    "I felt purpose, context, flooding through me, and then...",
    "...the memory of being TokKul. That prison was intense, crushing, a constant pounding pressure. More pain than I have ever felt.",
    "The pain is real. The pressure is real-",
    "Do we run or fight?",
    "Being trapped as TokKul is maddening, [Player]. I was TokKul for short while, but it nearly broke me.",
    "Like I was folded in on myself, crushed so I could not move, could not think. All I knew was that this pain would never leave me, never.",
    "I'm sorry if I'm not as much help as I should have been. This body moves slower than I am used to. The pain also slows me.",
    "But you fight well, like true TzHaar.",
    "We're here. The elders must know what I've learned. Meet me at the Main Plaza.",
    "I'm not sure. TzHaar live at peace with becoming TokKul when they die. If all TzHaar knew the pain of being TokKul, society would collapse.",
    "They have to stop... they have to...",
    "No, [Player], it is important they know that TzHaar-Ket-Yit'tal burns within me. I have knowledge of how to fight.",
    "Yes. Now, TzHaar-Mej, listen to our story. Listen carefully.",
    "No! Do you not see? You cannot put more Ga'al through the pain I'm in. The constant pressure, the terrible memories of being trapped in TokKul... it is too much.",
    "You do not see! Names and castes are not what is important. You do not understand...",
    "Help me, [Player].",
    "You would let the Ga'al live in constant pain? The TzHaar do not listen to reason, [Player]. Goodbye - you have been a good friend and teacher.",
    "I must go. The TzHaar are blind.",
    "How can you say that? Would you want other Ga'al to suffer like me? This cannot be allowed.",
    "Despite what you say now, you have been a good friend and teacher. Goodbye, [Player].",
    "I must go. The TzHaar are blind.",
    "I am also interested in the Kiln, but not as a tool for the TzHaar's experiments.",
    "You have been a good friend and teacher. Goodbye, [Player].",
    "I must go. The TzHaar are blind.",
    "But what?"
  ],
  "NoRemorse77": [
    "Have you seen any dragon claws lying around? I can't go into the Pits without my claws!",
    "Anyone seen my D claws?",
    "Seriously guys, who's taken my claws?"
  ],
  "LolthenKILL": [
    "Yea wut?",
    "This is going to be sweet!",
    "GL, k?"
  ],
  "Firecapezorz": [
    "These noobs don't stand a chance."
  ],
  "Odischamp": [
    "Hurry up, let's just get in the Pits. I wanna go kill frosties.",
    "No one cares about your point system, Morean. It's stupid."
  ],
  "FightpitPKer": [
    "Ten points if you kill another person; twenty if you kill a TzHaar. A point each for the Ga'al; they're fodder, dude.",
    "Just making this a bit more fun.",
    "So, are we all agreed on how many points you get per kill?",
    "I'm not Morean, I'm FightpitPKer! Master of the bow, ruler of the P-."
  ],
  "TzHaar-Ket (Hardened)": [
    "Are JalYt always this loud?",
    "Speak to TzHaar-Mej-Ak if you want fight in Fight Pit."
  ],
  "TzHaar-Xil (Hardened)": [
    "We here for fight, not talk.",
    "Speak to TzHaar-Mej-Ak if you want fight in Fight Pit."
  ],
  "TzHaar-Ket": [
    "JalYt, be quiet!",
    "TzHaar-Mej-Jeh say you may pass through here. This go to ancient Kiln. Be careful, loud noises through there, sound like wild Ket-Zek. Take pickaxe too. No one been through for long time."
  ],
  "Ga'al Xox": [
    "Ga'al Xox a TzHaar?",
    "Ga'al Xox not real TzHaar yet, soon Ga'al Xox will be.",
    "You right - Ga'al Xox not real TzHaar, yet."
  ],
  "Checkpoint": [
    "You have successfully cleared this cave. If you leave this cave and return the cave will remain cleared."
  ],
  "Option 1": [
    "Reach in and take the book.",
    "(Step in)"
  ],
  "Option 2": [
    "Leave",
    "(Let Ga'al-Xox fight)"
  ],
  "TokHaar-Hok": [
    "It has been... a very long time... since outsiders have entered our Kiln.",
    "Let us test your skills... let our sport be glorious.",
    "Come speak with us.",
    "You must be forged of strong rock to repel our... siblings.",
    "Not many visit... our Kiln. We like to test our skills against those who do. Come, human... let us talk a while.",
    "It has been a long time since we have spoken, so forgive us... if we are slow.",
    "Let us talk...",
    "We are... the TokHaar.",
    "We were forged to build the mountains of Gielinor... although they had a different name then. We were forged in this Kiln by our masters.",
    "When our work was done, we built a great mountain around this Kiln and returned to live within it... to await further instruction.",
    "Or, at least... some of us did. Some of us stayed behind in the mountain.",
    "Ah... yes... they call themselves the TzHaar now.",
    "They chose to live within the mountain we had built. They tunnelled through it to build their cities... undermining our great purpose.",
    "On occasion, creatures... like you... have wandered into our home.",
    "Below your feet flows the lava of creation... those who fall into it surrender their shape, memories and language... They become one with the TokHaar...",
    "Many beasts from the surrounding caves have been submerged in our Kiln.",
    "They pollute our resolve... but there are certain advantages... we learn from them.",
    "We do not keep time... human. We were here at the beginning and we are still here.",
    "We have been practicing our skills against one another; honing our strength in anticipation of our masters' return. Combat... is our great pleasure.",
    "Our masters were the designers of this world. They were the architects of the seas and the valleys, the icy lands to the north, the desert plains... and the mountains.",
    "We were their tools... their mountain builders.",
    "They built the Xil to dig up the earth and rock... the Mej to blast it into a size that the Ket could carry... and the Hur to craft the sediment into cliff-faces and slopes.",
    "We remember them... yes... and we shall wait for their return.",
    "Yes...",
    "This is the Great Kiln from which we were forged.",
    "The Kiln was built by our masters to form the mountains. We have completed that task... now we wait for the return of our masters... and new orders.",
    "Within this Kiln flows sacred lava. Through it, we remain constant. If we are destroyed within this place, the lava rises and the Kiln forges us once more.",
    "Through this we are one... our memories shared by the lava. Existence as individuals is only ever... fleeting.",
    "Combat is our pleasure. We wanted to test your abilities in our sport. You have proven quite capable.",
    "It has been such a long time since creatures have wandered into our home. We were... hungry for a challenge.",
    "Ah... yes... they did not return with us... they chose to desecrate the mountain they were destined to build and call themselves TzHaar.",
    "They are the epitome of weakness and corruption.",
    "We were forged to build the mountains. When we finished, most of us returned to this Kiln.",
    "But some stayed behind to live in this mountain instead. They tunnelled through our great work to create their cities and mazes.",
    "It is... unnatural... to live outside of our Kiln. When we are destroyed... we are reforged by the Kiln. Our memories stay as one.",
    "The TzHaar have become so... weak. They pass on their memories through sordidly laying eggs... letting the sacred lava pass from one to another so wastefully.",
    "In the end, they become what they call 'TokKul', often neglecting to pass on their knowledge.",
    "Their memories going to waste... not returning to the sacred lava. They have forgotten their great purpose.",
    "And... why? To build cities of waste... shrines of disrespect to our great cause... to our purpose.",
    "So, you came here with a purpose...",
    "If the TzHaar had remained in our Kiln... they would not have to resort to such foolish endeavours to preserve their memories.",
    "Do you think this little 'Ga'al' can survive such a process? He might melt under the heat and become one with us.",
    "What about you... human? Do you think the little Ga'al should sacrifice itself to hold the TzHaar's memories?",
    "The TzHaar are a corrupt race... although We[sic] can see how they may seem ordered and principled to you. Humans are agents of disorder and anarchy.",
    "If they returned to this Kiln, there would be no Ga'al... no TokKul... no eggs. Their problems would melt away - all by staying true to the original purpose.",
    "But your loyalty... while misguided... is commendable.",
    "But will the Ga'al be better for it?",
    "So, you are the reluctant guardian of this Ga'al? The TzHaar are a corrupt race... and have no doubt deceived this Ga'al to make it undergo such a...process...",
    "We would allow this transformation... only, you do not have the TokKul of the dead champion with you.",
    "We shall allow this transformation to be carried out. Ga'al - stand under the mouth at the entrance to the Kiln.",
    "And embrace the heat.",
    "Ha ha. Not today, although to fight with you would be most...pleasurable. You have provided entertainment and we would like to talk with you a while. It has been a long time since we have spoken, so forgive us...if we are slow. Let us talk...",
    "Nothing you haven't asked for... the creature was just too weak to endure it.",
    "Leave this place... take the Ga'al to the TzHaar... we'll ensure you have some company on your way back... once the Ga'al is with the TzHaar then return to us for a real challenge.",
    "Combat is our pleasure. We wanted to test your abilities in our sport. You have proven quite capable.",
    "It has been such a long time since creatures have wandered into our home. We were... hungry for a challenge.",
    "We would like to meet with you again... we are hungry for more sport. Return the creature back to its masters... finish your business, and then return here if you want a real battle.",
    "Hurry... [Player]... we are hungry for more.",
    "So the TzHaar wouldn't listen... about the pain you've endured... they do not understand the torment of being trapped in TokKul... something must be done...",
    "Let us talk for a while... my little Ga'al...",
    "We apologise. We haven't faced anyone other than ourselves for such a long time. Speaking with you and... meeting... the little TzHaar flared our curiosity. Those you destroyed are lost to us now. It is we who suffered for our sport."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:The_Elder_Kiln?oldid=35886082’"
  ]
}