{
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "Missing some dialogue options.You can discuss this issue on the talk page or edit this page to improve it."
  ],
  "Alfrick the Planner": [
    "No! The Moon Clan cannot be allowed to hold a magical display inside the city!",
    "If you want to have a magical display, put it outside the city. We're not going to ignore our ways because you won't back down!",
    "Stubborn Moon Clan! Magic is not acceptable here!",
    "[Fremennik Name]!",
    "Indeed. [Fremennik Name], we are planning to celebrate the return of V! You do know who V is, I assume?",
    "Harrumph...",
    "That's right. Our people's greatest hero is returning, and we need to welcome him appropriately.",
    "But regardless, we don't think of or worship him as a god. To us he is and will always be a great hero. He may have great power, but he tempers it with a mortal outlook. In any case, he is returning and we need to welcome him back.",
    "I doubt it. We worshipped Guthix, and now he is dead we worship no one - not even V. If gods come here looking for converts they will be disappointed. However we need someone who can keep us safe from them when this happens.",
    "But he's not really a god. He's the greatest hero that we've ever had.",
    "Yes; V is going to arrive regardless. Your participation will simply prevent the Fremennik and Moon Clan people breaking up once more over these minor differences.",
    "But, as you might have noticed we are at a bit of an impasse. We're trying but we really can't come to an agreement.",
    "Of course, I think both Fremennik and Moon Clan would accept your advice, [Fremennik Name], if you won't mind arbitrating, that is?",
    "Well I suppose we'll just have to try our best without you.",
    "Could you at least call him/her [Fremennik Name] and not that outerlander name?",
    "Since V was born a Fremennik it makes sense for us to use Fremennik legends as a guide to complete the preparations.",
    "We need to find the answer to several questions so we can make the celebration perfect. Some relate to planning while others will help us to write a speech.",
    "What sort of feast did V have before he left? How should V be welcomed? When and why did V leave the world? If you speak to people around Rellekka they should have the answers for you. I would suggest you start with those members of the council who voted for you. Even if they don't know something they may be able to direct you to someone who does.",
    "But, as you might have noticed we are at a bit of an impasse. We're trying but we really can't come to an agreement.",
    "Not well. We're no longer at each other's throats, but we're still no closer to an agreement.",
    "Welcome back, [Fremennik Name].",
    "We need you to check on a number of questions that have arisen in our planning for the return of V. Some relate to planning while others will help us to write a speech. The people of Rellekka will be able to tell you what you need to know. Just ask them about any information they remember about V. I would suggest you start with the main longhouse and the marketplace. People there are more likely to know what you want. When you have the answers we need, you can tell us and we will finish the celebration.",
    "Of course!",
    "I am Alfrick. Once just Alfrick the Sailor, now Alfrick the Planner. Peer the Seer foresaw that I would be instrumental in the return of V, so I have been tasked with setting up this celebration. I would have turned them down if I knew how closely I'd be working with the Moon Clan in this matter...",
    "I'm trying, I truly am. But it takes a while to get over old grudges, you know?",
    "V is one of the greatest heroes the Fremennik have ever produced! He did set up some of the rune altars and teach the Moon Clan some tricks...but I guess we're all trying to get along so that can be overlooked.",
    "We don't talk about him to outerlanders...no offense[sic], [Fremennik Name].",
    "Amongst ourselves we tend to keep the stories of V for special occasions, of which we've not had one while you were around. Every Fremennik has heard at least a few sagas about his powers. He's a regular character in our oldest legends too. The thought of meeting him in person is a little overwhelming!",
    "Don't ask me. Freya's lot took care of picking the location. My guess is something to do with magic. At the very least if we do have to have magic involved in the ceremony it'll be out there and not in Rellekka itself.",
    "Goodbye.",
    "Goodbye.",
    "That doesn't match any of the stories I have heard about V. But since you say that's the case we'll go with it.",
    "Look, we said we'd stick with whatever Player said was right, and he has given his answers.",
    "Well why don't you snap your fingers and fix it with magic?",
    "That sounds...about right.",
    "Don't worry! You can relax now, [Fremennik Name]. We'll take over from here.",
    "It's time, [Fremennik name]! V's arrival is imminent!",
    "Of course! We wouldn't have done it without you, after all. Grab some food and ale. This will be a day to remember!",
    "Welcome to you all! You join us on this momentous day; the return of V!",
    "Although his deep respect for Guthix caused him to leave us at the end of the Third Age, he will stand with us again.",
    "But will we fall into despair? No! That is not our way!",
    "I do. Why do you ask...",
    "V has returned! Let us all celebrate!",
    "Let us drink to all the victories he will bring us now he has returned!",
    "Hey there you two. Are you ready to go?",
    "Fair enough. Let me know when you are.",
    "Feeling a little better, [Fremennik Name]? You certainly showed us all how to feast last night.",
    "The Moon Clan helped with that. They know how to get their hands dirty, at least.",
    "I'm not sure. Maybe he was tired? Could that be how oxen look on other worlds? Do you know something? You are the World Guardian after all.",
    "I'm sure you'll know more after we go to the island.",
    "It isn't too far off the coast. It was an old trading post and neutral ground used when our people were more nomadic. It hasn't been used in ages, however. I'm not sure why V has chosen to go there.",
    "So are you ready to go now?",
    "Fair enough. Let me know when you are.",
    "Hello there, [Fremennik Name]. Do you want to go back to Rellekka?",
    "It is an old trading post. Back when the Fremennik were not so divided people would gather here to trade. Of course, after the Moon Clan split off from us it became a bit of a battleground and then abandoned. That was ages ago - literally! This place has been nothing more than a stop for lost fishermen since the Third Age.",
    "Not really. Do you have any ideas?",
    "Goodbye.",
    "Goodbye.",
    "Hello there, [Fremennik Name]. Do you want to go back to Rellekka?",
    "Not really. Do you have any ideas?",
    "Worry me? Is something wrong?",
    "Uh...duplicate rocks? What's going on?",
    "What's the matter, [Fremennik Name]?",
    "But how could this happen? The others...we'll have to tell the others.",
    "The Fremennik will stand with you, [Fremennik Name]! Where are these beasts to be found?",
    "That's right. V was a hero, and heroes don't give in! We'll support you in whatever way you need.",
    "For now though, we'll get the word out that V has fallen. You focus on the Dragonkin.",
    "Hello there, [Fremennik Name]. Do you want to go back to Rellekka/the island?",
    "Is there anything else I can help you with?",
    "Well, right now we're thinking of turning his island into a shrine.",
    "We didn't, and we still don't. But he was a great hero, the greatest hero we have ever known - present company excepted. We are going to raise a shrine to him to remember the man he was and the hero he became. We will bring our children and grandchildren here. Then they will learn of V, his life, and his death. In that way, the monsters that killed him will never have truly killed him to his ideals.",
    "Goodbye.",
    "We have some too. Can you come with us to V's island?",
    "We'll meet you inside the cave, Player.",
    "We've converted this island into a shrine to V and his works.",
    "We're not going to forget V. And we won't let those that took him from us forget his legacy either.",
    "I agree. Player has earned some rest. And we will live up to our word; you will find that all of V's people stand with you.",
    "Exactly. Take a little time. You don't have to deal with this all in one go. Even heroes need a little rest every now and then.",
    "Hello there, [Fremennik Name]. Do you want to go back to the island?",
    "Is there anything else I can help you with?",
    "Well it looks like I’m the official person to take people to V’s shrine. Someone even suggested I change my name to Alfrick the Shrine Keeper. I do get to meet a lot of people. It seems a lot of others have heard of V’s death and want to see his shrine.",
    "We get a lot of Godless coming through these days. A lot of them try and convert me and the others, but we’re not really interested. We also get a lot of goblins. They want to see if V’s shrine is bigger than Bandos’ and hear how he died. I think they believe it’s a bit of a competition. ‘My god was killed by a bigger god than yours’.",
    "Not really. Once we start telling them tales of V’s exploits they settle down and listen with rapt attention. It must be unusual for them to hear about a god who values strength who is less brutal in approach."
  ],
  "Freya Lune": [
    "Why not? V will be expecting one! We can't just ignore the contribution he made to our culture.",
    "I won't back down? What about you? If I demanded all Fremenniks to go weaponless and unarmoured how would you feel?",
    "Ignorant Fremennik! Stop being so pig-headed!",
    "Player!",
    "You're right. We need to remain professional here. This is a momentous occasion that we cannot ruin because of old grudges.",
    "I'm surprised you were not told when you were with us. V was a Fremennik who discovered the Stone of Jas. He touched it and became imbued with great power. In addition to acting as a great hero to our people he discovered the means to create rune stones and passed this secret to us.",
    "Part of the reason the Moon Clan and Fremenniks have been separated for so long was because the Fremennik later disagreed with this and tore down his rune altars. He has recently visited members of both the Moon Clan and the Fremenniks in dreams.",
    "I'm glad you know so much about him! It isn't surprising given how closely he is tied to our history. He has recently visited members of both the Moon Clan and the Fremenniks in dreams. He is apparently returning from a far-off plane to aid and defend us now that Guthix has fallen and the gods are waging war on each other.",
    "Well, he became of god-like power when he touched the stone. And from our visions has acquired even more. From what little we know about such things, it is likely he used his power to slay at least one evil god to truly ascend.",
    "But he's not a 'god' god. He is our champion.",
    "Which would either be V or yourself. Tell me, [Player], do you feel like becoming our champion against the gods for all time?",
    "Thank you. We don't want you to do anything you are uncomfortable with. All we are doing is planning the celebration to welcome V.",
    "We know for a fact that V is not interested in the new god wars, the Stone of Jas or competing for further power. He just wants to protect us from those gods that are trying to claim the Stone. He won't be a rival to anyone who does not attack him first.",
    "Well how about you help us plan the celebration, then you can walk away if you wish?",
    "It will help to preserve all the good work you've done!",
    "Thank you. We don't want you to do anything you are uncomfortable with. All we are doing is planning the celebration to welcome V.",
    "Thank you. We don't want you to do anything you are uncomfortable with. All we are doing is planning the celebration to welcome V.",
    "Exactly. If we don't resolve this soon, then V's arrival will be ruined, and it may re-open the rift between our groups.",
    "I have no objections to Player's judgement in this matter. Will you help us?",
    "Sigh...",
    "Wonderful! Thank you, Player!",
    "Can we not even agree on that, Alfrick?",
    "We need you to help us decide a few of the details regarding the celebration to welcome V.",
    "But he was also the patron of the Moon Clan! You can't just ignore that!",
    "What ballad should be played on V's arrival? What flowers should be used to decorate the stage? Should magic be used in the ceremony?",
    "We will both agree to go with what you decide, Player.",
    "I'm glad you know so much about him! It isn't surprising given how closely he is tied to our history.",
    "He has recently visited members of both the Moon Clan and the Fremenniks in dreams.",
    "Are you sure you can't help us? We only need you to mediate our discussion a little.",
    "Greetings, Player.",
    "We have a number of questions relating to the return of V that we need answering if we are to plan a celebration for him. Some relate to planning while others will help us to write a speech. As V was born amongst the Fremennik they are likely to have the answers you seek. Just visit Rellekka and speak to them about V. I would suggest you start with the main longhouse and the marketplace. People there are more likely to know what you want. You can return to us with these answers and we will be able to move on.",
    "Certainly!",
    "I'm Freya Lune of the Moon Clan. I used to be an assistant to the Oneiromancer for a while. I think that was why she chose me to help with the ceremony. What do you think?",
    "My mother became ill and I needed to care for her until... Never mind. I suppose coming back here has also helped me to occupy my time. I just wish that the Fremennik were not so...backwards.",
    "Alright. This is a momentous occasion and I should do more to cooperate.",
    "How have you not heard of V before now?",
    "That makes sense. V is the patron of the Moon Clan and one of our greatest heroes. He discovered the art of binding energy into rune stones, constructed the Astral altar and taught us many spells. There are some scholars who think he may have made all the altars, but I am not one of them. It's just sad that the Fremennik could not accept this. He's a hero to them but they tend to focus more on his might than his wisdom. But he is both wise and mighty. I'm really looking forward to speaking with him!",
    "We have picked a location outside of the city for a couple of reasons. For a start off nobody, V included, thought it would work to ask the Fremennik to have a magical display inside Rellekka.",
    "Also, it is roughly where he left this world the last time. There used to be a small glade there in the past ages - he showed it to us in dreams. Of course, everything looks different now. So we'll have to do our best making him feel at home again.",
    "Goodbye.",
    "Goodbye.",
    "But wait, that means that we'll have to re-do most of the preparations that we've already done!",
    "I'm not saying we need to back out of our agreement, I am just confused as to why these answers mean we'll have to re-do so much work.",
    "Why don't you try hitting it with a sword?",
    "Thank you, Player! We can begin now.",
    "Yes; you can just relax and enjoy the feast.",
    "Greetings, Player, you have arrived just in time! V will be arriving any moment now. Come, take a seat!",
    "Don't be silly. You helped to heal the rift between our people and with this celebration. Of course you're invited to participate! You don't even have to do any further work; just enjoy the feast!",
    "V, hero to both our peoples, has decided to return to us in these troubling times.",
    "Guthix is dead, and his edicts have faded. The other gods rampage across the land...",
    "We need not fear, for in this darkness V has come to defend us!",
    "Someone clear away his...gift. Then we can begin. Let us...um...",
    "Yes, let's do that.",
    "So you're awake again, Player?",
    "We used magic to get things back to the way they were before. And a giant, talking monkey made off with the last of the drink.",
    "I'm not sure, but I know I wouldn't touch any of the meat he created. That was horrible! Could he be ill? Do gods even get ill?",
    "Oh that? I'm not sure myself. I think Alfrick is the best person to ask about it. I'll accompany you both. I think this will be an ideal time to speak to V about the history of the Moon Clan!",
    "Greetings, Player. Do you want to go back to Rellekka?",
    "From what I can tell it is an old island where Fremennik used to gather to trade. Of course, that was before the Fremennik destroyed the altars and we stopped talking to each other. This was in the Fifth Age, so it has been abandoned since then. By us at least; the Fremennik must use it or why else would Alfrick know of it?",
    "Do you think he wants to talk about healing the rift between the Moon Clan and the Fremennik further?",
    "Goodbye.",
    "Goodbye.",
    "Greetings, Player. Do you want to go back to Rellekka?",
    "Do you think he wants to talk about healing the rift between the Moon Clan and the Fremennik further?",
    "What do you mean by that? You mean the Fremennik and the mountain tribes?",
    "Duplicates? You mean magically created plant clones sent to replace us all?",
    "Oh, well no either way.",
    "WHAT? How...? What?",
    "Nonsense.",
    "Idiot. If you say we cannot take these beasts in a fight then I will believe you. But that does not mean you are alone. The Fremennik and Moon Clan will not stand by while this happens and leave you friendless, carrying this burden by yourself. So fight them by yourself if needs be, but you are NOT alone here, Player!",
    "Greetings, Player. Do you want to go back to Rellekka/the island?",
    "Can I help with something else then?",
    "Well for me I'm not sure. We've decided to build a shrine to V and his life as a mortal on the island. But after that...I have no idea. I was only involved in this to welcome V and now I just feel lost. Is this what you have to deal with, Player?",
    "Being swept up in events larger than yourself. Feeling there is something you just need to do about the situation and not knowing what. Is that what being a hero is like?",
    "Goodbye.",
    "We'd really like to show you something. Are you ready to go?",
    "Or do you want to go back to Rellekka?",
    "All of his people helped. The Fremennik, the Moon Clan, even some of the mountain tribe.",
    "That's a problem for another day, [Fremennik Name].",
    "For now, we have a reward for avenging our hero. Stay here a while, speak to V in your thoughts if you need to focus. We all believe you'll set this right one day.",
    "We'll leave you to it. You have our thanks again, [Fremennik Name].",
    "Greetings, Player. Do you want to go back to the island?",
    "is there anything else I can help you with?",
    "I’m not really sure. Alfrick and I are still bringing people to and from the shrine but I feel like I could be doing…more. Do you see what I mean?",
    "Maybe you should take an example from V’s early life?",
    "Before he even had the power of a god he used his gifts as a seer to guide and teach. So take your time. Find out what you need to know. Teach yourself the skills you lack and then move forward based on that.",
    "V may be dead but his wisdom lives on. While it may seem more glamorous to wade in, spells blazing, sometimes a careful approach is needed."
  ],
  "Player": [
    "Excuse me...",
    "Could I just...?",
    "Hey! Will you two stop yelling at each other for five seconds?",
    "Will one of you please explain what is going on, preferably without resorting to insults again?",
    "So V is a god now? I thought he was a mortal hero.",
    "I have pledged my allegiance to the Godless. I really cannot support any action that will bring more gods to this world.",
    "But won't his presence draw other gods to attack you?",
    "You do make a good point. I am still not convinced...but I suppose if V does just remain here I can offer some help.",
    "I'm sorry, but I have already pledged myself to another god. I can't really help bring another god to this plane without betraying that pledge, can I?",
    "That's kind of sophistry. He is a being of godly power and therefore a rival for my own god.",
    "I still don't feel comfortable with this.",
    "You do make a good point. I am still not convinced...but I suppose if V does just remain here I can offer some help.",
    "You know I have pledged support to another god, right? I'm not entirely comfortable with this, but I will see how things go for now.",
    "You know I support the Godless, right? I'm not entirely comfortable with this, but I will see how things go for now. This is more a warning that I may have to leave if something happens that conflicts with my beliefs.",
    "Before we get side-tracked by another argument, can you tell me what you need me to do?",
    "Ok, I see where the issue is coming from. So what do you want me to do, exactly?",
    "Thanks. I will be back when I have the answers you need.",
    "Well I am an expert in ancient lore.",
    "How is it going?",
    "That's right. Can you help?",
    "I'm sure you don't need to be a seer to have worked that out!",
    "Hello!",
    "Can you tell me about V?",
    "Hello there!",
    "That's right.",
    "Sure!",
    "I think I have all the information about V that I need. I should go back and help Alfrick and Freya with the celebration.",
    "I'm not sure why I expected you to be useful.",
    "Can you remind me what these questions are?",
    "It does sound likely. Why did you stop being her assistant?",
    "Can you not learn to get along?",
    "I have heard a little - I just want to know more.",
    "A good point.",
    "Can you remind me what these questions are?",
    "Come on, can't you try and work together?",
    "Why have I never heard of him before?",
    "None taken.",
    "Please, calm down! If my answers don't match what you know of V then maybe I was mistaken. I'll try again.",
    "Do you need me to go and gather any of these things or set them up?",
    "That's great news! I assume I'm invited.",
    "Am I invited? I mean I have a Fremennik name, but this seems a little private.",
    "What...what happened?",
    "What am I doing here? I guess I must have enjoyed myself more than usual. I should head back to Alfrick.",
    "Awake and ready for action. Where did all the celebration stuff go?",
    "Speaking of the feast, what do you think happened to V?",
    "So what is this island he wants me to go to?",
    "I'm feeling pretty good, actually. How did you get everything here cleared away so nicely?",
    "Speaking of the feast, what do you think happened to V?",
    "That does not mean I know everything!",
    "Where is this island anyway?",
    "I'm sure we'll find out soon.",
    "None whatsoever. I should go and talk to him.",
    "That could be it. I should go and talk to him.",
    "What do you mean?",
    "That is strange. I'll see what I can do.",
    "Hello. What are you doing here?",
    "Your boat seems a little far from the water.",
    "What an eccentric person.",
    "And what should I call you?",
    "Why have you asked me here?",
    "Is this to do with what happened at the feast?",
    "What do you mean?",
    "What could be causing this?",
    "Is there anything you can do about it?",
    "That seems simple enough.",
    "I am just trying to help. If you know what is causing the issue, you should tell me.",
    "That would be interesting.",
    "What's the second reason?",
    "So what about the third reason?",
    "What does that mean?",
    "Why not?",
    "So do people worship you as one of these hero-gods?",
    "I remember hearing at the feast from some of the Moon Clan that you were a seer. Is that not the case any more?",
    "Why is that?",
    "Why do you fight with them? Aren't they on your side?",
    "Good point.",
    "Wow! That was a great story!",
    "Well he did tell me...but I don't want to worry you.",
    "No! No...nothing's wrong. By the way, have you seen anything...odd around here? Like duplicates of rocks and the like?",
    "Nothing you need to concern yourself with.",
    "I think it involves healing a kind of rift, at any rate.",
    "Not really. On a related note, have you seen any...duplicates recently?",
    "Uh...no. Nothing that serious, actually.",
    "I was just checking what I needed to do.",
    "On it!",
    "I can't feel any more godly energy in the area. I must have sent it all back to V.",
    "You were duplicated due to...actually what happened is your evil twin appeared.",
    "Being a protagonist isn't that bad. The hours are great and you get all the gold you can carry.",
    "V? Are you okay?",
    "But we took care of the leaks!",
    "Is there anything that we can do?",
    "What?",
    "What are you doing here? Are you the one doing this to V?",
    "V...",
    "You monsters!",
    "This isn't over. V will be avenged.",
    "V...You saved me. I won't let them get away with this. I should start checking V's belongings in case he had any more information on Tarshak from their encounters.",
    "This looks like the ancient caverns beneath the Baxtorian falls whirlpool. Now I know where to start looking to track down Tarshak! Thank you, V!",
    "V...is dead.",
    "The Dragonkin killed him. They stole his power with something called the Elder Mirror. His body lies in the cave there.",
    "I'm going to try and find the Dragonkin. Whichever way you look at this, they need to be stopped and the Mirror hidden if not destroyed.",
    "With the Mirror, the Dragonkin can pull the energy from and eventually kill the gods. That cannot be allowed to happen.",
    "With the power of the gods, the Dragonkin will easily wipe out or enslave the mortal races. They will become new, terrible gods! I oppose the gods and what they do to people, but this is not the way to deal with them.",
    "They killed V without mercy or dignity. I will not allow this to stand!",
    "I don't know yet. Even with that knowledge, I don't think you can help. These things are powerful, and one of them has the power of a god. As World Guardian this is something I need to tackle alone.",
    "W...what? But the Dragonkin...",
    "Thank you...",
    "I thought you didn't think of V as a god?",
    "What do you mean?",
    "I can't answer that question. I'm a World Guardian, but that does not mean I have all the answers.",
    "It's locked...There is an odd depression here lined with what looks like mithril. Could it be some kind of keyhole? Maybe if I make a mould from the space I can try and make a replica key to get in.",
    "Curse my feeble limbs! I'll have to see if there is something nearby hot enough to melt the mithril.",
    "Why won't this work? What good is living in a magical world when I can't just rub two items together and solve the problem?",
    "Looks like I can't substitute a mould of the key for the real thing.",
    "There seems to be something strange about the mithril on this door. It looks like it has an odd texture I've never seen before. I wonder if it was heated in an unusual way? Maybe I should try something exotic like lava...or even dragon fire!",
    "What happened to Tarshak? Did he go to see this 'Phalaks' person? And what happened to the Mirror? That charm sounds like a useful item to have if I need to deal with these monsters. I wonder if I can get it...",
    "I'll kill you for what you did to V!",
    "Still...alive. Still...going to make you...pay.",
    "Well until then you have to answer some of my questions!",
    "You know, the sooner you answer my questions, the sooner I will leave.",
    "Useless? Isn't it used to kill False Users?",
    "But then how did you use it to kill V?",
    "So that's why the island was being 'duplicated'. You were pulling the power of V into the Mirror and it was activating it.",
    "Why not kill one of the other gods?",
    "V was greater than you imagine, monster!",
    "Maybe draining the energy from the gods into yourselves is not a good idea?",
    "Phalaks...that was what Tarshak said before he escaped. If he thought he needed help from him before he started mutating, he'd definitely want to speak to him now. I should head to the Grotworm Lair and see if I can find the entrance to wherever Phalaks is hiding.",
    "Maybe I should let the Dragonkin handle this by themselves...",
    "I didn't do anything. It was you and your 'friends' that drained V of his energy. But I have to say, this is a good reward for you.",
    "I hope it hurts, Tarshak. I hope it hurts as much as it hurt V when you finished him off!",
    "What? What's happening to him? Can he be killed?",
    "His sanctum? Where is that? I should ask them for more information.",
    "You're welcome.",
    "Well since we are in this current position, would you mind answering a few questions for me?",
    "Let's start with the important one; where has Tarshak gone? You mentioned something about a 'sanctum'.",
    "Where is it?",
    "What happened?",
    "I didn't exactly know what to expect when I came here, to be honest.",
    "We call it being a hero.",
    "Uh...So why did you build your lab here? Isn't it sort of exposed?",
    "Well technically it was another dragonkin that drained him into Tarshak, but yes.",
    "Regrettably? V was a great man and a...",
    "Um...",
    "I would still be interested in hearing it.",
    "And that is?",
    "Alright Tarshak; no more running! You and your 'friends' will pay for what you did to V. First you, then the... ...Oh.",
    "Well, that's just perfect.",
    "Kerapac, I...",
    "I can't just leave.",
    "What about Tarshak and the Necrosytes?",
    "That's not what I meant. I can't just leave because they are in the way.",
    "That's a foolish plan. Each time you do it you'll lose at least one of your people.",
    "I think the plan needs refining, but could work.",
    "Cough cough...",
    "I'll never get a chance to avenge V directly while they are fighting. I should return to Rellekka to see if there is anything I can do there. It looks like I lost the protective charm anyway. It would be suicide to go back in and get it now.",
    "I think I'll give it a minute.",
    "I have some news for you both.",
    "What happened here?",
    "On that note, the Dragonkin that dealt him the final blow and stole his energy has been stopped. And the rest of them are fighting tooth-and-nail over what happened. I don't think they will be working together any time soon. The problem is, I don't think they have been stopped overall. I still have a lot of work to do. And the Dragonkin who came up with the scheme has gone unpunished for now. I will still need to deal with them directly...",
    "Thank you both for your support. I guess it can't hurt to take time to come up with a good plan.",
    "I don't have time for that.",
    "I was just wondering what you intended to do now.",
    "Like who?",
    "Do they cause much trouble?",
    "I was just wondering what you intended to do now.",
    "I do. The Dragonkin are still a threat, but I can’t just go bumbling after them without a plan.",
    "In what way?",
    "That sounds like a pretty good solution.",
    "What are you looking so worried about?",
    "But I know you weren’t. I was there, it was a Dragonkin…",
    "He who?",
    "Aren’t you over-reacting a little here? I’m sure nobody curses your name. Just go home and you’ll be fine.",
    "I have a feeling you are reading too much into this situation. But good luck on your quest.",
    "You mean attuned to be more damaging?"
  ],
  "Yrsa": [
    "Welcome to my clothes shop. I can change your shoes, or I've got a fine selection of clothes for sale.",
    "Oh, you want to know about V? I know a little about him from my father's old stories. It is one of those bitter-sweet stories, specifically about why he left. When Guthix laid down his edicts and forced the other gods to flee, V left without being told to, after saying goodbye. You see, he respected Guthix and what he was trying to do. The world was better off before the other gods arrived. So he chose to leave us rather than force the issue. Until Guthix died I am sure he never thought of even testing the edicts. Unlike the other gods he's never wanted to conquer or crusade; just to fight for what is right."
  ],
  "Peer the Seer": [
    "Uuuh... What was that dark presence I felt?",
    "Ahem, sorry about that.",
    "Hmmm, I have foreseen the return of V in dreams. I assume this is why you are asking?",
    "I certainly can. I assume you have been asked to help because the differences between us and the Moon Clan are causing problems?",
    "The biggest difference in opinion is over magic. V did teach people how to make runes and built some of the altars that we later destroyed. However he was, in the beginning, interested only in simple magic's[sic] to aid our people. As a seafaring and nomadic race, the first spells he taught were to do with air and water. I am sure he would prefer a simple display of these older magics than something the Moon Clan have developed since then. But don't tell anyone I said that. I disagree with the use of magic, but just denying the Moon Clan a part in the ceremony would be unfair."
  ],
  "Swensen the Navigator": [
    "Greetings to you brother/sister [Fremennik Name]. How fare you today?",
    "Certainly. I do know one story about him you might find useful. Once, V and his companion Knut were fighting daggermouths in a flooded cavern. V prevailed, obviously, but when he turned he found Knut had been killed defending his back against another wave of the foul creatures. He constructed a cairn for his friend who had sacrificed so much for him, and caused Winter's Eye plants to flower around it. Ever since then people have considered Winter's Eye to be a favourite flower of V's."
  ],
  "Sigmund the Merchant": [
    "Greetings again brother/sister [Fremennik Name]! What can I do for you this day?",
    "I can tell you what I know about V, which is that he stayed with us for ages. He defended us during the opening parts of the god wars, to such a degree that the other gods stopped trying to attack us. Make no mistake, they were far more powerful and had more followers, but V's presence made every Fremennik fight like a warrior of legend. I know that he remained with us until shortly after the Third Age and the creation of the edicts. I believe he managed to parley with Guthix to stay long enough to say goodbye. Everyone seems to imagine the edicts as some huge explosion of force, which is only partially correct. It is said it was more like a series of bans. The major antagonists were thrown out first. Then minor gods were ejected as they were found, ran for the hills or opted to leave. If they were respectful they got to say goodbye. Because V had not tried to take over the world like the others, he got his chance to leave us properly."
  ],
  "Brundt the Chieftain": [
    "You want to know about V? There are plenty of stories people can tell you about him. As for me, I just like to think about the core of these stories; how V became our greatest hero. You see, he has never been a god to us. We think of him as a great and powerful hero, which is what he always wanted to be. I take it you're involved in these celebrations for his return?",
    "Then my advice is to treat him like a hero and not a god. Unless he has changed beyond all recognition, he will want to be welcomed as one of our people returning home, not some stranger demanding worship."
  ],
  "Manni the Reveller": [
    "Ah! V! I've heard he's coming back. I can't wait for the party! You know, that reminds me of a legend I heard about him. Would you like to hear it, [Fremennik Name]?",
    "When V left, everyone was pretty unhappy. His people were going to give him a big send off, make speeches and the like. But then V came in and said he didn't want a sad send off. Apparently he'd heard of some monkey-goddess having a joy-filled celebration even though she was leaving and decided to do something like that. So instead the Fremennik had a huge victory feast; and V said it was dedicated to all the good deeds and heroism he'd get up to while away from home. I can't wait to find out what he's been up to since he went away!"
  ],
  "Olaf the Bard": [
    "Hello again to you, [Fremennik Name]. Us bards should stick together, what?",
    "I know a little about V's early life, as it was passed down in songs and sagas. Shortly after V gained power from touching the Fist of Guthix, he returned to us with a warning. A giant basilisk had been seen sunning itself on the shore, and it was heading towards our encampment. Given our nomadic nature at the time many people wanted to pack up and flee. But doing so would mean we could not return here for fear of the monster. V rejected this idea. He rallied the bravest men and women, who equipped themselves with shields made from polished steel to deflect the monster's gaze. Although many brave souls died in the struggle, V was able to strike the death blow and slay the creature. Its brood were then herded into caves nearby. This allowed us to return to this coastline unafraid, and also was his first act of true heroism. There is actually a ballad about the fight. Do you think V would like to hear it played again?"
  ],
  "[NPC": [
    "] You're wanting to do something with that Moon Clan lot aren't you? Coming over here, waving their magic about like it's not a cataclysmic event waiting to happen. I've got nothing that can help with the weirdness they're planning.",
    "] Well, I did hear this hilarious story about the time he left his undergarments in the...oh wait, no, that was Bjorn, not V, sorry.",
    "] Sorry, I'm not that big a follower of history.",
    "] I don't know anything more than some hand-me-down stories involving acts of heroism and glorious battles, sorry.",
    "] Erm...nope, I've got nothing, sorry.",
    "] You could try asking [NPC from above]. He may be able to help you."
  ],
  "[Bjorn/Eldgrim": [
    "] Veeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeee!",
    "] V? V! V...I got nothin.",
    "] Yeah V. We're gonna have a great party for him, woo!...Who's V?",
    "] *hic* Yay Steve! *Hic*",
    "] Its a shad day it is. Bees was a good man.",
    "] Huh? Who? Watcha talkin'bout. *Hic*.",
    "] Oh noesh, she was a good man. I'll miss wossisnamybeardycoolguy.",
    "] Oh V. We will miss...he. He wassa good man...da dee dum de...er...bam?"
  ],
  "V": [
    "My people! My friends and comrades! I have returned!",
    "It does my heart good to see you all again after so long. It is glorious to see Moon Clan and Fremennik side-by-side once more. Even far removed from my home I wept to see you turn upon yourselves. Now you are, if not united, at least no longer weakened by old grudges. And I see that the one who helped to heal this rift is here. Player, [Fremennik Name], you are known to me and I would speak with you further in time.",
    "I see you, Player. I expect all of you to make him/her welcome here on this day of days.",
    "You have no need to kneel to me! Arise, hero!",
    "You honour me. For your good work re-uniting my people it is I who should bow to you.",
    "I see you are already enjoying the celebrations! All of you, raise your voices!",
    "The gods have returned to lead their peoples. Fremenniks and Moon Clan, now your champion has arrived! Soon we shall return to the old, united ways. Each of you will become a hero of legend in the struggles ahead. Tomorrow we can worry about the battles to come. Today, we will feast! Come; eat and drink my friends. Travelling home has left me in need of a meal. Allow me to provide a little more food for this table, before I take my share.",
    "Here, I have created some roast oxen for your enjoyment...",
    "...",
    "What? I...oh. This is...I must go! I will return to Rellekka in a few days, once I am feeling less...once I have...Player, I would like to speak to you of...important matters relating to your good works among my people. Alfrick; you know of the old trading post from the ancient days?",
    "When Player has finished feasting, please bring him/her to me there. Please. Though I must depart for now, know that I am close by once again. Feast! Sing! Be merry! Once I have recovered my strength I will return refreshed and we will begin.",
    "Ah, [Fremennik Name], you have arrived. How was the feast? My pardon; would you like me to call you by your outerlander name?",
    "As you wish. I know my people still insist on these things, but I have travelled far enough to not stand on such ceremony.",
    "Very well, I appreciate your deference to our customs.",
    "Just V. I've been known by so many names, but I always liked my childhood nickname. You and the Moon Clan may think you know my old name, but I keep that a secret. Now, I am simply V.",
    "I believe that something terrible has happened upon my return. Since I set foot upon this world I have felt...lessened.",
    "Please don't mention that. I am mortified to have been so embarrassed in front of my people. No matter how I focus, my power slips away from me. Worse, a strange 'duplication' occurs as this happens.",
    "You have not seen it? I took to patrolling the island and noticed that trees, rocks and other things were becoming similar in appearance. Rock formations appeared next to each other, caves that opened onto themselves sprung up overnight. It is a disturbing trend. It is almost like my presence mirrors the land. I cannot explain it.",
    "I thought it could be Tarshak - a dragonkin that has chased me across time and space to try and end my life. But this is too subtle, too humiliating. He would have just launched himself at me with a blade, not weakened me thus.",
    "I believe so, with your help. Player/[Fremennik Name], if you search the island then you can find places where my power has pooled. Then you can help me drain it back into myself and undo the damage my condition has caused.",
    "My power leaks from me like blood from a wound. I can only maintain it now by force of will. If I search for these leaks then more will occur. If you, with your immunity to godly magics, find them for me, then I can draw my power back and close the 'wounds' through which my power is leaking. All with no danger to yourself. With my powers diminished I will prove an unworthy champion to my people. Please aid me in this, Player/[Fremennik Name].",
    "Why would you refuse? You have helped my people why not help me?",
    "Why would you refuse? You have helped my people why not help me? Besides, think on this; if you refuse me then I will be unable to protect the Fremennik and Moon Clan from the other gods. Not only am I likely to die in battle, giving them more power, but the people you have so recently united will be conscripted and battered to death by those striving for the Stone of Jas.",
    "Search the island for things that seem to have been copied or duplicated. When you find something then try and draw forth the energy. I will then arrive and draw on this power. If you can find the duplicate then draw the power forth again and it should channel to me.",
    "Must we heap further humiliation on me by discussing my problem?",
    "It could be a multitude of reasons. When I am stable and rested, I would be honoured if you would accompany me on a quest to find out.",
    "I have thought about this, and from my meditation I believe it is one of three things. First - the oath I took to Guthix. I swore on my sword and staff, on my very life, that I would honour his edicts, and yet here I am. Given his experience with other gods, I would not put it beyond his planning to have left some sort of 'barbs' on this plane to gouge my soul if I ever returned. But he is dead and his edicts are null. This makes only little sense.",
    "A vicious beast known as a Dragonkin. Though I curse its name I know it as Tarshak. This wicked monster has chased me from plane to plane, seeking to end my life. Its powers are matched only by its rabid desire to end my life, although I know not why. But I have not seen this creature for the better part of a sidereal year. I think it may have been slain or lost my scent.",
    "I have been using portals for age upon age, but always to travel to the next plane. When I heard of the death of Guthix and decided to return home I was particularly far from this world. It may simply be that using a portal to travel this far has strained me so badly I have wounded myself in some unfathomable way. Whatever the cause, my power drains by drips and drabs. I must find a way to stop the leak and then rebuild myself for the trials ahead. Once you have helped me seal my power back in, we will investigate these causes in turn.",
    "What would you like to know?",
    "Unlike the other gods, I do not consider myself a god 'of' anything...most of the time.",
    "Where Saradomin and his followers claim he broadly represents 'law' or Zaros 'order', I do not claim to embody a concept like that. If anything I consider myself a god of heroism. But I would never call myself THE god of heroism.",
    "Because I've met about half a dozen other hero-gods in my travels! You would be surprised how many people, on achieving godhood immediately use the power to become a champion or hero.",
    "Some do, and that's fine. Generally I try to embody heroism wherever I go; fighting for right and justice with blade, magic and cunning. As a result 'worshipping' me tends to involve opposing evil and defending the weak. People are as likely to light incense and pray to me as just cry my name to rally the forces of good, and that suits me fine.",
    "Indeed! I still use my talent to divine the best way to solve a situation. However, as most of these solutions involve fighting I have put away my staff for now. For all my riddles and wisdom, I have found that a mighty sword arm tends to get the job done far quicker.",
    "I have wandered worlds without end for ages. It would take a lifetime to relate all the places I have seen. Although for all the worlds I have travelled I have stayed only briefly.",
    "I always go where a hero is needed, or better yet, where someone to teach people how to be heroes is needed. As such, my travels blur into a long series of battles, desperate stands and teaching lessons by setting quests and subtly helping others grow to be heroes. Rather than settle down and risk becoming a tyrant like other gods, I then move on. Although I can move on in the knowledge that justice prevailed and that the people I have helped need me no more. I have also been honoured to meet some of the greatest heroes of every age. I just wish I didn't have to fight them so often...",
    "Eventually. However, often I arrive where I am needed most; in battle against evil forces. And if you arrived to save a town or village from monsters and found a giant like me standing in the ruins, what would YOU think?",
    "Fortunately the forces of evil always use this as a chance to attack us both. Then we can iron out the confusion and fight together. I've become quite good at improvising 'let's combine our forces' speeches.",
    "I worshipped Guthix as a mortal and respected him as a god. When I heard of his death I was unmanned with grief. Then, through contacting my people in dreams, I learned of the Battle of Lumbridge. If there is one evil I would die to oppose, it is the tyranny of those gods that spend their followers like gamblers coins in futile battle! My people are proud, and did not ask nor beg for me to come back. But with Guthix dead...I could not stay away. Our people need a champion; a uniter. I know you have done your best, Player/[Fremennik Name], but I can unite my people in a way you cannot. And, should my presence draw the gods to Rellekka I will use my power to take them far away. It is my wish to just protect them, and not in my nature to run. But sometimes a retreat is the only option.",
    "I suppose we have time for a story. Have I ever told you the one about...",
    "...And so I bid the cursed were-giant goodbye and watched him walk into the sunset.",
    "...And that's how I showed the Pliigi how to stand up to their stone oppressors.",
    "...And then when I got outside neither he nor the two-headed drunkard came to fight me! What cheek!",
    "...At that point someone told me that it wasn't a real murder, but an open-air performance of play. I'll never live that one down.",
    "...At which point I killed the lava-demon. The old wizard seemed rather upset at this and vowed to take the credit. You just can't help some people.",
    "...But in the end some sneaky coward floated under the bridge and stabbed me in the foot with a spear! I had to feign death so I didn't give my powers away.",
    "...But when I arrived a minstrel and his ninja sidekick had caused them to fall in love and fly away. The concert afterwards was worth it thought.",
    "...Despite the steady stream of danger, I left. There are only so many times you can hear the words 'power level' before you go insane.",
    "...He said 'I guess this was a case of...divine intervention', while fiddling with his eyeglasses.",
    "...I ask you, what kind of 'ultimate' monster has a heart OUTSIDE its chest?",
    "...I left immediately. I had no desire to see what the union of a pig and a frog would look like.",
    "...I should have known he was up to no good, with all his 'would you kindly' this and 'would you kindly' that.",
    "...I told him 'I come from the land of the ice and snow...' and he jumped up saying that he'd just had a great idea for a song.",
    "...No, I tell a lie; I really can't remember the 60's after all. It was a crazy, crazy time. You're better off asking Marimbo what happened.",
    "...So I put on my new armour and grew to massive size to fight giant insects alongside the lizard-king.",
    "...So I threw him through the translator's pulpit and held him down until they presented me with the belt of champions!",
    "...That was when he lit his pipe and told me he'd known EXACTLY who I was from the start. He'd not needed my help to find the killer at all!",
    "...The princess was expecting someone else, but the giant turtle was dead so I just took her gift of cake and moved on.",
    "...Then Steed thanked me, tipped his hat and the pair of them rode their horseless cart away. I never did find out what they were avenging, mind you.",
    "...Then the scarf-wearing trickster jumped in his magic outhouse and rode away with my spare helmet!",
    "Would you like to hear another?",
    "Very well. This one time I found myself on a strange world where...",
    "Until we meet again.",
    "Until we meet again.",
    "I have put some of my personal belongings in there and I would appreciate you leaving them alone for now.",
    "Welcome back, Player/[Fremennik Name].",
    "I will drain this energy, Player/[Fremennik Name]. Find the twin for it and channel the energy back to me.",
    "I need to concentrate on recovering my energy. What do you need?",
    "I need you to find another location like this one. Then channel the energy from it into me.",
    "Heroism...it seemed beyond me when I was born. But now it is all I am. I was born stunted and weak, but with hard work, and not a little luck, now my name is known to the greatest heroes of this age. I really cannot think of being anything but a hero at this point. I can't see myself as a husband or settling down for a moment. Is this the price I must pay?",
    "I have seen worlds where the gods have been victorious. Most of them were...adequate, if a little stifled. But so many of the so-called good gods terribly oppress the mortals that worship them. And that's not even counting the evil gods and the worlds they ruin! The desolation of Tuska. The battlefields of Bandos. The fire-wastes of the Queen of Ashes. The corpse oceans of Xau-Tak. Every time I see one of these broken worlds, I remember why it was I agreed with Guthix. Gods and their wars are something to be rejected.",
    "It is sometimes lonely being right all the time. Why can't people just see and accept that I am a hero, and doing the right thing? How many despots have I overthrown only for their oppressed subjects to jeer and riot against me? Can't they see I've made their lives better?",
    "The other gods of this world are fools or villains. I only ever had time for Guthix. Who will approach us first for alliance or conquest? Arrogant Saradomin? Hypocritical Armadyl? Insane Zamorak? Why can they not see that they use their powers to hurt people, when the people should be free of such yokes and responsibilities? Each man and woman carving their own destiny with their own hands, not forced into slavery under a god.",
    "Heroism isn't about lacking fear. Fear is natural. Fear is good! It gets the blood pumping. No, giving in to fear, that's where the harm lies. Whether it's running from a battle or just letting evil triumph. It's a lesson I have taught many people. Sometimes being a hero means doing something that makes you terribly afraid but you know is the right thing.",
    "I fear that I am not. I feel my power slipping away faster and faster.",
    "I know, and I did regain a small amount. But now that my power is this low I can feel...something. Imagine a flooded room with a grate in the floor. Now that my power is this low I can see where the grate is from the vortex it makes. It...seems to be that my power is flowing back to the source. The first infusion of power I ever received.",
    "I think there is one thing. Player/[Fremennik Name]; you will need to help me contact the other heroes, hero-gods and people I have helped to protect over the years. Combined they may be able to create a plan to regain my energy. At the least, they will be able to stop me becoming weaker. It is a desperate plan, and you will need to travel through many planes, but the alternative means...",
    "Dragonkin? Here? And who is that in the cage? Tarshak? Can it really be my murderous shadow?"
  ],
  "Fisherman": [
    "Excuse me, you haven't seen...me have you?",
    "Well, I was just taking a quick stop off on this island when my boat was enveloped in a strange glow. Then I saw a copy of my boat with a copy of me in it falling out of the sky nearby. I don't want to go without finding them.",
    "FISH! Fish! Why am I not fishing?",
    "Fish are in water. I fish. Why am I not in the water...fishing?",
    "What happened?",
    "Oh no! My evil twin? This means I must be some sort of protagonist! The wife will kill me when she finds out. She doesn't like me going out in stormy weather, let alone protecting the world from my sinister double.",
    "You try telling my Lottie that.",
    "I take it you heard about the death of V? Well everyone thinks I’m the one that killed him!",
    "That’s what he wants you to think!",
    "My evil twin. Don’t you see? One second there is an evil double of me, the next V is dead. Now I have to live as an outcast, my people cursing my name until I can prove to them it wasn’t the real me that did this crime.",
    "I did go home! I found my wife and my brother together, and they told me to get out and never come back! Don’t you see? She was seeking comfort in the arms of one not accused of killing our greatest hero. It is already too late for me. There is nothing to it but to seek out someone to train me and start looking for magical swords. If I still had a wife she’d kill me!"
  ],
  "Sakirth": [
    "...your death?",
    "Silence! We are here to kill this False User, not answer questions.",
    "Tarshak? You still live? How is that possible?",
    "I feel it. The plan worked! With the Mirror, we will be able to drain the power of Jas from the False Users! And it appears that it will not prove lethal to do so. How do you feel?",
    "What? Who are you to order me? You are still our prisoner. Just because you survived the process does not change that.",
    "You dare speak to your betters, stone-toucher? I should kill you now!",
    "I do not take orders from you, freak!",
    "But...",
    "Hmph...",
    "This is far from over. But for now...you may remain uncaged.",
    "...are not the one giving orders here, Dactyl!",
    "Why? You have done nothing since we returned but scribble in your journal and issue orders like a tyrant on his throne!",
    "Strisath?",
    "What...what is it?",
    "Freak!",
    "But...",
    "Pah! And now we have this human to deal with.",
    "Urgh...my ribs! Why can't you just die already?",
    "This is not a place for you. When my strength is recovered I will crush you like the insect you are.",
    "Bah! Vile creature. Very well; tarry a while longer so that I can destroy you at my leisure.",
    "This? This is a ruin. I believe it held some sentimental attachment for Tarshak. Such a weak fool; he always returned to the past when he felt threatened. I think he came here once looking for our aid in hunting the V-User. I doubt he found any. And now our guard dragon is dead and human filth like you have arrived we may as well abandon it once more!",
    "Back in the vault. Useless trinket.",
    "The Mirror? Hah! Ignorant beast! No, the Mirror is one of the tools used by the Elder Gods to make the world. We simply used it as it was closest. The Mirror was used to create the broad brush-strokes on which creation could be laid down. When the gods needed a desert, they duplicated sand until it was full. When they needed rocks they duplicated them and placed them where they wanted.",
    "When I slew Lucien and the curse lessened enough to let me think once more, I discovered a link between ourselves and the users. We are chained to the stone. The stone is touched by False Users. This is how we are able to find them...and how we can draw the energy back! But the connection is weak, individually. If the Dactyl had not split away from us we could have used our numbers to claw power back from the usurpers. Without more Dragonkin our only chance was to use something else tied to the stone and the power of the Elder Gods. So we chose the Mirror.",
    "Do not speak of matters not fit for your tiny mind! This conversation bores me. You bore me!",
    "He was a False User. Why would we not kill him?",
    "When we captured that fool, Tarshak, he had been laying an ambush for him. We knew roughly where he would appear and so chose to strike as he arrived. Besides, he was only a minor False User. If we had killed Saradomin then his followers may have banded together against us, and such an irritation is distracting. V was nobody of importance. His followers we can crush without thought.",
    "More insults? When I recover, I will enjoy breaking you!",
    "How should I know? That sort of thing is better discussed with the Dactyl. It matters not. If he has gone skulking to Phalaks he will likely end up on a slab before too long. It is possible the human energy of V tainted him in some way?",
    "Silence! Once we have perfected this process we will simply drain the energy into more Dactyl and kill them before they mutate. The False Users will die. Lucien, Guthix and V have fallen, and more will follow. With each death our curse lessens. Soon, we will bring our strength to bear allied with our cunning and tactical acumen. And once we have crushed the Dactyl into submission, our numbers will be sufficient to shatter this world like we shatter your gods!",
    "Good!",
    "More questions? My power returns with every moment. You are either brave or foolish to remain.",
    "Dactyl filth, grubbing around in blood and rubble. That's all you are good for!",
    "Stupidity? I killed another False User and you call it stupidity? When you can match my tally you can speak to me. Until then keep to your hovel and breed your monsters.",
    "A necessary evil!"
  ],
  "Tarshak": [
    "I live! And this power is...unbelievable! And do you feel it? The curse is diminished! One less False User! The burning itch in my mind recedes by the moment.",
    "I feel glorious. Come, we have much to do.",
    "Miserable, bestial scum! You do not hold me captive any more. I have strength beyond your imagination and the wit to use it. I will return with you, but you will...",
    "Leave him/her, Sakirth.",
    "You dare call me a freak? I said leave that insect alone!",
    "I said leave him/her! They are a petty distraction. We have the tools to drain the False Users in our hands and you waste your time stepping on ants? You fool!",
    "Come; we have much to discuss. Do not make me force your hand again.",
    "Pretty words, nothing more. The gods cannot stop us; what are you going to do?",
    "Tarshak! My name is Tarshak! You will address me with respect!",
    "Are you so curse-addled that you cannot feel the power in me? You owe me your allegiance!",
    "You think you can cage me? You owe me your lives. You owe me awe!",
    "What?",
    "Impossible...how are you still standing?",
    "Fool! There is nobody like me. Nobody!",
    "What? Are you afraid now? Come; where is your Necrosyte bravery?",
    "What are you talking about?",
    "This...this is nothing!",
    "Vermin! Cowards all of you! Phalaks, one of the Dactyl's finest minds, will repair my body. We will deal with this...inconvenience. And when I return you will bow before me or suffer!",
    "I am not a lab animal to be studied! You owe me better than this, Phalaks!",
    "You disgust me! Where is your loyalty?",
    "You have no idea of the power you are dealing with!",
    "Who's there?",
    "You! I can hear your filthy ape heartbeat. YOU did this to me!",
    "Oh, so NOW you are interested? This stone-touching animal arrives to sully our conversation and the great Phalaks' curiosity is roused! Aaaargh! My head! You all disgust me so much!",
    "Raaaaargh!",
    "That hurt! You hurt me, you verminous coward!",
    "You are all like the buzzing of flies to me. Aaargh...stab me in the back. Traitors. Scum! I will kill you all!"
  ],
  "Strisath": [
    "Enough of this, both of you!",
    "Who do you think you are? I am the leader here! Sakirth; ever since you killed the False User you have been just as power-mad as this...abomination! Kalibath. Unless your loyalty too has been swayed, cage the Dactyl. I will deal with you in the traditional way, Sakirth.",
    "We owe you what you have given so many of our kind; vivisection. Nothing more! Get it!",
    "Is it the curse? Is it a disease?",
    "Monster!",
    "No. Let him crawl to some dark hole and die. Sakirth, this is over. Send the Mirror back to the Vault.",
    "Do it! We are all too wounded to continue this plan. We will rest and then recall it.",
    "Your loyalty is touching. I will see if I can contact more of our order. Whatever else happens they must know how we dealt with that False User.",
    "The point remains, Dactyl, that we now have the power to destroy the False Users. A power that would be enhanced if your scholars fall in line. So are you going to stop this bickering and join us, or do we have to crush you?",
    "Those of you that resist and survive shall. The rest can have slightly more exalted positions.",
    "Who asked you, stone-toucher? Why are you even alive right now?",
    "I don't have to listen to either of you! You'll do as I say!",
    "Who asked you...wait, you agree with me?",
    "I don't have to listen to either of you! You'll do as I say!",
    "Why is this human still here?",
    "I don't have to listen to you! You'll do as I say!"
  ],
  "Kalibath": [
    "Yes, with pleasure.",
    "What? You think I didn't know about your stash of protective charms? I took this from your chest while you were distracted! You Dactyl are all the same; too busy scribbling your worthless notes!",
    "Look at yourself, freak!",
    "Abomination!",
    "Should we chase him?",
    "I am going to retire to my chambers to think. You can lick your wounds here. Don't disturb me or seek to take my charm. Neither of you can face me right now.",
    "Are you feeling a little more talkative now, mammal?",
    "Your god; Saradomin. Where is his weakness?",
    "Do you think me a fool? You know.",
    "You were present when it was discovered.",
    "No more denials? Good.",
    "We will test this today.",
    "He doesn't even know your name. Now talk.",
    "How tiresome.",
    "I have plenty of time to wait."
  ],
  "Sairth": [
    "Is this...is this some sort of joke? I owe you nothing, human, let alone answers!"
  ],
  "White Knight": [
    "I don't even know what you want!",
    "How should I know?",
    "I don't know! Why should I know?",
    "...",
    "My faith is strong.",
    "Saradomin will protect me.",
    "...",
    "..."
  ],
  "Phalaks": [
    "I really don't. You crashed in here looking like that, telling me wild tales of draining energy from a god, and now you want me to help you? I think you will be of more use to me in a cage. Maybe, if you are lucky, we'll find a way to cure you.",
    "Loyalty? To what? A freak like you? Should I next show loyalty to the reptiles and humans I experiment upon? Besides, handing you over to Kerapac may soothe the ill feeling between us. If anyone can find out what you are now, it'll be him.",
    "What are you talking about? I hear nothing.",
    "So that story was true. Interesting. I wonder...",
    "What is this power?",
    "This has gone far enough!",
    "You...that should have killed him! You, human!",
    "This will be your best chance. That was a bane dart laden with poison. If you cannot finish him now then I doubt you ever will!",
    "It appears Tarshak has left us alone for now. I assume he has returned to his 'sanctum'.",
    "It seems we have survived for now.",
    "Did you expect a rousing cheer and my eternal gratitude, stone-toucher? We live and I have not yet attacked you. Is that not thanks enough?",
    "I...don't see why not. Although I should warn you I have very little time to waste on trivia.",
    "Indeed. He arrived here and demanded I follow him back to 'cure' him there. The poor, backward-facing idiot has always fled to comfortable surroundings when threatened. I see he still keeps to this pattern even in his current state.",
    "He once maintained a study beneath the area your type calls 'Brimhaven'. It was near the throwback metal dragons, if I recall correctly. He imported a fantastic amount of banite ore to study the crafting of weapons, believing they could be used to kill the False Users. Are you going to try and kill him? Do not answer; even as I asked I knew that was your goal.",
    "I am Phalaks, creator of the King Black Dragon and his brood. Once I was the student of one of the greatest of the Dactyl's creationists. But now I work alone.",
    "The curse happened, human. A perfectionist whose mind burned every moment with the fire of our curse is not someone you wish to be near for long. I once saw Kerapac spear another of his students in the throat for an issue so minor that I cannot even recall what triggered it. I had no intention of sharing such a fate. Although now the curse has receded another degree, he may be more agreeable.",
    "This is my lab. What is confusing about this concept?",
    "I have noticed your kind does tend to blindly stumble forward towards danger simply because it exists. What is your word for that?",
    "Interesting. We call it utter stupidity.",
    "Not until Tarshak attacked. Until now all I had to worry about was grotworms. Besides, it is quite close to my teacher's greatest creation. Studying it in situ has given me a great deal of interesting information.",
    "Who? Is that the false user that Tarshak drained?",
    "Then no, regrettably.",
    "...a False User and therefore a cause of ceaseless, soul-burning agony for me and my kind.",
    "What do you know of our curse? What do you know of being cursed? Imagine that every moment of every day you existed in torment, and this could only be relieved by killing a specific person. And, to make things worse, this person was so powerful that the only way you could kill them would involve enduring more torment to get to their level. How many centuries, centuries I ask you, would you last before you too treated the death of a subjectively 'nice' False User as a cause for celebration?",
    "Ah, an interesting topic! While I would need study him more, I think I have an idea. It is just idle musing at this point.",
    "One possibility is very simple; this is part of the curse designed to safeguard against the abuse of our connection to the Stone. It is entirely possible that Jas knew that our connection could be used to make ourselves powerful by draining False Users and thus the curse reacts by turning us into monsters incapable of using the stolen power. But that is a rather boring theory compared to another that I considered when Tarshak mutated further.",
    "The stone, at the most basic level, is a repository of power and knowledge. By abusing our connection to the stone, Tarshak is opened to all of this knowledge and power, and is drawing on it whenever he needs. But mortals, even gods can't just contain all that power without consequence. So imagine this; when he needs to get more powerful in a fight he grows more muscle, thicker bones, spines and barbs. These biological structures, in turn, need blood and air, nerves and veins, so these too grow. And once grown they can't simply vanish! His mind too, will be ravaged by knowledge. If he thinks he needs something, he will instantly know it. But how does he 'know' it? Does a part of his personality simply get written over, or does his brain swell, requiring more mutation? Madness, babbling madness, is both the result and final escape from such torment. All in all, I will need to find some more of my kin and one of the tools. This promises to be a very valuable line of research!",
    "Goodbye. Please go about your business.",
    "Are you still curious? Ask your questions quickly, for I must contact my old master.",
    "Technically Sakirth and Tarshak are behind all of this, although from the look of things, the latter is more 'under' than 'behind' at this point."
  ],
  "Abomination": [
    "Rooooooar!"
  ],
  "Kerapac": [
    "I should have known you would be behind this.",
    "I should have known some human was behind this.",
    "Indeed. Gather some samples.",
    "You can leave now, Player. Phalaks has told me what happened.",
    "Yes, you can. You should know by now that testing yourself against us at this stage is futile. This is however very interesting; the idea of the link between us and the False Users seems to echo what you told me about delving into Strisath's mind.",
    "Tarshak was an idiot. We sent him to try and investigate the newest False User ages ago and he spent his time on pointless plays for power and authority. Now his stupidity has caught up with him. Although it took several tonnes of banite ore and that quaint little charm to finish him. In any case you are of no more use here, Player, so go.",
    "Ah. I see. Try not to die.",
    "Sakirth, I believe that we have you to thank for this stupidity.",
    "And what do you call what Tarshak became?",
    "And what would we do exactly? Act as vessels for the power of the stone-touchers and become abominations?",
    "They defeated the monster that Tarshak became. You might want to treat them with greater care.",
    "Hah, fool! Can't you see that this kills two foes with one breath? We drain the gods, they kill the monsters we have become. An interesting gambit, but one I do not support.",
    "They defeated the monster that Tarshak became. You might want to treat them with greater care.",
    "Never!"
  ],
  "Kharshai": [
    "Yes, I have heard of his passing. A shame, perhaps, but such is the danger of godhood. Take solace in the knowledge that he has inspired countless heroes across numerous worlds. Those heroes have, in turn, saved lives that would have been otherwise lost and defeated evils that would have threatened entire civilisations. Mourn his passing, as is proper, but know that the universe is a better place because of him.",
    "I am not the metallurgist that you need for an in depth analysis. Suffice to say the potential of this bane ore is staggering. It can be attuned to hate a particular creature type.",
    "No my friend, I mean the metal hates that creature. It wants to hurt it, wants to make it suffer. Increased damage is just a side effect.",
    "Forgive me, but I’m afraid I doubtless know far less than you. They are powerful, dangerous and they are not concerned with the plight of anyone but themselves. Be careful trusting any of them my friend, for they doubtless can never trust you.",
    "No more than you already know. The gods are powerful, yes, but they are not inherently better than any of us. A single rock can dam a river, but so can many pebbles. Together we are as powerful, if not stronger, than any god. Remember this.",
    "Farewell."
  ],
  "Askeladden": [
    "Yeah, sad that. I heard he's dead. Sounded like a good guy. One day I'll be a hero just like him!"
  ],
  "[Peter/Thora the Barkeep": [
    "] He died saving you, [Fremennik Name]. Make sure you use his final gift wisely and live a life that we can all be proud of.",
    "] He was a great hero to our people. Why couldn't they have gone for one of the bad gods, like Zamorak or Saradomin?",
    "] It's sad that he's gone, but he will live on as an inspiration to countless heroes across countless worlds.",
    "] Those cowards. They didn't even have the decency to face him as a warrior.",
    "] We'll keep his stories alive, at least his legend will live forever."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Hero%27s_Welcome?oldid=35765710’"
  ]
}