{
  "Achietties": [
    "Greetings. Welcome to the Heroes' Guild. Only the greatest heroes of this land may gain entrance to this guild.",
    "Well, you have a lot of quest points, and you have done all of the required quests, so you may now begin the tasks to meet the entry requirements for membership in the Heroes' Guild. The three items required for entrance are: An Entranan Firebird[sic] feather, a Master Thieves'[sic] armband, and a cooked Lava Eel.",
    "I'm sure you have relevant contacts in the criminal underworld to find ask about that.",
    "Not really... other than Entranan firebirds tend to live on Entrana.",
    "Maybe go and find someone who knows a lot about fishing? The fishing shop in Port Sarim could be a good place to start.",
    "Good luck with that.",
    "Yes. Yes it is.",
    "Greetings. Welcome to the Heroes' Guild. How goes thy quest adventurer?",
    "Remember, the items you need to enter are: An Entranan Firebirds'[sic] feather, A Master Thieves[sic] armband, and a cooked Lava Eel.",
    "Greetings. Welcome to the Heroes' Guild. How goes thy quest adventurer?",
    "I see that you have. Well done. Now, to complete the quest, and gain entry to the Heroes' Guild in your final task all that you have to do is...",
    "I'm sorry, I was just having a little fun with you. Just a little Heroes' Guild humour there. What I really meant was... congratulations! You have completed the Heroes' Guild entry requirements! You will find the door now open for you! Enter, Hero! And take this reward!"
  ],
  "Player": [
    "I'm a hero, may I apply to join?",
    "Good for the foremost heroes of the land.",
    "It's tough. I've not done it yet.",
    "Hello, I am in search of an Entranan firebird. Can you help me?",
    "Thanks!",
    "Hello, I am in search of an Entranan Firebird. Can you help me?",
    "So where would I find this 'Queen of the Ice' then?",
    "Thanks!",
    "I want to find out how to catch a lava eel.",
    "So where can I fish lava eels?",
    "You know, I'd really rather not.",
    "So... do you know anywhere good to explore?",
    "Yes please!",
    "No, it's too dangerous for me too.",
    "Do I get a reward? For freeing you and all...",
    "Hey.",
    "Is there any way I can get the rank of master thief?",
    "Anything you can suggest?",
    "Hello.",
    "So can you help me get Scarface Pete's candlesticks?",
    "Fine, thanks.",
    "I have lost Hartigen's ID papers.",
    "Hi. I'm Hartigen. I've come to work here.",
    "Hi, I'm Hartigen. I've come to work here.",
    "Uh... Yeah. About that...I must have left them in my other suit of armour.",
    "Hi there. I am Hartigen, reporting for duty as your new deputy sir!",
    "Right here sir!",
    "Anything I can do now?",
    "Oh, dear. I don't have that with me any more.",
    "He won't notice me having a quick look.",
    "Ok, I'll leave it.",
    "I have a candlestick now!",
    "I have a candlestick now!",
    "I have lost my master thief's armband...",
    "How would I go about getting a Master Thief armband?",
    "Do you sell Gherkins?",
    "I'm looking for a gherkin...",
    "Sun, sand and the fresh sea air!",
    "I also want to steal Scareface Pete's candlesticks.",
    "I want to steal Scarface Pete's candlesticks.",
    "I'm a fellow member of the Phoenix gang.",
    "Sun, sand and the fresh sea air!",
    "I also want to steal Scareface Pete's candlesticks.",
    "Mind if I check it out for myself?",
    "I want to steal Scarface Pete's candlesticks.",
    "Just exploring...",
    "Can I go in there?",
    "Are you open to a bribe?",
    "I have retrieved a candlestick!",
    "So is this enough to get me a Master Thief armband?",
    "I have all the required items.",
    "W-what? What do you mean? There's MORE?"
  ],
  "Monk": [
    "Greetings traveller.",
    "Oh ho! Another one! I don't think they exist, but you'd probably ask the head monk about it. If anyone would know, he would!",
    "Anything else you wanted to know?"
  ],
  "High Priest": [
    "Many greetings. Welcome to our fair island.",
    "Well adventurer, I have heard that they exist on this island, but have not ever seen one myself.",
    "According to legend however, they are so hot that their merest touch can burn flesh.",
    "Apparently long ago a great hero named Camorra used a pair of magical gloves, stolen from the Queen of the Ice, to cool the bird down enough to catch as a pet.",
    "I know not adventurer, it was just a myth I was told as a young boy. Perhaps try White Wolf Mountain on the mainland north of Entrana. It's very cold there."
  ],
  "Gerrant": [
    "Welcome! You can buy fishing equipment at my store. We'll also buy anything you catch off you.",
    "Lava eels eh? That's a tricky one that is, you'll need a lava-proof fishing line. The method for making this would be to take an ordinary fishing rod, and then cover it with the fire-proof blamish oil. You know... thinking about it... I may have a jar of blamish slime around here somewhere. Now where did I put it?",
    "You know... thinking about it... I may have a jar of blamish slime around here somewhere. Now where did I put it?",
    "Aha! Here it is! Take this slime, mix it with some Harralander and water and you'll have the blamish oil you need to treat your fishing rod.",
    "Of course, you knew that already.",
    "Taverley dungeon or the lava maze in the Wilderness."
  ],
  "Velrak the explorer": [
    "Thank you for rescuing me! It isn't very comfy in this cell!",
    "Well, this dungeon was quite to explore ...until I got captured, anyway. I was given a key to an inner part of this dungeon by a mysterious cloaked stranger! It's rather tough for me to get that far into the dungeon however... I just keep getting captured! Would you like to give it a go?",
    "Well... not really... The Black Knights took all of my stuff before throwing me in here to rot!"
  ],
  "Katrine": [
    "Hey.",
    "Master thief? Ain't we the ambitious one! Well, you're gonna have to do something pretty amazing to earn that rank.",
    "Well, some of the MOST coveted prizes in thiefdom right now are in the pirate town of Brimhaven on Karamja. The pirate leader Scarface Pete keeps an extremely valuable candlestick in his Brimhaven mansion. His security is VERY good. We, of course, have gang members in a town like Brimhaven who may be able to help you. Visit our hideout in south-east Brimhaven. To get in you will need to tell them the secret password 'Four leaved clover'.",
    "Good for you. I'll give a master thief's armband to the one who retrieved that. I know it wasn't you.",
    "Wow... is... it REALLY it? This really is a FINE bit of thievery. Us thieves have been trying to get hold of this one for a while! You wanted to be ranked as a master thief didn't you? Well, I guess this just about ranks as good enough!",
    "Lucky I 'ave a spare ain't it? Don't lose it again."
  ],
  "Grubor": [
    "Yes? What do you want?",
    "Eh? What are you on about? Go away!",
    "Oh, you're one of the gang are you? Ok, hold up a second, I'll just let you in through here.",
    "Eh? What are you on about? Go away!",
    "Eh? What are you on about? Go away!",
    "Hi. I'm a little busy right now. Maybe you should speak to Trobert. He runs things around here."
  ],
  "Trobert": [
    "Welcome to our Brimhaven headquarters. I'm Trobert and I'm in charge here.",
    "Well, we have made some progress there. We know that one of the only keys to Pete's treasure room is carried by Grip, the head guard, so we thought it might be good to get close to him somehow. Grip was taking on a new deputy called Hartigen, an Asgarnian Black Knight who was deserting the Black Knight Fortress and seeking new employment here on Brimhaven. We managed to waylay him on the journey here, and steal his ID papers. Now all we need is to find somebody willing to impersonate him and take the deputy role to get that key for us.",
    "Good good. Well, here's the ID papers, take them and introduce yourself to the guards at Scarface Pete's mansion, we'll have that treasure in no time.",
    "Someone will show up eventually.",
    "Likewise.",
    "How's it going?",
    "Well, that was careless of you, wasn't it? Fortunately for you, he had a spare. Take this one, but please try to be more careful with this one."
  ],
  "Garv": [
    "Hello. What do you want?",
    "Hartigen the Black Knight? I don't think so. He doesn't dress like that.",
    "Oi! Where do you think you're going pal?",
    "I assume you have your I.D. papers then?",
    "You'd better come in then, Grip will want to talk to you.",
    "Hello. What do you want?",
    "Go ahead I trust you.",
    "No. In there is private.",
    "On these wages, absolutely It'll cost you 1,000 coin for me to urn a blind eye."
  ],
  "Grip": [
    "Ah good, at last. You took your time getting here! Now let me see... I'll get your hours and duty roster sorted out in a while. Oh, and do you have your I.D. papers with you? Internal security is almost as important as external security for a guard.",
    "Well, I might sometimes post you outside it. I prefer to be the only one allowed inside. There's some pretty valuable artefacts in there! Those keys stay ONLY with the head guard and Scarface Pete.",
    "You'll have various guard related duties on various shifts. I'll assign specific duties as they are required as and when they become necessary. Just so you know, if anything happens to me you'll need to take over as head guard here. You'll find important keys to the treasure room and Pete's quarters inside my jacket. Although I doubt anything bad's going to happen to me anytime soon!",
    "Hmm. Well, you could find out what this key opens for me. Apparently it's for something in this building, but for the life of me I can't find out what.",
    "Can't think of anything right now.",
    "Yeah, I'll give you time to settle in. Better get a good night's sleep; I expect you to report for duty at oh five hundred hours tomorrow, on the dot.",
    "Well, that's no good! Go get them immediately, then report back for duty.",
    "Stay out of my drinks cabinet!"
  ],
  "Pirate Guard": [
    "I don't think Mr. Grip will like you opening that. That's his private drinks cabinet."
  ],
  "Straven": [
    "Ooh... tricky stuff. Took me YEARS to get that rank. Well, what some of the more aspiring thieves in our gang are working on right now is to steal some very valuable candlesticks from Scarface Pete – the pirate leader on Karamja. His security is excellent, and the target very valuable, so that might be enough to get you the rank. Go talk to our man Alfonse, the waiter at the Shrimp and Parrot. Use the secret key word 'gherkin' to show you're one of us.",
    "Hmmm. Not bad, not bad. Let's see it, make sure it's genuine.",
    "Hmm... I dunno... Aww, go on then. I suppose I'm in a generous mood today."
  ],
  "Alfonse the waiter": [
    "Welcome to the Shrimp and Parrot. Would you like to order, sir?",
    "Hmmmm Gherkins eh? Ask Charlie the cook, round the back. He may have some 'gherkins' for you!"
  ],
  "Charlie the cook": [
    "Hey! What are you doing back here?",
    "Aaaaaah... a fellow Phoenix! So, tell me compadre... what brings you to sunny Brimhaven?",
    "Well, can't say I blame you, compadre. I used to be a city boy myself, but have to admit it's a lost nicer living here nowadays. Brimhaven's certainly good for it.",
    "Ah yes, of course. The candlesticks. Well, I have to be honest with you compadre, we haven't made much progress in that task ourselves so far. We can however offer a little assistance. The setting up of this restaurant was the start of things; we have a secret door out the back of here that leads through the back of Mr. Olbors' garden. Now, at the other side of Mr. Olbors' garden, is an old side entrance to Scarface Pete's mansion. It seems to have been blocked off from the rest of the mansion some years ago and we can't seem to find a way though. We're positive this is the key to entering the house undetected however, and I promise to let you know if we find anything there.",
    "Ah yes, of course. The candlesticks. Well, I have to be honest with you compadre, we haven't made much progress in that task ourselves so far. We can however offer a little assistance. The setting up of this restaurant was the start of things; we have a secret door out the back of here that leads through the back of Mr. Olbors' garden. Now, at the other side of Mr. Olbors' garden, is an old side entrance to Scarface Pete's mansion. It seems to have been blocked off from the rest of the mansion some years ago and we can't seem to find a way though. We're positive this is the key to entering the house undetected however, and I promise to let you know if we find anything there.",
    "Ah, a fellow Phoenix! So tell me, compadre... What brings you to sunny Brimhaven?",
    "Well, can't say I blame you, compadre. I used to be a city boy myself, but have to admit it's a lost nicer living here nowadays. Brimhaven's certainly good for it.",
    "Ah yes, of course. The candlesticks. Well, I have to be honest with you compadre, we haven't made much progress in that task ourselves so far. We can however offer a little assistance. The setting up of this restaurant was the start of things; we have a secret door out the back of here that leads through the back of Mr. Olbors' garden. Now, at the other side of Mr. Olbors' garden, is an old side entrance to Scarface Pete's mansion. It seems to have been blocked off from the rest of the mansion some years ago and we can't seem to find a way though. We're positive this is the key to entering the house undetected however, and I promise to let you know if we find anything there.",
    "Not at all! The more minds we have working on the problem the quicker we get that loot!",
    "Ah yes, of course. The candlesticks. Well, I have to be honest with you compadre, we haven't made much progress in that task ourselves so far. We can however offer a little assistance. The setting up of this restaurant was the start of things; we have a secret door out the back of here that leads through the back of Mr. Olbors' garden. Now, at the other side of Mr. Olbors' garden, is an old side entrance to Scarface Pete's mansion. It seems to have been blocked off from the rest of the mansion some years ago and we can't seem to find a way though. We're positive this is the key to entering the house undetected however, and I promise to let you know if we find anything there.",
    "Well, get out! This kitchen isn't for exploring. It's a private establishment! It's out of bounds to customers!"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Heroes%27_Quest?oldid=35839875’"
  ]
}