{
  "Player": [
    "Hello.",
    "What are you doing down here?",
    "What are you thinking about?",
    "What exactly is so fascinating about them?",
    "Well, why don't you TALK to the wizards? I'm sure they'd be willing to help you.",
    "Okay, okay. I'll go talk to the other wizards for you. Any in particular I should speak to?",
    "Hello?",
    "Hell-o-oooo.",
    "HELLO!",
    "Hi! I'd like to talk to you about rune guardians.",
    "Pizazz what?",
    "Actually, I just wanted to know how you made the current ones.",
    "Really?",
    "I know of it, actually. I've been there myself and met a golem there.",
    "Don't you mean flighty?",
    "Actually, I, er, really must go. Pressing business, you know how these things are.",
    "Hi, I was wondering if...",
    "I just wanted...",
    "If you'd just listen...",
    "LISTEN! All I want is to know how you helped to resurrect the rune guardians. Tell me, and I'll leave and never talk to you again...quite happily.",
    "What did you do, exactly?",
    "Is that so? I bet I could do any runecrafting you can and do it better. I bet you didn't even do anything difficult to resurrect the guardians. You probably just did some fetch and carry quests for the real wizards.",
    "I could craft them in my sleep! I could craft so many it would make your head spin!",
    "...",
    "You only had to craft five of each of those runes? That's it?",
    "Oh, nothing. That's very, er, impressive.",
    "Yes, I did. I have them right here.",
    "You're a pathetic, angry, whiny man.",
    "A first-class runecrafter? It must have been a truly difficult task.",
    "All those runes? Wow, that is impressive. But what on earth were they for? They must have been vital to the project.",
    "That does sound pretty tough. I'm not sure I could do it. I mean, combination runes are complex!",
    "I've crafted some! I have them right here.",
    "Hello?",
    "I was wondering if you could tell me about resurrecting the rune guardians. I was under the impression you helped with that.",
    "What exactly would I have to do?",
    "What's so dangerous about the room?",
    "I guess I'll give it a try.",
    "No, no, no. No way am I going into an experimental room.",
    "What about me? I just risked my sanity testing your project! You promised to tell me about rune guardians.",
    "Oh, I know all about golems and Uzer. I found this city in the desert...",
    "How did they modify them?",
    "I seem to have lost the special carving tool you gave me. You wouldn't have another, would you?",
    "After several hours of listening to Wizard Shug, I found out what he did to resurrect the rune guardians. Wizard Shug said you'll need twenty pieces of rune essence and two enchanted emeralds.",
    "Fine, I'll get them. You really do need to learn more about being a wizard, Clerval.",
    "Can't you do anything? I've already agreed to talk to all these wizards for you. You could at least get the supplies together.",
    "Fine! I'll get the supplies",
    "There are the enchanted emeralds for you.",
    "I spoke to Wizard Dougal and showed him the combination runes. I can give them to you now.",
    "Here are all the runes.",
    "I met Wizard Edvin. He's experimenting with a new challenge room for the Training Arena. It seems a bit dangerous: I'd steer clear of him if you can.",
    "What experiment were you a guinea pig for?",
    "Wizard Edvin gave me a tool for carving rune essence into rune guardian body parts.",
    "I think that's everything they said we needed. Now you can build a rune guardian and get back to your training.",
    "Enough with the waterworks already! Of course you're a terrible wizard! You don't practice. That's why they built this place, so you could practice magic safely and become a GOOD wizard. But you're off in la-la land thinking about pet rocks. I'm going to help you with these wires, we're going to make a rune guardian, and then you're going to go practice spells and you're going to be the best damn wizard in this place. Right?",
    "Good. Now, let's do this this.",
    "Fixing wires doesn't have anything to do with being a wizard! Look at what you're undertaking. No one has built a rune guardian from scratch for generations. This is cutting edge stuff. If no one experimented with things like this, magic would stagnate. You just need to build some confidence, and completing this project will do that. Then you'll be able to take on those training rooms and become a great wizard.",
    "Good. Now, let's do this thing.",
    "I did it! Now we can try out the machine and bring that rune guardian to life!",
    "What? What now? Everything is ready!",
    "You are seriously useless, Clerval. But we've come this far, so I'll do ALL the work and carve the guardian too. Hand it over.",
    "I guess I shouldn't be surprised. Don't worry, I'll help out and carve the guardian.",
    "Okay, here are all the pieces of the guardian.",
    "Yes, I'd love to have a rune guardian pet!"
  ],
  "Apprentice Clerval": [
    "Hello?",
    "Well, I'm supposed to be training my magic, but I got a bit...distracted. I came down here to think.",
    "Rune guardians! Aren't they just fascinating? I was speaking to one earlier and now I just can't stop thinking about them.",
    "Can't you see it? They're walking, talking ROCKS! My brother once convinced me that my pet rock could move, but after sitting there for a couple of days I finally realised he was lying. But these rocks really do move! I've been pondering how I could make my own rune guardian, then I would always have a friend with me. I just don't know how to go about doing it. I know the other wizards here managed to resurrect them when they rebuilt the Mage Training Arena, but I need to make a new one from scratch.",
    "NO! They'd yell at me and tell me to get back to the training rooms. I'm terrible at casting spells under duress. I get nervous and end up casting spell on myself. But YOU could go talk to them! They'd see as an equal, so you could find out what I need to know and come back and tell me. I'll clean up this workshop so we can build the guardian here. Will you do it?",
    "Hurray! All the wizards who helped rebuild the Mage Training Arena are still working here. There's Wizard Shug – he's usually asleep in the library – Wizard Dougal next door, and Wizard Edvin at the other end of the basement. If you speak to all of them I'm sure we can work out how to build a new rune guardian.",
    "Have you spoken to any of the wizards? Have you learned anything about building rune guardians?",
    "Oh dear, I don't know how to get rune essence – the other wizards haven't trusted me with that secret. I also don't have any emeralds. Do you suppose you could get those supplies?",
    "I know, it's just so hard. I'm not good at making runes...or using them... I can help a little! I know rune essence can be cumbersome to carry, so I'll hold on to it for you as you bring it. Noted essence won't do us any good, though, so make sure you bring some actual essence.",
    "I'm sorry, but I really can't get those items! If you don't do it, we'll never finish making the guardian, and I'll never improve my magic, and I'll be cast out of this apprenticeship, and I'll have to sweep floors in shops, and...",
    "I can help a little! I know rune essence can be cumbersome to carry, so I'll hold on to it for you as you bring it. Noted essence won't do us any good, though, so make sure you bring some actual essence.",
    "I see you have some noted essence, but I can't use that.",
    "That's all the rune essence we need.",
    "Great! We're making good progress.",
    "Great, let's see what you've got.",
    "Great! I'll hold on to those for you.",
    "I will! I've been a guinea pig for him once before, so I know to avoid him.",
    "Being a guinea pig WAS the experiment! I had a pellet craving for weeks!",
    "What an amazing tool. I'll take that off you and work on making the body parts.",
    "Well, not quite. I worked really hard to get the workshop ready so that when you brought back the supplies it'd be all ready to go. I tried and tried, but I couldn't get those wires on that table fixed! Without it we won't have enough energy to bring a guardian to life. It doesn't matter how hard I try, I always fail. I should never have tried to become a wizard. I'm so useless! I can't even fix some wires.",
    "*sniff* You're right. Feeling sorry for myself won't help. Once we're done here, I'll practice really hard. I promise.",
    "Maybe you're right. Maybe the other apprentices won't tease me once they see I've built my own rune guardian.",
    "Umm...not quite.",
    "While you were fixing the table, I tried carving the body of the rune guardian...but it just came out all lumpy and wrong. Could you please carve it for me?",
    "I know...I'm sorry. *sniff*",
    "You're so kind, Player. I'm so glad you're helping me and not the other wizards. They're so mean!",
    "Right, let's try out the machine!",
    "That was amazing! Look at him walking around. We did it, Player!",
    "Since you helped so much in the making of the rune guardian, how about you take this one? I know I can make another, now, and I'm really grateful for your help.",
    "Okay, then just pick it up when you're ready to take him."
  ],
  "Wizard Shug": [
    "Zzz zzz zzzzz",
    "Zzz zzz zzzzz",
    "Humph brr ack pfft. I swear it wasn't me! I don't know how the cat got there. Wait a moment...",
    "Wait, what? Let me see now... Why, you're quite a skilled mage, yet you've done hardly any training at the Mage Training Arena. Why should I tell you our trade secrets if you haven't even used the facility we put so much hard work into building? I won't tell you a thing about rune guardians until you have earned at least five Pizazz points. I don't mind which room you get them from, just put some effort in. Catchy term that, Pizazz Points. I'm quite proud of myself for coming up with that name. Catchy names help motivate young whippersnappers such as yourself!",
    "I didn't resurrect Rune Guardians only to explain how the arena works myself! Go speak to the Entrance Guardian. He's the large fellow you passed coming up here.",
    "Ah, rune guardians! A good choice of topic. They have a fascinating history, you know. The technology they're based on is really quite ancient...",
    "Of course, of course. I'm getting to that. You see, it was Wizard Sedridor's idea to rebuild the Mage Training Arena. He's the head wizard at the Wizards' Tower, you know. Good chap – I've had many a fine drinking session with the man. He can see off more Wizard Mind Bombs than anyone...",
    "Oh, yes, he could probably rival a Fremennik when it comes to drinking. It was during one of these session he had the idea to rebuild the Mage Training Arena. One of our apprentices had recently exploded, so Sedridor was determined to make training safer. Well, Sedridor sent a few of us over here to keep an eye on the rebuilding. He wanted us to research methods for defending and administering the Training Arena so it would function like a well-oiled machine. It was my idea to bring back the guardians. You see, when I was young, I had traveled extensively, and in the desert I found an ancient city. You should go there someday: it's very educational...",
    "Well, you are well adventured, aren't you? I happened upon it accidentally. I was actually trying to reach Nardah, but I got lost in a sandstorm. This city pioneered a technique for creating golems. Well, I thought the technique could be applied to the Mage Training Arena's guardians, so we modified the theory and managed to get some of them working again. You see, it all comes down to runes and rune essence. Rune essence is marvellous stuff – soft enough to be shaped into almost anything, yet it can be so easily imbued with magic. Why, I remember when I once travelled to a distant isle where the stuff was available en masse. The women there were quite odd, very floaty.",
    "Do you want me to finish or not? Brumph. So we used a great deal of essence to repair the bodies of the guardians. Edvin was in charge of that: he was my apprentice at the time. I supplied him with twenty pieces of essence and two enchanted emeralds. That was my true contribution, you see, the enchanted emeralds. It was tricky, but I developed a method to enchant emeralds on their own. They're not good for much, but they work well enough in rune guardians. I think my workbench is still in the basement. If you use an emerald on that, you should be able to repeat the method.",
    "I could tell you how I developed the method, too – it's fascinating really. I was sitting in my thinking chair, deep in thought...",
    "Ah, of course. I understand. Goodbye!"
  ],
  "Wizard Dougal": [
    "Not another one. Don't you useless apprentices have anything better to do than bother me? First that bumbling Clerval and now you. Unlike the rest of the layabouts around here, I am actually trying to work!",
    "Of course you 'wanted' something: everyone always 'wants' something from me. Is there no one else around here who could do some grunt work? My time is far more valuable than the useless little jobs everyone keeps giving me.",
    "Wait, are you saying you're not here to give me a task? Then why are you here? Are you keeping tabs on me for Wizard Edvin? I KNEW IT! He's trying to steal my ideas. Well, I've had it up to here with his arrogance! Stop spying on me...and get out!",
    "What 'part' I played? I didn't play a 'part', I did all the hard work! The other wizards just sat around 'thinking'.",
    "It was very difficult! Only a first-class runecrafter, such as myself, could possibly have pulled it off. I doubt you would be capable.",
    "Fetch and carry! I worked the hardest of all of them. I had to travel all over the world to get the mind, body and steam runes we needed. The body runes animated the limbs, the steam runes gave the limbs propulsion to move the body, and the mind runes gave the guardians thoughts and free will. As if you could craft those runes!",
    "Oh, you could, could you? Could you do... five of EACH type? Huh? Huh?",
    "Yeah, I didn't think so! Bit beyond you, isn't it?",
    "Yes. So?",
    "Oh, yeah? Let's see you do it, then we'll see who's the best runecrafter. I'll even make it easy and give you the supplies. But you have to craft them yourself: I'll be able to tell if you didn't!",
    "That's all you'll need to make the combination runes. There should be a book down here that explains how to make combination runes, if you haven't done it before. Just search the bookcases.",
    "So, oh great runecrafter, have you managed to craft all those runes yet?",
    "Humph. Well I suppose they're not that bad...for a novice like yourself.",
    "Just leave me alone! I have real work to do instead of running around after apprentices like you.",
    "It was! I'm not sure anyone else around here could have done it. That's why they sent me, and told me to take my time about it. They wanted to make sure it was done right. It's not everyone who can craft mind, body AND steam runes!",
    "Oh, they were. We needed five of each to act as magical commands for the rune guardians. The body runes animated the limbs, the steam runes gave the limbs propulsion to move the body, and the mind runes gave the guardians thoughts and free will. They wouldn't have been resurrected without my input.",
    "Well, I don't mind helping you. You're polite, unlike the other low lifes here. I'll give you the supplies and then you can show me how you got along once you've done it.",
    "That's all you'll need to make the combination runes. There should be a book down here that explains how to make combination runes, if you haven't done it before. Just search the bookcases.",
    "Make any progress on those runes?",
    "These aren't too bad! A bit more practice and you'll be a first-class runecrafter, just like me."
  ],
  "Wizard Edvin": [
    "I got rid of the lava...so that should make it safer... No one's gotten trapped between teleports since I fixed the abyssal quadrangle algorithm.",
    "It's just not right yet...Maybe I should just scrap the whole thing. Oh, hello?",
    "Hmm, you seem young and healthy. Perhaps you're clever enough to solve the puzzle. Maybe the data will tell me what's wrong with it... I'll tell you what I know about resurrecting rune guardians and give you a tool if you test out my prototype challenge room.",
    "You will be placed into a grid of rooms. You will start at the south edge of the grid and must make your way to the opposite room on the north edge. You can navigate your way to that room using the portals around you. A pattern on the floor before each portal indicates how that portal will move you through the grid. Every room has a small orb floating in a corner: you can use these to escape at any time. I had to install those after my previous test subjects went mad and left in an...unconventional manner. Let's get started, shall we?",
    "It's not dangerous any more. I admit I was too ambitious at first. I had lava and deadly monsters and a few other 'surprises' for the trainees. I've gotten rid of all those now and I'm focusing on making it a purely mental exercise. But something just isn't right. It doesn't have the same 'shazaam' without the lava. So, I need to test it further and decide what changes to make. I may even scrap the whole thing and start again. I can't decide. Let's get started, shall we?",
    "Very well, off you go!",
    "I see bravery is not your stroing point.",
    "Hmm, it's still just not right. I think I've been working on it too long. Maybe it's time for a completely different project. I've been meaning to research the time discrepancies between the cardinal directions and their effects on teleporting...",
    "Oh, yes, you're still here. Very well: rune guardians. As you may or may not be aware, our rune guardians are based on Uzerian golem technology.",
    "Yes, yes, that's all well and good. May I continue?",
    "Our predecessors, who built the Mage Training Arena, borrowed the Uzerian methods and modified them.",
    "Well, Uzerian golems were made out of clay and had very strict instructions written for them. The wizards of old wanted more free-willed entities that had more durability, so they replaced clay with rune essence, and written instructions with magic. The magic allowed the rune guardians a degree of free will and thought. My part in resurrecting the rune guardians was rebuilding the bodies. The bodies were badly damaged from whatever battle destroyed this place. I created a special tool for shaping the body of a guardian. I don't need it any more, so you can have it.",
    "Do I look like I have time to make extra things because you 'lost' them? Fortunately for you, all my tools have a special returning spell cast on them. When you 'lost' it, it came right back here. Take it back, and don't lose it this time."
  ],
  "Clerval": [
    "You need to get the two wires to connect from top to bottom. Just drag the wires into place. If you want to check if it worked, push the green button. If you want to clear all the wires away and try again, push the red button."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Rune_Mechanics?oldid=32992673’"
  ]
}