{
  "Maggie": [
    "Welcome, traveller! What can I do for you, this fine day, cha?",
    "Cha! That would be the cauldron, that would. I'm brewing up a mean batch of good stuff, don'tcha know.",
    "Oh, it'll be the most top-notch, bees-knees, sock-off-knockin' premium batcheroo you ever did see. But, such an extraordinary brew isn't easy to make, don'tchaknow. What it really needs is some sparkle – some pizzazz. Some of the old razzle-dazzle.",
    "Classic, old-school enchantment, that's what I'm talking about, cha! Without a bit of witchly charm, this slop will be about as useful as an axe made out of toadstools. Only thing is, ol' Babe over there has the sniffles, so I'm not sure I'm going to be able to finish it off. I don't want to leave her alone in this condition.",
    "How observant you are, cha! Of course it's on wheels – how would I get around otherwise?",
    "Oh yes, I like to keep moving, don'tchaknow. There's nothing I hate more than being stuck in the same place for too long.",
    "Yes, poor ol' Babe, cha. I hope she gets over her sniffles soon. After all, I could hardly ask her to pull this ol' caravan in the condition she's in, cha!",
    "Thanks, cha.",
    "That I am, cha! However, a brew this goods needs the help of at least three experienced witches, not including the cook.",
    "Why yes, come to think of it, there is something you could do, cha. Really, the only thing left to finish off this old brewerooni is to give it a stir with an enchanted broomstick. Adds a bit of flavour and spark, don'tchaknow. So it happens, I have a broom right here!",
    "Well, the broom hasn't been properly enchanted, that's what. Good stuff like this will only come out when there are several witches involved. Hetty, Betty, and Aggie are the perfect ladies for the job. We've worked together before and, if you can get them to work their magic on this ol' broom of mine, we'll have a cauldron fill o' something quite spectacular when all is said and done. If I game you my broom, could you take it to Hetty in Rimmington, Bettty in Port Sarim, and Aggie in Draynor, and ask each of them to enchant it for me? In return, I'd be more than willing to share the good stuff all around!",
    "Excellent. Here's my broom then, cha. Hurry back once that's enchanted, won't you?",
    "Didn't I tell you? I'm only brewing the best of the best of the most spectacular of brewifications, cha!",
    "Do? Ye blazes, man! There's not time in the day to describe the glory of the good stuff! So are you in or not? Can I count on you to get my broom enchanted so that we can finish this thing off?",
    "Shame, cha. Well, you know where to find me if you change your mind.",
    "Cha, and how! What's that crackle in the air and that smile on your face then?",
    "Aye, you say? Brilliant! Oh, I can't tell you how grateful I am. You're in for a treat, you are – it you'd just do one more little thing for me.",
    "To finish the good stuff off, we just need to give it a good ol' stir with that broomstick there. It'll come out all the better if you do it, since you're the one who had it enchanted. Could you stir the good stuff in that cauldron for me? Pretty please with sweeties on top?",
    "Brill! Just a quick stir or two with the broom should be all it needs.",
    "Cha and nonsense! You're a strange one, you are.",
    "I should think so, cha! With all that added spice, that ought to be one spicy goulash. Would you like to try some?",
    "Well, what witch doesn't love goulash, I ask you? What could be more witchly than a big ol' cauldron full of spicy yumminess?",
    "Cha! Well, you don't think spicing something this good is easy, do you? Look, I'm so grateful for your help. Why don't you help yourself to 10 bowlfuls? Just dip a bowl in the cauldron and help yourself – but hang on to your hat. That stuff's magic, after all. Not to blow my own horn, but one bowl can improve almost any aspect of your life! Here's a bowl you can use. You can also keep my broom, if you'd like. Now that we've used it to infuse the brew with some good ol' spice, it's not much use to me. You can't do much but sweep with it at the moment, but there are other witches out there who would be happy to enchant it for you, if you're interested."
  ],
  "Player": [
    "Oo, something smells rather ... interesting around here.",
    "What's that then?",
    "Razzle-dazzle?",
    "Get around?",
    "Well, what's the problem then?",
    "Of course.",
    "But what does it do?",
    "(talk about Swept Away) Could we talk about brooms?",
    "Maggie has asked me to help her enchant her broom. She needs it to finish a potion that she's brewing. I was wondering if you could help me out.",
    "Woah! Where are we and what are are we doing here?",
    "Ah, right. Which leaves the quest of what we're doing here?",
    "Right.",
    "How could I miss it?",
    "Okay, thanks. I'll give it a try.",
    "Woah, I felt that down to my toes!",
    "Wow that was impressive.",
    "I'd like to go back to Draynor please.",
    "(Talk to Betty about Swept Away.) I was wondering if you could help me out with an enchantment.",
    "Well. Maggie needs her broom enchanted so that she can finish the stuff she's brewing in her cauldron.",
    "Wonderful! Thank you so much.",
    "What's that?",
    "Okay, thanks.",
    "Aura of ... what now?",
    "So, if you're so amazing, why are you still a witch-in-training and not a fully-fledged witch in your own right?",
    "Ah, of course.",
    "Oh, very helpful. I can see it's a basement, but what are these cages doing down here?",
    "Betty sent me here to fetch her wand, but said there might be a small complication?",
    "That sounds simple enough; what's so complicated about opening a little chest?",
    "What do you mean? What menagerie?",
    "So, what you're saying is that we need to put each creature in its proper enclosure in order to open the chest?",
    "What does that have to do with anything?",
    "Okay, thanks.",
    "It looks like everyone is in their correct place now. Perhaps I should see if I can open that chest.",
    "Not quite yet.",
    "I've got your wand for you.",
    "Many thanks.",
    "Hello there. Maggie sent me to ask for your help in enchanting her broom.",
    "Excellent!",
    "A newt?",
    "Okay, will do.",
    "Hello. Are you the delivery, um, ghoul? Hetty told me that you could give me a newt for her potion.",
    "What kind of problem?",
    "Oh dear, that certain sounds like quite a problem.",
    "So what do we need to do to sort out these crates, then?",
    "That sounds easy enough; I'll just have a look in each crate and –",
    "So what do you suggest?",
    "Thanks, Gus.",
    "Yes, it's right here.",
    "Wonderful, thanks.",
    "I have good news for you.",
    "I've visited Betty in Port Sarim, Hetty in Rimmington, and Aggie in Draynor and they've all enchanted the broomstick for us.",
    "What's that, then?",
    "sounds easy enough.",
    "There that should do it.",
    "Is stirred the cauldron for you – that stuff has a kick to it.",
    "Wait, what? Goulash? I thought you were brewing some amazingly magical witchly potion.",
    "But what about all that effort I went to enchant that broom?"
  ],
  "Aggie": [
    "What a stunning broom you have there. You know, talking to someone is often a more effective way to start a conversation than waving a broom in their face.",
    "What can I help you with?",
    "Of course. What can I do for you?",
    "Of course; Maggie's an old friend and we go back quite a way. Now, in order to enchant the broom, we'll need a bit of space and privacy. There's a little clearing us witches sometimes use. Would you like me to teleport you there so that we can get started?",
    "Okay, hold on to your hat!",
    "Okay, just let me know when you're ready to go.",
    "Oh, this is just a little place that some of us witches use on occasion. It's rather convenient for the occasional ritual or spell. Not only is it infused with a bit of magical pizzazz, but it's out of the way enough that we don't get a lot of unnecessary interruptions.",
    "You want that broom of yours enchanted, right?",
    "Well, the best way to enchant that hunk of dead wood is to harness the power latent in the magical symbol here. Do you see that pattern of 16 lines drawn out of sand on the ground?",
    "In order to enchant the broom, you need to sweep away 4 of those 16 lines, such that you leave only 4 small triangles on the ground – and nothing else. If you run into any trouble, let me know and I'll reconfigure the original pattern for you. I can also teleport you back to Draynor when you're ready to leave.",
    "You did it! The enchantment form the sand pattern has infused Maggie's broom. There's nothing more to do here howl come have a chat when you're ready and I'll take you back to Draynor with me.",
    "Yes, there is a lot of power in these types of magical symbols.",
    "Sure thing! Just hold on to your hat and you'll be back in Draynor before you can wiggle your nose."
  ],
  "Betty": [
    "I suppose that depends on what sort of enchantment you're looking for.",
    "Ah, I see! She's brewing again, is she? Well, I'd be happy to help – Maggie always comes up with the most amazing brews.",
    "Now, Maggie always likes things on the spicy sidel so, what I really need for this sort of enchantment is my wand. I keep it down in the cellar in a locked chest. If you could retrieve the wand and bring it to me, I'd be happy to enchant Maggie's broom for you. There's just one little problem.",
    "You see, my chest is locked by highly magical means. I'd explain it to you in detail, but I haven't the time. You'll find my apprentice, Lottie, downstairs – just pop down the trapdoor over there and tell her I sent you. She'll be happy to explain everything.",
    "Excellent! Let me just enchant that broom for you, then. There you go! I'm sure that's just the spice that Maggie's looking for."
  ],
  "Lottie": [
    "So, what do you want then?",
    "My name is Lottie and it should be rather obvious what I'm doing here.",
    "I most certain am not! I'm learning the ways of witchcraft from Betty. If you knew anything at all, you'd be able to tell from my witchly deportment, and aura of mysticism and enchantment that radiates from my every pore.",
    "Mysticism and enchantment. My brilliance permeates the room, I'm sure.",
    "A mere formality, I'm sure. I think it's something to do with the minimum age at which one can apply for one's witching license.",
    "Oh, is my witchly prowess that obvious? How flattering. In actuality, it is I who is the apprentice, but I'm sure it is only a matter of time before I'm a fully licensed witch.",
    "Well, if you'd use your eyes, you could tell it is – I know this is going to be difficult to believe – A basement.",
    "I see you don't know your witchcraft very well. This is Betty's menagerie. Many witches keep some creatures on hand for their spells and incantations. Not to mention the company.",
    "Sorry, it's just that I'm very busy. I've lots of studying to do and all of these creatures to look after. It's not easy to keep track of everything and make casual conversation as well.",
    "I'll say there are complications! Betty has a penchant for intricacy. You're not going to be able to get that wand until you get that chest open.",
    "Well, the chest in which Betty stores her wand is magically sealed. I won't confuse you with the details right now, but here's the deal: The chest is simply not going to open until order has been restored to Betty's menagerie.",
    "Well, if you look around, you'll see that there are six separate chambers, each of which is designed to house a little critter. Each creature has an enclosure that has been made especially for it, but, at the moment, several of them are out of place.",
    "Exactly. Now I should warn you – these are very sensitive creatures and they really don't like each other.",
    "Two things. First, you can't carry more than one creature at a time. Second, you can't carry a creature through the door of a chamber which contains another creature. You'll have to move the creatures one by one. You can use the holding pen in this room to help shift them all into the right position. One more thing I should mention, you shouldn't have to move the bat and the snail at all – they're already exactly where they need to be. Now, if you have any questions or want me to put the creatures back to the arrangement they're in now, just let me know. Here is a magic slate. It always shows an overview of exactly who is where. You can use it for reference, if you like. It's not necessary, but I find it helpful.",
    "Well done! You've got all the creatures in their proper pens. Did you ever get that broom of yours enchanted by Betty?",
    "Well, good luck with all of that."
  ],
  "Hetty": [
    "Ah, brewing up a cauldron of her infamous 'good stuff' is she? Well of course I'll help. I think this calls for one of my specialties: my famous theurgical broom ointment. Now, I can provide you with the ointment; all you'll need to do is apply the ointment to the broom.",
    "But, first, I'll need a newt.",
    "Yes, a newt. Now, if you'll just pop down to my cellar, through that trapdoor out back, I've just had a recent delivery of newts and toads. The delivery ghoul is still here – I can't think what could be taking him so long. In any case, once the crates are unloaded, just bring me a newt from the newt crate and I'll set you up with the ointment.",
    "Have you managed to get that newt yet?",
    "Excellent. I'll just take it and add a little newt slime to the ointment. That should do it. Just rub this ointment on the broom; that should suit Maggie's purposes."
  ],
  "Gus": [
    "Yes, but I'd prefer it if you called me Gus. I make deliveries for Numinous Witchery Supplies Ltd. If it's a newt you're after, you can have one from one of these crates ... but there's a problem.",
    "A newty, toady sort of problem, I'm afraid. You see, the labels on the crates have somehow got mixed up. One of these crates contains just newts. One contains just toads. One contains a mixture of newts and toads. The problem is, I've put the wrong label on ALL three crates! I can't remember which crate contains newts, toads, or both newts and toads.",
    "Indeed! Please don't tell Ms Hetty or I'll be tomorrow's soup. The other problem is that I can't look in the crates myself. You see, I have a terrible fear of newts. You will work out which box contains toads, which 1 contains newts, and which 1 has both? If you could sort out the labels, I'd be happy to give you a newt to take to Ms Hetty. Is it a deal?",
    "Excellent! I'm so relieved.",
    "Well, here's the problem. We need to figure out what is in each crate. All we know is that I've put the wrong label on EACH and EVERY crate. So, not one crate has the correct label on it.",
    "No, no, no! You can't do that! We can't disturb them! Don't you know anything about magical frogs and newts? Also, we cannot waste too much stock: Ms Hetty will find out if we start taking newts and frogs out of crates as we please.",
    "Well, when I was cramming for my crate delivery certification exam, I remember reading about situations like this. A person can figure out exactly what is in all 3 crates by only take out ONE item from ONE crate. The problem is, I can't remember how to figure it out. I'm pretty sure the key is in what I said earlier: that EACH and EVERY crate has a wrong label on it. Here are 3 labels that you can paste on the crates. If you lose your labels or want me to put things back the way they were, just let me know.",
    "No. I'm afraid that these newts and toads are the property of Numinous Magical Supplies Ltd up until the time that they have been properly delivered. So, what do you say? Will you help me in return for a newt that you can take to Ms Hetty?",
    "Hmmph. Well, I wish you the best of luck finding a quality newt somewhere else!",
    "Hurray! I do believe that you've labeled the crates correctly! Ms Hetty will be so pleased. Now, you need a newt right? Feel free to take one from the newts-only crate – the others aren't appropriate for ointments and potions."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Swept_Away?oldid=36166562’"
  ]
}