{
  "Veliaf Hurtz": [
    "Player, you're back. Thank Saradomin!",
    "We need your help. It's Vanstrom, and the Vyrewatch. Every day they become stronger, and we become weaker. What are we to do, Player?",
    "I apologise. It's just...things have become so grave. Our town of Burgh de Rott is at risk of attack at any moment. Our old enemy, Vanstrom Klause, has been given the sole responsibility of destroying the entirety of the Myreque. He has been seen around our borders, even on our very own land. The Vyrewatch have been picking off our citizens, snatching them from the village itself, and our supply lines to Meiyerditch have been cut. I can barely keep the Myreque's morale up, let alone the citizens'.",
    "Well, if you change your mind, do come and speak with me. You have been a great help in recent times.",
    "Ah, old friend; always eager to provide assistance. I cannot thank you enough. There is one thing you could do, but I feel terrible for asking.",
    "A few days ago Cornelius came running up to me. He told me he had woken in the night to see a shadowy figure digging in the soil, just south of his bank. The figure unearthed the entrance to something underground. No one has ventured to see what has been discovered. It is far too dangerous. But...we must explore it. We cannot just let him stay there; he must be up to something.",
    "Player, Cornelius believes that the shadowy figure was Vanstrom. If this is true, right now he may be closer to our town than ever; perhaps even beneath our very feet. You must enter the cave and face him. It is the only way we can defend ourselves.",
    "Brave as ever, Player. I am proud to have you with us. Please, be very careful. Vanstrom is extremely dangerous. I do not want to lose you too.",
    "Okay, Player. Please, come back when you have time.",
    "I'm afraid so. I suppose we were stupid to think we would be unnoticed forever. So far, they have taken five. Just last week, they took poor Marius from his bed, and his wife sleeping beside him. What they left behind... It was unbearable.",
    "Ah, Player, you know as well as I do. We stood up to the vampyres, and of course they must stamp us down. They will return more viciously until we, or they, are destroyed.",
    "We used to run supplies to the Myreque in Meiyerditch, so they could keep themselves and the community going. It wasn't much, but at least it was something. However, our last runners never returned. Word from Safalaan says they never reached there either. We cannot risk sending more now. It would be a waste of the precious few lives we have here.",
    "Okay, Player. Please, come back when you have time.",
    "Please come back when you can spare some time.",
    "I need you to go to the cave south of Burgh de Rott.",
    "Thank you, Player. Remember, this could be very dangerous. Vanstrom may be waiting for you, so be prepared.",
    "Player, are you okay? Did you find anything?",
    "While it is a relief that there was no one down there, I would still like to investigate this soon, Player. Please hurry.",
    "Player, are you okay? Did you find anything?",
    "Okay, Player. Please, come back when you have the time.",
    "Well met, Player, did you take that letter to Safalaan yet?",
    "Please go quickly. Who knows what little time we have? Would you like me to teleport you there?",
    "Player, have you taken that letter to Safalaan yet?",
    "And? Has anything come of it?",
    "Player, any news? Things are quiet here... it is uncharacteristic for Vanstrom.",
    "VAMPYRE! WE HAVE A VAMPYRE IN THE BASE!!!",
    "Oh, Player, you surprised us!",
    "Well met, Player. You look exhausted; is something wrong?",
    "What? How?",
    "But... this means...",
    "No, Player! If anything, we are more in danger than ever! Our operations so far have been successful because we were undetected for the most part. The vampyres did not see us as a real threat. By killing Vanstrom, you have given the vyres something to talk about; something to focus on! They will be thirsty for a fight; for the taste of our blood! And Ranis... this may even anger Drakan from his stupor!",
    "Hm... I suppose that is true. Vanstrom was one of our most threatening enemies, and I cannot deny that we are safer with him gone...for now. And of course, Ranis' death is only one step away from Drakan himself. Yes... I am sorry, Player. Perhaps I over-reacted, but I must worry about what is to come from this, especially with Safalaan missing. Let us just hope that Vanescula is truly our ally; if so, she will be extremely valuable in our ongoing struggle against Drakan. If she is being truthful, we may be closer to destroying Drakan than ever before. Yes, Player, perhaps something good will come of this. Of course, while I am still concerned, you have outdone yourself once again in our service.",
    "What do you mean?",
    "This does not bode well, Player. Our operations so far have been successful because we were undetected for the most part. The vampyres did not see us as a real threat. By killing Vanstrom, you have given the vyres something to talk about; something to focus on! They will be thirsty for a fight; for the taste of our blood! And Ranis... this may even anger Drakan from his stupor!",
    "I see you've lost the tome I gave you, would you like me to give you another?",
    "There you go. Enjoy it!",
    "Go ahead, Player.",
    "I've never heard of that before.",
    "Possibly, but I'm sure it would have been reported in the vast history of Morytania, if that was the case. I cannot imagine a vampyre of Vanstrom's power would be without some history.",
    "Of course, friend.",
    "I had not heard of this, although I cannot deny that we all had our suspicions. He has always been... different. I am ashamed to say that I even suspected him of being vampyric, on occasion.",
    "I cannot say. We know so little about the Icyene, I am unable to speculate on what Safalaan may be capable of. I would guess that he can only have Icyene blood. If he was entirely Icyene I would expect him to have more knowledge of his powers, but I can only offer my own opinion. As for the Myreque, with him missing we must continue and hope that Vanstrom did not have a chance to share his discovery.",
    "I am afraid I do not. He told no one where he was going. We are all very worried for his safety.",
    "It is difficult to say. Essentially, she is a vampyre, so surely she can only know evil. Nonetheless, she did protect you from harm in Darkmeyer, and aid us to kill one of her most powerful companions. It cannot be denied that we need all the allies we can find. What do you think?",
    "In that case, I trust your judgement, friend.",
    "I agree. The vampyres know nothing but evil. We should be wary, Player.",
    "No, not yet. Drakan must be biding his time. It is not like the vampyres to take such a hit lightly. We must keep pushing anyway. We cannot give the vampyres time to recuperate.",
    "Good to see you, Player.",
    "I'm afraid that there is no end to our troubles here in Burgh De Rott. Yet more villagers are taken. More disappear every night.",
    "Rumours abound that Lord Drakan himself is poised to soon make his return. I fear the worst is yet ahead of us."
  ],
  "Player": [
    "What's wrong?",
    "Calm down, Veliaf. What's going on?",
    "Is there anything I can do to help?",
    "What is it?",
    "Who?",
    "Okay, I'll go.",
    "I will be. Wish me luck.",
    "Sorry Veliaf, I have to go.",
    "The Vyrewatch have been in Burgh de Rott?",
    "Why do you think they are taking them?",
    "What happened to the supply lines?",
    "Sorry Veliaf, I have to go.",
    "I'm just passing through for now.",
    "What was I doing again?",
    "Okay, I'll take a look.",
    "Veliaf did ask me to search everywhere.",
    "I'm fine. The cave was empty, but it seems to have been inhabited, at least a long time ago. I found a couple of things, but I seem to have left them somewhere. I'll go and get them.",
    "I'm fine. The cave was empty, but it seems to have been inhabited, at least a long time ago.",
    "I found a medallion.",
    "Why?",
    "Perhaps Vanstrom put it there?",
    "Do you want to take it?",
    "I also found a letter.",
    "What do you suppose he wants?",
    "What do you suggest we do now?",
    "Yes, please send me!",
    "No thanks, I'd like to make my own way there.",
    "I found a letter.",
    "Sorry Veliaf, I have to go.",
    "Not yet.",
    "Yes, please send me!",
    "No thanks, I'd like to make my own way there.",
    "Why wouldn't I be safe?",
    "Good day, Kael.",
    "Good to see you too, Vertida. How are things here?",
    "What do you mean?",
    "I have a letter for you.",
    "I seem to have left it somewhere. I'll go and get it.",
    "Veliaf sent me to search a cave they recently discovered in Burgh de Rott. We believe Vanstrom had been there, and he may have planted it.",
    "What do you think?",
    "Well, no. Cornelius in Burgh de Rott said he saw a 'shadowy figure', whom he thought was Vanstrom.",
    "Yes, I found a medallion. Veliaf said the symbol on it is the symbol of Drakan.",
    "Ok.",
    "What do you think we should do?",
    "But what if he's not after Burgh de Rott? What if he's after you? It could be a trap.",
    "Of course.",
    "Got it.",
    "What visions?",
    "Yes.",
    "No?",
    "Why does the letter say they knew you centuries ago?",
    "What do you mean?",
    "You said you were having visions?",
    "What do you think of this medallion?",
    "It was in a cave in Burgh de Rott. Veliaf said the symbol on it is the symbol of Drakan.",
    "What did you do?",
    "But this is vampyric! How did you know to do that?",
    "What have the vampyres been doing?",
    "How are you holding up?",
    "Oh... Veliaf said you hadn't been feeling very well.",
    "Are you sure?",
    "I have to go.",
    "What did you think of the letter?",
    "I have some questions about that letter.",
    "Yes, I have taken it to him.",
    "I don't know, I suppose I should go back and see what he thinks.",
    "I'm working on it, Veliaf.",
    "Leave me for what? Who is 'her?'",
    "That doesn't bode well.",
    "I should get down there and see if she's ok.",
    "Yes, but-",
    "...",
    "Um... Hello?",
    "How do you know my name?",
    "What are you doing here?",
    "Vanstrom!",
    "Unfortunately. He's the worst vampyre, besides Drakan.",
    "I have to go.",
    "Are you ok?",
    "Are you ok?",
    "Well, as long as you're ok...",
    "What are you doing here?",
    "How can you help?",
    "Yes.",
    "No, of course not! We'd never dream of it, your vampyre-ness!",
    "I'm not telling you anything, vampyre scum!",
    "How do you plan on freeing Meiyerditch? Surely, after killing Drakan, you would take over as leader and things would be just as bad.",
    "Yes, how did you know?",
    "What Haemalchemy labs?",
    "You won't get any information out of me!",
    "...",
    "You mean, all the citizens of Meiyerditch could go free?",
    "Why do you want to kill Drakan?",
    "Did you plant that letter?",
    "So you can tell me-",
    "I'm not interested.",
    "Why aren't you fighting me?",
    "Who are you?",
    "What did you do with Vertida and Mekritus?",
    "I don't converse with vampyres.",
    "Yes, I have some questions.",
    "Why would you want to kill Drakan?",
    "Why should I trust you?",
    "I'll listen, for now.",
    "A tree? Why would I be interested in a tree?",
    "How do I know you are telling the truth?",
    "What's wrong with the Ivandis Flail?",
    "Tell me more about this tree.",
    "I'm not interested in anything you have to offer.",
    "Not yet.",
    "How did you know about Safalaan's dreams?",
    "Not yet; I lost it.",
    "Yes, it was Vanescula. I'm ok, though.",
    "I'll get right on that.",
    "Yes, it was Vanescula. I'm ok, though; she just wanted to talk. She claims she wants to help the Myreque defeat Drakan, and that she can free Meiyerditch using Haemalchemy.",
    "Yes. She claims she wants to help the Myreque defeat Drakan, and that she can free Meiyerditch using Haemalchemy.",
    "She gave me a letter to give to you, but I seem to have lost it.",
    "She gave me this to give to you.",
    "So what do you think about her offer to help with Drakan, and using Haemalchemy to free the people of Meiyerditch?",
    "That's right.",
    "Have you noticed Safalaan acting strangely recently?",
    "Yes.",
    "Have you noticed Safalaan acting strangely recently?",
    "Safalaan said you might be able to help me get to Darkmeyer?",
    "What do I need to go to Darkmeyer?",
    "Is there nothing I can take to help me?",
    "Okay, I'll do my best.",
    "What do you mean?",
    "I have to go.",
    "Can you remind me how to get to Darkmeyer?",
    "That's all, thanks.",
    "What did you tell Safalaan?",
    "So, where's this tree?",
    "I'll be on my way then.",
    "Thank you.",
    "I have some things to do.",
    "What was I doing again?",
    "Do you have any thread I could use?",
    "Thanks.",
    "I should probably check back with Vanescula before I go in there.",
    "What's it like living in the lowest tier?",
    "What's it like living in the lowest tier?",
    "Why's that?",
    "I need some more money.",
    "I have all the clothing.",
    "So can I go and get those logs now?",
    "No, of course not.",
    "Well, you are stupid vampyres.",
    "What did you do to me?",
    "Thanks, I guess. Can I go now?",
    "Is this safe?",
    "Do you know how I can increase my status?",
    "Do you know how I can increase my status?",
    "Do you know how I can increase my status?",
    "Okay. Thanks!",
    "Do you know how I can increase my status?",
    "Do you know how I can increase my status?",
    "Do you know how I can increase my status?",
    "Do you know how I can increase my status?",
    "How often do you see Drakan around here?",
    "No.",
    "I'm new, I'm trying to make my way to the upper tier.",
    "What is there to do here?",
    "Er...",
    "Um... [Vampyre first name]?",
    "[Vampyre last name]?",
    "Yes?",
    "What can I do?",
    "I see...",
    "No.",
    "Not yet.",
    "I've ruined all the posters.",
    "What's wrong?",
    "Perhaps I could help you get them back?",
    "Of course!",
    "That's too bad.",
    "I can't find any bloodvelds. Where are they?",
    "...Nothing?",
    "I don't get out much.",
    "Ok.",
    "Not now.",
    "No, of course not. I'll get right to that...",
    "Yes",
    "No, it was disgusting!",
    "No! I mean, it was disgusting because it wasn't fresh.",
    "I think I can forgive you. I'll see you around.",
    "Oh yes, it was the best blood ever.",
    "I'll remember that.",
    "Satisfactory; I'm used to higher quality blood.",
    "I do not care what your friend said.",
    "Take your apologies elsewhere.",
    "I can explain!",
    "I'm full after drinking so much blood already.",
    "Yes, I just went on a raid of Meiyerditch, picking off the weaklings.",
    "I've had far too much bloody already today.",
    "Yeah, I'll see you around.",
    "I'm worried about my weight.",
    "I will.",
    "I don't like it.",
    "No, I mean, I didn't like it because it wasn't fresh.",
    "I think I can forgive you. I'll see you around.",
    "I have to go.",
    "I'm here because I'm so thirsty.",
    "What a shame. I'm going to be back later for a tithe.",
    "I'm going to have a nice glass of water.",
    "Then I'll be back for a tithe.",
    "Quiet, I want to help you.",
    "What do you do here?",
    "I see. That's thrilling.",
    "Enough, vermin! I have important news about your husband; I'm sure you want to hear it.",
    "He's dead.",
    "I saw it with my own eyes, human.",
    "He's just lost.",
    "Probably just wandering Mort Myre, I'm sure he's fine.",
    "Silence, wretch!",
    "I was just thinking... I'm fed up of seeing the same human in this cell every day.",
    "Perhaps we need to 'dispose' of this one.",
    "Perhaps we should release this one.",
    "Foolish human! Can't you tell? I killed him!",
    "What do you do here?",
    "No, thanks.",
    "Can I go into the Arboretum?",
    "Excuse me?",
    "I don't think I...",
    "Okay. What should I do now, then?",
    "How do I do that?",
    "Maybe later.",
    "I pledge fealty to the Drakan family.",
    "I devote my service, land and power to the Drakan before me.",
    "I devote my serviettes, band and flowers to the Drakan before me.",
    "I plead guilty to the Drakan family.",
    "Do you know how I can increase my status in the upper tier?",
    "Do you know how I can increase my status in the upper tier?",
    "Do you know how I can increase my status in the upper tier?",
    "Do you know how I can increase my status in the upper tier?",
    "Do you know how I can increase my status in the upper tier?",
    "Yes, I remember you.",
    "Oh, I don't think I remember you helping me at all. You'll be staying here.",
    "No, I don't remember you.",
    "Please excuse me, I'm very busy.",
    "What do you know about the blisterwood tree?",
    "I must have slept through that bit.",
    "Are you ok?",
    "No, I'm with the Myreque.",
    "What do you do here?",
    "I see. That's thrilling.",
    "So... are all the prisoners secure?",
    "Have you checked?",
    "No, no, of course not.",
    "Do you watch over the upper tier?",
    "Yeah...",
    "Thanks... Any news in the upper tier?",
    "I think he's a noble vyre.",
    "Why?",
    "He seems okay.",
    "Why?",
    "He should be killed.",
    "Why?",
    "How's it going? Any threats to Darkmeyer?",
    "What do you mean?",
    "Who?",
    "Oh, no. Why?",
    "I think he should be removed from power.",
    "I'll see what I can do.",
    "I don't really care.",
    "You should not question him.",
    "We'll see.",
    "What do you do here?",
    "What kind of intruders?",
    "I agree. They should be locked up.",
    "Why are you wasting your breath on those rodents?",
    "Don't let me catch you doing it again.",
    "Don't you think we should let them live freely in Morytania?",
    "I just meant...",
    "How's it going? Any threats to Darkmeyer?",
    "The 'Myreque'? Never even heard of them. They can't be very effective.",
    "Perhaps you should suggest that to him. I'll see you around.",
    "The Myreque are brave and noble people.",
    "The 'Myreque'? Those wretches couldn't defeat a single ghast!",
    "I think he's doing enough. I'll see you around.",
    "How's it going? Any threats to Darkmeyer?",
    "What do you mean?",
    "I think it's good that they have somewhere to take refuge.",
    "I agree. I can't believe Drakan just leaves them there.",
    "Maybe I'll do just that. See you later.",
    "I agree. I can't stand to think about them living in freedom.",
    "Yes... those rats.",
    "Me?",
    "What do I need to do?",
    "I could tell a joke.",
    "I have a few things to do.",
    "Listen, do you think you could sort of... pretend to fall over?",
    "There's a vyrelord watching. He's asked me to punch you, but do you think you could just pretend?",
    "It was fine. Thank you.",
    "What do you mean?",
    "What's happening here?",
    "Yes, it was my fault.",
    "I punched him and he dropped his sample vial. It's not his fault.",
    "I think he deserves to die.",
    "I think he should be let off.",
    "He obviously cares very much about his job. See how upset he is.",
    "No, I didn't see anything.",
    "The tither was tithed and killed.",
    "Nothing. The tither was let off.",
    "What's going on here?",
    "No, I'm new. My name is [Vampyre first name].",
    "Yes!",
    "Yes.",
    "Ok.",
    "Yes, I refuse to kill the Meiyerditch citizens.",
    "No, I won't do it.",
    "No, wait! There must be something I can do to make you forget about it.",
    "Ok.",
    "Ok, I'll kill them.",
    "Hi.",
    "I believe you owe a guard in the upper tier some money.",
    "Well, he's sent me to get it back for him.",
    "[with Wolfbane in inventory] Oh, I see. You'd rather spend time with this wolfbane dagger instead?",
    "I have your blood!",
    "I don't have the logs or the seeds yet. I'll have to go back.",
    "What do you mean?",
    "I'm no vampyre! It's me, Player. I'm in disguise to infiltrate Darkmeyer.",
    "No! It's me, Player - I'm in disguise so I can infiltrate Darkmeyer.",
    "Hi.",
    "No, it's me! I'm in disguise, so I can slip through Darkmeyer unnoticed.",
    "I don't have the logs or the seeds yet. I'll have to go back.",
    "Hi, Veliaf.",
    "No, no, it's me, Player! I'm in disguise as a vampyre!",
    "Sorry Veliaf, I'll take off my disguise next time.",
    "What should I do now?",
    "I'll be off to the Arboretum, then.",
    "What more can I do here?",
    "What should I do now?",
    "Yes?",
    "Of course not!",
    "I hereby pledge fealty to you, Ranis Drakan.",
    "Ouch! That hurt a lot more than when Vanescula did it!",
    "I meant... It was just a surprise.",
    "Maybe later.",
    "Yes, I think she is.",
    "Can I go into the Arboretum?",
    "Why not?",
    "What happened in here?",
    "Sorry. What did you do to Ranis?",
    "What about Ranis?!",
    "Won't you get into trouble?",
    "But the vampyres will be furious! You've betrayed us!",
    "Won't the other vampyres be infuriated by his death?",
    "I'd better warn the Myreque.",
    "I have to get back there!",
    "Why?",
    "What?",
    "Those scum!",
    "Where's Safalaan? I need to talk to him urgently!",
    "But, I went to Darkmeyer, and Ranis... and Vanstrom! I-",
    "Where's Safalaan? I need to talk to him urgently!",
    "But this is important!",
    "I managed to get some logs from the blisterwood tree.",
    "No, Vanescula told me there aren't any seeds. They don't know how the tree grows.",
    "Yes, she helped me keep my disguise, and she saved me from Ranis.",
    "Ranis worked out who I was.",
    "He trapped me in the Arboretum, and Vanescula killed him.",
    "We may be able to trust her, yes.",
    "I'm not sure.",
    "Vanstrom knows about the base.",
    "I'd be happy to dispatch one of the Myreque's hardest opponents.",
    "You're kidding me.",
    "Vertida, you said you might be able to help in my fight against Vanstrom.",
    "Okay.",
    "Thanks, Vertida.",
    "Do you have any of that holy water?",
    "Do you have any advice about fighting Vanstrom?",
    "Do you have any sickles I could use?",
    "That's all, thanks.",
    "Do you have any advice about fighting Vanstrom?",
    "Interesting... thanks, Kael.",
    "Do you have any advice for fighting Vanstrom?",
    "Thank you.",
    "Quiet. I'm on my way to kill Vanstrom.",
    "Warming to me, are you?",
    "It won't be so pleasant for you, Vanstrom!",
    "I'm not interested in what you have to say.",
    "That's enough, Vanstrom. I will defeat you, for the Myreque!",
    "Icyene?!",
    "Any news?",
    "No!",
    "Really?",
    "Yes.",
    "Bye then.",
    "Do you know where Safalaan is?",
    "What?",
    "This isn't a joke!",
    "Bye, then.",
    "What happened?",
    "Yes; he's dead.",
    "Vanstrom is dead. I've never felt better.",
    "Vanstrom believed that Safalaan may be of Icyene blood.",
    "What do you think?",
    "Have you heard any news from Safalaan?",
    "What did they see?",
    "I have to go.",
    "Okay. Thanks, Vertida.",
    "Hi, Veliaf.",
    "Vanstrom is dead.",
    "With Vanescula's help, I managed to infiltrate Darkmeyer and create weapons that could harm him. It was a great battle, but I won in the end.",
    "The Myreque are safe!",
    "But surely, with them dead, the vampyres are weakened...",
    "There may be trouble coming.",
    "With Vanescula's help, I managed to infiltrate Darkmeyer and create new weapons, to harm more powerful vampyres. I have defeated Vanstrom, and Ranis is also dead; the vyres will no doubt guess it was the Myreque.",
    "Yes please.",
    "No, I want to talk about something else.",
    "Could I ask you something about Vanstrom?",
    "When he died, he seemed to 'explode'. It knocked me down. Is that normal for a vyre?",
    "Perhaps it's because he was so old.",
    "Could I ask you something about Safalaan?",
    "Vanstrom believed that Safalaan is an Icyene.",
    "What does this mean for the Myreque?",
    "Do you know where Safalaan is?",
    "What's your opinion on Vanescula?",
    "I think Vanescula can be trusted.",
    "I don't trust her.",
    "Any news from Meiyerditch?",
    "You too, Veliaf.",
    "Surely, with Ranis and Vanstrom gone, things should be better?",
    "Thanks, Ivan.",
    "Yes, in order to enter the Arboretum and gain the harmful blisterwood logs I had to build up a name for myself in disguise, as a vampyre. I had to do some terrible things.",
    "I suppose so.",
    "He is dead, yes.",
    "Hi, Vertida.",
    "Could I ask you something about Vanstrom?",
    "When he died, he exploded in a burst of energy that knocked me down and nearly took my life. Is that normal for a powerful vampyre?",
    "Could I ask you something about Safalaan?",
    "What do you think about Vanstrom thinking that Safalaan is Icyene?",
    "Why?",
    "Have you heard anything from him since he disappeared?",
    "Are you worried about the Myreque without Safalaan?",
    "Are you worried about the Myreque without Safalaan?",
    "Why?",
    "Could you remind me of the last time he was seen?",
    "What will the Myreque do now?",
    "What about Vanescula?",
    "How are things around here?",
    "We will be prepared!",
    "Yes, thank you.",
    "Hi.",
    "Do you have any plans for what to do next?",
    "Anything I can help with?",
    "Care to tell me how?"
  ],
  "The following text is transcluded from Transcript": [
    "Letter (The Branches of Darkmeyer).",
    "Decaying tome."
  ],
  "Veliaf": [
    "Player, be careful with that!",
    "That symbol... It is the symbol of Drakan. This must be of vampyric origin.",
    "Maybe, but it is so dusty and looks so old. Either it was there for centuries, or Vanstrom went to a lot of effort to make it seem that way. Both are possible, I suppose.",
    "No, Player. I would not have that evil here. Take it away.",
    "This paper is far too clean to have been in a cave for years. It must have been planted by Vanstrom and addressed to Safalaan... He does not refer to himself as Vanstrom; even going so far as to masquerade as a Meiyerditch citizen. Perhaps by noticing him enter the cave we have foiled his plans to remain hidden in this?",
    "I cannot say. This seems far too intricate; far too subtle for him. I expected him to launch a full scale attack, not set us on a treasure trail.",
    "The letter is addressed to Safalaan. This may be Vanstrom's plan, but I think you should take it to him. He should be involved. It may be unsafe to enter Meiyerditch the usual way. Drezel sent a teletab to us a while ago; I was saving it for an emergency, but this is as good a time as any. I can use it to send you straight to Safalaan.",
    "I'll warn you, Player, Safalaan has not been himself lately. He seems preoccupied, but perhaps this will be just what he needs to focus once again. Good luck.",
    "I'll warn you, Player, Safalaan has not been himself lately. He seems preoccupied, but perhaps this will be just what he needs to focus once again. Good luck.",
    "I'll warn you, Player, Safalaan has not been himself lately. He seems preoccupied, but perhaps this will be just what he needs to focus once again. Good luck.",
    "I'll warn you, Player, Safalaan has not been himself lately. He seems preoccupied, but perhaps this will be just what he needs to focus once again. Good luck."
  ],
  "Mekritus A'hara": [
    "Good to see ya safe, Player.",
    "Where 'ave ya been? The Vyrewatch are getting more ferocious by tha day. You'd do well ta go from one side of Meiyerditch to tha other without gettin' attacked!",
    "We'll see ya at the lookout point. Just be careful; something strange is going on and Vanstrom must be behind it.",
    "Good, ya made it. This building overlooks Vanstrom's meeting place. Ya can look out of tha window here to check tha coast is clear. We're going ta flank around ta give ya ground support.",
    "Go ahead. We've got ya back.",
    "We'd better get back ta the lookout point. Vanstrom's up to something, I know it.",
    "Come on! Let's get her!",
    "I think so. I can't tell ya what happened. One minute I was stood there, tha next I was on me back in a building the other side of Meiyerditch! I'm fine, though; just a bit shaken up.",
    "Is it true? Safalaan's sent ya to Darkmeyer?",
    "He's given ya a death sentence is what he's done. Let's just hope he knows what he's doing.",
    "Yes, we've all seen it. He's not himself, Player. Hopefully he'll get better in time.",
    "Good to see ya safe. Just be careful. Who knows what Vanescula is up to?",
    "Get back! I'll defend with my life!",
    "Don't play games with me, vampyre!",
    "Player? Ya look just like one! Good to see ya safe. Just be careful. Who knows what Vanescula is up to?",
    "Did you manage ta watch Vanescula's behaviour in Darkmeyer?",
    "Surely, then, it's as Safalaan says. Vanescula's on our side.",
    "But Vanescula can't have known where the base is either? If she did, surely she would have approached Safalaan here.",
    "I agree with Kael. We cannot keep fleeing. One day we must face him, and there is no reason it should not be today.",
    "You should speak ta Vertida; he said he wanted to give you something.",
    "Can't say I've experienced it. I did hear that vyres go into a vapour form ta regenerate. He does that, I'd be wary; may still be dangerous.",
    "Ah, you're awake. I've been lookin' after ya. Now, Vertida wants a word.",
    "Player, ya looking much better!",
    "I'm still celebrating our victory over Vanstrom. That's only a few steps away from Drakan, ya know!"
  ],
  "Kael Forshaw": [
    "Good? It is not good at all. The vampyres increase their efforts to crush us underfoot. These are hard times, Player. Myreque prevail.",
    "I hear you're going to Darkmeyer?",
    "That is a dangerous place indeed, and I do not feel that Vanescula can be trusted at all. Just keep yourself safe, Player. If I do not see you again, you have made us all very proud.",
    "Of course. He is one of my closest friends, Player. I just hope he snaps out of this. He is not focused on our mission at all.",
    "Remember, Player, Vanescula is a vampyre. She can't be trusted. Watch your back.",
    "VAMPYRE! EVERYONE TAKE ARMS!",
    "Oh, Player, do not do that again.",
    "You should talk to Vertida. He said he wanted to give you some advice before you go.",
    "Of course, Player. These two have served me well.",
    "Hmm... well, once, I was watching from a distance as he was getting angry with a juvinate. The area around him started to become dark. I turned and looked away, but when I looked back the juvinate was dead.",
    "Player, good to see you on your feet again. I believe Vertida wishes to speak with you.",
    "It is quiet. Far too quiet, and I feel something must be coming. The vampyres will not take Vanstrom and Ranis' deaths lightly. They must be planning some kind of counter-attack.",
    "I admire your courage, Player, but I fear it will not aid us in what is to come."
  ],
  "Vertida Sefalatis": [
    "Good to see you again, Player. It has been a while.",
    "Not good, I am afraid. The high-ranking vampyres seem to have lost some control over the Vyrewatch. We are losing citizens more often than usual, and it is becoming increasingly hard to fight back as we run lower on supplies. But we must continue, for the citizens of Morytania.",
    "Glad to be doing a mission with you. We'll meet you at the lookout point.",
    "Player, you're here! Mekritus is upstairs; you can climb up the wall here. I'll keep watch.",
    "Don't worry, Player. We're here if Vanstrom turns up.",
    "We'd better get back to the lookout point, Player. Something strange is going on, and I'll bet Vanstrom is behind it.",
    "It's Vanescula! Quickly Player, attack! We're with you!",
    "What are you waiting for? Vanescula is right here in the open! Attack! We'll be right behind you.",
    "Yes... yes, I'm fine. Just a bit disoriented. She just sent us a few buildings away, but I found myself unable to enter the clearing you were in. It was as if she had some kind of barrier around you.",
    "He did? Oh, I suppose you gave him some information from Vanescula. I do not think we should so readily trust her. I have the greatest respect for Safalaan so I will trust his judgement for now, but between you and me, Player, he hasn't been himself recently.",
    "Darkmeyer is the city of the vampyres. No member of the Myreque has ventured there and returned to tell the tale. I must admit, we have a very limited knowledge of it. Although its high walls may seem impenetrable, it has one weak point. There is a drainage gate along the uppermost wall in eastern Meiyerditch; you may be able to climb under there.",
    "All I can suggest is that you pick up smoke bombs from the crate in one of the back rooms, near the entrance. They may help you to stay hidden. You should also take a hatchet, to be able to cut logs from the tree, and remember to look for seeds which we may be able to use to grow our own.",
    "I am sorry but I must tell you, Player, this is so dangerous I fear that you may come back changed... if at all. Let us hope it gets us closer to retaking Morytania.",
    "He has become very closed off. He doesn't confide in us like he once did. He thinks we haven't noticed him acting differently, but we can all see something is bothering him. This business with Vanescula... He seems so desperate for information, he seems to overlook the potential danger of her. He is putting us, and especially you, in danger with this plan.",
    "Let me know when you are ready to go to Darkmeyer.",
    "Remember, Player; pick up some smoke bombs from the crate in one of the back rooms near the entrance. They'll help you to stay hidden.",
    "Of course. There is a drainage gate along the uppermost wall in eastern Meiyerditch. You may be able to climb under there. To get there, head out of the Myreque base, up the stairs and across into the next building. Leave this building and run through the building directly to the north. Turn right, then run north. Once you're past the fish shop, turn left, and then run north again until you see the drainage gate.",
    "It is good to see you safe, Player. How is it going?",
    "How did you get in here? Vampyre fiend! I'll-",
    "Oh, it is good to see you safe, Player.",
    "We don't know, he disappeared. He left a while before you arrived, saying he had something he needed to do, but he hasn't come back.",
    "Just calm down! This sounds important. I'll get the others.",
    "We don't know; he went out. Said he had business ta attend to.",
    "I see. A'right then, I'll get the others.",
    "This meeting has been called to discuss Player's discoveries in Darkmeyer. Of course, our leader, Safalaan, is absent. We must continue to strive for the Myreque cause until he returns. Player, please tell us what happened in Darkmeyer.",
    "This is excellent news. Did you find the seeds, so we can grow our own tree?",
    "She may be, but if Player didn't find any seeds, I feel we should trust his judgement.",
    "What do you mean?",
    "Either way, Ranis is dead. This is one less obstacle for us, which must be good news.",
    "Either way, Ranis is dead. This is one less obstacle for us, which must be good news.",
    "You look very flustered, Player. What is it?",
    "What?",
    "Please, calm down. Safalaan's absence does not mean we have to fall in disarray. This news is very grave indeed, and we cannot ignore it. I believe we should evacuate. If Vanstrom knows about the base, it is only a matter of time before we are overrun by vampyre forces.",
    "It is decided, then. We must destroy Vanstrom along with any information he may have. We must enter Darkmeyer to get him. Even if we managed to disguise ourselves, they'd never let unrecognised vyres in to such an important vyre's house.",
    "I am sorry to have to send you on such a dangerous path, Player. Please, come and speak to me before you leave. I may be able to offer some help. Meeting adjourned. Myreque prevail!",
    "I am sorry to have to send you on such a dangerous path, Player. Please, come and speak to me before you leave. I may be able to offer some help. Meeting adjourned. Myreque prevail!",
    "Of course. Firstly, you should create weapons from your blisterwood logs. Vanstrom has been around for centuries, and is, no doubt, a master of all forms of combat, so I recommend that you create weapons for each style: melee, ranged, and magic. You should be able to create the weapons by carving the logs with a knife. I recommend attaching two silver sickles to the melee weapon, to give it a bit of an edge. Kael has a pair you can use. I also want you to take my bottle of holy water. Although it won't be any use against Vanstrom at full strength, it may be useful if you weaken him enough. In my experience, Vanstrom likes to have a summoned creature as a bodyguard. The holy water may prove useful here, too.",
    "Please remember, if you succeed in destroying Vanstrom, you must destroy any paper evidence he may have of our whereabouts too, just to be safe. If you need any help before you go, remember that these men are experienced fighters of the vampyres. They might have some useful tips. Good luck.",
    "Of course.",
    "Let me think. In my experience, Vanstrom likes to summon creatures to aid him. If he does so, I'd recommend that you kill them straight away.",
    "Player, you're awake! How do you feel?",
    "Sarius brought you here; you were in a bad way. She said you defeated Vanstrom, is it true?",
    "I can't believe it. One of our most feared enemies... I cannot quite grasp that he is truly gone. This is a great step for the Myreque, Player. We cannot thank you enough. I can see why Safalaan places so much trust in you.",
    "I'm so glad to hear it. Sarius said you defeated him but I couldn't believe it until I heard it from you. This is a great step for the Myreque, Player. We cannot thank you enough. I can see why Safalaan places so much trust in you.",
    "Icyene?",
    "I cannot say I did not feel that he was different. I will have to consider this, Player. It will have many implications for the Myreque, if it is true.",
    "Not directly, no, but we did send word amongst the trusted citizens. One reported seeing Safalaan...",
    "They lost track of him after that, and no one has seen him near Burgh de Rott. We must just hope that he is safe, and knows what he is doing. In the meantime, you have had a great victory today.",
    "We have to reward you, but we have nothing of worth here. Please go to Veliaf, he will be so glad to hear the news, and I'm sure he'll have something of use to you.",
    "Thank you again, Player.",
    "Good to see you looking well again.",
    "Go ahead.",
    "I can't say it's something I've ever heard of. I'm afraid I can't help you there.",
    "What is it?",
    "Well, I suppose it would explain a lot... and Safalaan was never clear about his past. Of course, this means that Safalaan is in even more danger than we thought, Player. If the other vampyres know of him, they will hunting for him relentlessly.",
    "We believe the Icyene came to Morytania centuries ago to fight the vampyres. If Safalaan has Icyene blood within him, his powers may be a great threat to them.",
    "No, we have heard nothing. He didn't say where he was going, just that he needed to do something. We must just trust that he has a plan, and is keeping himself safe.",
    "Safalaan is certainly a great leader to our branch of the Myreque. I cannot deny that I am concerned about our time without him, but he will return, I am sure of it. In the meantime, we will continue our efforts. We cannot let our personal concerns affect the aid we are giving to the citizens here. Who knows? Perhaps Calsidiu will return to aid us during Safalaan's absence.",
    "We believe the Icyene came to Morytania centuries ago to fight the vampyres. If Safalaan has Icyene blood within him, his powers may be a great threat to them.",
    "Of course.",
    "They lost track of him after that, and no one has seen him near Burgh de Rott.",
    "I feel we are going to have to lie low for a while. The deaths of Ranis and Vanstrom will have caused upheaval in the vampyre community.  We will have to be vigilant and gather all the information we can about what he does in retaliation.",
    "Well, she has supported us so far, we must hope that she will use her power in Darkmeyer to move attention away from us."
  ],
  "Safalaan": [
    "Player? How did you get here?",
    "Our supply runners, they haven't been making it here from Burgh de Rott. The vampyres must have tightened their grip again.",
    "For me? Can I see?",
    "For me? Where did this come from?",
    "Yes... I knew about the cave, but Vanstrom you say? That scum... Let me see.",
    "Let's see here...",
    "It is unlike him. What could he possibly want from... this? You say you're sure it was Vanstrom?",
    "I see... I'm not sure what to make of this, Player. The writer says they knew me centuries ago, and they speak about my parents; my experiences...and how could they know about my visions?",
    "Did you find anything else in the cave?",
    "You should bring this medallion to me. It may be useful to decipher Vanstrom's plan.",
    "I cannot ignore the claims in this letter. I will have to meet him. Even if this is Vanstrom, he knows something. He must have put it there for a reason. If Vanstrom was truly after Burgh de Rott, he would have just attacked.",
    "Yes, that is more than likely. You're right. We cannot give him what he wants. I must stay here, but we must find out what is going on. Player, will you go in my place?",
    "Thank you, Player. I will send Vertida and Mekritus with you, in case you run into trouble. From the sounds of it, Vanstrom wants to meet in the clearing just west of the base. You should head to an overlooking window, to the north of the clearing, before you meet with this person. They could be very dangerous. I have written the directions in your journal, if you become lost.",
    "Be careful, Player.",
    "I have not shared this with anyone. Not even with the Myreque here in the base. Recently, I have been plagued by visions, both awake and asleep. I barely remember them afterwards, but I am left with... Do you remember that event near the blood altar, with the Vyrewatch?",
    "Oh, I remember it well. We were ambushed by Vyrewatch, if you recall, and I was severely weakened. But then, I rose off the ground in a blue light that seemed to strike fear in to the hearts of the vampyres.",
    "I am left with the same feeling I had after that; a feeling that there is some kind of great power within me. I believe that it is ready to be released, for good or bad. I am afraid, Player.",
    "I have tried desperately to keep this a secret, so as not to worry the other Myreque. If they knew... they might jump to conclusions. They are trained to see evil in every shadow here. My history is so very vague to me. I... do not know how old I am. I do not remember being young; I have been the same age for as long as I can recall. Time passes so strangely to me.",
    "I do not know how long I have been this way. I have been in the Myreque for many years, and before that I remember some time on my own, but prior to that? Nothing.",
    "A medallion? Where did you find it?",
    "How strange... this feels very familiar. May I?",
    "I believe I added a destination. It should be able to bring you here now.",
    "I do not know, Player. So many things remain unexplained to me recently. Please, take this thing away from me.",
    "Player, they are getting worse by the day. They have increased the tithes, and if a citizen cannot give blood they are taken away. Who knows what fate befalls them? Even healthier citizens have been subjected to spot attacks. Rogue Vyrewatch just appear and snatch them up, never to be seen again. It is as if they are restless; no longer following their tithing orders.",
    "Me? Why do you ask?",
    "No. I'm fine. I don't know why he'd say that.",
    "Yes. I just have some things on my mind. What do you want, anyway?",
    "Please come back soon, Player. I need your help.",
    "Ah, Player. Please, we need to discuss this letter.",
    "Have you been to the lookout point yet?",
    "I'm sorry, Player but I need you to find out all you can.",
    "Player, you should get back and see what Vanescula wants.",
    "Player, are you ok? Vertida and Mekritus turned up here without you; they said it was Vanescula in the clearing, not Vanstrom?!",
    "Hm... She could have killed you on the spot. She must have wanted something. You should go back and see.",
    "You said you met Vanescula?",
    "Let me see!",
    "Yes, as I hoped! She has information about my family; my heritage! Perhaps, finally, I can know...",
    "Hm? Oh... yes. You should go to this tree in Darkmeyer. I must know if Vanescula's information can be trusted. Of course, we'll find out if we can trust her in our struggle against Drakan, too. I'm afraid I don't have time to give you any advice. I must examine this letter. Speak to Vertida. He'll be able to help you.",
    "Please, Player, speak to Vertida. I don't have time for this right now.",
    "I'm warning you. Let me pass.",
    "What are you doing here?",
    "You are Drakan's sister, Vanescula. I must keep my guard.",
    "I am."
  ],
  "Vyrewatch": [
    "Ah, a fresh meat bag! In here, no one will see if we take more than a tithe.",
    "Wait!",
    "What is it? I'm hungry.",
    "This is the one. We must leave it.",
    "This one? No wonder, look how fresh it is; full of blood.",
    "At least we know it'll have a worse time with her.",
    "What is it?",
    "I don't live here. I'm just posted down here to look after the juvinates. Pathetic things; always squabbling and whining. I'd rather be watching the humans.",
    "Well, if you are posted with the humans, at least you can get a light snack every now and then.",
    "You haven't been here long have you?",
    "I haven't even heard anything of Drakan's current activity since I was initiated. Word is, he hasn't been seen for decades, perhaps even centuries. Vanescula and Ranis apparently perform his orders.",
    "What do you want?",
    "A scrawny rat like you? You won't last five minutes.",
    "Yes?",
    "You must be new. I like to go down to the jail to see the new arrivals. See how scared they are. The werewolves are always good to deal with, too. Recently they have increased their trade in exotic goods from Misthalin.",
    "Oh, [Name], I see you decided we are worthy of a visit. Don't forget where you came from.",
    "[Name]! Remember me from your days in this tier?",
    "In that case, you must remember how kind I was to you in your early days. You had no clue how to get by here. Take me to the upper tier with you; I deserve it!",
    "As you wish, my lady."
  ],
  "Nessie": [
    "I saw you in the window, Player. Why did it take so long for you to come see me? The Vyrewatch could have got me, you know.",
    "Player, the great hero of the Myreque! Who doesn't know your name? I'm so glad you're here.",
    "I don't know, I'm lost. A scary vampyre told me to stay here.",
    "Yes, that's what he said his name was. Do you know him?",
    "Oh, you are funny Player. The worst vampyre you say? Perhaps... but his power is nothing compared to mine.",
    "Please don't leave me here on my own."
  ],
  "Vanescula Drakan": [
    "Oh, calm down. I'm not here to fight. Not that it would be much of a challenge.",
    "Well, seeing as I haven't killed you yet, clearly I'm here to offer my help.",
    "You and your Myreque friends have a dream to destroy Drakan, and free Meiyerditch, do you not?",
    "Well, I don't see why it shouldn't be made a reality. But you need my help. Let's face it; you haven't been making much progress by yourselves.",
    "Spare me your transparent lies. I know that's what you want. Well, I don't see why it shouldn't be made a reality. But you need my help. Let's face it; you haven't been making much progress by yourselves.",
    "As if it matters... Of course I know that's what you want. Well, I don't see why it shouldn't be made a reality. But you need my help. Let's face it; you haven't been making much progress by yourselves.",
    "Drakan is no longer a worthy leader. He remains in his castle, more and more obsessed with some ridiculous old rock. There are irritations from all sides: mercenaries entering our lands; Misthalin threatening to turn its eye on us at any moment; even fighting within our vyre ranks. Drakan has become a blind old fool, and he is letting our society fall apart. Besides, centuries of boredom can make one feel quite... impulsive. It would be nice to have a change.",
    "Charming. I think you'd find me quite a favourable leader. You have been in the old Haemalchemy labs, have you not?",
    "So naive.",
    "I don't know why you feel you can lie to me.",
    "I do find it vaguely amusing that you think I do not know what happens in my own lands.",
    "You found the Haemalchemy book, I know. But of course you couldn't understand the contents. Humans are not known for their intelligence after all...",
    "I believe Drakan inadvertently discovered the secret to vampyres not needing to feed on human blood. Of course he destroyed the evidence; this revelation would shake the very foundations of our society.",
    "A small sign of intelligence; how refreshing.",
    "Of course, and I'm slightly offended that I'd be mistaken for Vanstrom.",
    "I have taken a certain interest in him.",
    "Any information I have is between myself and Safalaan. You would be unwise to keep pushing me. Now, do you want my help or not?",
    "No? Well, then; when you realise your mistake, I'll be waiting.",
    "Fight you? I'd squash you like a blood mite. No, I'm here to offer my help.",
    "Insolent human! I am Vanescula Drakan; sister to Lord Lowerniel Drakan: ruler of Morytania! Show some proper respect.",
    "Oh don't worry, they're quite safe. I just teleported them away so they can't bother us.",
    "Oh, such a shame. Well, when you do change your mind... I'll be waiting.",
    "Have you considered my offer?",
    "Beside the fact I have not killed you where you stand? I suppose you're too ignorant to notice that you haven't been bothered by my Vyrewatch. I've identified you as my personal blood tithe; the Vyrewatch in Meiyerditch won't bother you any more. If that doesn't sway you, I have some information that you may find particularly interesting.",
    "Despite all your little adventures, you have not yet set foot in our city, Darkmeyer. Unfortunately for you, this is where your greatest weapon lies. In the centre of Darkmeyer, there is a tree.",
    "If you would let me finish, perhaps you would find out. The tree is extremely harmful to vampyres if it makes contact. Furthermore, it is continuously moving and growing; its very wood is alive and writhing. This makes it very... unpredictable. I believe, if you could carve from the logs of this tree, you would have weapons far more potent and versatile than the Ivandis Flail.",
    "I suppose it would be pointless to explain that I have just described a weapon you could use to bring about even my own downfall. I had expected the great hero of the Myreque to at least have some spark of intelligence. One can but dream.... I tire of this. I had hoped to meet Safalaan here, but of course he would not risk himself... not at this time. In truth, you are quite a disappointment in comparison. I ask you to take this letter to Safalaan; let us see his response.",
    "That slither of metal? Any vampyre of power could snap that in half before it had a chance to make contact with them.",
    "So many tedious questions... but I suppose I will indulge you. It is known to the vampyres as the blisterwood tree. It used to exist across Morytania, and we tried so hard over the centuries to destroy it. We had thought it extinct for years, but one day, in a stately building of upper Darkmeyer, a sprout grew through a crack in the floor. A single blisterwood tree began to grow. Of course, Drakan tried everything to destroy it, but it resisted all attempts. It has been kept at bay for the last century with a contraption, built by Drakan, that sucks the energy from it. There's no telling how long it will last.",
    "Such confidence. I'm sure you'll be back.",
    "You assume I haven't thought of that? Of course I could destroy Drakan myself; do not doubt my power. Alas, the vyrelords just wouldn't have it, and I must retain their respect if I am to convince them to follow me as a leader.",
    "Have you taken Safalaan the letter?",
    "Well hurry up. I don't want to stand in these slums all century.",
    "Must have been a lucky guess.",
    "You lost it? Luckily I catered for your stupidity and made a copy.",
    "It's about time you got here.",
    "He didn't tell you? I think I'll keep the secret between him and I, then.",
    "The tree is, of course, well guarded in the upper tier of Darkmeyer.",
    "Oh, I wouldn't do that if I were you. My protection won't cover you here. These Vyrewatch are rather more independent than those guarding Meiyerditch. If I were you, I'd put those smoke bombs to good use and find a disguise. They'll fool the juvinates as long as you don't do it in front of them. You'll want to stay clear of the Vyrewatch; they'll be able to smell you. Return to me when you are done. You'll probably need to adjust any clothes you find, so I've brought a needle and thread.",
    "Don't keep me waiting.",
    "Why do you still appear to be human?",
    "Such idiocy! Use those smoke bombs and find yourself a disguise. Don't throw them in front of the juvinates; they're not quite that unintelligent. Stay away from the Vyrewatch; they'll be able to smell you. Return to me when you are done.",
    "What an achievement.",
    "Of course not. You think we would let just anyone enter a building containing something so dangerous?",
    "Good, I am glad to see you have some sense. Perhaps you may do well here after all. Now stay still.",
    "Do not push your luck. Now, stay still.",
    "I put my blood mark on you. It will cover your disgusting human scent, and aid in your disguise.",
    "No. Only vampyres of status are allowed to enter the Arboretum. You will need to mingle with the Vyrewatch before they will recognise you and let you in.",
    "Of course not. You are as subtle as a mutated bloodveld. Player, don't fail me. You will be faced with tasks that you may find... unsavoury, but you must reach the tree. You need the blisterwood if you are to mount any successful attack on Drakan and free these lands. I'll be keeping an eye on you in Darkmeyer, in case your idiocy gets the better of you.",
    "Well, you haven't done anything! Go and talk to some of the vyres, see what you can do for them.",
    "I think I saw Sanguinus Varnis wandering around. He usually has some complaint. Perhaps you can do something for him.",
    "I saw you talk to Sanguinus Varnis, but you didn't get all the posters. Varnis would probably be impressed if you finished that off.",
    "Whatever. Make sure you tell him about it afterwards.",
    "Can you do nothing for yourself? Try looking for Valentina. She'll probably gossip about you if you impress her.",
    "Why don't you go and check the cells? Last I heard, there was a new prisoner just waiting to be taunted.",
    "Why don't you go and check the cells? You might be able to perform some actions to scare the prisoners.",
    "The scouts always have something to gossip about. Why don't you try and put a good word in with them.",
    "Ah, good to see you here, '[Vampyre first name]'. Now, listen closely. My brother, Ranis, is around. He may be a fool, but he is the most likely to become suspicious of you if you put a foot wrong. As that seems fairly likely, I suggest you stay away from him.",
    "Well, you won't be fully accepted in the upper tier unless you pledge your allegiance to the Drakan family.",
    "Must I hold your hand through everything you do? come with me; just follow my lead.",
    "Attention, my vyres!",
    "I have a very special announcement, regarding our  newcomer, [Vampyre first name].",
    "Something... I think everyone should hear.",
    "[Vampyre first name] has risen the ranks of Darkmeyer and will now pledge [himself/herself] to the Drakan family.",
    "Just repeat after me. I pledge fealty to the Drakan family.",
    "Good. Now repeat: I devote my service, land and power to the Drakan before me.",
    "Excellent. [Name], I now present you with this blood mark, ensuring your everlasting service.",
    "How did you even... oh, never mind. It is only the mark that matters.",
    "Yes, [he/she] pledges fealty to the Drakan Family.",
    "Try talking to Misdreavus.[sic] He's easily entertained.",
    "I saw you punch that tither. I'm sure Misdreavus would want to hear about it.",
    "Why don't you follow up what happened with that blood tither?",
    "Go and talk to the guards, they always need a bit of 'help'.",
    "Can't face killing any more citizens? Come on, it's for the greater good.",
    "What do you want?",
    "You've made a good name for yourself here. You should be able to enter the Arboretum now. Of course, you could stay here and increase your status further.",
    "Do watch out for Ranis.",
    "Try talking to some of the vyres around; they're always good for gossip.",
    "It looks like you've been very busy. You should probably just kill some more Meiyerditch citizens. Go on, it's not difficult.",
    "What do you want?",
    "You've made a good name for yourself here. You should be able to enter the Arboretum now. Remember to keep an eye out for Ranis.",
    "What are you doing? I can't be seen talking to a human!",
    "What's going on here?",
    "Ranis! Whatever could make you say that?",
    "Oh, Ranis. You always have been a fool.",
    "Wait! Don't go out there!",
    "The commotion in here will have set the vyres on guard. I can't risk you breaking cover.",
    "Keep those logs away from me.",
    "Oh, and you won't find any seeds, if that's what you were looking for. The trees don't have any.",
    "Are you serious? His corpse is in front of you. it's fairly obvious that I killed him.",
    "Oh, I shouldn't think so. I'll just say you did it.",
    "Do not accuse me! I have done you a favour! Ranis was suspicious of you; he would have broken your cover and destroyed any hope of you entering Darkmeyer again. He was in here, by himself - there were no witnesses. How could I resist dispatching one of the main obstacles standing in our way? Of course, Vanstrom will be furious. He'll probably increase his efforts to destroy you. It couldn't be helped; at least we only have him to worry about now.",
    "I suppose so, but I have done you a favour, really. Ranis was suspicious of you; he would have broken your cover. You would not have been able to use your disguise to enter Darkmeyer again. What's more, he was in here all by himself; no witnesses. How could I resist dispatching one of the main obstacles standing in our way? Of course, Vanstrom will be furious. He'll probably increase his efforts to destroy you. It couldn't be helped; at least we only have him to worry about now.",
    "Oh yes, he also mentioned he knew where you hide out in Meiyerditch. You might want to warn them about that, too.",
    "Yes, yes, you're such a hero. Come on then, let me see that medallion.",
    "Just hand it over.",
    "It's one of Drakan's. It was broken during its centuries underground, but it's now back to its full potential. You will now be able to use it to return here, should you need to. Now, this commotion with Ranis will have been heard by someone. I'd better get you out.",
    "Why are you still bothering me? I thought you had something else to do?",
    "What are you doing here?",
    "Oh... well, I suppose that's a good step. Try not to get yourself killed.",
    "I assure you, I am anything but warm.",
    "Look after him/her. I'll deal with Vanstrom's pets.",
    "That's that dealt with. Now to ensure Vanstrom's information never leaves this room.",
    "Now we need to get Player some where[sic] safe.",
    "What are you talking about?",
    "And you never told me? How traitorous. I suppose your bravery is to be acknowledged. Very well, take Player with you. I will have to explain to the vyres that the Myreque killed Vanstrom, of course. Be forewarned.",
    "Oh, you're better I see.",
    "You're welcome. Now, stop bothering me. I need to plan our next move.",
    "Oh, of course. I killed him.",
    "So gullible. Really; how did you survive this long here?",
    "Well, excuse me for having a bit of fun.",
    "Stand down, vyres.",
    "Safalaan! After all I've told you, you are still so distrustful.",
    "I just came up to see you on your way. You are taking heed of my suggestion, I assume?",
    "I will let you go then. Be safe, Safalaan. I know you will find success. When you return, we will begin.",
    "Oh, it's you.",
    "Of course I do.",
    "Oh yes. You can make yourself very useful to me.",
    "Of course not. Now begone, you are wasting my time."
  ],
  "Vampyre juvinate/Vyrewatch": [
    "Human! Do not think Vanescula's protection covers you here. Get out!"
  ],
  "Canifis settler": [
    "How did you get in here?",
    "Leave me alone.",
    "Fine, just take it!",
    "You can't make me give you anything!",
    "I gave you the money! Please, leave me alone!"
  ],
  "Vampyre juvinate": [
    "What is it?",
    "Terrible! We live like vermin!. I've been initiated into the vyre ranks, but I'm still treated like dirt!",
    "Well, it's better than the juvenile life; scratching a living, barely better than human scum. One day I'll be in the upper tier. Then, I will have blood every day!",
    "What is it to you? You look like a middle-tier vyre. You shouldn't be hanging around here; the nobles might get the wrong idea."
  ],
  "Darkmeyer trader": [
    "Can't be seen selling to you; bad for business.",
    "What do you want?",
    "I bring goods in from outside. Need anything?",
    "What'll it be?"
  ],
  "[Vyre]": [
    "I haven't seen you before. What's your name?",
    "Well?",
    "[Vampyre full name] is it? How very strange."
  ],
  "Sanguinus Varnis": [
    "You there, [Vampyre first name].",
    "Want to help me out?",
    "The vyrelords and ladies have been sticking their posters all over our tier.",
    "Go and vandalise their posters. I won't have them lording it over us any more!",
    "That's a shame, it'd be worth your while.",
    "Have you ruined those posters yet?",
    "Hurry up! I can't stand them.",
    "Excellent. I'll put in a good word for you among my vyres.",
    "I haven't seen any posters around recently, [Vampyre first name]. We did a good job."
  ],
  "Grigan Kaninus": [
    "Oh, I'll be sent back to the slums for this one.",
    "What? Come to laugh at me? I suppose it makes no difference. Vanstrom's going to kill me anyway. He asked me to exercise his bloodveld younglings, but they've all run off.",
    "What? You'd... help me?",
    "No vyre helps another in distress. Don't you know that? You must be up to something, but it's not like I have a choice. The younglings ran off here in the middle tier, but they might have wandered into the lower tier too. Please keep an eye out for them, and bring them to me if you find them.",
    "Just don't go telling anyone. Vanstrom will have my neck.",
    "You found some! You need to find Number more.",
    "Oh, they'll have run off somewhere. I can't imagine they'll have gone further than the middle or lower tiers. They seem to disappear for long periods of time, you'll have to keep checking. You can always do something else in the meantime.",
    "You found them all! What are you going to ask from me in return?",
    "You're a very strange vyre, Player, but you've saved me from death, or worse demotion. I am in your debt."
  ],
  "Chat Box": [
    "The little bloodveld barks happily as you put it in your bag. You should take it back to Grigan.",
    "You gain one status in Darkmeyer.",
    "You gain one status in Darkmeyer.",
    "You gain 10 status in Darkmeyer.",
    "You gain 10 status in Darkmeyer.",
    "You gain 7 status in Darkmeyer.",
    "You gain 20 status in Darkmeyer.",
    "You gain 4 status in Darkmeyer.",
    "Arrange the energy cells so the tree will receive them in sequence. The energy will be absorbed in rows through the pipes.",
    "The tree absorbs the chain of energy.",
    "Arrange the energy cells so the tree will receive them in sequence. The energy will be absorbed in rows through the pipes.",
    "The tree absorbs the chain of energy. The tree is becoming healthier and requires more complex energy sequences. No water energy may touch another water energy horizontally, vertically, or diagonally. No nutrition energy may touch another nutrition energy horizontally, vertically, or diagonally. Water and nutrition may touch each other, and light may touch anything.",
    "Arrange the energy cells so the tree will receive them in sequence. The energy will be absorbed in rows through the pipes.",
    "The tree absorbs the chain of energy. The tree has nearly been returned to full health. No light energy may touch a water energy horizontally, vertically, or diagonally. Light may touch another light, water may touch another water, and nutrition may touch anything.",
    "The tree absorbs the chain of energy. The tree is returned to health, it may now be chopped.",
    "You get some blisterwood logs."
  ],
  "Valentina Kaust": [
    "You there. I haven't seen you around here before.",
    "Oh, you poor thing. If I were you, I'd be absolutely starved for conversation if I kept to myself. Come, I don't have any engagements until later. Have a drink with me.",
    "Take this. It's fine quality blood, given to me by a friend. Don't tell anyone, but he smuggled it in from Canifis; their special stock, supposedly reserved for Vanstrom!",
    "Well go on then, try it.",
    "You're turning it down? Perhaps I should be glad not to keep company with strange vampyres like you after all.",
    "Ah, [Vampyre first name]. You never drank that blood. Is something wrong?",
    "What are you doing! That blood... do you know how much that cost?",
    "Oh? Please, I implore you; do it quickly!",
    "[Vampyre first name], good to see you out and about. I'm terribly busy, but we absolutely must meet up soon."
  ],
  "Valentina Klaust": [
    "[Vampyre first name], how did you enjoy the blood? I'm sure my friend would like to know how it was received.",
    "Disgusting? How dare you! My friend assures me this is Vanstrom's personal tithe. Do you want me to go and get him to demonstrate to you that you are wrong?",
    "Oh; well, I suppose it was not warm. I prefer mine cold, but I feel quite rude for not offering to heat it for you. I do apologise.",
    "Do not try to flatter me. Let me give you a piece of advice; you clearly haven't been long...initiated.",
    "You won't get very far around here by being nice. Yes, the blood is of fantastic quality, but you should never appear to admit a vyre is better than you.",
    "Oh, but my friend assures me that-.",
    "Of course, of course. I do apologise.",
    "Oh?",
    "Usurping the tithes? I wouldn't have expected it from such a meek one as you. Perhaps you are worthy of this tier after all.",
    "Oh, yes, I can understand that. And I have to say you are looking far too full of life; far too much weight on you. Perhaps you should stay off the blood for a while, in fact.",
    "I'm warning you [Vampyre first name]. I'm extremely well connected in this tier. Do not expect me to spread any good words about you."
  ],
  "Valentina Klause": [
    "How dare you! My friend assures me this is Vanstrom's personal tithe; it cannot be bad! What kind of vampyre are you?",
    "Oh, well, I suppose it was not warm. I prefer mine cold, but I feel quite rude for not offering to heat it for you. I do apologise."
  ],
  "Maria Gadderanks": [
    "Leave me alone.",
    "What?",
    "What do you vampyres want now? Have you not taken everything from me yet?",
    "Please, not another tithe! I'm so weak!",
    "No, please!",
    "What?",
    "You're giving me a rest? Th... thank you.",
    "Very funny. Just leave me alone.",
    "Don't hurt me.",
    "What more do you want?",
    "What? Please, is he ok?",
    "No, you're lying.",
    "No, it can't be true.",
    "Yes, maybe you're right. I do hope he comes to get me soon.",
    "What more do you want?",
    "No, please! I have a family! I can't take anymore.",
    "Yes! Please! I have a family to go to.",
    "I can't take anymore.",
    "You have my husband's hammer...but how? Please! I must know where he is!",
    "Leave me alone.",
    "I can't take this anymore.",
    "Please let me go.",
    "Please don't hurt me.",
    "Who are you? Are you with them?",
    "I'm saved! Please, please help me.",
    "Thank you! Thank you so much!",
    "No, just leave me. I'm sure it will all be over soon."
  ],
  "Vyrewatch guard": [
    "Come on, [Vampyre first name]. Can't you do better than that?",
    "I'm a guard. I guard things.",
    "Yep. It's a good job. The humans are so jumpy. You just have to shake your fist at them and they cower in fear. You should give it a try.",
    "Hey, blood rat!",
    "You're not from round here, are you?",
    "Ah, [Vampyre first name]. I've heard you've been making quite a name for yourself amongst the middle ranks. Let's see how you fare in the real city. Fancy a bit of fun?",
    "That's the spirit. Now, you see these pathetic mites behind me?",
    "They all failed to give enough blood in their last tithe. That means they've overstayed their welcome in Morytania. We have no use for them. Except, of course, for sport. Go on, let's see how many you can do. We'll keep count.",
    "Refusing to kill humans? That's an offence of the highest order. Wait here, I'm going to get Ranis!",
    "Hmm... well there is one thing you can do. A werewolf in the lower tiers owes me some money. Go and get it off him/her, then visit the blood trader and get me one bottle of [Blood Type] and one bottle of [Blood Type.]"
  ],
  "Ranis Drakan": [
    "Hm, [Vampyre last name] is it? Well, '[Vampyre last name]', make sure you stay in line. I'm in charge around here.",
    "You there, [Vampyre last name]!",
    "You've been making quite a name for yourself, haven't you? I saw you pledge fealty to Vanescula. Are you implying that she's more important than I am?",
    "I'm glad to see you at least know your place.",
    "Now, I demand that you pledge fealty to me, too.",
    "I demand that you pledge fealty to me, too.",
    "What do you mean, whelp? It was the normal bloodmark, given to every vyre. No vyre should find it painful.",
    "Do not mistake me for a fool. I'll be watching you, '[Vampyre last name]'.",
    "Such insolence! You will not be entering the Arboretum without my permission.",
    "How dare you? This is typical of her.",
    "[Name]? [Name], what are you doing in there? Get out here! When you get out here, I'll give you more than a blood mark!",
    "That so called '[Name]'. I don't think he's one of us.",
    "I know this may come as a shock to you, Vanescula. I see they had you thoroughly tricked. But I won't let them make a fool out of me! You hear me, human?! Come out here and face me!",
    "Vanescula, what are you-"
  ],
  "Arboretum guard": [
    "Of course not. Only vyres of importance may enter this building.",
    "You don't think we let just anyone in do you?",
    "You may pass, but be warned. If I think you are up to anything, I will go straight to Ranis."
  ],
  "[Vyrelord/Vyrelady]": [
    "Stop bothering me, [Vampyre last name].",
    "Stop bothering me, [Name].",
    "Weren't you told during initiation?",
    "There are many theories.",
    "Some believe the blisterwood tree was planted by the old Queen, to drive us out. A lot of good it did her.",
    "Some believe that Saradomin blessed the tree, to scare Drakan away. But of course, Drakan would not be afraid of Saradomin.",
    "Some believe that the tree grows where the Icyene staged a final battle against Drakan. Not bad going for Drakan, if that's all thats[sic] left of them."
  ],
  "Darkmeyer blood trader": [
    "What'll it be?",
    "A, B, AB? I've got fresh; pungent; any temperature or maturity you like. Between you and me, I've even got some exclusive, quality non-Morytanian blood. Misthalin; know what I mean? Keep it between us, mind.",
    "Then stop wasting my time; I don't have all day."
  ],
  "[note": [
    "only middle-tier vyrewatch dialogue changes]"
  ],
  "Vyrewatch Guard": [
    "I'm a guard. I guard things.",
    "Yep.",
    "Yup.",
    "Are you insulting my ability?",
    "You haven't killed any humans. Feeling soft? You'll need to kill more if you want to be recognised here.",
    "You've only killed one human. Feeling soft? You'll need to kill more if you want to be recognised here.",
    "You've only killed 2/3/4/5/6/7 humans. Feeling soft? You'll need to kill more if you want to be recognised here.",
    "You've killed 10/11/12/13/14/15/16/17/18/19 humans. Not bad; it'll certainly get vyres talking. I'm sure the vyrelords and ladies would find it entertaining if you continued, though.",
    "20/21/.../39 humans killed... pretty good. You've done enough here, but it's always fun to get a few more isn't it?",
    "I knew you were good, [Name]. You've killed 40 human rats! Stress-relieving, isn't it?",
    ": You've killed over 60 humans! You are more ruthless than me, [Name]!",
    "About time. Now don't bother me again."
  ],
  "Sentinel": [
    "Yes, I keep an eye out for intruders. You're new, aren't you?",
    "I see. Here's a tip. In the upper tier, be loyal to no one. Watch your own back.",
    "Nothing important, but there has been some talk about Vanstrom's recent assignments. What is your opinion of him?",
    "Oh? Well, your respect for authority is to be admired. But that's really a middle-tier trait. If you had asked me, I would have said he should be beheaded. Disgusting wretch.",
    "Why? Because that would open up his position, that's why! Now be gone, you bore me.",
    "Okay? No, that won't do, Player. You'll be eaten alive here unless you grow a spine. If you had asked me, I would have said he should be beheaded. Disgusting wretch.",
    "Why? Because that would open up his position, that's why! Now be gone, you bore me.",
    "Yes, excellent. If you had asked me, I would have said he should be beheaded. Disgusting wretch.",
    "Why? Because that would open up his position, that's why! Now be gone, you bore me.",
    "Nothing for you to worry about.",
    "I've noticed you talking with Lady Vanescula. She seems to have taken quite a liking to you. Has she taken you to meet him?",
    "Lord Drakan!",
    "Oh, just curious. He hasn't been seen for years and years. It's causing some of us to...lose faith. What do you think?",
    "Yes! If you ask me, Drakan is wasting time. We should take action now to tighten our grip on Gielinor. Put a good word in with Vanescula, won't you?",
    "What? Drakan is throwing away our society. There are threats to us: Misthalin to the East[sic], and these 'Myreque' within our very own Morytania.",
    "We should take action!",
    "Leave me. You're wasting my time.",
    "Oh, of course. Yes, he must know what he's doing. I apologise for asking. Please do not tell Lady Vanescula.",
    "Good day, [Name].",
    "No, the city is safe. It's outside the city we should be worried about.",
    "We should turn our attention to Burgh de Rott; that disgusting human town. It makes me sick to know there is blood out there going to waste.",
    "I am in no mood for jokes, Player.",
    "If you will not take this seriously, then leave.",
    "Exactly. It's an attitude like that that'll get you going up the ranks in Darkmeyer. Drakan wouldn't notice if you stole the throne from beneath him.",
    "Disgusting, isn't it?",
    "Oh, it's you, [Name]. I see you've forgotten us since you left for the higher ranks.",
    "Did you hear? Ranis is dead!",
    "His body was found by Vanescula herself, in the Arboretum hall. She claims it bears all the marks of a Myreque killing.",
    "To think, they managed to infiltrate this far into our city, perhaps even to the tree itself. No doubt we will have our revenge.",
    "You haven't heard? Vanstrom is dead!",
    "A rogue Myreque agent, from what I hear, with weapons from the tree. The rumour is that Drakan has been informed and is furious; especially with Ranis' murder so fresh on his mind. They say he's put a price on the killer's head; a whole vat of blood for the vyre who brings them to him!",
    "Yes. Isn't it great? I haven't had this much excitement in years."
  ],
  "[Sentinel]": [
    "I'm a sentry, posted to defend Darkmeyer against intruders.",
    "Why, those rats in Meiyerditch, of course. Those filthy humans. If you ask me, we should keep them locked up in cages.",
    "Glad to have you on side, Player. With that attitude you'll make a good servant when I'm in the upper tiers. Good bye Player.",
    "Oh, but of course. I'm sorry to have wasted your time.",
    "Live freely? Is this some kind of a joke?",
    "What kind of a vampyre wants to free humans?",
    "Get out of my sight! Go and live with the human rats!",
    "Well, I have heard of a possible annoyance. A group of human vermin are rallying together, calling themselves the 'Myreque'. They believe the humans should be free, and that they can defeat us. Isn't that ridiculous?",
    "Oh no, of course. They are not worth considering. If you ask me, Vanstrom shouldn't be wasting his time on them.",
    "You dare support humans? Humans who plan to defeat our illustrious master?",
    "Leave, before I decide I like the taste of vyre blood.",
    "Of course not! It worries me that they are known in Darkmeyer, though. Perhaps Vanstrom should be more forceful in his approaches."
  ],
  "Misdrievus Vakan": [
    "You there, [Vampyre last name].",
    "Of course. Look, now you're in the upper tier, you'd better prove yourself.",
    "Well, you see, living in the same place for centuries makes one quite restless. I want to be entertained.",
    "No, fool. I want you to humiliate that blood-tither. I'm fed up of seeing those filthy vermin getting special treatment. They're just rats like the rest of them. Well go on, get on with it.",
    "Don't expect me to put in a good word for you around here.",
    "That was fantastic! The best thing I've seen in years! Did you see? The stupid vermin smashed his vial! He won't be able to collect the sample for the tithe-master now!",
    "Oh, he was probably on his way to collect a sample of a recent tithe for inspection. There will be dire consequences if he turns up without it. In fact, why don't you run along and see what happens? It could be hilarious.",
    "What are you doing? You might be missing something good! The tithe master resides in the building West of here, now hurry up!",
    "Well, [Vampyre first name]? What happened?",
    "Killed? Excellent! Hahaha! Stupid fool. And tithed first? Fantastic! Oh, [Name], that has made my day! I'll see you around, [Name].",
    "What? What use is that?",
    "Oh well... You entertained me for a while.",
    "Now be gone.",
    "Go away, I've had all my entertainment from you."
  ],
  "Blood tither": [
    "What can I do for you, sir?",
    "Very good. What fun.",
    "I'm sorry, sir. What do you mean? Please don't hurt me.",
    "Yes, of course sir. What ever you wish.",
    "Was that ok? I can do it again. I'm sorry, just please don't hurt me.",
    "A vyre... they... I dropped...",
    "Oh, thank you, [Sir/Ma'am], thank you!",
    "But... I... I couldn't...",
    "No!"
  ],
  "Tithe master": [
    "This rat has come to me without his blood sample.",
    "How dare you? See, [Vampyre first name], see what respect we get for giving these tithers such protection. Disgusting. Did you see anything happen, [Vampyre first name]?",
    "What?",
    "Oh, [Vampyre first name], that's not your fault at all. How were you to know this vermin is so clumsy? You there, could you not fall more carefully?",
    "Enough! [Vampyre first name], you seem like a sensible vyre. I will give you the decision on what to do with this urchin.",
    "Quiet. I like you, [Name]. You'll fit in well here. I think I'll send the tither to be tithed himself... then as you wish, to his death.",
    "Why?",
    "You're a strange vyre, [Vampyre first name], but you seem to have made waves among the others. I will trust your judgement...this time. But you, tither; do not fail me again.",
    "In that case not only did this vermin turn up without his sample, he's trying to accuse an innocent vampyre. You make me sick."
  ],
  "Captured Meiyerditch Citizen": [
    "Go ahead, nothing can be worse than this."
  ],
  "Captured Meiyerditch citizen": [
    "I don't care what you do to me! You're a monster! or Please don't hurt me! or Please, let me go.",
    "You're new. Please, can you give me news of my family? Anything?"
  ],
  "Canifis Settler": [
    "What do you want?",
    "So what if I do?",
    "I'm not giving anything to a runt like you.",
    "What? Keep that away from me! Fine, have your money!",
    "Take it."
  ],
  "Darkmeyer Blood Trader": [
    "Well, let's see. You've got enough business here for two bottles. What do you want?"
  ],
  "Darkmeyer Blood trader": [
    "Pleasure doing business with you."
  ],
  "Info Box": [
    "You hand the guard the two bottles of blood.",
    "You use your Farming skill to determine that the tree needs sequences of energy in the following order: water, light, then nutrition energy.",
    "You use your Farming skill to determine that the tree needs sequences of energy in the following order: nutrition, water, light, then nutrition energy."
  ],
  "Ivan Strom": [
    "We'll show you, vampyre scum!",
    "I heard what happened with Veliaf. I can appreciate his worries, but I don't think you should feel bad. You've made an ally in Vanescula and defeated two high-ranking forces in the vampyres society; Veliaf cannot deny that this is progress! You've done a great service for the Myreque, and I hope to be as fearless as you when we face Drakan."
  ],
  "Kael Foreshaw": [
    "And you trusted her? She must be lying... Vampyre scum.",
    "There must be some catch. What else happened?",
    "There must be some catch. What else happened?",
    "Typical! Vanescula must have found out and told him. He can't have known by himself.",
    "Or that's what she wants you to think. She-",
    "No, we must take action, not turn and run! Vanstrom is too dangerous. He will not stop hunting us, and it's time we fought back.",
    "Well, Player, you have already infiltrated the highest ranks of Darkmeyer. Perhaps you will have to go alone."
  ],
  "Vanstrom Klause": [
    "Ah, Player. What a pleasant surprise.",
    "Oh? Another 'heroic deed' for the Myreque, is it? You really are a blessing in disguise, Player.",
    "Oh, but I couldn't kill you without first telling you how pleased I am with you. You really have been so useful to me. First, leading me to the Myreque base, allowing me to kill two of their members. Then setting up that lovely town for an extra blood tithe, and even bringing fresh new adventurer blood to Morytania. You've been such a disappointment to the Myreque, Player, bringing them disaster upon disaster, it's almost a shame to kill you!",
    "The Myreque mean nothing! Safalaan is the only one I am after. Don't pretend you don't know, Player. Noble as you may pretend to be, you must know he is the only one holding them together, with his Icyene blood!",
    "You didn't know? I believed you to be cleverer than that, Player. What a disappointment. Safalaan was born of a... human father, but his mother was the so called 'Queen' Efaritay; an Icyene. My mistake, so many years ago, allowed Safalaan to live, but with no knowledge of his history. He is now coming of age, in Icyene terms. If he has any powers, they will be presenting themselves, and he must be dealt with before he discovers how to harness them. When I have Safalaan, it will all be over. In the mean time, you are a mere blood mite standing in my way.",
    "I see I misjudged you. I thought you would have the sense to know when you are defeated."
  ],
  "Sarius Guile": [
    "Player!",
    "Excuse me, ma'am. I can take him/her.",
    "My father was a member of the Myreque. I'm sorry, ma'am, but I know the location of the base."
  ],
  "Congratulations! You have completed": [
    "'The Branches of Darkmeyer' - Complete this Master quest."
  ],
  "Polmafi Ferdygris": [
    "Player, Veliaf claims you can now travel through Darkmeyer undetected?",
    "I see. Perhaps we should think of this in terms of the greater good. You had to do what you did for the citizens of Morytania. Whatever lives may have been lost, they were for a worthy cause."
  ],
  "Radigad Ponfit": [
    "Is it true, did you really kill Vanstrom?",
    "And Ranis too! Player, we could never have hoped for such success. At this rate, Drakan will soon be without our sights, and Morytania will be returned to a land of freedom!"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:The_Branches_of_Darkmeyer?oldid=36230918’"
  ]
}