{
  "Player": [
    "Hello there.",
    "Nothing much - What are you doing here? It doesn't seem like there's much to do out here in the desert!",
    "Do you have any quests? Call it a hunch, but you look like the type of man who might...",
    "Who are you, anyway?",
    "No, I really haven't.",
    "Nothing really.",
    "Sure, I was heading that way anyway. Any particular person at the digsite you want me to talk to?",
    "Um...yeah...about that... I kind of didn't go and speak to him yet...",
    "Okay, I'll do that then.",
    "Hello, are you Terry Balando?",
    "That's right. I was in the desert down by the Bedabin Camp, and I found an archaeologist who asked me to deliver this to you.",
    "So what does the inscription say? Anything interesting?",
    "Can you translate it for me?",
    "Um... So, can you translate it for me or not?",
    "Wow! You write really quickly don't you?",
    "I, uh, kind of didn't take it to him yet...",
    "Hello there.",
    "Yeah, he did. I have it here in this book.",
    "Yeah, I did. Kind of boring really.",
    "Hello there.",
    "Uh... don't you mean archaeologist?",
    "Fifty percent.",
    "You want me to help you find some treasure for a fifty percent share, as long as I don't tell anybody, and your reputation as an esteemed archaeologist with the Museum of Varrock remains intact, and nobody discovers you're actually just a treasure hunter?",
    "Well... I guess nobody is really going to lose out on anything, and we don't even know if there is any treasure... Aw, go on then. Count me in.",
    "This all sounds very immoral, and I don't want any part of your seedy little schemes.",
    "Well... I guess nobody is really going to lose out on anything, and we don't even know if there is any treasure... Aw, go on then. Count me in.",
    "I don't trust anything about your little scheme, including you! I want nothing to do with this!",
    "Hello there.",
    "Not yet...",
    "I'm here on an archaeological expedition for the Museum of Varrock. I believe there may be some interesting artefacts in the area.",
    "These bandits are hostile enough without me trying to rob them!",
    "Hello, I represent the Museum of Varrock, and I have reason to believe there may be some kinds of artefacts of historical significance in the nearby area...",
    "Please, if I can just have a few minutes of your time to ask some questions...?",
    "Why are all of the people here so hostile? You would think I was asking you for money instead of just for answers to a few questions...",
    "Actually, I'd be quite interested to hear what it is you have to say to excuse the attitude everybody in this village seems to have.",
    "So you're upset because of something that happened hundreds of years ago? Seems to me like maybe you should find some closure, and let the past go...",
    "I don't really care what your story is to be honest, there is no excuse for such rudeness or hostility. I have done nothing wrong to you, but everybody here treats me like I have committed some great crime against the village.",
    "What? Just because I entered your village?",
    "Whatever... No wonder all you loonies live out here in the desert by yourselves.",
    "I was wondering if you knew anything about some treasure somewhere around here? I have some evidence that there might be some kind of treasure hidden very close to this village...",
    "Do you know anything about some kind of fortress nearby? I have reason to believe there is, or at least used to be, some kind of fortress very close to here...",
    "Actually, there was nothing I really wanted to ask you about.",
    "As I understand it there's some kind of hidden treasure in these parts...",
    "No, Wait! Look, I'm here on an archaeological expedition for the Museum of Varrock. I am only here looking for artefacts...",
    "As I understand it there's some kind of hidden treasure in these parts...",
    "I heard a rumour about four diamonds or crystals...",
    "You've heard of them then?",
    "Certain things have led me to believe there may be some kind of ruined fortress around here...",
    "Tell me all you know about the Diamonds of Azzanadra.",
    "Hello, I represent the Museum of Varrock, and I have reason to believe there may be some kinds of artefacts of historical significance in the nearby area...",
    "Please, if I can just have a few minutes of your time to ask some questions...?",
    "So tell me... Did you ever hear of something called the Diamonds of Azzanadra?",
    "Uh...yeah... So anyway, you have heard of them?",
    "So... do you have any idea where they might be? I have a feeling they will be very valuable. Uh, valuable as historical artefacts I mean, obviously.",
    "How do you mean?",
    "Do you have any idea how I could track down these warriors somehow, then?",
    "Sure, what do you need?",
    "Okay, but what exactly do you need for this spell?",
    "Quick question: what kind of bones do you need?",
    "It's a slightly odd collection of ingredients, but I shouldn't have too much trouble getting those for you.",
    "No, please repeat those ingredients.",
    "Actually I don't feel like going on a shopping trip for you right now.",
    "I have some of the stuff you are looking for with me...",
    "So you can't be anymore specific about where to look for these warriors and their diamonds?",
    "So can you give me any help on where to find these warriors and their diamonds?",
    "I don't understand why there are six mirrors when there are only four diamonds...",
    "I can see a lot of foul looking smoke at the bottom of this well. I don't think breathing it in directly would be very good for my health.",
    "No, actually I was looking for something specific...",
    "I am looking for one of the Diamonds of Azzanadra. I have reason to believe it may be somewhere around here...",
    "How can I find this 'Damis' then?",
    "How much do you want for it?",
    "Where can I find this Laheeb?",
    "Al Kharid?",
    "Shantay Pass.",
    "The Bedabin camp.",
    "I don't. Sorry, please continue.",
    "Not a problem. I'll be back with your cross before you know it.",
    "Sounds like too much effort for me. I'll find this Damis by myself.",
    "No, not yet...",
    "Where can I find this Laheeb?",
    "Can't I just buy your ring?",
    "Is Damis near here, then?",
    "Where can I find this Damis again?",
    "Yes I have!",
    "Not yet...",
    "I lost that ring you gave me...",
    "M-me?",
    "I am here to worship the almighty Zamorak! Yay! Go Zamorak!",
    "I am here only to serve the mighty Drakan. Yup, Drakan, he's the man.",
    "I came here looking for you, oh mighty Malak, so that I might serve your glory!",
    "I am here to kill Lord Drakan, and every stinking one of his vampyre brood!",
    "I am looking for a special diamond... I have reason to believe it is somewhere in this vicinity, and it is probably in the possession of a warrior of Zamorak. I'm fairly sure it will have some kind of magical aura or something too. I don't suppose you've seen it, or know where it might be?",
    "Well, what kind of something? No offence, but you're not exactly the trustworthy type...",
    "Well... I can't see any drawback. Okay, I accept your offer. Now tell me what you know.",
    "I don't see exactly how this bargain benefits you... Why exactly do you want Dessous killed anyway?",
    "Yes... I think so...",
    "Where can I find this Dessous?",
    "And how exactly would I go about doing that?",
    "So what advice can you give me on killing Dessous?",
    "How would I go about doing that?",
    "Never mind, I will figure out all I need to know by myself.",
    "I don't trust you, or anything you say. I'm afraid I have to decline.",
    "Where can I find this Dessous?",
    "And how exactly would I go about doing that?",
    "How am I supposed to kill Dessous again?",
    "Hello.",
    "Are you an assistant to Count Draynor?",
    "I understand it that you can make me a 'sacrificial offering pot' if I bring you a bar of silver?",
    "It was from Malak in Canifis.",
    "I have a silver bar with me, I was wondering if you could make it into a 'sacrificial offering pot' for me?",
    "Hi, I was wondering, can you quickly bless this for me?",
    "Erm... yes...",
    "Oh, don't worry, it's not 'someones', it's my own!",
    "I found Ruantun in Draynors sewers. He made me this pot, now where can I get some fresh blood to fill it with? Ow!",
    "Well that's Dessous dead, but where is the Diamond he was supposed to have? If Malak lied to me about it, he is going to pay!",
    "Quit playing games with me, Malak. I want that diamond, and I want it now!",
    "Where is the Diamond of Blood? I know you have it!",
    "Hello there.",
    "Hey there little troll... Take this and dry those tears...",
    "Hello there.",
    "Why so sad, little troll?",
    "Bad man...?",
    "A diamond you say? Listen, I think I might be able to help your parents, but I need that Diamond in return.",
    "Absolutely. Don't worry kid, I'll get your parents back to you safe and sound.",
    "Sorry, I can't make promises like that, and I don't think I have the time to waste trying to defrost some stupid trolls.",
    "Not yet...",
    "Well, that must have been the 'bad man' that the troll kid was on about... His parents must be up ahead somwhere.",
    "I don't think I'll make much headway along that icy slope without some spiked boots...",
    "Can you put some spikes on my Climbing boots?",
    "Yes, but I still want them.",
    "Nothing, thanks.",
    "He must have been trying to protect his Diamond...",
    "Your son told me. That's why I rescued you, it is very important that I have that diamond...",
    "Wait... what? That stupid little troll kid had the diamond all along?",
    "Don't worry about it, just as long as I don't have to go back into that blizzard.",
    "I lost that diamond of Ice you gave me...",
    "Hello there.",
    "Not as such... Although I think I'm onto something of a promising lead... Did you ever hear of something called the Diamonds of Azzanadra?",
    "So you have heard of them?",
    "I wonder what that was all about?",
    "I have collected [number] of the Diamonds so far!",
    "I should make sure I have all four diamonds with me before speaking to Eblis again.",
    "So I have all four of these Diamonds of Azzanadra, now what?",
    "Battle?",
    "Uh... Sorry, I've never heard of them...",
    "I should go and let Eblis know what's happened here...",
    "Yes I have.",
    "Er... He didn't really mention you at all, but he did teach me some cool new magic spells.",
    "Hello again.",
    "Hello there.",
    "Well... not as such, but I unleashed a powerful demon from its tomb in return for unbelievable magical power.",
    "Not as such, no. Sorry about that.",
    "I was wondering... As you are a big famous archaeologist, maybe you could spare the tie to tell me a couple of tales of your exploits?",
    "Solid gold, huh? Wow.",
    "What did you do?",
    "Yes?",
    "What then?",
    "SO WHAT DID YOU DO?!?!",
    "So... How exactly did you get into this line of work anyway? It seems an odd choice of career for a man like yourself.",
    "No, what?",
    "Um... Yes, yes I can.",
    "Nice hat!",
    "Well, I'll see you again sometime maybe. Sorry I couldn't get you any treasure...",
    "Why did you come back up here?",
    "What are you doing up here?"
  ],
  "Archaeologist": [
    "Howdy stranger. What brings you out to these parts?",
    "Well, that's where you'd be wrong. I work for the Archaeological Society of Varrock, and have been excavating around here recently. Was there something you specifically wanted?",
    "Well, it's funny you should say that. I'm not sure if I would really call it a quest as such, but I found this ancient stone tablet in one of my excavations, and it would really help me out if you could go and take it back to the digsite for me and get it examined. It's very old, and I don't recognise any of the inscriptions on it.",
    "You don't recognize me??? I am the world famous Asgarnia Smith, Archaeologist extraordinaire! I am the one who discovered the long forgotten Temple of Ikov! The one who unearthed the strange trap filled arena in Brimhaven! I'm the leading archaeological expert of our time! I was voted archaeologist of the year four years running by the Varrock Herald! Are you REALLY sure you've never heard of me?",
    "Well then, I'm confused. Why did you come over and speak to me if you don't know who I am? What do you want?",
    "His name's Terry Balando. Give it to nobody but him. I'm sorry, I can't entrust you with the actual tablet I found, it is far too valuable to give away, but I took these etchings - they should be enough for him to make a preliminary translation on. Come back and let me know what he says. I would hate to waste my time excavating anything that isn't worth my time as a world famous archaeologist!",
    "So what did Terry Balando say about those etchings? Did he give you a translation for me?",
    "Well what are you waiting for? A written invitation? All I want you to do is take those etchings up to the digsite for me!",
    "So what did Terry Balando say about those etchings? Did he give you a translation for me?",
    "Did you take a read of this? It will do you good to understand how this profession works. Here, have a read.",
    "Excellent. Just give me a moment to read this, and talk to me again in a second.",
    "Hmmm, interesting. It seems to me like there's some kind of treasure hidden out in the desert. So what do you say? Fancy being a treasure hunter like me?",
    "Yeeees... An archaeologist. It's all this hot sun getting to me I think. Well anyway, let's just assume there is a treasure hidden in the desert somewhere, and let's just say for the sake of argument that maybe if I found a big stash of gold and treasure I wouldn't necessarily just hand it all over to the Museum of Varrock. Let's also say, purely hypothetically, that if there were such a big stash of treasure and someone were to help me find it, then that hypothetical person might be entitled to, oh, let's say a purely for the sake of argument thirty percent split...",
    "That's right! A purely for the sake of argument fifty-fifty split on this hypothetical treasure, should it exist. Do you see where I'm going with this?",
    "Uh... yes, but the way you said it makes it sound like I'm doing something wrong... So what do you say? Partners?",
    "Good boy/girl! Well, if we split up we'll be able to find treasure quicker. I'll continue searching around here in this Bedabin Camp, you head due South to the Bandit Village. If either of us find anything, we'll come find each other and say what, okay? You head due South, see what you can find out about this tablet.",
    "Aw, c'mon, cut me a break here man/lady! Look, nobody is really getting hurt right? This treasure is either going to lie around in some underground ruin, or lie around in some museum for people to look at!",
    "It makes sense for the people to go all the risk to get a little payback for it, right? Besides, anything of real historical value we can hand over to the museum - we'll just keep the cash for ourselves!",
    "C'mon... what do you say? Partners?",
    "Good boy/girl! Well, if we split up we'll be able to find treasure quicker. I'll continue searching around here in this Bedabin Camp, you head due South to the Bandit Village. If either of us find anything, we'll come find each other and say what, okay? You head due South, see what you can find out about this tablet.",
    "Eh, you'll come running back when you realise just how much money we could be talking here. I'll see you when you come crawling back, begging to be cut in on the deal.",
    "Hello again. You find any signs of that treasure yet?",
    "Well, head south to that bandit camp. I bet if there's anything out here, they'll know about it. Don't let on it might be valuable though! Those thieves will steal it as soon as look at you!",
    "Hello again. You find any signs of that treasure yet?",
    "Diamonds of Azzanadra? That sounds very promising indeed!",
    "Nope, never heard of them before, but you said diamonds! Diamonds are always promising!",
    "Hello again. You find any signs of that treasure yet?",
    "So... no gold then?",
    "Aw... I was hoping to go abroad on holiday this year. Maybe I'll go check out Karamja next, I hear there's treasure to be found there...",
    "Hey, sure thing kid! Well, this one time I found this spooky old temple in the middle of the jungle. The entrance was hidden from sight by all these vines and stuff, and it was full of zombies and crazy tribesmen and stuff. That wasn't the worst thing though! There were all these crazy traps that were hidden around the place too! Well anyway, I found the secret entrance, fought my way in through the zombies and tribesmen, and came to a big pedestal with a statue of solid gold sat on top of it!",
    "That's right! It was a cunning trap though! As soon as I picked up the statue, a trapdoor opened up underneath me, and I fell into a darkened room, full of bones, and the biggest meanest tribesman you ever did see! Huge he was, and real ugly looking! He had this huge sword too, and he came running towards me screaming something in some language I didn't understand!",
    "Well, while he was screaming at me, and swinging his sword around in front of me, trying to intimidate me before attacking, I cooly and calmly...",
    "All the while, knowing that if I died in this spot nobody would even know where I was...",
    "I knew, if this tribesman killed me, that would be the end of Asgarnia Smith, and all of his treasure hunting...",
    "Well, while he was screaming and waving his sword around, I stood behind a nearby stalactite, then shot him with my shortbow. And that was how I recovered the Golden Monkey of Tee-Ta-Toh.",
    "Thinking of joining your pal Asgarnia in the wonderful world of treasure hun- um, archaeology, huh? Well, it all started the day I was fishing in Catherby, funnily enough. Ah yes, I remember it well... I was just sat there, hoping to catch a bass or two, when I made the most amazing discovery! In my fishing nets, I had found an ancient casket, marred and worn by centuries underwater! With trembling hands, I slowly and cautiously opened it, wondering what ancient secret may have been kept inside... What valuable heirloom may have been dredged up by my nets that had not decayed underwater long ago... And you know what I found inside?",
    "I found 320 coins! Just like that! Just by fishing I had found 320 coins! 320 coins! Can you believe it?",
    "Well, it might not seem much to us now kid, but back then, it was a revelation! Why waste my time fishing when there were secret treasures from long ago hidden around the world? I immediately applied to the Museum of Varrock as a field agent, and the rest is history!",
    "Hey, thanks kid. Looking snazzy is an important part of being a treasure hunter!",
    "Ah, don't sweat it kid. I'll be honest with ya - I'm already rich many times over, and its more the kicks of being a treasure hunter I do it for than the actual cash!"
  ],
  "Archaeological expert": [
    "That's right, who wants to know...? Ah yes, I recognize you! You're the fellow/lass who found that strange artefact about Zaros for the museum, aren't you? What can I do for you now?",
    "You spoke to the legendary Asgarnia Smith??? Quickly, let me see what he had to give you! He is always at the forefront of archaeological breakthroughs!",
    "This...this is fascinating! These cuneiforms seem to predate even the settlement we are excavating here... Yes, yes, this is most interesting indeed!",
    "Well, I am not familiar with this particular language, but the similarities inherent in the pictograph seem to show a prevalent trend towards a syllabary consistent with the phonemes we have discovered in this excavation!",
    "Well, unfortunately this is the only example of this particular language I have ever seen, but I might be able to make a rough translation, of sorts... It might be slightly obscure on the finer details, but it should be good enough to understand the rough meaning of what was originally written. Please, just wait a moment. I will write up what I can translate into a journal for you. Then you can take it back to Asgarnia, I think he will be extremely interested in the translation!",
    "There you go, that book contains the sum of my translating ability. If you would be so kind as to take that back to Asgarnia, I think it will reassure him that he is on the right track for a find of great archaeological importance!",
    "What can I say? It's a skill I picked up through my many years of taking field notes!",
    "Hello again. Was that translation any use to Asgarnia?",
    "Whyever not? You're the strangest delivery boy/girl I've ever met!"
  ],
  "Bandit": [
    "What do you want lad/lass?",
    "You are a crazy man/woman. The only thing you will find out here in the desert is your death.",
    "I have no interest in the world that betrayed my people. Search where you will, you will find nothing.",
    "The gods forsake us, and drove us to this place. Anything of worth has been long gone.",
    "I'm sure there are many secrets buried beneath the sands here. The thing about this being a desert, is that they're likely to stay that way.",
    "Do I look like I care who you are or where you came from?",
    "So you're the one who freed Azzanadra from his prison? Thank you, kind sir/lady!"
  ],
  "Eblis": [
    "Ah yes. The only time people care about our existence is when they think they have something to gain from us. I have nothing to say to you. You and your kind are not welcome here.",
    "(sigh) I suppose I can spare you that. What do you wish to know about?",
    "It is a long story, and I doubt you have much interest in hearing it. Your sort never are, you just take what you can of ours, and then abandon us once more to the desert.",
    "Ah, it all begun many generations ago, when our ancestors were the proud rulers of these lands... My ancestors lived far to the North of here, and our lands stretched from the sea in the East to the river Lum, and the mountain of ice. From coast to coast, North to South, our domain was absolute. Our god was kind to us, and blessed us with prosperity and happiness, and in return we were merciless to his enemies wherever we found them. Then came the betrayal. Our god was banished, leaving us helpless to our fates. Without his protection, we were forced to fend for ourselves once more, against the enemies that sought to destroy us through their petty jealousies. But we did not succumb without fighting! The spiteful Saradomin and pathetic Zamorak warred with each other, but the hatred they had for each other was as nothing to the hatred they held towards us! With each battle they waged, we lost more and more land, unable to fight on all fronts, and were pushed further and further South into this gods-forsaken desert. Our greatest hero, Azzanadra, was finally trapped in a strange stone structure to the South of here, and bound within by terrible powers... And with that our lands, our homes, our very lives were stolen from us! Too weak to reclaim what was rightfully ours, we made our homes here, knowing that someday Azzanadra will return with his magnificent power, and bring us back to our former glory...",
    "The insults heaped upon my race will never be forgotten, will never be forgiven and will never again be overlooked. Someday, a harsh wind will blow upon this land, uncovering the wrongs of the past, and we will get back what is rightfully ours. Until such a day we will bide our time here, and will always be ready with our blades for our righteous vengeance.",
    "That is because, from our point of view, you have.",
    "You have no right to be here! You have no right to the life you have, for it was taken at our expense!",
    "If I knew of any treasure I would not choose to spend my life in this gods-forsaken desert.",
    "Nobody would build anything in this wasteland unless they were forced to, to survive. I know of no fortress, I know of no reason why anyone would ever bother doing anything out here in the desert.",
    "Yes, it is exactly like your sort to waste my time in such a way.",
    "Ah yes. The only time people care about our existence is when they think they have something to gain from us. I have nothing to say to you. You and your kind are not welcome here.",
    "(sigh) I suppose I can spare you that. What do you wish to know about?",
    "This is the treasure which you seek??? Please accept my apologies noble sir/madam! I thought you were but some opportunistic thief, looking to steal what heritage we have left! Now I see that you are in fact a brave adventurer, looking to restore our glories back upon us!",
    "Heard of them? Of course I have heard of them! They are the legacy of our greatest ever hero!",
    "They were stolen by warriors of the false god Zamorak generations ago. When you find the warriors, you will find the diamonds. I suspect they will not willingly part with such objects of power however. Beware too, for these warriors are very powerful; they have taken the powers of the diamonds into themselves!",
    "Each diamond has an elemental quality... There is the Diamond of Blood, the Diamond of Ice, the Diamond of Smoke and the Diamond of Shadow. You should expect the warriors to have taken some aspect of these diamonds as their own...",
    "There is an ancient spell I know of that may spy upon such power... But it will require a few ingredients for it to work. Should you be willing to get these ingredients for me, I will be able to locate the rough area where each of these warriors has taken refuge. The spell is imprecise, but it should help you get on the right track in your search. Is your desire for our freedom strong enough? Will you gather the ingredients for this spell for me?",
    "For this spell, I will need to make some scrying glasses. I will need enough so that we can view the realm in its entirety. When enchanted, the scrying glass will be able to let us view any area that has been influenced by the presence of the Diamonds of Azzanadra.",
    "Well, six scrying glasses should be sufficient. For each scrying glass, I will need two magic logs, a steel bar and some molten glass. This makes a total of 12 magic logs, 6 pieces of molten glass, and 6 steel bars. In addition, for the actual spell to enchant the glasses, I will require one set of normal bones, some ash, some charcoal and a single blood rune. Do you understand me, adventurer?",
    "Standard bones. Other types of bones are of no use to me in this spell.",
    "As you wish. I should have known not to get my hopes up that our long cursed life may soon be at an end...",
    "Before I can complete the spell I will still need the following items: [list of items not yet given]",
    "Thank you, pass over the ingredients so that I may begin working on the spell.",
    "Before I can complete the spell I will still need the following items: [list of items not yet given]",
    "Excellent! Those are all the ingredients I need to create the scrying glasses. I will find a suitable spot in the desert to the East of here, and set them up. When you are ready to begin your search, please come and find me there, I will show you how to utilise the mirrors to find the diamonds.",
    "Meet me again in the desert East of here, I will use these ingredients to create a scrying glass for you.",
    "Ah, so you got here at last. As you may have noticed, I have made the mirrors for the spell, and cast the enchantment upon them. By simply looking into each mirror, you will be able to see the area where the trace magics from the Diamonds of Azzanadra are emanating from. Unfortunately, I cannot narrow the search closer with this kind of spell, but if you search the areas shown to you, you may be able to find some clues leading you to the evil warriors of Zamorak who stole the diamonds in the first place.",
    "I'm afraid not, other than the direction that the mirror is facing will be approximately the direction you will need to head in. Make sure to come and speak to me when you have retrieved all four diamonds.",
    "No, the magic used in this spell is powerful, but inaccurate. The direction the scrying glass faces is roughly the direction you will find the warrior, but I'm afraid I can't be any more help than that.",
    "As I say, the enchantment is very inaccurate. I can only focus upon the aura the diamonds have left behind them, so any place where the Diamonds were present for a significant period of time will still be shown - such as the Bandit Camp where I make my home. My apologies, but magic is an inaccurate art in many respects. Don't forget to come back here when you have collected all four diamonds.",
    "That is a good start... but Azzanadra is still imprisoned!",
    "Azzanadra was our greatest ever hero! He was unkillable, and the cowardly traitors who stole our lands did not know what to do with him, for his hatred for them was as strong as his magics. In the end, they cast a spell upon him, to trap him in the stone structure to the South of here. They stole his very life force, the essence of his power, and trapped it within four crystals - the very same Four Diamonds which you have now recovered from the brigands who stole from us. The four pillars surrounding the structure are keeping the containment spell intact. By placing a diamond into each, you will breach the magical defenses and begin to restore Azzanadra's power, and be able to enter the structure. Go, place the diamonds, and free my lord Azzanadra! The path will be hard, for his prison is full of traps and danger to prevent his rescue, but he will reward you beyond your wildest dreams when freed! Quickly... After all these centuries, Lord Azzanadra is nearly free! You must spare no time, place the Diamonds upon the pillars and enter the pyramid so that you may free him!",
    "So have you spoken to my Lord Azzanadra yet?",
    "And what words did he have for his followers?",
    "It is understandable perhaps... His poor mind must be addled after all of those years of confinement, he would not willingly ignore his followers... Anyway, if he has taught you our ancient magics, you may be interested in purchasing an ancient heirloom that was passed down to me. My ancestor fought in the ancient battles using the magic of our god. This heirloom will improve the effects of your spell-casting. Normally I could not bear to part with such a priceless relic, but for your help in freeing my Lord Azzanadra, I will be prepared to sell it to you for a mere 80,000 gold. Are you interested?",
    "Take care of it, it is the only heirloom from those times I possess, although rumour has it many of our ancient warriors were buried with identical weapons so that they could continue to fight for my Lord in their deaths.",
    "Greetings. I await the return of my Lord Azzanadra and of our god. I do not know why, but I feel this spot has some significance..."
  ],
  "Bartender": [
    "If you're not buying anything, I have nothing to say to you.",
    "Look around pal/lady. Does it looks like there's any treasure near here? If I were you I'd get lost before someone takes a dislike to your face and removes it for you.",
    "What's that? You wanna buy a beer? It'll cost ya 650 coins.",
    "There you go. Now get out, we don't like your sort around here.",
    "Get out of my bar then! We don't like your sort around here!",
    "You've had your drink, now get out of here. I have nothing to say to the-",
    "Oh really? Our inheritance is only sand and death. What do you expect to find out here in this desert forsaken by the gods?",
    "Look around pal/lady. Does it looks like there's any treasure near here? If I were you I'd get lost before someone takes a dislike to your face and removes it for you.",
    "The four diamonds of Azzanadra? How did you hear about them?",
    "It's just a fairy tale for children. Maybe one of the village elders might know more, but it's not really something I care about. Now get out of here, your sort isn't welcome in my bar.",
    "Doubt it. What in the world would someone need to guard against in the middle of this desert? A bad attack of sand? I think you're on the wrong track, mister/miss so-called archaeologist.",
    "Not that I think it's any of your business, but when I was a child I remember hearing the legend. I don't recall it particularly well, other than they are said to contain an incredible power. If you really want to hear more about it you'd be best off finding someone who cares about the past, and the history of this area, and stop bothering me.",
    "So you're the fella/lass that freed Azzanadra, huh? Fair play to ya. What will you have?",
    "Didn't feel like a drink after all, huh? Well, stop by anytime, hero."
  ],
  "Fareed": [
    "You dare trespass in my realm?"
  ],
  "Rasolo": [
    "Greetings friend. I am Rasolo, the famous merchant. Would you care to see my wares?",
    "Hmmmm? And what would that be?",
    "Ahhh... The Shadow Diamond. I know the object of which you speak. It is guarded by a fearsome warrior known as Damis, they say, who lives in the shadows, invisible to prying eyes...",
    "Well now... perhaps we can help each other out here. I have in my possession a small trinket, a ring, that allows its wearer to see the unseen...",
    "Ah, but it is not for sale... As such... I am offering to trade it for an item that was rightfully mine, but that was stolen by a bandit named Laheeb. The item in question is a gilded cross, that has some sentimental value to myself. I wish for you to recover this item for me, and I will happily let you have my ring of visibility.",
    "Well, as a travelling merchant I have roamed these lands for many years... To the far east of here there is an area that is dry, and barren like the desert... It is called...",
    "...Yes, Al Kharid. Now, to the south of Al Kharid there is a passageway, it is called the...",
    "...Yes. I didn't realise you had travelled there yourself. Anyway, when you have gone through the Shantay Pass, you will find yourself in a hostile desert... You will need to bring water with you to keep your life. Now, to the south-west of this pass, you will find a small village...",
    "If you know where Laheeb lives, why did you ask me?",
    "Well, okay then. Anyway, south of this encampment there is an area where few have ever been... It is a village of murderous bandits, and treacherous thieves... This is where Laheeb makes his home. He will have hidden his stolen treasure somewhere in that village. I am sure of it. When you find his loot, you will find my gilded cross. Return it to me, and I will reward you with my ring of visibility, so that you may find Damis. Does this seem fair to you?",
    "As you wish.",
    "Have you retrieved my gilded cross for me yet?",
    "Well what seems to be the problem?",
    "No, it is not for sale. Some things are more important than money, and the return of my gilded cross is one of them.",
    "You would be surprised to know just how close he is...",
    "I have already told you, he is of the shadows. You will see neither him nor his lair without the aid of magic.",
    "Have you retrieved my gilded cross for me yet?",
    "Excellent, excellent. Here, take this ring. While you wear it, you will be able to see the things that live in shadows... And you will be able to find the entrance to Damis' lair.",
    "So how goes your quest? Did you managed to find the Diamond you were looking for yet?",
    "Well, his lair is very close to here. I suggest you look around for it.",
    "Then by all means, take another. Only a foolish merchant would give away his only stock!"
  ],
  "Conversation continues from": [
    "\"Well, as a travelling merchant I have roamed these lands for many years...\"",
    "\"Well now... perhaps we can help each other out here.\""
  ],
  "You... do not be... long in this... place... Turn... back now, or... prepare... to meet your... doom...": [
    "*Damis spawns"
  ],
  "Damis": [
    "You should... have listened to me!",
    "Now I show... you... my true... power!",
    "Your pathetic skill won't help you now!",
    "You are no match for my power!",
    "You will regret ever coming here!",
    "I will crush you utterly!",
    "I... am... invincible!",
    "Taste my blade and feel my wrath!"
  ],
  "Roavar": [
    "M-my lord Malak, what brings you here?",
    "Y-yes of course, sire, but surely your graciousness is too important to perform such menial duties such as this himself? Is this not Gadderanks job, your most high beneficence?",
    "Of course my lord, I meant no disrespect.",
    "Of course my lord, I trust you will find it all there and in good order."
  ],
  "Malak": [
    "Hmm? You know very well that your tithe is due, Roavar. I am here to collect it this time.",
    "Indeed it is Roavar, but I cannot find that incompetent fool. And assuming you are not the one who wishes to tell Lord Drakan that his tithe has not been collected, I saw fit to take on the duty myself this time.",
    "So you have the tithe ready for me?",
    "Hmmm. Well, for your sake you had better hope that indeed it is. The mood I am in for having to come to this wolfen cesspit means any shortfall is coming from you directly. Then again... perhaps this was not a total waste of my time after all. You there!",
    "Yes, you. Your bearing suggest you are not one of the usual peasants, and your stench suggests you are not one of these filthy wolfen folk. Come here, I would like to know what you are doing in these lands.",
    "A human, eh? (if you are wearing the Ring of Charos (a)) Don't think that silly little ring of yours will fool me. Give me one good reason why I should not just take you to Lord Drakan now. You had better make it a good one too, or you will not survive the night, I'll wager.",
    "I see. You are a moron. You have probably settled right in with the rest of the idiots in this pathetic excuse for a village. Unfortunately for you, that is not a good enough reason to explain your presence here. Now tell me the reason for your coming here, or I will ensure you suffer a horrible fate indeed.",
    "I see. I would perhaps be more inclined to believe you if I could not smell the death blood of his brother Draynor upon you. What are your real intentions here?",
    "Please. Do not think that I am so vain and foolish as to allow you to avoid my question with such obvious sycophancy. Now tell me the reason behind your being here, or I will ensure that you suffer.",
    "Hah! Most entertaining, human! Now tell me the reason you are here, or we shall soon see who will be killing whom.",
    "Interesting... Well perhaps we can come to a little... arrangement, human. I may have information that may assist you, but you in turn will have to do something for me. What do you say? Do you think we could come to some form of agreement?",
    "Ah, you have a healthy sense of paranoia, I see. It is not a particularly unfair request on my part... All I ask is that you ensure that the current owner of the diamond is killed. For my part, I will let you know his whereabouts, and how exactly to kill him. When he is dead, you may take the diamond from his corpse and do with it what you will. I have no interest in such baubles. So what say you? A life for a diamond. As a mark of good faith, I will give you some information free: The current owner of this diamond is named Dessous.",
    "What I know? Hah! After you have been alive for as long as I, the things I know are enough to fill a library. I'm afraid you will need to be a little more specific.",
    "That is an impertinent question to demand from myself. However, if it will help seal our deal, I will let you know some of the details. As you may or may not know, myself and my blood kin are the rulers of this land, all serving under Lord Drakan. However, we tend not to die of old age or similar natural causes, which means that to gain another Lords title or land, there often need to be... Unnatural causes of death invovled. Let us just say, that Dessous is in control of some land that I myself would like some say in, and that is not in my interest to be seen to be responsible for the death of a fellow Lord. It would however be extremely advantageous to myself should some random human adventurer take it upon themself to remove this rival for me... Do you understand?",
    "Good, we both understand each other then. We will both benefit from the death of Dessous.",
    "He currently resides in a graveyard to the South-East of here. You will not be able to move the gravestone which he lies beneath however, you will need to find some way to lure him out from his tomb.",
    "Well, he is a vampyre, so fresh blood would almost certainly entice him out. However, even though he is a frail and decrepit example of our species, he will be able to kill a weakling human such as yourself extremely easily. Having him in a bloodlust as he does so, will not make your job any easier.",
    "As ancient and weak as Dessous is, he is still more than a match for the likes of you. That is, assuming you were to fight him fairly. My proposal would be for you to even the odds up a little bit...",
    "Well, my plan would be as follows. First, take a silver bar to the man living in the sewers in Draynor. He was an assistant to Count Draynor in some of his... more interesting experiments many years past. Tell him you need a sacrificial offering pot. He will know what you speak of, it is a unique type of container used in various ancient vampyric ceremonies. Then take that pot to Entrana, and get it blessed by the Head Monk. This will lend the pot some holy power. If you then bring that silver pot back to me, I will provide you with some fresh blood, to put into it. To that pot of blood, you will add some crushed garlic, and some spice to disguise the smell. Use that pot of blood upon Dessous' tomb, and he will be unable to resist rising and drinking from it. The combination of garlic, silver, and blessings from Saradomin will act upon him as a poison, and allow you to kill him. This is just my suggestion of course, you may ignore it if you wish, although I offer no guarantees of your ability to defeat him otherwise. Was there anything else you wanted?",
    "As you wish. Come and see me when you have managed to kill Dessous.",
    "As you wish human. I doubt anybody near here knows of the diamond you seek, however. If you wish to claim it as your own, you have little choice but to accept my bargain. I will wait here until such time as you change your mind.",
    "Why are you still here? I notice Dessous still lives.",
    "He currently resides in a graveyard to the South-East of here. You will not be able to move the gravestone which he lies beneath however, you will need to find some way to lure him out from his tomb.",
    "Come and see me when you have prepared a silver ritual pot in the manner I have told you. I will ensure that you get some fresh blood that you may taint with garlic and spices, to lure our Dessous.",
    "Take a silver bar to the man in the Draynor sewers. He will fashion a ritualistic pot for you, which you should then take to Entrana and get blessed.",
    "Ah, the wandering hero returns! I take it you have dispatched poor old Dessous for me?",
    "Do not take that tone of voice with me, meat. You should be thankful I have allowed you your life. Here, take your precious little bauble. I will take that silver pot from you as well, humans are not meant to possess such artefacts. Now get out of my sight, our deal is complete, and if I see you here again I will not hesitate to take you to Lord Drakan. He will be extremely pleased to meet the murderer of poor Dessous, I suspect.",
    "Be lucky I have let you live, meat. Our deal is done, I wish no further dealing with you.",
    "Do not take that tone of voice with me, meat. Here, take your bauble. I have no use for it."
  ],
  "Ruantun": [
    "You ssshould not be down here...",
    "I usssed to have that honour... Why do you ssseek me?",
    "And where did you hear thisss?",
    "Ah, I sssee... Yesss, I know how to make sssuch an item... It has been many yearsss sssince I have needed to however... I is not my wisssh to quessstion your desssire for sssuch an item. I wasss merely sssurprisssed that one sssuch as you would make sssuch a requessst... I will happily make you thisss pot, but you mussst bring me a bar of sssilver... Alasss, I can no longer collect my own ingredientsss, and mussst remain here...",
    "Yesss, of courssse... There you are, put it to good usssse..."
  ],
  "High Priest": [
    "Many greetings. Welcome to our fair island.",
    "A somewhat strange request, but I see no harm in it. There you go. May Saradomin walk with you.",
    "A somewhat strange request, but I see no harm in... Wait a moment... is that BLOOD?",
    "Why do you want me to bless a pot full of someone's blood???",
    "I... see... Well it is an unusual thing, but I see no harm in it. Take this, and walk in peace with Saradomin."
  ],
  "Dessous jumps out and attacks the player.": [
    "When Dessous is defeated:"
  ],
  "Troll child": [
    "Waaaaaaa!",
    "WAAAAAAAA!",
    "(sniff)",
    "-sniff- H-hello there.",
    "It was the bad man! He hurt my mommy and daddy! He made them all freezey!",
    "He said it was because they stole his diamond! But they never did! They found it, and didn't know who it belonged to! My mommy always told me stealing is wrong, they would never steal from someone! Then he did some wavey hand thing and my mommy and daddy got frozified!",
    "-sniff- I don't think they really wanted it anyway, they would have given it back to the bad man if he'd asked before freezifying them... I give you my promise mister/lady that if you unfreeze my mommy and daddy, you can have the stupid diamond! Do we have a deal?",
    "Waaaaaaaa!",
    "You didn't free my mommy and daddy yet?",
    "Please try harder! I love my mommy and daddy!",
    "Oh, I'm sorry. My mommy says that we ice trolls are so cold we can freeze the air around us when we are upset or angry. I'm afraid I must have frozen those gates too much when I was crying, but since you told me you are going to help rescue my mommy and daddy you should be able to squeeze through the bars. You are much smaller than most trolls, it should be easy for you!",
    "Mommy! Daddy! You're free!",
    "RAW MACKEREL! YUMMY! Here ya go mister/lady! Thanks for getting my mom and dad away from the bad man!",
    "That's okay, it blew back on an icy wind... It's almost like it wants to stay here! Here, take it back, you've earned it."
  ],
  "Ice troll": [
    "Hur hur hur! Well look here, a puny fleshy human! You should beware of the icy wind that runs through this valley, it will bring a fleshy like you to a cold end indeed!"
  ],
  "Kamil": [
    "Sallamakar Ro! Sallamakar Ro! Sallamakar Ro! Sallamakar Ro! Sallamakar Ro!"
  ],
  "Dunstan": [
    "For you, no problem. You do realise you can only use the climbing boots right now? The spiked boots can only be used in the icelands but no-one's been able to get there for years!",
    "Anything else before I get on with my work?",
    "All right. Speak to you later then."
  ],
  "Troll father": [
    "Oh thank you! It was really cold in there! But please, you must free my wife as well! Our son is depending on us!",
    "Phew! Am I glad to be out of that big ice cube! Are you okay too darling?",
    "You mean that diamond I found the other day belonged to him? But why didn't he just ask for it back? It's not like I really want it or anything! And how did you know we had that diamond anyway, fleshy?",
    "Yes, but he certainly inherited his Dad's smarts! If he'd told this fleshy that he had the Diamond and not us, we might never have been rescued!",
    "Now, now dear, all's well that ends well. We've been freed and this fleshy has certainly earned himself/herself that diamond. Let's get out of this terrible place and see our son!",
    "That's right son, and it's all thanks to this brave adventurer here. Now, make sure you hand over that diamond he/she was looking for. It has been nothing but trouble for us, let's just get back to our cave and have dinner.",
    "I like the view!"
  ],
  "Troll mother": [
    "Wow, thanks for breaking me out of that ice! But please, my husband is still trapped in there!",
    "Yes, I thought we were done for! Why ever did that nasty Kamil freeze us up there anyway?",
    "Ooohhhhh, my poor baby! He must have been so worried about us...",
    "Don't you talk about my baby like that!",
    "That's right son, it's your favorite tonight too! A big plate of raw mackerel!",
    "I think I lost an ear ring up here earlier!"
  ],
  "Stranger": [
    "Hand over the Diamond of [element], or suffer!"
  ],
  "Azzanadra": [
    "I knew they could not trap me here for long! Well done, soldier, tell me, how goes the battle?",
    "You do not know of the battle? More time must have passed than I had thought... Tell me, what news of great Paddewwa? Do the shining spires of Lassar still stand? And what of glorious Annakarl? The fortress is still intact?",
    "No! My lord... What has become of you? I cannot hear your voice in my mind anymore! My thanks to you brave warrior for your help in freeing me from this accursed tomb, but it seems I have much to do to make amends. If the shining cities no longer stand, then it means that we must have failed my lord... How long have I been trapped here? Master... Have you truly been dispatched from this world? Warrior, for your efforts in freeing me, I offer you the gift of knowledge. I bestow upon you the ancient magicks, taught me by my Lord before his disappearance, may you use them well in battle for our people! They will replace the knowledge you previously had, but you may switch between them by praying at the altar in this room at any time. I trust that we shall meet again adventurer, I offer you the blessings of myself and my master in all of your endeavours! Now, I must leave you, for there must be some trace of my master's power left somewhere. Feel free to use the portal I shall create to return here easily in the future!"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Desert_Treasure?oldid=35930646’"
  ]
}