{
  "Player": [
    "How strange. A portal to a snow covered land, I've never seen this before!",
    "How strange. A portal to a snow covered land, I've never seen this before!",
    "Hey! You're a little young to be wandering around here on your own, aren't you? There are big wolves roaming.",
    "Ahhhhhh, you're a scary one! Now come on, where are your parents? It's not safe to be here alone.",
    "Actually, she looks like she can handle herself.",
    "Oh no, she ran straight into the portal. A little child could die out there, I need to save her.",
    "What the...",
    "That was uncalled for!",
    "Cheap shot!",
    "Ooof!",
    "*thud*",
    "Bah!",
    "Ha, sure it was.",
    "You're really finding this amusing aren't you?",
    "What? Did you not just hear that roar! That could be a giant monster? Or... A big abominable snowman. Or a giant terrifying tree monster that uses vines to ensnare it's prey...[sic] ...or big demons that look like mummies but actually have claws longer than their limbs! I should probably do the right thing and make sure that the monster doesn't eat her...",
    "...there could be wolves out here...[sic] ...or big bears...",
    "...or a cute little cabin in the middle of the woods?",
    "I think I'll take a look around some more.",
    "Well well well, what do we have here.[sic] I'm sure I heard someone shouting from down there. Timmy? Hmmm, must just be the wind.",
    "Yellow snow... Tastes like lemon.",
    "Knock knock. Hmmm... Rather than just saying it out loud maybe I should just knock.",
    "Player.",
    "To go on an adventure.",
    "I want to build a snowman!",
    "Trick or treat!",
    "Okay... bye...",
    "On second thought, kicking down some poor soul's door in the middle of this cold and vast frozen wasteland may not be the nicest thing to do.",
    "Player.",
    "Thank you, it was rather chilly out there. I just wanted to check that gir...",
    "No! YOU ATE HER! YOU MONSTERS! PREPARE TO DIE!",
    "Oh! You live here?",
    "Perhaps I'd be able to help out?",
    "YOU'VE CAPTURED A HUMAN GIRL!",
    "But you've got a little girl? Where are her parents?",
    "Hmmm, a likely story for kidnappers!",
    "What is this journey and festival like?",
    "Would you be willing to accept my help?",
    "Yes, I'd love to help you.",
    "On second thoughts, I've got other things I could be doing.",
    "You're a yeti?",
    "No I'm human!",
    "...",
    "What is this festival?",
    "To celebrate what?",
    "But you must be celebrating something?",
    "Right, I'll believe you.[sic]",
    "Not yet.",
    "Nothing, I'll go do it now.",
    "I'M JUST SO EXCITED MYSELF. When we get there, I'm having two snowcones. No... THREE snowcones.",
    "My Thieving level is not high enough to steal from children.",
    "On second thought, there could be something far worse than a yeti hiding under there.",
    "I wonder if this would take me back to Gielinor only to find almost no time has passed at all.",
    "Turn that frown upside down!",
    "Violet?",
    "I've got some news for you.",
    "No. We've agreed that we can go t... Wait, what are pickled pink pancakes?",
    "Ah okay! We'll have to try some when we go to... We're going to the yeti festival!",
    "Well, the grown ups were talking and we agreed that we can help you get there this year! You're going! So pack up some warm clothes and anything you think you'll need and we'll be on our way.",
    "Really!",
    "Really really!",
    "Everything? It looks like you've got an awful lot of stuff here. Let's only take essentials shall we?",
    "If it makes you happy, but now let's get some warm clothes.",
    "Oh wow, you came up with this game all by yourself?",
    "Let's do it. How do I play?",
    "Sounds awesome, let's start.",
    "Ummm. Thought it was the first letter?",
    "Nope, can I have the letter again please?",
    "A delightful game for all the family!",
    "I've already got something. I should check with Violet if it's the right item.",
    "There is an old price on these. Was 1000 GP! Now 70k!",
    "It's an empty jar.",
    "IT'S SO FLUFFY!",
    "The corner is bent at page 3... 'To begin with, you'll be learning how to turn mice into golden goblets'.",
    "An Ironman by the way[sic]",
    "A pair of mittens. What more can I investigate.[sic]",
    "Cosy.",
    "Doesn't smell too bad.",
    "Cute.",
    "It contains Precise 10 and Equilibrium 6!",
    "It's a gorgeous wooden carving.",
    "Classic.",
    "Are you ready?",
    "Are you not bringing anything with you?",
    "Right... Well I'm ready whenever you both are.[sic]",
    "I'll pass, I've just eaten.",
    "Pickled... pink... pancakes?",
    "You ready Violet?",
    "Violet and Trevor seem ready to set out; I shouldn't keep them waiting.",
    "I think I'll take a look around some more.",
    "Well, the only place the path appears to go is through there.",
    "Yes, seems this is where it leads. Let's go!",
    "It's a little dark yes bu...",
    "Let's work together to find a way to light up the way.",
    "Probably not fire; besides there is nothing here that would catch fire. It's all damp.",
    "No fire!",
    "I can see you're going to be a little pyromancer when you grow up.",
    "Oh right, not a little pyromaniac then. But now you've got me thinking...",
    "Do you have anything that could be of use here?",
    "Perfect. Can I please use it?",
    "Stuff.",
    "Is there anything else that I could have?",
    "On second thought, you'd best keep that for yourself.",
    "How can I extract syrup from the trees?",
    "What is a spile and how do I make one?",
    "I'll get right too it![sic]",
    "How can I extract syrup from the trees?",
    "I've got a bucket of syrup!",
    "That's a good question! I should probably look round to see if there's a use for it.",
    "We'll have to light the way.",
    "I'll take a look around and see if I can find you something.",
    "I've got you a firefly to hold.",
    "You're not supposed to eat it! It's for lighting the way.",
    "I'll have to find another way...",
    "If I give you a firefly you're just going to eat it!",
    "There must be another way to light the way using the fireflies.",
    "I've covered as much of the dark area as I can with syrup which should attract the fireflies to them. This should light the way for us.",
    "As we run through I need you to let the fireflies out the jar so they fly to the syrup and give us light! No eating them!",
    "It's a jar.",
    "I've caught x fireflies.",
    "Oh wow, a bucket!",
    "I can put something inside this.",
    "How does something so tasty just come out of a tree?",
    "It's a maple tree...",
    "Where did you learn this?",
    "Is it though?",
    "I don't know.",
    "I should find a way of getting some sticky maple.",
    "I can get syrup from the tree now!",
    "Brilliant, there is a spile in this tree which will give me syrup. Now I just need something to collect it in.",
    "Syrup! This will be perfect for keeping the fireflies in place.",
    "I could craft this into a spile that would help me obtain the syrup from the trees.",
    "A spile used for extracting syrup from trees.",
    "Shake it off!",
    "Doesn't seem to be anything here.",
    "I've got nothing to hold them with.",
    "Perfect! Violet can hold this whilst we go through the forest.",
    "I've already got a firefly for Violet to hold.",
    "I don't have enough room to catch more. I could break the jar but then I'd have to submit a bug report.",
    "Violet could hold this so it lights the way!",
    "This looks like a great spot to place a makeshift light to light the way.",
    "This looks like a great spot to place a makeshift light to light the way. If I can find a way to extract the sticky syrup from a tree I might be able to use that to atract[sic] the fireflies to this, lighting the way.",
    "That appears to be all the surfaces I could possibly cover. I should tell Violet the next step of the plan.",
    "This is sticky and should attract fireflies helping to light the way.",
    "Violet! Don't run too far ahead! Look out!",
    "That's a good thing. It means they won't see us sneaking past!",
    "Sure, let's make them some makeshift heads.",
    "I'll take a look around! Meanwhile make sure you don't go running off as there could be dangerous things ahead!",
    "Where do you get such pinpoint aim?",
    "Should we get going?",
    "That will take way too long.",
    "Before you get attached to them we should go...",
    "Are you having fun?",
    "Glad to hear!",
    "Can you help me get home? I'll return to help Violet soon.",
    "How about using this snow to make the heads?",
    "If I compact the snow hard enough together, it will hold together and work just fine! How do you think snowmen are made?",
    "A man made of snow.",
    "That looks like we have enough. How do you suggest we go about giving them the heads?",
    "I'll point them out and you hit them? Sound good?",
    "Sounds like a good plan.",
    "Phew... what a walk...",
    "I am! I'm just not used to such a snowy terrain. Anyway what do we have here?",
    "We need to find a way across this lake, but that ice does not look safe.",
    "Hmm... well we'll need to find another way round. Say, I don't suppose you know a way?",
    "Are you sure? You did say it had been years since you've been to town.",
    "Okay, okay! I didn't mean it like that. All I mean is there has to be a way we can get round without risking Violet's life on the ice.",
    "Violet you did it!",
    "You gave me an idea! We can use Violet's roars to cause more snow to fall and thicken up the ice, that should make it safe enough to cross.",
    "STOP! I'm sure you have a great roar but this is Violet's adventure remember? You keep her busy while I give her something else to roar at.",
    "That's it, keep practicing your roar and I'll build these snowmen.",
    "Look, Violet, another snowman!",
    "That's it, Violet!",
    "Not yet. I need to build some snowmen and Violet's roar should be able to knock snow from the trees to help strengthen the ice.",
    "That looks like enough snow for now.",
    "I'm going to be sycamore of seeing branches if I prune anymore.",
    "In this moment, I realise the inevitability of life is that you are but a moment away from death. Life can feel so solid, but really you are just compacted ice on a winter's day. Sunshine, a swift kick or a roar to the face can change everything. Snowman... oh, snowman... you went before we could truly appreciate you. But I will honour you.",
    "This day, and each that follows, I will carry a small piece of you in my heart.",
    "That's what I'm about to figure out. We're going to need to find some way of getting you across safely first though.",
    "Violet, how would you like to ride the barrel express? Next stop: Yeti Town!",
    "An adventurer must be prepared for any eventuality. You'd be amazed by the things you can use on each other to get bizarre interactions.",
    "Onwards to Yeti Town! Taking on whatever this journey throws at us one step at a time.",
    "Alright, are you ready for this?",
    "No, move your leg over there!",
    "Right, twist. A bit more. A bit more.",
    "Come on! It's like you're not even trying!",
    "The lake looks pretty slippy. We should probably find a safe way to get Violet across. What's a good way of making this a fun adventure? I should look around for supplies.",
    "Well, here goes nothing!",
    "Are you ready, Violet?",
    "Phew! I made it.",
    "I knew I was forgetting something...",
    "Violet, we did it!",
    "Maybe later, right now we have to get you to Yeti Town. But how are we going to get your dad across?",
    "That was incredible!",
    "What's up, Violet?",
    "What is it?",
    "Now, why would they not want to be friends, with you?",
    "You are brave, fun and lovable, and now one of the world's greatest adventurers! The kids will be lining up to be your friend!",
    "I sure do! Now, what do you say we figure out how to get down there and make the best entrance ever? That slope is too steep to walk down. We need to find a safe way of getting down there.",
    "Let's do it!",
    "You're in charge. What do we need to do?",
    "What do you think we should do next?",
    "I don't think I'd be able to take both of you sitting on me. I'll have a look around to see if there is anything we could use.",
    "What do you think we should do next?",
    "I think we need to add a level of safety to it first. I do not want to be responsible for any pain or loss here.",
    "We could try it for sure. I gave the last of it to your dad to hold.",
    "I guess we'll have to look around for something else then.",
    "What do you think we should do next?",
    "We're going to slide it.",
    "Why am I silly?",
    "The feet?",
    "It's a sled, it slides.",
    "Okay, i'll find suitable 'feet' for the sled.[sic]",
    "What do you think we should do next?",
    "Do you suppose you've got any fireflies left in the jar?",
    "Why did I even ask? I'll go find a light.",
    "What do you think we should do next? I've found a lantern but no fuel.",
    "I guess so!",
    "What do you think we should do next? It's time to give the sled a name.",
    "I wouldn't have it any other way.",
    "How about [sled name]?",
    "Should we add the racing stripes now?",
    "It's time we set off for Yeti Town.",
    "Are you ready?",
    "I should talk to Violet.",
    "This looks like a good place to build a sled. How does this look?",
    "Exactly, a perfectly flat, super and open area.",
    "Next we need to find a suitable material to build the sled with.",
    "Next we need to find a suitable material to build the sled with.",
    "Who needs instructions?",
    "Hmmmm",
    "Pretty sure that is right?",
    "Nope that looks wrong...",
    "Okay maybe instructions are needed...",
    "Perfect!",
    "Next we need to find something to bind the sled together with.",
    "A bit of rope here",
    "A bit of rope there",
    "That seems quite tight",
    "Feeling sturdy!",
    "Perfect!",
    "Next we need to find something to help the sled slide.",
    "Next we need to find something to help the sled slide.",
    "A perfect fit!",
    "This is a little wonky",
    "If I just bend that... and then turn that...",
    "Oh, I am good!",
    "If that fits into place just there... and...",
    "Done!",
    "Next we need to find a light that will help keep the way lit.",
    "Next we need to find a light that will help keep the way lit.",
    "Looks great!",
    "Next we need to find some fuel to keep that lantern lit.",
    "Next we need to find some fuel to keep that lantern lit.",
    "This little light of mine",
    "I'm gonna let it shine!",
    "Looks like this sled is finished and what a beauty it is!",
    "I should talk to Violet.",
    "Maybe this old barrel will do? All the wood has rotted away leaving only the metal fasteners.",
    "In that case, why didn't we just keep the barrel from earlier and do that?",
    "Such a dad joke.",
    "I've already got this item.",
    "I should talk to Violet.",
    "This looks like it'd work as a base for a sled!",
    "TIMBBBBEERRRRR",
    "Oh no! I think I just chopped down the sign that points the way to the village.",
    "You're right. This will be our little secret.",
    "Nothing to see here.",
    "Oh that's where I left it! Next time I won't be so careless.",
    "I should talk to Violet.",
    "A rope. It's a little wet but seems sturdy enough to use as bindings for the sled.",
    "I've already got this item.",
    "I should talk to Violet.",
    "It's still smoking, some travellers have been here recently. The charcoal is hot, but no need for ice gloves! It's a good thing I have a tinderbox on my toolbelt, otherwise we'd have big issues if there wasn't one hidden nearby for my convenience!",
    "I've already got this item.",
    "I should talk to Violet.",
    "Something is glinting down there!",
    "Ooo that is cold!",
    "So very cold...",
    "Almost there...",
    "Gotcha!",
    "I've already got this item.",
    "Looks like it.",
    "It was good fun Violet.",
    "Yeah, I think we did a good job.",
    "Stop! You're going to make me cry!",
    "You're welcome. I'm glad you're enjoying yourself."
  ],
  "Violet": [
    "Rar rar rar.",
    "Rar rar rar",
    "Rar.",
    "ROARRRRRRRRRRRR!",
    "Rar.",
    "Hahahaha. Snow in your face!",
    "Come up here and face me!",
    "Hahaha got you!",
    "Hahaha got you!",
    "Hahaha got you!",
    "Hahaha got you!",
    "Hahaha that was SO MUCH FUN!",
    "Snow in your face! Hehehehe.",
    "Hehehehe.",
    "Oh no! Gotta go!",
    "Byeeeeeeee",
    "Mum! I saw a hairless yeti out in the wild!",
    "Look! There he/she is!",
    "Tehehe! You lost the snowball fight!",
    "No! I just wanted to see more! I want to see mountains again! Mountains!",
    "Not to go beyond the gates of the house. I'm soooorry.",
    "I just want to go to the festival. It's the first time I can go this year and all other yeti are going except us!",
    "But that is what you aaaalways say.",
    "Ooo ooo, PLEASE!",
    "I'll go to my room, see you later.",
    "Mum and Dad want to talk to you...",
    "They're never going to let me go. I'm a brave adventurer like you! I can make the journey. I'm running away, I'm going to run away to yeti town and live there! No parents! No rules! I can eat whatever I want!",
    "Pickled pink pancakes for dinner?!",
    "Only the tasiest, bestest, mostest dinner in the whole wide world![sic]",
    "But Mum and Dad won't let me go.",
    "Really? We're really going?",
    "Really really?",
    "Wooohoooooooooooo! Thank you, thank you, thank you, thank you, thank youuuuuuuuu! I'm so EXCITED! Can you help me pack? I'm taking EVERYTHING!!!",
    "You're right! Shall we take this?",
    "Good idea. I don't know what is warm enough so how about you help me? We can turn it into a fun game. I like to call it I-spy.",
    "Yup!",
    "I'll say a letter and you have to find it and bring it to me.",
    "I spy with my little eyes... something beginning with... TOY TRAIN!",
    "Oooops! Silly me.",
    "I spy with my little eyes... something beginning with... [letter]",
    "Have you found it yet?",
    "I spy with my little eyes... something beginning with... [letter]",
    "That is not what I had in mind.",
    "CORRECT! That is exactly what I was thinking of. Well done!",
    "I spy with my little eyes... something beginning with... [letter]",
    "That is everything we need. Should we go tell Mum and Dad we're ready?",
    "That is everything we need. Should we go tell Mum and Dad we're ready?",
    "More than ever!",
    "MUM! DAD! Thank you, thank you, thank you, thank youuuuuuu! I am SOOOO exci... exc... ehhhh... CHOOOOO.",
    "Yuuummmmmmyyyyyyyyyyy! Thanks Mum! Dad, can you put my shoes on?",
    "Weeeeeeeee!",
    "*giggle*",
    "I can't believe I'm finally going to the Yeti festival! Yahoooooooo.",
    "Are we there yeti?",
    "In there?",
    "But it's dark.",
    "A little dark? There could be monsters... I don't like the dark, Player.",
    "Fire!",
    "Fire!",
    "Fire!",
    "Fireflies! Do you see them! Buzzing all around us! SOOOOO PRETTY!",
    "I don't want to go through the dark.",
    "I need a light!",
    "Oooooo look at how shiny it is!",
    "Deeeeeeeeeelicous! Thank you. Can I get some more?",
    "But they taste like popping candy and give a warm feeling in my tummy! They're just toooo tasty not to eat!",
    "YUMMMMMMMMMMMMMY.",
    "Tehehehe they're going to eat ALL the syrup!",
    "Are we out of the woods yet?",
    "They've got no heads.[sic] ...",
    "But they've got no heads... That makes me sad. Please can we help them?",
    "Yayyyyyyyyy! There is some snow over there we can use to make new heads for the golems.",
    "We need something to give these golems heads!",
    "Snowball fights with Dad! He's easier to hit because he eats aaaallllll the stew Mum makes. But we shouldn't tell him that though. Teehehehe.",
    "But Mum aaaaaaaaalways calls you her chunky monkey.",
    "That was so fun Player, I loved every second of it! Can we take one home with us?",
    "I'm not a horror! I'm a yeti.",
    "Wait wait wait... We've got to name them all first!",
    "That one is Cold-feet and that one is Ice-man and that one is...",
    "...and this one is Cold-hands and that's Small-foot over there next to...",
    "Don't be silly! That is snow!",
    "Snow... Snowman? What is a snowman?",
    "Tehehehe you're SOOOOOOO silly. Okay, but if I pull a face you have to make it just like mine!",
    "A face like... THIS!",
    "Hehehe, that isn't what I was doing but it looks funny! We'll keep it.",
    "Yes! I LOVE it!",
    "They're snowball heads! So lets throw them like snowballs!",
    "Ahahahahaha what a great plan!",
    "You point them out! I'll throw the heads to reattach them!",
    "RAWWWWWWRRRRRRR! Teeheehee! Snow everywhere!",
    "Did what?",
    "RAWWWWWWRRRRRRR!",
    "RAWWWWWWRRRRRRR!",
    "I'm going to get it!",
    "RAWWWWWWRRRRRRR!",
    "Let's go!",
    "Oooh that's a lot of ice! How do we get across that?",
    "What's the barrel for?",
    "LET'S GO! WHEEEEEE!",
    "Are we there yet?",
    "Ice ahead!",
    "No good.",
    "I'm stuck!",
    "Try pushing a different way.",
    "Yeti Town is just down that hill! Ooooo I can see it! Look! Look, it's over there! ... *mumble*",
    "*slightly louder inaudible mumble* *mumble* ...friends...",
    "What if they don't like me? What if no one wants to be my friend?",
    "*mumble*",
    "You really think so?",
    "We should build a big sled, with lots of lights and lots of sparkles. With go faster lines on the side![sic]",
    "We need to find a clear spot to build our sled.",
    "Could we sit on Dad as he slides down on his belly?",
    "What about... Sliding down whilst me and Dad sit on you!",
    "I'll stand here and watch.",
    "We could just slide down on just the wood! That would be SO funny!",
    "What could we bind it together with? More maple syrup?",
    "Daaaaaaaaadddddd!",
    "How is it going to move?",
    "You're so silly.",
    "Where are the feet?",
    "Yessss, the sled's feet. Where are they? How do you think it's going to move?",
    "Can't slide if it's got no feet!",
    "We need a light for it.",
    "Hehehehe... Of coooourse I dont.[sic]",
    "Are you going to find some fuel?",
    "Oooo oooo can I pick? Please please please?",
    "How about... Hmmm... I can't think of a name. Could you give me some ideas please?",
    "I love it.",
    "Oh I really love it!",
    "Oh no, it's perfect the way it is!",
    "More ready then EVER!",
    "Oh I am SO excited.[sic]",
    "Tehehehe, it's just a flat area!",
    "Then this is where we'll build the bestest sled EVER![sic]",
    "Perfect.",
    "This is it?",
    "This...",
    "Th... thi...",
    "THIS IS THE BEST EVERRRRRRR!",
    "Oh oh Player thank you!",
    "Daddy! Can I go play![sic]",
    "Weeeeeeeeeee! THIS IS THE BEST DAY EVER!!",
    "I found these lamps. I'd give them back but looks like you need more room to hold them first.",
    "Here, it looks like you lost this.",
    "Here, it looks like you lost these.",
    "This place is SO awesome!",
    "Thank you SOOOOOOO much for bringing me!"
  ],
  "???": [
    "ROARRRRRRRRRRRRRRRRR",
    "Who's there!",
    "What do you want?",
    "Go away!",
    "Who's there!",
    "What do you want?"
  ],
  "Betty": [
    "Stop teasing the visitor and invite them in! Come in deary, out of the cold.",
    "Stop teasing the visitor and invite them in! Come in deary, out of the cold.",
    "Stop teasing the visitor and invite them in! Come in deary, out of the cold.",
    "Would you like some stew? We've only just added fresh ingredients.",
    "Thank you for bringing her home to us.",
    "Oh Violet, my girl, we can't make the journey. It's too far and it's too dangerous. There is always next year when you're a bit more grown up.",
    "We will indeed. Thanks for the kind offer, [Player].",
    "Humans, you say? They are tasty, that's what they are! GET 'EM IN THE COOKING POT!",
    "We can also do humour! The look on your face though!",
    "Bless you! You'd better not catch a cold again, make sure you're all wrapped up warm. No taking your gloves off. Even if you're feeling too hot, it's better to keep the warm layers on.",
    "Before you all go off, please warm up with some freshly made stew.",
    "What did you have?"
  ],
  "Trevor": [
    "Are you causing trouble? Did you go beyond the gate?",
    "But you know better than to run off without us with you! What have we told you?",
    "Would you give us a minute or two to talk with this adventurer here?",
    "Don't call me later, call me Dad.",
    "If you change your mind in the future, we'll be right here, won't we deary?",
    "Brilliant observation. You must be a furless yeti.",
    "It was sarcasm, we know what humans are!",
    "I'll be coming with you, I know the path well.",
    "I'm a yeti, all I need for going outside is the wind in my face and snow between my toes.",
    "No, I don't think they'll fit me.",
    "I've got this empty jar.",
    "What for?",
    "That sounds reasonable! Here you go!",
    "I've already given you my jar.",
    "I just coughed up what looks like a furball?",
    "Nope, you should take a look around to see if there is anything that will help light the way.",
    "You'll need to create a spile.",
    "It's a tree tap and usually crafted from metal or wood, if you find some logs I'm sure you're skilled enough of a fletcher to create such an item.",
    "You've already got one right there it seems and it's made from maple logs. A maple spile, getting maple from a maple tree! Give it a tap, a shimmy and then push it into a tree to release its syrupy juices.",
    "That's great! Now what are you going to do with it?",
    "Right this way.",
    "This is why we can't have nice things.",
    "Did you know, the maple tree secretes a sugary syrup that tastes delicious. The syrup is also incredibly useful as it's sticky like glue.",
    "It's common knowledge.",
    "What's brown and sticky?",
    "A stick.",
    "Don't chop all of the tree! You're going to ruin all the tasty maple!",
    "That was cheeky, Violet.",
    "...",
    "We've already got one little horror running about the house! How do you think we'll be able to handle two![sic]",
    "My old bones can't take all this adventure anymore. But in answer to your question; yes, I am having a whale of a time.",
    "That was really fun to watch! Violet is going to be quite the dead shot when she grows up.",
    "You can't be tired already? I thought you said you were some kind of great adventurer?",
    "You're right. If we try to cross that now, we'll go straight through.",
    "This IS the only way.",
    "I'm old, not stupid.",
    "Why don't you leave this to me? Get ready for the best roar you've ever heard!",
    "Is the ice safe to cross yet?",
    "I'm sure if you look around you can find everything you need.",
    "You really are resourceful aren't you?",
    "I have no doubt. So, what next?",
    "Why are you looking at me like that?",
    "I don't bend that way!",
    "My bones...",
    "...what are you doing to me?",
    "Don't you worry about me! Look out! Here I come!",
    "Ow, my bones...",
    "It's lovely to see how excited she is.",
    "I don't think my bones will be able to take both of you.",
    "I wasn't going to eat it, I was just going taste it.[sic]",
    "If that barrel was complete, we could have just slid Violet down in it and walked down ourselves.",
    "That would be forward thinking and seeing you struggle is... ...wait for it...[sic] ...a barrel of laughs.",
    "If you just turn it upside down. Nobody will know.[sic]",
    "Of course! Be safe and play nice!",
    "Look at her face! She's so happy!",
    "I agree. Thank you for all your help. Are you planning on sticking round for the festival?",
    "That's the spirit! I knew there was some yeti in you!",
    "You adventurers... always on the run. Let an old yeti give you some advice.",
    "Slow down and appreciate what's around you. There's so much in the world you may be missing; in your rush to see and do everything, are you really present to enjoy what is in front of you?",
    "Violet... how she came into our lives was such a surprise. But she was the best thing to happen to us!",
    "Betty and I are happier than we've ever been now we're a family."
  ],
  "Trevor/Betty": [
    "Calm down, we haven't captured her at all.",
    "Violet is an orphan. We found her on our doorstep in a basket wrapped up in a blanket.",
    "We've raised her. Held her hand through her first steps. Kissed her knees when she fell over and we've fought away the monsters that hide under her bed. We know she isn't like normal yeti children, which is why we're afraid of taking her to the festival. I worry that she won't be accepted. The longer we leave it, I worry the worse she is going to get. She already runs off beyond the gates and we're too old to keep her from doing so now. It is only a matter of time. We want to give her the most magical childhood before she grows up but have never been able to. We're worried about it. What if she's picked on or made fun of.[sic]",
    "There is a village nearby, just over the mountain pass, where all yeti gather to celebrate. It's somewhat a rite of passage for all yeti kind. But Violet isn't a yeti. I worry she won't be accepted by the others. We've always wanted to take her to the festival.",
    "The question is more for you, are you willing to help Violet have a magical adventure?",
    "Thank you. You should probably tell her the good news.",
    "It's a festival where all yetis gather together to celebrate.",
    "Nothing, just to celebrate.",
    "No, but you can take my word for it - it's the most magical thing a yeti can experience.",
    "Have you told Violet we're going to the festival?",
    "What are you waiting for?",
    "Well, please don't forget to make the adventure as magical for Violet as for yourself.",
    "You're the kind adventurer who is willing to help us. It should be you.",
    "I see you've been roped into I-spy.",
    "It's a good way of getting Violet to tidy up. We say an item, she goes and gets it, and then we ask her to put it where it lives. The foolproof way of getting a six year old to tidy her room!",
    "Just leave through the front door, we'll follow."
  ],
  "Violet wants you to find something beginning with the letter": [
    "[letter].",
    "[letter]."
  ],
  "Objective": [
    "Use the fireflies to light the tunnel somehow.",
    "Use the fireflies to light the tunnel somehow.",
    "Find a suitable replacement for the ice golem's missing heads.",
    "Build something else for Violet to roar at.",
    "Look around for a way to cross the frozen lake.",
    "Find a suitable material to build the sled with.",
    "Find something to bind the sled together with.",
    "Find something to help the sled slide.",
    "Find a light to attach to the sled.",
    "Find some fuel for the lantern."
  ],
  "Ice golem": [
    "Yay!"
  ],
  "To rebuild the snowman you need": [
    "25 x Snowball",
    "2 x Branch",
    "7 x Coal1 x Carrot",
    "1 x Top hat"
  ],
  "Violet in a barrel": [
    "I'm stuck!",
    "Hey! What about me?",
    "Again! Again!"
  ],
  "Violet and Player": [
    "Awwwwh."
  ],
  "Yeti 1": [
    "So pretty"
  ],
  "Yeti Child 1": [
    "Oooooo"
  ],
  "Yeti Child 2": [
    "She's awesome!",
    "Woow!"
  ],
  "Yeti 2": [
    "Woow!"
  ],
  "Yeti Child 3": [
    "Woow!"
  ],
  "Yeti 3": [
    "Wow"
  ],
  "Yeti Child 4": [
    "Who is that!"
  ],
  "Yeti 4": [
    "Oooooo"
  ],
  "Angelica": [
    "She's so pretty!"
  ],
  "Yeti 5": [
    "So pretty"
  ],
  "Charlie": [
    "I'm going to be her best friend!"
  ],
  "Spike": [
    "No I am."
  ],
  "Mike": [
    "I want to have hair just like her!"
  ],
  "Congratulations! You have completed": [
    "'Violet is Blue' - Complete this quest."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Violet_is_Blue?oldid=36199641’"
  ]
}