{
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "Extra dialogue optionsYou can discuss this issue on the talk page or edit this page to improve it."
  ],
  "Commander Veldaban": [
    "Yes, what is it human?",
    "I'm sorry, Player, I'm just a bit stressed at the moment. I'm trying to conduct an investigation and the Supreme Commander won't release any guardsmen to help me.",
    "Not now, Player. I'm trying to conduct an investigation and the Supreme Commander won't release any guardsmen to help me.",
    "Actually, there is something, Player. I'm trying to conduct an investigation and the Supreme Commander won't release any guardsmen to help me.",
    "That's very good of you, Player. Let me explain what's happening.",
    "People have been going missing from Keldagrim East, too many for it to just be coincidence. Someone must be abducting them.",
    "Under attack? Where? By whom?",
    "Old Battleaxe needs reinforcements? It must be serious. Player, welcome to the Black Guard. Let's go.",
    "What is the situation, Colonel?",
    "I agree with you, but it's not my decision. Supreme Commander Bisi says we don't have the resources.",
    "I know, Colonel. We can talk about this later.",
    "If chaos dwarves have learned how to use magic then we're in trouble.",
    "I'm going in too.",
    "I'm too valuable to walk around a damn office all day, Colonel. You'll stay out here in case the chaos dwarf makes a break for it.",
    "That's an order, Colonel.",
    "Are you ready, Player?",
    "You said you'd deal with that chaos dwarf! Get to it, soldier.",
    "Great Guthix, man! What happened to you?",
    "You hang in there, soldier! We'll get you back to Keldagrim, and I'll get the chaos dwarf who did this to you!",
    "I don't like this, Player. Chaos dwarves aren't known for their inventiveness. For them to have a new weapon like this...",
    "It looks like it's basically a miniature cannon. The mining companies have been trying to develop them for a while, but I didn't think they'd had any luck.",
    "That's what I'm worried about. The Red Axe. This day just keeps getting worse. I could use a drink.",
    "Let me see that...",
    "This is a Grand Exchange order slip. The companies use them to trade with other cities. This slip will represent an order that's being held at the Grand Exchange in Varrock.",
    "But I don't understand this note on the other side. 'I forgive you.' Who is forgiving whom? And what's a chaos dwarf doing with this slip anyway?",
    "Player, could you do me a favour? Take this slip to the Grand Exchange and see what they know about it.",
    "I need to report back to the Supreme Commander in Keldagrim. You can get to the Grand Exchange using the mine cart system in Keldagrim.",
    "Thanks. There's a cart that goes straight from Keldagrim to the Grand Exchange; you can use that to get there. I'll be back in the Black Guard HQ if you need me.",
    "Supreme Commander! Supreme Commander Bisi!",
    "Lieutenant! I want to talk to the Super... Supreme Commander!",
    "Why not? Is the Supreme Commander busy? Ha ha ha! He can't see me because he's Bisi?",
    "Get out of my way, Lieutenant!",
    "Supreme Commander Bisi! I want to talk to you!",
    "I'll barge into your office in... whatever state... I'm the Commander of the Black Guard!",
    "I work for the people of Keldagrim!",
    "You're a corporate... a corporate... something. You only do what they tell you. You don't care about people...",
    "You don't care... you don't care about people...",
    "Player cares. Player will work it all out. You'll work out what all the things in the package mean. Won't you, Player?",
    "I'm going...to bed...",
    "...zzz... ...Hilda...where are you?... ...zzz... ...where are you taking her? ...Hilda... don't take her... ...no... no, no, no, don't take her... ...Hilda... I'll remember... you... ...zzz...",
    "Hello, Player.",
    "Oh, I bet I am. I'm sure later today the Supreme Commander will call me into his office and I'll have to grovel for my job. It was stupid of me to say what I said, but that doesn't mean I was wrong. I'll worry about that later, though. Have you discovered anything?",
    "Uurgh, I've felt better. I'll be alright, though.",
    "I knew it! That must be how the chaos dwarves are getting into the city! You've got to show me. Are you ready to go now?",
    "Yes?",
    "I'll be in the Laughing Miner if you need me.",
    "Hilda? I don't know anyone called Hilda.",
    "I don't know why I would say that name. Maybe you misheard me.",
    "Well, I can't say for certain that I didn't. I was asleep, after all. But I can't think why I would say that name.",
    "It sounds familiar.",
    "But I can't place it. I don't know what's going on here, but I really don't know anyone called Hilda. I'm sorry.",
    "I don't know who Hilda is, and I don't know who the barmaid thinks she saw me with, so yes, why not roll two imaginary people into one?",
    "Good plan. If this Hilda even exists, we can worry about her later.",
    "Hello, father.",
    "There are more important things than making yourself rich, father.",
    "There was no reason to come here, Player. Show me that entrance you found.",
    "This place, it looks familiar.",
    "I don't remember coming here, but somehow I feel like I have. It's probably nothing.",
    "Honestly, any of the companies might have done it. It's industry for the sake of industry. You've got a factory churning out cart track, so you need to lay it out somewhere.",
    "This board controls the junctions on the track. You slot green and yellow stones into it to change direction.",
    "I'm not sure. It's like I remember it from somewhere, but I can't think where.",
    "Interesting. It's like whoever ordered the package knew we would need them here.",
    "Good idea.",
    "We'll do our best to find him, ma'am.",
    "Please, ma'am, get back to Keldagrim. We'll find Hilda.",
    "I did? I meant to say we'd find the husband, Brunolt.",
    "I don't know what's getting into me. Something about this place makes me feel like I've heard the name before, but I still can't place it.",
    "Is it possible that I've forgotten her? I don't normally forget things.",
    "Or, at least, I don't think so.",
    "This door, I remember it. I remember this switch. It's starting to come back.",
    "The door needs two people to open, so I must have come here before with someone else.",
    "Perhaps I came through here with Hilda.",
    "There's something important on the other side of this door. Something that we found. Something that happened.",
    "I just can't remember what.",
    "Well, it's open. I suppose we'll find out what happened next.",
    "That must be Brunolt!",
    "He's too closely guarded now. If we follow him we might have a chance later.",
    "We can follow and keep watching. We might get a chance.",
    "What are they doing? It's like that spell... wiped his mind.",
    "I've seen this before, I know I have...",
    "They're turning him into a chaos dwarf...",
    "And I've seen this before. I remember it. They turned her into a chaos dwarf. I've seen this before.",
    "Hilda! No!",
    "I'm sorry, Player!",
    "I'm sorry! It all came back to me.",
    "I had some sort of flashback. I saw Hilda in that machine.",
    "I remember what happened now. I was here before, with Hilda. We got in, but we were spotted.",
    "We were trapped in this office.",
    "They knew people would notice if I disappeared, so they wiped my memory and dumped me back in Keldagrim.",
    "But Hilda... Guthix, poor Hilda.",
    "She was just a nobody from Keldagrim East. That's what they said. She wouldn't be missed. So they turned her into a chaos dwarf.",
    "Just like they're doing with all the other poor dwarves they're kidnapping from Keldagrim East.",
    "Grimsson! You killed her! You killed Hilda!",
    "Where is she?",
    "Grimsson! I'll kill you!",
    "Player! You killed her! You killed Hilda!",
    "That chaos dwarf on the tower! The one who dropped the slip! That was Hilda!",
    "Neither did I! Damn the Red Axe.",
    "You're right. She was gone. They'd already killed her.",
    "But she did leave us that package.",
    "This room is full of Grand Exchange order slips. She could have made up an order with items she knew would help me get into the base again.",
    "Then she kept the order slip on her when she was transformed, knowing that I would find it when she was killed.",
    "You think the Grand Exchange cares who orders what? Besides, they don't need to put 'Red Axe' on the slips. Everything is done with numbers.",
    "You write the items you want and payment details on the slip. The machine in the corner cuts the slips up. The main part goes to the Grand Exchange.",
    "You keep the slip, and show it to the exchange clerk to get the items.",
    "I can't believe you'd think about that now! I thought we dwarves were meant to be the materialistic ones!",
    "Anyway, no, you can't. You'd still have to provide payment details. For you, it would just be a more complicated way or using the Grand Exchange.",
    "There are?",
    "Looks like Hilda was a clever one. She must have known we'd be trapped in here again, and gave us things we could use to escape.",
    "We can get out of here, and with our memories, too. We've just got to work it out.",
    "You've stopped the machine. Now what?",
    "You did it! We can get out through that hole!",
    "We've made it! Now we've got to get back to warn the Consortium!",
    "Veldaban, Commander of the Black Guard in Keldagrim, presenting himself to the Consortium with a guest.",
    "The Red Axe is a serious threat. We need to step up our defences.",
    "That deals with that entrance, but what if they find another way in? We need to deal with this threat at its source!",
    "Serious enough?",
    "No one important?",
    "They wiped her memory and turned her into a chaos dwarf!",
    "Don't give me that! I'm head of the Keldagrim Black Guard! If there's an investigation, I should be leading it.",
    "You're as bad as the Red Axe! All of you!",
    "I've had enough of this. Supreme Commander, I am resigning from the Black Guard.",
    "I'll get to the bottom of this without you if I have to.",
    "Player, thank you for your help. I'll contact you if there's anything else you can do."
  ],
  "Player": [
    "There's no need to be rude.",
    "Why don't we go for a beer and a kebab?",
    "Do you have a quest for me?",
    "Good luck with that.",
    "Let me help.",
    "Who-",
    "Do you think-",
    "Were there-",
    "Nothing.",
    "What kind of weapon does the chaos dwarf have?",
    "Who are you?",
    "What were the chaos dwarves doing here?",
    "I'll deal with the chaos dwarf.",
    "I'm ready.",
    "I'll go and get ready.",
    "What was that weapon?",
    "Do you think the Red Axe is behind this?",
    "The chaos dwarf dropped a slip of paper.",
    "I'll take the slip to the Grand Exchange now.",
    "Never mind.",
    "Hi there.",
    "I have this dwarven order slip...",
    "Hi there.",
    "I lost my package.",
    "Where is Commander Veldaban?",
    "Are you drunk?",
    "What are you doing here?",
    "Why did he take you off the case?",
    "Who's on the case now?",
    "Do you think that the missing persons are connected to the chaos dwarves?",
    "Do you think the Red Axe is involved?",
    "I've got the Grand Exchange package.",
    "What do you think of this boot?",
    "What do you think of this bowl?",
    "What do you think of this metal rod?",
    "What do you think of these green and yellow stones?",
    "What do you think of this metal rectangle?",
    "What do you think of this turnscrew?",
    "I'll talk to you later.",
    "Commander Veldaban wants a Guardsman's Stout.",
    "He's fine.",
    "He's just having a bad day.",
    "What are you doing here?",
    "Do you think the Red Axe is involved?",
    "I didn't know you had a lady-friend.",
    "The barmaid said she'd seen you with someone.",
    "What was the Battle of Barendir?",
    "Let's go.",
    "Commander Veldaban was right.",
    "Why did you take Veldaban off the case?",
    "Who are you?",
    "What news have you?",
    "I must go now.",
    "Can you wake Veldaban up?",
    "Do you know who Hilda is?",
    "Can you help me understand the items in this package?",
    "What do you think of this boot?",
    "What do you think of this bowl?",
    "What do you think of this metal rod?",
    "What do you think of these green and yellow stones?",
    "What do you think of this metal rectangle?",
    "What do you think of this turnscrew?",
    "Let's talk about something else.",
    "Never mind.",
    "I'm not going to be able to control the cart without someone to help. Maybe I should see if Veldaban is awake.",
    "Are you in trouble?",
    "How are you feeling?",
    "I found a secret door in the mines.",
    "Let's go.",
    "Goodbye.",
    "I have to do something else.",
    "Who is Hilda?",
    "You were talking in your sleep. You said her name.",
    "I'm sure I heard you say it.",
    "Doesn't the name mean anything to you?",
    "Maybe Hilda was the person the barmaid saw you with.",
    "Let's get on with the job.",
    "Never mind. My mistake.",
    "Never mind.",
    "You think you've been here before?",
    "Do you think the Red Axe built this place?",
    "Let's get on with the job.",
    "How do you know about the stones?",
    "There are green and yellow stones in the package.",
    "You take the stones and man the board. I'll ride the cart.",
    "Never mind.",
    "Who is Brunolt?",
    "How did you get here?",
    "What do the chaos dwarves want with you?",
    "You should get back to Keldagrim now.",
    "You told the prisoner we'd look for Hilda.",
    "Let's get on with the job.",
    "We've got to rescue him!",
    "There's nothing we can do for him now.",
    "You blew our cover!",
    "Why did you shout that?",
    "I don't understand!",
    "I didn't know it was her!",
    "That wasn't Hilda. Hilda was gone by then.",
    "The Red Axe are outlawed. How can they order things?",
    "How do the order slips work?",
    "Could I use the slips to get free stuff?",
    "There are still some things in the package."
  ],
  "Black Guard": [
    "Commander Veldaban! We're under attack!",
    "Chaos dwarves, by the watchtower in the south mines! Colonel Grenda is engaging them but requests reinforcements.",
    "Sorry Commander...would salute, but...",
    "New weapon...magic fire-wand...maybe..."
  ],
  "Colonel Grenda": [
    "Chaos dwarves, sir. There's one left but it's holed up in the watchtower. It's got some kind of new-fangled weapon. I've lost six men. It's lucky I was down here with my squad, Commander. I've told you we should post more guards down here in the mines.",
    "With all due respect, Commander, that's a load of-",
    "I've never seen it before. It could be a special crossbow, or a magic staff.",
    "Colonel Grenda of the Black Guard, Keldagrim First Regiment. I don't think we've got the time for life stories right now.",
    "I think they were trying to get into the city. If we hadn't caught them, they might have stolen a boat and taken it up the river. What their plans were, I couldn't say. They weren't a large enough force to pose a threat to the city as a whole, but it might have been an advance scouting party.",
    "Commander, I should be the one going in. You're too valuable to put in danger.",
    "Commander-",
    "Yes, sir.",
    "You said you'd deal with that chaos dwarf! Get to it, soldier."
  ],
  "Grand Exchange clerk": [
    "Good day to you, [sir/ma'am]. How can I help you?",
    "Your order has completed. Here are your items.",
    "Good day to you, [sir/ma'am]. How can I help you?",
    "Luckily, someone mailed it back to us. Here it is."
  ],
  "Lieutenant Brae": [
    "Hello, visitor. Is there something I can help you with?",
    "He went off-duty. He said that he would be in the Laughing Miner pub, in Keldagrim East.",
    "Commander Veldaban!",
    "You can't see him, Commander. You're-",
    "Because you're drunk, Commander! You shouldn't-",
    "Can I help you, visitor?",
    "It looks like he's drunk some Guardsman's Stout. There's no waking him while he's sleeping that off. He'll be awake a bit later, though. You should check back.",
    "I've heard Veldaban saying that name in his sleep, when he's had a bit too much to drink. I suppose it must be someone he met. I don't know.",
    "Um...alright.",
    "That looks like the kind of boot chaos dwarves wear. It's got a very distinctive tread pattern.",
    "That's some kind of industrial bowl. It looks like it's heat-resistant, and designed to form an air-tight seal with something.",
    "I'm guessing that square tip goes into some kind of socket, and then you can turn it using the handle, like a giant key. But a key to what?",
    "Those are mine cart switching stones. They slot into a control board to change the points on a mine cart track.",
    "I don't know. I'm sorry.",
    "It's designed to fit a particular kind of screw. I don't think I've seen one like it before."
  ],
  "Veldaban": [
    "Hello, Player.",
    "Not yet, but I'm working on it.",
    "I'm drinking beer. I'm off-duty, since, apparently, there's nothing they need me for back at HQ.",
    "Supreme Commander Bisi has taken me off the case. I'm not to investigate the missing persons any more.",
    "He said that an investigation was ongoing but it wasn't a priority.",
    "You know why the missing persons aren't a priority? It's because they're from Keldagrim East. They're poor. They're unemployed, or they're low-wage labourers.",
    "The rich people have the power in Keldagrim. The rich people run the mining companies, and the companies make up the Consortium, and the Consortium controls the Black Guard.",
    "If some high-class citizen from Keldagrim so much as stubs their toe, I have to go over there personally but, when people from Keldagrim East go missing, I'm told it's not a priority.",
    "Lieutenant Brae. She's not going to get anywhere, though.",
    "Don't get me wrong. She's a good kid, but she's not assertive enough. The Supreme Commander can starve her of resources and she won't complain like I would.",
    "I don't believe in coincidence. It's almost too horrible to contemplate, though. Could chaos dwarves really be coming into our city and carrying people off under our noses?",
    "The Red Axe? Guthix, what a horrible thought. I need another drink. Would you get me one, Player? Ask the barmaid for a Guardsman's Stout. Tell her to put it on my tab.",
    "Let me look at that... These are just random items. This doesn't make any kind of sense.",
    "Looks like the kind of boot that chaos dwarf was wearing. It's a mass-produced military-style boot, decent but not expensive. Why would anyone order a single boot rather than a pair?",
    "That's not a cooking bowl. I'm guessing it has some use in industry. Look at the rim. It looks like it could form an air-tight seal with something.",
    "I'm guessing that square tip goes into some kind of socket, and then you can turn it using the handle. Like a giant key. But a key to what?",
    "Ah, I recognise those. Those are mine cart switching stones. They slot into a control board to change the points on a mine cart track. I don't know what they're doing in the package, though.",
    "Beats me. It could be for any number of things.",
    "This doesn't look like a standard turnscrew. It's designed to fit a particular kind of screw.",
    "Thanks, Player.",
    "I'm drinking beer. I'm off-duty, since, apparently, there's nothing they need me for back at HQ.",
    "Supreme Commander Bisi has taken me off the case. I'm not to investigate the missing persons any more.",
    "The Red Axe...",
    "It's the kind of thing I can imagine...I mean, that they might...",
    "But we shouldn't jump to conclusions. We should keep an open mind. We don't know that the Red Axe is involved.",
    "What are you talking about?",
    "I'm too busy with my work for that sort of thing. I haven't been seeing anyone since... since before the Battle of Barendir.",
    "She must have been mistaken. I haven't been in here except on my own.",
    "I don't think anyone who was at that battle came back quite the same.",
    "It was a few years ago. The trolls had been attacking our miners, so the Supreme Commander sent a Black Guard regiment to deal with them.",
    "I was just a lieutenant at the time. Our commanding officer was Colonel Grimsson. He was a real slave-driver. The new recruits think Colonel Grenda is bad, but Grimsson was ten times worse.",
    "We had to attack a position where the trolls were entrenched. The trolls rained rocks down on us from behind cover, and attacked from side-tunnels and pits. We lost hundreds of men.",
    "There were bodies everywhere, and the smell of blood was... I wish I could forget it.",
    "Colonel Grimsson led the charge. He burst through the barricades that the trolls had set up, and I saw him in combat with the troll general. WE took the cavern, but Grimsson kept hacking at the trolls that fled. He was screaming like a demon and his whole face was covered in blood from a wound to his forehead.",
    "Then the trolls were gone, but Grimsson didn't stop fighting. He attacked anyone who came near him. He wounded several soldiers.",
    "Maybe the wound to his head affected his brain. Maybe the horrors of the battle just pushed him over the edge. I don't know.",
    "I made the call. I ordered my squad to subdue him. When we got back from Keldagrim there was a court-martial and he was discharged from the Black Guard.",
    "A while later he disappeared. No one else went berserk like Grimsson, but I don't think anyone who was at Barendir has been the same since.",
    "Never mind all that though. It's all over. Thinking about it will do no good.",
    "I'm about ready to go back to HQ now. Will you walk me back?",
    "Okay, you've reached a junction. Which stone should I use?"
  ],
  "Barmaid": [
    "Welcome to the Laughing Miner pub, human traveller.",
    "Is the commander okay? He looks in a bad mood.",
    "He's been coming in here a lot lately. He used to come in here with his lady-friend, but I haven't seen her for a while.",
    "Anyways, here's his drink."
  ],
  "Supreme Commander": [
    "Veldaban! How dare you barge into my office in this state!",
    "You're the Commander of the Keldagrim Black Guard, Veldaban. You work for me.",
    "You work for me, or, at least, you do when you're sober!",
    "That's enough, Commander! You're drunk. Get out of here and sleep this off and maybe I'll forget about it.",
    "You must excuse Commander Veldaban's conduct. He is normally a very controlled person, but occasionally he has too much to drink.",
    "Now, was there anything else you wanted to talk about?",
    "I hardly think you are qualified to have an opinion on these matters. The discussion is over.",
    "I don't need to tell you why command decisions are made. Commander Veldaban can't personally investigate everything. An investigation into the chaos dwarves and the missing persons is ongoing. Now, was there anything else you wanted to talk about?",
    "News? I should be demanding news from you and Veldaban, not the other way round! Now, was there anything else you wanted to talk about?",
    "Then I bid you farewell, human.",
    "Commander Veldaban is my most senior officer. We can trust his word.",
    "Yes. The First Regiment under Colonel Grenda will hold the entrance you found and keep chaos dwarves from approaching the city.",
    "Commander! Don't interrupt the company leaders!",
    "Veldaban!",
    "An investigation into the Red Axe's current activities is ongoing.",
    "Veldaban-",
    "Veldaban!"
  ],
  "Dondakan the Dwarf": [
    "Hello, Veldaban.",
    "What are you doing down here? Have you decided to leave the Black Guard and go into a more profitable line of business?",
    "Not to a real dwarf there aren't. Maybe that's why you're hanging around with a human."
  ],
  "Fjoila": [
    "Brunolt! Have you seen Brunolt?",
    "He's my husband! The chaos dwarves took him deeper into the base. Do you know where he is?",
    "The chaos dwarves kidnapped us! They broke into our house at night and carried us off! Brunolt tried to fight them but he's not as young as he used to be and he couldn't... I'm so worried about him! You've got to make sure he's safe!",
    "I don't know! They didn't ask us any questions, they just dumped us in here and they've been taking us, one by one. They took Brunolt! Please, you've got to find him.",
    "But what about Brunolt?"
  ],
  "Brunolt": [
    "Please! What are you doing? You've got the wrong dwarf!",
    "Look, do what you want to me, just let Fjoila go! Please!",
    "No!",
    "What are you doing? I can't... think...",
    "Fjoila... Don't hurt..."
  ],
  "Ogre shaman": [
    "Quiet, little dwarf!",
    "Listen me! You are chaos dwarf!",
    "You worship Zamorak, god of chaos!",
    "You serve Red Axe!",
    "Hail Zamorak!",
    "You not fear. You not doubt. You not hesitate.",
    "You go to next station now."
  ],
  "Chaos Dwarf": [
    "...",
    "I am chaos dwarf.",
    "I worship Zamorak, god of chaos.",
    "I serve Red Axe.",
    "Hail Zamorak!",
    "I not fear! I not doubt!"
  ],
  "Gnome technician": [
    "Right, step into the machine. This will only hurt quite a lot.",
    "Good, good. Into the machine, please.",
    "Good, good. Transformation complete. On to the next station, please."
  ],
  "Red Axe Director": [
    "Who's that?"
  ],
  "Colonel Grimsson": [
    "It's that Black Guard commander! How did he get in here again?",
    "Guards! Don't let them escape!",
    "Veldabaaan!",
    "Did I? She was alive and well when I last saw her. Alive and well and eager to serve Zamorak!",
    "Oh, we sent her to Keldagrim to get more prisoners. We made her into a hand cannoneer.",
    "But... oh... that raiding party didn't return. It looks like your Black Guard soldiers killed her!",
    "Ha! Maybe you killed her yourself! Maybe your friend Player killed her!",
    "You can't escape! We'll do the same thing to you that we did to Hilda! You'll serve us faithfully, and you'll never remember that you were once Veldaban of the Black Guard."
  ],
  "[Your chosen company's Director]": [
    "Commander Veldaban. We've all read your report. It makes for worrying reading.",
    "Do you have anything to add to your report, Commander?",
    "Commander Veldaban, I understand that one of the missing persons was important to you, but you must not allow that to cloud your judgement."
  ],
  "Blue Opal Director (Purple Pewter Director if Blue Opal is the chosen company)": [
    "If it is true."
  ],
  "Green Gemstone Director (Purple Pewter Director if Green Gemstone is the chosen company)": [
    "Yes, that was agreed. I believe Supreme Commander Bisi has assigned a Black Guard division to the problem?"
  ],
  "White Chisel Director (Purple Pewter Director if White Chisel is the chosen company)": [
    "Assault the Red Axe stronghold?"
  ],
  "Silver Cog Director (Purple Pewter Director if Silver Cog is the chosen company)": [
    "I hardly think the problem is serious enough to warrant-",
    "As I was saying, I hardly think the problem is serious enough to warrant a military assault. After all, no one important went missing."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Forgiveness_of_a_Chaos_Dwarf?oldid=36233810’"
  ]
}