{
  "Aster": [
    "Overseer Siv has requested your presence to discus an urgent matter, your grace.",
    "Very good, your grace."
  ],
  "Player": [
    "Thank you, Aster.",
    "Apparently they'll let just anyone in these days. I should have a word with Siv about it.",
    "Sorry Siv, I don't have time for this right now.",
    "I agree. A duke was murdered right here, on our watch!",
    "And dark beasts got in and attacked the queen!",
    "And an assassin attacked me. Me!",
    "What we really need are some guards.",
    "Oh?",
    "Do you know the Raptor?",
    "I'll go and deal with him. You try to find us some guards.",
    "Any luck with those guards, Siv?",
    "I'm working on it.",
    "Can I help you?",
    "That's right! I built it myself. The King has charged me with defending Misthalin against the Zamorakian threat.",
    "In return, he made me a-",
    "It *is* the Wilderness, you know.",
    "That doesn't sound ideal.",
    "We?",
    "Alright, what do we do?",
    "Got it.",
    "How goes guard recruitment, Siv?",
    "I'm afraid we have a minor situation outside the walls. I'll let you know when it's resolved.",
    "I have no business using this right now.",
    "I don't think I should be going down there right now.",
    "Undead cleared! I should see what our new friend has to say about the attack.",
    "He's not the friendliest, but he helped me deal with a little problem I had.",
    "I'm currently working to fortify the walls, which should help keep out prevent[sic] any uninvited guests.",
    "One thing at a time, Siv.",
    "Looks like that's the undead threat averted.",
    "I feel like walls are probably enough to dissuade a few zombies.",
    "I hadn't considered the risk of zombie gymnastics. I'll speak to Bill and see if we can get something in place.",
    "Hello, Bill.",
    "Of course, Bill, go ahead.",
    "Yes.",
    "Oh?",
    "That sounds great, Bill, but right now I need to add some additional defences to the walls in case more zombies attack.",
    "That could work. I assume I have to source the logs myself as usual?",
    "You do? We could have used those to build the fort!",
    "It's not safe out there, Bill. I'll handle the assembly, you get back inside as soon as you can.",
    "I'm on top of it, don't worry, all the supplies are in place.",
    "That's all of them! I should see if Siv has had any luck with recruitment.",
    "I've built the fortifications.",
    "I was pretty excited too.",
    "Well... I'm going to check with Siv to see how she's getting on with those guards. Try not to scare anyone.",
    "The Raptor and I squashed a few zombies outside, and I've fortified the outer walls.",
    "Don't worry, we handled it.",
    "Oh? That's good news, but how are we going to pay for them?",
    "Sounds like everything is well in hand then. Will we house them here in the command centre?",
    "Where, then?",
    "Of course! I'll have Bill draw up some plans for a guardhouse immediately.",
    "Not yet, Siv. I still need to speak to Bill.",
    "I just thought you should know we have guards on the way now.",
    "I'm going to have my architect draw up some plans for a guardhouse.",
    "Good talk.",
    "I'll have to stop you there, Bill. We need to repurpose your plans.",
    "A tavern sounds lovely, but what we need much more urgently is a guardhouse.",
    "Exactly.",
    "Great work as always, Bill. Sorry about your inn.",
    "Bill's drawn up plans; I'm working on them at the moment.",
    "Bill drafted a really good plan for a beer garden.",
    "We repurposed it into a guardhouse.",
    "Well, I'll just get on and build it by myself then.",
    "Now that's a good-looking guardhouse! I'm sure Siv and the Raptor will have something to say about it.",
    "The guardhouse is ready!",
    "...",
    "Moving on...",
    "Any news on some guards?",
    "Yes?",
    "You're saying they need a firm hand?",
    "Raptor. Buddy! How about-",
    "You didn't even let me finish.",
    "Uhh, Siv...",
    "Where did you say you found these 'guards'?",
    "Are they...",
    "*Black Knights*?!",
    "Siv, a moment please?",
    "Why are there Dark Warriors inside my fort?",
    "We're supposed to be keeping the dangers of the Wilderness out!",
    "They're evil, didn't you hear them?",
    "DARK WARRIORS RULE!",
    "Huh?",
    "I'm not surprised.",
    "Alright, I get it. Let's hope we can find someone to keep them under control.",
    "Siv has explained your situation.",
    "Welcome to Fort Forinthry!",
    "Try not to steal anything.",
    "So I hear. Tell me more about them.",
    "Still?",
    "Are there a lot of bandit gangs in the Wilderness?",
    "What happened to the Dark Warriors then?",
    "Why?",
    "I hear you.",
    "That's right! Keep up the good work.",
    "Good job.",
    "He's is[sic] a bit blunt, but he's been nothing but helpful so far.",
    "Besides, his talent in battle speaks for itself. Worth comes in battle.",
    "That's all of them!",
    "We're clear.",
    "An ancient crypt that's inexplicably open?",
    "I would hazard a guess the undead are coming from here.",
    "I wonder who built this.",
    "That's not good.",
    "Zemouregal?",
    "What are you doing here?",
    "Could you be raising an undead army to attack my fort?",
    "Your minions are easily defeated!",
    "Run from a fight? That doesn't sound like you.",
    "That was intense! Hopefully the Raptor can tell me what we're up against.",
    "Yes, we did. It seems a necromancer named Zemouregal was summoning them as a distraction.",
    "I'm not sure yet. Hopefully the Raptor can tell me what we're up against.",
    "What? Why?",
    "You don't seem like the kind to care about something like that.",
    "I'm sure we can find somewhere for you to sleep. A new vacancy has just opened up, in fact.",
    "We have some rather undisciplined guards in need of guidance.",
    "Yes, yes. I expect all they really need is a good example.",
    "Excellent leadership skills!",
    "You'll have to address me as 'your grace', of course!",
    "Of course. We won't let the fort come to harm.",
    "Did you have a plan for the undead in the crypts?",
    "Why should I follow your quotas?",
    "Oh, so you're a slayer master now?",
    "You give out assignments, you reward equipment, how are you any different?"
  ],
  "The Raptor": [
    "...",
    "This is your fort.",
    "Less talk.",
    "Undead have been seen to the north.",
    "More than usual. If they attack, your fort will be destroyed.",
    "We will prevent it.",
    "Yes.",
    "Meet me beyond the north gate. Come equipped for battle.",
    "I will go north. Slay the undead to the west.",
    "Slay the undead to the west!",
    "That will do for now.",
    "They will return. You need to fortify the perimeter.",
    "Your walls will be useless when they form a ramp out of their own corpses.",
    "You have not yet fortified the walls.",
    "...",
    "You have not yet fortified the walls.",
    "...",
    "...",
    "...",
    "...",
    "...",
    "...",
    "...",
    "...",
    "...",
    "...",
    "No.",
    "I am no leader.",
    "Yes.",
    "Your guards fought off more zombies on their way here.",
    "Meet me at the northern gate. We will search for the source of the undead.",
    "Meet me at the northern gate. We will search for the source of the undead.",
    "As before. Stop the western attack.",
    "You cover the western walls!",
    "About time.",
    "...",
    "Phantom. A strong one. Looks like it came from the north.",
    "Come with me.",
    "Hmph. Ready yourself.",
    "All that matters is who, or what, is raising the undead.",
    "Over there.",
    "Zemouregal!",
    "We should retreat.",
    "We are at a disadvantage. When we return, we will not be.",
    "I will remain in the fort.",
    "Zemouregal will attack eventually.",
    "No matter your bluster, he is an ancient necromancer and a serious threat.",
    "If the fort falls, the kingdom beyond is in danger.",
    "You know nothing about me or my history.",
    "...",
    "I told you-",
    "I am here to kill. If they learn by watching, so be it.",
    "If they betray us, I will kill them too.",
    "...",
    "We must cull the undead in the crypts to prevent their numbers from building.",
    "When you are ready to do that, return to me.",
    "We will cull them separately. Working together is inefficient.",
    "I will assign you a quota to kill, which I will match. This way we can track our kills.",
    "I possess a large quantity of slayer equipment. Do as I instruct and I will share it with you.",
    "No.",
    "They are content merely to observe and instruct. Worth comes in battle."
  ],
  "Overseer Siv": [
    "Welcome to the command centre.",
    "We really need to make improvements to the security of the fort.",
    "He was.",
    "They did.",
    "He did.",
    "I couldn't agree more. Now even the Raptor has wandered in unchallenged.",
    "Famous slayers, thinking they can wander wherever they want just because no one can stop them.",
    "And that armour. 'I'm so mysterious!' Like anyone cares what he looks like.",
    "Only by reputation. But I know his type.",
    "I have some ideas. Leave it with me.",
    "Welcome to the command centre.",
    "Not yet. Did you find out what the Raptor wants?",
    "Welcome to the command centre.",
    "I've sent word to some of my associates, Your Grace. I've no reply as of yet.",
    "What about the Raptor?",
    "Minor situation? You know what, I don't want to know. I'll see if I can speed up acquiring those guards.",
    "Welcome to the command centre.",
    "I've heard back from my associates; I should be able to confirm a guard force shortly.",
    "How goes your affairs with the Raptor?",
    "Good. Have you thought about where you're going to station your guard once they've arrived? We could use a guardhouse.",
    "Welcome to the command centre.",
    "Have you been busy?",
    "Zombies?! It would be useful to be informed about these things.",
    "I'm sure. Well, some more good news - I found us some guards.",
    "Ah, well, I have that handled. You need not concern yourself.",
    "In my comm- no! I mean, that may not be the best plan.",
    "Perhaps... a new building?",
    "Very good.",
    "Welcome to the command centre.",
    "Any progress with the guardhouse?",
    "Welcome to the command centre.",
    "Any update on the guardhouse?",
    "Excellent.",
    "Welcome to the command centre.",
    "It looks good, all things considered.",
    "What do you think?",
    "...",
    "They should be here already.",
    "One minor thing...",
    "Our new guards are a little rough around the edges, and they're leaderless.",
    "Mm. We could use a captain.",
    "Finally.",
    "Yes.",
    "Why do you ask?",
    "Of course not!",
    "They're, uh...",
    "You wanted guards, I found us guards.",
    "Right. So what's the problem?",
    "Oh!",
    "They're not evil, they're just a bandit gang.",
    "Dark Warriors is the name of their gang.",
    "Their leader Cyrus got murdered by some Zamorakian.",
    "With that and all the recent mammoth attacks, they just want to get out of the Wilderness, but none of the kingdoms will have them.",
    "We need the muscle, and they're no friends of the Zamorakians.",
    "They fought off a lot of other gangs to get here, and best of all they'll work for room and board.",
    "I'll show them the guardhouse and get a watch rotation going.",
    "Welcome to the command centre.",
    "Good work on the guardhouse.",
    "Are you sure we can trust the Raptor? We don't have any idea who it is under that armour.",
    "Now you're starting to sound like him!",
    "Welcome to the command centre.",
    "Did you find the source of the undead?",
    "A distraction? A distraction from what?"
  ],
  "Bill": [
    "I'm working on it; I just need to speak to Bill.",
    "Oi-oi!",
    "Uh... that is... hello, your grace.",
    "I have something to ask, if that's okay?",
    "I'm sure you've noticed the foundations for a new building to the south of the fort.",
    "Well, I've been drawing up plans for an inn. We could call it 'The Wildy Wall'.",
    "Ground-floor tavern. Beer garden. Three floors of bedroo-",
    "Oh, zombies? Hm. What you want are some whacking great wooden spikes. That'll deter them.",
    "I can help you there. I actually have a load left from when we shut down my old sawmill.",
    "Oh they're not suitable for building anything habitable, but for nasty pointy spikes, they'll get the job done.",
    "I'll get the materials dragged outside the walls for you. You want a hand setting them up?",
    "Right you are. I'll make sure they're positioned around the perimeter where you need them.",
    "Plans for that inn are coming along nicely, your grace.",
    "But... beer garden?",
    "Oh right, I suppose that does make sense. We don't want zombies trampling the beer garden.",
    "Okay, this is going to require my good pencil...",
    "Alright. Take off a couple of floors... save some space with a ladder... add a few trophy plaques...",
    "Perfect! There we go.",
    "It's not much of an inn, but at least the guards will be well-rested.",
    "I'll get on and design some improvements you can add later.",
    "It's no bother, your grace. We are here to do a job, after all.",
    "Take a look at the blueprints table to see what materials you'll need to begin construction."
  ],
  "Fort Guard": [
    "This it?",
    "You Siv?",
    "What's up, boss?",
    "DARK WARRIORS RULE!",
    "We're the strongest gang in the Wilderness!",
    "I guess not. We were though.",
    "A few, yeah. You got your Orphans, Rogues, your Furies, the Destroyers and uh... Gladiators.",
    "Most of them are dead now, or working for the Zammies. Better dead than red!",
    "We weren't gonna fight in no demon war. Our leader Cyrus said no, so they killed him.",
    "We been trying to get out of the Wildy ever since.",
    "Have you seen it out there? Demons, dragons, even mammoths have been moving down from the far north.",
    "Demons I can handle, but those things? They scare me.",
    "I guess we're in the Duchy of Forinthry gang now, though. Back on the rise!",
    "Right, boss.",
    "Looks it for now. If we see any Zammies on the move we'll come running."
  ],
  "Fort Guard (#1)": [
    "We're Dark Warriors!",
    "*whistles*",
    "*gasp*"
  ],
  "Fort Guard (#2)": [
    "DARK WARRIORS RULE!",
    "So strong!",
    "*swoon*"
  ],
  "Fort Guard (#4)": [
    "Fourteen? At the same time? You're sure they were demons?",
    "*gasp*"
  ],
  "Fort Guard (#3)": [
    "*gasp*"
  ],
  "Zemouregal": [
    "The Raptor!",
    "Player?!",
    "My plans are beyond your comprehension!",
    "Merely a distraction.",
    "While you dally, my true schemes can unfold without your interference!",
    "On which subject, I have all I need from here for now.",
    "I leave you in the company of my finest."
  ],
  "Congratulations! You have completed": [
    "'Unwelcome Guests' - Complete this quest."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Unwelcome_Guests?oldid=36223352’"
  ]
}