{
  "The Raptor": [
    "We've slain plenty of Zemouregal's undead.Now we press our advantage.",
    "Enough talk.Meet me in--",
    "...",
    "...",
    "Quicker the herald leaves, sooner we return to the crypt.",
    "Finally.To the crypt.",
    "She has some good ideas.",
    "Do not call me that.",
    "...",
    "...",
    "...",
    "The fort's secure. Meet me in the crypt north of here.",
    "I'll occupy Zemouregal's undead.Find materials to build a bridge over this lava.",
    "You don't have enough building materials.Find [number/one] more.",
    "Let's take a closer look at that door.Careful. It could be trapped.",
    "Something popped out of the seal.",
    "Talk to Reldo the librarian in Varrock palace.",
    "...",
    "Talk to the librarian. That's why we're here.",
    "Too late.",
    "I'll handle this. I've dealt with the land of dreams before: a shared dream sung by a siren witch. Show me how to enter the dream.",
    "What happened? I barely remember. I was with you in the library.",
    "I've walked these dark plains for hours. There's no end to them.",
    "And you? Are you real?",
    "We need to find a way out.The house...",
    "Looks like the only real place in this dream.All I recognise, at least.",
    "You shouldn't be here.",
    "The door mechanism works through weighted pressure plates.",
    "Looks like moving these large rocks is the key to getting past the doors.",
    "They're big rocks. They're in our way.",
    "You'll need to move this.It needs a delicate touch.",
    "No.You move it.",
    "Don't show this.",
    "Nothing to you.",
    "They're just people.Nothing more.",
    "I don't know them.Leave it.",
    "No! Don't run in!",
    "The fire.They'll die.",
    "We need to get to them.",
    "Enough. Help me get there. Another door ahead.",
    "I can save you!Just hold on!",
    "Faster.We need to reach them.",
    "We NEED to get to the house.",
    "...",
    "...",
    "She won't listen to you.",
    "She died a long time ago.",
    "She's me.",
    "And the graves...",
    "Yes.",
    "Yes.",
    "It was...a compromise.",
    "With Roald.I never wanted to be a queen.",
    "Being waited on; the dresses, courts and diplomacy...",
    "The luxury Bianca was willing to kill for. I hate it. It makes you weak.",
    "Because I love him! His beard, his nose, that tremor in his voice when he tries to sound confident that only I know is there.",
    "But I wasn't ready to just abandon my own life.",
    "Roald's authority was tenuous at the time and the dukes were looking for any sign of weakness.",
    "He's not a natural fighter, and being upstaged by a commoner could have been disastrous.",
    "Yes. As long as I'm there when he needs me, I can still get out into the real world most of the time.",
    "In part. I've never been...gracious. But it's useful to mislead people.",
    "I'm...sorry about that business with the garden.",
    "...Maybe. I hadn't thought of that. First we have a crisis to deal with.",
    "We're not leaving yet. We still haven't found what we came here for.",
    "Then you'd better try to keep me focused. Come on. Let's go deeper.",
    "Deeper. Darker.There's a beam of light up ahead. Light is good.",
    "Let's get back to lighting those pillars, so we can get out of here.",
    "Leave them to me. I need to do this.",
    "Roald?What are you doing here?",
    "You look different.What's happening?",
    "That's 'King Roald' to you.",
    "This isn't him.It looks just like my husband, but I can't explain why he's here.",
    "What are you talking about? You're not making any sense.",
    "Bianca?You died.",
    "You tried to kill my husband!",
    "Shut up!You don't understand anything!Get out of my head!",
    "Can't dwell on it. I see another light leading us forward.",
    "What now?",
    "You're not real.Your words can't hurt me.",
    "I'm not weak.I did everything I could.I was a child!",
    "Are we back? Is this the real world? Or are we still in a dream?",
    "The librarian wasn't here when I woke up. I suppose he had other business.",
    "What happened...in the dream.You'd better not...",
    "That is, I command you to--",
    "What I'm trying to say is...Thank you for waking me up.",
    "Though we're no closer to opening that damned door.",
    "I'll meet you there.",
    "Meet me in the crypt to the north. Hurry!",
    "...",
    "Necrotic energy.The magic of a necromancer.",
    "Hmph. Ready yourself.",
    "Let's push on and get through that door.",
    "Somebody's already broken the seal!",
    "The stench of death surrounds us.Tread carefully as you explore this tomb.",
    "I hear movement nearby. Someone has beat us to the punch.",
    "Don't recognise it. Could be anywhere.",
    "What was the incantation you read in my dream?",
    "That fits the dragonkin dialect. Vorkath could be a place. When we're back, we'll have to do some research to see if anyone has heard of it.",
    "We've seen bigger.",
    "Dead or not. Let's not forget Zemouregal uses necromancy.",
    "Might be his intent. To raise it.",
    "It's a table.",
    "Good observation.",
    "What is this here?",
    "He must've left his undead behind to disassemble it and cover his tracks. There are still pieces on the table so they're likely nearby.",
    "I'll inspect the map and guard what's left of it.",
    "I have faith in you.",
    "I'll keep watch here. Find the missing map pieces.",
    "Now we've got all the pieces, we need to reconstruct the map in its original form. It's useless right now.",
    "Try sliding each tile into its correct position.",
    "If you're struggling...",
    "I could always do it for you...",
    "...for a price.",
    "100 million coins.",
    "No.Solve it.",
    "Fremennik territory.",
    "I don't either. Do you have a map?",
    "Could have been hidden on purpose.",
    "Could well be.",
    "Overseer Siv is Fremennik. Copy down the map and bring it to her. See if she knows anything of this mysterious isle.",
    "Player.",
    "Remember. Nobody is to know my identity. Ever. No matter the stakes.",
    "See you back at the fort.",
    "Why are you still here? We need to head back to Fort Forinthry and show Siv a copy of this map.",
    "The overseer is in the command centre.",
    "What did the overseer say?",
    "Just a dragon? Not impressed. I've killed lots of dragons.",
    "You're right. Zemouregal's our priority. Let me know when we set sail.",
    "Until then."
  ],
  "Player": [
    "Zemouregal's interest in the crypt north of here troubles me. 'I have all I need from here for now', he said.",
    "He claimed raising an undead army to attack my fort was 'merely a distraction'.",
    "Sounds like [title] business. I'll see what all the commotion is about.",
    "I'll see what all that fuss is about at the townhall.",
    "I didn't expect to see you here.",
    "Hello again, Aster. What's that you're reading? Another mystery novel?",
    "Yes, I--",
    "No, I--",
    "I don't know whether to laugh or cry.",
    "What is it, Siv? The Raptor and I need to investigate why Zemouregal was in the north crypt.",
    "We should recruit a guard captain fully dedicated to training the guards and defending the fort.",
    "Do you have a candidate in mind?",
    "Yes. Send her right in.",
    "Welcome...",
    "(Let me check my notes...)",
    "Sofía!",
    "Are you new around here?",
    "Hush, you lot!This is a private interview.",
    "Well, you've got my full attention.Let's begin the interview!",
    "Don't be intimidated by the Raptor, by the way.He's just here to observe.",
    "So then, Sofía. Why did you apply to be Fort Forinthry's guard captain?",
    "It's good to see you're passionate.",
    "You mentioned you're a born leader. How do you demonstrate this quality?",
    "Hmm...",
    "Imagine this situation. A guard under your command has disobeyed an order to patrol the fort walls, and instead spent the day at a gnome ball game. How would you handle it?",
    "(I really should have prepared some questions for this interview... Uh...)",
    "What would you rather fight: one hundred imp-sized unicorns or one unicorn-sized imp?",
    "I wasn't expecting such a detailed answer. It seems you're quite the tactician.",
    "What would you say is your greatest weakness?",
    "I don't know. I've just heard it's a common interview question...",
    "You're right. Stupid question. Moving on!",
    "I think we'll move on.",
    "Let's move on.",
    "Some good answers. Moving on.",
    "You've answered all my questions so confidently. You're clearly more prepared for this interview than I am.",
    "I have one more question for you, Sofía.",
    "What actions would you take to help defend against the recent undead attacks?",
    "Wow...",
    "What do you think of that, Raptor?",
    "That's the nicest thing I've ever heard him say.",
    "Well, I think that settles it! Sofía, you are hereby 'Captain of the Fort Forinthry Guard', should you choose to accept.",
    "Cap Rap...",
    "...You are relieved of your captainly duties and may reside at the fort as our welcome guest.",
    "Thank you for your service. No need for a speech.",
    "Alright, Guard Captain Sofía. Your first order of duty will be to speak to Bill at his workshop. Give him the specifications for your 'ranger's workroom'. Tell Bill I've sent you, and he'll draw up some plans.",
    "The sooner I interview a new guard captain, the sooner we can leave.",
    "I need to talk to Bill.",
    "Happy with your new position?",
    "I'll chat to Bill and see what we can do.",
    "Hello again, Bill.",
    "Have you met Sofía, our new captain of the guard?",
    "You really do have your heart set on that beer garden, don't you, Bill?",
    "Maybe it's time for...",
    "An...Inn-tervention.",
    "That's why we need to 'bolt' on a fletching extension, Bill.",
    "The Raptor and I are going on an adventure, and we need to ensure the fort is well-defended in my absence.",
    "It's incredible how fast you work, Bill.Thanks again!",
    "We're going to build out the extension to the guardhouse to help supply ammo. As captain of the guardhouse, you'll have to manage this area too.",
    "Sure!",
    "I need to see if my new hire is happy with the ranger's workroom.",
    "Hello! I see you've already found yourself right at home here.",
    "The Raptor and I need to head to the crypt north of here. Just checking you have everything you need before we go?",
    "Brilliant. I feel a lot better knowing the fort is in capable hands. I'd better go and see if the Raptor is ready to investigate the crypt.",
    "The Raptor recommended I meet up with him.",
    "Zemouregal failed to open this door with brute force. Maybe there's a more thoughtful solution around here he missed.",
    "Something tells me it's going to take both of us to solve this.",
    "I need to investigate this door with the Raptor.",
    "I should show this to the Raptor.",
    "What do you make of this, Raptor?",
    "We should research this device. Magical artefacts can be dangerous.",
    "The Raptor said I should show this to Reldo in the library of Varrock palace.",
    "I need to learn more of this dragonkin device from Reldo in the Varrock Palace library.",
    "It's not what I expected. There's a surprising amount of busywork.",
    "We found this artefact sealed in a dragonkin door north of Fort Forinthry. Can you identify it?",
    "What happened to the Raptor?Is he dead?",
    "For how long?",
    "That's a little inconvenient. We're on an adventure together. I'll have to get him out.",
    "How do I get a potion of dreamless sleep?",
    "That's certainly very convenient.",
    "I've lost my potion. May I have another?",
    "I'd rather not get trapped in a nightmare prison. I need to drink a potion of dreamless sleep before I enter the Raptor's dream.",
    "Should?",
    "I need to use this close to the Raptor so I can enter his dream.",
    "Are you alright?",
    "You fell into a dream state after you touched the device from the door.",
    "Reldo did try to warn you but--",
    "I'm very real. Reldo gave me a potion to help me enter your mind.",
    "Entering a dream within a dream? That's a little much for me. I'll stay where I am.",
    "What are they to you? It's your dream. Perhaps a metaphor for something?",
    "Can't you just give it a little love tap?",
    "Who are they?",
    "Who are those people?",
    "It's your dream. They'll be manifestations of your subconsciousness. Surely you know them?",
    "The Raptor? Caring about people?",
    "What is it?",
    "Hey.Are you alright?",
    "Why not?",
    "How do you know that?Who is she?",
    "Your parents!",
    "You're the Raptor?",
    "Why?",
    "With whom?",
    "Then why did you marry the king?",
    "Couldn't you have been a sort of warrior queen?",
    "So you started wearing a disguise?",
    "And being rude to people? Is that an act too?",
    "Your garden of tranquillity in Varrock palace? I think I understand.",
    "The king's position seems secure these days. Maybe there's room to re-negotiate your compromise.",
    "How do we get out of here, then?",
    "Earlier, it was like you were dreaming. You weren't entirely lucid.",
    "Where are we now?This place is creepy.",
    "Let's find out.",
    "What's Roald doing here?",
    "Let's follow that light. I think it's leading us somewhere.",
    "Bianca Dunnett. Aster's sister, who murdered the Duke of Edgeville. What is she doing here?",
    "The dream...it's changing!Something new has appeared.",
    "I suppose we'll never know for certain.",
    "No! I remember. The writings on the wall. The dream journal. I learned the incantation that'll breach the seal on the dragonkin door. We have to get back to the crypt!",
    "I should talk to Ellamaria.",
    "You shake the ball, expecting something to happen...but nothing does.",
    "Oh no! The crypt guards. They're both dead!",
    "Zemouregal.Who else could it be?",
    "Where is this?",
    "Draekeun. Vorkath. Skek Pthen.",
    "That's a big dragon.",
    "We've fought bigger, yes. But let's not forget that one was chained up underground. This one looks pretty free to roam.",
    "It doesn't look like a dragon I've ever seen before. I imagine, based on the age of this tomb, that this dragon could have been killed by now, or at least died of old age.",
    "Sounds like a plausible plan, but he could raise any dragon. What would be so special about this one?",
    "Over here! Look at this. Are you seeing what I'm seeing?",
    "It's clearly a table, but that isn't what I am pointing out.",
    "The dust has been disturbed.",
    "It looks to have been broken recently too.",
    "That's part of a map! There must have been an entire map here. Zemouregal has taken it.",
    "Help me look around. Let's see if we can wrest all the pieces from their grabby rotten hands before they finish collapsing this tomb.",
    "After all we've been through together? What if I get mauled by zombies?",
    "Looks like the table is missing some pieces. I wonder if they're around here somewhere.",
    "There we go. That seems to be all of them. I can't quite make out what it's a map of as it's all jumbled up.",
    "I reckon I can figure this out by moving the pieces around.",
    "How much?",
    "...Really?",
    "That looks complete.",
    "Should see what the Raptor thinks of this.",
    "The map appears to represent the Lunar Sea.",
    "But look! I don't recognise that island there.",
    "I've got one right here.",
    "It just isn't there. How could an island be missed off map records?",
    "The two murals in this room. You don't suppose that one there is the island and the other is perhaps the inhabitant of this island?",
    "That sounds like a good plan. Let's get out of here. I'll see you back at the fort.",
    "Yes?",
    "It's our secret.",
    "Overseer Siv back in Fort Forinthry will be able to help us further. I've traced a map of the new island and where it sits. Hopefully she'll be able to help us.",
    "Siv, the Raptor and I discovered an ancient map in the crypt north of here! I think it's a very old representation of the Lunar Sea, but we don't recognise one of the islands on the map.",
    "That can wait. Here, I sketched the shape of the islands.",
    "And the mysterious island?",
    "I don't believe that's a rumour. There are two murals in the room that sit either side of this stone map. One depicts a dragon, the other an island.",
    "Zemouregal seems to have taken an interest in Ungael. We interrupted his undead who had dismantled the map and attempting[sic] to collapse the crypt. No doubt he commanded them to cover his tracks.",
    "Alright. I'll report back to the Raptor. He'll have made it back to the guardhouse by now.",
    "She confirmed our mystery island does exist. The Fremennik people know of it, but steer well clear of it.",
    "They call it 'Ungael' and it's guarded by a dragon.",
    "Siv is looking to charter a ship to explore the island. Time is of the essence; it's clear Zemouregal desires something on Ungael."
  ],
  "Herald of Varrock": [
    "Quiet, please!",
    "I have an announcement.",
    "It'll be worth the wait.",
    "I assure you.",
    "All shall be revealed.",
    "As soon as the [title] arrives.",
    "Please leave questions 'til the end.",
    "Quiet, please.I have an announcement to make!",
    "[Title] Player, on behalf of King Roald and Queen Ellamaria of Varrock, it is my pleasure to present you with a token of their gratitude.",
    "For your quick thinking, valour and continued defence of the kingdom, the King and Queen bestow upon you...",
    "No, even better!Behold, your royal gift...",
    "Magnificent, isn't it?King Roald III and Queen Ellamaria, painted by none other than Judith Singer of Lumford. You must be delighted.",
    "Yes.",
    "Isn't it just?",
    "No.",
    "It does take the breath away, doesn't it?",
    "Well, I'd best return to the capital. Keep up the good work on the wild frontier."
  ],
  "Princess": [
    "*happy barking*",
    "*avaricious barking*?",
    "*worried barking*"
  ],
  "Overseer Siv": [
    "A herald from Varrock has arrived.I wonder why.",
    "A mountain of gold coins?",
    "Your grace, may I have a word with you?In private?",
    "Yes, that's what worries me. Our guards report frequent injuries.",
    "Zombie bites. Claw marks. The occasional disembowelment.",
    "The trouble you see, with the fort guards...",
    "*Aside* from their stubborn insistence on doing *that*... ...is that they're warriors.",
    "Unfortunately, undead have supernatural strength in close combat, making them formidable melee combatants.",
    "And while that Raptor fellow does set a fine example by not getting torn asunder by fetid zombies, our fort guar-- new recruits are not so resilient.",
    "Yes, then the Raptor can focus on adventuring, slaying and brooding. Not necessarily in that order.",
    "One of the guards stands out as a promising leader.",
    "If you'd like to interview her, I'll make the arrangements.",
    "Welcome to the command centre.",
    "Amazing! I'll come look at what you've discovered.",
    "Clever idea! Hmm, yes, this is definitely the ocean north of Rellekka. All Fremennik know of those treacherous waters.",
    "The Fremennik call it Ungael. We steer well clear of that island. It's rumoured to be guarded by a ferocious dragon. More powerful even than Elvarg of Crandor.",
    "Hmm, most worrisome. I'll see if I can call in a favour with one of my contacts in Rellekka. I might be able to charter a ship."
  ],
  "Aster": [
    "Oh, hello, your grace.It's delightful to see you again.",
    "Oh, quite the contrary. 'Culture and Customs of the Dragonkin'. It's volume 2 in a series written by Mr Mordaut, the Professor of Unnatural History at Varrock museum. We're old friends.",
    "Did you know dragons are experiments created by the dragonkin? A reptilian race older than Gielinor itself!",
    "Huge tracts of land?"
  ],
  "Fort guards": [
    "FORT GUARDS RULE!",
    "FORT GUARDS RULE!",
    "FORT GUARDS RULE!"
  ],
  "Sofía": [
    "No, your grace. I came here with the rest of the fort guards.",
    "I'm surprised you haven't noticed me; I'm not exactly quiet.",
    "I'm ready!",
    "I applied because I'm a born leader!",
    "I've got a bunch of skills that go cruelly under-used standing guard all day. That's not to say my current role isn't important, but I know I have much more to offer Forinthry and its people.",
    "When I heard about the position, I saw the opportunity to show what I'm capable of. So here I am!",
    "I lead by example. Patrolling the wilderness, defending against rowdy zombies, or even just standing watch, I'm there with my fellow guards, showing them how it's done and cheering them on.",
    "Leading a guard force isn't just pacing back and forth on a castle rooftop shouting orders...",
    "It's about integrity, and standing shoulder-to-shoulder with your comrades, fighting to protect what's important.",
    "Hmm...",
    "If a guard under my command shirked their duty to watch gnome ball?",
    "I'd *tackle* the situation head-on.",
    "They'd get patrol duty for a week! I'd have the other guards occasionally pass a gnomeball to them, and for every missed catch, they'd get an extra day on  patrol!",
    "Great question!",
    "The tiny unicorns would definitely be the easier to squash. But it's all about the challenge for me!I'd take on the big imp.",
    "I'm not getting up close to that hideous face, especially one that big.",
    "I'd keep my distance and fire a binding shot to keep it still.",
    "Then I'd aim my crossbow at its eyes and blind it.",
    "Finally I'd dish out rapid-fire pain until it was nothing but impious ashes and hide!",
    "What kind of question is that?",
    "Seems kind of silly to me. I'm trying to sell myself here.",
    "What do you want me to say? 'I work too hard'?",
    "(That was a short interview. I hope it's going well...)",
    "(It felt like there'd be more questions...)",
    "(I think they skipped a question. Seems to be going well, though...)",
    "I work hard. I fight hard. I play hard.",
    "Oh! I'm so glad you asked! I've already thought a lot about this.",
    "Most of the guards are skilled in melee combat. I'm quick enough with a blade, but my real talent is firing a crossbow. And I'm not too shabby at making them too!",
    "Us guards are less 'dark warriors' now and more 'wilderness rangers', but we don't actually have any range... Unless throwing punches counts.",
    "The undead are mostly slow and easy to take out from a distance, especially the zombies.",
    "We've had a lot of injuries recently. There's really no need for any of us to get bitten when there are ways to both protect our fort and keep our guards safe.",
    "I want to build a designated 'ranger's workroom' inside the fort to supply our guards with ranged equipment.",
    "There'll be mandatory training for all our guards in crossbow use and maintenance, which I'll lead.",
    "And finally, I'd oversee the building management alongside the guardhouse, including keeping an inventory of the fort's ammunition.",
    "Of course! Thank you, your grace. I won't let you down!",
    "My workroom?",
    "I'm on my way!"
  ],
  "Guard captain Sofía": [
    "Very. I've met the team and they're all great. But it's time to get to work. We need to establish and build out an extension to this guardhouse to supply the fort guards...",
    "...with enough ammo, bows, and crossbows to ensure we're well defended.",
    "Oh? More responsibility? Already? Am I doing that well?",
    "Happy to be here, [Title] Player.",
    "Thank you. I've done a quick round of the fort. All the guards are set up and I've ensured we're supplied to keep any attacks at bay.",
    "You should have nothing to worry about whilst away. Focus on your task, and we'll check in once you return.",
    "Good luck!"
  ],
  "Bill": [
    "Oi-oi, your graceness.Your graciousness?Your grazed-knees-ed-ness?",
    "Let's start over.'Ello, mate.",
    "Yes. Her specifications for the ranger's workroom notably lacked a wine cellar, beer on tap and a patio.",
    "Don't say it.",
    "I can't believe you said it.I'd tell you to get out, if this workshop weren't already open-air.",
    "We're quickly filling up the fort. At this rate I'll have to build the Wildy Wall outside the wildy wall. And the walking dead don't tip worth a damn.",
    "Please, stop.",
    "Right you are.Fort knightly crossbow training it is.",
    "I've already drawn up Sofía's plans, with some additional ideas for upgrades too. They're on the blueprints table when you're ready to start construction."
  ],
  "Material ghoul": [
    "Wise fwom your gwave!"
  ],
  "Reldo": [
    "Ah! The new [Title] of Forinthry.What a pleasant surprise.",
    "How are you finding your new role?",
    "Indeed. New identities can be challenging, as can old ones. Something I'm sure everyone here can attest to.",
    "Now what can I do for you, Your Grace?",
    "Hmm, yes. This looks familiar. I remember seeing a similar dragonkin relic in the manifest from an archaeological dig on Anachronia.",
    "There we are. The colouration's different from a ceremonial dragonkin device, but the shape is unmistakable. I shan't bore you with the details...",
    "...but studying such a device caused the observer to fall into a deep sleep and have vivid dreams.",
    "You could think of it as a 'dream journal' of sorts - this device both inspired and recorded the dreams of its owner.",
    "...Certainly.You need only gaze meditatively into one of the facets until you feel sleepy.",
    "Oh, dear! It appears the device is trapped. The dragonkin guard their secrets so jealously. If only your companion hadn't been in such a hurry, I could have warned him.",
    "No, he's imprisoned in a mental maze constructed from his worst nightmares!",
    "Forever-ish.",
    "Hang on. You'll need to drink a potion of dreamless sleep before you use the device. Wouldn't do for you to get trapped in nightmares of your own.",
    "By a startling coincidence, I happen to have one to hand.",
    "Isn't it just? A renowned enchanter, with a brilliant mind and spectacular good looks, brewed up a batch for me. It's done wonders for my insomnia.",
    "Well, I would give you a potion of dreamless sleep, but your backpack is full.",
    "Well, I would give you a potion of dreamless sleep, but your backpack is full.",
    "Now go on and drink that potion. It's quite safe.",
    "The potion you drank will suppress your dreams. Activate the dragonkin device, and it should bring you into the Raptor's dream.",
    "Should. Best be quick. If the potion wears off, you may be trapped forever in a cage of your own nightmares.",
    "I have an errand to run, so can't stay to keep an eye on you, but I'll close the library so you can have some privacy. Pleasant dreams!"
  ],
  "[Strange girl": [
    "] I love you, Mummy! I love you, Daddy!"
  ],
  "Strange girl": [
    "Come back!",
    "*screams*",
    "*sobs*"
  ],
  "[Enemy]": [
    "AHHH!"
  ],
  "King Roald": [
    "My dear Ella.We both know our time together won't last forever.",
    "My love. Our bond may be unbreakable, but nothing will stop the passage of time; my inevitable fate.",
    "Farewell, my love.",
    "It burns!"
  ],
  "Bianca": [
    "Why would you do this to me?He made me do it.I had no other choice.",
    "I didn't deserve this.After all our years of friendship...",
    "You call yourself a Queen.You don't deserve that title.It was given to you.",
    "What kind of Queen treats their citizens like dirt?",
    "*cough*"
  ],
  "The Raptor (dream)": [
    "You act tough, but you're still that little girl, gawping helplessly at a burning building.",
    "Pathetic.Helpless.Useless.",
    "You can hide behind all the masks you want, but deep down, you know how weak you are!",
    "Hahaha"
  ],
  "Congratulations! You have completed": [
    "'Dead and Buried' - Complete this quest."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Dead_and_Buried?oldid=36198237’"
  ]
}