{
  "Juna": [
    "Tell me... a story...",
    "I have been waiting here three thousand years, guarding the Tears of Guthix. I serve my master faithfully, but I am bored. An adventurer such as yourself must have many tales to tell. If you can entertain me, I will let you into the cave for a time. The more I enjoy your story, the more time I will give you in the cave. Then you can drink of the power of balance, which will make you stronger in whatever area you are weakest.",
    "Tell me... a story...",
    "Your stories have entertained me. I will let you into the cave for a short time.",
    "But first you will need to make a bowl in which to collect the tears. There is a cave on the south side of the chasm that is similarly infused with the power of Guthix. The stone in that cave is the only substance that can catch the Tears of Guthix. Mine some stone from that cave, make it into a bowl, and bring it to me, and then I will let you catch the tears.",
    "I have been waiting here three thousand years, guarding the Tears of Guthix. I serve my master faithfully, but I am bored. An adventurer such as yourself must have many tales to tell. If you can entertain me, I will let you into the cave for a time. The more I enjoy your story, the more time I will give you in the cave. Then you can drink of the power of balance, which will make you stronger in whatever area you are weakest.",
    "The Third Age of the world was a time of great conflict, of destruction never seen before or since, when all the gods save Guthix warred for control. The colossal wyrms, of whom today's dragons are a pale reflection, turned all the sky to fire, while on the ground armies of foot soldiers - goblins and trolls and humans - filled the valleys and plains with blood. In time the noise of the conflict woke Guthix from His deep slumber, and He rose and stood in the centre of the battlefield so that the splendour of His wrath filled the world, and He called for the conflict to cease! Silence fell, for the gods knew that none could challenge the power of the mighty Guthix; for His power is that of nature itself, to which all other things are subject, in the Guthix reclaimed that which had been stolen from Him, and went back underground to return to His sleep and continue to draw the world's power into Himself. But on His way into the depths of the earth He sat and rested in this cave; and, thinking of the battle-scarred desert that now stretched from one side of His world to the other, He wept. And so great was His sorrow, and so great was His life- giving power, that the rocks themselves began to weep with Him. Later, Guthix noticed that the rocks continued to weep, and that their tears were infused with a small part of His power. So He set me, His servant, to guard the cave, and He entrusted to me the task of judging who was and was not worthy to access the tears.",
    "I have already told you my story, and you have not told me yours!",
    "Before you can collect the Tears of Guthix you must make a bowl out of the stone in the cave on the south of the chasm.",
    "I will tell you the story of the light creatures. Myriad and beautiful were the creatures and civilizations of the early ages of the world. Gielinor was a work of art, shaped lovingly over the millennia by the creative mind of Guthix. Only the sturdiest races survived the God Wars, and even then only by abandoning their high culture and gearing their societies towards war. Of the more delicate races there is now no trace, and almost no memory. One such race had bodies as fragile as snowflakes, yet they built crystal cities that stood for a thousand years. The wind would whisper through the spires and fill them with sweet harmonies, and the rising sun would shine through the precious gems that studded the towers and create inter plays of light as if rainbows were dancing. Indeed, so marvellous was this light-show at its height that the patterns of light themselves became alive, and great flocks of luminous creatures rode along the gem- cast beams, each drawn to its own colour. The creatures you see floating in this chasm are the last sorry remnants of that age. I do not know how they made their way here and survived to this time, but I am grateful for their company.",
    "I will keep your bowl for you, so that you may collect the tears many times in the future. I suggest you keep the lantern you used to attract the light creatures. I foresee a time when you will need it again. Now, tell me another story, and I will let you collect the tears for the first time.",
    "Now that you can access the tears, let me tell you a further secret... The bowl you have is small enough for now, but should your mining and crafting improve to 80 each then you can create something better. This bigger bowl can catch even more tears from the walls beyond. Mark this well and remember... Now tell me a story in return for this secret."
  ],
  "Player": [
    "A story?",
    "Not now.",
    "Okay...",
    "A story?",
    "What are the Tears of Guthix?",
    "Not now.",
    "You tell me a story.",
    "Tell me about the Tears of Guthix.",
    "Tell me a new story.",
    "But I don't know how to reach the cave!",
    "Okay.",
    "I have a bowl."
  ],
  "(See Transcript": [
    "Juna)",
    "Juna)"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Tears_of_Guthix_(quest)?oldid=33416175’"
  ]
}