{
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "Alternate dialogue when switching genders in between Throne of Miscellania and this quest, dialogue with other citizens when questioning themYou can discuss this issue on the talk page or edit this page to improve it."
  ],
  "Advisor Ghrim": [
    "Greetings, Your Royal Highness.",
    "Your subjects are worried about the possibility of war, but they are still happy to work for you.",
    "Interesting that you should ask that, Your Royal Highness. You see, the people are worried that war will break out again. King Vargas has found himself with little to do now that you are the regent. He intended, at first, to return to adventuring. Unfortunately, we still have not had the doors to the throne room enlarged so that he can leave...",
    "He has been trying to rule once more, in your absence. However, he has once again quarrelled with the Queen of Etceteria. The two of them have been writing letters to each other, threatening to raise armies and declare war on each other once more!",
    "Your Royal Highness, I suggest that you deal with this matter and reconcile the two of them again. Such a quarrel is not good for Miscellania.",
    "Thank you, Your Royal Highness. I suggest you talk to the prince and princess to find out more about the situation. [Princess Astrid/Prince Brand] has been asking after you. [She/He] would very much like to see you once again.",
    "...though your current appearance may well surprise [him/her].",
    "You are the regent of this kingdom, Your Royal Highness. I would urge you to reconsider. However, you are also a busy hero, and thus I understand your reluctance.",
    "Dealing with all the little troubles that come up from time to time, your Royal Highness. Such as the predicament we are now in.",
    "Talking to the citizens of Miscellania and Etceteria, your Royal Highness.",
    "...I believe the King asked you to talk to me, your Royal Highness.",
    "I'm not sure what you're implying, Your Highness.",
    "Ah, of course. Assuming that nobody presently living in Miscellania would have taken them, it is of course likely that someone from outside took them. The sailor who brought you here from the mainland would be the first to see any suspicious visitors. I suggest you ask him about recent arrivals to the island.",
    "Talking to the sailor on the jetty, your Royal Highness.",
    "Asking the King for access to the dungeons, your Royal Highness.",
    "Showing the dungeon guard that you have permission to enter, your Royal Highness.",
    "Investigating the dungeons, your Royal Highness.",
    "Returning the stolen Etceterian items, your Royal Highness.",
    "I believe there was a letter Queen Sigrid wanted you to deliver to King Vargas, your Royal Highness."
  ],
  "Player": [
    "How is the kingdom fairing?",
    "Has anything been happening in the kingdom recently?",
    "So, what has he been doing?",
    "I see.",
    "Very well, I'll sort it out.",
    "No, I don't have the time at the moment.",
    "How do I manage the kingdom?",
    "What am I meant to be doing again?",
    "What do you mean?",
    "About the Task System...",
    "Good day, Your Highness.",
    "I'm known in these lands as [Fremennik name], Your Highness.",
    "That's me, Your Highness.",
    "I'll explain later. Advisor Ghrim said I should talk to you and the [Prince/Princess] about recent events in the kingdom.",
    "Hello darling.",
    "Yes, Advisor Ghrim said I should talk to both of you about recent events in the kingdom.",
    "Hello darling.",
    "That's a pity. Oh, Advisor Ghrim said I should talk to you and the [Prince/Princess] about recent events in the kingdom.",
    "Good day, Your Highness.",
    "I'm known in these lands as [Fremennik name], Your Highness.",
    "That's me, Your Highness.",
    "I'll explain later. Advisor Ghrim said I should talk to you and the [Princess/Prince] about recent events in the kingdom.",
    "I'm known as [Fremennik name] in these lands.",
    "Well, yes...",
    "Advisor Ghrim told me to talk to you about the situation in Miscellania. What has happened while I've been away?",
    "What do you mean, 'an accident'?",
    "What would you suggest he do, then?",
    "I'm not sure that's a good idea...",
    "Are you sure it will work?",
    "That doesn't always work...",
    "I'll give it a try. But they'll still be angry with each other, so I don't think it'll work.",
    "Your Majesty.",
    "What are you busy with, Your Majesty?",
    "I thought I was supposed to deal with those, since you appointed me Regent.",
    "So you're still helping to rule, Your Majesty?",
    "These 'affairs of state' you're dealing with... Would these involve starting a war with Queen Sigrid?",
    "Right away, Your Majesty.",
    "I'm sorry, I have some other things to do.",
    "Well, I suppose I could spare a little time.",
    "Not yet, Your Majesty.",
    "Not quite yet.",
    "What am I meant to be doing again?",
    "King Vargas tells me that things have been going missing from the kingdom. Can you tell me anything about this?",
    "I've spoken to the Miscellanean citizens.",
    "They say that the Etceterian army demanded tithes from them, and took somem of their goods even though they refused.",
    "I'll talk to her right away, Your Majesty.",
    "Your Majesty, do you have a moment?",
    "I hear from King Vargas that relations between Etceteria and Miscellania are none too cordial at the moment.",
    "What happened, Your Majesty?",
    "Of course, it's my duty.",
    "Of course not, it's not my fault.",
    "I suppose you're right...",
    "Excuse me...",
    "Queen Sigrid tells me that things have been going missing from the kingdom. Can you tell me anything about this?",
    "I'll see what I can do.",
    "Excuse me...",
    "Queen Sigrid tells me that things have been going missing from the kingdom. Can you tell me anything about this?",
    "I'll see what I can do.",
    "Excuse me...",
    "Queen Sigrid tells me that things have been going missing from the kingdom. Can you tell me anything about this?",
    "I'll see what I can do.",
    "Excuse me...",
    "Queen Sigrid tells me that things have been going missing from the kingdom. Can you tell me anything about this?",
    "I'll see what I can do.",
    "Excuse me...",
    "Queen Sigrid tells me that things have been going missing from the kingdom. Can you tell me anything about this?",
    "I'll see what I can do.",
    "Excuse me...",
    "Queen Sigrid tells me that things have been going missing from the kingdom. Can you tell me anything about this?",
    "I'll see what I can do.",
    "I've talked to the Miscellanian citizens as well as the Etceterians.",
    "The Etceterian citizens said that Miscellanian soldiers came to their houses and demanded tribute...",
    "...and the Miscellanian citizens said that the Etceterian army marched into their folds and demanded tithes!",
    "Your Majest-",
    "If I may-",
    "Me?",
    "I suppose so...",
    "I suppose you're right.",
    "Not yet, Your Majesty.",
    "Excuse me...",
    "Not yet, I'm afraid.",
    "I've spoken to the Miscellanian citizens, and also the Etceterians.",
    "The Miscellanian citizens said that the Etceterian army marched into their fields and demanded tithes...",
    "...and the Etceterian citizens said that Miscellanian soldiers came to their houses and demanded tribute!",
    "Your Majesty...",
    "I'm not sure that would work very well, Your Majesty.",
    "I'll do that, Your Majesty.",
    "Not yet, Your Majesty.",
    "What am I meant to be doing again?",
    "Yes, that's right.",
    "King Vargas asked me to talk to you. He said you might know about the missing goods.",
    "Er... that you could advise me where to look for them?",
    "What am I meant to be doing again?",
    "I have, Your Majesty. He told me to talk to the sailor who operates the ferry to Rellekka.",
    "I'm looking for a sailor...",
    "The King's advisor said I should talk to you. He said there have been some suspicious people arriving recently.",
    "Oh. Has anyone visited the island recently, then?",
    "What kids from Rellekka?",
    "I didn't realise the King kept people in his dungeons. I didn't know Miscellania HAD dungeons.",
    "So you decided to live in the dungeons instead?",
    "I'm still an adventurer, and I can't be everywhere on Gielinor...",
    "What am I meant to be doing again?",
    "Your Majesty, how do I get into the dungeons?",
    "It's okay, the sailor explained it to me. He said that the only new arrivals on the island were some teenagers, who came from Rellekka to visit their relatives. Those relatives were living in the houses in the dungeons.",
    "Of course, Your Majesty.",
    "I seem to have lost it.",
    "Not yet, Your Majesty.",
    "I have, Your Majesty.",
    "What am I meant to be doing again?",
    "But I'm the Regent! I order you to let me go down there.",
    "Look, the King gave me a scroll saying I have access to the dungeons. I have it right here.",
    "Here you go.",
    "Look, the King gave me a scroll saying I have access to the dungeons. I have it right here.",
    "...oh, I seem to have lost it.",
    "What'll it take to convince you that I'm really the Regent?",
    "A royal proclamation? Does he have to shout it from the battlements, or something like that?",
    "What are you guarding here?",
    "Oh, I see. Can I go down there?",
    "What am I meant to be doing again?",
    "Yes, please.",
    "No, thank you.",
    "What's it like living down here?",
    "I'll see what I can do.",
    "What rumours?",
    "What stories about monsters?",
    "Monsters? What sort of monsters?",
    "What are you doing down here?",
    "Monsters?",
    "What are you doing down here?",
    "Monsters?",
    "What are you doing down here?",
    "Why is that?",
    "What are you doing down here?",
    "What does that do?",
    "Oh, I see.",
    "Okay then.",
    "What are you doing down here?",
    "...such as?",
    "I have. The monster he talked about could be in the caves nearby.",
    "What are you doing down in these caves?",
    "Why not? I thought digging was something dwarves were good at.",
    "Adventurer and Regent of Miscellania.",
    "Of course. Dealing with monsters is what I do best!",
    "Why bother? It can't get through solid rock.",
    "And you're sending me in to deal with it alone?",
    "I wouldn't put it quite like that... But I'll help you after all. Now, how do I find this monster?",
    "Okay, so all I have to do is get through that wall?",
    "And the monster's behind that tunnel?",
    "Just wondering if you were still here.",
    "I've lost that mining prop you gave me...",
    "It's not safe. I need to shore up the walls before I can go through.",
    "That's the bit where I'm supposed to stand when I'm using the lift. Putting a great big engine on the lift platform isn't going to leave much room for me. Maybe there's somewhere else I could fit it.",
    "I can see the embers of a fire up ahead. Has someone else been in these caves?",
    "Hello there.",
    "Sorry?",
    "You can't be a rock. I heard you talking to people earlier.",
    "Your name's Armod, isn't it? I found your diary.",
    "Not until you tell me what's going on.",
    "What, by starting a war?",
    "Yes, all of it.",
    "Well, I'm the Regent of Miscellania. The King asked me to take a look-",
    "Yes, that's me. And you five are the people mentioned in Armod's diary, right?",
    "It was actually the [prince/princess]... But you five are the people mentioned in Armod's diary, right?",
    "Did you steal those goods from the Etceterians and the Miscellanians?",
    "...What huge snake?",
    "Of course. I was going to do that anyway.",
    "What is it?",
    "Who's that?",
    "Why not? I came up through that hole...",
    "I don't suppose you've seen a large box around here, have you?",
    "I'm afraid not, Your Majesty. There were too many to carry, especially when I had to climb up a rope into Etceteria to get out.",
    "What am I meant to be doing again?",
    "I found out who took your goods!",
    "I found the people who took your [item(s)]!",
    "They weren't Miscellanean soldiers after all. They were teenagers from Rellekka who were trying to prove themselves as adults, by starting a war and then bringing about peace.",
    "I'm still trying to get [it/them] back.",
    "Excuse me...",
    "They weren't Etceterian soldiers after all. They were teenagers from Rellekka who were trying to prove themselves as adults, by starting a war and then bringing about peace.",
    "No, but I've found where they are. They're in a cavern deep in the dungeons below the island.",
    "Your Majesty!",
    "I've found out what caused all these problems. A group of teenagers from Rellekka came to Etceteria to prove themselves as adults. They said they tried to start a war, which they'd then stop, and be hailed as peacemakers. They were the ones who disguised themselves as soldiers!",
    "Well, there was a minor problem involving a sea snake... But I dealt with it, and got the items back.",
    "Yes, I have them with me.",
    "I'll make sure to give it to him, Your Majesty.",
    "...I must have dropped it on my way out of the dungeons.",
    "I shall do, Your Majesty.",
    "I'm not sure I should be reading this...",
    "Oh, why not. I'm the Regent, after all.",
    "I won't read that letter. It's for the King, not for me.",
    "Not yet, Your Majesty.",
    "I'm afraid I've lost it.",
    "I found out who took your goods!",
    "I did! Thank you for the reward.",
    "I've found your goods for you!",
    "No, but I've found where they are. They're in a cavern deep in the dungeons below the island.",
    "What am I meant to be doing again?",
    "I've found the people who took the goods from your citizens!",
    "They weren't Etceterian soldiers after all. They were teenagers from Rellekka who were trying to prove themselves as adults by starting a war and then bring about peace.",
    "I'm afraid not, Your Majesty. There were far too many for me to carry.",
    "And I also spoke to Queen Sigrid of Etceteria.",
    "She gave me a letter for you, which she said was a formal apology.",
    "Of course, Your Majesty. Here you are.",
    "What is it, Your Majesty?",
    "Brand's suggestion worked, and I didn't even do anything.",
    "Nothing, Your Majesty.",
    "Do you want me to give a reply to Queen Sigrid?",
    "Er, I had it, but I seem to have lost it."
  ],
  "Note": [
    "This was taken from talking to Brand as a female character engaged to Astrid",
    "This was taken from talking to Astrid as a female character engaged to her"
  ],
  "[Prince Brand/Princess Astrid]": [
    "Good day, [Sir/Madam]. I don't believe we've met...",
    "[Fremennik name]? That's the name of the person my [sister Astrid/brother Brand] has promised to marry.",
    "Sorry?",
    "Good day, [Sir/Madam]. I don't believe we've met...",
    "[Fremennik name]? That's the name of the person I promised to marry.",
    "Sorry?",
    "I'll ask Father if he minds us discussing this in the throne room for a while. You must explain what has been going on.",
    "You certainly look different, [Fremennik name]. In some ways, it's an improvement.",
    "I quite agree!"
  ],
  "[Princess Astrid/Prince Brand]": [
    "Good day, [Fremennik Name]. Have you come to see my [sister/brother]?",
    "I'll ask Father if he minds us discussing this in the throne room for a while.",
    "Welcome back, my dear! I'm afraid I haven't managed to find a priest for our marriage yet.",
    "I'll ask Father if he minds us discussing this in the throne room for a while.",
    "I'm sorry, but... who are you?",
    "[Fremennik name]? But... weren't you a [man/woman] the last the we met?",
    "Don't say that, [brother/sister]! Though you do look different – very different, if I may be plain – I do believe you are the person I agreed to marry. I can only hope that you find a way to return to how you were before. That aside... what did you want to talk about?",
    "It's terrible, my [darling/dear]! My father's been arguing with the Queen of Etceteria, and has managed to start a war again. It's awful that your work has been undone by such an accident.",
    "Well, if my father had had something to occupy him, he wouldn't have got bored and decided to argue with Queen Sigrid again.",
    "I think it will work.",
    "Perhaps it's an odd idea, my [darling/dear], but since we don't have an army, we can hardly declare war...",
    "So, will you talk to our father and Queen Sigrid, then? I'm sure you can manage to arrange it all.",
    "I'm sure you'll manage to do it, [darling/dear].",
    "Have you managed to make peace between my father and Queen Sigrid yet?"
  ],
  "Princess Astrid": [
    "We can't have him declaring war all the time. Even if it would give us a chance to show off our military might. And I could finally show him that archery isn't a cowardly skill. If only we had an army, we could prove ourselves against the Etceterians.",
    "Better than archery? What is it?",
    "...What are you talking about, Brand?",
    "I trust my brother's judgement. Though his ideas can sometimes be a little... strange.",
    "I'm just telling [Fremennik Name] about your poetic accomplishments.",
    "But we don't have an army, so it's our best hope."
  ],
  "Prince Brand": [
    "Astrid, I have an even better idea.",
    "I think we should persuade our father and Queen Sigrid to marry!",
    "Think of the poetic irony of the situation! The best part is that I could write their wedding hymn for them. 'Today is a happy day, we are getting married, Our national anthems are wonderful, won't you sing this song?'",
    "What was that, Astrid?",
    "Oh, that's all right, then.",
    "Of course it will! It always happens in the ballads and stories. Two people who start out hating each other, and end up falling in love. It's a classic tale."
  ],
  "King Vargas": [
    "What is it? You'll have to excuse me, I'm quite busy...",
    "Affairs of state, and so on.",
    "Well, there's not all that too much for me to do these days, you see. And though you do make a fine Regent, you cannot be here all the time.",
    "In a manner of speaking.",
    "Not exactly... Well, yes. Of course, Sigrid was the one who insulted me first. And that's the least of the kingdom's problems at the moment. Some of Frodi's barrels are missing, as are many of Magnus's crates. Leif also says he's had stacks of wood disappear. Since you're the Regent, you should investigate what has happened to these missing resources.",
    "I'm glad to see the kingdom in such capable hands.",
    "That never prevented me from ruling this kingdom when I was your age, [Fremennik name].",
    "I'm glad to have your help.",
    "All you need to do for the moment is to talk to the citizens of Miscellania, and find out what has been happening. It might also be useful to interrogate the citizens of Etceteria to see what they know.",
    "Have you spoken to the citizens yet, Dokdur?",
    "I suggest you hurry up. We can't afford to lose those resources: we're only a small kingdom, after all.",
    "Have you spoken to the citizens yet, [Fremennik name]?",
    "And?",
    "What? So, Sigrid's planning to invade, is she? Or perhaps she's claiming that Miscellania is part of Etceteria now! [Fremennik name], go and talk to Sigrid and as her what she thinks she's doing. Exchanging angry letters is understandable, but where did she get an army from?",
    "Have you spoken to the citizens yet, [Fremennik Name]?",
    "What did they say?",
    "What? I see. Sigrid thinks that now I've recognised Etceteria as a sovereign nation, I'll just roll over and play dead when she tries to invade, does she?",
    "And she's even started spreading rumours among her own citizens! Are there no depths to which she won't sink?",
    "Lying to her own people about there being Miscellanian soldiers... we don't even have an army! Which makes it all the worse, as otherwise I'd be able to invade Etceteria to save the citizens from Sigrid's depravity.",
    "Perhaps not, [Fremennik Name]. In any case, if there are any 'Miscellanian soldiers', they must have come from somewhere. Ask Advisor Ghrim if he knows who they might be, or where they might have come from. He's a capable advisor, so I'm sure he'll know about any suspicious people.",
    "Have you spoken to Ghrim yet, [Fremennik name]?",
    "Have you spoken to Ghrim yet, [Fremennik name]?",
    "I see. Yes, of course, the sailor would know if anyone had arrived on the island from outside.",
    "The dungeons? Of course, how could I have forgotten? I'm surprised I didn't tell you when you were appointed Regent.",
    "Ah, so you wish to look in the dungeons in case these new arrivals are to blame? I doubt that anyone with Miscellanian relatives would be at fault. However... There is something I need you to do in the dungeons. They are still being excavated, and the dwarven architects are finding new caves as they go. There have been reports of odd sightings in these new caves. Perhaps they are monsters, waiting to devour unwary Miscellanians... Whatever they are, I want you to look into it. You are a member of the royal family, after all, so I know I can rely on your help.",
    "The guard by the dungeon entrance may not recognise you, since he was only hired recently. Here, take this scroll to show that you have access to the dungeons. You'll find the entrance by the south-east corner of the palace.",
    "Have you given that scroll to the guard yet?",
    "Honestly... very well, I'll write you another one. Try not to lose it this time.",
    "Well, start investigating the dungeons, then.",
    "Do you have the missing goods with you, Dokdur?",
    "Into Etceteria? Does that mean that the caves below Miscellania are also connected to Etceteria? You'll have to go back to talk to Sigrid about this, Dokdur.",
    "How are your investigations going, [Fremennik Name]?",
    "Those Etceterian soldiers?",
    "Why didn't they just go through the trials as usual? Unless they're the ones that the Council warned me about. Apparently some of their young 'uns are impressively useless. Still, I can't believe they'd start a war between Miscellania and Etceteria, just to show they were adults... But at least you've found the missing goods. Do you have them with you?",
    "That's a pity.",
    "We'll have to send people down to collect them later, then.",
    "Oh? Do you have this letter with you?",
    "Let me see...",
    "You defeated that sea snake? Sigrid seems rather impressed with that.",
    "And the caverns underneath her palace are joined to ours, I see.",
    "She thinks we should join forces to develop them for more houses.",
    "Finally... hmm. That's not what I'd have expected from Sigrid.",
    "She, erm, says if I weren't a yeti, she might want to get to know me better.",
    "Since we're both warmongering fools, she thinks we'd get on well.",
    "I suppose she has a point there.",
    "What was that?",
    "No, no. I'll think about it for a while.",
    "Though I'd like to tell her I'm sorry for calling her a warmongering harpy.",
    "In the meantime, [Fremennik name], you have managed to avert a war and bring the culprits to light.",
    "The kingdom of Miscellania will have to reward you for this.",
    "I hear that the Etceterians are also grateful for your help, and have pledged some of their resources.",
    "You can talk to Ghrim to deal with those, just as before.",
    "You'd better ask Sigrid to write you another one, then.",
    "I'd like to see what she has to say.",
    "Do you have the missing goods with you, [Fremennik name]?"
  ],
  "Subject": [
    "You hadn't heard about it, Your Royal Highness? Etceterian soldiers came and demanded tithes from us. You're the only person we give any of our goods to, so we refused, and found the next day that some of our goods had been stolen."
  ],
  "Queen Sigrid": [
    "Incompetent! I'll give him 'incompetent'... Yes, what is it?",
    "Of course not! That idiot Vargas has decided to take a hand in ruling Miscellania, even though he'd handed it over to you, and now he's declared war on Etceteria again! I suppose all those insults I made about his parentage can't have helped the matter... Even so, that doesn't excuse what he did to my citizens!",
    "My citizens have told me that items of theirs have been taken, and I'm sure Vargas is behind it. Since you're the one who's supposed to be ruling Miscellania, you should sort it out.",
    "Good, good. If you talk to the citizens of Etceteria, they will tell you exactly what happened. I would find out for myself, but the pressures of ruling are immense, and I would never have the time free.",
    "What sort of Regent of Miscellania do you call yourself? Of course it's your fault. You rule the country now.",
    "I'm glad you understand. If you talk to the citizens of Etceteria, they will tell you exactly what happened. I would find out for myself, but the pressures of ruling are immense, and I would never have the time free.",
    "Have you talked to the citizens yet, [Fremennik Name]?",
    "What exactly happened?",
    "Just as I suspected! Vargas, you treacherous snake!",
    "What? Now I see his plan! Vargas isn't content with simply arguing; he wants to start a war even if it means swindling his own citizens!",
    "Etceterian army? There hasn't been one for centuries! These Miscellanian soldiers of his must have disguised themselves.",
    "And since Vargas shouldn't even be ruling now, it's your responsibility to deal with this. The one who should sort this out is you.",
    "It's one of the hazards of ruling a country, [Fremennik Name].",
    "It's one of the hazards of ruling a country, [Fremennik Name]. You'll get used to it.",
    "Have you found those stolen items yet?",
    "You'd better hurry and look for them. We don't know what Vargas might be planning next!",
    "What is it?",
    "Hmm... That explains what the citizens said about armies, I suppose. But what about the items that went missing?",
    "Finally, a ruler of Miscellania who's willing to do something for [his/her] neighbours. Do you have the items with you?",
    "Thank you, [Fremennik Name]. You've shown yourself to be an excellent diplomat and warrior – not a combination that comes naturally to many. My citizens would like their items back, of course. One of my guards will deal with the items for you, and you will be provided with a suitable reward. Finally... I have a letter that I would like you to give to Vargas. This war was a mistake, and I've made a formal apology.",
    "Thank you for all your help. To show our gratitude, the woodcutters and other workers of Etceteria have pledged to add a proportion of what they produce to your treasury. Now that you've finished giving these items back, please give my letter to Vargas.",
    "*sigh* Well, if you ask the guard at the entrance to the dungeon, he might have picked it up. Of course, he won't know what it's for, so you'd better bring it back here once you find it.",
    "I'm glad you've found my citizens' missing items, Dokdur. Have you had a chance to give Vargas my letter?",
    "Oh, that's a pity. Hurry up and give it to him, please. It means we can formally declare peace again.",
    "Very well, I'll write another. Try to take better care of this one."
  ],
  "Moldof": [
    "What is it?",
    "You don't know about it? Miscellanian soldiers came here a few days ago, saying they wanted us to pay tribute. Of course, I told them to leave. But in the morning, I found they'd stolen my quiver of arrows! They're not very valuable arrows, but I need them to do my job. Could you get them back for me?",
    "Are they the incompetent children I've heard about? I'd heard stories, but I never realised they'd be that useless. So, do you have my arrows?"
  ],
  "Ashild": [
    "What is it?",
    "Curse those Miscellanian soldiers! They came and demanded tribute, and even though I told them to go away, they came back at night and stole my farming tools! Without my trowel and fork, I can't do anything to keep the weeds from the farming patch. Please, find my tools again, so I can get back to work.",
    "If they're the ones who keep on failing their trials, I'm not surprised. When I heard about them, I knew they've have to be dreadful to do that badly. Anyway, do you have my tools?"
  ],
  "Haming": [
    "What is it?",
    "I'm surprised you hadn't heard before. A few days ago, Miscellanian soldiers came and demanded tribute. I didn't give them anything, of course. But the next day, they'd taken our best set of plates right out of the kitchen! They're hardly valuable, but we do need them at home. Could you get them back?",
    "The children who kept on failing the trials, year after year? My brother in Rellekka told me about them. I thought he was joking about how bad they were. So, do you have my plates?"
  ],
  "Matilda": [
    "What is it?",
    "You haven't heard about that until now? I'm surprised. Well, Miscellanian soldiers came and asked for tribute. When I told them to leave, they came back the next day and stole my hat! It was a wonderful hat. Mithril-reinforced, you see, and with a special splitbark brim to keep the sun off. Could you please get it back for me?",
    "Are they the ones who kept on failing the trials? It didn't take me that long - I can't believe they'd take several years and still fail. Anyway, do you have my hat?"
  ],
  "Helga": [
    "What is it?",
    "You're the regent of Miscellania, aren't you? I'm surprised you didn't know about your own soldiers demanding tribute from us. I told them to go away, but the next day I found that they'd stolen my small shield! How am I supposed to defend the house without it? And what am I going to use as a fruit bowl in the meantime? Please sort out your soldiers, and get my shield back to",
    "Teenagers from Rellekka... I think my sister wrote to me about them. The trials are tough, but they must have been very bad to fail them for year after year. Anyway, do you have my shield?"
  ],
  "Arnor": [
    "What is it?",
    "You mean you haven't heard? Only a few days ago, we had Miscellanian soldiers come round and ask for tribute. I told them to get lost, of course... ...but when I woke up the next morning, they'd stolen my sword! Could you get it back for me? I doubt it can cut anything, but it once belonged to my great-grandfather. So it's a family heirloom, you see.",
    "I bet they're the ones who failed the trials for several years in a row. I've heard about them. No wonder they sounded like Rellekkans. So, do you have my sword?"
  ],
  "Arnor/Helga/MOldof/Matilda/Haming/ashild": [
    "Have you found the [sword/shield/quiver of arrows/hat/plates/farming tools] those Miscellanian soldiers took from me?"
  ],
  "Sailor": [
    "You've found one here. Can I help you?",
    "Well, I don't know of any suspicious people... Advisor Ghrim can be rather paranoid about these things sometimes.",
    "Nobody apart from you, and those kids from Rellekka.",
    "Five of them came over here a few weeks ago. They said they were here to see relatives in the dungeons, and they were visiting from the mainland.",
    "They've not been used to keep prisoners for a long time. But since the war ended, we've had more people visiting the island. Some of them decided they wanted to stay, so we've had to find somewhere for them to live... Only the weather on Miscellania is terrible, and nobody could build houses that would stand up to a strong wind. Etceteria is just the same.",
    "Well, of course, they had to be enlarged first. There are still some dwarves working there, making more of the dungeons habitable before they move over to work in Etceteria. If you're looking for those kids from Rellekka, you'll find them in those dungeons. Why are you surprised about this, though? I thought you'd become the Regent."
  ],
  "Guard": [
    "Sorry, [sir/ma'am], nobody's allowed down there by order of the King.",
    "You're the Regent? Well, I didn't vote for you. Sorry, [mister/miss] 'Regent', nobody can go into the dungeons without the King's say-so.",
    "Let's have a look, then.",
    "Hmm... it all seems to be in order. All right, your Highness, you're free to go down there. Try not to be eaten by monsters.",
    "Let's have a look, then.",
    "Oh, of course you did. If you're really the Regent, ask the King to write you another.",
    "If the King came and told me, then I'd believe it. Or, if he can't come here himself, I suppose a royal proclamation would be fine.",
    "No, just his signature and a statement saying you're really the Regent would do.",
    "The area under the palace is going to be excavated soon, and I'm guarding the entrance to it.",
    "Of course not! There's not even a rope to let you down there. You'd break both your legs if you tried it.",
    "Hello down there! Are you all right?",
    "I'm up here, above this hole. I've thrown down a rope – you sounded like you were trapped in there.",
    "Wait a minute! You can't go down there.",
    "I'm surprised you managed to get out of there without breaking any bones. Still, I can't let you go back down there until the Queen says it's safe.",
    "Oh, so this is yours? You must have dropped it around here. Seems rather heavy. Take better care of it this time."
  ],
  "Runa": [
    "Would you like to try some fine Miscellanian ale, your Royal Highness? Well, I say Miscellanian, but it's actually brewed on the mainland. Would you like to try some anyway?",
    "The dwarves living down here spend a lot of time and money in my inn. One of them's been in here all day, and only bought one pint. Could you ask him to at least order another drink?"
  ],
  "Halla": [
    "It's very spacious. One of the dwarves said that the caves go on for miles! I don't like these rumours I've heard about the other caves, though.",
    "They say there might be monsters in there. You'd best talk to the dwarves who are excavating - they'd know about these stories."
  ],
  "Osvald": [
    "The town's growing larger, and business is doing well. I'm worried about the stories I've heard about monsters, though.",
    "I heard that one of the dwarves saw monsters in the other caves! I don't know more than that, so you'd have to ask the dwarves.",
    "There's no rain or wind down here. Some of the dwarves say that there's water in the other caves, and one of them says he's seen monsters in there.",
    "I don't know, sorry. You'd better ask one of the dwarves about it."
  ],
  "Jari": [
    "I'm waiting to work on the digging. It's the first excavation I've worked on, and I'm looking forward to it. I heard there were monsters in the other caves, though. I don't really want to meet them.",
    "Donal saw them when he explored the caves. He's been in the inn ever since."
  ],
  "Alviss": [
    "I'm waiting for my shift. I'm supposed to be digging once the others have finished. I don't like the sound of these monsters, though.",
    "I heard that Donal went exploring in the caves, and saw a huge monster. If you want to know more about it, ask Thorodin - he's working on the excavation right now."
  ],
  "Fullang": [
    "I'm working on the digging, of course. It's a small excavation, so only two of us can work on it at a time. Thorodin and Donal were working on it earlier, but I hear Donal's run off to hide in the inn.",
    "Apparently he saw a monster when he was in the caves. I'm not scared of monsters - I won't let them stop me from digging!"
  ],
  "Ferd": [
    "Shoring up the walls.",
    "Stops them falling down.",
    "If you want to chatter, you'd better talk to Thorodin over there. I'm working."
  ],
  "Thorodin": [
    "We're extending the cave so more people can live in it. These Miscellanians aren't so bad. They appreciate the benefits of living underground.",
    "Not getting rained on, for example. Have you spoken to Donal?",
    "You'd better get in there and do something about it, then."
  ],
  "Donal": [
    "What do you want?",
    "I'm waiting to work on the excavations... though I don't really want to start digging again.",
    "Not with monsters like that one in those caves. It had huge teeth and flaming red eyes, and was almost the size of the tunnel! If it attacks the town... Are you an adventurer, by any chance?",
    "In that case, could you go and deal with that monster? I don't want to have to face it again if it attacks the town.",
    "That's what I thought, until I saw the sheer size of it. This thing probably MADE the tunnels!",
    "I've heard stories from the Miscellanians. If you're the Regent, you must be quite a strong hero. So what are you worried about? You probably eat monsters like that for breakfast!",
    "You'll need to get into the other caves first, of course. There's a crack in the wall where the others are digging, but the rocks are loose, and can fall on you if you're not careful. I can give you a mining prop to keep them from falling, if you give me a minute to find it...",
    "No, after that the only way you can get further is climbing up onto a high ledge, then crawling through a tunnel. But the walls are slippery... and I think I might have broken the lift when I fell off it on my way back. You'll probably need to fix the lift – I doubt you'd be able to climb.",
    "Somewhere behind it. I couldn't get very far, what with the flooding in the tunnel. There's some rope and some planks near the broken lift – those would probably come in handy. Ah, here's that mining prop. I knew I had it somewhere. Here you go. Good luck with fighting that monster.",
    "What do you want?",
    "Of course I'm still here. I'm not going near that crack in the wall again. Rock falls and so on are fine, but sea monsters in caves - never!",
    "Lucky I have a spare, isn't it? Here you go. Good luck with fighting that monster."
  ],
  "Armod": [
    "What do we do now? If you hadn't got drunk in that inn, Signy, we could have stayed there for longer.",
    "Hey! I have to write down what's happened. Otherwise father won't believe me when I tell him.",
    "If only my father would come and save us.",
    "Someone's coming!",
    "What if it's the monster again? What if it's one of the townspeople? What if my father's found out what we've been doing? H-hey! Where am I going to hide?",
    "You want me to hit you?",
    "O-okay.",
    "Don't bother me!",
    "I said, don't bother me! I'm being a rock at the moment.",
    "What did you hear?",
    "What? How did you get it? Give it back!",
    "Why should I tell you? We're going to do really well and show my father that we're true adults!",
    "What the- Did you read my diary?",
    "What are you even doing in these caves anyway? Everyone else was scared to come down here.",
    "You're the REGENT? Um, you four, I think you'd better come out now. We're in big trouble.",
    "It was Beigarth's idea, not mine! He said that if we disguised ourselves as soldiers, we could convince both the King and Queen that they were under attack. And it almost worked, too.",
    "I don't care about the plan. If you can get rid of that sea snake, we'd be really grateful to you. We can't even get out of these dungeons while it's there.",
    "So, will you get rid of that sea snake?",
    "Thank you so much. You've saved us from the brink of death. Could I ask you for one more thing?",
    "PLEASE don't tell my father how badly we messed up.",
    "And we'd planned it so well, too."
  ],
  "Signy": [
    "It wasn't just me who got drunk. You looked like you were about to puke all over the barmaid.",
    "If your father listened to what you say, we wouldn't BE here. We'd have passed the trials and we'd be proper adults!",
    "Quick, let's hide!",
    "Just act normal, Armod! And hurry!",
    "So you're the adventurer we heard about, then. The one who married the [princess/prince].",
    "Not after we got drunk and then didn't pay our bill.",
    "We didn't mean it to go wrong, you know..."
  ],
  "Hild": [
    "Reinn threw up anyway.",
    "We wouldn't have been so cold if Armod had more diary pages he'd let us use!",
    "If only SOMEONE would come and save us.",
    "Shhhh! Just pretend you're part of the scenery, or something!",
    "I agree with him. I want to go back home. It's cold here, we've got no food, and we can't go back to the town.",
    "I want to go home."
  ],
  "Reinn": [
    "I can't help it, I just have a weak stomach. You're no better, Hild. You said you knew where we were, and now look at us! We're cold, we're hungry, and now we're LOST!",
    "Besides, it's not like he'll even look at the rubbish you've written in your diary.",
    "You're almost smart enough to make a good rock.",
    "Nice impression of a rock you did there, Armod.",
    "It would have worked, if it hadn't been for that huge snake!",
    "We put the things we'd taken somewhere safe, so we could get them back when we made peace again. Everything was going well, until we got back to that place, and a giant sea snake had moved in! It's made a nest out of all the boxes and barrels.",
    "That idiot Armod should never have burned his diary!"
  ],
  "Beigarth": [
    "Armod, you should have burnt it all.",
    "If only that gigantic snake hadn't moved in."
  ],
  "Etceterian Citizen": [
    "What is it? Have you found the [item(s)] those Miscellanian soldiers took from me?",
    "Those Miscellanian soldiers?",
    "What is it? Thank you for finding my [item(s)] for me. Did you find everyone's belongings?",
    "You're more than welcome to it, for getting our belongings back."
  ],
  "Miscellanian Subject": [
    "Those Etceterian soldiers?",
    "Let me guess: the ones who failed the trials for years? My sister in Rellekka wrote to me about them. So, do you have my crates?",
    "You managed to carry all those crates?"
  ],
  "Congratulations! You have completed": [
    "'Royal Trouble' - Complete this quest."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Royal_Trouble?oldid=36198924’"
  ]
}