{
  "questName": "Shield of Arrav",
  "questSteps": [
    {
      "stepDescription": "Talk to Reldo in the Varrock Palace library. (Chat 1•✓)",
      "itemsNeeded": [],
      "itemsRecommended": [],
      "highlights": {
        "npc": [],
        "object": []
      },
      "floor": 0,
      "additionalStepInformation": []
    },
    {
      "stepDescription": "Search the east side of the centre bookcases with the navy blue book for The Shield of Arrav book, then read it.",
      "itemsNeeded": [],
      "itemsRecommended": [],
      "highlights": {
        "npc": [],
        "object": []
      },
      "floor": 0,
      "additionalStepInformation": []
    },
    {
      "stepDescription": "The Phoenix Gang - Additional Information shows the Sequence of getting the Shield Half from the Pheonix Gang.",
      "itemsNeeded": [],
      "itemsRecommended": [],
      "highlights": {
        "npc": [],
        "object": []
      },
      "floor": 0,
      "additionalStepInformation": [
        "Talk to Reldo and ask about the Phoenix Gang. (Chat 1)",
        "Talk to Baraek who is located in the north-east of Varrock square, and give him 10 coins. Ask him every question available. (Chat 1•1•2)",
        "Travel to the Phoenix Gang Hideout which is located south of Aubury's Rune Shop. It will be marked by a dungeon link to the Misthalin Underground on the map.",
        "Climb down the ladder.",
        "Talk to Straven and ask to join. Tell him you know who he is. (Chat 1•1)",
        "Go to the Blue Moon Inn which is just north of Varrock's southern entrance.",
        "Kill Jonny the beard.",
        "Grab the Intel report that he drops.",
        "Talk to Straven.",
        "Search the chest in the south-west corner of the hideout for a broken shield.",
        "After climbing back up the ladder, enter the house east of the Phoenix Gang Hideout and go up the ladder there.",
        "Pick up the two Phoenix crossbows on the floor, you will need these for the next gang."
      ]
    },
    {
      "stepDescription": "The Black Arm Gang - Additional Information shows the Sequence of getting the other Shield Half from the Black Arm Gang.",
      "itemsNeeded": [],
      "itemsRecommended": [],
      "highlights": {
        "npc": [],
        "object": []
      },
      "floor": 0,
      "additionalStepInformation": [
        "Talk to Charlie the Tramp located just north of Varrock's southern entrance. Ask him what's down the alley. (Chat 3•1)",
        "Follow the alley to the west and enter the building.",
        "Talk to Katrine. (Chat 1•~•1•1•1)",
        "Talk to Katrine again to give her the crossbows.",
        "Head north through the door and climb up the staircase.",
        "Open and search the cupboard on the south-eastern wall for the other broken shield piece."
      ]
    },
    {
      "stepDescription": "Use one half of the shield on the other.",
      "itemsNeeded": [],
      "itemsRecommended": [],
      "highlights": {
        "npc": [],
        "object": []
      },
      "floor": 0,
      "additionalStepInformation": []
    },
    {
      "stepDescription": "Talk to King Roald who is located in Varrock Palace. (Chat 1)",
      "itemsNeeded": [],
      "itemsRecommended": [],
      "highlights": {
        "npc": [],
        "object": []
      },
      "floor": 0,
      "additionalStepInformation": [
        "If you have completed Priest in Peril (Chat 2)"
      ]
    },
    {
      "stepDescription": "Quest complete!",
      "itemsNeeded": [],
      "itemsRecommended": [],
      "highlights": {
        "npc": [],
        "object": []
      },
      "floor": 0,
      "additionalStepInformation": []
    }
  ],
  "questDetails": {
    "Quest": "Shield of Arrav",
    "StartPoint": "Talk to Reldo in the Varrock palace library.",
    "MemberRequirement": "Free to play",
    "OfficialLength": "Medium",
    "Requirements": [
      "None"
    ],
    "ItemsRequired": [
      "20 coins"
    ],
    "Recommended": [
      "None"
    ],
    "EnemiesToDefeat": [
      "Jonny the beard (level 1)"
    ]
  }
}