{
  "Player": [
    "I've solved your problems! I've returned the Fairy Queen's magical essence.",
    "The Fairy Queen was in an enchanted sleep, because the Tanglefoot had taken the secateurs that contained her magic. I focught and killed the Tanglefoot and have given the Godfather the Fairy Queen's secateurs. She'll wake up now and everything will get back to normal.",
    "I've done enough for you. Sort it out yourself!",
    "I guess it does sound rather far-fetched. Okay, I'll come back and see you after your crops have had a chance to grow.",
    "So, have your vegetables grown yet?",
    "Hello, Martin. You must be the slowest gardener in the world! I don't suppose those crops have grown yet?",
    "What? What are you talking about?",
    "But I gave the Fairy Queen's secateurs back to the Godfather; things should be growing again.",
    "I suppose I'd better go and see what the problem is then.",
    "Don't worry, I'm working on it.",
    "Wow! Somebody has trashed this house! And what's happened to Fairy Nuff and the Fairy Queen?",
    "Do you know what these strange marks mean?",
    "Do you know what these strange marks mean?",
    "Do you know what these strange marks mean?",
    "Hi, can you tell me anything about the fairy rings?",
    "Oh, sorry.",
    "Hi, the Godfather said I should ask you to explain how the fairy rings work.",
    "Do you know what these strange marks mean?",
    "Do you know what these strange marks mean?",
    "Do you know what these strange marks mean?",
    "Godfather! Where is the Fairy Queen?",
    "I've just been to Fairy Nuff's house and when I got there I found it ransacked! Everything has been broken and the Fairy Queen and Fairy Nuff are missing!",
    "Calm down! Let's think this through carefully.",
    "Do you have any idea who could have done this?",
    "That's not very helpful.",
    "Where could she have been taken to?",
    "We must go after them!",
    "Well tell me what to do and I'll go myself.",
    "Yes, okay.",
    "No, I'll rescue her myself.",
    "Where have all the fairies gone?",
    "Do you know what these strange marks mean?",
    "Oh, okay then.",
    "I'm not signing this! It says I am indebted to you until you release me!",
    "No, there's no chance of that happening.",
    "Err, no, not yet.",
    "Why are you carrying that toolbox?",
    "Uh, right. So is it safe to use the fairy rings then?",
    "Fairy Nuff, what happened?",
    "But why would the Godfather do this?",
    "So what should we do about it do you think?",
    "I'm sorry, but who are you?",
    "Yes, that's me.",
    "But that was a mistake! I thought he was trying to help the Fairy Queen!",
    "Alright, what do I need to do?",
    "That's easy. I'll just pickpocket them off of him, I'm really good at that.",
    "Uh, you guys aren't fairies - what are you doing here?",
    "Yes, but I seem to have lost them somewhere.",
    "You should have seen me! The Godfather didn't even know I was going through his pockets! Here they are.",
    "Calm down! There's got to be something that we can do. After all, we've given her back her magical essence, right?",
    "Well that doesn't seem too bad, what do I need to do to make one?",
    "Thanks for the lecture, but where do I get one of these Star Flowers and where can I find a Gorak?",
    "Thanks for the lecture, I've seen a Gorak, but where do I get one of these Star Flowers from?",
    "Thanks for the lecture. Fortunately I think I know where to get all of the ingredients you need.",
    "Yes, I'm on my way.",
    "Hello there.",
    "I'm looking for a Star Flower.",
    "How's that potion of Magic Essence coming along, Player?",
    "That's nice for you, but please stop wasting time. You need to finish the potion with a Gorak's claw.",
    "I've got it, I've made a potion of magic essence!",
    "THE GODFATHER?",
    "I'm not really sure how to tell you this, your majesty... It seems as though you've fallen foul of a clever scheme of the Godfather's..."
  ],
  "Martin the Master Gardener": [
    "What are you talking about?",
    "I'm glad to hear it, but if you don't mind, I'll go and plant some seeds now and wait until they grow before I give you the reward that I promised.",
    "Great! I'll see you soon then.",
    "Stop being so impatient, Player. They'll grow in their own good time - come back later.",
    "Well, you've got a nerve showing up around here again!",
    "You told me that you'd solved the problems of the Gardening Group's members. Well, I've planted loads of seeds since then and there's no doubt that even more plants are dying!",
    "Yah, sure, whatever. You know, I didn't believe you when you told me that story about 'the fairies' in the first place. You'd just better solve this problem; when people get hungry, they get angry. You're the person who said that everything would be all right, so you're the person who they'll get angry with!",
    "Hello again, Player. Our crops are still failing. Please do something fast; the food reserves are starting to fail. People will realise that there is an imminent food crisis!",
    "Please hurry. Things are getting dire!"
  ],
  "Sheep": [
    "You don't look like Fairy Nuff to me; what are you doing with her diploma?",
    "The human's found some symbolsAnd doesn't know what they meanSo now it's cross-examining meAnd spoiling my routine!"
  ],
  "Cow": [
    "Can't the human take a hint? I've been ignoring you! Do you think I would ignore you if I wanted to discuss your Rorschach ink-blots ?"
  ],
  "Co-ordinator": [
    "Fairy Nuff is very proud of that certificate, it's her most prized possession. She won't like you taking it.",
    "They look familiar, but I can't think where I've seen marks like that. Try asking around, maybe somebody else will recognise them.",
    "Goodness! I'm already rushed off my wings, and the Godfather hasn't given you permission to use the rings, so why in the world would you need me to explain the rings to you now?",
    "Goodness! As if I don't have enough to do already without giving every adventurer that comes along a history lesson! Let's get this over with quickly. Zanaris is an extremely old place, it was here long before we fairyfolk came to live here. In fact it is rumoured to be the nexus of all planes. When we arrived here we found many of the magical properties of this place to be dormant. One of these was the ability to jump between planes using a powerful portal that had been sealed for centuries. The Fairy Queen harnessed that magic and created the fairy rings, these are not as powerful as the original portal would have been, but are very effective nonetheless. There are 3 fairy rings in Zanaris, the one in the market and the one near the evil chicken's shrine will only take users to one specific place. However the third fairy ring, near the fountains, is a major portal. Anybody who activates that fairy ring will find themselves able to dial in a 3 digit code. These codes will all take the user to different locations. Some of the codes no longer work and other codes go to extremely dangerous places, so be careful. Fortunately the fairy rings are imbued with a powerful protective magic and as long as you stand in the middle of them nothing will be able to attack you. Remember, because you are a human, you will need to be holding your dramen staff to activate the rings. Now I must get back to work, there is so much to do and so few fairies left to do it."
  ],
  "Gatekeeper": [
    "That you've been doodling? If you don't mind, I have a job to do. Please stop distracting me.",
    "No, I don't, and I'm trying to work here. Please stop distracting me."
  ],
  "Fairy Chef": [
    "Very nice, dearie, but that belongs to Fairy Nuff. I should put it back on her wall before she misses it if I were you. You wouldn't want her to think you stole it now, would you?",
    "Sorry dearie, no, but I have seen a sign with similar marks near the mysterious ruins. You know, the ones that lead you to the Cosmic Altar."
  ],
  "Chaeldar": [
    "I've no interest in that, sorry."
  ],
  "Slim Louie": [
    "Get dat fing away from me!"
  ],
  "Fairy Godfather": [
    "For why you show-a me dat? I-a busy fairy! I donn-a have time for nonsense!",
    "Whata are you-a talking about?",
    "Essere nel panico! You-a say datta da Queen Bee, she izza meesing? Theez izza terreeble! Who could-a have done such a theeng? We musta find her! I weel organise a search-a party right-a-way!",
    "Errm...no! None atta all! Da Queen Bee, she izza well liked by-a everyone.",
    "Ze keednapper must-a have taken her through-a da fairyreengs. Dey weel-a be long gone by-a now.",
    "Yes! We must-a, but most-a of da folk are away from Zanaris atta the momento.",
    "Ye-es, dat izza good idea. Hokay, you may use-a da fairyreengs. Talk-a to da co-ordinator, she will-a explain-a to you how to use-a da reengs, but you must-a promees me dat you weel come-a back-a here, eef you find-a her. Whoever keednapped her must-a be very powerful. You find-a da Queen Bee and den-a yous come right back here and we will-a rescue her together. Hokay?",
    "Good. Now-a yous talk-a to da co-ordinator. She will-a tell you how-a da fairyreengs work.",
    "Oh no, dat eet eez no good. Yous wanna to be da hero, but what-a about me? She izza my queen! No, no. You cannot- a use-a da fairyreengs",
    "Da people are mostly out-a and about-a tryeeng to keep-a theengs working. Eet izza not easy weeth da Queen Bee notta here!",
    "For why you show-a me dat? Eez very nice to see yous learning to draw! Bravo!",
    "Ah, Player, yous hassa changed your mind? Yous weel-a come and getta me before yous rescue da Queen Bee? Only den can-a I geev yous permission to use-a da reengs.",
    "Good, I knew-a you would change-a your mind. Now I just-a need you to sign-a dis scroll before I geev-a yous da permission to use-a da fairyreengs.",
    "Eet does? Oh, sorry, must-a geeven yous da wrong-a scroll. Tell-a yous what, yous hazza da honest face, so I'll trust-a yous. Go ahead, use-a da fairyreengs, but just-a make sure dat yous come-a back here and tell-a me when- a yous finda da Queen Bee, like-a yous promised. Now go-a and talk-a to da co-ordinator. She-a weel tell-a yous how da fairyreengs work.",
    "Yous weel change-a your mind. Come and talk-a to me when yous do.",
    "Player, you are-a back! Have-a you found da Queen Bee?",
    "Den whatta are you doing-a back here? Go and-a search for her!"
  ],
  "Fairy Fixit": [
    "It's the fizgog! It's picking up cable again!",
    "Sure, as long as you have been given permission to use them. You should just be aware that using the fairy rings sometimes has strange results - the locations that you have been to may affect the locations you are trying to reach. I could fix it by replacing the fizgog and the whosprangit; I've put in a request for some new parts, but they're pretty hard to get hold of it seems."
  ],
  "Fairy": [
    "The Fairy Queen is the true ruler of Zanaris, not that wicked Godfather!",
    "How could everything have gone so wrong, so quickly?",
    "The Godfather has a lot to answer for; just look at all these injured fairies!",
    "I hope that the Fairy Queen wakes up soon - I want to go back home.",
    "What is that evil fairy doing to our beautiful kingdom?",
    "The Godfather's henchmen tried to pull off my wings!",
    "Have you heard? The Godfather has allowed orks into Zanaris!",
    "We must find a way to fight back! To throw those villains out of our homes.",
    "Have you seen Fairy Cake? She went to talk to the Godfather and I haven't seen her since.",
    "How is the Fairy Queen? Has she woken up yet?",
    "I can't believe that there are orks in Zanaris.",
    "I don't want to go back! That ork tried to kill me!"
  ],
  "Fairy Nuff": [
    "Player! You found us! I'm so glad, I was afraid you wouldn't get my message.",
    "After you brought back the Queen's enchanted secateurs and gave them to the Fairy Godfather, I went to him to ask for them so that I could wake Her Majesty up, but he refused to give them to me. Then I noticed that lots of my friends were missing, when I asked him about them he said they were off working for him and then he threatened to have his bodyguards pull my wings off! I was scared for the Queen, and so I moved her here. When I returned to Zanaris I found my house ransacked! There were other fairies that had been attacked by the Godfather and so we fled the city and came here. I managed to hide a note that I hoped you would find... ... obviously you did.",
    "Isn't it obvious? He wants to rule Zanaris instead of the Fairy Queen. The latest fairies to arrive have even reported that he has invited all sorts of monsters to the Lost City.",
    "Oh, how rude of me! Player this is Fairy Very Wise, advisor to the Queen. Fairy Very Wise, this is Player.",
    "What are you doing? You need to get those secateurs back very urgently!",
    "Oh, Player, you're back! I'm so glad. Did you manage to get the secateurs?",
    "I can't believe you did that! You know how important it is that I get those secateurs as soon as possible! Please go and find them immediately!",
    "Oh, Player, you're back! I'm so glad. Did you manage to get the secateurs?",
    "Fantastic! Let's just hope that it's not too late ...",
    "Oh no! It didn't work! She's been asleep for too long!",
    "Yes, we have. There is one small chance that we might be able to wake her up still, but I'd need a potion of Magic Essence.",
    "A potion of magic essence is made in the same way as any other potion, first you mix a vial of water with a base herb, in this case a Star Flower. Star Flowers are rich in magic essence and are excellent for curing poisons and that's what the Queen is suffering from - a poisoning of her life essence. Then we need to add the catalyst ingredient; a powdered Gorak's claw. Goraks drain the life from their prey, so by using one of their claws we are hoping to draw the Queen's life essence back.",
    "Star Flowers only grow on the higher planes and even there they are extremely difficult to find. You should be able to access some of the higher planes by using the fairy rings. Goraks also live on a different plane. They are vicious creatures that draw the life essence from any living thing they find. It seems that in drawing the life force from the world that they live on they have trapped themselves on a small plane, as far as I am aware, the only way onto or off of their world is through the fairy rings.",
    "Star Flowers only grow on the higher planes and even there they are extremely difficult to find. You should be able to access some of the higher planes by using the fairy rings.",
    "That's great news! Well what are you waiting for? We need that potion as soon as possible!",
    "I've half made it, I found a Starflower on this really wierd plane.",
    "Oh, Player that's fantastic! Please give it to Her Majesty immediately.",
    "Your majesty! You're awake!"
  ],
  "Fairy Very Wise": [
    "Ive got terrible news! One of our spies has just returned from Zanaris and has reported that the Godfather has enlisted an army of orks! Apparently they are wandering freely around our homes!",
    "Oh, I've heard of you. You're the young adventurer that defeated the Tanglefoot.",
    "So you're also the idiot who gave that Godfather maniac the Fairy Queen's magic secateurs!",
    "So you're not evil, you're just not too bright. Well I'm glad you found this place, although if you can find it it's obviously not much of a hiding place, now you can help fix the damage you've done!",
    "The first thing we have to do is wake up the Fairy Queen. You will have to go back to Zanaris and find a way to get those magical secateurs back from the Godfather!",
    "Ok, just be careful, his henchmen have keen eyes and will be watching out for him.",
    "I'm so worried about the Queen. Without her the fairy people may be chased out of Zanaris completely! You must wake her, for all our sakes!",
    "I'm afraid it's true your majesty. You see nobody knew that the Godfather was with you when you fought the Tanglefoot...",
    "Then, Your Majesty, I think it may be worse than I imagined. I suspect the Fairy Godfather attacked you from behind and left you for dead. He has taken over control of Zanaris whilst you were, er...sleeping. He has enlisted the aid of orks and other assorted ruffians, if any of your subjects dared to question him they were assaulted. I very much suspect that if it wasn't for the quick thinking of Fairy Nuff here you would be dead! She fled here with you and as many of your loyal fairies as she could gather. We've been in hiding ever since, until this brave adventurer managed to awaken you.",
    "No! Stop your majesty!",
    "The Godfather has recruited an army of villains, whilst we just have the few fairies who escaped and although they would gladly follow you into battle, many are still wounded from their treatment at the tyrant's hands. I must counsel caution, lest this brave hero's efforts are all wasted and the godfather captures you. He won't let you survive a second time."
  ],
  "Ork": [
    "Grunt! Smelly, stinky human! Urgh! Leave us alone before we hurt you."
  ],
  "Cosmic Being": [
    "Salutations traveller! It is unusual for one of the creatures called ´humans´ to visit this plane. How can I assist you?",
    "Then you've come to the right place. Star Flower, which is much prized for its magical properties, only grows on this plane. It has a very short life-span, plants grow, flower and die in the space of minutes! If you search around you might find some growing somewhere."
  ],
  "Fairy Queen": [
    "...Urgh! Wh... what happened? ... Why do I feel so awful?",
    "Wh... what happened? The last thing I remember was confronting that Tanglefoot with the aid of the Godfather.",
    "Yes, that's what I said... oh, hello Player. Please excuse me for not having noticed you earlier, I'm not feeling quite myself. Why did you shout about the Godfather?",
    "That's absurd, why would the Godfather want to hurt me?",
    "But that's the point, I didn't fight the Tanglefoot. We had only just entered its lair and sensing the danger to itself, the Tanglefood flied down a passage, then... blackness!",
    "I can't believe it! He shan't get away with this, how do I get back to Zanaris? The Godfather shall answer for his crimes!",
    "Why, old friend?",
    "There is wisdom in what you say. I shall ponder your words before I act rashly. As for you, Player, how can I reward you? You have done the fairy people a great favour that shall not be forgotten. I'm afraid you find us in trying times, but please accept this magic lamp as a sign of our thanks."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:A_Fairy_Tale_II_-_Cure_a_Queen?oldid=36225455’"
  ]
}