{
  "Malignius Mortifer": [
    "Ah, Player, what necromancy wisdom might I impart upon you this hour?",
    "So, er, Death has *ahem* encouraged me to share some of the secrets of necromancy with you. So, shall we?",
    "Let me know when you are ready.",
    "Hmmm, where to begin? I could teach you a little about the source of necromancy? Or how to craft necromancy runes? Or maybe some incantations? Any preferences?",
    "You know how there's a relationship between anima and magic - like the former fuels the latter.",
    "Yeah, it doesn't come from that.",
    "But it's not far off. Instead of anima, it's fueled[sic] by necromantic energy, which itself comes from a lot of different sources...or from one single source I'm not familiar with, maybe.",
    "Where a lot of things died - around graveyards and battlefields, down here in the Underworld, through, er, 'dark portals'. It builds up and then undead whackiness ensues.",
    "Necromancers learn to channel that energy, concentrate and focus it for a particular end. Its utility is more limited - undead conjuration, deathly incantations, and so on.",
    "Indeed. Your lantern connects you to your power base, allows you to bring forth spirits from the Underworld to fight alongside you.",
    "And without a death guard, that necromantic energy would slowly corrupt you, like gangrene...or a really severe allergic reaction to mushrooms.",
    "It's why you don't see many necromancers; most beginners, er, shall we say...end?",
    "I have allergies. So what?",
    "They're exactly like magic runes...just with more necromancy...and no magic.",
    "Right, sorry, yeah. Well, you craft them just like other runes, except you can only do so with impure essence. I'll teach you the essence ritual needed for making impure essence in a moment.",
    "I figured out the ritual after I stumbled upon some necromancy rune altars. I got the distinct impression that 'he' made them.",
    "An educated guess would suggest an old and powerful necromancer. It was probably 'the First Necromancer'.",
    "I've been exploring Um since I arrived, and I was drawn by some whispers to a dark portal over the bridge. I felt like I was being led to it by...'you know who'. Sorry, by Rasial.",
    "After the ritual to make some impure essence, I'll point you towards where to use it. Beyond prepping the impure essence, the process is just like crafting other runes.",
    "Well, yes...and also no. The process is much the same - your ability as a necromancer will determine which incantations you can perform, plus you will require necromancy runes to do so.",
    "Your magic proficiency and the usual magic runes won't play any part, though.",
    "You might also come to learn some incantations from the writings of necromancers of old. Keep an eye out for stuff like that.",
    "There are incantations for various uses - for while fighting, for use during rituals, plus some other support or utility uses.",
    "None of your conveniences for magic will help for necromancy incantations either - say, anything you have to store runes, save them, decrease costs...that sort of thing.",
    "Hmm, though we might be able to make some equivalents specifically for necromancy. Hmm, leave that with me, I'll let you know if I think of anything.",
    "Very well. On to the next thing...",
    "I think we should get you set up with some necromancy runes, so you can use some incantations.",
    "To do that, though, you'll need to learn a new ritual - one to imbue objects with necromantic energy.",
    "If you do that to some pure essence, you can prime it to take on more specific uses, in the form of necromancy runes.",
    "Clear some space in your backpack and I'll give you some pure essence and some ritual components, then tell you the next step.",
    "Here - take some pure essence and some ritual components. It should be enough to set up a lesser essence ritual.",
    "This is a one-time freebie, so don't lose it, else you'll have to replace it with some of your own.",
    "Now, head over to the ritual site and start a lesser essence ritual.",
    "Ah, Player, what necromancy wisdom might I impart upon you this hour?",
    "Ah, Player, what necromancy wisdom might I impart upon you this hour?",
    "I'm not made of money - you'll have to get hold of 200 pure essence and the other necessary components for a lesser essence ritual.",
    "You're good to go - just head to the ritual site and begin a lesser essence ritual with that pure essence.",
    "Ah, Player, what necromancy wisdom might I impart upon you this hour?",
    "That's the hard part over. You're free to use that ritual all you like from now on.",
    "Your impure essence has been sent to the ritual chest just behind me. Don't forget to take it out un-noted! Think how embarrassing it would be to hike all the way to the altars and it still being noted...",
    "The next part, I'd imagine you're familiar with, with just one slight difference. There are no runecrafting altars for the forbidden necromancy runes...",
    "There is, however, a dark portal high up in the north-east of the City of Um. Just follow the waterfalls up and enter - you can craft necromancy runes on the idols within.",
    "I highly suspect Rasial created it, but we can turn its power against him.",
    "Head up there and create some spirit runes for a start, then come back to me.",
    "And if you somehow lose your impure essence, you'll just have to necrotise some more pure essence. I'm not holding your hand here.",
    "Ah, Player, what necromancy wisdom might I impart upon you this hour?",
    "Before we continue, you should make some space in your backpack.",
    "What did you think of the necromancy runecrafting altars?",
    "I think I know what you mean, but it is just a pocket dimension, like other runecrafting altars.",
    "Wherever you are thinking of, it's not really that place, it might just look like it. Try not to dwell on it.",
    "Anyway, you should try putting those spirit runes to use next time you fight!",
    "You can start out with Lesser Bone Shield - it lets you access certain defensive abilities that would usually require you to wield a shield. Could come in handy; us necromancers can be a bit squishy at times."
  ],
  "Player": [
    "What secrets might those be, then?",
    "Necromancy - where does it come from?",
    "Yes?",
    "Ah, so the death guard is a form of protection, and my lantern like a focus?",
    "I see - learn quick or die trying. Wait, mushrooms?",
    "Necromancy runes? What are those?",
    "I mean, I guessed that much.",
    "Who?",
    "You can say his name, you know. It's not some big secret. I guess you haven't met him yet... Oh, so how do you know about necromancy runes?",
    "Incantations? Aren't those just like magic spells?",
    "Rasial! What are you doing here?",
    "Where am I? What is this place?",
    "Surely we can't be in Erebus?",
    "But these are runecrafting altars, right? I thought Guthix made them all. Why would he make these?",
    "You made runecrafting altars? I find that hard to believe. I've never heard of you until recently. Who exactly are you?",
    "I'm not the World Guardian anymore.",
    "What? What did I do? What mess are you talking about? Answer me!",
    "What's with the mocking tone?",
    "Urgh, why is he so frustrating?",
    "Malignius said to craft some spirit runes first.",
    "I should head back to Malignius in the City of Um.",
    "I do not like the look of that place. It reminds me of something not good..."
  ],
  "Rasial, the First Necromancer": [
    "Stop playing with things you clearly aren't ready for.",
    "Waiting for you, of course. It was inevitable that you would reach here. I honestly thought it would be sooner. Perhaps I was mistaken about your capability...",
    "I assure you, we are not.",
    "It is a pocket dimension - a concentration of necromantic elements taken from Erebus.",
    "Any others you may have visited before, yes. The ones here, he would never have dared.",
    "No, this is a place of my making.",
    "In time, if you prove not to be yet another failure, then you might just find out.",
    "But I know precisely who you are, 'World Guardian'.",
    "You may have lost the title, but you still bear the responsibility. Especially considering the mess you made.",
    "Have fun with necromancy runes. I shall be keeping an eye on your progress. Do not disappoint me."
  ],
  "Congratulations! You have completed": [
    "'Rune Mythos' - Complete this quest."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Rune_Mythos?oldid=36191586’"
  ]
}