{
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "Missing dialogue variant from the start if the player has not finished Rag and Bone Man/Wishlist.You can discuss this issue on the talk page or edit this page to improve it."
  ],
  "Player": [
    "How's the sorting going?",
    "What's that then?",
    "Err, sure. Be my guest.",
    "Yes, I'll help you out.",
    "Fair enough, I guess.",
    "So I just bring you those skins?",
    "And you would like me to prepare those skins?",
    "I scrub the skin with salt, put logs in the fire pit there, stretch the skin on the rack and light the fire, then wait until it's ready?",
    "Off I go then!",
    "No.",
    "Is everything alright?",
    "Yes, I get it.",
    "Yes, I'll help you out.",
    "No.",
    "What's with the mumbling?",
    "You were just talking to it! Are you trying to convince me that you were talking to yourself?",
    "Yes, I'll help you out.",
    "No.",
    "Not at the moment. Can you give me a rundown on which furs I have left to get?",
    "Yes. I'll get right on it.",
    "Okay, I'll remember.",
    "I've got the rock crab. I tried to scrub it with salt, but I can't see how I would stretch it on the rack to dry. Besides, it doesn't seem to have any sort of skin or fur.",
    "What? No, I'm...",
    "But?",
    "I also have some skins for you.",
    "I'm just glad I could help."
  ],
  "Odd Old Man": [
    "Err...",
    "It's going well, especially now I have all the bones I requested. Actually, there's something more you could do for me.",
    "The... museum recently contacted me. They are planning on expanding their Natural History section with some stuffed animals.",
    "They would like me to provide them with the animals, but I've got too much work on to go out and get the furs by myself.",
    "Young [man/woman], would you be so kind as to excuse me for a brief moment?",
    "What I do here is none of your business. The whole world doesn't revolve around you. I should be allowed a bit of 'me time'. I mean, when was the last time I had a bath?",
    "What? Would you rather I put you back where I found you? I'd like to see how that serves your purpose. I don't have to obey you.",
    "Come on, can you do this for me? Please... Just this one time. And then I'll finish the... 'sorting'.",
    "Yes. I promise. So, are we game?",
    "Er... Okay, fine, whatever.",
    "Ah, you're still there! Sorry about that. So, what do you say? Will you help me collect those furs for the museum?",
    "Marvellous! I'll give you a few instructions. The...museum was very specific on the furs and skins they wanted. They are building a natural history display on the fauna of the Fremennik Province, and want all the samples to come from there.",
    "They want stuffed versions of an adult black unicorn, an adult white unicorn, a hobgoblin, a fox, a fenris wolf, an adult grizzly bear, a cockatrice and a cave crawler. Watch out for cockatrices – they're deadly if you're not wielding a mirror shield. You can get those from any Slayer master or from the Grand Exchange.",
    "Oh yes... They also want a... stuffed rock crab. Apparently.",
    "Well, to make stuffed animals, I need the skins to be prepared – tanned, if you will – otherwise they would rot. Taking them to a tanner won't do, though, as they use all sorts of chemicals that would ruin the natural lustre of the fur.",
    "Ideally, yes. The process is fairly simple, but too tiring for my old bones. First, you scrub the inside of the fresh skin with salt, which you can buy from any Slayer master or on the Grand Exchange. Then you need to dry them. Just put some logs in the fire pit over there, and stretch your fur skin up on the rack of ribs next to it. Finally, just light the fire and let it burn out, and the skin will be ready. Did you get that?",
    "That's right!",
    "I'd feel better if you helped me. I wouldn't want to let the museum down.",
    "So, will you help me?",
    "What mumbling? I can't hear any such thing. Ever considered getting that hearing checked?",
    "To myself? No, that's a sign of insanity. Instead, I have daily conversations with my stomach on what we're going to eat. Yes, that's it. Anyway, are you going to help me or not?",
    "Have you brought me any furs?",
    "Sure.",
    "You still need to bring me a unicorn hide. White unicorns live near the river, to the south of the Fremennik lands.",
    "You still need to bring me a bear pelt. Grizzly bears dwell in the east of the Fremennik Province.",
    "You still need to bring me a cave crawler skin. You'll find cave crawlers in the Fremennik Slayer Dungeon. They are poisonous, though, so do watch out.",
    "You still need to bring me a black unicorn hide. Black unicorns live in the east of the Fremennik Province.",
    "You still need to bring me a cockatrice skin. Cockatrices can be found in the Fremennik Slayer Dungeon. Don't go there without a mirror shield, though. You can buy a mirror shield from any of the Slayer masters.",
    "You still need to bring me a hobgoblin skin. You can find hobgoblins on the coast of Rellekka, among the rock crabs.",
    "You still need to bring me a fox pelt. Foxes live on the banks of the river to the south-east of the Fremennik Province.",
    "You still need to bring me a fenris wolf pelt. Fenris wolves roam just outside the gates of Rellekka.",
    "Ah yes, I'd forgotten about that. You still need to bring me a... rock crab fur.",
    "Rock crabs live on the northern coast of Rellekka and of the Fremennik Province. They will attack you if you get too close. They... apparently have furry underbellies.",
    "Did you get all that?",
    "Don't forget to prepare them first.",
    "Scrub them with the salt that you can buy from any Slayer master, put some logs in the fire pit next to my shack, stretch the skin on the rack of ribs, then light the fire.",
    "Can I have a look? Oh. That's not at all what I had imagined. Erm... Ah, well, very sorry about this.",
    "Yes, I bet you find it funny. Well done. You're proud of your little joke? *sigh*",
    "No, not you!",
    "Never you mind.",
    "Great! Let me take a look at them.",
    "That's the last of them! I can now turn these furs into splendid stuffed animals for the museum!",
    "Yes, you've been a tremendous help yet again. I'm always on the lookout for fresh bones, so if you see any of the ones on my wish lists, bring them right over. I have them pinned to the outside of my shack whenever you want to check them."
  ],
  "Sack": [
    "Mumblemumble.",
    "Mumblemumble?",
    "Mumble! Mumblemumble? Mumble!",
    "Mumble!",
    "Mumblemumble!",
    "...",
    "Mumble...",
    "Mumble! Mumblemumble? Mumblemumble!",
    "Mumblemumble.",
    "Grumble.",
    "Mumblemumeble.",
    "Sniggersnigger.",
    "Sniggersnigger.",
    "Grumble."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Fur_%27n_Seek?oldid=30120290’"
  ]
}