{
  "Player": [
    "Good day to you, Elena.",
    "What did they take?",
    "Well, good luck.",
    "I'll try to retrieve it for you.",
    "Any ideas?",
    "Hello Elena.",
    "No, I'm afraid not.",
    "Hello Jerico.",
    "That's right.",
    "Thanks Jerico.",
    "Omart, Jerico said you might be able to help me.",
    "Good stuff.",
    "How?",
    "Hello Jerico, I need someway to distract the watch tower, any ideas?",
    "Maybe you could shout and scream, and call them away?",
    "Yes. How quickly can you run?",
    "Maybe I could use your messenger pigeons to distract them?",
    "Ok, maybe I'll give it a go.",
    "Maybe if i'm really quiet they won't notice me?",
    "Well... perhaps I wait till nightfall?",
    "I can't think of anything either.",
    "Mmm, birdfeed! Now what could I do with that?",
    "I don't need any more birdfeed.",
    "I shouldn't take any more of Jerico's birdfeed - I've already got enough in the bank.",
    "What's it to you?",
    "Ok, lets[sic] do it.",
    "I'll be back soon.",
    "Hello Kilron.",
    "Not yet Kilron.",
    "Yes I do.",
    "Hello Omart.",
    "Hello Elena, I've spoken to Jerico.",
    "He has two friends who will help me cross the wall, but first I need to distract the watch tower.",
    "Elena: I've distracted the guards at the watch tower.",
    "Hello again.",
    "I'm afraid not.",
    "I'm afraid not.",
    "Hello there.",
    "Hello again Jerico.",
    "Not yet.",
    "Why?",
    "Hello nurse.",
    "What? Is the plague getting to you?",
    "I was under the impression that everyone here was affected.",
    "Hello nurse.",
    "Hmmm, strange that!",
    "Hello there.",
    "You should be more careful with your ingredients.",
    "Ok, I'll see what I can do.",
    "Hello there.",
    "You should be more careful with your ingredients.",
    "Hello there.",
    "Hmm... interesting, sounds like food poisoning.",
    "Just hold your breath and count to ten.",
    "Erm... I'm new, I just started.",
    "The best I can do is pray for you.",
    "There's nothing I can do, it's fatal.",
    "That's life for you.",
    "It's erm... at home.",
    "Hello.",
    "Be more careful with your ingredients next time.",
    "Yes, here it is!",
    "Those look pretty fancy.",
    "You're not kidding, I can smell it from here!",
    "I just find it hard to say goodbye sometimes.",
    "I'm afraid I've lost some of the stuff that you gave me...",
    "Great, I'll be on my way.",
    "I've forgotten what I need to do.",
    "Ok, I'll get to it.",
    "This can't wait, I'm carrying a plague sample.",
    "It's ok, I'm Elena's friend.",
    "I need some more touch paper for this plague sample.",
    "Who knows... I just need some touch paper for a guy called Guidor.",
    "Oh right... so am I going to be ok carrying these three vials with me?",
    "Ok, thanks for your help. I know Elena appreciates it.",
    "Hello again.",
    "No, I just wanted to say hello.",
    "Hi.",
    "Yes please.",
    "Hi, I've got something for you to take to Varrock.",
    "Well, there's an Inn in Varrock if you're desperate.",
    "Ok, I'll see you in Varrock.",
    "Hello, I hear you're an errand boy for the chemist.",
    "Good for you. Now can you take a vial to Varrock for me?",
    "Ok, we're meeting at the Dancing Donkey in Varrock right?",
    "Hello, I've got a vial for you to take to Varrock.",
    "Maybe you should ask him for more money.",
    "Right. I'll see you later in the Dancing Donkey Inn.",
    "Hello, I'm a friend of Elena, here to see Guidor.",
    "I'm really sorry to hear about Guidor. But I do have some very important business to attend to!",
    "Guidor is a religious man?",
    "I'm sorry to hear that. Is there anything I can do?",
    "A priest? Hmmm...",
    "I'll see what I can do.",
    "Hello again.",
    "Hello, how was your journey?",
    "Please tell me that you haven't drunk the contents...",
    "Thanks, I'll let you get your drink now.",
    "Hello, how was your journey?",
    "Please tell me that you haven't drunk the contents...",
    "No, I think you've done enough for now.",
    "Well, as they say, it's always sunny in Gielinor.",
    "Thanks, you've been a big help.",
    "Yep. Anyway, I'll take the package off you now.",
    "I'm getting a bad feeling about this. You do still have it don't you?",
    "Just give me the stuff now please. You do still have it don't you?",
    "What?",
    "That's great. Thanks to you I'll have to walk back to East Ardougne to get another vial.",
    "Hi, thanks for doing that.",
    "That was the idea.",
    "Hi, thanks for doing that.",
    "What do you mean?",
    "What?",
    "You sold my vial and gambled with the money?!",
    "No! Nothing could be further from the truth!",
    "You have no idea what you have just done!",
    "Hello, you must be Guidor. I understand that you are unwell.",
    "Well it's funny you should ask actually... I've come to ask your assistance in stopping a plague that could kill thousands.",
    "No! Well, yes... but not exactly. It's contained in a sealed unit from Elena.",
    "I've been sent by your old pupil Elena, she's trying to halt the virus.",
    "Yes, she wants you to analyse it. You might be the only one who can help.",
    "I have the plague sample.",
    "... some ethenea?",
    "That's why Elena wanted you to do it, because she wasn't sure what was happening.",
    "So what about the plague?",
    "So what does that mean exactly?",
    "Oh, nothing, I was just going to bless your room and I've done that now. Goodbye.",
    "Hello again Guidor.",
    "It's strange, anyway how are you doing?",
    "Good for you.",
    "Nothing.",
    "He said that there is no plague.",
    "Or maybe we're about to uncover something huge.",
    "What do you mean?",
    "Hello Elena.",
    "I assume that you are the King of East Ardougne?",
    "I get it from finding out that the plague is a hoax.",
    "I have evidence, from Guidor of Varrock.",
    "When is it ever good to lie to people like that?",
    "I don't understand...",
    "So what happened?",
    "Well at least I know now, but what can we do about it?",
    "Absolutely!",
    "Ok. There's just one thing I don't understand, how do you know so much about King Tyras?",
    "Well I've wasted enough of my time here."
  ],
  "Elena": [
    "You too, thanks for freeing me. It's just a shame the mourners confiscated my equipment.",
    "My distillator, I can't test any plague samples without it. They're holding it in the mourner quarters in West Ardougne. I must somehow retrieve that distillator if I am to find a cure for this awful affliction.",
    "Thanks traveller.",
    "I was hoping you would say that. Unfortunately they discovered the tunnel and filled it in. We need another way over the wall.",
    "My father's friend Jerico is in communication with West Ardougne. He might be able to help us, he lives next to the chapel.",
    "Hello brave adventurer. Any luck finding my distillator?",
    "Speak to Jerico, he will help you to cross the wall. He lives next to the chapel.",
    "Was he able to help?",
    "Hmm, could be tricky.",
    "Yes, I saw. Quickly meet with Jerico's friends and cross the wall before the pigeons fly off.",
    "You're back, did you find the distillator?",
    "I can't test the samples without the distillator. Please don't give up until you find it.",
    "So, have you managed to retrieve my distillator?",
    "Oh, you haven't... People may be dying even as we speak.",
    "So, have you managed to retrieve my distillator?",
    "You have? That's great! Now can you pass me those reaction agents please?",
    "Well, yes and no. The liquid honey isn't worth much, but the others are. Especially this colourless ethenea. Be careful with the sulphuric broline, it's highly poisonous.",
    "I don't understand... the touch paper hasn't changed colour at all... You'll need to go and see my old mentor Guidor. He lives in Varrock. Take these vials and this sample to him.",
    "But first you'll need some more touch paper. Go and see the chemist in Rimmington. Just don't get into any fights, and be careful who you speak to. Those vials are fragile, and plague carriers don't tend to be too popular.",
    "What are you doing back here?",
    "Yes... I have feelings for you too... Now get back to work!",
    "That's alright, I've got plenty.",
    "Ok, so that's your colourless Ethenea... Some highly toxic sulphuric broline... And some bog-standard liquid honey...",
    "Go to Rimmington and get some touch paper from the chemist. Use his errand boys to smuggle the vials into Varrock. Then collect the samples and take them to Guidor, my old mentor.",
    "You're back! So what did Guidor say?",
    "What?",
    "So what, this thing has all been a big hoax?",
    "Then I think this thing may be bigger than both of us.",
    "I mean you need to go right to the top... You need to see the King of East Ardougne!",
    "You must go see King Lathas immediately!"
  ],
  "Jerico": [
    "Hello, I've been expecting you. Elena tells me you need to cross the wall.",
    "My messenger pigeons help me communicate with friends over the wall. I have arranged for two friends to aid you with a rope ladder. Omart is waiting for you at the south end of the wall. But be careful, if the mourners catch you the punishment will be severe.",
    "Hmmm. Nothing springs to mind.",
    "So they chase after me?",
    "No. I don't like this idea.",
    "You might have some luck with that idea. The pigeons are around the back of my house if you want to try that.",
    "And what stops them seeing you?",
    "There's no time for that.",
    "That's too bad.",
    "The guards are distracted by the birds, you must go now, quickly traveller.",
    "So you've returned traveller. Did you get what you wanted?",
    "Omart will be waiting by the wall, in case you need to cross again."
  ],
  "Omart": [
    "He informed me of your problem traveller. I would be glad to help, I have a rope ladder and my associate, Kilron, is waiting on the other side.",
    "Unfortunately we can't risk it with the watch tower so close. So first we need to distract the guards in the tower.",
    "Try asking Jerico, if he's not too busy with his pigeons. I'll be waiting here for you.",
    "Well done, the guards are having real trouble with those birds. You must go now traveller, it's your only chance.",
    "Kilron!",
    "You must go now traveller.",
    "Don't take too long, those mourners will soon be rid of those birds.",
    "Hello traveller. The guards are still distracted if you wish to cross the wall."
  ],
  "Mourner": [
    "Keep away civilian.",
    "This tower's here for your protection.",
    "Stay away from there.",
    "Several mourners are ill with food poisoning, we're waiting for a doctor.",
    "In you go doc.",
    "Oh dear oh dear. I feel terrible, I think it was the stew.",
    "There is one mourner, who's really sick, resting upstairs. You should see to him first.",
    "Oh dear oh dear. I feel terrible, I think it was the stew.",
    "I need a doctor. The nurse's hut is to the south west. Go now and bring us a doctor, that's an order.",
    "You're here at last! I don't know what I've eaten but I feel like I'm on death's door.",
    "Yes, I'd figured that out already. What can you give me to help.[sic]",
    "What? How will that help? What kind of doctor are you?",
    "You're no doctor!",
    "Pray for me? You're no doctor... You're an imposter!",
    "No, I'm too young to die! I've never even had a girlfriend.",
    "Wait a minute, where's your equipment?",
    "You're no doctor!",
    "Hello Doc, I feel terrible. I think it was the stew."
  ],
  "Kilron": [
    "Hello traveller. Do you need to go back over?",
    "Okay, just give me the word.",
    "Okay, quickly now!"
  ],
  "Nurse Sarah": [
    "I don't know how much longer I can cope here.",
    "No, strangely enough the people here don't seem to be affected. It's just the awful living conditions that is making people ill.",
    "Me too, but that doesn't seem to be the case.",
    "Oh hello there. I'm afraid I can't stop and talk, a group of mourners have become ill with food poisoning. I need to go over and see what I can do."
  ],
  "Chemist": [
    "Sorry, I'm afraid we're just closing now. You'll have to come back another time.",
    "You idiot! A plague sample should be confined to a lab! I'm taking it off you. I'm afraid it's the only responsible thing to do.",
    "Oh, well that's different then. Must be pretty important to come all this way. How's everyone doing there anyway? Wasn't there some plague scare?",
    "Guidor? This one's on me then... the poor guy. Sorry for the interrogation. It's just that there've been rumours of a man/woman travelling with the plague on him/her. They're even doing spot checks in Varrock. It's a pharmaceutical disaster!",
    "With touch paper as well? You're asking for trouble. You'd better use my errand boys, outside. Give them a vial each. They're not the most reliable people in the world. One's a painter, one's a gambler, and one's a drunk. Still if you pay peanuts you'll get monkeys, right? It's better than entering Varrock with half a laboratory in your napsack.",
    "Yes well don't stand around here gassing. You'd better hurry if you want to see Guidor... He won't be around for much longer.",
    "Oh hello, do you need more touch paper?",
    "Oh.. ok then... hello.",
    "Ok, here you go."
  ],
  "Hops": [
    "Sounds like pretty thirsty work.",
    "Don't worry, I'm a pretty resourceful fellow you know.",
    "Sure, I'm a regular at the Dancing Donkey Inn as it happens.",
    "I suppose I'd better get going. I'll meet you at the Dancing Donkey Inn.",
    "Pretty thirst-inducing actually...",
    "Oh the gods no! What do you take me for? Here's your vial anyway.",
    "Pretty thirst-inducing actually...",
    "Of course I can tell you that I haven't drunk the contents... but I'd be lying. Sorry about that me old mucker, can I get you a drink?"
  ],
  "Da Vinci": [
    "Well that's my job yes. But I don't necessarily define my identity in such black and white terms.",
    "Go on then.",
    "That's right.",
    "Oh, it's you again. Please don't distract me now, I'm contemplating the sublime.",
    "Hello again. I hope your journey was as pleasant as mine.",
    "Ok, here it is.",
    "Hello again. I hope your journey was as pleasant as mine.",
    "Package? That's a funny way to describe a liquid of such exquisite beauty!",
    "Absolutely. It's just not stored in a vial anymore.",
    "Instead it has been liberated. It now gleams from the canvas of my latest epic: The Majesty of Varrock!",
    "Well you can't put a price on art."
  ],
  "Chancy": [
    "Tssch... that chemist asks for a lot for the wages he pays.",
    "Nah... I just use my initiative here and there.",
    "Be lucky!",
    "Look, I've got your vial but I'm not taking two. I always like to play the percentages.",
    "No problem.",
    "Next time give me something more valuable... I couldn't get anything for this on the blackmarket.[sic]",
    "No problem. I've got some money for you actually.",
    "Well, it turns out that potion you gave me, was quite valuable...",
    "I know that I probably shouldn't have sold it... but some friends and I were having a little wager, the odds were just too good!",
    "Actually yes... but praise be to Saradoming[sic] because I won! So all's well that ends well right?",
    "Well, there's no pleasing some people.",
    "Ignorance is bliss I'm afraid."
  ],
  "Guard": [
    "Halt. I need to conduct a search on you. There have been reports of someone bringing a virus into Varrock.",
    "You may now pass."
  ],
  "Guidor's wife": [
    "I'm afraid...(she sobs)...that Guidor is not long for this world! So I'm not letting people see him now.",
    "You heartless rogue! What could be more important than Guidor's life? A life spent well, if not always wisely... I just hope that Saradomin shows mercy on his soul!",
    "Oh god no! But I am! If only I could get him to see a priest!",
    "Please leave my husband alone. He's very sick, and I don't want anyone bothering him.",
    "Thank you, but I just want him to see a priest.",
    "Father, thank heavens you're here! My husband is very ill! Perhaps you could read him his final rites?"
  ],
  "Guidor’s wife": [
    "Hello there. I fear Guidor may not be long for this world!"
  ],
  "Guidor": [
    "Is my wife asking priests to visit me now? I'm a man of science for god's sake. Ever since she heard rumors of a plague carrier travelling from Ardougne she's kept me under house arrest. Of course she means well, and I am quite frail now... So what brings you here?",
    "So you're the plague carrier!",
    "Elena eh?",
    "Right then, sounds like we'd better get to work!",
    "Seems like you don't actually HAVE the plague sample. It's a long way to come empty-handed... and quite a long way back to.",
    "Now I'll be needing some liquid honey, some sulphuric broline, and then...",
    "Indeed!",
    "Look, I need all three reagents to test the plague sample. Come back when you've got them.",
    "Now I'll just apply these to the sample and... I don't get it... the touch paper has remained the same.",
    "Well that's just it, nothing has happened.",
    "I don't know what this sample is, but it certainly isn't toxic.",
    "Don't you understand? There is no Plague! I'm very sorry, I can see that you've worked very hard for this... ... but it seems that someone has been lying to you. The only question is... ... why?",
    "Well, hello traveller. I still can't understand why they would lie about the plague.",
    "I'm hanging in there."
  ],
  "King Lathas": [
    "You assume correctly, but where do you get such impertinence.",
    "A hoax? I've never heard such a ridiculous thing...",
    "Ah... I see. Well then you are right about the plague. But I did it for the good of my people.",
    "When it protects them from a far greater danger, a fear too big to fathom.",
    "Their King, Tyras, journeyed out to the West on a voyage of discovery. But he was captured by the Dark Lord. The Dark Lord agreed to spare his life, but only on one condition... That he would drink from the Chalice of Eternity.",
    "The chalice corrupted him. He joined forces with the Dark Lord, the embodiment of pure evil, banished all those years ago... And so I erected this wall, not just to protect my people, but to protect all the people of Gielinor. Now, with the King of West Ardougne, the Dark Lord has an ally on the inside. So I'm sorry that I lied about the plague. I just hope that you can understand my reasons.",
    "Nothing at the moment, I'm waiting for my scouts to come back. They will tell us how we can get through the mountains. When this happens, can I count on your support?",
    "Thank the gods! I give you permission to use my training area. It's located just to the north west of Ardougne, there you can prepare for the challenge ahead.",
    "How could I not do? He was my brother.",
    "No time is ever wasted, thanks for all you've done."
  ],
  "Congratulations! You have completed": [
    "'Biohazard' - Complete this Novice quest."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Biohazard?oldid=36205873’"
  ]
}