{
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "missing voice linesYou can discuss this issue on the talk page or edit this page to improve it."
  ],
  "Brother Samwell": [
    "Adventurer, wait! Please... Oh great Saradomin please help me!",
    "It all happened so fast. Please protect me. Please! Oh no - what if they come back?",
    "Someone... murdered my brothers. Th-they left me alive. Why didn't they take me and not them?",
    "But look at them! They didn't deserve an end like that.",
    "I can hardly look at them. It's as if their souls can't pass on to the afterlife...",
    "It only happened after their murder, I-I don't think it was the killer that caused it. They just look so tormented... I keep racking my brains, but it's all a blur. Damn my old age - I can't remember anything of the attacker!  P-please, I beg of you... Help me search for evidence so we can find who killed my brothers and bring them to justice.",
    "Oh thank you, adventurer! I think it would be best to start by searching for clues that point to the killer. You're bound to find something in the surrounding area. Y-you should check th-the... bodies, too. Take my notebook and update it with clues as you find them, I need a moment to collect my thoughts...",
    "They may have died fast, but look at them now. It's as if their souls can't pass on to the afterlife...",
    "It only happened after their murder. I-I don't think it was the killer that caused it. They just look so tormented...: I keep racking my brains, but it's all a blur. Damn my old age - I can't remember anything of the attacker! P-please, I beg of you ... Help me search for evidence so we can find who killed my brothers and bring them to justice.",
    "They were monks, not fighters. Pacifists! But it's as if their souls can't pass on to the afterlife.",
    "It only happened after their murder. I-I don't think it was the killer that caused it. They just look so tormented... I keep racking my brains, but it's all a blur. Damn my old age - I can't remember anything of the attacker! P-please, I beg of you ... Help me search for evidence so we can find who killed my brothers and bring them to justice.",
    "You also follow the god of order? Oh, praise him! He has not forsaken me yet. Someone... murdered my brothers. Th-they left me alive. Why didn't they take me and not them?",
    "Saradomin bless you, adventurer. Let me take a look at what you've found. Strange. Most peculiar. It could have been an elf who did this, the ring and arrow seem to be elven craft. I just can't remember, it was all over so quickly...",
    "I'm sorry. I have seen much in my many years but I never thought to stare evil in the face as today. Let me think. My only knowledge of the elves comes from tales and legends I was told as a child. My mother used to read from time to time. I vaguely remember the tale of their goddess, Seren. She was ridden with guilt, and shattered herself into thousands of crystals to always be with her followers. But she was supposed to believe the different races could live in peace. Why would an elf want to do this to us?",
    "No, I- I don't think so. Although I did notice a strange man when we passed some stone steps to the west - very strange indeed! He was carrying a sack of bones and muttering to himself. Perhaps you should find out if he saw anything.",
    "Did he have any useful information?",
    "Just as we suspected! That elf must have been involved somehow. Did he mention anything else?",
    "Oh, I'm not sure if that fits. I must say, I haven't met many elves in my time. Was there any more?",
    "A man living up there with only bones for company? He probably doesn't get many visitors.",
    "I-I'm not sure I can draw a conclusion. Perhaps I'm still in shock... Who do you think it was?",
    "I would say the same, but I'm not sure the odd man's description of the killer matches. Besides, I can't see a motive. And it's strange they would discard their precious crystals.",
    "I suppose the crystals point to Seren, but how? She could have had some involvement but I really can't imagine she was the killer.",
    "Me? How could you even suggest such a thing? I would never do anything to hurt my brothers.",
    "Still, I can see your suspicions... I must assure you adventurer, I had no hand in this brutality.",
    "He may act suspiciously but none of the evidence points towards him. Living in the area and talking to a sack of bones does not make him guilty.",
    "Zamorak. I shudder at the name. It is true that he would wish harm upon Saradomin's followers. But none of the clues point towards him. We need to find the killer using the evidence we've found.",
    "Sliske? The name is unfamiliar to me. Perhaps you know something I do not, adventurer.",
    "Zamorakians? In Paterdomus? I must inform King Roald of this... desecration! I'm sorry, adventurer. I must focus on the task at hand... While I am outraged that they have seen fit to take over our temple, I don't believe the evidence points towards the Zamorakian monks.",
    "Perhaps you're right. It would be unwise to rush this and jump to a conclusion.",
    "Did the odd man mention what direction the figure was heading?",
    "If they left crystals behind maybe you could pick up some sort of trail and figure out where they went?",
    "You should take the same approach as before, note down any clues and try to find a witness.",
    "What? Who in Saradomin's name would do such a thing? You- You don't think someone was...",
    "Maybe they were protecting us - avenging Saradomin's loyal followers!",
    "Okay, let me take a look.",
    "The evidence you've found seems to suggest the killing has something to do with Saradomin. How could somebody do this?",
    "Could it be other monks? Wizards? There is no feud between Seren and Saradomin that I know of...",
    "All this mindless killing just doesn't make any sense to me.",
    "A cruel place indeed. I don't know what I'll do without my brothers... We have to find this criminal.",
    "You're right. If we put our minds to it, I'm sure we can figure this out!",
    "I... I guess you're right. I can grieve when this is all over.",
    "Did you manage to find any witnesses?",
    "Really? What did he see? He must have had some useful information.",
    "Vanished? P-perhaps a teleport spell. How are we supposed to find them now?",
    "I haven't heard of anything like that before. It doesn't sound like any normal teleport spell.",
    "We seem to have found all the evidence but have no clear explanation.",
    "I am no expert on magic and I know little of elves or wizards. I think it's time we sought help, adventurer.",
    "I have an old friend who also worships Saradomin. We were close friends when we were younger. But I became a monk, and she a wizard.",
    "Her name is Valina and she specializes in crystal magic. You should go and talk to her to see what she knows about the clues.",
    "You can find her at the entrance to the Wizards' tower, south of Draynor village.",
    "I knew I could count on her. This information changes things somewhat.",
    "Elves, monks, wizards, gods, this is all so confusing! What do you think is going on?",
    "I must agree, there is something sinister afoot here. Who do you think committed this atrocity then?",
    "Hmm. You seem clearer than I in my old age. Who do you think committed this atrocity then?",
    "I'm sorry. My mind is frail and old, if only I could remember. Who do you think could have committed this atrocity?",
    "Initially the clues did seem to point that way, but the information from Valina seems to absolve them.",
    "Perhaps someone was trying to frame a Saradominist wizard.",
    "Saradomin? The thought may have crossed my mind, but it seems like madness.",
    "He is the god of order and wisdom. He would never do something like this, even in defense of his followers!",
    "Me? How could... I'm offended you would accuse me after I begged for your help! These monks were my friends!",
    "I suppose I can forgive your suspicions though, adventurer.",
    "He may have been in the area, but there is no evidence to suggest he had a hand in this.",
    "He's a pyromaniac, not a killer. His job ensures the safety of many people.",
    "Valina? How Dare y-I mean... I've known Valina for many years. She isn't capable of something like this.",
    "Besides, she helped us out of the kindness of her heart. I can't even imagine it was her.",
    "Sliske? As I'm not familiar with him I cannot rule him out. Perhaps you've seen something I've missed, adventurer.",
    "King Tyras? As I'm not familiar with him I cannot rule him out. Perhaps you've seen something I've missed, adventurer.",
    "I may not be as sharp as I used to be, but I am tough to fool, adventurer.",
    "The crime scenes are so similar. It's almost as if the clues were planted.",
    "Precisely! And besides, Seren and Saradomin have no quarrel with each other. I.. I think someone might be trying to turn them against each other!",
    "Ahh! What?",
    "Who said what? I can't hear anything.",
    "What do you mean? I can't hear anything.",
    "Wait. Can you feel that rumbling?",
    "I-Uhh, excuse me... Wh-who is this Sliske?",
    "I can't believe it... You were right all along, adventurer. We have to bring him to justice!",
    "B-but... Sorry, but he killed my brothers.",
    "By the light of Saradomin... It's the God of the Underworld, Icthlarin!",
    "W-wait... Did you bring Sliske to justice?",
    "B-but, what about my brothers? He's a murderer...",
    "What a day!",
    "Thank you for all your help. I am eternally grateful adventurer.",
    "Take these as thanks, they are the least I can offer."
  ],
  "Player": [
    "What's going on?",
    "It's okay, I can help you.",
    "It sounds like you're lucky to be alive.",
    "Something's happening to their bodies.",
    "How did that happen to them?",
    "It seems like they had a quick death.",
    "How did that happen to them?",
    "Doesn't look like they put up much of a fight.",
    "How did that happen to them?",
    "You have to try and calm down.",
    "Pull yourself together, old man.",
    "Saradomin has led me to your aid. (if aligned with Saradomin)",
    "I've thoroughly searched the area, I think I have all the clues now.",
    "It must be horrible, but try to focus.",
    "I encountered the elves when I travelled to Tirannwn. From what I learned, the clues do seem to point towards them. (conditions unknown)",
    "Are you sure there weren't any witnesses?",
    "That sounds like a good idea.",
    "Come on, you must remember!",
    "Stop feeling sorry for yourself.",
    "I'm conducting an investigation. Have you seen anything out of the ordinary recently?",
    "A group of monks were murdered nearby, I'm trying to get to the bottom of it.",
    "Please, I could really use your help. If you'll just answer a few questions then I'll be on my way.",
    "Have you seen any elves?",
    "I don't have time for you lies. Tell me what you've seen or this won't end well for you.",
    "I found a lot of evidence at the crime scene that points towards an elf. I just need a little more information, please.",
    "I knew it! This can't be a coincidence. What did you hear?",
    "I'm the one asking questions. You'd better answer them before I lose my patience.",
    "Earlier you said you hear a lot of things too. What kind of things?",
    "Don't play dumb with me - you said you hear things. I'll give you 3 seconds before I draw my weapon. 3...",
    "Was it the elf you saw earlier?",
    "That's interesting. Thanks for your help.",
    "I spoke to the old man. You were right. He was strange.",
    "He saw an elf heading east along the path.",
    "He saw a very tall, dark, hooded figure escaping.",
    "He wasn't very cooperative.",
    "An elf.",
    "The elf god, Seren.",
    "Brother Samwell.",
    "Odd Old Man.",
    "The chaos god, Zamorak.",
    "Sliske (Unlocked by The World Wakes).",
    "Zamorakian monks (Unlocked by Legacy of Seergaze).",
    "I think somebody else did this.",
    "According to him, the killer made off to the east.",
    "Good idea. I'll see what I can find.",
    "I'm investigating a murder and was wondering if you could answer some questions.",
    "This is much more important than your stupid beacon, answer my questions or things will get ugly.",
    "I need to know if you've seen anything out of the ordinary recently?",
    "I've had enough of this. If you don't start talking, I'll make a glorious fire out of you!",
    "What happened? Any information could help me find the killer and stop them from coming back here.",
    "Did you get a look at who the attacker was?",
    "Okay, thanks for the help. This information will be really useful.",
    "I found an elf like the clues suggested, but... She had been murdered. Saradomin's symbol had been branded into the palms of her hands.",
    "I've searched thoroughly. I think I have all the clues.",
    "I spoke to the beacon tender who was nearby when the elf was killed. He was able to see from a nearby hilltop.",
    "He said the killer vanished into thin air.",
    "I'm not sure. Blaze said that when the killer vanished, all the light was sucked out of the area. What could that mean?",
    "Whom do you have in mind?",
    "I was told by brother Samwell that you might be able to help us.",
    "Not so great actually. A group of monks he was travelling with was attacked. He's okay, but we're trying to find the culprit.",
    "He's a little shaken, but he'll be fine. I just need some information so I can track down the killer.",
    "Some of the victims were killed by similar stab wounds. Here - it would be easier if you had a look at my notes.",
    "I spoke to Wizard Valina and noted down what she told me.",
    "It does seem odd for an assassin to leave so many clues.",
    "None of this seems to explain the trapped souls.",
    "Ahhhh!",
    "Who said that?",
    "I think I'm hearing things.",
    "Icthlarin? Is that you?",
    "An intrepid adventurer.",
    "A mighty warrior.",
    "A shrewd investigator.",
    "A courageous hero.",
    "<playername>, courageous hero.",
    "Why should I tell you?",
    "Someone killed these people.",
    "I'm not quite sure.",
    "What's happened to Death?",
    "I believe the clues indicate Sliske, a devious and unpredictable Mahjarrat.",
    "What is a Mahjarrat?",
    "Why is he committing these crimes?",
    "One of them was carrying this box.",
    "Sliske's ascension?",
    "And what if I was to open it?",
    "We should attend his ascension.",
    "We shouldn't trust him.",
    "What do you mean?",
    "But why plant the clues at the crime scenes?",
    "But if we don't save Death, will things ever go back to normal?",
    "No, I need some time to think about this.",
    "I want to continue to the citadel.",
    "I want to see if I can learn anything interesting.",
    "What are you going to do about the threat Amascut poses?",
    "Who is Armadyl?",
    "Who are you?",
    "Has Armadyl returned?",
    "Does Kree'arra remember our fight? (Unlocked by The World Wakes)",
    "Is this Sliske's citadel?",
    "Goodbye",
    "Why are you here?",
    "What will you do if their argument escalates here?",
    "What have you been doing?",
    "How are you finding your new form?",
    "Goodbye.",
    "Why aren't you trying to fight everyone?",
    "Bandos is here?",
    "Who's Bandos?",
    "Why aren't you trying to fight everyone?",
    "Bandos is here?",
    "Who's Bandos?",
    "Why does he care so much?",
    "Why are you Zarosians here?",
    "Did Sliske invite you?",
    "Is Sliske still Zarosian?",
    "Do you believe Sliske has ascended to godhood?",
    "Ask about Senntisten (unlocked by Temple at Senntisten)",
    "How do you know?",
    "Goodbye.",
    "Why are you here?",
    "What's stopping you going in there?",
    "Are you still loyal to Zamorak?",
    "Goodbye.",
    "What's going on?",
    "It was Sliske that murdered them. He planted the clues to set Seren and Saradomin up!",
    "So he could give you false information in order to lure them to his ascension!",
    "I investigated the crime scenes with Icthlarin. Sliske employed similar tactics to lure him here, too.",
    "Saradomin's followers have wronged the elves, Zilyana. You should beg for their forgiveness.",
    "You've wronged Saradomin's followers, Ilfeen. You should beg for their forgiveness.",
    "What are you?",
    "What's this all about?",
    "Stop wasting my time.",
    "I don't trust you.",
    "What do I do?",
    "Why should I take part?",
    "This'll be a piece of cake.",
    "Sounds fun!",
    "Fine, but only to find Death.",
    "You look cleverer than you are. Where's Death?",
    "Tell me where he is.",
    "Get to the point.",
    "What are you doing here?",
    "I don't have time for your ga-",
    "That's more like it, let's hear this riddle...",
    "That's nothing for a mastermind like me!",
    "A stupid riddle for a stupid mask.",
    "I like a challenge.",
    "How can I trust you to free Death?",
    "Can I hear the riddle again?",
    "How do I answer?",
    "Goodbye.",
    "Now hold up your end of the bargain. I played your game - you must release Death.",
    "But what about Death? You said you would free him if I answered your stupid riddle!",
    "I earned my invitation fair and square.",
    "I follow the Empty Lord. You have a lot to answer for, Sliske.",
    "Seren is my goddess. If she can't be here then I'll uphold her teachings in her absence.",
    "I have pledged allegiance to the Godless. I have more right to be here - or in Gielinor for that matter - than any of you.",
    "I've had enough of your games, Sliske. Release Death before things get ugly.",
    "None of us should trust Sliske. I was there - I saw him murder Guthix!",
    "How did you capture a creature as powerful as the dragonkin?",
    "I saw the Staff of Armadyl for myself. How did you get hold of it?",
    "So he brought it right to you?",
    "Sir Tiffy, Thaerisk and I teleported the stone somewhere even we couldn't have known. How has it come into your hands?",
    "Where did you find it?",
    "You brought us here for your ascension. Have you become a god or not?",
    "What?",
    "This is what the world needs. There are too many gods dividing the people of Gielinor.",
    "Don't you see the destruction this will cause? The gods have already done enough damage.",
    "Finally the deserving god will be able to reign above all others.",
    "The day has finally come for me to take my deserved place as a god!",
    "I don't trust you to keep your word Sliske. I won't be fooled.",
    "Armadyl is right. We can all live harmoniously, in peace. We have to bring Sliske to justice.",
    "Bandos is right. It's time the arguing stops and we see who is really the most powerful.",
    "You are all a negative influence on the world. Have your contest somewhere else and leave us mortals out of it.",
    "All your efforts are futile. Soon Zaros will return to reclaim his throne regardless.",
    "Guthix may be gone, but many of us still follow his teachings. We will seek balance, whatever the outcome. I am a Guardian of Guthix. I have supported him at every turn and will continue to uphold his values.",
    "I don't know!",
    "What will you do now?"
  ],
  "Monk's soul": [
    "Can't... Can't remember... Saradomin's light, release. Please...",
    "Bound. Shackled. Free me... Mercy! Oh gods, mercy...",
    "Was it... him? Who? The masked face. Trapped me..."
  ],
  "The chest is filled with the monks' belongings": [
    "some dusty tomes, stale bread and rough, brown robes."
  ],
  "Witness": [
    "Odd Old Man",
    "Blaze Sharpeye"
  ],
  "Sack": [
    "Mumblemumble.",
    "Mumblemumble. Mumblemumblemumble.",
    "Mumblemumblemumblemumble. Mumble.",
    "Mumblemumble.",
    "Mumble."
  ],
  "Odd Old Man": [
    "Eh, out of the ordinary? No. What exactly are you investigating?",
    "Oh, well, er... I haven't seen anything. I'm busy with my bones.",
    "Well, er...",
    "Alright. It's easy to see the path from up here. I see a lot of people come and go. Hear things, too.",
    "I might have done, but the elves live far away. Why would you ask?",
    "Well now there's no need to be like that, I think you should leave...",
    "Hmm...",
    "Yes, alright. I do recall seeing an elf on the path today, heading eastward.",
    "Erm, hear? I don't know what you mean.",
    "You're just being rude now. Actually, I don't think I have seen any elves.",
    "I don't know what you're talking about, maybe it's time you left.",
    "Alright, I'm sorry! I'm sorry!",
    "Yes! It was a terrible commotion. Lots of screaming and shouting. I peered over the rocks here, but it was all over too quickly. There were three men lying dead on the floor. I only managed to glimpse a tall, hooded figure making off into the distance to the east.",
    "I didn't get a good look, but they seemed to be much taller and were wearing dark clothes.",
    "Oh shut up."
  ],
  "Elf's soul": [
    "The figure... Shadows... From nowhere? Sent me. Trapped me. Free me..."
  ],
  "Blaze Sharpeye": [
    "A murder, you say? I don't really have time. I'm busy tending to the beacon, you see?",
    "Alright, alright! I didn't see much though. What burning questions do you have?",
    "Seen? Not really. Unless you're referring to my glorious fire I had burning earlier! Now that was extraordinary!",
    "Woah, ok! Right... earlier I heard a scream from down the hill.",
    "When I peeked out to have a look, I saw an elf lying there. It scared me half to death!",
    "I tried to get a look at the killer but... I...",
    "Well... Okay, I've never witnessed anything like it in my life.",
    "When I looked over to the killer they vanished. I've seen people teleport, but this was different...",
    "Everything went dark, as if the sun had disappeared. It was like they created a rift that sucked all light from the area.",
    "I thought it would be too dangerous to go any further, so I hid up here behind my beacon.",
    "No. They were gone so fast I barely saw them."
  ],
  "Brother Samwell There are many groups that wear blue robes": [
    "Saradominist wizards, for example. It vould have been any of them. I have known wizards in the past. It's hard to believe those that follow Saradomin would be capable of murder."
  ],
  "Wizard Valina": [
    "Welcome to the Wizards' tower, adventurer.",
    "Oh yes, my dear friend Samwell. It's been years since I saw him. How is he, anyway?",
    "Gosh.. He isn't hurt is he? I'll help in any way I can. I'm afraid I can't leave my post, though.",
    "Oh my, what a mess. It seems you've found some very strange clues, but I think I can help. I have a lot of experience in some of these fields.",
    "I'll help in any way I can.",
    "Well, where do I start. I'm sure you're aware that it's quite uncommon for an elf to venture so far from Tirannwn, but it's not unheard of.",
    "I'm particularly intrigued by the crystals you've found. Being an expert on crystal magics, I have conducted much research on the subject.",
    "Firstly, crystals are extremely precious to the elves. For them to be discarded so carelessly is highly irregular.",
    "And that's ignoring the assumption that a skilled assassin would leave any clues at all.",
    "Secondly, a crystal arrow would be entirely crystalline. I've yet to come across an arrow that is crystal-tipped as you've described.",
    "In summary, the clues you've found are quite misleading. So I would advise caution, adventurer.",
    "Some of these clues do appear to indicate the involvement of a Saradominist, potentially a wizard.",
    "As you can see, my position allows me to keep track of the comings and goings of many wizards. Anyone entering or leaving must check in with me.",
    "No one from this tower has left for a significant amount of time, but admittedly I cannot account for all Saradominist wizards across Gielinor.",
    "Regardless, this kind of behaviour is uncharacteristic for a follower of Saradomin. It seems an unlikely conclusion.",
    "Thank you, adventurer.",
    "Given the clues, you are right to put my counter-argument under scrutiny. Let's look at this logically:",
    "Firstly, the weapon of choice. The elf was killed by an accurate stab wound. Wizards are trained in magic, not combat.",
    "Secondly, we all wear the same standard of robes. You describe the blue fabric at the crime scene as rough linen.",
    "Whereas our robes are woven from wool and imbued with defensive enchantments, which give the fabric a distinctive shine.",
    "If anything, it sounds like the killer was trying to impersonate a wizard.",
    "What on earth are you insinuating? I am an esteemed wizard of Saradomin. I hold honesty and integrity in the utmost regard.",
    "Now if you must scrutinise my counter-argument, I will offer a more scientific hypothesis.",
    "Firstly, the weapon of choice. The elf was killed by an accurate stab wound. Wizards are trained in magic, not combat.",
    "Secondly, we all wear the same standard of robes. You describe the blue fabric at the crime scene as rough linen.",
    "Whereas our robes are woven from wool and imbued with defensive enchantments, which give the fabric a distinctive shine.",
    "If anything, it sounds like the killer was trying to impersonate a wizard.",
    "Ah yes, this doesn't sound like regular teleportation. Normally, the spell would emit light, rather than absorb it.",
    "A possible explanation is that the killer opened a rift to escape to a darker realm or dimension.",
    "But that would require powerful magic, which most wizards have yet to master. It doesn't seem to conform to the other evidence.",
    "It all depends on how reliable you believe this 'Blaze Sharpeye' to be, really.",
    "This may surprise you adventurer, but we have been receiving reports of similar happenings recently.",
    "I must say, I've never encountered anything like this before. An ethereal spirit trapped in the physical world. How intriguing.",
    "Here at the tower we research all manner of magic. I'm not aware of something like this ever being documented until now.",
    "I would say this is not a magical phenomenon, and certainly not related to your killer.",
    "What we're dealing with here is on a much larger scale. It would seem something quite drastic is happening."
  ],
  "Strange Voice": [
    "I believe I may be able to explain, mortal."
  ],
  "Icthlarin": [
    "Yes, it is I. After our last encounter I established a telepathic connection with you.",
    "Do not be alarmed. I sensed you on the surface world. My arrival is imminent.",
    "Greetings mortal. I am Icthlarin, God of the Underworld. Who might you be?",
    "If your words bear truth, I may have use of you.",
    "I sensed many dead here, but I did not foresee these circumstances. What happened?",
    "Our paths cross again, mortal. I sensed there was more to your fate that day in the pyramid.",
    "I sensed many dead here, but I did not foresee these circumstances. What happened?",
    "It would not be wise to question a god. I shall warn you only once.",
    "Perceptive. These mortals passed at the hands of another. Pawns in a greater plan, perhaps.",
    "Indeed, the reason for these mortals' passing is not immediately apparent. Pawns in a greater plan, perhaps.",
    "There has been a most grave turn of events, adventurer. The reaper of souls, whom you know as Death, has gone missing.",
    "Without his scythe, there is nothing to sever the tie between souls and their physical shells.",
    "Look about you. The souls are in limbo, shackled to these lifeless husks.",
    "I have travelled across all of Gielinor bearing witness to the same thing. I cannot help them all.",
    "I am the guardian of souls. I care not for the process of dying, for that is the concern of the reaper.",
    "I stand my vigil at the gates of Gielinor's Underworld. It is a dark place filled with all manner of devourer beasts; their thirst for souls insatiable.",
    "It is there that Death delivers the souls he has collected, so I may safely shepherd them to the afterlife.",
    "Without him, the souls remain trapped. Without me, they become lost.",
    "Death does have fail safes in place: helpers that are able to use shards from his scythe to release souls.",
    "But we are in times of great unrest, and they are unable to keep pace with the flow of souls.",
    "So I am assisting by transporting the deceased to them. But I am tired, mortal - there is much that needs my attention.",
    "I have not known Death to abandon his duty. Not once in thousands of years...",
    "There are sinister powers at work here mortal. I must find him, with due haste. Before things fall apart completely.",
    "You have a keen eye, mortal. I am familiar with this miscreant, I believe he may be connected to Death's disappearance.",
    "The question is: why? Kidnapping Death and attempting to turn gods against each other... Something is amiss.",
    "The answer to this as yet eludes me. I fail to see the connection between kidnapping Death and turning gods against each other.",
    "What is clear is that he is setting in motion dangerous events, and we cannot let him continue.",
    "I suspect that the deaths here are more significant than the others I have seen. I must lay eyes upon the clues you have collected mortal.",
    "It is just as I expected. The person you are looking for is a devious Mahjarrat called Sliske. I believe he may also be connected to Death's disappearance.",
    "The question is: why? Kidnapping Death and attempting to turn gods against each other... Something is amiss.",
    "Recently he slew Guthix, the god of balance. Now no one is sure of his whereabouts, or the power he possesses.",
    "They are powerful, long-lived and war hungry. Do not trust them mortal, as they will stab you in the back when you need them most.",
    "The answer to this as yet eludes me. I fail to see the connection between kidnapping Death and turning gods against each other.",
    "What is clear is that he is setting in motion dangerous events, and we cannot let him continue.",
    "I would ask for your help, mortal. You have seen the evil at work here, and now you know the truth...",
    "Our highest priority is- wait... Something is wrong.",
    "Prepare yourself, adventurer. I sense the approach of undead.",
    "Well fought, mortal. I am not accustomed to undead withstanding my power...",
    "Ordinarily I would dispatch tens of wights with a wave of my hand, but these...",
    "It seemed almost as though they were attuned to my power. Like something was protecting them.",
    "These seemed almost as though they were attuned to my power. Like something was protecting them.",
    "Hmm, a peculiar object. There's some sort of mask affixed to the lid.",
    "What in the Underworld is that?",
    "What is your purpose, strange creature?",
    "Speak clearly, mask. What event? Who is your master?",
    "In light of recent events he must believe he has obtained godhood.",
    "This mask must be mad to believe I'd ever respond to an invitation sent by that back-stabbing snake.",
    "You would have the audacity to kidnap Death himself? Do you know nothing of the consequences?",
    "You would dare invoke the wrath of a god?",
    "Do not include me in your deceptions, traitor. Release Death immediately.",
    "Sliske?",
    "It would seem he has us cornered, mortal.",
    "With Death gone, Sliske knew I would come to the surface world to deal with the trapped souls.",
    "After killing the people you see here, he predicted my arrival and left his wights to ambush me.",
    "But they were just a show of his power. The real purpose was to deliver his invitation. Kidnapping Death leaves me no choice but to attend his ascension.",
    "Ah yes, this is the key to his master plan. I believe he is hatching similar schemes to also force the other gods into attendance.",
    "The piece of the puzzle before you seeks to turn Seren and Saradomin against each other.",
    "If they have both returned to Gielinor and believe each other to be at the citadel, they will likely attend in order to confront one another.",
    "If I am correct, Sliske will have a plan in place for each god, and the situation is more dire than I first believed.",
    "I was right to seek your help, adventurer. The evidence you gathered has been invaluable, if Sliske is gathering the gods in one place who knows what he may do.",
    "And to make matters worse he has kidnapped Death. I cannot stand by and allow what ever madness he is planning to unfold.",
    "You need not concern yourself with this, mortal.",
    "Rest assured, Sliske will answer for his crimes.",
    "Still, I cannot bring myself to trust this box.",
    "No. It is a fact I am well aware of. First, I must transport these souls to Death's mansion. After that it seems we have only one option.",
    "The souls are in safe hands with Death's helpers. Open the box when you are ready to be teleported to the citadel, adventurer.",
    "We must exercise caution adventurer, we were given this by Sliske after all... Are you sure you wish to open it?",
    "There are many high-ranking followers here. Evidently I was not the first to receive an invitation.",
    "You may speak to those present for more information or notify me if you are ready to proceed.",
    "It would be more effective for us to split up and search for Death.",
    "If I use my invitation to enter the main chamber, you can infiltrate the rest of the citadel.",
    "My sister has gone mad, mortal. She summons creatures to devour the souls that I strive to protect.",
    "I cannot help while her beasts relentlessly harry me in the underworld. My task is too important, and the stakes are too high.",
    "I teeter on the brink of failure, but you can succeed. I believe she can be saved. Redeem her adventurer... You must.",
    "I see Sliske's managed to bend you all to his will as well, then.",
    "I am a god and the recipient of an invitation, same as you.",
    "We are all gods here, gathered for the same purpose. We must be wary of Sliske's plot.",
    "Yet here we all are. The most gods assembled in one place in all of history. And I am sure, like I, you were persuaded...",
    "You were once a Mahjarrat, same as he. Sliske knew you would come to witness another of your kind ascend.",
    "It is the rest of us that have been manipulated.",
    "Saradomin, you must see how Sliske lured you here.",
    "Even the attack itself was a set up. Had Seren returned she would also be here, manipulated by the same plot as you.",
    "You know as well as anyone. I would not trust this pretender in a millennium.",
    "He has kidnapped Death. What is a god of the Underworld if there is no death?",
    "Enough! I am not alone in my search, and we will find him.",
    "For all we know you haven't gained any power at all.",
    "You wouldn't dare!",
    "Let him out of the cage.",
    "Welcome, mortal.",
    "Get on with it, Mahjarrat. You're trying our patience.",
    "The Stone of Jas?",
    "This will cause an all-out war on the gods!",
    "Be careful what you say here, mortal. The gods do not forget.",
    "Open your eyes - Sliske is manipulating you all. He is not to be trusted!",
    "Why did he give you the key?",
    "Get Death out, fast! I'm not sure I can hold this!",
    "Quickly - free Death from his cage and return to my side. This shield won't hold!",
    "I'm glad I encountered you today, mortal. You proved a valuable ally.",
    "There is much work to be done. I have duties to attend to in the Underworld.",
    "We must be cautious. Gods will fall in the coming days. The Stone of Jas is too powerful to be ignored.",
    "Some may fight, some may go for Sliske, some may employ other tactics. But everyone will want the stone.",
    "Make no mistake, adventurer. These are grave times, we all have a part to play.",
    "This is the most pivotal event to have occurred for thousands of years. The consequences will shape a new future.",
    "Gratitude for your help, mortal. Our paths will cross again, I am sure.",
    "I am afraid he had many bargaining chips. However, the events that transpired were of greater importance."
  ],
  "​Player": [
    "Why does this concern you?",
    "Is everyone who dies trapped now?",
    "Who is Sliske?",
    "I'm ready to help.",
    "I'm not ready to do that yet.",
    "We make a good team.",
    "Why did they withstand it?",
    "Perhaps you're not as strong as you think.",
    "We should take the fight to him.",
    "We must, Death needs our help.",
    "I defeated you in Guthix's chambers. (Unlocked by The World Wakes)",
    "Goodbye.",
    "I defeated you in Guthix's chambers. (Unlocked by The World Wakes)",
    "Goodbye.",
    "Saradomin is right.We don't even know if Sliske is a god. We shouldn't allow him control.",
    "Zamorak is right. We should boycott this contest and find where Sliske is hiding the Stone of Jas.",
    "Icthlarin is right. We shouldn't trust a word Sliske said. He will only try and deceive us.",
    "I'm behind Sliske. Your constant feuding is dull, it's time to decide who is the most powerful god!"
  ],
  "​Icthlarin": [
    "Death and I work harmoniously - our destinies intertwined. Without him, I cannot fulfil my role.",
    "Only in the realms of Gielinor. Other realms are not governed by the same principles of mortality.",
    "A question I myself cannot answer. Nor can his helpers, nor the Guardians of Guthix.",
    "I suspect that the deaths here are more significant than the others I have seen, did your investigation reveal the killer?",
    "He is a treacherous Mahjarrat who once served me, until his betrayal many years ago.",
    "The Mahjarrat are a race that I brought to Gielinor during the Second Age from the planet Freneskae.",
    "Indeed. You dispatched the weakened wights with skill.",
    "My power against the undead is unparalleled. You would do well to remember that.",
    "We must exercise caution in our approach. Sliske is not your normal adversary.",
    "It may be the best course of action, but we must exercise caution in our approach.",
    "A wise conclusion. We must exercise caution in our approach.",
    "The situation is apparent now. Sliske's plan is as evil and manipulative as I have come to expect from him.",
    "Your bravery is noted mortal, let's hope we're not too careless. Go ahead."
  ],
  "Mask": [
    "Boo! Hah! I bet you didn't see that coming!",
    "Oh don't be so surprised, you must have been expecting something! Or had you not figured it out?",
    "For starters, I am no creature. I'm a projection of my master. But since you asked so kindly...",
    "Icthlarin, I am here to deliver you an invitation to a most exclusive event! The grandest to take place for hundreds of years...",
    "Why, Sliske's grand ascension, of course! Didn't you recognize your old friend? Congratulations on defeating those wights, by the way.",
    "Poor old Icthlarin. So easily frustrated by a talking box.",
    "We had a funny feeling you'd react this way, so we took a little something as... persuasion.",
    "I believe we have something you might be looking for.",
    "Now now, Iccy. Settle down. All you have to do is play along.",
    "Much has changed. You've been away ever so long. Always one step behind.",
    "If you want to save Death and your precious souls, simply open this box.",
    "It will teleport you to the Empyrean Citadel. It's quite spectacular, actually.",
    "Anyone near the box will be teleported all the same, but only those who have been invited can enter the citadel itself.",
    "...",
    "...",
    "Are you sure that's the right way?",
    "Nice to feel the breeze through your eyeholes.",
    "Sliske operates a no-shoe policy.",
    "Look! A face that was made for masks!",
    "Sliske is, like, so happy you came to his party.",
    "Don't get too close to the edge!",
    "There's no shame in giving up.",
    "Sliske's not here right now. Please leave a message.",
    "You're almost there! Bet you're reading a guide.",
    "This maze was aimed at novices!"
  ],
  "Note": [
    "Both talk, somewhat like the Three Wise Monkeys.",
    "the conversation is the same regardless of who you speak to."
  ],
  "Flight Kilisa": [
    "Welcome, fellow devotee of the winged god! (if aligned with Armadyl.)",
    "What do you want, Human? (if not aligned with Armadyl.)",
    "You don't know who Armadyl is? He is the god of the aviansie, the most selfless and benevolent of all the gods.",
    "Support Armadyl and rid Gielinor of war once and for all.",
    "It is our duty to loyally serve in the name of Armadyl!",
    "Armadyl is back. Our people will unite once more and take to the skies.",
    "And now he will take us beneath his wing. No longer will we be lost, we will rise to the clouds!",
    "He thought us destroyed! Armadyl will give us new hope and bring justice to the realm of the gods. He won't leave us again... He can't.",
    "Glory to the aviansie!",
    "If he'd had his loyal bodyguards by his side, the outcome would have been a different story.",
    "No! The Empyrean Citadel belongs to Armadyl!",
    "Sliske's arrogance has hastened Armadyl's return.",
    "We will reclaim the citadel and put an end to this sacrilege!"
  ],
  "Flockleader Geerin": [
    "Armadyl represents freedom and justice. He believes all races of Gielinor can live in harmony, and champions a future of peace.",
    "You are lucky to be stood upon his sacred ground, at an event that will echo through history.",
    "We are the bodyguards of Kree'arra, champion of Armadyl.",
    "We have been chosen to take his place while he assembles Armadyl's forces for his return to Gielinor.",
    "Unite? Even when Armadyl left us we stood strong against those who opposed us.",
    "I remain cautious, what if he were to abandon us again?",
    "He has grieved our dead long enough. We must take action or join them in the eternal flight.",
    "Kree'arra didn't want to bring you harm. His mind was torn. He followed what he believed to be the right course of action.",
    "Although you defeated him, he doesn't feel aggrieved by your actions. He respected your right to defend yourself.",
    "This great citadel was once Armadyl's seat of power in Gielinor, where the wisest of the aviansie held court.",
    "In our absence, Sliske has taken it as his own to host his ascension.",
    "In the past, only the most noble of aviansie could enter this citadel. Sliske's presence here is an insult to our ancestors."
  ],
  "Kharshai": [
    "Ah, adventurer. It is good to see you again.",
    "The Mahjarrat are at each other's throats in the name of Zaros and Zamorak, the survival of our race is at risk.",
    "Now Sliske threatens to introduce a third side to this senseless feud. I must be the voice of reason.",
    "For now I patiently observe. There is little I can do to stop them alone, but the peace will hold for the time being. Zaros has yet to return.",
    "I can only hope those that follow Zamorak will see sense as I continue to advocate peace. They are increasingly difficult to reason with.",
    "I still have a fondness for the Fremennik people, but they know little of what I have become.",
    "I have spent time educating them, showing them the history of our race and working to reduce hostility towards the Mahjarrat.",
    "I have also spoken to a few of my race, advocating neutrality and trying to calm the current conflicts.",
    "It is not an easy task.",
    "It has taken some getting used to but I must say, it's quite an improvement.",
    "I feel raw power coursing through my veins. I don't feel pain like I used to, and I'm sure my intellect has increased.",
    "But somehow there is something missing. A capacity for emotion that I can't quite put my finger on."
  ],
  "General Graardor": [
    "What do you want squishy little human?",
    "Bandos keep peace with gods for now. So Graardor keep peace with puny followers.",
    "Little mask-man promise big fight. Big, big fight. When it starts, me smash you first. Smash, smash, smash!",
    "Who is Bandos? Bandos is Big High War God. Strongest of all the gods.",
    "He band together the goblins, ogres, orks and trolls for glorious victory!",
    "I know you. You squishy little human that defeated Bandos' avatar.",
    "You lucky he not angry. He respect your skill in combat. I can't wait for chance to prove myself against you!",
    "Bandos keep peace with gods for now. So Graardor keep peace with puny followers.",
    "Little mask-man promise big fight. Big, big fight. When it starts, me smash you first. Smash, smash, smash!",
    "Who is Bandos? Bandos is Big High War God. Strongest of all the gods.",
    "He band together the goblins, ogres, orks and trolls for glorious victory!"
  ],
  "​General Graardor": [
    "Graardor not know what silly human is talking about. Graardor got bored of fight and had more important things to do.",
    "Graardor not know what silly human is talking about. Graardor got bored of fight and had more important things to do."
  ],
  "K'ril Tsutsaroth": [
    "What do you want? (if not aligned with Zamorak.)",
    "Greetings, fellow disciple of chaos. (if aligned with Zamorak.)",
    "Mind your tone when you speak to me, human. The events unfolding here are of great importance to my master, Zamorak.",
    "My lord would not allow a Zarosian Mahjarrat to claim godhood without challenge. He has come to see with his own eyes.",
    "He walked the same path himself, many thousands of years ago. He will know better than anyone if Sliske has ascended.",
    "Defeated? You fought bravely alongside our forces on the battlefield - you saw that Saradomin made his followers do the dirty work. (if aligned with Zamorak during the Battle of Lumbridge)",
    "Defeated? Saradomin made his followers do his dirty work and scum like you fought beside them. (if aligned with Saradomin during the Battle of Lumbridge)",
    "Defeated? Huh! Saradomin made his followers do his dirty work. (if unaligned in the Battle of Lumbridge)",
    "Zamorak may be weakened but he is far from defeated. We remain loyal to the god of chaos and we will see him reign.",
    "We suffered heavy losses at the Battle of Lumbridge. Many Zamorakian forces were forced into retreat.",
    "The Mahjarrat you see here have their own interests in mind. They are not true servants of my master.",
    "They show more interests in their selfish goals of attention of accession an pathetic rituals. It will not be long before Zamorak denounces them.",
    "Moia and Moldark, alongside others, are left to recover what's left of our forces while the Saradominists lick their wounds.",
    "Mark my words. We will strike back.",
    "It seems your arrogance knows no bounds. You may have defeated me but your efforts were futile. I got my desired result.",
    "With Guthix dead Zamorak has returned, and with the Mahjarrat's loyalty in question I have taken my rightful place amongst his highest generals.",
    "Don't make me put my strength to use, human. Get out of my sight.",
    "Strength through chaos. (if aligned with Zamorak)"
  ],
  "Azzanadra": [
    "Zaros is ever present, but he has yet to return to Gielinor. We have come to represent him in his absence.",
    "You chose wisely in Guthix's chambers, adventurer. Zaros will be most pleased.",
    "I was disappointed with your choice in Guthix's chambers, adventurer. I had faith in you.",
    "He did not. As fellow Zarosian Mahjarrat, we believed he would welcome us inside.",
    "With such powerful beings gathered here, it is only a matter of time until someone breaks in.",
    "Sliske has his own methods Wahisietel. We do not know the extent of his loyalty...",
    "We have no way of knowing if he is still loyal to Zaros, Sliske has always played his cards close to his chest.",
    "It would seem he has completed the steps to become a god, but I am not sure I believe he has ascended.",
    "Do not make the mistake of underestimating him adventurer, as so many have.",
    "Your help in rebuilding the Temple at Senntisten is recognised, adventurer. We regard you as a friend of Zaros.",
    "The Empty Lord may not be here physically, but he is soon to return.",
    "I have finally made contact with him. He is far from here, on another world, but when he returns the Temple at Senntisten will be his home."
  ],
  "Wahisietel": [
    "It would seem only the gods themselves were deemed worthy of invitations. These undead brothers refuse our entry.",
    "And it will take more than some of Sliske's wights to stop them...",
    "He has always been selfish; now he has the arrogance to claim godhood? I seriously doubt his loyalty to the Empty Lord.",
    "You think yourself wise but you are a fool not to distrust him Azzanadra. I will not be a part of this latest deception.",
    "What we believe is irrelevant, what we know is important. Sliske is not only mischievous; but he is also dangerous.",
    "I'm not even sure he trusts himself."
  ],
  "Zemouregal": [
    "Begone, human. You have no place here.",
    "Our power will not be dismissed so easily, no mere wight can keep me from entering.",
    "Bite your tongue, human. Unless of course you wish to lose it.",
    "I will not stand idly by while this ascension takes place.",
    "That remains to be seen. Zamorak threatens to denounce us as we were not present at the Battle of Lumbridge.",
    "Zamorak is not the only one capable of achieving godhood. Our kind has shown much promise.",
    "Lucien came close and now Sliske claims ascension... I will make sure I am next.",
    "Now Icthlarin's allowed in? I have had enough of this. Get out of my way!",
    "What is this sorcery? Sliske! Let me in!"
  ],
  "Enakhra": [
    "We have come to deal with that filthy Zarosian - Sliske - once and for all.",
    "It is an insult that these undead creatures try to deny our presence in the citadel.",
    "Sliske cannot claim godhood without us having something to say about it.",
    "They will not hold us at bay for much longer. Even their combined power could not stop us.",
    "After all these years he would question us, in his weakened state? He seems to forget what we are capable of."
  ],
  "Commander Zilyana": [
    "How dare you have the audacity to attack followers of the great Saradomin!",
    "Ah, finally! A fellow Saradominist to back me up. (If you are aligned with Saradomin)",
    "You fought honourably at the Battle of Lumbridge, adventurer. You can help me here. (if aligned with Saradomin during the Battle of Lumbridge)",
    "Stay out of this human. (if you are not aligned with Seren or Saradomin)",
    "Enough of your lies, elf. Saradomin knows Seren has a presence here. He will deal with her.",
    "We were given information that she would be. If she hasn't returned, then why are you so far from home?",
    "Why would he want to do that?",
    "Lure them here? Perhaps I shouldn't have trusted that informant.",
    "He knew the gods wouldn't have come without a reason. You supported Saradomin above all others in Guthix's chambers adventurer, I trust you.",
    "After your antics in Guthix's chambers I'm not sure if I can trust you, adventurer. You sided against Saradomin.",
    "That's for Saradomin to decide, not you.",
    "The fact remains that you follow the wrong god. I do not trust your kind.",
    "You sided with us in Guthix's chambers, only to betray us now?",
    "You have no right to address me. You betrayed us in Guthix's chambers and you're betraying us again!",
    "I don't know what you're talking about! I had nothing to do with any of this!",
    "I don't need your respect, you weakling. You can answer to Saradomin.",
    "I knew I could trust you after you sided with us in Guthix's chambers.",
    "You may have betrayed us in Guthix's chambers but you are starting to redeem yourself now.",
    "The adventurer is right! An elf assassin killed three innocent Saradominists and you should pay the price.",
    "Then don't expect us to treat the elves with any kind of mercy from now on.",
    "It is not the truth until Saradomin decrees it so!",
    "I'm done speaking with you. You will answer to Saradomin.",
    "Thank you for supporting me, adventurer. This naive elf is out of her depth."
  ],
  "Ilfeen": [
    "What are you talking about? It was you who attacked us!",
    "Ah, another devotee of Seren to back me up. (If you are aligned with Seren)",
    "Your god is a liar. We communicate with Seren through the crystal singers in our homeland. How could she be here?",
    "We were told we would find Saradominists here, so we could make you answer for your crimes.",
    "How do you know all this?",
    "Sliske has managed to manipulate all of us. Perhaps our quarrel is not with each other...",
    "Can't you see he managed to manipulate us all of us? Our quarrel is not with each other.",
    "Even now we know the truth, you still won't accept a truce?",
    "The adventurer is right! Saradominists killed an innocent elf and you should pay the price.",
    "Then don't expect the elves to treat your kind with respect any longer.",
    "You know nothing of our quarrel, this is for us to settle.",
    "I don't know what you're talking about! I had nothing to do with any of this!",
    "We don't need your mercy. Seren will know of this.",
    "Thank you for telling us the truth, adventurer. It is a shame Zilyana will not see sense.",
    "Thank you for supporting me, adventurer. It is a shame Zilyana will not see sense.",
    "One of these days Seren will return. Then you will have to answer to her."
  ],
  "Barrows Brothers": [
    "Gods only, by order of Sliske himself.",
    "Step back. This event is invite-only.",
    "No entry without an invitation.",
    "Show your invitation if you wish to pass."
  ],
  "Guthan the Infested": [
    "You may pass."
  ],
  "Sliske": [
    "*Laughs* Access...DENIED!",
    "Settle down, children. Settle down.",
    "I thought you might say that, so I've brought a little surprise for you. Try not to get too excited!",
    "To my right: the one and only... Death! And to my left: the ferocious dragonkin... Strisath!",
    "I know, I know. Sometimes I impress even myself.",
    "Ah ah ah, slow down there. Let's think about this for a moment...",
    "What would happen to your beloved mortal followers if I was to kill Death itself, I wonder?",
    "Wouldn't I? And if that's not enough to stop you, perhaps I should release Strisath. He seems to have increased in power lately.",
    "Perhaps. Now, if any of you want to take the risk, be my guest.",
    "No? I thought not... Now where were we?",
    "Well, well, well - the guest of honour has arrived. You're late.",
    "He/she has demonstrated certain... talents. What's the matter, Bandos? Jealous?",
    "​How touching",
    "​How touching.",
    "How touching.",
    "How touching.",
    "Haha! Did you not think I was aware of this? I am familiar with your 'servitude' to Zaros. Soran speaks highly of you.",
    "How touching.",
    "Controversial. I'd love to hear everyone's opinions but there are matters at hand.",
    "Moving on! You are just in time for the main event. Oh yes, an event for the ages. Sliske's.. Grand.. Ascendancy!",
    "Are you sitting comfortably?",
    "Hahaha! Adorable! I like this one.",
    "I'm running the show now, and you're going to want to hear what I have to say.",
    "Ooo feisty! 'Charlatan', he says - coming from the usurper himself. Interesting.",
    "Yes, yes. I can see you're all desperate to know what this is all about.",
    "Well, I happened across a couple of items. Artefacts, you might say. Of the elder variety.",
    "Indeed. You'd only need to ask a certain recently deceased god to find that out. I have managed to acquire not only your staff, but also the Stone of Jas.",
    "You didn't notice I dressed up for you, Zamorak?",
    "Really though, I'm glad you asked. Believe it or not, I don't go around kidnapping dragonkin for fun. There's a certain... method to the madness.",
    "Angry thing, isn't he? Those of you who were paying attention will have noticed him calling me a 'false user'.",
    "While I don't like being referred to as 'false', it doesn't take a genius to figure that one out.",
    "You ought to be careful then, hadn't you Saradomin?",
    "A good magician never reveals his secrets, does he? Fortunately for you I'm not a magician!",
    "It really was quite trivial, turns out the dragonkin are a remarkably predictable race. I was hoping for more of a challenge.",
    "You can see how angry it makes them, can't you? 'Destroy the false user!' It's highly amusing, actually.",
    "Anyway, I simply lured poor Strisath into the Shadow Realm. In he charged, screaming like a big, scaly baby.",
    "Then before he knew it...trapped. Nowhere to run.",
    "Must I answer all these boring questions? It really was quite simple.",
    "Why do you think I trapped this dragonkin specifically? I could have taken my pick. They're all the same, really.",
    "Strisath was unlucky enough to be guarding the staff. He couldn't have left it unattended now, could he?",
    "Haha! I could hardly believe it myself! Into the shadow realm he comes, carrying none other than the Staff of Armadyl itself.",
    "Oh, yes - an ingenious plan, I must say. It took an even more ingenious plan of my own to outplay you there.",
    "I really am quite proud of this one. I've been experimenting with the Staff of Armadyl and found it to be an extremely versatile tool.",
    "With Strisath imprisoned, I used the Staff to reveal his connection to the Stone, leading me to exactly where you sent it.",
    "Not far from my own doorstep, believe it or not. I wonder what the odds were of you sending it into the caves beneath the Barrows!",
    "Believe it or not, it was deep in a cavern not far from Guthix's resting place.",
    "Annoyingly, you managed to teleport it deep beneath Trollheim. To say it wasn't easy to retrieve it is putting it mildly.",
    "Annoyingly, you managed to teleport it into the deep sea near Crandor. To say it wasn't easy to retrieve it is putting it mildly.",
    "Annoyingly, it was frozen in ice beneath the Temple of the Lost Ancients. To say it wasn't easy to retrieve it is putting it mildly.",
    "Oh, how I love cheating games of chance. Especially when I hit the jackpot!",
    "Ahaha! You really believe I brought you here so you could have answers? No, no, no - there will be no ascendancy today.",
    "I wouldn't want to spoil the fun now, would I? It's highly amusing keeping you all guessing - you're just dying to know!",
    "Oh, but you can't be tired of the games. They have only just begun! Besides Bandos, you're going to really like this one.",
    "It's time for the real announcement. I am holding a contest. A free-for-all, you might say. A battle of the gods!",
    "Not so fast Zamorak, you might want to stick around for the next part. It's really going to heat up!",
    "You really are no fun at all, are you Saradomin? This is the calm before the storm. You should savour the moment.",
    "It's not so much a game - more survival of the fittest. There is only one rule, you see.",
    "It is only a matter of time until our moon - Zanaris - passes the sun, resulting in a total eclipse. Gielinor will be engulfed in shadow.",
    "It is at this exact moment the contest will end...",
    "...and the winner will be the person who has killed the most gods.",
    "Because, Armadyl, there's a prize. Just one little prize that I think you might all be interested in.",
    "On the day at which the sun is eclipsed, someone will stand victorious with most of you defeated.",
    "And to that person I will gift...",
    "...the Stone of Jas.",
    "Haha! A little lost for words are we? Pick your next moves carefully. I wonder who will score the first kill!",
    "Well, that's for me to know, isn't it? Survive if you can, Zamorak - maybe then I'll let you in on my secrets.",
    "What's the matter? Scared Bandos will crush you? Maybe you should be more tactical, you know? Pick off the weaker gods...",
    "And what about our honourable guest? How do you feel about this, adventurer?",
    "Haha! Another loyal follower. Maybe you'll consider taking your rightful place as one of my Barrows brothers.",
    "Silence! Enough of this petty arguing. If you won't do it, then I'll kick things off myself."
  ],
  "Gods": [
    "Armadyl, Bandos, Brassica Prime, Icthlarin, Marimbo, Saradomin, Seren, Zamorak, Zaros. Other mischief-makers: Death, [Player]."
  ],
  "Relomia": [
    "Sliske sent for me himself.",
    "I want to see Sliske!",
    "Have you seen him?",
    "Did he mention me?",
    "I was invited, honestly.",
    "Is Sliske wearing anything new?"
  ],
  "Saradomin": [
    "...you tried to massacre the people of Falador with undead created by the Wand of Resurrection!",
    "That may be so, but I will continue to protect my followers from you at all costs.",
    "...and I will continue to protect my followers from you at all costs.",
    "Icthlarin?",
    "Arrogance? I strive to guarantee the safety of all who call Gielinor home, as a true god should.",
    "Know your place, Icthlarin. You would be a fool to believe you are wiser than I.",
    "Ha! Try me. You've seen what I'm capable of.",
    "I am not as oblivious to details as some of you may believe. The truth has not eluded me.",
    "False information was fed to my generals. I believed Seren would be here, and came to confront her about an attack on my people.",
    "Then what I have heard of Sliske is true: he is as sly and devious as they say.",
    "Unless my eyes mistake me I see you stood here, same as me, Armadyl.",
    "Do not presume that I won't kill you, Sliske.",
    "Someone's been using the Stone of Jas...",
    "He/she has more right to be here than you, weakling.",
    "I have heard much of your loyalty from Julienne.You, of all my faithful, deserve to be here.",
    "It may not have been right, but it was for the greater good. None of us would be present if Guthix's edicts remained.",
    "You are not worthy of the power the Stone possesses. In the wrong hands it could be used to remove all the gods from Gielinor, as Guthix did.",
    "This is supposedly your 'Grand Ascendancy'? You've lied to us enough - have you obtained godhood or not?",
    "If you think we will be a part of your games, you have truly lost your mind, Sliske.",
    "Be quiet and let the intellectuals talk, you brute.",
    "No...no...no...",
    "The stone is not a toy, Sliske! Do you have any idea what this will cause?",
    "Even if you have become a god Sliske, you are merely a fledgling. You do not have the right to enforce this!",
    "Only I can stand as the true god!"
  ],
  "Zamorak": [
    "Dawn was acting on her own accord. I disavowed her and take no responsibility for her actions.",
    "This dog's strayed awfully far from his home.",
    "Watch your tongue when you speak to me, Icthlarin.",
    "You have the audacity to think you are warning us? Sliske has yet to prove he has gained any power. He will not manipulate me.",
    "You think it would be so easy to 'lure' me here? I came of my own volition. I would see this with my own eyes.",
    "You may have got the better of me once, but that does not make you a conqueror.",
    "And what of you, Icthlarin? Just happy to receive an invitation, were you?",
    "No, no. The dog has come to fetch his bone!",
    "Then stop hiding behind words and prove yourself in combat, coward.",
    "And how did you earn an invitation?",
    "I have heard much of your deeds from Moldark. Few mortals have your drive in strength. Perhaps you have earned your place here.",
    "Then spit it out already, charlatan!",
    "What reason do we have to believe you, of all people? I see no proof you possess the stone.",
    "This is ridiculous, even for you. I am done here.",
    "That's insanity! I don't believe a word that comes out of this rogue's mouth.",
    "You're mad. What exactly do you hope to achieve here?",
    "You cannot fool me with your diversions. One way or another the Stone of Jas will not remain in your hands.",
    "You have been a prolific follower, adventurer. Your allegiance and loyalty throughout all your endeavours have been duly noted.",
    "Stay your tongue, beast!"
  ],
  "Armadyl": [
    "You speak as if you are benevolent, Saradomin, but you do not practice what you preach!",
    "Good, this gathering could use another level head. The arrogance displayed here is shameful.",
    "It doesn't take an elder god to work out what that was.",
    "How could you allow yourself to be fooled by this snake?",
    "We are in my Empyrean Citadel! I will not allow Sliske to hijack the home of my people.",
    "...there is no place for your theory of chaos in a peaceful world.",
    "Gods, we could put an end to this lunacy right now.",
    "I have heard much of your diligence and courage from Taw'Paak. You are welcome in my citadel and amongst my people.",
    "We know this to be true. The Mahjarrat is not to be trusted.",
    "The elder god artefacts are not toys for your amusement, Sliske. They are dangerous!",
    "The stone's power comes at a price, Sliske. As your own power increases, so too does the dragonkin's.",
    "Need I remind you of how they obliterated the planet Kethsi near my homeworld? You will be just one more to suffer the consequences.",
    "The clue is in the title you scoundrel, the Staff belongs to me!",
    "You truly have gone mad! Why would any of us listen to you?",
    "This is madness!",
    "Gods, I implore you not to listen to Sliske. We must seek peace through justice."
  ],
  "Bandos": [
    "You need war, just like me. I see it in your eyes: the lust for glorious battle.",
    "I thought only the mightiest gods were invited. What's this peon doing here?",
    "Haha, it's amusing that you believe Sliske could manipulate me. He simply promised me one thing.",
    "Stop your squawking. He promised me you would all be here. And he promised me war.",
    "Why are you here then? Not for the company I'm sure!",
    "Haha! So you've come to save your fair maiden?",
    "Haha! Do it, I can't wait to watch you decimate each other.",
    "And what makes you think your new toys will prevent me from crushing you?",
    "What is this human doing here?",
    "Interesting, Murknose didn't mention you were a human, so frail...Yet I can see true bloodlust in your eyes.",
    "Oh, give it up you pious bird, you're too weak to retain an artefact. I would be much more deserving.",
    "I am tired of your games. Answer us before I crush you.",
    "Haha! Finally you say something interesting!",
    "Quiet, coward! I can smell your fear. This great battle will show is strongest once and for all!",
    "All you weaklings will fall beneath the god of war!"
  ],
  "Sliske Mask": [
    "Ahah! Passed the first of Sliske's tests, I see. This one should be more of a challenge. You might want to turn on the lights before you start."
  ],
  "Light": [
    "Ah a visitor! Welcome to the light chamber.",
    "Stop being so gloomy, look at the lights! It's the light chamber!",
    "Cheer up! Don't mind him - he's always this grumpy.",
    "We're in charge of the puzzle and we want you to be the first to play!",
    "Come on, it'll be fun! If you manage to solve it, we'll unlock the door.",
    "All you have to do is rotate the dials on the four corners.",
    "And those shadows will form a shape! If you can make the right one, we'll unlock the door.",
    "Come on, it'll be fun! If you manage to solve it, we'll unlock the door.",
    "Ok, go ahead!",
    "Ok, go ahead!",
    "Ok, go ahead!",
    "You've done it! Well done, adventurer!",
    "Ha! Admit it, he's/she's finished it fair and square!",
    "You can now proceed to the next chamber. Shadow and I have lots to talk about!"
  ],
  "Shadow": [
    "Be quiet. This is the shadow chamber, adventurer.",
    "Lights cast shadows, hence 'shadow' chamber.",
    "We are projections of our master, Sliske. We've been here for ages, I'm bored to Death...",
    "Does it even matter? We've been here for ages, I'm bored to Death...",
    "Time... So much time. We've been here for ages, I'm bored to Death...",
    "I wouldn't trust us either. I mean, look at this brainless idiot.",
    "You're terrible at explaining it. You have to move the dials to cast different shadows into the pit.",
    "Well, you don't have to. You could just go away and leave me here with this half-wit for company.",
    "Are you sure? No, no. That doesn't look like it to me.",
    "Okay, I'm sorry. Please don't go. You can't leave me with this brainless moron!",
    "Oh no..."
  ],
  "Statue of Death": [
    "Haha! Thought I was Death for a minute there, didn't you? You should have seen your face.",
    "I must admit I'm a bit surprised you made it this far. You're cleverer than you look!",
    "Now now, there's no need to be like that. Why does everyone like Death so much any way? He's so grim.",
    "Hmm, you know, I could do. But where would be the fun in that?",
    "Ah, the point. What's the point of anything really? When you're a talking mask you have a lot of time to think about these things.",
    "Doing? Not much, I've got no arms or legs, you see.",
    "I've got an idea. We'll play a game. I ask you a riddle and if you get it right, I'll give you a gift worthy of the gods!",
    "Oh, you're no fun at all, are you? Fine. If you answer correctly, I'll give you Death.",
    "Okay...",
    "'I can build castles,",
    "That melt in the rain,",
    "But I trickle down,",
    "As the seconds drain'",
    "What am I?",
    "Ahaha! We'll soon see about that.",
    "Oh, how awfully witty of you. I'll enjoy watching you fail.",
    "Yes, yes, that's the spirit!",
    "Hidden in these chests are a series of objects representing possible answers.",
    "When you have the object you believe is the correct answer, simply place it on this plinth next to me. After answering, the object will return to its chest.",
    "But there is one catch. The second chest will only unlock once you have answered the first riddle.",
    "The third will only unlock once you have answered the second riddle. Then you must answer the final riddle.",
    "A riddle within a riddle within a riddle, you might say. But be careful, the correct answer could be in any one of the unlocked chests.",
    "I suppose, you cannot trust me. But you've come so far... Either you turn back now, or pass the final test.",
    "Although rest assured, I will reward you with a gift worthy of the gods themselves.",
    "Ah, I see you've selected <Item>. Are you sure this is your answer?",
    "Ah, I see you've selected Sand. Are you sure this is your answer?",
    "Oh, well done! You've unlocked chest number two. Have a riddle as your reward.",
    "I can fall from the sky,",
    "But I cannot climb higher,",
    "I spring with no legs,",
    "I run but don't tire.",
    "What am I?",
    "Ah, I see you've selected Water. Are you sure this is your answer?",
    "Well done, you! That's chest three unlocked. Here's the third and final riddle.",
    "Glass can't create me, but stone and steel do,",
    "I'm made by the sun, but out of its view,",
    "I can be tiny, and also be vast,",
    "In the shape of my maker, like a spell I am cast.",
    "What am I?",
    "Ah, I see you've selected Shadow. Are you sure this is your answer?",
    "Correct! Of course the answer was Shadow. It's the realm of my master, after all.",
    "I promised you a gift worthy of the gods themselves...and a gift you shall have! An invitation to my master's ascendancy.",
    "Ah yes, I must confess - that was a little white lie. Perhaps you should take a look through the window and see for yourself."
  ],
  "​Sliske": [
    "Ah! But of course - my great votary! Relomia just won't shut up about you - lovely girl, if a touch needy."
  ],
  "Strisath": [
    "Argh! You'll pay for this, false user!",
    "I will destroy you, false user!",
    "Aaaaargh! Must kill the false user!"
  ],
  "Support the Zarosians.": [
    "' (Unlocked by The World Wakes)'"
  ],
  "Death": [
    "Release, finally. My thanks adventurer.",
    "You have my gratitude. I may not have escaped without you.",
    "And my absence will have had consequences. There is an abundance of souls to be reaped.",
    "We could be facing the start of the next God Wars. Even mortals may try to win the stone.",
    "Clearly Sliske has taken an interest in you. You will play a key role in deciding who survives the coming days.",
    "As a World Guardian your choices could decide the fates of the gods themselves.",
    "Do not fear mortal. I will free their souls so that they may rest in peace.",
    "Farewell adventurer."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Missing,_Presumed_Death?oldid=36175558’"
  ]
}