{
  "Player": [
    "What's going on?",
    "It does look pretty impressive, but what are you doing hanging around?",
    "Naturally. Not sure why I asked.",
    "Tea? Sure.",
    "Erm...yeah...no...sorry...gotta go.",
    "What are you up to?",
    "It was more of a rhetorical question.",
    "Shouldn't you be working?",
    "Wow, that looks pretty heavy.",
    "What would happen if I were to say...",
    "135",
    "25",
    "234",
    "2351....",
    "Okay, okay! Don't cry!",
    "Hi there.",
    "Not bad, thank you. What are you building here?",
    "You're on strike? Whatever for?",
    "Oh, okay.",
    "You seem to like playing with danger, there.",
    "Well, correct me if I'm wrong, but you seem to have all your fingers.",
    "What?",
    "Wooden fingers?",
    "That's not possible, how could you move them?",
    "Yes, well I think I'd better be going now.",
    "This is quite the tower.",
    "How much?",
    "I bet they love you for that.",
    "I don't.",
    "Hi there. What is this place?",
    "I prefer ordinary houses.",
    "Hi. Interesting building you have here. What's it for?",
    "I see some builders over there. So I assume it's not yet finished.",
    "So it's a tower.",
    "Yeah, they don't seem to be building much.",
    "Shame.",
    "Me?",
    "Sure, why not.",
    "Calm down. I'm not making any promises.",
    "Nice to meet you Effigy, I'm [Player]. Hold on and I'll see what I can do!",
    "Erm, do you?",
    "Ah, yes, it's now a small museum. Jorral's looking after it. He's really making history with that place.",
    "Ah, yes. Shame. Got to go. Bye.",
    "Best I go sort out this tower. Bye.",
    "Sorry, feeling a bit ill today.",
    "Are you Bonafido by any chance?",
    "Well, I've just spoken with Effigy about this tower. He tells me he hired you to work but you're on strike. Something about an extended tea break?",
    "Well, he wanted me to do something about it. Is there no way I can convince you to continue?",
    "Well, can I at least have a look inside the tower?",
    "I take offence at that! Give me a chance; you may be surprised.",
    "Count me in!",
    "Hi Bonafido.",
    "What clothes do I need?",
    "Say, that's a nice helmet.",
    "I was just wondering if you might be able to help me out with one?",
    "One?",
    "Five?",
    "Three?",
    "Torn curtains?",
    "A brown rug?",
    "Opulent curtains?",
    "8 clay pieces and 3 limestone bricks?",
    "10 clay pieces?",
    "10 limestone bricks?",
    "Greener pastures? Fair enough. Wait a minute! Is there blood on this helmet?",
    "Oh, okay. Thanks. Bye.",
    "What?",
    "Why, hello there!",
    "Clothing.",
    "Ah, come on. You know you want to give me free stuff.",
    "Yes, VERY busy I'm sure.",
    "Likely story. Sure you weren't skinny dipping?",
    "Hi, I'm looking to get some kit to look like one of you guys. Anything you might be able to help me out with?",
    "Hmmm. Has it been cleaned? I don't want some sweaty hand-me-down.",
    "Well, that sounds good. Can I have it then?",
    "Sure. What's your 'usual'?",
    "Simple, cheap beer. No problem.",
    "Hi, I'm looking to get some kit to look like one of you guys. You said you wanted a beer?",
    "What do you do when you're not lifting logs above your head?",
    "Yes.",
    "I can honestly say you're a very original guy.",
    "Hello. I was just wondering... I don't suppose you have any spare clothing you could lend me?",
    "Ah, thanks.",
    "Oh, but why? I could pay you!",
    "Hey, Bonafido.",
    "So... How do I look?",
    "Okay, what do you want me to build?",
    "Orange juice",
    "Tea",
    "Bottle of wine",
    "Why thank you. Do you think I have what it takes to become a famous whistler?",
    "Oh.",
    "Your legs are getting a bit cold?",
    "I am?",
    "That's just what I was thinking.",
    "They're ripped and full of holes.",
    "The colour is starting to fade.",
    "Cry.",
    "Carry on, it'll fix itself.",
    "Suppose it could get infected then, but that'll just impress the lads all the more.",
    "Fetch a plaster and ointment.",
    "So what's left to build?",
    "Thanks!",
    "Hi again Bonafido.",
    "Not yet. I'll go when I'm ready. I'm taking my time, may have a quick cup of tea first.",
    "You winning?",
    "And now?",
    "Hi.",
    "Nope, not at all. I'd best be going. Have a nice day. Bye!",
    "I'm a builder!",
    "Well, I think it's a positive step in my career as a courageous adventurer.",
    "Hi. Sorry, but why do they call you 'Currency'?",
    "You must be pretty rich then.",
    "What happened?",
    "I'll bet! It pleases you, then, to know that I have just become a builder and have been granted permission to go mess around inside.",
    "Guess what!",
    "I'm a fully-fledged builder!",
    "I'm not sure about that, but I'll take a look and see what I can do.",
    "Wow, this place looks special. Best I look around for something to fix.",
    "Heya, Bona. I had a look at the building. There's some complex machinery in there! Going to cost someone.",
    "Well, I agree now they're up to something. The question is what...? I don't think we're going to find out much from the alchemists, though.",
    "I shall see if I can't fix it up and see for myself what is going on. Should be able to get a good reward from them. But don't worry, I'll make sure your efforts don't go unpaid.",
    "I must say, the inside of the tower is really something to behold.",
    "Hi, Currency. Got any spare cash?",
    "No, do you?",
    "I'm going to stop before this gets violent.",
    "I've fixed all the machinery.",
    "Now listen, what does it all do? Why are you-",
    "Wait! What about-",
    "Why does nobody listen? Best I follow them, I suppose.",
    "I'm really getting annoyed with those alchemists.",
    "Well, I completed the tower and I still have no idea what it does, and then as soon as I tell Effigy of my hard work, he doesn't say one word of thanks and legs it off into the tower!",
    "Don't worry, I'm not about to let Effigy get away with treating us builders like this!",
    "What on RuneScape is...",
    "They're insane!",
    "How is this possible?",
    "This is terrible, you must do something!",
    "I don't want a reward, just let it go. Can't you see it's in pain?",
    "Stop this! Let it go!",
    "It's getting angry.",
    "Not wise.",
    "They've run away. I must go confront those alchemists downstairs.",
    "That is one very sad creature.",
    "Why am I suddenly glad that you're not responsible for sorting out this mess?",
    "I can't believe what you guys have done.",
    "No. Scary!",
    "You won't BELIEVE what I just saw!",
    "That tower is...a tower of life! I just witnessed with my very own eyes the creation of a homunculus.",
    "Homunculus! They have found a way of creating life itself, but the creature they have made is not a happy being.",
    "Are you listening at all? This creature is very dangerous. It needs to be stopped. And fast!",
    "Effigy!",
    "I hope you learn from this.",
    "What?",
    "I'll just ignore that. So, what about that Homunculus up there? You can't just leave it.",
    "Why me? You created it!",
    "No.",
    "No way!",
    "Why do I get the feeling I'm doomed to go face that creature on my own?",
    "Oh well. My mum did always tell me that experience teaches fools.",
    "Hello?",
    "It's okay. I'm here to help you.",
    "No, honest. I helped the alchemists, but I had no idea what their plans involved.",
    "About what?",
    "Hmmm. A creature of logic and magic. Don't fear, I shall fix your mind!",
    "Watch me.",
    "You tell me that you're confused, so ask me some questions!",
    "I decided to root for [magic/logic].",
    "Okay.",
    "Sounds like a good plan. Can you get out of that cage?",
    "Okay.",
    "How are you?",
    "My pleasure.",
    "I'm not sure I understand, but okay, I will go have a word with them.",
    "Hi, Bonafido.",
    "Finished, really.",
    "Oh, I wouldn't worry about it. There are frequently new buildings required around RuneScape. I'm sure your services will be called upon again.",
    "The Homunculus is a bit better off now.",
    "Not just yet.",
    "Well, I've sat down and had a good chat with the Homunculus.",
    "You'll soon find out!",
    "Effigy, I need a word with you.",
    "Not quite...",
    "This place is bizarre!",
    "My pleasure. So what is this place?",
    "Oh dear, but you're okay now. You have this place to reside in.",
    "Hi there, you mentioned something about creating monsters...?",
    "Interesting. Tell me if I'm right. By the alchemists and builders creating you, you have inherited their combined knowledge in much the same way that a child might inherit the looks of their parents.",
    "So what do you need me to do?",
    "Okay. Sounds like a challenge."
  ],
  "\"Black-eye\"": [
    "Ah, we be building this 'ere tower. Lookin' good ain't it?",
    "Tea break, naturally.",
    "Fancy some?",
    "You'll find a kettle in the box to the-",
    "Why, thanks.",
    "Always glad to help out a budding builder. But first, prove your Construction knowledge by answering some questions. How many nails does it take to make a rocking chair?",
    "One? How do you suppose to use a single nail?",
    "Nope. Keep guessing!",
    "Bingo! Okay, now what takes 3 planks, 3 cloths and 3 nails to make, and helps remove light from a room?",
    "Of cause, because that's what everyone needs - a rug up at their window.",
    "Those curtains are not going to be in any way opulent, matey.",
    "Nice one. Last question: I like fish and I want to put some in my garden, but I need a special water feature. What materials would I require?",
    "Oh, and you were so close!",
    "Guess again, babe.",
    "That's it! You seem to know your stuff. I got a spare helmet from a builder that died on... I mea, err, had to leave the job for greener pastures.",
    "Erm, no, that's just, erm, paint. Yes...paint! That's what it is!",
    "Ha, gullible fool.",
    "Nothing."
  ],
  "\"Gummy\"": [
    "Rock, Paper, Scissors. Can't you tell?",
    "Rhetora-what?",
    "We are. It's team building.",
    "What do you want?",
    "Nope. Need mine.",
    "Stop bothering me, can't you see I'm busy?",
    "Okay, okay. The other day I was drying my clothes on a line down by the shore. A storm hit and some of my clothing went missing.",
    "Just go look and leave me be! Search around the tower and you may find them.",
    "It's a draw at the moment. First it was best of three, then it was best of five.",
    "Best of a hundred and one."
  ],
  "\"The Guns\"": [
    "Umpf! Yeah, mate...argghh...this is...umpf...hard work...",
    "Stop! Stop! Humpf...I'll beat you to...urghh...a pulp!",
    "Why, I oughta...",
    "Well... Urmpf! Ye can 'ave me shirt...",
    "What? Huhmf! It ain't ever been...uurgg...worn.",
    "Can't...hurr...see why not. This is firsty work doh. Could do wiv a beer.",
    "I'm a simple...umph...man. I like the bar in Yanille and their cheap beer...",
    "Ahhh! Smashin'...urrghh...deal!",
    "In my free time?",
    "All sorts. I like...hummft...a good kebab and a cold beer down...urrghh...the pub. And for those quiet evenings...hurrr... A bit of needlepoint is always welcome."
  ],
  "Bonafido": [
    "A'up, [mate/babe], how's it goin'?",
    "Nowt at moment. We're on strike!",
    "Those strange alchemists are up ta somefin', best go ta one ov 'em.",
    "That I am, [mate/babe]. How can I be of assistance?",
    "Extended cup o' char? E's got it all wrong, [mate/babe]. We know those alchemi-whatsits are up ta somefin' weird in building this tower, wot wiv all the machinery, and until we get some answers we're not movin a muscle.",
    "Sorry, [mate/babe].",
    "Only builders are allowed in there, like. You don't look much ov a builder to me.",
    "Okay. Come to me kitted out like a builder – hard hat, some boots, scruffy trousers and shirt – and I'll let ya try out ta be one ov us.",
    "Well, if it ain't ol' skinny bones.",
    "Ya don't seem to be able ta remember anythin'... Deary me. Come back to me wearin' a hard hat, some scruffy trousers, a good top and some hard boots. You shud fand some around 'ere.",
    "Well, if it ain't ol' skinny bones.",
    "Like a builder frew and frew... Good job, [mate/babe]! Nah, it's time to test yur skills.",
    "Build? Hahaha, don't be a plonka! It's not building skills that makes a true builder, you have to have the right mental attitude, yeah? Let me see... You've plenty of work to do, but you need a drink fast – what do you go for?",
    "What are you? A healthy builder? Of course, not juice!",
    "Bingo! Ain't nufin' betta.",
    "Ooh, got '[Mister/Miss] Fancy Pants' here and [his/her] posh wine. You're no builder.",
    "Now, let's hear you whistle!",
    "What on RuneScape are you doing? Get out of my sight.",
    "You know, you have quite a talent there.",
    "No.",
    "Wahey! Nice one. Next question.",
    "What's a good sign that you need to replace your trousers?",
    "Exactamondo! Glad to see you are thinking like a builder.",
    "Yes, obviously if your legs are cold, you lost your trousers altogether!",
    "No, no, no. That's the only way they should be!",
    "Oh no, mate, you're really not getting the hang of this are you?",
    "Now the last question – what do you do if you cut your finger?",
    "When was the last time you saw a builder cry?",
    "Yep, that's the one!",
    "Exactly, you're getting the hang of this quickly!",
    "Look, Player, let me give you a bit of advice. If you want to look weak, that's the best way to go.",
    "Cosmic! I canna see no reason why ya can't go in t'tower now. But be careful, there be some precarious situations in there.",
    "Well, there's a pipe system, a pressure machine and a strange cage up at the top that needs finishing off. The alchemists couldn't explain what they were for.",
    "Hey, [mate/babe]. Just as a warnin', you gonna need a hammer and saw to make anything in there.",
    "Hi, '[Player] the Builder'! Been into the tower yet?",
    "Hahaha.",
    "Yep, told ya so. Any idea what those alchemists are up ta?",
    "So what are you going to do?",
    "You're a star among builders, darling!",
    "Why?",
    "Well, I'll be a rabbit in da eyes of a fox. Best ya chase after 'im then and get us our dosh! Don't you do a runner, now!",
    "What? What?",
    "A homanque-what?",
    "And our money?",
    "I'm glad you've got the money sorted.",
    "Hi. How's the tower?",
    "Looks like we're out of a job then."
  ],
  "\"No fingers\"": [
    "They don't call me 'No-fingers' for nothing!",
    "It may seem that way mate, but I think you'll find I don't have any.",
    "These not be fingers. These 'ere be wooden fingers.",
    "Yep.",
    "Magic wood.",
    "I do have many boots.",
    "But there's no way I'm giving any to you.",
    "Nope. Only real builders can wear builders' boots, and you're not even close.",
    "Don't suppose you've seen any boots around here? Size nine, steel toed, brown leather..."
  ],
  "\"Currency\" the Alchemist": [
    "Yeah, it cost a fair bit.",
    "Well, I had to 'alch' a fair few belongings of my fellow alchemists to afford it.",
    "Everyone loves someone that can create money.",
    "That's down to my interest in all things of monetary value.",
    "I wish. And I was, up until recently.",
    "This tower. Set me back a fair few million.",
    "This is not a good day for me.",
    "Nope; you?",
    "Afraid not. You?",
    "I can almost taste the riches!",
    "Many hours we have worked!",
    "Marvelous!",
    "It's alive!",
    "Excellent. It can feel! It's self-aware. This is really a great day.",
    "The creature must be grateful for his creation.",
    "Silence, creature!",
    "You should be satisfied and leave. Then we can begin our experiments.",
    "Run away!",
    "It'll be alright: it just needs a pat on the back.",
    "Excellent. So we can go back in.",
    "Arrghhh! Have mercy!"
  ],
  "\"Transmute\" the Alchemist": [
    "Ah, this be the Tower of Life! Beautiful, isn't it?",
    "Pah, you have no taste.",
    "I question why you are so pleased about this.",
    "Why, thanks. You'll find various pieces of machinery to fix in there. You can no doubt find the materials in there, too.",
    "At last! Our work is complete!",
    "Long time indeed!",
    "Beautiful.",
    "It can talk! A real success.",
    "Yes, it's just an experiment in alchemy.",
    "Get out of the tower before it's too late!",
    "Marvellous.",
    "That too.",
    "And?",
    "Huh?",
    "Oh no, look!"
  ],
  "Effigy": [
    "You like it? It's simply fabulous, isn't it? A real marvel of modern design made just for my fellow alchemists and I!",
    "What a keen eye this [lad/lass] has! But imagine this: a gargantuan cylinder of expert design, incorporating an inventive inner spiral walkway to multiple planes of wondrous inhabitance!",
    "Oh, no, no, no, no. It's going to have a use that will change this world. Or at least it would if we could ever get it finished. See those builders?",
    "Exactly. They've gone on strike for some petty reason about the tower being too weird. I really can't understand those men.",
    "Hey! Maybe you could talk to them? You look like a sturdy [lad/lass]. Maybe you could finish the work?",
    "Come on! This is the chance of a lifetime!",
    "You're fantastic! Oh, I'm so pleased.",
    "Oh, I have a good feeling about this. Right. Go have a word with Bonafido the head builder, See if you can't get him off his backside to do some work. Oh, and I'm Effigy by the way.",
    "Wait a minute. Don't I recognise you from somewhere?",
    "Do you know the outpost north of Ardougne?",
    "Well, the King was going to make that into an alchemy lab for us, but some fool ruined our plans!",
    "Hey, wait up!",
    "What?",
    "Marvelous! So you can bring this tower to life!",
    "Oh, what a wondrous person you are!",
    "Hurrah! Splendiferous!",
    "Years of devoted work. It's complete! Hey, guys! It's finished!",
    "To the top of the tower, fellow alchemists!",
    "It is time, my friends! The culmination of our work is complete!",
    "A great many years of planning and preparation has brought us here, my fellow alchemists. Now we have... The Tower of Life! We can already create gold, we can already transform matter from one thing to another, and now we have the ability to create life itself! We owe much to the power of Guthix, for without the life essence he left below ground, we would have never been able to bring this tower alive!",
    "It begins! The first day of creation!",
    "It worked!",
    "We did it. A Homunculus!",
    "Ah, it's our helper. Thank you for fixing the tower: we will reward you greatly.",
    "Don't worry. It has no soul: it has no worth.",
    "Yes, be still and quit your moaning.",
    "Shut up, you pathetic being.",
    "Don't make us hurt you.",
    "You should know your place, adventurer. This is no concern of yours now.",
    "Oh no...",
    "Flee for your lives!",
    "I know, I know. This is a truly dangerous creation, of all proportions.",
    "I will. I will. Next time we'll use a stronger cage.",
    "A bad joke.",
    "Maybe you could go have a talk with it?",
    "Pleeeaaase.",
    "Pretty please with a cherry on top?",
    "I'll make sure you're compensated. You won't be forgotten for this!",
    "Good [boy/girl]! I knew you would help us!",
    "You've killed it?",
    "You set it free. Oh, please don't hurt me!",
    "Please, we just wanted to experiment. We wanted to create life. Long ago we found a strange source of energy that we believe was left behind by the great Guthix. He used to create life with such ease. We realised we should be able to use this powerful substance, but we needed to bring together our magic along with the logical construction of the builders. It seemed through our experiments that even magic needs a certain level of rules and laws to work.",
    "Right away, right away!"
  ],
  "The machine appears unfinished. You're going to need some materials": [
    "4 coloured balls, 3 pieces of metal sheeting and 4 valve wheels.",
    "6 rivets, 4 metal pipes, and 5 metal rings."
  ],
  "The cage appears unfinished. You're going to need some materials": [
    "5 metal bars and 4 bottles of binding fluid."
  ],
  "Homunculus": [
    "Nwwooo! Whyyy? Where meee? Glarrraaa",
    "Where me? Skin burn...arrgh...eyes hurt...let me go!",
    "Whyeee cage? Argh...please help me! Graaahhh!",
    "You create hurt. Not fair, let me free!",
    "No, mean, nasty peoples.",
    "Arghh! Let me go!",
    "So horrible beings. Daarrrr!",
    "Arghhh!",
    "Leeet mwee free. Argyyghh.",
    "Lieees. Grahhh.",
    "Arggh, so alchemist create me, now I trapped for experiments. But still I confused.",
    "Me see logic, feeeel magic. A mix of the two.",
    "No so sure it is easy to do. No one canna 'elp. Arghhh.",
    "Ah, please...",
    "That it! Make sense now, thank you!",
    "No does matter which you chose. Me needed organise my thoughts. I see there is truth in both.",
    "Now we go scare alchemies – they have been wrong to do this! Although I have life, they mustn't go about this again.",
    "Easy. You run down and I watching from here. I surprise right moment.",
    "Better. You been mine angel. I now have the understanding I need.",
    "Please, alchemists you speak, me appear to surprise.",
    "Thank you.",
    "Boo.",
    "Hahaha. Me not hurt. Now tell. What you plans? What you do with me?",
    "Bad play with. Naughty men. Go! Go, never return!",
    "Me look dungeon, [Player]. Please meet there.",
    "Me do know. Pleased you rescue.",
    "They use essence of Guthix power. Create tower pump this from ground. Make me with godly power. Dangerous.",
    "Thank you. For reward you speak me, I makes monsters.",
    "Good! I gain know from alchemists and builders. Me make beings.",
    "Yes, you right!",
    "Inspect symbol of life altars around dungeon. You see item give. Use item on altar. Activate altar to create, you fight."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Tower_of_Life?oldid=35945027’"
  ]
}