{
  "Reldo": [
    "Hello stranger.",
    "Hmmm, I don't...believe there are any here... Let me think. Actually...",
    "Ah yes. I know. If you look in a book called 'The Shield of Arrav', you'll find a quest in there. I'm not sure where the Shield of Arrav book is mind you...but I'm sure it's in the library here somewhere.",
    "Oh. But you said you're in search of a quest.",
    "You perplex me. Well, come back if you change your mind again.",
    "I'm not sure where it is, exactly...but I'm sure it's somewhere around the library.",
    "Did you find the book?",
    "Why are you asking me where to find a book you've already found? Have you read it?",
    "Try reading it.",
    "No, I don't. I think I know someone who might, however. If I were you I would talk to Baraek, the fur trader in the market place. I've heard he has connections with the Phoenix Gang.",
    "If I were you I would talk to Baraek, the fur trader in the market place. I've heard he has connections with the Phoenix Gang."
  ],
  "Player": [
    "Thank you.",
    "On second thoughts, I don't want a quest after all.",
    "I was. I am. I changed my mind.",
    "Aha! 'The Shield Of Arrav'! Exactly what I was looking for.",
    "Yes.",
    "No.",
    "Read 'The Shield of Arrav'. Got it.",
    "I've read the book. Do you know where I can find the Phoenix Gang?",
    "Thanks. I'll try that!",
    "Remind me again where I can find the Phoenix Gang.",
    "Can you tell me where I can find the Phoenix Gang?",
    "So DO you know where they are?",
    "I haven't got that much.",
    "Alright. Have 10 gold coins.",
    "Seriously...I paid 10 gold coins for that? I hope you're a better fur trader than a navigator.",
    "No. I don't like things like bribery.",
    "What's through that door?",
    "This is the headquarters of the Phoenix Gang, the most powerful crime syndicate this city has ever seen!",
    "I'd like to offer you my services.",
    "How would I go about doing that?",
    "I'll get right on it.",
    "I haven’t managed to find the report yet…",
    "I have the intelligence report!",
    "Let me go get it.",
    "Nice to meet you.",
    "I'm afraid I've lost my master thief's armband.",
    "And the shield of Arrav? I heard you got that!",
    "Where's the Black Arm Gang hideout? I wanna go sabotage 'em!",
    "Thanks for the help!",
    "Hello.",
    "How do you know that?",
    "So where is the hideout, then?",
    "VTAM. Got it.",
    "Is there anything down this alleyway?",
    "Thanks for the warning!",
    "Do you think they would let me join?",
    "Do you think they would let me join?",
    "What is this place?",
    "Sounds simple enough. Any particular reason you need two of them?",
    "Yeah, brilliant. So who are you planning to murder?",
    "No, no! Just curious.",
    "Oh no, not at all... It's so obvious! Even the town guard have caught on...",
    "What sort of business?",
    "I'm looking for fame and riches.",
    "No, I haven't yet found them.",
    "I have one...",
    "Yes, I have.",
    "Hey.",
    "I have lost my master thief's armband...",
    "They don't say a lot...",
    "Your majesty, I have recovered the Shield of Arrav; I would like to claim the reward.",
    "Your majesty, I have come to claim the reward for the return of the Shield Of Arrav."
  ],
  "Baraek": [
    "Sh sh sh, not so loud! You don't want to get me in trouble!",
    "I may do. But I don't want to get into trouble for revealing their hideout. Of course, if I was, say 10 gold coins richer I may happen to be more inclined to take that sort of risk...",
    "In that case I wouldn't dare tell you anything about the Phoenix Gang.",
    "To get to the gang hideout, enter Varrock through the south gate. Then, if you take the first turning east, somewhere along there is an alleyway to the south. The door at the end of there is the entrance to the Phoenix Gang. They're operating there under the name of the VTAM Corporation. Be careful. The Phoenixes ain't the types to be messed about.",
    "Hey now...the Phoenix Gang make it their business to not be easy to find. Look, if you get lost, talk to Charlie the tramp near the Varrock south gate. He can give you better directions.",
    "What? You're meant to bribe me, not the other way around... Oh, forget it!",
    "Heh. And you want to deal with the Phoenix Gang? They're involved in much worse than a bit of bribery."
  ],
  "Straven": [
    "Hey! You can't go in there. Only authorised personnel of the VTAM Corporation are allowed beyond this point.",
    "Really. Well? Who are we then?",
    "No, this is a legitimate business run by legitimate businessmen. Supposing we were this 'Phoenix Gang', however, what would you want with us?",
    "You mean you'd like to join the Phoenix Gang? Well, obviously I can't speak for them, but the Phoenix Gang doesn't let people join just like that. You can't be too careful, you understand. Generally someone has to prove their loyalty before they can join.",
    "Obviously, I would have no idea about that. Although having said that, a rival gang of ours, er, theirs, called the Black Arm Gang is supposedly meeting a contact from Port Sarim today in the Blue Moon Inn. The Blue Moon Inn is just by the south entrance to this city, and supposedly the name of the contact is Jonny the Beard. OBVIOUSLY I know NOTHING about the dealings of the Phoenix Gang, but I bet if SOMEBODY were to kill him and bring back his intelligence report, they would be considered loyal enough to join.",
    "Well, then get lost and stop wasting my time. ...if you know what's good for you.",
    "Get a copy of the Varrock Herald. If we have any positions right now, they'll be advertised in there.",
    "Sorry. That's classified information.",
    "How's your little mission going?",
    "You need to kill Jonny the Beard, who should be in the Blue Moon Inn. ...I would guess.[sic] Not being a member of the Phoenix Gang and all.",
    "Let's see it then.",
    "I'll wait here.",
    "Yes. Yes, this is very good. Very well, then! You can join the Phoenix Gang! I am Straven, one of the gang leaders.",
    "You now have access to the inner sanctum of our subterranean hideout, and our weapons supply depot round the front of this building.",
    "Lucky for you I have a spare. Don't lose it again!",
    "Greetings, fellow gang member.",
    "Oh yeah, we've all stolen some stuff in our time. Those candlesticks down here, for example, were quite a challenge to get out of the palace.",
    "Whoa...that's a blast from the past! We stole that years and years ago! We don't even have all the shield any more. About five years ago we had a massive fight in our gang and the shield got broken in half during that fight. Shortly after the fight some gang members decided they didn't want to be part of our gang anymore. So they split off to form their own gang. The Black Arm Gang. On their way out they looted what treasures they could from us - which included one of the halves of the shield. We've been rivals with the Black Arms ever since.",
    "You can always try the marketplace in Ardougne. LOTS of opportunity there!",
    "That would be a little tricky; their security is pretty good. Not as good as ours, obviously. But still good. If you really want to go there, it's in the alleyway to the west as you come in the south gate.",
    "One of our operatives is often near the alley - a red haired tramp, goes by the name of Charlie. He may be able to give you some ideas.",
    "Black Arm dog! How dare you show your face? I trusted you. I welcomed you into our organisation. It's not too late. Return to us. Forsake the Black Arm Gang, and arise like the glorious phoenix that is our namesake.",
    "Then we have nothing more to discuss. You know where the door is.",
    "You have made the right decision. Welcome back to the most reputable VTAM corporation."
  ],
  "Weaponsmaster": [
    "Only members of the Phoenix Gang are allowed up here. Find your own weapon stash.",
    "Hello, fellow Phoenix! What do you seek?",
    "No problem. Feel free to look around.",
    "Aren't we all? We've not got any up here. Go mug someone somewhere if you want some treasure."
  ],
  "Katrine": [
    "You've got some guts coming here, Phoenix guy/gal!",
    "You got me the phoenix crossbows. You passed your initiation. And then you betrayed the Black Arm Gang. What's the matter with you? It's not too late for you. Return to the open...arm of the Black Arm Gang, and all shall be forgiven.",
    "Then get lost, Phoenix scum!",
    "Alright. I forgive you. Welcome back to the Black Arm Gang. Don't let it happen again.",
    "It's a private business. Can I help you at all?",
    "Who told you that?",
    "Yes, I can understand that. So what do you want with us?",
    "How unusual. Normally we recruit for our gang by watching local thugs and thieves in action. People don't normally waltz in here saying 'hello, can I play'. How can I be sure you can be trusted?",
    "I'm not so sure. Thinking about it... I may have a solution actually.",
    "Our rival gang - the Phoenix Gang - has a weapons stash a little east of here. We're fresh out of crossbows, so if you could steal a couple of crossbows for us it would be very much appreciated. Then I'll be happy to call you a Black Arm.",
    "I have an idea for framing a local merchant who is refusing to pay our, very reasonable, 'keep-your-life-pleasant' insurance rates. I need two phoenix crossbows: one to kill somebody important with and the other to hide in the merchant's house where the local law can find it! When they find it, they'll suspect him of murdering the target for the Phoenix Gang and, hopefully, arrest the whole gang! Leaving us as the only gang of thieves in Varrock! Brilliant, eh?",
    "I haven't decided yet, but it'll need to be somebody important. Say, why are you being so nosey? You aren't with the law, are you?",
    "You'd better just keep your mouth shut about this plan, or I'll make sure it stays shut for you. Now, are you going to go get those crossbows or not?",
    "Great! You'll find the Phoenix gang's[sic] weapon stash just next to a temple, due east of here.",
    "If you're not up to a little bit of danger I don't think you've got anything to offer our gang.",
    "...How unusual. Someone honest wanting to join a gang of thieves. Excuse me if I remain unconvinced. Thinking about it... I may have a solution actually.",
    "Well, I'm sorry luv, I'm not giving away any of my secrets. Not to people who ain't Black Arm members anyway.",
    "Try...the one you just came in?",
    "Is that guy still out there? He's getting to be a nuisance. Remind me to send someone to kill him. So now you've found us, what do you want?",
    "I thought we were safe back here!",
    "Wow! We MUST be obvious! I guess they'll be expecting bribes again soon in that case. Thanks for the information. Is there anything else you want to tell me?",
    "A small, family business. We give financial advice to other companies.",
    "And you expect to find it up the back streets of Varrock?",
    "Have you got those crossbows for me yet?",
    "I need two crossbows stolen from the Phoenix Gang weapons stash, which if you head east for a bit, is a building on the south side of the road. Come back when you got 'em.",
    "I need two. Come back when you have them.",
    "You're now a Black Arm Gang member. Feel free to enter any of the rooms of the ganghouse.",
    "Hey.",
    "Lucky I 'ave a spare ain't it? Don't lose it again.",
    "They're just various rogues and thieves.",
    "Nope.",
    "Teach yourself."
  ],
  "Charlie the Tramp": [
    "Spare some change, guv?",
    "I know you're looking for the Black Arm Gang.",
    "In my current profession, I spend a lot of time on the streets. I hear things, and for a mere 10 gold, I'll tell you how to join the Black Arm Gang.",
    "The ruthless and notorious Black Arm Gang have their headquarters down the alleyway to the west of us. Talk to a lady called Katrine. But don't upset her, and tell her I sent you. She's pretty dangerous.",
    "I guess that'll have to do, then.",
    "Great, thanks.",
    "If you pay me the other 5 gold, I'll tell you.",
    "Yeah, sure, whatever. You don't frighten me, pal.",
    "The ruthless and notorious Black Arm Gang have their headquarters down the alleyway to the west of us. Talk to a lady called Katrine. But don't upset her, and tell her I sent you. She's pretty dangerous.",
    "Well, you know where to find me if you get lost!",
    "'What's in it for me?' Whatever happened to charity? Have you no consideration for those less fortunate than yourself?",
    "Sure, I know everything there is to know about this city. I'd be happy to tell you for 10 gold.",
    "Short memory, eh?",
    "Yeah, I heard you talked to Baraek. It's easy to get lost on the streets of Varrock. Now listen closely ... To get to the Phoenix hideout, walk east from here. It's the street with the Blue Moon Inn on the corner. Take the first alley leading south off of the road and you'll find the hideout at the end of that alley. It's called the VTAM corporation.",
    "Funny you should mention that...there is actually. The ruthless and notorious criminal gang known as the Black Arm Gang have their headquarters down there.",
    "Don't worry about it.",
    "You never know. You'll find a lady down there called Katrine. Speak to her. But don't upset her, she's pretty dangerous."
  ],
  "King Roald": [
    "The Shield of Arrav, eh? Yes, I do recall my father, King Roald, put a reward out for that. The Shield of Arrav is broken, however. I cannot accept it in its current state.",
    "My goodness! My father set a bounty on this shield many years ago! I never thought I would live to see the day when someone came forward to claim it. 1,200 coins was a fortune in my father's day. I hope it serves you well in your adventures. The museum of Varrock shall proudly display the Shield of Arrav once again."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Shield_of_Arrav?oldid=35970480’"
  ]
}