{
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "Dialogue with Grubfoot in the H.A.M. hideout, other dialogue optionsYou can discuss this issue on the talk page or edit this page to improve it."
  ],
  "Captain Undak": [
    "Surface-dweller. Have a good day.",
    "Actually, yes. Tell me, surface-dweller: do you know how we Dorgeshuun raise our children?",
    "I am coming to that. Please indulge me. Children of the city are not raised by their natural parents. They are raised together in the city nursery. Every child has the same start in life. No one in Dorgesh-Kaan is rich or poor from birth. Their achievements in life are their own. I am captain of the guard not because of some family tradition, but because that is where my talent lay and that is what I chose.",
    "It is different from your way. I am not judging you; please do not judge us. I merely wished to impress onto you how important the nursery is. A whole future generation is raised together. If anything were to happen to them... I am sure you understand. Lately, some of the children have fallen ill. It could be nothing... but it could be another plot by the H.A.M. movement. I do not like asking for your help, surface-dweller, but this matter is more important than my pride. You have dealt with the H.A.M. movement before and may be able to help me. Will you accompany me to the nursery?",
    "The nursery is at the top of the nearby stairs.",
    "I do not have time to chat with the children today, Mernik.",
    "Some of the children have fallen ill. I suspect it is not simply an illness, but that they may have been poisoned by the H.A.M. group.",
    "Torzek. We're here to investigate.",
    "We suspect that the children have been poisoned.",
    "Quiet, child.",
    "Thank you, Torzek. That is what we were looking for. Surface-dweller, we should now question the children inside and outside the nursery. We need to find foods that were eaten by the sick children, but not by the healthy ones. I think we are looking for two foods in total.",
    "We need to work out which foods are poisoned.",
    "The nursery is the large building near to where we are standing.",
    "We should talk to all of the children and ask them what they ate. We need to talk to the healthy children as well as the sick ones. I think we are looking for two different food types. We need to identify two food types that were eaten by the sick children, but not by the healthy ones.",
    "Good. I hope you are right about which ones. Now, we should question the vendors who sold those foods. The food vendors have been buying 'exotic' spices from human merchants recently, to add extra flavours to their foods. The poison must have been in one of these special ingredients. We should ask the vendors which merchants they bought ingredients from. If the vendors of the poisoned foods both bought ingredients from the same human merchant, then we will have found our H.A.M. agent.",
    "This is no time for small talk, surface-dweller. We need to investigate the H.A.M. threat.",
    "I am not Zanik, surface-dweller. I am not some carefree youth on an adventure. I am here to do my duty and protect my city, not to enjoy myself! I know I am not well-liked. I am captain of the City Guard, the only Dorgeshuun who carry weapons in the city. The people of the city do not like weapons. But the City Guard is necessary - I am necessary - and so I discharge my duty to protect the city, no matter what the people, or you, think of me. We have spent enough time talking; let's get back to work.",
    "Are you sure? If you accuse incorrectly, you will have to pay 5,000 coins as compensation.",
    "Very well. Merchant, you are under arrest for the suspected poisoning of the city's food supply.",
    "Stop! Don't kill him! He's under arrest. Thank you both for your help. I must take this prisoner to stand trial before the council. Zanik, you should follow me and tell the council what happened to you while you were gone. Zanik... it is good to see you.",
    "No one said you could talk!",
    "Stay right there!",
    "Zanik! Guards, after her!",
    "[Player]. Zanik has got away from us. Will you help us find her?",
    "I have the guards searching the city, but Zanik may have escaped into the caves to the south. No one knows those caves better than she does.",
    "Zanik knows the city and the caves better than anyone. She could run rings around my guards, but you're an adventurer like her, so you stand a chance of finding her. Plus, she trusts you. I think you're the only person she really trusts. You could convince her to give herself up.",
    "She'll have to stand before the council. If it was me, I'd be lenient, but they'll have to do something.",
    "I'm not asking you to betray her. She's not thinking straight, but that doesn't mean you can't. Where will she go? The north gate is small and guarded so she can't escape to the surface. She could hide in the city or in the south caves. Sooner or later we'll find her, but there would be a confrontation. It would be better for everyone if you could talk to her and convince her to come back.",
    "Zanik killed a prisoner who was in my custody. She went against the agreed, democratic decision of the council. You surface-dwellers may mete our vigilante justice, but that's not how we do things here.",
    "Thank you. I think she is somewhere in the caves to the south of the city. No one wants either of you to be hurt, though, so please be careful.",
    "[Player]. Thank you for your help in bringing Zanik in. I have another task for you if you're interested.",
    "In all the excitement surrounding Zanik, people seem to have forgotten that someone tried to poison us. WE need to know whether he was working alone or whether he was part of an organised plot. I would like you to infiltrate the H.A.M. base near Lumbridge and find out what Sigmund is planning now.",
    "Thank you. You will need to talk to people in the H.A.M. base until you get to the bottom of their plans. Here is a set of H.A.M. robes we have acquired. You may find them useful.",
    "This task specifically requires a surface-dweller. Are you interested?",
    "Zanik, [Player]. Thank you for coming back. The situation here is grave.",
    "The portal that you returned through has appeared again. Someone else came through wearing a huge suit of glowing armour.",
    "There was a goblin inside, but it seemed like the armour was moving him rather than the other way around. It paced up and down the city. Some of the guards tried to stop it, but it just swatted them aside with a huge rock it was carrying. It planted the rock here, then went back to its portal and disappeared.",
    "Three guards were killed; five more have broken bones and are being seen to. The guards couldn't even slow it down. It could have killed everyone in the city if it had wanted to. I don't know how we can defend ourselves if it comes back.",
    "I don't know. The scribe has been translating it. I think he's nearly ready now; the council is assembling to discuss it.",
    "For now, all I can do is keep order. The council is discussing the emergency, but I don't know what they will decide. I don't envy them.",
    "The council is assembling. You and Zanik should go to the council chamber. They will want to hear anything you know about this.",
    "You should go to the council chamber.",
    "There you are! I've looked all over the city. Zanik. [Player]. It is good to see you well. Everyone is waiting for you. Ur-tag wants to make a speech.",
    "There you are! I've looked all over the city. Zanik. [Player]. It is good to see you well. Everyone is waiting for you. Ur-tag wants to make a speech."
  ],
  "Player": [
    "Who are you?",
    "Can I help with anything?",
    "Yes.",
    "No.",
    "What's this got to do with me?",
    "That's horrible!",
    "Let's go.",
    "Not now.",
    "Okay. What's your point?",
    "Have they eaten anything unusual lately?",
    "Have you seen anyone suspicious?",
    "Are they all sick?",
    "Well, are they?",
    "Calm down. I'm here to help.",
    "Have the children eaten anything unusual lately?",
    "What did they have?",
    "Have you seen anyone suspicious around here?",
    "Are all the children sick?",
    "I'll talk to you later.",
    "I'll talk to you later.",
    "Yes.",
    "No.",
    "What about Zanik?",
    "What did she say?",
    "I don't believe you either.",
    "I believe you.",
    "I don't believe you either.",
    "What food did you eat yesterday?",
    "What food did you have yesterday?",
    "Hang in there.",
    "What food did you eat yesterday?",
    "Hang in there.",
    "Where is the nursery?",
    "I don't understand what to do.",
    "I've worked out which foods are poisoned.",
    "Tell me about yourself, Captain.",
    "Okay.",
    "Why don't you lighten up a bit?",
    "I need to do something else.",
    "Which merchants have you bought ingredients from?",
    "Your food made the children sick!",
    "Yes, please.",
    "No, thanks.",
    "Which merchants have you bought ingredients from?",
    "Your food made the children sick!",
    "Yes, please.",
    "No, thanks.",
    "This is the one, Captain.",
    "Yes, I'm sure.",
    "How could you do this?",
    "I never claimed to worship Saradomin.",
    "You think Saradomin wants you to poison children?",
    "No, I'm not sure.",
    "What are you doing here?",
    "Can I buy something?",
    "What do you know about the poisoned food?",
    "Goodbye.",
    "What's that behind you?",
    "My god is stronger than Saradomin!",
    "Only a coward hides behind protection prayers!",
    "There are ways to get around your prayers!",
    "I was so worried about you.",
    "I thought you were dead!",
    "I knew you'd find your way back.",
    "You've been gone for months.",
    "Yes! What happened?",
    "Let's go.",
    "I need to do something else.",
    "You don't sound very enthusiastic.",
    "You don't support the council?",
    "Can you think of a better system?",
    "Yes, feudalism is a better system.",
    "No, democracy is a better system.",
    "Yeah, politics is boring.",
    "Yeah, politics is boring.",
    "Not right now.",
    "Shouldn't you tell the council?",
    "You've been gone for days.",
    "You've been gone for a few hours.",
    "Just a few hours.",
    "I captured him single-handedly.",
    "Zanik and I brought him down together.",
    "No, it was Zanik who captured him.",
    "What would happen to him after you handed him over?",
    "You should hand him over.",
    "She means well.",
    "I'll talk to her.",
    "You should have listened to her.",
    "Zanik is right. You should kill him.",
    "I'll kill him for you!",
    "Where should I look?",
    "Why can't you find her?",
    "What will you do if you catch her?",
    "I won't betray her!",
    "Zanik did the right thing.",
    "I'll start looking now.",
    "Are you alright?",
    "You need to come back to the city.",
    "Why did you do it?",
    "You killed the H.A.M. agent.",
    "Are you alright?",
    "You need to come back to the city.",
    "You killed the H.A.M. agent.",
    "Are you alright?",
    "You need to come back to the city.",
    "Yes, but you should have respected the council.",
    "No, the council did the right thing.",
    "Yes, and you did the right thing.",
    "You've killed H.A.M. agents before.",
    "You wish he was still alive?",
    "You wish the council had executed him?",
    "You wish I had killed him?",
    "What did you wish had happened?",
    "Someday, we'll build that world.",
    "That world will never exist.",
    "That world would be boring!",
    "Zanik is a hero of the city.",
    "Zanik is a good person.",
    "Zanik did the right thing! Why don't you see that?",
    "I have nothing to say.",
    "I could come with you...",
    "Where will you go?",
    "Will you be alright?",
    "Goodbye, Zanik.",
    "What is this task?",
    "I'll do it.",
    "I won't help you any more.",
    "Can't you do anything for yourself?",
    "I won't help you any more.",
    "What kind of organisation is this?",
    "Who are you and what do you do here?",
    "What are you planning to do about the cave goblins?",
    "Where is Sigmund?",
    "What is Sigmund planning?",
    "Isn't Sigmund working with you any more?",
    "Who was this goblin?",
    "How can I find Sigmund's base?",
    "I'll go there now.",
    "Why Arrav?",
    "Didn't Arrav make peace with the goblins?",
    "What is Sigmund planning?",
    "Isn't Sigmund working with you any more?",
    "Okay, thanks.",
    "There's a H.A.M. base here?",
    "How do I get into the H.A.M. base?",
    "Arrav.",
    "I don't know the password.",
    "The password is *mumblemumble*.",
    "[Charm] You want to let me in.",
    "Goodbye.",
    "I want to get in to Sigmund's base.",
    "Arrav.",
    "I don't know the password.",
    "The password is *mumblemumble*.",
    "[Charm] You want to let me in.",
    "I need to see the prisoner.",
    "Letter?",
    "So, you'd let anyone in if they had the right letter?",
    "Who is the interrogator for today?",
    "What day is it today?",
    "You should let the prisoner go.",
    "Why do you hate monsters so much?",
    "Never mind.",
    "I have my letter here.",
    "I have my letter here.",
    "I have my letter here.",
    "I'm here to rescue you!",
    "Let's go.",
    "Wait there.",
    "Follow me.",
    "I'll distract the guard, then you make a break for it.",
    "Aren't you going back to Goblin Village?",
    "What have they done to you?",
    "How did they capture you?",
    "Wait there. I'll come back for you.",
    "Yes, it was me.",
    "The washing-up.",
    "Making myself a ham sandwich.",
    "No.",
    "Follow me.",
    "Wait here.",
    "Let's get out of here.",
    "What did you just do?",
    "Where did you learn to do that?",
    "Why didn't you do that before?",
    "I had nothing to do with this!",
    "Give up, Sigmund. You've lost.",
    "Time for you to die!",
    "Zanik! Don't kill him!",
    "Just get it over with, Zanik.",
    "Do it, Zanik! Make him suffer!",
    "I won't kill you, Zanik.",
    "I'll kill you!",
    "I surrender!",
    "You can't regenerate forever.",
    "Zanik! What's happened to you?",
    "My god is more powerful.",
    "You used to hate the gods.",
    "Does our friendship mean nothing to you?",
    "But am I *your* enemy?",
    "So were you, once.",
    "I should never have trusted you.",
    "I'm stronger than you.",
    "Zanik, you're being controlled. Fight it!",
    "Please don't do this, Zanik.",
    "Who are you?",
    "Release her!",
    "Zanik, it's the pendant. Take it off!",
    "Zanik, I believe in you.",
    "You've got to do it, otherwise it will win!",
    "You control your destiny.",
    "Zanik? Can you hear me?",
    "Are you alright?",
    "What happened?",
    "Hang on, I'll try to reach you.",
    "Wait there while I get help.",
    "Don't you have another teleport sphere?",
    "Try jumping and grabbing on to the wall.",
    "Try grappling across with your crossbow.",
    "I can see somewhere it could catch.",
    "Left a bit.",
    "Right a bit.",
    "You overshot. Go left.",
    "It's alright, Zanik. You can do it.",
    "Just a bit further left.",
    "I'm not leaving you, Zanik.",
    "Just a bit further left.",
    "Right a bit.",
    "Try that spot again.",
    "Right a bit.",
    "Try that spot again.",
    "Left a bit.",
    "Right a bit.",
    "Try that spot again.",
    "Right a bit.",
    "Try that spot again.",
    "Try that spot again.",
    "We need to talk.",
    "You tried to kill me...",
    "Don't feel bad; it wasn't your fault.",
    "How do you know you're not still under control?",
    "I'm not sure I can trust you now.",
    "What was being controlled like?",
    "What was this presence?",
    "Are you alright now?",
    "How did you assemble that goblin army?",
    "Never mind that now.",
    "Things have changed, the city needs Zanik.",
    "The council would want Zanik back now.",
    "Stand aside!",
    "What's going on?",
    "Don't worry. Zanik and I will save you.",
    "Oh, pull yourself together.",
    "Why are you on alert?",
    "Don't worry. Zanik and I will save you.",
    "Was anyone hurt?",
    "What does the writing say?",
    "What are you going to do?",
    "What can I do?",
    "Goodbye.",
    "I'll do my best.",
    "But what can we do?",
    "Why should we help you? You banished Zanik!",
    "I am calm.",
    "Don't worry. Zanik and I will save you.",
    "Can I do anything to help?",
    "Don't worry. Zanik and I will save you.",
    "Can I help with anything?",
    "Opening the city was the right decision.",
    "The city should have stayed closed.",
    "I don't know.",
    "Don't worry. Zanik and I will save you.",
    "Can I help with anything?",
    "Don't worry. Zanik and I will save you.",
    "Can I help with anything?",
    "Don't worry. Zanik and I will save you.",
    "Can I help with anything?",
    "What do you want me to do?",
    "You're worried about your book at a time like this?",
    "I'll help you.",
    "I'll go now.",
    "Where can I find Tegdak?",
    "Can you tell me what the obelisk says?",
    "Not right now.",
    "Don't worry. We have a chance.",
    "The scribe sent me to get a box of artefacts.",
    "Goodbye.",
    "Here it is.",
    "I'll go now.",
    "Where can I find Mistag?",
    "Not yet.",
    "Could you bury this time capsule?",
    "Don't worry. We have a chance.",
    "What are you arguing about?",
    "Oldak is right.",
    "Grubfoot is right.",
    "Does it really matter?",
    "What do you want me to do?",
    "I'll go now.",
    "Where can I find the power station?",
    "Not right now.",
    "I want to buy a teleport sphere.",
    "What do you mean?",
    "Good idea!",
    "I don't think Bandos would need a power station.",
    "Oldak needs a pair of energy projectors and a focusing chamber.",
    "Do you need any parts from the old power station?",
    "Aren't you worried about the attack?",
    "But the Big High War God is the one attacking the city!",
    "That's what I believe too.",
    "Zanik doesn't want to be the Chosen Commander.",
    "You're deluding yourself.",
    "What were you and Oldak arguing about?",
    "Why are you hanging around with Oldak?",
    "Goodbye.",
    "I have the parts here.",
    "Can you explain your plan?",
    "That's a lot of assumptions.",
    "Sounds like it'll work!",
    "What's this about the swirl pattern?",
    "Oldak has modified your crossbow.",
    "Oldak said it was certain to work.",
    "It's untested, but it's worth a shot.",
    "What are you doing?",
    "Saying goodbye to the city?",
    "You'll see the city again.",
    "That was a good speech.",
    "I'll talk to you later.",
    "What can I do?",
    "I'll talk to him.",
    "Where can I find the ambassador?",
    "Not right now.",
    "How are the children holding up?",
    "Busy doing what?",
    "You coward!",
    "I want to talk about the children.",
    "You coward!",
    "Sorry, I'll leave you alone.",
    "I talked to him... He said no.",
    "Nothing. Everything is fine.",
    "Quiet. The grown-ups are talking.",
    "You're all going to die.",
    "Not right now.",
    "How are the children holding up?",
    "How are the children holding up?",
    "Goodbye.",
    "I'll go and get ready. [Ends dialogue]",
    "I'm ready now.",
    "You're not so tough. Call yourself a god?",
    "Why can't you just leave the goblins alone?",
    "What were you trying to do?",
    "We'll see about that. Zanik – now!",
    "You monster! You killed Zanik!",
    "We won, Zanik!",
    "Are you alright?",
    "Wake up, lazybones.",
    "Zanik! I thought you were dead!",
    "How badly are you hurt?",
    "It's over, Zanik. We won.",
    "I'm not letting you touch that thing again!",
    "How are you feeling?",
    "The mark on your forehead is gone.",
    "Here it is.",
    "We won. Oldak's crossbow worked.",
    "I killed him by myself, no thanks to you!",
    "It looks like he's gone. I don't know if he's really dead.",
    "About time you woke up!",
    "You don't need to give me anything.",
    "Thank you, Zanik.",
    "About time I got a reward!"
  ],
  "Mernik": [
    "Oh, hello, surface-dweller! Hello, Captain! Children, say hello to Captain Undak.",
    "You never were one for small talk, were you, Undak? So, what can I do for you?",
    "Oh... oh dear. We sent the sick children outside in case they were contagious. My assistant, Torzek, is looking after them. You should speak to her.",
    "[Player]? Could you do me a favour?",
    "Talk to Ambassador Alvijar for me – he won't talk to me. I want to ask him if Keldagrim would take the children in as refugees. I know we can't all leave the city, but at least the children could be saved.",
    "Thank you. Let me know what he says.",
    "His house is just north of here.",
    "I haven't told them what's happening. They can sense there's something wrong, but what can I say to them? The children don't even know the gods are real. We don't normally tell them until they're grown up. So what can I say? Please, you've got to help me.",
    "Please talk to Ambassador Alvijar for me. The children could be saved if Keldagrim would take them in.",
    "Oh. I thought he would, but it was worth a try.",
    "Thank you. I hear that Zanik is ready to go through the portal now. You should go and speak to her.",
    "Thank you. I hear that Zanik is ready to go through the portal now. You should go and speak to her.",
    "Thank you for your help. I hear that Zanik is ready to go through the portal now. You should go and speak to her.",
    "I haven't told them what's happening. They can sense there's something wrong, but what can I say to them? The children don't even know the gods are real. We don't normally tell them until they're grown up. So what can I say? Please, you've got to help me.",
    "There's nothing more we can do, [Player]. I just have to make the children's final moments happy, I suppose."
  ],
  "Caldi": [
    "Hello, Captain Undak!",
    "Why are you so sad? What are you talking about with the surface-dweller?",
    "Hooray! I'm going to go and draw a picture of a frog.",
    "Be like that, then.",
    "What? No..."
  ],
  "Torzek": [
    "Oh hello, surface-dweller. H-hello, Captain. I'm afraid some of the children are a bit poorly.",
    "Investigate? But... why would the city Guard be interested in sick children?",
    "P-poisoned?",
    "B-but who could have done this? Why? They're just children!",
    "I-I-I-I-I don't know! I can't think straight!",
    "I-I don't remember! Maybe?",
    "All of them? Are they? Oh no!",
    "Are they?",
    "I... alright. Deep breaths... deep breaths... Sorry. I got panicky. How can I help you?",
    "Come to think of it, we did buy them all food from the market yesterday as a special treat. But they all ate it, not just the ones who got ill.",
    "Each of them had two different things. Maybe you should ask them all what they had.",
    "No, I don't think so. Our food supply here hasn't been tampered with.",
    "Oh, no, just the ones out here. The others seem fine. We're keeping the sick children separate in case they're contagious.",
    "Who are you talking to?",
    "You must be imagining things. Zanik's gone."
  ],
  "Andil": [
    "Who's poisoned?",
    "Are you [Player]? Zanik's friend?",
    "I heard Zanik talking to me - I'm sure I did - but no one will believe me.",
    "I'm not sure. She was very faint, but I think she was shouting. I tried to shout back, but she couldn't hear me. No one else believes that I heard her. They thought I was making it up.",
    "I know I heard her. She's still out there somewhere... I hope she's alright.",
    "*sniff* No one believes me.",
    "I had the green gloop soup and the *cough* frogspawn gumbo.",
    "Who's that?",
    "Zanik? I can't make out what you're saying.",
    "It's Zanik! But I don't know what she's saying.",
    "I heard her! I'm sure I did."
  ],
  "Delgon": [
    "Ooooh...",
    "I had the frogburger and... oooh... the green gloop soup."
  ],
  "Gerdi": [
    "I think I'm going to be sick...",
    "I had the frogburger and the frogspawn gumbo."
  ],
  "Markog": [
    "Frogspawn gumbo! Lovely, chewy and wet. Only 10gp a bowl. Do you want some, surface-dweller?",
    "Yuri and Walton."
  ],
  "Turgok": [
    "Cave slime soup! Do you want to buy some soup? Only 10 coins a bowl.",
    "Walton and Xenia."
  ],
  "Merchant Walton": [
    "What do you want?"
  ],
  "H.A.M. agent Walton": [
    "Get your hands off me, goblin! I heard about you, [Player]. You're a traitor to Saradomin.",
    "Because, unlike you, I have the courage to stand up for my species and my god! These goblins will poison our society with their godless ways!",
    "Heathen! Humans like you are as bad as monsters! You should die down here along with your precious goblins!",
    "They're not children! They're goblins!",
    "You cannot defeat me. See how Saradomin protects me from your heathen attacks?",
    "Do you think I'm completely stupid?",
    "Only a fool denies the aid of Saradomin.",
    "Where did you come from?",
    ": I heard about you, [Player]. You're a traitor to Saradomin.",
    "You'll pay for this, goblins. You too, traitor."
  ],
  "Zanik": [
    "I'm back! Did you miss me?",
    "You thought I was dead? But I was only gone for a few minutes!",
    "Thanks, [Player]. Wait – how long was I gone for?",
    "Months! But... I must have been unconscious for all that time. I'd better tell you what happened.",
    "After I was pulled into that box on Yu'biusk, I lost consciousness. It only seemed like a few minutes, but I must have lost months. I woke up in this huge room. From the smell of the air I was still in Yu'biusk. It was cold and very still... I managed to climb onto the goblin statue and balance on its head. I found I could jump between the statues' heads! That proved to be the key to getting out of there... From the top of this statue I could see into the bowl. It was clearly magical – some sort of scrying bowl.",
    "That was my house! Why would the scrying pool be focused there? Woah... Hey! Can anyone hear me?",
    "You can hear me! Listen, I'm trapped in Yu'biusk, but I'm alive! Please tell the council, and get a message to [Player]...",
    "I found my crossbow! There were no enemies around, but I could use the crossbow with a grappling hook to get to places. I grappled on to the huge statue and swung across to the throne. The pendant was... powerful – I could feel it even before I touched it. It was the same feeling I had when I drank the Tears of Guthix for the first time, and when you brought me back to life, and when we opened the box... I was that same feeling, but even more intense. I put it on.",
    "...and when I emerged from the portal I saw you fighting that H.A.M. agent, so naturally I joined in! I suppose we should go and talk to the council. They'll want to know what happened to me.",
    "Well, you know... It'll just be a long boring meeting where the politicians talk and talk and talk.",
    "They normally make the right decision. It just takes them such a long time. Sometimes they'll disagree with one another and spend months arguing back and forth. Even when they do basically agree, they'll still spend months arguing over the tiny details.",
    "I don't know. Maybe if it was like the surface, where you have dukes and kings. One person in charge by birthright...",
    "I...I'm not sure. I don't really think anyone has a right to rule from birth. I don't know what came over me. Let's just get the council meeting over with. Come on, [Player].",
    "Yeah, you're right. Of course you are. I don't know what I was thinking. Let's just get this council meeting over with, [Player].",
    "I will, but I want to tell you first.",
    "Oh! Okay then. I'd better tell you what happened.",
    "I'm fine. I'll tell you what happened later. Right now we should deal with the H.A.M. agent.",
    "Just like old times, [Player].",
    "Don't be so modest, [Player]. We did it together.",
    "You're not going to execute him?",
    "It's not right, [Player]! He needs to pay for what he did!",
    "This is pointless! This man tried to poison the children! He deserves to die!",
    "What happened, [Player]?",
    "I just... I don't know what came over me.",
    "I was so angry. I mean, he was trying to kill the children! All I could think of was that he was trying to kill the children and he deserved to die, and the council wouldn't do it.",
    "You don't really think that, [Player]. In the meeting, you said that they should hand him over. Did he really deserve to die?",
    "I should have listened to you in the meeting, [Player]. I... wish I hadn't done it.",
    "I...I know you tried to kill him too...but I'm not sure. I don't know whether it was the right thing to do. I...I wish I hadn't done it.",
    "That was on the battlefield. It was them or me. This time, he had already been captured. He was helpless. It's totally different. I wish I hadn't done it.",
    "No. I'm glad he's dead.",
    "No. The council isn't like that. I wouldn't want...they shouldn't have to do something like that. It isn't right.",
    "No. I know you've helped us before, but I don't want you to do all our dirty work for us.",
    "I don't know. I wish... I wish none of this had happened. I wish there weren't any people who wanted to kill us. I wish we lived in a world where everyone could be happy and not fight one another.",
    "Yeah, maybe. It's just hard to stay positive sometimes. *sigh* Alright, [Player]. I'm ready. Let's go back to the council.",
    "There wouldn't be a place for you and me without conflict, huh? *sigh* Alright, [Player]. I'm ready. Let's go back to the council.",
    "I don't know what happened. I was overtaken by emotion. I know that's not an excuse. I'll accept whatever sentence you decide on.",
    "Please don't, [Player].",
    "So... I suppose this is goodbye, [Player].",
    "No, [Player]. I think I need to be on my own for a while... get things sorted in my head... think about my destiny. I'm sure I'll see you again... someday.",
    "I'm not sure. I might go to live with the surface goblins or I might just wander around looking for adventures.",
    "Oh, I'll be fine. I've visited the surface on my own a few times since I went there with you. I can take care of myself.",
    "Goblins, attack! Kill all humans! [Player]? Quick, [Player]! Sigmund's getting away! Stop him!",
    "Not this time, Sigmund. No ring of life. No last minute escape. No more treating this like it's a game!",
    "Begging didn't get me anywhere when I was in your power. Remember? I'm going to enjoy returning the favour.",
    "Shut up, [Player]! You're next!",
    "Shut up, [Player]! You're next!",
    "Shut up, [Player]! You're next!",
    "You're stronger than I thought, human.",
    "No one can kill me! I am the Chosen Commander of the Big High War God. His power protects me.",
    "No one can kill me! I am the Chosen Commander of the Big High War God. His power protects me.",
    "Give up, human. No one can interfere with my destiny.",
    "Never let it be said that the Big High War God is not merciful. I will make your death swift.",
    "Actually, I can!",
    "This is what my whole life has led up to. I am the Chosen Commander of Bandos!",
    "I have seen the light of the Big High War God. His power flows through me.",
    "We shall see.",
    "But now I see my destiny. I am the Chosen Commander!",
    "Our friendship? You are an enemy of the Big High War God!",
    "You... you were always a good friend, [Player]. I don't want to hurt you. B-but I must! The Big High War God commands it!",
    "Before I saw the light. Before I went to Yu'biusk. Now, I see my destiny. I am the Chosen Commander!",
    "Your trust was useful, but now it will be your downfall.",
    "Why won't you just die, human?",
    "No one is stronger than me. I cannot be defeated!",
    "The Big High War God commands... [Player], I...I'm trying to fight, but it's too strong! I don't want to hurt you. I'm sorry! She is mine, human! She can never break free of my power!",
    "Your cowardly pleas do not move me, human. All the world will plead and I will show no mercy.",
    "Zanik is mine, human. I branded my symbol into her forehead. I raised her from the dead. I guided her to Yu'biusk and gave her my pendant of leadership. She belongs to ME!",
    "I am War! I am Power! I am Bandos, the rightful god of all goblins, and through this puppet commander, I shall become god of all Gielinor!",
    "You dare command me? I am Bandos, the Big High War God! You are as an insect to me. Soon all will worship me or be destroyed.",
    "I... I can't, [Player]. It's too strong!",
    "[Player], I... I'll try. If you think I can do it...",
    "I... I can't let that happen. You're right, [Player]! I've got to...",
    "You... you're right! I've been a... a puppet, all this time, but I won't go on like that. I can do it!",
    "The cave's collapsing! Quickly, [Player], take my hand!",
    "Where are we? We should be in Dorgesh-Kaan, but it's dark.",
    "Two people using the same sphere must have made it malfunction. I'm sure we're somewhere close to the city, though...",
    "Earthquake!",
    "[Player]! You're alright!",
    "I'm not hurt, but I'm trapped on the edge of a chasm! I can't move!",
    "It felt like an earthquake, but I'm not sure. It can't be a coincidence that it happened just then.",
    "[Player]! Thank goodness you're alright! I'm trapped. I can't see any way across.",
    "[Player]! Don't leave! The cave is unstable!",
    "No. I used my last one.",
    "Are you mad? Do you think I can stick to walls like a molanisk? I'd fall to my death!",
    "I can't see any place where the grapple would catch.",
    "Okay. I'll try, but you'll have to direct me.",
    "I'm sorry, [Player].",
    "All right, [Player]. I'll try.",
    "I... I can't do it, [Player]. You should leave me here.",
    "Alright. One more try...",
    "Talk about what?",
    "[Player], I'm sorry. I was... I was under the control of the pendant. I feel terrible. Please don't make this any harder than it is.",
    "Thank you [Player]. That... that means a lot to me.",
    "As soon as I took the pendant off I could feel the presence gone. I'm sure it was the pendant, and now that it's gone, I'm free.",
    "I...I don't know what I can say. I hope I can prove myself to you again.",
    "It's hard to describe. It was so subtle at first. My opinions started changing, but they still felt like they were my opinions. When I was fighting you... you made me think about what I was doing. You made me realise that I wasn't myself. Then it was like another presence was in my body and I was fighting to control it. It was horrible.",
    "It was the Big High War God, Bandos...or at least, that's what it claimed to be. I could feel its mind. It was so...callous. It just doesn't care about us: not goblins, not humans, not anyone. It doesn't see us as people, just things to own and control.",
    "I'm shaken, but I think I'll be alright. I won't let that happen to me again.",
    "After I left Dorgesh-Kaan, I went to the goblin temple at the Plain of Mud. They welcomed me! Maybe they'd forgotten what I said last time I was there, when they locked me up. They were talking about some H.A.M. people who'd attacked goblins nearby, and about a base they'd heard had been set up nearby. I started saying that maybe they should organise themselves and fight back...and then the next thing I knew, I was on the preacher's podium telling them all to form an army to destroy the H.A.M. base! I think that's when the pendant started to really take over. I was saying things I didn't really think, that all humans must die. Horrible things...but they seemed so right at the time. I suppose all those goblins are dead now, killed in the fight or when the cave collapsed...and it's my fault. They were all so brave, prepared to fight to the death, whatever happened. Misguided, maybe, but very brave.",
    "Thanks, [Player]. I had nearly given up... but I'm feeling better now. We'd better not try to teleport again. Dorgesh-Kaan should be within walking distance. Now let's go! We need to get to Dorgesh-Kaan to deal with the High Priest!",
    "Juna! It's so good to see you! I was trapped in Yu'biusk, but now I'm back, an-",
    "I know! We've got to stop that High Priest!",
    "Return? Bandos is evil! He just wants us to serve him and fight in his wars!",
    "Just because it's my destiny it doesn't mean I have to do it!",
    "I'll take my chances. Let's go, [Player].",
    "What's the matter? What's happening in the city?",
    "Kazgar, you've got to let us in. Maybe we can help.",
    "Thanks, [Player]. Now, let's see what's happening in the city.",
    "What happened?",
    "Someone else? You mean the goblin High Priest?",
    "We have.",
    "[Player], please! This is more important.",
    "We can fight.",
    "We can fight! I've had that... thing inside my head. It's not merciful. It doesn't see us as people. It only wants to dominate, to control. Our ancestors defied it. They escaped its clutches, they broke all of its hateful commandments, they built a new city – a new world – where we could be free. We haven't gotten rid of conflict or suffering entirely – maybe we could have, given more time and effort – though we have done pretty well. Our whole history since then, every one of us who has lived and loved and built and dreamed, has been one glorious act of defiance. If we surrender, that rebellion will be undone. Bandos won't just make us suffer, he won't just reduce us to barbarism – he'll turn us into an instrument of evil. But if we fight it now, then even if we die, that will be the crowning of our defiance. I thought I couldn't fight, but [Player] told me that... that [he/she] believed in me. That's what we need now; to believe in one another. You say that we can't win, that we can't fight. Well, perhaps you're half right; perhaps we can't win. But we can fight.",
    "So, [Player], I suppose this is it. This is the end. I'm... I'm glad you're here. I should go and get ready now. The scribe seemed very worried... I mean, even more than you'd expect. Maybe you should go back into the council chamber and see if you can help him. I'll be near the portal if you want to talk to me.",
    "Hello, [Player].",
    "Oldak told me about his idea. I'm not that hopeful, though.",
    "Thanks for trying, [Player], but I know that's not true. I know Oldak; he's never absolutely certain about anything. Thanks, [Player], I don't think we're quite ready to go yet. Perhaps you could go and check up on Mernik in the nursery. I'm worried about how the children are taking all this.",
    "I suppose you're right. Oldak's gadgets normally work... but this isn't a normal situation. Thanks, [Player]. I don't think we're quite ready to go yet. Perhaps you could go and check up on Mernik in the nursery. I'm worried about how the children are taking all this.",
    "I'm just...I just want to take a moment to get ready. I guess I'm saying goodbye to the city.",
    "I was born here - I grew up here - but I've never really... It's always seemed too small for me. You know, just a few years ago, I thought the city was the whole world, that there was just solid rock outside, going on forever. As soon as I found out that the surface existed, I wanted to see it. And thanks to you, I did see it. The time when I first saw the sky... it was so beautiful. It made the city seem smaller than ever. But now... It's like what you said about a perfect world. Your people and mine could have built something wonderful together, but that's just a hopeless dream now.",
    "No, [Player]. We can't beat this enemy. We can't run and we can't surrender. The only thing we can do is go down fighting... and that's what I intend to do. You might get away - Bandos won't try to chase you - but this is the end for Dorgesh-Kaan, and for me.",
    "Thank you. I meant it. And I think... I think every cave goblin, deep down, thinks the same thing. It was what the H.A.M. agent said, wasn't it, that he'd rather die than submit? Sigmund, too, just before... It would be better to die than submit to such an evil power. We can run and hide or we can fight, but even if there's no hope, we can't surrender. Better to die.",
    "Thanks, [Player].",
    "Well, I'm ready. You should prepare for the fight.",
    "Alright, [Player]. Let's go.",
    "No surrender.",
    "We have no gods! We don't need you any more! And if you still need us, then I guess that makes us stronger than you!",
    "All that just to get people to worship you? You're pathetic!",
    "My crossbow! [Player], quick, pick up the pieces!",
    "So did I. I really thought I'd die here, but it looks like I was wrong about that. Is it over [Player]? Did we beat him?",
    "I... *cough*... I think I'll live. Is it over, [Player]? Did we beat him?",
    "I didn't think we could do it. It looks like Bandos wasn't as powerful as we thought. Hand me the pendant; it's time to end this.",
    "Please, [Player]. I'm not going to wear it; I'm going to destroy it.",
    "I'm bruised all over and I think I've got some broken ribs...but I've never felt better.",
    "It is? That's good. That means... that means I'm not under his power any more. I'm not under anyone's power. I have no destiny... I'm free!",
    "There, it's over. Let's go, [Player].",
    "You know, I didn't think it would. It looks like Bandos wasn't as powerful as we thought. Hand me the pendant; it's time to end this.",
    "Haha! I knew you could...*cough*...cope, so I had a little nap. Hand me the pendant; it's time to end this.",
    "There's a way we can make sure. Hand me the pendant; it's time to end this.",
    "I hope I didn't...*cough*...miss anything. Is it over, [Player]? Did we beat him?",
    "No, really, I'm fine! I still ache a bit but I'll heal up.",
    "No, I... [Player], I want you to have it. You fired the shot that finished off the Bandos avatar. It should be yours.",
    "No, I insist. I can get a new one for myself.",
    "A speech?",
    "Is that why... Well, anyway, it's yours.",
    "A speech?",
    "Look, [Player]! They made a statue of us!"
  ],
  "Ur-taal": [
    "Zanik!",
    "Zanik! It's good to see you! Captain Undak told us you were back.",
    "He has admitted his guilt, so all that remains is to choose a suitable punishment.",
    "[Player], did you have a hand in apprehending this man?",
    "I have Duke Horacio's assurance that any H.A.M. agents caught attacking the city will be dealt with.",
    "Execute him?",
    "Zanik, Dorgesh-kaan does not practice the death penalty. Even if we did not have to hand him over, we would have to imprison him here.",
    "Captain Undak, escort the prisoner to the surface.",
    "Zanik. The council has discussed your crime. If you have anything to say in your defence, you may say it now.",
    "[Player], do you have anything to say?",
    "We shall bear in mind Zanik's services to the city. Whatever happens, she will always be a hero, but that does not put her above the law.",
    "Zanik's character has been taken into account. We believe she had good intentions. Nevertheless, we must take action.",
    "However much you disagree with our laws, Zanik had broken them, and there must be consequences.",
    "Very well. Zanik, your achievements have already earned you a place in this city's history books. You have been our first explorer, our protector, and the favourite daughter of Dorgesh-Kaan. You have, however, broken our laws and risked a diplomatic incident with the surface people. The council is not above the law; justice must be done. It is the decision of this council that you be banished from the city, not to return until the council sees fit. Oldak will supply you with a moving-over-distance sphere. We will give you a few minutes to say your goodbyes.",
    "Zanik, [Player], thank you for coming. I trust you have seen the obelisk?",
    "Our scribe has just finished translating the inscriptions. It makes for chilling reading.",
    "That is the situation. Our worst fears have been realised. Unless you can help us, it seems that our city is doomed.",
    "Zanik saved us from the H.A.M. people!",
    "Order! There is no point in discussing what might have been.",
    "What?",
    "Then we fight. Captain Undak, Zanik, you will prepare our defences. [Player], I know that this is not your fight, and I would not blame you for leaving us now, but if you wish to stay, you should ask around the city for anything you can do.",
    "No one could have predicted this!",
    "I'm sorry about that, [Player]. Everyone's under a lot of stress.",
    "I think the scribe was talking about some plan he had - maybe you can help him. He's in the council chamber."
  ],
  "Ur-pel": [
    "Are you alright? We thought you were dead!",
    "There's nowhere... and Zanik was right. In a situation like this, the noblest thing you can do is go down fighting.",
    "Thank you, [Player]... but I think Zanik was right about that too. We can't win this fight, but it's still the right thing to do.",
    "(same as above)"
  ],
  "Ur-lun": [
    "Hmm, Since a surface-dweller was involved in his capture, the Lumbridge-Dorgeshuun treaty requires us to hand him over to the Misthalin authorities.",
    "He will pay, Zanik, but according to the law.",
    "We have to run... go deeper into the caves... build a new city.",
    "I... I still think we should run. There must be somewhere in the caves that some of us can hide."
  ],
  "Ur-vass": [
    "Hand him over? How do we know the surface-dwellers won't just let him free?",
    "There they are!",
    "We have to surrender. At least then some of us will survive.",
    "Calm down! Everyone, try to stay calm.",
    "I wish everyone else was; people are starting to panic. There are rumours going around about armies of magical giants and gods. I'm trying to tell people the truth, but it's not much better than the rumours.",
    "Tell that to the people. Some of them used to think you and Zanik could do anything, but no one knows what to think now.",
    "Have you been to the nursery? I'm worried about how the children are holding up."
  ],
  "Ur-zek": [
    "Since we do not practice the death penalty, we cannot hand him over to be executed. He will most likely be sent to the prison near Draynor Village, or the one in Port Sarim.",
    "That girl is too hot-headed.",
    "Yes, I'm sure she does. She'll learn restraint in time.",
    "This is all Zanik's fault! She poked around in the goblin temple and that box in Yu'biusk. She brought the gods down on us!",
    "If it hadn't been for Zanik, we would still be cut off from the surface! We should have cut off all contact, blocked up every passageway!",
    "Then what can we do? We can't fight it; we couldn't possibly win!",
    "The council made a mistake! We should never have opened the city!",
    "But we should have known that something would go wrong! Our ancestors cut themselves off for a reason. Now we understand what that reason was, and we're too late.",
    "Our generation, out of three thousand years! Why did it have to be our generation that brought the end of Dorgesh-Kaan?",
    "Don't you speak to me, surface-dweller! I wish we'd never let your kind into the city.",
    "Yes! You and Zanik can killed that giant or god or whatever it is that's threatening us!"
  ],
  "Ur-tag": [
    "Enough of that!",
    "No one is going to kill this man.",
    "In light of our current emergency, we have officially rescinded Zanik's banishment. She is free to return to the city.",
    "[Player], did I do the right thing? Opening the city, I mean?",
    "Perhaps you're right. We might still be in this position, but not have you to help us.",
    "Yes, perhaps you're right. None of this would have happened.",
    "It's not your job to know, it is mine, and I still don't.",
    "This wasn't the first time we had contact with the surface. Did you know that? Passages had opened before - earthquakes, mining accidents - but we always sealed them again.",
    "The difference this time was that you came down to investigate. We couldn't hide any more, but we could still have kept surface-dwellers out of the city.",
    "The council had meeting after meeting about it. We couldn't reach a consensus, so we had to vote, and the council was evenly split. I had the deciding vote... It was the hardest decision of my life.",
    "In the end, I think I was like Zanik - I was curious. I wanted to meet the surface-dwellers who would visit the city.",
    "Perhaps that was selfish of me, putting my curiosity first. I suppose it's too late now.",
    "Zanik doesn't share your confidence. She thinks the best we can do is go down fighting. I don't know if she's right, but I can see why she thinks that.",
    "We're going up against a god here, [player]. The same god our ancestors fled from, or at least, some avatar or agent of that god. In our mythology, the War God is a figure of absolute, unstoppable evil.",
    "Whatever plan you come up with, I dont[sic] think any cave goblin really believes we can win.",
    "I don't think you can help me. You should go down into the city and talk to people. You're a hero - seeing you're here will give people hope.",
    "People of Dorgesh-Kaan, this is the start of a new era.",
    "This city was founded in fear. The gods were destroying the surface world with their wars, and our ancestors survived by hiding and cutting themselves off.",
    "Since then, fear has been our guiding principle. The movements of the earth have opened passages to the surface, but we have always closed them, not even looking out to see whether the surface was safe.",
    "But we could not hide forever. One surface-dweller, [Player], displayed a trait we had forgotten: curiosity.",
    "[He/She] made [his/her] way through our tunnels and found us. [He/She] showed us that not all surface-dwellers are servants of evil gods.",
    "[Player] acted as a guide when we sent our first explorer to the surface. Zanik was young and impetuous, a controversial choice as our ambassador, but she has proved to be the right one.",
    "Zanik learned that, although the God Wars were over, there were still some on the surface who wished us harm, but Zanik and [Player] foiled each and every one of the H.A.M. group's plans.",
    "Then we faced a greater threat, when our ancestors' worst fears were realised. The figure that invaded our city was none other than the War God, but, against all odds, Zanik and [Player] defeated him.",
    "It is hard to believe, but it is true. The War God's power is broken; he is no longer a threat to us. That is why this is the start of a new era, one marked not by caution, but by hope and curiosity.",
    "We have been tested... and we have prevailed. Now, we can stand beneath the open sky without fear, and for that, we have Zanik and [Player] to thank."
  ],
  "Johanhus Ulsbrecht": [
    "Welcome, [brother/sister], to our organisation. Ours is a fight for humanity in all its shapes and forms... and to rid mankind of the monsters that exist in our world. We have no quarrel with a fellow [brother/sister].",
    "(Non-quest dialogue.)",
    "(Non-quest dialogue.)",
    "I am doing nothing... only lobbying the Duke to break off contact with their city. It is Sigmund who is planning attacks.",
    "Sigmund took a group of his followers and established his own base in Kandarin.",
    "I don't know what he's planning! The last I heard was that his men had captured a goblin spy who was poking around in human lands. He took it to his new base... for interrogation.",
    "Sigmund and I have the same aims, bit our methods have diverged. Most of our members aren't comfortable with Sigmund's... hard-line approach. We want the Duke to deal with the monster problem, not deal with it ourselves. Sigmund took the more... active members of our group and established his own base.",
    "I don't know! It was a goblin – what more is there to know?",
    "You wish to join Sigmund's group? Very well. Go to the windmill north of Ardougne and speak to Milton the Miller. The password is 'Arrav'.",
    "You must know the story of Arrav. He was a human hero who stopped the goblin attacks on Varrock.",
    "You have your history mixed up. A human hero would never make peace with goblins."
  ],
  "Milton the Miller": [
    "You shouldn't wear your H.A.M. gear when you come in to the mill! Do you want to bring the guards down on us? Put them on when you're in the base.",
    "You don't already know about it? Then no, there isn't. Go away.",
    "You tell me the password, then I let you in. So, what's the password?",
    "Alright, I'll move the crate so you can go down.",
    "Then you don't get in.",
    "Nice try.",
    "I want to let you in...",
    "...but I can't. Sigmund would kill me. Sorry friend.",
    "Oh, hello. What do you want?",
    "What's the password?",
    "Alright, I'll move the crate so you can go down.",
    "Then you don't get in.",
    "Nice try.",
    "I want to let you in...",
    "...but I can't. Sigmund would kill me. Sorry friend."
  ],
  "H.A.M. guard": [
    "Yes?",
    "Can I see your letter of recommendation, please?",
    "We can't just let anyone to interrogate the prisoner, now, can we? We have to do things by a proper procedure. Otherwise, it'll be anarchy, and we'd be no better than the monsters! So, I've set up a system: everyone has to have a letter, signed by Sigmund, saying they're qualified to interrogate prisoners. I've drawn up a rota assigning a different interrogator to each day of the week, using the old Saradominist calendar. You can only come in if you show me the letter corresponding to that day of the week.",
    "Of course I would. That's the system, and that's what I'll do.",
    "I can't just tell you! You have to go through the proper procedure. The interrogation rota is on the noticeboard on the wall outside the prison.",
    "Oh, honestly. Don't you understand the old Saradominist calendar? Today is [answer depends on actual day of week].",
    "What? No, no. I could only let the prisoner go if Sigmund authorised it in writing. That's the system.",
    "Because they're disorganised! They don't follow proper systems! I visited Goblin Village once, and even their generals don't have any proper procedures in place. They don't even have a system for resolving disputes! They disagree all the time, and then they just shout and fight. If they would just put in some systems, some procedures, and then followed them, they'd be able to sort everything out without any trouble. But they just won't follow proper rules and procedures. They won't be neat or organised. So, we have to put a process in place to wipe them all out. It's the only way.",
    "Hey! You can't go in there without a letter from Sigmund!",
    "Why are you carrying more than one letter? Who do you think you are?",
    "Sorry, [name on letter], it's not your turn today; check the rota on the wall.",
    "Ah, yes, [name on letter], you're the interrogator for today. Go on through.",
    "What was that? Was it you?",
    "What are you doing in here?",
    "About time someone did it. Carry on.",
    "Carry on, but be more careful in the future.",
    "Goblin! Why are you out of your cell?"
  ],
  "Grubfoot": [
    "No, no, no, no, no! I told you, I not know things! [Player]? It you?",
    "Please get me out of here, [Player]! Get me out of base, then I go to Dorgesh-city. I be safe there.",
    "How you going to get me out?",
    "Please not be long!",
    "Okay",
    "I hope you know what you're doing.",
    "No, no, no! Not safe there. Generals might sell me back to H.A.M.! I no want to live there anymore. I want to live in Dorgesh-city!",
    "They ask me questions. They say, 'What attacks you goblins planning against human places?' I say, 'We not planning anything.' Because we not! But they say I lying and hurt me. So then I tell them things... I tell them about Chosen Commander and about Yu'biusk and I even... I even tell them about secret temple. But they not care! They say... they say goblin religion stupid and not true! And they hurt me some more. So then I just agree with what they say. Anything they say. I say yes, that true, even though it not. Then they believe me and maybe not hurt me for a bit.",
    "I going to Dorgesh-city again, but when I near Lumbridge, pink-robe people grab me and hit me and put bag on head. I shout for guard to help, but he just laugh and say 'stupid goblin'.",
    "Please not be long!",
    "We nearly there! We need to get through crates then out big door!",
    "Okay.",
    "Oh, no! They found us!",
    "Oh no, no, no, no, no... Quick, [Player]! Let's get out of here!",
    "I cast magic spell; I make guard man not move.",
    "I not know. It something some goblins can just do. Power come from Big High War God, but only priests allowed to use magic, so I hide it and not use.",
    "It forbidden! Only priests allowed to use magic! Big High War God strike me down! But we so close to getting out...I not want to go back. So I use forbidden magic. I a bad goblin.",
    "What happening here? Chosen Commander!",
    "It's holy magic of Big High War God! He give gift of magic for goblin high priests to use!",
    "I show Oldak holy magic of Big High War God. But he say it just like human magic. He say I can do it without Big High War God. He not understand.",
    "It not true! Big High War God give gift of magic!",
    "Big High War God not nonsense!",
    "I like it in Dorgesh-city. Even if Oldak not believe me.",
    "I not worried. Zanik is Chosen Commander. She save Dorgesh-city because Big High War God help her.",
    "This thing that attack, it say it Big High War God, but it want to destroy goblins. That not Big High War God I believe in. Real Big High War God want what best for goblins, so he send Chosen Commander to defend us from false god. Then she lead all goblins to new age.",
    "Thank you, [Player]. You true goblin in heart.",
    "But she trying to save goblin city from false god, so she still Chosen Commander whatever she think. Big High War God work through many people even if they not know him.",
    "You not goblin, so you not understand.",
    "He not understand holy goblin magic. He say it natural effect that I do on my own, but I just little goblin. I not do magic, that silly. It holy power of Big High War God.",
    "Oldak want to know more about holy goblin magic. At first I think it wrong for me to do magic, but then I think, maybe Big High War God want me to show magic to Dorgesh-goblins and that why he let me do it.",
    "Goodbye, [Player].",
    "It not fairy magic, it Big High War God magic!"
  ],
  "Sigmund": [
    "[Player]! I knew you were behind this. You've meddled with my plans for the last time.",
    "Do you take me for a fool? Goblins couldn't organize this attack without help.",
    "Never! You may have foiled my plans, but I can still kill you now.",
    "No! Time for YOU to die!",
    "Curse you, [Player]! You win this time, but we will meet aga- Argh! My hand!",
    "No! Don't kill me! Please!",
    "Just kill me, then. I'd rather die than live in a world overrun by goblins.",
    "Just kill me, then. I'd rather die than live in a world overrun by goblins.",
    "Just kill me, then. I'd rather die than live in a world overrun by goblins."
  ],
  "High Priest": [
    "What this? Pendant of Big High War God?"
  ],
  "Bandos avatar": [
    "You will regret this, cave goblin, but you have already fulfilled your purpose! Now that my pendant is in this world, I no longer need you. Your tribe has hidden from me for too long. I will show you all how I deal with those who defy me!"
  ],
  "[If you don't have a lit lamp] Zanik": [
    "Here take this lamp. [gives you an oil lamp]"
  ],
  "Juna": [
    "Zanik. I must speak with you.",
    "This is no time for trivial conversation. Zanik, your situation is grave. Your actions have put the fate of your people in the balance. Only you can save them now.",
    "Still, you misunderstand. You have strayed from your destiny. You can still take up the mantle of the Chosen Commander and return to your proper path.",
    "It is your destiny.",
    "*sigh* Very well, but I must warn you, the powers that raised you from the dead before will not do so again if you do not do their bidding."
  ],
  "Kazgar": [
    "Zanik?",
    "They said there was an intruder - a giant creature with glowing armour - and then the whole city shook!",
    "B-but you're banished! I'm not meant to let you in! I'm sorry.",
    "I suppose you're right. If anyone can save us, it's you and Zanik. Follow me.",
    "Please don't hurt me! Follow me!"
  ],
  "Cave goblin (randomly chosen)": [
    "Oh, no! Oh, no!"
  ],
  "Cave goblin": [
    "We're all doomed! [...] DOOMED!",
    "Help us, [Player]! You'll save us, won't you?",
    "The gods have returned! All is lost!",
    "Did you see it? The giant in the shining armour? It was huge!",
    "A giant appeared out of thin air! It planted an obelisk in the middle of the city, just north of the market.",
    "I hope so! Please try!",
    "We're all doomed!"
  ],
  "Guard": [
    "Be careful surface-dweller, the city is on high alert.",
    "Imminent attack! A giant appeared through a magical portal and killed three guards. People are saying that the gods have returned and are going to finish us off.",
    "Well, we won't cave in without a fight. Even if it's a whole army of magical giants, I'll die before I leave my post.",
    "Thanks, surface-dweller. We can use all the help we can get.",
    "Zanik! [Player]! Thank the city you're back! Captain Undak wants to talk to you. He's in the middle of the city, north of the market."
  ],
  "Captain Undak (if cutscene watched)": [
    "The scribe gave my a copy of his translation. Here, take a look."
  ],
  "Goblin scribe": [
    "Yes. It says: 'To the goblins of the Dorgeshuun tribe. I, Bandos, the Big High War God, your god, give you this final warning...'",
    "What? I'm busy. No, wait... Maybe you can help me.",
    "I'm making a time capsule. I want to preserve my notes and some artefacts from the city, so that even if we all die there will be some record of us.",
    "It's not just my book! It's a definitive history of the city - a compilation of all the previous histories. I want to preserve it. Will you help me?",
    "Go to Tegdak the archaeologist. He should have some Dorgeshuun artefacts he would want preserved. When you have them, bring them back to me. I should have finished assembling my notes by then.",
    "His house is in the north-east of the city, on the ground floor.",
    "Yes. It's a disturbing ultimatum.",
    "Have you got the box of artefacts from Tegdak yet?",
    "Thank you. There, I've added my notes and sealed the box. You should take it to Mistag. He can find a place to bury it where it will be safe.",
    "He is in the mines to the north of the city. Just head out of the north door and you should see him.",
    "Bring it to me when you have it. I should have my notes in order by then."
  ],
  "Ur-meg": [
    "What can [he/she] do?",
    "You're supposed to be the mighty adventurer! You think of something!",
    "Not that there will be a city for much longer.",
    "What, you think there's a city-sized cavern down here we've just happened not to have noticed? There's nowhere to run to.",
    "I knew this would happen. I tried to warn everyone, but they wouldn't listen.",
    "The...the gods...they've found us.",
    "I'm glad you're trying, but I don't know what you can do.",
    "M-maybe you can pray? The gods work like that, don't they? You pray, then they do things? Maybe you can pray for this one to go away."
  ],
  "Tegdak": [
    "I can't believe it – all this will be gone soon. Maybe in another thousand years, someone will dig up our remains... but it won't be a Dorgeshuun doing the digging.",
    "It doesn't look so likely to me. You can't fight a god. Oh, well, all things come to an end, I suppose.",
    "A box of artefacts? You mean for the time capsule! That's a good idea; maybe the box will survive. At least we can make sure those future archaeologists see our side of the story. Here, I think this is a good selection. Take it back to the scribe."
  ],
  "Mistag": [
    "Thank you for your help in the past, surface-dweller, but all is now lost. We are doomed.",
    "Oh, yes. The scribe mentioned his idea. I suppose it's good that some record of us might survive. I'll have this buried in the deepest part of the mine. Even if all the caves collapse, it should survive... and maybe someday it'll be dug up. Thank you. I think that's all you can do here. Have you spoken to Oldak? If anyone has an idea for how we could survive this, it's him.",
    "We shouldn't lie to ourselves. This is the end of Dorgesh-Kaan."
  ],
  "Oldak": [
    "I'm telling you, it's just a natural effect! It's nothing to do with your god!",
    "Yes! And you don't understand that that's a good thing! It's you who does that magic, Grubfoot, not any god.",
    "But don't you see, Grubfoot? If it's a natural effect we can control, then maybe we can use it to survive the crisis. [Player], I have an idea. It's a long-shot, but it's better than nothing. Will you help me?",
    "[Player]! I thought you knew better than to buy into such superstitious nonsense.",
    "Never mind that now! We can still use it against him! [Player], I have an idea. It's a long-shot, but it's better than nothing. Will you help me?",
    "I suppose it doesn't at this stage. What's important is whether we can use it to survive this crisis. [Player], I have an idea. It's a long-shot, but it's better than nothing. Will you help me?",
    "I think Grubfoot may be half right. The magic he uses is a natural effect, but I think the War God uses a similar natural effect to regenerate. If we combine Grubfoot's magic with our technology, I think we can disrupt his ability to regenerate. I need some components from the power station: a pair of energy projectors and a focusing chamber. Turgall should have some spares if you ask him – bring them to me near the portal to the throne room.",
    "Head out of the south gate of the city and then head east. You won't need to go down to the cavern floor or cross the cavern. Speak to Turgall in the power station. Once you get the parts, meet me by the portal.",
    "Look, Grubfoot. Look at the swirl pattern on the edge of the portal. I'm sure it's similar to the pattern when the fairy rings activate.",
    "Yes, yes, but they must be based on the same principles. Look at the way they... Oh, hello [Player]. Have you got the parts from the power station?",
    "Ah, excellent. Now, I'll attach them to Zanik's crossbow... There. I've given the crossbow a new special attack – when the Bandos avatar starts to regenerate, Zanik should use it. I think that will interfere with the avatar's regeneration. I won't lie to you: this is an untested theory. It might not work at all, but it's worth a shot. Zanik is by the portal, you should give her the crossbow.",
    "What? Oh, yes. First, I'm assuming that this Bandos avatar is powered by magic. Secondly, I'm assuming it's the same kind of magic that Grubfoot uses. That means I know how to disrupt it. I'm also assuming that the avatar will be vulnerable for a short time, just before it regenerates. If you can disrupt its magic at that point, its grip on the possessed body could be broken.",
    "Yes, you're right. Under normal circumstances I'd never try an idea I was this unsure of, but I don't have time to do proper research now, so I have to go by my best guess.",
    "It's worth a short, but I can't say I share your optimism.",
    "That? Oh, that's... not important. I'm not going to learn anything just from looking at the portal, and, one way or another, it'll be gone before I can study it in detail. Old habits die hard, I suppose.",
    "While you were recovering, I did a few experiments with the crossbow. I think it could be useful against other enemies, not just the War God. You should keep hold of it, Zanik.",
    "Listen, [Player], there's something else... The portal to the throne room in Yu'biusk is closed, but I think there may be a way to teleport there, that is if you...",
    "It's the price you pay for being heroes! [Player], talk to me later if you're interested in the throne room.",
    "Listen, [Player], there's something else...",
    "Listen, [Player], there's something else... The portal to the throne room in Yu'biusk is closed, but I think there may be a way to teleport there, that is if you...",
    "It's the price you pay for being heroes! [Player], talk to me later if you're interested in the throne room."
  ],
  "Turgall": [
    "They'll never take the power station.",
    "I've removed some key components. It'll keep working for now, but unless I replace them everything will grind to a halt. This enemy might capture the city, but they'll have no power!",
    "My power station will never fall into enemy hands. Never!",
    "Then there's nothing we can do. All is lost.",
    "Got some plan, has he? It probably won't work, but I suppose it's worth a shot. Here you go."
  ],
  "Ambassador Alvijar": [
    "What do you want? I'm busy!",
    "Getting ready to leave, of course! And if you have any sense you'll do the same. I'm not sticking around in the city when some goblin god destroys it!",
    "Sticks and stones, [laddie/lassie]. As long as I'm alive tomorrow, I don't care what you think of me.",
    "That childminder sent you, did she? I'll tell you the same thing I told her: no! We don't know how far that god of theirs will go. I won't take the risk of it finding cave goblins in Keldagrim and destroying our city too. Go and tell the childminder that we cannot accept a single refugee.",
    "Sticks and stones, [laddie/lassie]. As long as I'm alive tomorrow, I don't care what you think of me."
  ],
  "Mernik (other tasks remaining)": [
    "Thank you. There's nothing more you can do here. You should see if anyone else in the city needs your help."
  ],
  "Bandos Avatar": [
    "So the little goblin hero comes to deliver her tribe's surrender. Perhaps you are worthy to be my Chosen Commander after all.",
    "I am your god! I created you! YOU – WILL – WORSHIP – ME!",
    "You cannot defeat me! I am Bandos, Big High War God!",
    "I am immortal! You may defeat this form, but my pendant will restore it. No mere human or goblin can defeat me.",
    "The goblins are my creations. My PROPERTY! Their only purpose is to serve me! YOU HEAR ME, GOBLIN. I AM YOUR GOD!",
    "You will pay for that!",
    "Before I crush you, I shall explain my plan so that you can marvel at my brilliance. At the end of the Great War, the evil Guthix banished me from Gielinor and I could no longer command my armies. No mortal could have done this to me, only a god. But I was determined to thwart him. The goblins and orks and ogres of this world are rightfully mine and I would not give them up! Without me to lead them, the goblins nearly wiped themselves out, so I sent a vision to stop them, and I told them to wait for my Chosen Commander. Later, when the Dorgeshuun tribe broke back through to the surface, I saw my chance. I used the Tears of Guthix to make Zanik my Chosen Commander. I even raised her from the dead! Her life belongs to me! I led you along with visions and hints about your destiny until you opened a portal to my realm. Then I brought Zanik to my throne room where she could take my pendant of command. Any goblin that wears the pendant comes under my control. I was going to use Zanik to command all my armies, but this priest will do just as well. Once again I will be in direct command of the goblins and all my other races! I will set them against the other races and turn the whole of Gielinor into a monument to my glory!",
    "See how easily I destroy my Chosen Commander! Give up now and I will make your death as swift.",
    "I AM HER GOD! Her life was mine to do with as I pleased! She had no right to live when I decreed she should die!",
    "Pitiful human fool! You have seen me destroy my own Chosen Commander. Do you really think you can defeat me?"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:The_Chosen_Commander?oldid=36196814’"
  ]
}