{
  "Player": [
    "Hello monk.",
    "No, sorry, I don't.",
    "OK old monk, what can I do?",
    "Well, I'll do my best.",
    "How much reward are we talking?",
    "Not now old monk.",
    "Hello again.",
    "Have you any idea where I might find the [colour] cog?",
    "Right, gotcha. I'll do that then.",
    "It won't open. Maybe the monk knows how to open this door?",
    "I've found the white cog! But it's locked behind a gate. There's rats everywhere!",
    "But how do I open the gate? Do you have a key?",
    "I guess I better go and deal with the rat problem...",
    "I've placed a cog!",
    "Two down!",
    "I have replaced all the cogs!"
  ],
  "Brother Kojo": [
    "Hello adventurer. My name is Brother Kojo. Do you happen to know the time?",
    "Exactly! This clock tower has recently broken down, and without it nobody can tell the correct time. I must fix it before the town people become too angry! I don't suppose you could assist me in the repairs? I'll pay you for your help.",
    "Oh, thank you kind sir/madam! In the cellar below, you'll find four cogs. They're too heavy for me, but you should be able to carry them one at a time. I know one goes on each floor... but I can't exactly remember which goes where specifically. Oh well, I'm sure you can figure it out fairly easily.",
    "Thank you again! And remember to be careful, the cellar is full of strange beasts.",
    "Well, I'm only a monk so I'm not exactly rich, but I assure you I will give you a fair reward for the time spent assisting me in repairing the clock.",
    "OK then. Come back and let me know if you change your mind.",
    "Oh hello, are you having trouble? The cogs are in four rooms below us. Place one cog on a pole on each of the four tower levels.",
    "If I knew, I wouldn't ask you to find it. It's in the basement somewhere.",
    "Rats again?! Kill them! Kill them all!",
    "Get rid of the rats! I'm sure I left some rat poison down there!",
    "That's great. Come see me when you've done the other three.",
    "Two to go.",
    "One left.",
    "Really...? Wait, listen! Well done, well done! Yes yes yes, you've done it! You ARE clever! The townsfolk will be able to know the correct time now! Thank you so much for all of your help! And as promised, here is your reward!"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Clock_Tower?oldid=17343845’"
  ]
}