{
  "King Roald": [
    "Well hello there. What do you want? Ah, it's you again. Hello there.",
    "Excellent, excellent. The Kingdom of Misthalin is in your debt.",
    "Of course not; however, if it's rewards you're after, it occurs to me that you could be of even more service to the kingdom...and this time, there's payment in it for you.",
    "Well, you see, because of the mounting threats from Morytania and the Wilderness, the southern kingdoms have banded together to take action. We have constructed a network of beacons that stretch all the way from the source of the River Salve to the northwestern-most edge of the Wilderness. Should there be any threat from these uncivilized lands, we'll be able to spread the word as fast as the light of the flames can travel.",
    "The task itself should be rather straightforward: I need you to help us test the network of beacons to make sure everything is in order, in case the worst should occur.",
    "Excellent! The kingdom of Misthalin is eternally grateful.",
    "Talk to the head fire tender, Blaze Sharpeye - he'll explain everything. He is stationed just south of the Temple of Paterdomus, on the cliffs by the River Salve.",
    "With speed, Player. The security of Misthalin is in your hands.",
    "Then why are you wasting my time? Can you not appreciate that I have a kingdom to run?",
    "Then why are you wasting my time? Can you not appreciate that I have a kingdom to run?",
    "Ah, it's you again. Hello there. So? Are you here to bring me news of the beacons?",
    "Just talk to Blaze Sharpeye, the finest fire tender this side of the River Salve. You'll find him near the Temple of Paterdomus. He'll tell you everything you need to know.",
    "Ah, it's you again. Hello there. So? Are you here to bring me news of the beacons?",
    "Then what are you doing talking to me? Don't you realise the security of Misthalin is at stake?",
    "See that you do, and be quick about it!",
    "Ah, it's you again. Hello there.",
    "Excellent! I'm delighted to hear it.",
    "What happened to the days when adventurers felt rewarded in full by the knowledge of a job well done?",
    "Hmph. Well, I suppose a king must stick to his word. Mind you, let me stress how grateful we are - and how grateful we'd be if you could continue helping us test the beacons. There is much more to be done and this is but a pittance compared to what I'm willing to offer for further assistance!",
    "Of course. What would you like to know?",
    "What *doesn't* need to be done is more like it! We need to make sure the entire beacon network is as robust as possible. I'd be extremely grateful if you'd help us by trying to keep as many beacons alight simultaneously as you possibly can.",
    "Well, obviously, it helps us verify that all the beacons are in good working order, of course. The more testing, the better, Player. I have generous rewards for you if you manage to keep six, ten and all fourteen beacons alight simultaneously. However, I'd be positively delighted if you continued on testing them day and night, over and over, relentlessly and without ceasing!",
    "Oh, it does. The safety of one's kingdom is of paramount importance, you know. Do you have any other question for me, Player?",
    "Ahem, well, it's all well and good having a network of beacons, but it's important to make sure it works properly...and remains working. Thus, I'm willing to offer various rewards if you are willing to help me out. There are rewards available for keeping six, ten and all fourteen beacons alight simultaneously. For keeping six beacons alight, I'm prepared to grant you a ring that will aid you in Firemaking. For keeping ten beacons alight, I will grant you a pair of gloves that will work in combination with the ring. For keeping all fourteen beacons alight, well, I have the magnificent Inferno Adze - a fire-enchanting tool for both Woodcutting and Mining - that I'm prepared to part with. I think you'll find it of great use.",
    "Just light the beacons! If you manage to keep the requisite number alight simultaneously, return to me and I'll have your reward waiting.",
    "Oh, don't you worry about that. I have my eyes and ears. Is there anything else?",
    "You've already had a glimpse of the dangers we face from Morytania. Further dangers threaten from the wilderness in the north. Because of these mounting threats, the southern kingdoms have banded together to take action. We have constructed a network of beacons that stretch all the way from the source of the River Salve to the northwestern-most edge of the Wilderness. Should there be any threat from these uncivilized lands, we'll be able to spread the word as fast as the light of the flames can travel.",
    "Simple. I've equipped each fire tender with a stockpile of gnomish firelighters. In case of a real emergency, the beacons will burn with coloured flame.",
    "Don't bother me with idle chatter. Is there anything else?",
    "These are special recruits from all around the civilized world. They've been carefully selected for their sharp eyes and long-distance vision. Not to mention their dedication and reliability. We couldn't entrust such an important job to anyone, you know?",
    "Then begone; I am a busy man."
  ],
  "PLAYER": [
    "Hello, Your Majesty. I am happy to report that the situation at the Temple of Paterdomus has been sorted. Misthalin's borders should once again be fully protected against the threats from Morytania.",
    "In my debt? Does that mean you're going to give me fabulous rewards for my efforts?",
    "Oh? Tell me more.",
    "So, how could I be of help?",
    "I'd be happy to help.",
    "So, what do I need to do?",
    "Thank you, Your Majesty, I'll seek out Blaze straight away.",
    "Actually, I'm a bit busy right now.",
    "Sorry, not interested. I'm much more interested in receiving rewards than I am in working for them.",
    "Yes, about that: could you remind me where to go and what I need to do?",
    "Okay, thanks.",
    "Hi there! King Roald sent me - he said you could use a bit of help testing out this network of beacons.",
    "So, what exactly is going on?",
    "It sounds like you've already got everything figured out. How do I fit into this?",
    "You mean, you went out and built these huge things without knowing that they'd work?",
    "So, what do you want me to actually do?",
    "You really enjoy your job, don't you?",
    "Does it matter what type of log I use?",
    "Okay.",
    "I haven't got around to it yet.",
    "Uh, right. Will do.",
    "Where is this beacon?",
    "Oh, *that* beacon!",
    "Could you remind me how to light the beacon?",
    "And?",
    "Okay, okay, already! Calm down.",
    "Yes, yes! I get the point.",
    "Well, it's not like it was all that complicated.",
    "Where can I find this beacon?",
    "Okay.",
    "Um, not exactly.",
    "Where is this second beacon?",
    "Thanks!",
    "Well, I've met with Blaze, but we've not finished testing the system.",
    "Sorry; I'll get right back to it.",
    "Hi there. I'm helping Blaze and King Roald test the beacon network. Can you see it from here? Blaze said you have pretty sharp eyes.",
    "Terrific! Blaze has asked me to light this fire as well, so he can see how things look from his vantage point.",
    "How do I light the beacon?",
    "Does it matter what type of logs I use?",
    "I don't suppose you have some logs I could have?",
    "Ah, well, it never hurts to ask.",
    "Okay, thanks.",
    "The beacon is lit!",
    "I will, thanks.",
    "Can you really see it from this far away?",
    "Hmm, yes. The fire is a bit smaller and the logs look rather charred.",
    "Oh, alright then.",
    "Backing away now...",
    "Don't you have logs of your own you can use?",
    "Of course! You can restore a beacon's fire to its full, blazing glory by adding five logs. You can use any type of standard log, but you must use five logs of the same type.",
    "I've added some logs to the beacon; it's now blazing away.",
    "Uh..Blaze?",
    "So, what now?",
    "When's all this to take place?",
    "Not yet, I'm afraid.",
    "I'll get right on that.",
    "More serious testing?",
    "What does that involve?",
    "That sounds like quite a challenge!",
    "Yes?",
    "Ah, but of course.",
    "Of course.",
    "Hi there. How are things going?",
    "So, what now?",
    "Just to let you know, Blaze can see the beacon clearly - all's well.",
    "Well, I haven't exactly filled him in yet.",
    "Yes. I suppose I should pay him a visit.",
    "I'm happy to report that the beacon network seems to be working as expected.",
    "So, about that reward you promised?",
    "Well, before my time, I'm afraid.",
    "I was wondering if you could tell me more about the beacons.",
    "What else needs to be done to test the beacon network?",
    "How does that help?",
    "I see this means a great deal to you.",
    "Tell me about rewards.",
    "How do I claim these rewards?",
    "But how will you know I've kept them lit?",
    "I'd like a few more details, please.",
    "Why have you created all these beacons?",
    "How will these beacons work in an emergency?",
    "I see. I don't suppose you have any extra firelighters lying around that you want to get rid of, do you?",
    "Who are these tire tenders?",
    "I don't have anything more to talk about, actually?"
  ],
  "Blaze Sharpeye": [
    "Indeed? This is excellent news! We desperately need someone to help us out!",
    "Well, King Roald has commissioned these lovely beacons to serve as an early warning system. We'll be able to see their huge, majestic flames from great distances. There are fourteen beacons in total, spanning the south and west borders of the Wilderness.",
    "Well, to test these beacons, we need someone to light a couple of them for us, so that we can determine whether or not they'll actually be visible.",
    "Don't interrupt. Now, yours truly has recruited some of the sharpest eyes this side of the River Salve to look after these beacons and to watch the horizon for signs of danger. In case of emergency, we've got a supply of logs and can start a fire faster than a cat can sneeze. As soon as we spot a threat from the Wilderness or the glow from another beacon, we can light our own beacons and send a warning right across Misthalin, faster than any courier could even run. We've agreed to use gnomish firelighters to colour the flames of our beacons' fires in an actual emergency, so it's safe to test the network with normal fires.",
    "I need you to light a couple of beacons for me to make sure we can see the glow from the flames over the horizon. So! First of all, you need to know how to light a beacon. Our technique is super-secret, but quite effective. All you do is put twenty logs of the same type on a beacon and... SET IT ON FIRE WITH A TINDERBOX!",
    "Yes. Yes I do. Now, why don't you go over there and try lighting that beacon. Show us what you've got.",
    "Good question! Once you become more experienced at tending the beacons, you'll find that higher-level logs burn for a longer time. However for the purpose of this training, it doesn't make any difference at all - you might as well use normal logs.",
    "Hmm. You're talking to me, and yet, the beacon remains unlit. Odd...",
    "Well, hurry, Player. Let the fire of inspiration ignite your soul!",
    "Right in front of you, man/woman! Can you not see that big structure right next to me?",
    "But of course. All you need to do is load up the beacon with twenty logs. It doesn't matter which you use, any standard log will do. Then comes the best part - you take your tinderbox and...and..and...",
    "...AND YOU SET IT ON FIRE! Mwahahahaha!",
    "FIRE!",
    "Ah, I see you've managed to successfully light the beacon and have mastered our super-secret beacon lighting technique. Well done!",
    "Well, apparently, not for someone of your Firemaking caliber and expertise. Now that you've got the hang of things, we can get this show on the road. If you'd be so kind as to light the beacon to the west and report back to me, I can make sure I can clearly see its glow on the horizon.",
    "It's near the limestone quarry, north-east of Varrock, west of the Rag and Bone Man's hovel. My colleague, Squire Fyre, is tending that beacon. She'll help you out if you run into any trouble.",
    "You're back, but I don't see a beacon blazing on the horizon! Did you light it?",
    "It's just west of here, on the mountain near the Rag and Bone Man's encampment.",
    "Ah, Player, you're back! Great news - I can see you've managed to light the beacon over yonder. Many thanks!",
    "Absolutely! I can see a warm, delicious glow on the horizon. If you have sharp eyes and know what to look for, it's trivial. This beacon, however, is struggling at the moment. Do you see how the fire has died down?",
    "If a beacon fire starts to die down, you can restore it to its blazing glory by adding five logs. You wouldn't mind topping this one up for me, would you? Oh, how I would love to see things burn!",
    "More FIRE for ME!",
    "Sadly, I need to keep these reserved for emergency use.",
    "You're talking to me, and yet, that beacon is stilly dying down! What gives?",
    "Beautiful...mesmerizing...",
    "Ah, yes, it's you again. Brilliant work; an incandescent effort.",
    "We're all pretty pleased with the results of the trial run and are gearing up for the more serious testing. There's a lot at stake, so we'll need to test out the entire network as soon as possible.",
    "Imminently, I'm sure - we're just waiting for the word from King Roald. Speaking of which, have you reported back to him about the progress we've made?",
    "Well, what are you waiting for? This is a serious matter! I'm sure King Roald is on the edge of his throne, waiting for the news.",
    "But, of course! We now know that the beacons can be clearly seen from afar, but we still need to test the entire network to see if it works.",
    "Well, it's quite simple. We'll need someone who's motivated, capable and quick-thinking to light each of the fourteen beacons. Only when we've seen all fourteen beacons burning simultaneously will we know that we've succeeded.",
    "Oh, it is! Many of the other beacons are harder to light than these, and some are in some rather dangerous locations. The rewards, however, are great. King Roald is prepared to give generously in return for help and, of course, the most amazing award is...",
    "YOU GET TO SET MORE FIRES!",
    "What are you waiting for? Hurry back to King Roald and tell him that we've completed this first test of the beacon network! Then come back to me and we can talk about... SETTING SOME MORE FIRES! For the safety and security of Misthalin and Asgarnia, of course - it's a noble and selfless cause.",
    "Pretty spectacular, thanks."
  ],
  "Squire Fyre": [
    "Of course I can see it. I haven't spent my entire life practicing my seeing skills for nothing! I'm happy to report that the fire near Blaze is burning brightly.",
    "Be my guest!",
    "Well, remember that there are three things that are needed to start a fire: oxygen, a fuel source and heat. Your aim is to subject a flammable material to enough oxygen and heat to begin the complex chemical reaction that we call combustion. Well, in practical terms, means piling twenty logs of the same type on the beacong and igniting 'em with a tinderbox.",
    "Good question! Once you become more experienced at tending the beacons, you'll find that higher-level logs burn for a longer time. However, for the purpose of this training, it doesn't make any difference at all - you might as well use normal logs.",
    "I'm afraid I don't have any spare; all my logs are for official use only.",
    "And doesn't it look fantastic? Ah, I could gaze into such beautiful flames for hours; too bad I have to keep an eye on the horizon as well. But I'm keeping you too long - you should report back to Blaze to make sure he can see the beacon clearly.",
    "Wonderful news! King Roald must be so pleased.",
    "Oh, but you shouldn't delay! King Roald has so many sleepless nights about the security of Misthalin and he'll be very keen to hear that everything is working smoothly."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:All_Fired_Up?oldid=33539231’"
  ]
}