{
  "Arianwyn": [
    "Player, well met! I have news! The dwarves have cleared the rock-slide in the Corridor of Light. Now we can sneak inside and see what Lord Iorwerth has done to my beloved city.",
    "The Iorwerth clan of elves control what's left of Prifddinas, the elf city. The other seven clans are exiled in the forest. The 'Mourners' in control of West Ardougne are actually Iorwerth-clan elves. They've been using human slave labour to dig for the Temple of Light, which Lord Iorwerth thinks he can use to summon the Dark Lord. You infiltrated the ranks of the Mourners, got into the Temple of Light, and re-activated its defences. That stopped Lord Iorwerth's plan - but the Mourners are still in West Ardougne, and they may have a new plan. You also discovered an ancient corridor between the Temple of Light and the Prifddinas Undercity, but it was blocked with rubble. Now, my dwarven allies have cleared the rubble, so we have a secret route straight into the heart of Iorwerth-controlled Prifddinas. I want us to sneak into the Prifddinas Undercity using the corridor, find out what Lord Iorwerth is planning, and stop him for good. If you want more information, you should speak to Gwir in the next room. She's been making a record of events so far, and I'm sure she'd appreciate your help.",
    "I'll be here when you're ready.",
    "The Prifddinas Undercity will be swarming with Iorwerth soldiers. We'll need to disguise ourselves as Deathguards - or Mourners, as you call them in Ardougne. I still have the Mourner disguise you fetched for me before we visited the Temple of Light, so we just need a set for you.",
    "Mourners regularly walk across the Arandar Pass, to the north of here. Killing one and taking their clothes should be no problem for a hero like you. You'll need six pieces: top, trousers, cloak, gloves, boots, and gas mask. I already have my set, so you just need one for yourself.",
    "I can teleport us straight to the Corridor of Light. Are you ready?",
    "The door to the west leads to the Prifddinas Undercity. Soon we'll see what's become of the Undercity since the Iorwerth drove the other clans out.",
    "You should wear your Mourner disguise. We need to be able to pass for Iorwerth-clan elves.",
    "You should wear your Mourner disguise. We need to be able to pass for Iorwerth-clan elves.",
    "Remember, we're members of the Iorwerth Deathguard - Mourners, you call them. We need to get into the Undercity without breaking cover.",
    "That's blown it! Let's get out of here!",
    "The captain told us to relieve the guards watching the archaeologist. That should give us a chance to see what he's doing.",
    "Those stairs lead to the surface, but we're not done down here yet. Iestin Edern is here in the undercity.",
    "That door leads to the Grand Library of Prifddinas! Lord Iorwerth's plan must have something to do with it. You should speak to Iestin Edern - maybe we'll learn something.",
    "You should do that. I'll stay here and watch Iestin Edern. While you're up there, maybe you can find some information about Lord Iorwerth's plan.",
    "I'll wait here while you take that report to the mayor, up those stairs. While you're up there, see if you can find out what Lord Iorwerth is planning.",
    "Yes, so do I...",
    "Yes, so do I...",
    "I think I know what to do. Player, it's time for you to go back to Ardougne. The humans of West Ardougne are oppressed, but they're not completely broken. With the right prompting, they could overthrow the Deathguard.",
    "I think we can trust you, Iestin. I'll explain everything once Player is on [his/her] way. Player, take the Iorwerth master plan to Bravek the Warder of West Ardougne, and Councillor Halgrive in East Ardougne. Explain it to them like Iestin Edern explained it to us. It's time to start a revolution.",
    "Player, take the Iorwerth master plan to Bravek the Warder of West Ardougne, and Councillor Halgrive in East Ardougne. Explain it to them like Iestin Edern explained it to us. It's time to start a revolution.",
    "You did it, Player! The Mourners are in full-scale retreat from West Ardougne!",
    "There's only one way to stop him, and that's to re-grow the city before he does.",
    "Lord Iorwerth's Prifddinas would be dominated by the Iorwerth clan. Elves of other clans would be second-class citizens at best, and he could use the city as a base from which to conquer the human lands. If we were to re-grow the city first, using the power of the eight clans rather than the power of the Dark Lord, the city would be under our control. We could make it into its old self - a city shared between the eight clans.",
    "Even the legends are vague. The Dark Lord is the ultimate evil, a bogeyman to scare children with.",
    "This speculation is wasting time. Whatever the Dark Lord is, it's Lord Iorwerth's ally, which means it's our enemy. That's all we need to know.",
    "I am. I vowed not to use my title until I had led my clan out of exile and back into Prifddinas. With your help, that day is close at hand.",
    "You should go back to Lletya. Gwir the scribe will be able to help you find the six remaining elders. You should speak to her next. I can teleport you between here and Lletya. Are you ready to go now?",
    "You need to find all six clan leaders so we can re-grow Prifddinas, before Lord Iorwerth finds another way to call on the Dark Lord. You should speak to Gwir in Lletya.",
    "I can teleport us back to the Undercity as soon as you're ready.",
    "You did it, Player! I never thought I'd see all the elders together again.",
    "Unless they're already occupied! The remnant of King Tyras's army is still facing off against Lord Iorwerth's war-camp. The two forces are too evenly matched for either one to risk an attack. If you were to convince General Hining in the Tyras camp to attack now, it would keep Lord Iorwerth and his forces occupied while we re-grow the city and defeat Lord Iorwerth for good!",
    "Go to the Tyras Camp and convince General Hining to attack Lord Iorwerth now. That will keep Lord Iorwerth occupied so we can re-grow the city.",
    "It's time, Player!",
    "...And then Lord Iorwerth will return to find a city that we control! Come on, Player! Enter the Grand Library and let's finish this!",
    "This is it! The Grand Library!",
    "All you need to do now is direct the light from each clan seal into the Seal of Seren. Start with the Cadarn seal. You should interact with the plinths in order to create mirrors on them to re-direct the beam. When you're ready, activate the Cadarn seal and I'll sing into it to create the beam.",
    "I'm ready, Player! Activate the seal and I'll sing to create the light beam.",
    "What's happening? What are those creatures?",
    "This doesn't change what you have to do, Player. Direct the beam from the Trahaearn seal into the Seal of Seren.",
    "What is that?",
    "It looks like you'll need to defeat that Greater Shadow before you can direct the light beam from the Iorwerth seal to the Seal of Seren.",
    "You did it, Player! The Dark Lord is dead!",
    "This room will be the foundation of a new Prifddinas: but this time, it'll be different... For all of its history, Prifddinas has been closed to outsiders. Elves regarded other races as inferior barbarians. Even when we were exiled from the city, the rebel elves didn't think about the humans beyond the mountains. We heard what the Deathguard was doing in West Ardougne, but we only cared about our own city. But when you emerged from the Underground Pass, we saw that a human adventurer could be more resourceful than the greatest of elves. If you hadn't helped us, the Dark Lord would have created an evil Prifddinas and doomed the elves to live under Lord Iorwerth's rule. I've talked to the other clan leaders and we're unanimous: Prifddinas will no longer be a city only for elves. Once it's re-grown, we'll throw the doors open to other races. This is the end of an epic adventure for you, and the start of a new age for both elves and humans. I'll see you in Prifddinas soon, Player.",
    "I've got fifteen items to give you as a reward. Would you like me to take some items to your bank for you so you can free up space?",
    "You did it, Player! The process of re-growing the city has started. Soon the crater will be filled with the new city of Prifddinas, and humans will be able to visit.",
    "You are just in time, my friend. Come, see the fruits of your labours.",
    "Welcome to Prifddinas, lost city of the elves."
  ],
  "Dwarf": [
    "While I was clearing the rubble, I found a dead elf with a document on him. Would you like it?",
    "This elven architecture ain't like anything a dwarf would make. Now that I've cleared the rubble, I'm going to take a look at it before I go back to Keldagrim."
  ],
  "Deathguard captain": [
    "You! What were you doing in the store room? Honestly, I think every batch of new recruits the mayor sends me is stupider than the last. I'm up to my ear-points in paperwork and I do not have time to babysit you. Don't. Wander. Off. So? Don't just stand there gawping. What were you doing in the store room?",
    "Yes, the store room. We told you when you joined the Deathguard that the door to the Temple of Light is blocked, so that room is a dead end. What were you doing in there?",
    "There must be a fault with your mask, soldier. Your voice is so muffled that it sounded like you were talking back to me! Take your mask off and say that again!",
    "Of course there are going to be mice. Why does that justify leaving your post without permission?",
    "SORRY? You're a soldier in the Iorwerth Deathguard. You're trained to stand proud, not grovel like a... Like a... Take off your mask! Prove to me that you're an elf!",
    "That's the first sensible thing you've said. I'll let you off this time, but don't go wandering into the store room again. Maybe some time watching that tedious archaeologist will teach you your lesson. You two can relieve the guards in the next room. Once you've relieved the guards, tell Iestin Edern to hurry! Lord Iorwerth's plan is waiting for him."
  ],
  "Deathguard Captain": [
    "If you thought it would be a problem, why didn't you tell me?"
  ],
  "Mourner": [
    "Hey! We're guarding the archaeologist. Talk to us, not him.",
    "You're here to relieve us? About time. This intellectual was boring us to death.",
    "Keep back, everyone! This food is for the mayor, not for general consumption!",
    "Really? Well, if you say so. I'll sleep easier tonight knowing these people got something to eat.",
    "A human? Well I don't know how you got in here, but you might as well go out the same way. There's nothing of value here.",
    "You should return to the mayor and tell her we'll distribute the food, as ordered.",
    "Don't you have anything to do down in the Undercity?",
    "A human? Well I don't know how you got in here, but you might as well go out the same way. There's nothing of value here."
  ],
  "Iestin Edern": [
    "More new guards? If you have to be here, please keep quiet - I can't concentrate with guards peering over my shoulder.",
    "Weren't you told anything? I thought Deathguards at least knew the basics. Through that door is the Grand Library. The city of Prifddinas - the real one, not the temporary camp up those stairs - is stored in the Grand Library in the form of a giant crystal seed. Lord Iorwerth asked me to find a way to re-grow the city without the other seven leaders. He says he'll provide a source of magical power, and he wants me to prepare the crystal to receive that power.",
    "I gather it's something to do with what the Deathguard are doing in the human city of Ardougne. I've heard the phrase 'Dark Lord' in connection with it, but I don't know what that means.",
    "They're still there - encoded in the crystal! When the city is re-grown, they'll wake up as if nothing happened. I don't know what Lord Iorwerth plans to do about the non-Iorwerth elves. I imagine they'll be given a chance to join the Iorwerth clan.",
    "I'd be able to work faster if I knew what Lord Iorwerth's plan was. How can I work if I don't know how my work will fit into the overall plan? I'm sorry. I know it's not your fault. You probably know less than I do. Look, if you want to speed things up a little, could one of you take my latest report to the mayor of Prifddinas?",
    "The stairs in this room lead to Prifddinas.",
    "You should take the report to the mayor of Prifddinas. You should go up the stairs in this room and find the mayor in her office.",
    "Please keep out of the Grand Library. My work involves some delicate magic and I don't want it to be disrupted.",
    "I wish I knew what Lord Iorwerth's plan was.",
    "I wish I knew what Lord Iorwerth's plan was.",
    "The Iorwerth master plan! How did you convince the mayor to... No, don't answer that. Let me read it first.",
    "Let's see... 'large-scale conversion of quasi-elf resources into necromantic power'. That means... Lord Iorwerth is planning to murder the whole population of West Ardougne! He was right to keep it from me. If I'd known what he was planning, I wouldn't have helped. Humans are lesser creatures but that doesn't mean they have no rights at all.",
    "It's in the plan: 'large-scale conversion of quasi-elf resources into necromantic power'. 'Quasi-elf' is our technical term for humans. They look mostly like elves, but they aren't. 'Quasi-elf resources' are the humans that the Deathguard are controlling in West Ardougne. Converting them into necromantic power - that means killing them all in a magical ritual.",
    "Lord Iorwerth wants to summon the 'Dark Lord' in order to use its power to re-grow Prifddinas. I don't know what the Dark Lord is, but I gather it's associated with death, and with the Temple of Light. Lord Iorwerth's initial plan was to summon the Dark Lord using the Temple of Light, but he had to abandon that plan when the temple's defences started working again. It looks like he's now abandoned the Temple of Light plan and is going to summon the Dark Lord using its association with death - by killing a large number of humans.",
    "I don't know. I can stall him for a while, but sooner or later he'll replace me with someone more compliant.",
    "Wait...who are you two? You're not Deathguards...",
    "Yes, you've stopped Lord Iorwerth for now...but sooner or later he'll find another way to call on the Dark Lord's power.",
    "Whoever grows the city, controls the city.",
    "All I know is that it's a source of great magical power, and it's associated with death, and with the Temple of Light. Everything else I've heard is an unsubstantiated legend.",
    "When humans first heard about the Dark Lord, they assumed it was an elven way of talking about Zamorak - the ultimate evil of their mythology - but there's no evidence that they're the same being.",
    "We need you to find the leaders of the eight elven clans. Obviously we can't expect Lord Iorwerth to help with this, but I know enough about the magic required to take his place. We also already have Lord Cadarn. That leaves six to find.",
    "It's a historic occasion, but let's not celebrate yet. There's another thing you'll need to do before we re-grow the city. For now my magic is able to keep us hidden from the Deathguard. Anyone who looks into this room will just see me at my desk... Once we start to re-grow the city, though, I won't be able to hide us any more. Lord Iorwerth's army will rush in and overwhelm us. Unless...",
    "Lord Iorwerth has called the Deathguard away to fight General Hining. We should be able to re-grow the city undisturbed.",
    "A library is a store of information, not necessarily a store of books. This library stores the most precious information there is - the city of Prifddinas and its inhabitants, encoded as patterns in the crystal. When we have powered the crystal with the light of the eight clans, the city will grow according to that pattern.",
    "They're shadow creatures, like the ones in the Temple of Light - but these ones aren't bothering to hide flat on the ground. It looks like some force is opposing us.",
    "I fear so! You prevented Lord Iorwerth from summoning it fully - but it seems it still has enough power to oppose us!",
    "My guess is that the shadows infesting the Temple of Light were the least powerful of the Dark Lord's minions, and that's one of the more powerful ones.",
    "You're doing well, Player. Activate the Iorwerth seal when you're ready.",
    "You've empowered the Seal of Seren. The clan leaders can sing the city into shape as it grows.",
    "Lord Iorwerth's reign is over at last! Now my clan can take its proper place as one of eight equal parts of the new city.",
    "It's too dangerous to enter while the city is re-growing. You should come back later.",
    "Our period of mourning is over. We are as one again, thanks to you."
  ],
  "Mayor of Prifddinas": [
    "Good day, soldier! Have you got something for me? Whatever it is, it can't be more boring than this latest draft of Lord Iorwerth's master plan. You should be grateful it's above your clearance level so you don't have to read it.",
    "Oh, yes. I know there's a rumour that his plan failed when the Temple of Light's defences came back on, but it was only a minor setback. The details of his new plan are right here on my desk. I'm the only civilian who's allowed to read it. It's being kept strictly secret - if it were to fall into our enemies' hands, it could be disastrous!",
    "Another one? Let me guess - he's complaining about not being able to see the master plan. He should count himself lucky he doesn't have to read Lord Iorwerth's tedious writing! Anyway, he's too much of a risk. These intellectuals are always putting their own crazy ideas over loyalty to the clan. If he saw the master plan, he might refuse to help, and then where would we be? This report should keep me busy until my lunch arrives. I'm expecting a shipment of gnomish foods from Arposandra. I simply can't subsist on the same muck the common people have to eat, you know? If you want to be useful, you could go and check up on it for me. I don't want to have to go and check on it myself.",
    "Human! I don't know how you got into Prifiddinas, but you won't get any further! You'll never defeat the Iorwerth!",
    "Naughty Deathguard! You know you're not allowed to touch that.",
    "Human! I don't know how you got into Prifiddinas, but you won't get any further! You'll never defeat the Iorwerth!",
    "I hope my gnomish food arrives soon. I don't want to have to go and check on it myself.",
    "What? This is unacceptable! That food is mine! The common elves have no right to touch it. Stay here and guard the master plan on my desk. I'm going to go and deal with this outrage.",
    "That food is mine! Keep your hands off it!"
  ],
  "Starving elf": [
    "Please...we're starving. Why should the mayor get gnomish delicacies when we get barely anything?",
    "Give it to us! We're starving!",
    "Praise Seren for the mayor! I've never eaten food this good before!"
  ],
  "The document is long and obscure, but you notice a prominent phrase": [
    "'large-scale conversion of quasi-elf resources into necromantic power'."
  ],
  "Bravek": [
    "Who...? Oh yes, I remember you. You got me a hangover cure once. What can I do for you now?",
    "So that's what's going on. Elves faking a plague to get human slaves, King Lathas in league with them. And now they're going to round everyone up and murder them as soon as their magic crystal thing is ready. Gods. I suspected there was more to the plague than the official story, but this is worse than I could have imagined.",
    "A plague with no symptoms, besides what you'd expect from people starving in a slum? Doctors who never show their faces? People who vanish, and we only have the doctors' word they died of plague? I'm sure it all looks convincing from outside the wall, but in here...of course I'd suspected.",
    "What could I do? People who ask questions always seem to be next to die of plague. It's best not to even think about it. Once you've had a few drinks you can believe that the plague is real and the Mourners are here to make us all better.",
    "I'm not the person you need to help you. If I had the strength of character to stand up to the Mourners then King Lathas wouldn't have let me stay in this position. Not to mention that people will probably see me as a collaborator. As far as the population is concerned, I might as well be wearing a plague mask. But...let me give you a list of names. I'm not the sort to start a revolution, but if I were...these are the people I'd get on my side first.",
    "Good luck, adventurer. I'm glad someone's got the guts to do what you're doing.",
    "Thanks for all your help, adventurer.",
    "It's so much easier to administrate a city when there's no fake plague and people are allowed in and out. And do you know what? I'm off the drink. I'm going to be sober from now on. No more hangovers, no more strange hangover cures!"
  ],
  "Elena": [
    "I know it's you, Player, but please take off that Mourner gear if you want to talk to me.",
    "Hello, Player. Have you discovered any more about what the Mourners are up to?",
    "It feels like years since you snuck in to West Ardougne to rescue me. Your quest has been larger than I could have imagined. I'll sneak in to West Ardougne and meet you in the church. Find me there and we can finish what we started all those years ago.",
    "It's time you gave these people some answers, Player.",
    "He would! We've got to strike now to stop him!",
    "Come on! To the Mourner HQ!",
    "There are still Mourners in the basement! Get them, Player!",
    "We did it! We're in control of the Mourner HQ! I made a flag, but I think you should be the one to hang it on the roof.",
    "Hang the flag from the roof of this building to show everyone we're in control!",
    "Hang the flag from the roof of this building to show everyone we're in control!",
    "You should get to Ardougne Castle!",
    "It's hard to believe it's all over, Player! Now that the Mourners are gone from West Ardougne, I'm going to focus on my studies. I think I'll travel to the elven lands and meet your new friends. I suspect they have an understanding of the sciences that is quite different from ours - perhaps I can learn from them."
  ],
  "Player": [
    "Yes - and it's time to stop them.",
    "Hello.",
    "Good day.",
    "Hello.",
    "Sorry.",
    "Hello.",
    "Hello there. Have you heard the truth about your sheep?",
    "Oh, it's you. I didn't recognise you there.",
    "Emissary of peace? What?",
    "Oh, of course. Well it's a long story. I'm sure Essyllt can tell you some other time.",
    "Hah! Wow, that's a good one. I'm glad I let you live just for that!",
    "I remember his plan. Had I not stopped him, this 'emissary of peace' would have wiped out the entire population of West Ardougne by herding them into a cavern and collapsing the roof!",
    "You said you had children. Where are they?",
    "I've been all around Prifddinas, and I'm yet to encounter elves with those names.",
    "Didn't you say Aeronwen before?",
    "Essyllt... I remember that name. Yes, the Head Mourner. I was the one who killed him.",
    "He was no emissary of peace. He planned to wipe out the entire population of Ardougne in order to regrow a corrupt version of Prifddinas.",
    "There was no way I could allow him to live after that.",
    "I'm sorry for your loss, I'll leave you alone."
  ],
  "Koftik": [
    "Hello adventurer. How's things?",
    "So your trip through the Underground Pass has led you back to this? I knew the plague was a hoax, and a hoax like that can't last forever. If there's going to be a revolution, I want to be on the right side of it. You can count me in.",
    "Surely even King Lathas wouldn't allow that?",
    "Death to the Dark Elves!",
    "Underground Pass tours! Solve fiendish puzzles beneath the mountains! See Iban's throne room! Oh, hello, Player. Now that the Dark Lord is defeated, I'm trying to turn my cave guide skills into a new business. I haven't found anyone interested yet, though."
  ],
  "Martha Rehnison": [
    "How dare you come in here? Get out of my house!",
    "You're not leaving me out of this! You can take care of your sister, can't you, Billy?",
    "Let's go, then. Player, we'll see you in the church.",
    "Elves?",
    "Thank you for your help, Player! West Ardougne is free at last, and it's thanks to you!"
  ],
  "Ted Rehnison": [
    "It'll be a good day when you Mourners leave, not until then.",
    "Hello again, Player.",
    "About time! Martha! Stay here and look after the children...",
    "The king? I had no idea!",
    "I'm glad I could play a part in overthrowing the mourners. Billy and Milli are already asking for stories about what their parents did in the revolution!"
  ],
  "Billy Rehnison": [
    "Yes, ma!",
    "My dad says that when he kicked the Mourners out of the city, you helped! Thanks!"
  ],
  "Nurse Sarah": [
    "If you Mourners are the doctors you say you are, I'd like some more help in the hospital.",
    "Hello, my dear. How are you feeling?",
    "So it's finally happening? The Mourners are the only disease in this city - it's time to eradicate them. I'll meet you in the church.",
    "I knew it!",
    "So that's why they never take off their masks!",
    "The plague itself was a fake, but the image of West Ardougne as a plague city wasn't too far from the truth. Malnutrition, poor sanitation... it's no wonder these people aren't healthy. Now that we can get in and out again, people are getting healthier, but it'll be a long time before West Ardougne is really a nice place to live."
  ],
  "Jethick": [
    "Leave me alone, Mourner. I'm not sick.",
    "Hello. We don't get many newcomers around here.",
    "That's the first sensible thing anyone's said in a long time. I'll meet you in the church.",
    "I did! Didn't I tell you all? Old King Ulthas would never have let this happen.",
    "Hello. I've been seeing more newcomers around here since the revolution. I don't miss the plague... but it would be good to have more peace and quiet."
  ],
  "Carla": [
    "Haven't you people done enough to my family? Leave me to grieve over my son on my own.",
    "That's not going to bring him back, is it?",
    "My son fell ill with the plague... The Mourners came and whisked him away. He didn't even seem ill...but the mourners said that he was infected and had to be taken away. Two days later the Mourners returned and told me he had died.",
    "So it's true? They killed him? You can count on me. I'll meet you in the church.",
    "*gasp*!",
    "Vengeance for the plague victims!",
    "Nothing's going to bring my son back... but at least now the Mourners are gone, it won't happen to anyone else. Now I can mourn him properly."
  ],
  "Councillor Halgrive": [
    "Hello again, adventurer! What can I do for you today?",
    "This is amazing! I had no idea. If anyone else showed me this I'd dismiss it as a joke, but I know your reputation. When it comes to your adventures, nothing is too strange to be believable. If this is correct, King Lathas is in league with the Mourners. If I were to go to his people, at best I'd be stonewalled and at worst I'd find myself in West Ardougne being diagnosed with plague. I think I can get the army to support your revolution, but not until you're already in control of West Ardougne. Take this proclamation. It'll do no good against the Mourners, but when the king's army arrives, show it to them.",
    "I'm sorry I can't give you more immediate help, adventurer. You should keep that proclamation for when you confront the army.",
    "You should get to Ardougne Castle!",
    "You've done all you can in Ardougne, adventurer. You should probably return to the elven lands.",
    "All is well, adventurer! It's good to have the city running smoothly again after all the disruptions the fake plague caused."
  ],
  "[Revolutionary]": [
    "We need more people before we start the revolution. You should speak to everyone on Bravek's list and then come back here.",
    "We're all here. Are you ready to tell us what's going on?",
    "We're ready! Kick down that door!"
  ],
  "Head Mourner": [
    "Please have mercy! I have a wife and children back in Prifddinas!",
    "I'll tell you anything!",
    "Oh, he's dead. He was too much of a risk to keep, so we gave him some poisoned toad crunchies. Wait, how did you know there was a gnome here? Unless... You were that new recruit! I thought I recognized your voice! You could have convinced me to release him, but you didn't! You're no better than me! Please, let me go!",
    "Oh, a new Mourner recruit convinced me to let him go. He was blindfolded coming in and out, so he can't lead anyone back here. Wait, how did you know there was a gnome here? Unless... You were that new recruit! I thought I recognized your voice! See? I can be merciful! Please, show me the same mercy!",
    "We were going to find the Temple of Light and corrupt it, to summon the Dark Lord...but when the Temple's defences came online, that became impossible. Lord Iorwerth's new command was that we should prepare to kill the entire population of West Ardougne in one event. He left its execution to my discretion. My plan was to herd everyone into a cavern and then collapse the roof. It would have been quick - merciful. I was only following orders!",
    "I don't know! I was just following orders. Only the most senior people knew - Lord Iorwerth, and maybe King Lathas.",
    "Please, have mercy!",
    "Thank you! I promise you'll never see me again!",
    "Noooo!"
  ],
  "Sir Hugo": [
    "You up there!",
    "King Lathas commands that you leave the building and submit to his authority!",
    "What are you talking about? The Council has no right to countermand the king. This proclamation changes nothing!",
    "No! The king rules by divine right!",
    "You're going back to start a coup, you mean! The Paladins will defend the king!",
    "King Lathas told me what you did to his brother. Prepare to die! King Lathas rules by divine right. A common adventurer like you has no business questioning him. Saradomin will guide my hand as I separate your head from your body!"
  ],
  "Sir Edmond": [
    "You are illegally occupying that building!",
    "Leave peacefully now and you will find us merciful. Remain inside and we will have no option but to slay you as enemies of Ardougne!",
    "Councillor Halgrive's seal! You up there! Stay where you are and don't cause any more trouble. We must go back to the council and discuss how to deal with this situation.",
    "Ardougne has a constitution! The king rules with the approval of the Council!",
    "I must go back to the castle to speak to the Knights of Ardougne. We will not be commanded by a despot!",
    "Adventurer! Councillor Halgrive told us what King Lathas and the elves are really doing in West Ardougne. Now we're fighting for control of the castle! The Knights of Ardougne and the Order of Heroes are loyal to Councillor Halgrive, but the paladins and warrior women are fighting for King Lathas. I think King Lathas knows he's going to lose the battle, and he's going to try to escape. If you want him to face justice, we'll need to get to his throne room. Are you ready?",
    "You let him go! After what he was doing in West Ardougne, I don't know if you should have done that...but I don't think I'd have had the guts to kill a king, either.",
    "You killed him! After what he was doing in West Ardougne, I can't blame you, but even so... I don't think I'd have had the guts to kill a king.",
    "I'll take things from here. I'll make sure we clear the Mourners out of West Ardougne. The next in line to the throne is Lathas's cousin Thoros, so I'll make sure he's installed. You should return to your elf friends wherever you last saw them."
  ],
  "King Lathas": [
    "Sir Hugo, protect me!",
    "Traitor! I trusted you! I won't debase myself by begging for mercy. Do what you will.",
    "Ask your questions.",
    "It was a simple alliance of monarchs. I would help Lord Iorwerth defeat the other elven clans by summoning the Dark Lord, and he would help me get rid of Tyras and conquer Camelot. My father, King Ulthas, ruled all of Kandarin - including Camelot, and both halves of the city of Ardougne. I am his eldest son - all of Kandarin should have been my birthright. Then another so-called king, Arthur, arrived out of nowhere, with his knights and their round table. He claimed to be from another world but I don't believe that. My father kicked the Sinclairs - good, loyal subjects - out of their castle, and gave it to this new king. Not only that - he then declared that the kingdom should be split between me and my idiot younger brother, Tyras. I could not stand by and let the kingdom be fragmented. When I ascended to my half-throne, I made it my mission to unify my father's kingdom under my rule. Lord Iorwerth promised to help me with that.",
    "They were going to kill everyone in West Ardougne? Oh no! I had no idea! Please, spare my life.",
    "All right, I did know. It was a blessing! The end of the tedious plague hoax, and a way to get rid of some useless excess population. I was going to remake West Ardougne as a grand formal garden for the use of myself and my court! Much better than the eyesore it is now.",
    "You know, I used to assume it was Zamorak, but I don't even know any more. What do I care? As long as it helps Lord Iorwerth, and he helps me, it could be anyone at all.",
    "So, I'm at your mercy, traitor. What is to be my fate?",
    "Very well. Since you are magnanimous in victory, I will be gracious in defeat. You will never see me again.",
    "So dies the last true king in Gielinor."
  ],
  "Gwir": [
    "Player! Great to see you.",
    "You're going to find the lost elders? If you were anyone else, I'd say it was impossible, but you might have a chance... There's a book on the bookcase here with clues to where they went. Once you've read the book, you should talk to me again so I can explain the riddle to you. I have some items I think you'll need.",
    "Player! Great to see you.",
    "I see you've got the book. I don't know exactly where the elders are, but I can help you interpret the riddle. Which part would you like me to explain?",
    "'Lady Trahaearn journeyed south from the well.' The Trahaearn clan are masters of mining and smithing. You'll likely need to use one of those skills in order to follow Lady Trahaearn's footsteps. Also, I don't expect that well is an ordinary well. Is there an important well you've encountered on your journey to these lands?",
    "'Lord Crwys's brothers call to him when they are wounded.' The Crwys clan are experts in farming and woodcutting. Lord Crwys had a magical connection with trees - he would even say that trees were his brothers.",
    "'Lady Ithell put her soul into her greatest work.' Lady Ithell was the architect of Lletya. She considered it her greatest work, as it captured some of the beauty of Prifddinas without using any of Seren's crystals. Sadly, I don't think you'll find Lady Ithell. She passed away shortly after finishing work on Lletya.",
    "'Lord Amlodd sleeps the sleep of the uncalled.' I have something of Lord Amlodd's - a summoning charm. I don't know what he meant it to be used for, but you might be able to use it.",
    "'Lady Hefin walked westward on the water.' The Hefin are the most spiritual of the clans. There are some legends of holy people walking on water, but I don't know if Lady Hefin was quite that holy. It might not have been just any water, though. 'The water' is an old name for the marsh to the south-west of Lletya, from before it became known as the Poison Waste.",
    "'Lady Meilyr brewed a map in the dungeon of the kin.' I'm not aware of Lady Meilyr ever making a map, and I don't know where the 'dungeon of the kin' might be. I don't think it's anything in elven lands, but it could be something you've heard of further away. I do have a potion recipe that Lady Meilyr left, though. You might find it useful, even if it isn't a map.",
    "Lord Cadarn was the only leader not to go into hiding. You've met him - he's Arianwyn. He vowed not to use his proper title until the clans were re-united in the reborn Prifddinas. As for Lord Iorwerth, he's the one that the other clan leaders were hiding from. You're not going to get him on your side, but perhaps an ally in the Prifddinas Undercity will stand in for him."
  ],
  "Lady Trahaearn": [
    "Who...disturbs...my slumber? A human? No no no no no. Let me sleep. I must wait for an elf to tell me that the crystal city is reborn.",
    "Hmmm... So it was. I can see where you repaired it. I must have slept for longer than I expected, if my exoskeleton was starting to fail. Thank you for repairing it. Most Trahaearn-clan elves would have struggled to understand the mechanism. You are a remarkable human.",
    "What an impertinent question. Of course not. And it's very rude to ask a lady's vital status, young [man/woman]. When age caused my body to fail, I augmented it with this machine. I am alive as you, and I plan on staying that way for as long as I can.",
    "My body was already sustained by my exoskeleton. It was a simple task to modify it so that it suspended my life processes until someone found me.",
    "Ah! Times have changed indeed if a human is working with the elves! I have waited a long time to take my place in the Grand Library and re-grow the city. Let's hope my machine has preserved my singing voice. I'll make my own way to the Prifddinas Undercity and meet you there.",
    "Yes? I hope you're hurrying. This exoskeleton won't sustain me forever.",
    "Come on, we haven't got all day. Arrange the mirrors correctly and then activate the seal.",
    "Have some patience. The city will be grown soon.",
    "Yes, yes. Hurry along! Our you'll miss seeing the Tower of Voices growing!"
  ],
  "Lord Crwys": [
    "Ahhh...my sap runs faster...I am an elf again. Are you a servant of the other clans? Is it time to grow the crystal boughs of Prifddinas again?",
    "It is a deep magic. To be...a tree... Not to change...but to recognize that the tree was always within...that elf and tree are one.",
    "To outlast the wrath of Lord Iorwerth. He sought to fell me, so I hid among my brothers...slowed my perceptions to match theirs...and waited.",
    "A strange contagion. The gnomes have polluted the wasteland with their substances, but it is more than that. There is a darkness...an insidious rot that reaches insubstantially from the mountains. I believe it is what some have called...the Dark Lord.",
    "Ahhh...the forest of living crystal.... How I have longed to see it stand once more beside the forest of wood. I will uproot myself, and meet you in the Prifddinas Undercity.",
    "The roots call to me.... They wish the city reborn.",
    "You lie! It was Seren who brought us to this world!",
    "Let us finish this and re-grow the grand city. Activate my seal and I will sing the last light beam.",
    "Ahh. I feel it growing...mighty crystal roots.",
    "Thanks to you, I can plant down some roots again. See you in the city!"
  ],
  "Symbols found": [
    "[number]/5.",
    "5/5."
  ],
  "Kelyn": [
    "That's...that's...I've never seen her before, but I recognize[sic] her. Human! I'm up on the balcony! Come and talk to me!",
    "That statue... Looking at it, I feel something.... Like new memories are entering my mind... The crystal spires...the delicate harmonies...the recreation of those harmonies in wood! I see how she did it now. I have her knowledge...I am Lady Ithell!",
    "The riddle was literally true - Lady Ithell put her soul into her greatest work. She took part of her soul - the essential truths about who she was, and what made her Lady Ithell - and encoded them in the statue plans you found around Lletya. I'm a member of Clan Ithell, with a love of architecture. When I saw the statue, that soul spoke to me...I mean, spoke in the same way a work of art speaks to someone who looks at it. I gained the essential knowledge of the leader of Clan Ithell. I am the new Lady Ithell - I could sing her part of the city into shape!",
    "I'm still Kelyn. I'm not possessed - my memories haven't been changed. But I have some new knowledge as well - some abilities that the old Lady Ithell encoded into her statue plans - the knowledge I need to be the new Lady Ithell.",
    "I must have walked past those plans on the walls every day for years, and never noticed them. Sometimes it takes an outsider's eye to see details. Even if I had...I'm not sure I could have built the statue like you could. It took a master of construction to properly express all the details that made up Lady Ithell's soul.",
    "Time to rebuild Prifddinas! To sing the crystal city into its proper, beautiful form! I'll make my way to the Prifddinas Undercity and meet you there."
  ],
  "Lord Amlodd": [
    "What - oh! - I'm back? *ahem* Behold, the great Lord Amlodd! Returned, from the plane of spirits! You, mighty summoner, have called me back!",
    "Oh ho ho! I'd like to see you try! Your mastery of summoning surpasses most mortals' - but it does not approach the might of Lord Amlodd, Master of the clan of summoners, most summony of all elves! Summony? No, that doesn't quite work. Pretend I said something clever there.",
    "Ah, the Spirit Plane! The plane of pure animal forms of which this world's creatures are mere shadows! How I will miss roaming the timeless fields, meeting all of my animal brothers and sisters! I wonder if they will miss me, now I am back in the solid world.",
    "You adventurers see summoning only as a practical art - a way to call creatures from the Spirit Plane... I spent long years meditating, until at last I understood the Spirit Plane more deeply - took its power into myself - became a creature of the Spirit Plane. I belong there as much as here. When Lord Iorwerth hunted for the elders, it was a simple ritual to send me to my adopted home, safe from both his search and the ravages of time!",
    "At last! Summoned back, so that I can summon my home - the mighty city of Prifddinas - more beautiful even than the Spirit Plane! I will meet you in the Undercity!",
    "The city calls to me! Soon I will summon it back from its seed!",
    "You did it! The light harms it!",
    "Ho ho! Activate the seal and I will show you that Lord Amlodd has the greatest singing voice of all the elves!",
    "Soon the city will be re-grown, and I will share with my clanmates the knowledge I have gained in the Spirit Plane!",
    "Now this was truly worth coming back for! Well done, human."
  ],
  "Elf hermit": [
    "Your exploration has led you to a dead end, human. There is no one here but a simple hermit.",
    "I am lady of nothing but this hovel.",
    "Do you really? Are you prepared, I wonder, to clear your mind of preconceptions and to truly listen? Seren is present in every elven crystal. Its hardness represents her unswerving faithfulness to the elves; its symmetry represents her harmonious nature; its growth represents her nurturing of all things that grow. What does a crystal's hardness represent?",
    "Correct. Now, what represents Seren's harmonious nature?",
    "Correct. Finally, what represents Seren's humility?",
    "Correct. Nothing I said mentioned Seren's humility - but you have displayed humility by admitting you did not know the answer. I believe I can trust you. A servant of Lord Iorwerth would have not displayed such humility. As you no doubt suspect, I am Lady Hefin, whom you seek.",
    "Now is not the time for you to learn more. Wisdom comes over many years of contemplation. Anything I told you about Seren would simply become an item of trivia for you to memorize, distracting you from true understanding.",
    "I have been meditating, contemplating Seren as she manifests herself through the natural world, while I hid from Lord Iorwerth.",
    "No. It will be my duty to resume my role as clan leader in the city. I will use the enlightenment I have gained from my meditation to guide my clanmates' spiritual development.",
    "Then it is time for my solitude to end. I will meet you in the Prifddinas Undercity.",
    "You were not listening. Meditate on Seren, and speak to me again."
  ],
  "Lady Meilyr": [
    "Hello? Hmm, hallucinating people again. Should use less void dust in the next potion. Wait...you're not a hallucination, are you? You're...really here? Is it time? Is it time to re-grow Prifddinas? The crystal spires?",
    "I didn't know how long I'd have to wait for someone to fetch me to re-grow the city. I've been making myself potions to extend my lifespan. The potion has to be carefully tailored to the drinker's current state, and if I get it slightly wrong there can be side effects.",
    "There's more to most places than meets the eye. The right potion can help you see things that you'd normally miss. I brewed the right potion, and I found a dungeon room that I felt sure could never be found without it.",
    "Did you know an entirely different set of herbs grow in the dungeon than grow in the outside world? Some elven explorers discovered the entrance back in the days of Baxtorian's empire. The Meilyr clan mounted expeditions to bring back some of the exotic herbs. When Lord Iorwerth began hunting the clan leaders and I needed a hiding place, the dungeon of exotic herbs seemed ideal.",
    "It'll be good to get out of this dank little dungeon and back to elven lands! I'll meet you in the Prifddinas Undercity.",
    "I didn't escape from my dungeon just to stay in the Undercity forever. Let's re-grow the city!",
    "You're winning, Player! It's getting weaker!",
    "You didn't give us magic! It was Seren, the goddess of light and life!",
    "Great Seren! So that's the Dark Lord! Activate my seal when you're ready for me to sing!",
    "It'll be good to live somewhere with fresh air and space again. No more dungeons for me.",
    "Feel free to explore our great city to your heart's content!"
  ],
  "Lady Ithell": [
    "It feels amazing to be this close to the seed of Prifddinas!",
    "Great Mother Seren! What is that?",
    "I can do it. Lady Ithell's knowledge is there in my head. Activate the seal and I'll sing to create the light beam.",
    "I still can't believe the city is growing again!",
    "We shall sing songs of your great endeavours!"
  ],
  "Lady Hefin": [
    "It is centuries since I was last here. I was but a child then, in spiritual terms; I have gained much enlightenment since then.",
    "You know you can't win, Dark Lord. My predecessors designed the Temple of Light to contain you. We will contain you again.",
    "A darkness about which Seren warned our ancestors when she shattered herself at the end of the God Wars. It dwells beneath the mountains, attracted to the power of the Death altar. One of my predecessors designed the Temple to contain that darkness, and the other clans helped us to build it.",
    "Do not fear, Player. The light of Seren will protect us from the Dark Lord. Activate the seal when you're ready.",
    "Praise Seren for sending you, human. You are the saviour of our city.",
    "You have returned peace to all elfkind! May Seren forever watch over you."
  ],
  "General Hining": [
    "This is not a good place to be. King Tyras is dead - there is no hero to fight back the forces that face us now. Go, prepare for the coming darkness while you still have time!",
    "Yes. I saw his body, after we put out the fires. His face was noble, even in death. We will not see a king like him again.",
    "We're continuing King Tyras's war against the dark elves - but that war has turned into a stalemate. If we were to leave, Lord Iorwerth's forces could occupy the whole forest, and we'd lose the one human outpost west of the mountains. If we were to attack, we might gain ground temporarily but Lord Iorwerth could bring in reinforcements to drive us back.",
    "All I know are elven legends. They say the Dark Lord is a being of ultimate evil, whose only desire is to corrupt and kill. My troops are Saradominists, so when they heard the description they assumed it referred to Zamorak...but in truth, I do not know.",
    "And then...and then it'll all be over? The dark elves defeated, the elf city re-grown.... And King Lathas is in exile.... We could all go home! I'll help you, adventurer. Go back and tell your elf friends they can count on our support.",
    "Thank Saradomin the war is over, adventurer. King Thoros has asked us to maintain this outpost, with the permission of the Elders of Prifddinas. We're not on a war footing any more, though, and the troops can be rotated between here and Ardougne. None of it will bring King Tyras back, though."
  ],
  "[Elder]": [
    "You should activate the Cadarn seal first.",
    "You should activate the [clan] seal next.",
    "You should speak to Arianwyn."
  ],
  "Stage 1/8": [
    "Direct the Cadarn beam to the Seal of Seren."
  ],
  "Stage 2/8": [
    "Direct the Trahaearn beam to the Seal of Seren."
  ],
  "Stage 3/8": [
    "Direct the Iorwerth beam to the Seal of Seren."
  ],
  "Dark Lord": [
    "Death! I bring you death! You are alive now - but soon, you will not be alive! Death!",
    "I am the Dark Lord. Does that name not tell you all you need to know? You wish to build, to create life, to continue existing. I am that which opposes you! I am the voice in your head as you explore the darkest caves, whispering that you should stay...embrace death...destroy rather than create.",
    "Your efforts are futile. Your death is inevitable!",
    "Death is the place to which all mortals travel. It is the only certainty! It fascinates me. I had not imagined it, before I encountered beings that died. Does it not terrify you to your very soul? How can you live, knowing that you will one day die?",
    "Those who built the Temple of Light are dead, while I remain! Death will always defeat life!",
    "You cannot contain death! You can delay it, with your machines or your potions or your magic, but it will come for you! I will come for you!",
    "I must have more power. Lord Iorwerth!",
    "I want the power of your death!",
    "Yes...the death of an elf clan leader is powerful.",
    "I am immortal! My creator and my sibling were immortal. For aeons, I did not imagine that life could end... I found the elves in their forest world. I watched them live, and then... I watched them die! Death was a terrible, fascinating, alien thing! It caused the elves distress...and yet their poets claimed it added meaning to their lives. I did not have that distress, or that meaning. I gave the elves magic, and I tried to make them live longer. I stretched their lives from decades to centuries - but they always died!",
    "It was Seren! It was I!",
    "I am the creator of the elves! I taught you magic and brought you to this world! You cannot destroy me!",
    "I was a part of her! She cast me out! In the God Wars I saw billions die. I could not leave my elves like the other gods left their races. I shattered myself into crystals to remain with them. But I was at war with myself. The rest of Seren banished the part of her fascinated by death - the part you see now. I found solace beneath the mountains, in the Death Altar - and then I was trapped by the Temple of Light. I wanted to reach out to my followers, to see them live and die, to be part of the tools and weapons that they sang. I spoke to the minds of those who walked the Underground Pass. I shared my fascination with death with them. I asked them only to provide new, more interesting deaths for me to observe. Lord Iorwerth would have been my greatest ally. He provided me with so many deaths...and now his own, and that of King Lathas. Lord Iorwerth and King Lathas are both dead! I devoured their souls to gain the power to manifest here! The soul of a king is a rare delicacy! But your soul, hero, will be a rarer delicacy still! Prepare to be my finest feast!",
    "No! I cannot die!"
  ],
  "Stage 4/8": [
    "Direct the Ithell beam to the Seal of Seren."
  ],
  "Stage 5/8": [
    "Direct the Amlodd beam to the Seal of Seren."
  ],
  "Stage 6/8": [
    "Direct the Hefin beam to the Seal of Seren."
  ],
  "Lord Iorwerth": [
    "What's happening? Great Dark Lord! You are here! What do you want of me?",
    "Aaaargh!"
  ],
  "Stage 7/8": [
    "Direct the Meilyr beam to the Seal of Seren."
  ],
  "Stage 8/8": [
    "Direct the Crwys beam to the Seal of Seren."
  ],
  "Congratulations! You have completed": [
    "'Plague's End' - Complete this quest.",
    "'Prifddinas' - Access to Prifddinas"
  ],
  "Elven city guard": [
    "Come back later, human. It's too dangerous to enter Prifddinas while the city is growing."
  ],
  "[Elder": [
    "] May Seren guide you.",
    "] Peace be with you.",
    "] Prifddinas is growing!",
    "] Rejoice!",
    "] See you in the city.",
    "] Thank you for everything!",
    "] We are as one.",
    "] We are home!",
    "] Welcome, friend of the elves.",
    "] Welcome, human!"
  ],
  "Tyras guard": [
    "Good day. Sorry I can't stop to talk. General Hining is keeping a tight watch.",
    "You cannot enter! This is General Hining's pavillion. Now that the war against the darkness is over, the new king has ordered us to turn this camp into a permanent settlement!",
    "The dark times are over. It's good to be able to go back to my family in Ardougne.",
    "General Hining says we won't be needing this catapult any more now that the war with the darkness is over. I just couldn't bring myself to dismantle it, though. This catapult's me baby. So I convinced the general to let me leave it here as a memorial to the war."
  ],
  "Doctor Orbon": [
    "(if not wearing full mourner gear). I was worried half to death about that plague, and now it turns out it was a hoax involving dyed sheep! I don't know why I didn't spot that. Perhaps I'm not the doctor I thought I was.",
    "(if wearing full mourner gear). I knew we couldn't keep up this charade forever. Curse that interfering adventurer.",
    "You'd do well to flee West Ardougne before the citizens do nasty things to you."
  ],
  "King Thoros": [
    "The city of Ardougne thanks you for your help, adventurer. I'm afraid I don't have time to talk. I never expected to become king, and I've suddenly found myself with a lot more responsibility than I'm used to."
  ],
  "Omart": [
    "Looks like you won't be needing the rope ladder any more, adventurer. I heard it was you who started the revolution and freed West Ardougne!"
  ],
  "Kilron": [
    "Looks like you won't be needing the rope ladder any more, adventurer. I heard it was you who started the revolution and freed West Ardougne!"
  ],
  "Recruiter": [
    "Citizens of West Ardougne! Who will join the Royal Army of Ardougne? It is a very noble cause. Stand alongside King Thoros, ready to defend our land from new threats!"
  ],
  "Milli Rehnison": [
    "It's so good that people can go in and out of the city now! Elena has come to visit often."
  ],
  "Farmer Brumty": [
    "Aye. Councillor Halgrive told me about the fake plague. My poor sheep suffered and died for a pack of liars...it's the innocent who pay the price for man's ambition. To tell you the truth...",
    "(if you killed King Lathas). I'm glad you killed King Lathas. We were all sheep in his eyes. You brought justice to these lands.",
    "(if you exiled King Lathas). I am glad you exiled King Lathas. Good riddance to him. Though I hear his cousin's not much better."
  ],
  "Adyna": [
    "I miss my rock... It was my special place. I was safe and happy there, and you took it all away. The lady you built is very pretty, though."
  ],
  "Bronwyn": [
    "I can't believe Kelyn became Lady Ithell just from looking at that statue! To me, it just looks like a pretty statue."
  ],
  "Mwynen": [
    "Oh, hello. May I be of service?",
    "What's the matter?",
    "Essyllt, I don't understand. What's going on?",
    "W-what? Kill him?",
    "What manner of brute are you, that you would threaten Lord Iorwerth's emissary of peace?",
    "What's so funny?",
    "What? Essyllt...that's a lie. Tell me it's a lie.",
    "It's...true, isn't it?",
    "Please excuse us, Player. My husband and I need to speak in private.",
    "Just stop already. Your lies are painful to listen to.",
    "It's certainly been interesting speaking with you, Player. It seems Essylt and I have a lot to talk about.",
    "I'm sorry. I cannot talk now. My husband, Essyllt... He was murdered.",
    "He was Lord Iorwerth's emissary of peace... He should have been safe!",
    "What? How c...",
    "No! You have to be lying. Essyllt could never do that. G-get away from me."
  ],
  "Essyllt": [
    "Aah!",
    "I...I promised you'd never see me again. I didn't think the elder would actually permit other races to enter Prifddinas!",
    "I've given up the military life, and settled with my wife.",
    "When I was... working... this human had the choice to kill me.",
    "Yes, the work I was doing when you met me.",
    "I...Why did you...",
    "They're not here right now. There's um... Dwyfor... Grenfron... and Aeronwen.",
    "Dwyfor was also in Lord Iorwerth's service, I last saw him entering the Underground Pass.",
    "Grenfron is assisting in cleaning the Undercity.",
    "Aeronwy never really stays in one place, she's probably wandering around somewhere.",
    "Aeronwy? Yes, Aeronwy.",
    "Fine. I lied about having children. Maybe one day. I just wanted you to let me live.",
    "I've retired. I'm just spending time with my wife, Mwynen."
  ],
  "Essylt": [
    "I...Bye."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Plague%27s_End?oldid=36196920’"
  ]
}