{
  "Explorer Jack": [
    "Aha, you're back. Do you have a query about the Tasks in the Lumbridge set? Or, perhaps I know of a quest that might interest you.",
    "Ah, spiffing. I can see the exploring fibre in you!",
    "Oh, that exploring flame in your eyes! Just like me in my young days - eager to discover and take on new challenges, eh?",
    "A quest? But indeed! A tale of riches is what you need, what?",
    "Yes, and I have just the thing. A snow imp wandered through my door one day and I, curious about foreign lands, as every good explorer should be, asked him for tales of his homeland.",
    "What a tale! He told me of priceless riches and knowledge hidden in the frozen caves of the Land of Snow; he also mentioned dark sleek stones protected by a fearsome creature. Apparently they are very precious, and would make a fine addition to any explorer's collection. So, what do you say, chum? Will you get those precious stones for me?",
    "Oh, don't underestimate yourself. Do come back if you change your mind, eh?",
    "Splendid! Now, do you have any questions?",
    "Ah, a good question indeed! I have an acquaintance who now lives in the Wizards' Tower. He's called Isidor. He'll take you there as long as you give him the teleport phrase, but you'll have to remind him everytime. The poor  chap has a memory like a sieve! That's what you get for experimenting with magic all day, eh?",
    "Oh, yes, of course. \"Ectosum glissendo\". That's what the snow imp said.",
    "Yes, indeed. I have a whole pile of old lamps I got from a certain Ali. I can probably give you one if you're into antiques.",
    "We'll see, once I see how valuable they are - if you do manage to find them.",
    "Ah, I could see the truthfulness in his eyes - plus he explained how to get to the place. If the place exists, so must the riches. Could it have been greed in his eyes? Well, if it was greed, then those riches are definitely valuable. Bring them back, eh?",
    "Aha, you're back. How can I help you?",
    "Aha! Welcome back. Have you found the stones?",
    "They look fascinating! They're very cold, too.",
    "Oh! What's that?",
    "I'm flabbergasted. Why would they do such a thing?",
    "Haha! I suppose it's true! Thanks for the heads-up, chum. I'll see what I can do with these things. Here, have this old lamp. The dung may still be valuable. I'll investigate!",
    "Oh! Flabbergasting!",
    "Yes, indeed! Please take this old lamp. I'll study the stones and, if they are valuable, I might have more rewards for you!",
    "Aha, you're back. How can I help you?",
    "Eh, I haven't made any progress with the stones/dung. Please come back later."
  ],
  "Player": [
    "You mentioned a quest?",
    "Er...",
    "Um... so you're going to give me a quest?",
    "Is it?",
    "And?",
    "How do I get to the Land of Snow?",
    "What teleport phrase?",
    "Are there any rewards?",
    "Is that all? For stones so precious?",
    "How do you know the imp's tale is true?",
    "Actually, never mind.",
    "What do you do?",
    "Can you teleport me anywhere?",
    "Never mind.",
    "I'm a friend of Explorer Jack and need teleporting somewhere. The phrase is 'Ectosum glissendo'. Could you help me, please?",
    "Never mind.",
    "This must be the hidden knowledge Explorer Jack was talking about. I should probably focus on getting the stones to Explorer Jack first, though.",
    "Hey! Heeeeeeeeey!",
    "What's going on here?",
    "Wait a second. Who are you?",
    "Eeeewwww! Gross!",
    "Er, thanks, I guess.",
    "Oi!",
    "I have indeed! Look at them!",
    "That's because they're still frozen. When exiting the cave with them, I met some of the snow imps. They told me what the stones really are.",
    "Yeti dung. The imps were playing a prank on you. Apparently, once thawed, these things smell horrendously.",
    "They consider you greedy, nosy and annoying, and thought you needed a good lesson.",
    "Glad to see you're taking it lightly.",
    "I just remembered, I must be off. I'm late for a...very important event. Somewhere else. Did you mention a reward?"
  ],
  "Wizard Isidor": [
    "Oh, hello there! Can I do anything for you?",
    "I'm a wizard, obviously. I work on portals and teleportation.",
    "In theory I could, if I had a precise means of fixing the destination - a teleport phrase, for example. Right now I'm working on something else, though.",
    "Oh, very well then! Here you go... Ectossum glissendo!"
  ],
  "Benny": [
    "Hey, guys, there he/she is!",
    "Haha!",
    "Marius 'ere got questioned by a nosy, greedy and generally annoying explorer when we was on mission in RuneScape.",
    "He sent ya though, and yer not so annoying.",
    "We's gonna enchant the dung so it only thaws when ya give it to someone else, and so ya can teleport with it."
  ],
  "Marius": [
    "Yer right! What's that in yer bag?",
    "It's quite funny.",
    "We's snow imps!",
    "I told the explorer about very valuable riches here in the Land of Snow.",
    "So, we's telling ya the truth. Also, we help ya; otherwise, it's you who'll smell! 'E smells already, tho.",
    "'Cause, if you try ta teleport outta here without it being enchanted, at best it won't let you, and at worst it'll vanish! Weird stuff, yeti dung.",
    "There ya go! Teach that explorer a good lesson."
  ],
  "Marvin": [
    "I know!",
    "We pranked ya!",
    "I's teching 'im a lesson: ye don't bovver snow imps!",
    "But, in fact, the riches are just yeti dung!",
    "They's all right now, but let them thaw and it will be worst smell ever. Haha!"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Myths_of_the_White_Lands?oldid=32992590’"
  ]
}