{
  "Summer": [
    "Woo wooo wooo!",
    "Player, I don't have time now! You must come with me right away!",
    "Oh no, you will need mother's ring. Please, go get it and hurry back here.",
    "Not here. Please, come with me!",
    "Please, Player! You must help us! The elders also need you.",
    "Please, Player, come back. We need your help."
  ],
  "Player": [
    "Summer, what are you doing here? What happe-",
    "Wait, what has happened? Why did the ground shake?",
    "Okay, I'll go get it.",
    "No, I will just make things worse. The elders told me to stay away.",
    "Alright then, I'll come.",
    "No, I'm sorry.",
    "I need to get some things first.",
    "What's this? What's going on here?",
    "Come back? Is this the farm? What happened?",
    "Please do, this is all very confusing. As far as I've understood, I shouldn't even be here.",
    "Yes, she told me that first her mother died and then the rest of you were murdered.",
    "Who is Gargon?",
    "Oh, okay. Sorry for interrupting you, please go on.",
    "But then there is even more reason to stop it! If it gets through, it will have all the people of Gielinor to feed upon!",
    "Yes, there was a short earthquake right before Summer appeared at the Wilderness Wall again. What happened?",
    "What do you mean?",
    "You're saying that we're in the Abyss? I don't remember it being this...this bright.",
    "You can't blame me for this! Just asking me to help would've been perfectly fine.",
    "So, what is it we must do? How can we defeat this thing?",
    "Alright, I should be able to do that.",
    "I'm sure he will be.",
    "Oh no, I'm not putting my faith in him.",
    "Will do.",
    "What should I do now?",
    "Oh, yes, that's right, you want me to lure it into the cave.",
    "Yes, that's understandable.",
    "Even if I didn't want to, I don't have much choice. We can't let the Beast get through to Gielinor or even more people will suffer.",
    "Wait, what was I supposed to do again?",
    "Alright, I will do my best.",
    "Thank you.",
    "What cave?",
    "Sure, I can do that.",
    "I'm working on it.",
    "What was I supposed to do again?",
    "Oh yeah, that's right. I'll get right on it.",
    "I hope so, too.",
    "Maybe so, Meranek, but luring the Beast is one thing, harming it is quite another! Now that we have it trapped, what do you propose we do?",
    "So, your plan is to burn it? That's it? I'm sorry, Meranek, but that's preposterous. Fire won't damage a creature this powerful.",
    "So, I need to gather the roots from around this chamber to build fires and lure the Beast, then you will attack?",
    "Um...maybe not our biggest concern right now, but won't that fill the cave with smoke?",
    "Okay, so...you take all the glory while I'm scuttling around gathering twigs?",
    "Could you explain that again?",
    "No, I'm not.",
    "No, I'm not ready.",
    "Well, kind of. He just mentioned that its weakness is in its chest, where it stores the energy from the souls it devours.",
    "Wait, so you're saying that parts of you, Summer, and everyone else are still alive in there?",
    "How can we do that?",
    "I'm guessing that's where I come in?",
    "Okay, so I just need to get these fragments of my soul back. I guess I can do that.",
    "Okay, so I dig holes in the ground and act as live bait for the dark core, trying to get it to fall into one of them?",
    "No, can you explain it again?",
    "Actually, I don't think I'm ready just yet.",
    "Actually, I don't think I'm ready just yet.",
    "Yes, I remember. I brought back memories and experiences from her past.",
    "Can you explain that again?",
    "No, I'm not ready yet.",
    "No, I'm not ready yet.",
    "Yeah, it appears I did.",
    "I'm just glad I could be of help.",
    "Hah. I guess so.",
    "I couldn't have done it without your help, though.",
    "I'll be there in a minute.",
    "Oh, I will just go and clear out some space then.",
    "Wait, you're leaving? Where are you going?",
    "That doesn't really seem like a happy ending...",
    "So I just wear the ring on my finger and operate it when I think I'm next to a portal?",
    "Alright, I'll keep that in mind.",
    "Hmm. Let's see if I got this straight. This shield you're giving me now, I can bless it using holy elixir and the powers of Saradomin?",
    "Hmm. Let's see if I got this straight. This shield you're giving me now, I can bless it using holy elixir and the supposedly holy powers of Saradomin?",
    "And once it has been blessed, I can attach a magical sigil to it?",
    "Alright. Thank you very much for these gifts."
  ],
  "Meranek Thanatos": [
    "Thank you for coming, Player. We understand that it must be awkward for you to come back after what we said last time.",
    "Yes, we also thought of this...and it would no longer be in need of us...",
    "It has broken free, Player, and it's more powerful than ever.",
    "As we mentioned last time we saw you, we have tried before, and failed. But we were hoping that, with your help, this time we might succeed. There is a cave just north of the farm – the first thing we need to do is lure it in there. Once inside, we can go along with our old plan on how to defeat it, but we will give you further instructions once we've got it where we want it.",
    "Now get that cave open and lure the Beast inside.",
    "Wooo woo woo.",
    "Erik and Jallek may have seemed a bit harsh last time you were here, but please don't think any less of them, Player. We have suffered from the Beast for centuries, and time moves even more slowly when you're in constant pain. We're just afraid it will get worse.",
    "Last time we tried to defeat the Beast, Jallek came up with a plan to break through its defences. We need to lure it into the cave north of the farm before we can put our plan into action, though.",
    "That's correct. Then we will go from there.",
    "Wooo woo woo.",
    "Well done, Player, I did not believe that you would be able to get the Beast in here – maybe Summer's faith in you is justified.",
    "Fear not, we have a plan. The roots around the chamber are cursed – they burn with a supernatural intensity. We believe that the Beast's vision will not be able to distinguish between these fires and a soul, drawing it towards them.",
    "You are correct that the fire will not harm the Beast, but it will surprise it. We have studied this creature for centuries and we have noticed a weakness in its chest – where the Beast stores the energy of the souls it devours. Once it is stunned I will strike and try to break through its protective armour.",
    "Exactly...",
    "If it goes according to plan, the Beast should try to devour the flame, so you need not worry about that.",
    "Yes. But you must be on your guard: the Beast can recognise when it's being threatened, and it won't take kindly to it. So keep your eyes, as well as ears, open and try to stay out of the way of its attacks. I should also warn you that no amount of armour will protect you from the Beast's attacks. So, to allow you as much mobility as possible, I suggest you only bring the most necessary equipment – armour and weapons will be useless for you here. So, are you ready, Player?",
    "The roots around the chamber are cursed – they burn with a supernatural intensity. We believe that the Beast's vision will not be able to distinguish between these fires and a soul, drawing it towards them.",
    "Are you ready to face the Beast, Player, or do you want me to repeat what you must do?",
    "The roots around the chamber are cursed – they burn with a supernatural intensity. We believe that the Beast's vision will not be able to distinguish between these fires and a soul, drawing it towards them.",
    "Remember when you helped Summer strengthen her soul?",
    "We must travel from grave to grave, and at the right moment, when the Beast is channeling[sic] its own powers, you must bless one of the graves we're currently in.",
    "Are you ready, Player?",
    "Are you ready, Player?",
    "Hah. Maybe so, but we were forced to fight, whereas you chose to do so to help us.",
    "I also have something I want to give you, Player – I want you to have this shield. I made it myself a long, long time ago, when I was still alive. It may not be much in its own right, but during our early struggles against the Beast, Jallek came up with a way of making it stronger. He used a holy elixir and the power of Saradomin to bless the shield, making it more powerful, and then he created a series of sigils to attach to it. Each sigil strengthens the shield with different powers. However, once one has been attached to a shield, it cannot be removed and no other sigils can be attached with it. The shields became very powerful, but, unfortunately, I lost all of the parts in one of the Beast's violent outbreaks about a hundred years ago. If you happen to come across any holy elixir or sigils during your travels in the Wilderness, you could probably put them together yourself.",
    "That's correct.",
    "It is sad to see that you don't have faith in Saradomin, but yes, that is correct.",
    "That is also correct. If you can't bless it yourself, you may be able to find a holy man of Saradomin to do it for you.",
    "Goodbye, Player, and be sure to put that shield to use."
  ],
  "Erik Bonde": [
    "Oh, no, we're some place else now. It's hard to explain but Jallek should be able to shed some light on the situation.",
    "Nobody should, Player, but fate has been rather cruel to us all. It all started around four hundred years ago, when we moved here from Varrock to set up a farm of our own. I'm sure Summer has already told you what happened then.",
    "Yes, my beloved Jennica died from spider poisoning about a year before the attack. What happened to her soul, we do not know. We can only hope she did not become a victim of the Beast's. Then the rest of us, except for Gargon, were murdered.",
    "He worked alongside Meranek and Jallek, but was away on an errand at the time of the attack. I can only assume he is long since dead by now.",
    "As we died, we did not get to move on as people normally do. Instead, we were trapped in this realm. Every day since then, the Beast has been slowly draining energy from our souls. The pain is constant and horrible, but, sad to say, we have almost become used to it now. But the first few weeks... we could do nothing but scream from agony.",
    "As you probably understand, we must act now. It doesn't matter how powerful it is, we must stop it. And...as you've dealt with it before and...and because you are partly responsible for how quickly this is all evolving, we were hoping that you would be willing to try to set things straight again.",
    "I...I apologise.",
    "We were thinking that maybe you could lure it like you did before? By gaining its attention with newly summoned souls.",
    "Thank you, Player. May Saradomin be with you.",
    "Well, then may whoever you choose to follow be with you. Regardless of who it is, you will need it.",
    "Wooo woo woo.",
    "Thank you for wanting to help us out, Player. Have you lured the Beast into the cave yet?",
    "The one just north of the farm. You should try to lure it in using a recently summoned soul, like you did before. The Beast has probably grown familiar with the types you've already used to harm it with the discs, though, so you should try using something that's new to it.",
    "Woo wooo woo wooo.",
    "Well done, Player. The Beast appears weak enough now – it is time we defeat it for good.",
    "This is the cave where Gargon buried us, many years ago – the same cave where we buried my beloved Jennica. The graves are monuments built in our memory, and thus strong anchors to our souls.",
    "Now that the Beast has been weakened, you should be able to tell the souls apart by colour as well as shape, so stay focused.",
    "Well done, Player. The Beast appears weak enough now – it is time we defeat it for good.",
    "But this is not the place to talk. Please, come and talk to us outside of the cave, we have some things we want to give you.",
    "Before we move on, we have a few things to give you to show our appreciation for everything you've done.",
    "You don't seem to have enough inventory space to hold what we want to give you.",
    "Okay. Don't be too long, please.",
    "It is the least we can do, Player. Now it is time for us to leave. Farewell, and good luck on your adventures."
  ],
  "Jallek Lenkin": [
    "Actually, I think we should explain it from the beginning.",
    "We don't exactly know what the Beast is, but it's been here for a lot longer than we have. As Erik mentioned, it feeds directly on souls which fuels the dark energies that keeps[sic] it...alive, I suppose. We suspect that before we arrived, it outright devoured every soul it came across. The veil between our worlds was still strong then...but that has started to change. Not soon after our arrival, we could feel the veil separating the Beast's realm from yours growing weaker and weaker. It's as if the Beast is trying to claw its way through.",
    "Over the centuries, it seems to have made quite a bit of progress...but that is nothing compared to what has happened since Summer brought you over to try to help us.",
    "I assume you felt the ground shake?",
    "It is breaking through the veil. With its new powers, it has started crashing through the realms. That actually explains where we are right now.",
    "This void...we're actually inside the veil that separates our two realms. It has grown so weak that even we can enter it.",
    "No, this is not the Abyss. The Beast is not so patient that it's trying to find an actual path to our world – it is creating its own. The Abyss is all around us, but the Beast is crashing its way straight through it, pushing everything aside – leaving nothing but this void.",
    "However, you should know that if there's anything the Beast is familiar with, it's souls. I doubt it'll be possible to do it exactly the same way as last time. You need to find a new type of soul to lure it with. Not just a new shape, but the spirit itself must be of a completely different type, and not one of the three you last used. Aside from being marked by a symbol, the discs north of the farm are also colour coded – this might give you some useful information as to what kind of soul you must use. Once you have the Beast in tow, enter the cave before it manages to claim the spirit.",
    "Wooo woo woo.",
    "You should know that we're really glad that you have come back to help us, Player.",
    "That is very true. Well, good luck.",
    "We have a plan to defeat the Beast, but first we must get it into the cave north of the farm. You should be able to lure it with a newly summoned soul, like you did before. But be careful, it has already become familiar with some of them, so it needs to be something completely new.",
    "Thank you.",
    "Wooo woo woo.",
    "Very well done, Player, we've managed to shatter the Beast's chest plate. I'm guessing Meranek didn't explain exactly what its weakness is?",
    "Yes, I thought as much. Anyway, the Beast is no ordinary life form. Actually...it's not a life form at all. As mentioned before, it's a supernatural being that sustains itself by feeding on the souls of the living and the dead. The parts of a soul it devours do not die until the Beast has used up all the energy. In other words, the souls are still alive within the Beast.",
    "Yes, but the energy is severely corrupted. This creates something that I cannot explain as anything but a separate creature within the Beast. This being is in fact the dark core of souls the beast draws power from – which is the energy Meranek mentioned. It has, until now, been shielded behind the Beast's chest plate, so we need to take advantage of this weakness before it has regenerated itself.",
    "In preparation for finally being able to fully destroy the Beast, I must weaken it. Over the centuries I have studied the creature, I have also managed to understand and use some of the dark powers that circulate here. I can cast something of a weakening spell at it, but it requires timing. First of all, I must be able to get a clear shot at the Beast's head. Secondly, I can only do so while the dark core is not within the Beast's body, lest it soaks up any harm I try to do to it, and it will just strike at the remains of our souls.",
    "Correct. As the Beast has been drawing power from your soul, parts of you must also be in there. When the creature comes out of the Beast's chest, it will likely try to return to its true owner – namely you, Player.",
    "No! You definitely must not! The energy has been corrupted by the Beast. It may still be drawn to you, but if you come in contact with it, you will gain nothing but pain. So, you must stay out of its way, but at the same time make sure to lure it far away so that the Beast cannot get it back. There are soft patches of soil in this cave. Use a spade to dig holes in the soil and then use yourself as a bait to trick the dark core into the holes. When the Beast then bends over to get it back, I will strike.",
    "Yes, while also keeping it away from the Beast. If the Beast happens to get it back, just wait for it to get loose again. Did you understand all of that?",
    "Are you ready to face the Beast?",
    "If the spells have had the effect we've hoped for, we should be able to do some more direct harm to the Beast's actual existence now. It is a creature born from an overwhelming presence of pain and torment, so we must strike it down with holy power. Unfortunately, holiness is something the Beast has long since drained from our souls, so we still need your help, Player.",
    "Exactly. We need you to do something similar now.",
    "We will return into our graves and you must bless them to temporarily strengthen our souls and give us the power to strike at the Beast. However, this land has been corrupted by its evil presence, so we can't stay in the ground for long. Additionally, the Beast will most likely be trying to drain us completely dry when it realises what we're up to.",
    "Depending on what part of its dark energy it's currently drawing power from, you must bless the right grave so that the correct one of us can cause a backlash of power.",
    "Also, keep in mind that we must all strike at the Beast once each! Our souls are different, and only then will the Beast be defeated. Remember that, Player.",
    "Yes, you are the true hero here, Player.",
    "Death, Player. With the Beast no longer keeping us trapped here, we can finally die.",
    "We have waited for this moment for hundreds of years. It's a relief that we can finally get our eternal rest.",
    "And even if you can't, you may be able to find someone skilled enough to do it for you.",
    "Goodbye and thank you for everything."
  ],
  "Summer Bonde": [
    "Wooo woo woo.",
    "Thank you so much for coming back to help us, Player. I hope we can defeat it before it's too late.",
    "You open the cave entrance north of the farm and get the beast in there. The elders think you will be able to lure it using one of those creatures like you did when you lured it to the discs. But apparently you should use a new type of creature this time.",
    "The Beast appears to be too familiar with that type of soul from the experience with the discs. You should try some other kind.",
    "The Beast appears to be too familiar with that type of soul from the experience with the discs. You should try some other kind.",
    "Wooo woo woo!",
    "You did it, Player! You defeated the Beast!",
    "Thank you so, so much! You have saved our souls! I'm feeling stronger already.",
    "You did more than just helping out. You're a hero, Player!",
    "You should speak to the elders, I'm sure they will want to thank you, as well.",
    "Wooo woo woo!",
    "The elders want to talk to you, Player.",
    "Please don't be sad, Player. You'll always have mother's ring to remember us by. Also, now that I am stronger, I can finally give it a proper blessing.",
    "You should now be able to use the ring to go through all the portals leading into this realm. There are the strong ones, which you've been able to pass through before. Then there are the weak ones, which look similar but they just don't glow quite as strongly. Finally, there are the very weak portals. These portals don't give out a glow at all, and are thus completely invisible. They may be very difficult to find, but I've heard that there are a few of them scattered across the Wilderness. Portals tend to appear in locations with an already strong spiritual presence, so I suggest starting to look there. You must then operate your ring in the right spot to go through it. If you're not standing in or right next to a portal, the ring simply won't give out a response.",
    "Yes, that's correct. And, as I mentioned, they tend to appear in places where the presence of spirits is already strong – like here on the farm or in the village.",
    "Please don't forget us, Player. Farewell..."
  ],
  "Erik Bonde/Jallek Lenkin/Meranek Thanatos": [
    "Wooo woo woo."
  ],
  "[Erik Bonde/Jallek Lenkin/Meranek Thanatos]": [
    "You did great, Player! The Beast stood no chance!",
    "Wooo woo woo.",
    "Words cannot express how grateful we are – we are free of the Beast's torment! Now let us forever seal this cave, just to be sure that its evil aura is firmly trapped."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Summer%27s_End?oldid=35795455’"
  ]
}