{
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "missing some dialogue choicesYou can discuss this issue on the talk page or edit this page to improve it."
  ],
  "Ellamaria": [
    "Hey - what are you doing with that patch, peasant?!? One demands that you speak to one's self immediately!!",
    "No, one has just had them installed. One has had the most marvelous idea to bring renewed happiness to one's own dearest husband.",
    "Oh dear – the common classes, oh how they fill one with intolerable levels of exasperation, I swear to be most true.",
    "Yes, be off with you, before I call the guards.",
    "Peasant – WAIT!!!",
    "Who else would I be speaking to, you funny little [man/woman]? Of course you.",
    "Oh yes, sarcasm – how amusing. No, no, peasant – I have a question to ask of you, and you are required to answer.",
    "Do you know of anyone who might have some degree of horticultural experience?",
    "Oh, marvellous! Peasant, I hereby order you to assist me with a little project I have planned.",
    "Oh, what I have to deal with these days – to think this is what being a Queen has become. Very well then: would you ... good [sir/lady] help me with a little project of mine?",
    "Well don't allow one to delay you - it is probably the most constructive thing you could do with your life, to be honest.",
    "Ah, more sarcasm – wonderful. Well, it is nice to have a master of the fine art of gardening to assist me; in the absence of any such person, I gladly accept your service.",
    "To answer your first question, you have noticed the new farming patches that we have had installed around us. We wish to grow many varied and exotic plants in them, to bring happiness back to my husband.",
    "The very same, and that's 'His Most Royal Majesty' to you. Now we come to the plants that one wishes you to grow in these patches. I would tell you all at once, but I fear that your small mind would not cope.",
    "I have given you a list of the items that I need in each patch. One is sure that you will know how to use the list with each patch to find out what needs to go in each one. There is one more thing, though.",
    "Obtaining the seeds may prove difficult if you go about it by hacking and slashing everything that moves. No, to gather these items you will need to employ a finer tactic; the art of persuasion. You must go at once and converse with the wise old man who is said to dwell in Draynor Village; he may guide you in mastering this delicate and sophisticated ability.",
    "Take better care with this one.",
    "You use the dormant object that lies between your ears, that's how. A statue may be far too heavy to carry, but simplicity itself to push.",
    "Yes peasant, push. Here – take this trolley. You can use it to push the statues here.",
    "What are you talking about?!? You still have the one I gave you!",
    "Haven't you got that list I gave you?",
    "Well read it then! That should tell you everything you need to know!!",
    "Oh dear, what a pathetic creature you are. Here, have another one.",
    "Well, you are supposed to be the gardener here, but I would say not. One had the soil imported from an extremely fertile area at great cost – watering should not be necessary one would have thought.",
    "Very good peasant, thank you for showing one that, but one has given you a job to do. Do it.",
    "Very good peasant, you've got the seed; but its the plant that one wishes, not seeds. Plant it in the patch, and let it grow.",
    "One finds that hard to believe. Out of my way, let me see for myself.",
    "One was right not to trust your word, common as it is. The garden is not yet complete.",
    "I see that the [plant name] [hasn't/haven't] finished growing.",
    "Also, the [plant name] [hasn't/haven't] finished growing.",
    "Thirdly, the [plant name] [hasn't/haven't] finished growing.",
    "Oh look, the [plant name] [hasn't/haven't] finished growing.",
    "To add to that, the [plant name] [hasn't/haven't] finished growing.",
    "And what a surprise, the [plant name] [hasn't/haven't] finished growing.",
    "Oh you are doing so well, the [plant name] [hasn't/haven't] finished growing.",
    "To add insult to injury, the [plant name] [hasn't/haven't] finished growing.",
    "And finally, the [plant name] [hasn't/haven't] finished growing.",
    "One suggest you learn a little patience. These plants should not take long to grow - these patches have been filled with extremely fertile soil that was very expensive to import.",
    "One finds that hard to believe. Out of my way, let me see for myself.",
    "Oh yes, very nice, if a little yobbish. Rollie will be so pleased–",
    "You will address my husband by his proper title!!!!! Speaking of whom, I think it is time that we brought him to see his new garden. And when one says we, one means you.",
    "So are you going to get Rollie then?",
    "Well hurry along peasant. This garden will be such a wonderful surprise!",
    "Ah, Rollie, my love!",
    "Behold: your new garden!",
    "Rollie?",
    "One has gone to great pains to provide you with this beautiful garden... YOU COULD SHOW ONE A LITTLE GRATITUDE!",
    "SILENCE! Well? Are you going to thank one, Rollie?",
    "SPEAK UP, I CAN'T HEAR YOU!",
    "Much better. Now, get back to the castle and rule our kingdom – there's a good monarch.",
    "Excuse my husband, he can be so rude sometimes.",
    "Are you being rude again ... ? Yes, and that's all he deserves! Here you go, your help here has proved invaluable.",
    "Oh, let one see peasant - perhaps it is a potion for making supercompost?",
    "You wish to know how to use it? Pour it on some normal compost and it will transform into supercompost. You can do this with a bucket of compost, although it is possibly wiser to use it on a full compost bin.",
    "What, you want to dig up the plants that took one so long to grow? Don't be ridiculous, you silly little man.",
    "Impertinent peasant! Oh, if you promise to leave one alone then feel free to pick fruit from the White Tree. One is told that they are a great natural energy restorative."
  ],
  "Player": [
    "What's going on here? I see a lot of farming patches with nothing growing in them.",
    "One? I'm not sure I understand you–",
    "Ri-ight ... if you say so, my lady. I'll be off then, if you don't mind–",
    "No problem, sorry to have bothered you.",
    "Are you speaking to me?",
    "Well for a moment there I thought there was a dog around here somewhere...",
    "Well, seeing as you put it so nicely...",
    "If you're asking me do I know a gardener, then yes I do. I happen to be quite handy at farming myself, as it happens.",
    "You'll have to ask me nicely first.",
    "I'd rather jump off the docks at Port Sarim.",
    "I would be happy to help someone who is so in touch with the people.",
    "I'm not sure if that's a compliment or not. Anyway, what would you like me to do, and what do I get out of it?",
    "King Roald?",
    "Thanks, I'm sure. So tell me Queeny, how do I know which plants I am to get for you?",
    "One listens with bated breath...",
    "I have been sent by Queen Ellamaria of Varrock to seek your guidance.",
    "You know Queen Ellamaria?",
    "Really?",
    "I'll certainly look at her in a different light when I return to Varrock.",
    "I am supposed to gain some knowledge of diplomacy and persuasion from you.",
    "Charos? I must say the name rings a bell... Charos... Yes, I remember! Once, during my travels to Morytania, I came upon an item of magical jewellery called the Ring of Charos.",
    "Yes, I have it in my bag. Is it important, then?",
    "Yes, I have it stored in the bank. Is it important, then?",
    "I have the Ring of Charos and have returned to you as instructed. Now will you reveal its 'hidden power beyond belief'?",
    "Er, no - I've left it in the bank.",
    "I thought you told me to-",
    "The art of persuasion?",
    "The Ring of Charos.",
    "What happened to Charos? And why did Fenkenstrain have the ring?",
    "So what you are telling me is that nobody really knows what happened to Charos? That he could still be alive? And if he is still alive...",
    "Still – it doesn't inspire me with much confidence.",
    "Okay, go ahead...",
    "How can I re-obtain the Ring of Charos?",
    "I ... um ... 'borrowed' it from a rather shady character called Fenkenstrain.",
    "Okay, I've answered your questions – what's the verdict?",
    "Thanks for your help, Wise Old Man.",
    "I can't believe that - can I have another go?",
    "Oh well, that's that I suppose.",
    "No, I'm just a dull-headed moron, you're right about that.",
    "Can I retake the diplomacy test?",
    "Do you know how I could grow a White Tree?",
    "I think that there is something that you are not telling me.",
    "You need to chill out an stop taking yourself so seriously.",
    "A secret is a dreadful burden to have to keep to yourself.",
    "I don't see how. Tell me your secret, and I will keep it as well as you have done.",
    "What happened to them?",
    "I can fill in the rest. So where is the remaining White Tree?",
    "If I took a cutting from ... her ... then I could grow another one.",
    "You should get out a bit more and quit worrying about trees.",
    "Unless you allow me to do this she will die anyway.",
    "Then will you allow me to take this cutting?",
    "Can you remind me what we agreed about the White Tree?",
    "Here is the shoot that Dantaera spoke of. Everything she told me is true – this tree will die once I cut this shoot. Well, here goes...",
    "Ah, luckily there is another shoot here that I can cut. Better not lose this one...",
    "I have lost the cutting from the White Tree.",
    "Er, yes I know ... sorry ...",
    "I have taken the the cutting from the White Tree.",
    "Don't worry - this White Tree cutting is safe with me.",
    "Um..I'm just... savouring their sweet perfume...",
    "Please?",
    "These are the most beautiful rosebushes I've ever seen.",
    "Oh ... no, that's not true ...",
    "Er ... no ... I was just admiring them.",
    "I threw it down the Edgeville well like you told me.",
    "Oh no, I definitely wouldn't try something like that...",
    "I destroyed it like you told me.",
    "Oh no, I definitely wouldn't try something like that...",
    "la-de-da",
    "dum-de-dum",
    "Nice day for it.",
    "(whistles a happy tune)",
    "Do you have any orchid seeds to spare?",
    "Oh sorry, I didn't mean to take up your valuable time.",
    "If you tell me your problems, I may be able to help you.",
    "Try me.",
    "Yes, I was wondering about that.",
    "I can only say one thing to you – move.",
    "Times must be very hard for you.",
    "Ah, it all makes sense now – you're a psychopath.",
    "Whatever you've done, I'm sure you had just cause.",
    "*Yawn* Could you get to the point please?",
    "And what is the nature of this fee that you pay?",
    "Er, can I withdraw my offer of help now?",
    "If not yours, then whose blood are you offering?",
    "Something tells me that you actually enjoy it, really.",
    "How can you deal with so much guilt?",
    "Okay, can I have them then...",
    "That's a deal – I'll grow a patch of onions for you.",
    "Okay, I've grown those onions like you asked.",
    "I think not – I've loitered too long in this land.",
    "Oh for Saradomin's sake, just give me the seeds!",
    "What did you ask me to do?",
    "Can I have some more snowdrop seeds?",
    "Do you have any snowdrop seeds to spare?",
    "But I was told that you did!",
    "You seem to be a little irritable, my friend.",
    "I'm not concerned, I just want you to give me some snowdrop seeds.",
    "I don't like to see a fellow human being so upset.",
    "I can't take it anymore – just give me the seeds.",
    "So what ails you, my friend?",
    "Oh stop whining, it's not like you do it for free.",
    "Well, is there anything I can do for you?",
    "Don't let me stop you, there are plenty of ships missing cabin boys.",
    "So what can I do for you?",
    "How about some potatoes?",
    "Cabbages? Sounds good to me. Where do you want me to grow them?",
    "That's a deal – I'll let you know when your cabbages are ready.",
    "Okay, I've grown those cabbages like you asked.",
    "I'm not wasting my time growing cabbages.",
    "Aarrrrrghhhh! I hate cabbages!!!! Give me the seeds!!!!!",
    "What did you ask me to do?",
    "Can I have some more snowdrop seeds?",
    "Do you have any delphinium seeds to spare?",
    "I'll have you know I'm a pretty good farmer, actually!",
    "That is why I have come to an expert for advice.",
    "No, I just said that to get you to give me some seeds.",
    "Yeah, carry on – milk it for all it's worth.",
    "Not just AN expert, Elstan – they say you are THE expert.",
    "Yes, please stop right now.",
    "Oh no, I love listening to gardening stories...",
    "Somebody kill me now.",
    "Millions? Ah, just what I wanted to hear...",
    "Er ... what ... er... Yes, delphinium seeds!",
    "And what's that?",
    "So, a bunch of marigolds then?",
    "Okay, I'll grow you some marigolds.",
    "I have those marigolds for you.",
    "No, I don't have time to do that.",
    "Are you sure you don't just want to give me the seeds now?",
    "What did I agree to do for delphinium seeds?",
    "Can I have some more delphinium seeds?",
    "I might – what's the problem?",
    "Yes. They don't look too happy at the moment.",
    "I could probably help you with that, but I'd need something in return.",
    "Well, I'd like a supply of Burthorpe Vine seeds.",
    "I thought you said anything!",
    "But it is the only way that these vines will be cured.",
    "I accept the deal.",
    "I don't understand – it's worked with everything else.",
    "Do you know of any stronger cures?",
    "Why didn't you just go and ask him yourself?",
    "Actually, it seems like a lot of hard work for nothing.",
    "Can you suggest any way that I can cure these grapevines?",
    "I need to ask you about strong plant cures.",
    "Bernald has got some seriously diseased grapevines. I tried plant cure on them, but it didn't seem to have any positive effect.",
    "The very one.",
    "Er, I did have some...assistance with persuading him.",
    "Are you sure there's nothing you can suggest?",
    "Do you mean the rune essence?",
    "Thank you Alain, I will try it out immediately!",
    "You're hiding something from me.",
    "Oh, sorry. I forgot that it only works on the weak-minded.",
    "Yes. He has given me some knowledge so that I can make a more potent plant cure.",
    "How are your grapes coming along?",
    "Do you have any more Burthorpe Vine seeds?",
    "Erm...",
    "Can I have another list?",
    "How am I supposed to move statues all the way here?",
    "Push?",
    "What am I supposed to be getting again?",
    "Er ... yes I do have a list...",
    "Er ... no ... I seem to have lost it",
    "Will these patches need much in the way of watering?",
    "(Hmm. I'd better not let those guards see me...)",
    "Well, I think that's everything...",
    "Really? What haven't I finished yet?",
    "Well, I think that's everything...",
    "Rollie?!?",
    "Oh, you want me to go and get Roald – sorry ... King Roald ... and bring him here. Fair enough, wait here then, I'll be back in a mo.",
    "No, I haven't spoken to Roll ... King Roald ... yet.",
    "Hello there. Would you like to follow me for a minute?",
    "Well, if you can't be bothered then neither can I.",
    "No, you suit yourself.",
    "I'm not the one who's arguing, you are.",
    "No, you're answering me back. Well, stop talking and I'll stop answering.",
    "I have stopped talking.",
    "No, I'm just answering what you're saying.",
    "Suits me.",
    "No, you first.",
    "Yes, much better.",
    "I can't remember, it was such a long time ago.",
    "Oh well.",
    "See you around.",
    "I was until you spoke to me again.",
    "See you around.",
    "Of course, your majesty – please forgive me.",
    "That's it – I've had it with royalty.",
    "The Queen asked me to bring you.",
    "Here's some orchids from Morytania.",
    "One of the last Burthorpe vine plants!",
    "Snowdrops from Ardougne!",
    "The last surviving white tree!",
    "Delphiniums from Falador!",
    "Actually, I think I did most of the wor–",
    "Only sometimes?",
    "What's the suprcompost potion for?",
    "No, I didn't mean that-",
    "Can I use this garden for my own farming?",
    "All right then, sorry I asked."
  ],
  "Wise Old Man": [
    "Greetings, [Player]. Wait, wait, wait. Before we get started, are you here about my archaeology collection?",
    "Ellamaria? Well, if you're in her service my guidance is this: do the fastest run that you can off the shortest pier you can find.",
    "Oh yes, we go way back, long before she married that fool the King of Varrock. She wasn't always royal you know.",
    "No, in her youth she was a barmaid at the Blue Moon Inn. All that fancy talk, that's just for show. No, the Ellamaria I knew was as common as muck, until she lucked onto good King Roald.",
    "So what sort of guidance has Little-Miss-Hoity-Toity sent you to seek?",
    "That is an area that – luckily for you, young [Player] – I have studied. Have you heard of the diplomat known as Charos?",
    "You have found the Ring of Charos?!? Tell me – do you still have it in your possession?",
    "Important?!? The ring possesses hidden power beyond belief! Go and get it, and I will tell you its secrets.",
    "Greetings, [Player]. Wait, wait, wait. Before we get started, are you here about my archaeology collection?",
    "I don't see it on you - do you have it in your bag?",
    "Well go and get it then, and I will tell you its secrets.",
    "The Ring of Charos? What's that?",
    "Just joking, [Player] - good good, I will now tell you what this ring is capable of.",
    "Charos rose to power under the rule of Lord Drakan of Morytania; Charos was his only living servant. The vampyre lord suffered the existence of Charos because of the talents that this sophisticated diplomat had to offer.",
    "Indeed. Charos had many uses – spy, assassin, negotiator – because he could convince anyone to do his wishes. These talents were in some part Charos's own, but greatly enhanced by the ring that he fashioned.",
    "Exactly. One who wears the ring must possess some innate ability of their own, which the ring enhances so that the wearer can convince all but the most strong-minded to do their bidding.",
    "Charos had a castle built on the northern coast of Morytania, where he dwelt for many years in service to Drakan. None really know what became of him, but some say that he became too certain of his abilities, and turned them on his master. This would have been his ultimate downfall, for the ring's power would have had little or no effect upon Drakan. Fenkenstrain probably found the ring many years later, buried somewhere within the depths of Charos's castle.",
    "...he would naturally come looking for the ring that is his by right. But I don't believe that you should worry about that – it has been many years since his disappearance, and the likelyhood is that he is dead.",
    "I could activate the power within this ring for you, but for me to do that I must know that you will use it wisely. To do that I must ask you a few questions, to see how good a diplomat you can be.",
    "If everything I have heard about Charos's ring is true, it will not stay lost forever. Where did you originally find it?",
    "In order to find the ring it may be wise to return to Fenkenstrain - he may have found a way to regain it. If you manage to reobtain the ring, return to me and I will reveal its secrets to you.",
    "Mmmm, it was close but... Congratulations! You have clearly got what it takes to use the Ring of Charos. Wait a moment, [Player]...",
    "The Ring of Charos has now been opened to you, [Player]. You may use its power to charm the weak-minded, but it will only work whilst you are wearing it.",
    "Funny, I thought you would take the chance to test the power of the ring on me! No matter – leave me be now, I have important surveillance duties to carry out.",
    "Mmmm, it was close but... ...[sic]but I'm afraid that you don't seem to have the aptitude. To you, the Ring of Charos is but a worthless trinket.",
    "Well, if you think it will do any good ... here goes then-",
    "Now look, don't start making me feel sorry for you...",
    "I didn't say that - look, if you want another try, come back and speak to me again.",
    "Greetings, [Player]. Wait, wait, wait. Before we get started, are you here about my archaeology collection?",
    "Well, if you think it will do any good ... here goes then-"
  ],
  "Dantaera": [
    "There are no more White Trees left in the world – they have all been chopped down, and their beauty has forever left this world.",
    "Even if there were a White Tree somewhere I would not tell you, for as soon as it would grow then it would be slaughtered in its prime. Man's hunger for fire is greater than his admiration of beauty.",
    "Am I so transparent? You have seen through me; there is something I would rather not tell you.",
    "Leave me in peace then, if you are so unable to understand my grief.",
    "It is not hard to keep this secret – to give it away would cause me great sorrow.",
    "Very well – I feel deep trust in you for some reason. It is the White Tree, last survivor of a race of Trees that have disappeared from our landscape. Once they covered the land; now there is only one.",
    "Man desired the wood of the White Tree, because of its wood of pure white. Need I tell you more?",
    "She stands atop Ice Mountain, alone and sorrowful; and, I fear, that she is dying.",
    "Yes, but she only has life enough to produce one shoot. Cut this shoot, and she will die, last of her kind gone forever. If you failed to grow this shoot, there would be no more White Trees.",
    "No, I am afraid I cannot do that. She is the last White Tree, and I am the last to care about her. I will not let her pass away alone and unloved.",
    "I know, but I try not to think about that. You speak truly – she does not have much time left.",
    "Do so with my blessing. I wish you good fortune, [Player]. Go now, and save the beauty of the White Tree.",
    "The last of the White Trees stands dying atop Ice Mountain. I would greatly desire that you take her last cutting - although she is then certain to die - and cultivate her offspring",
    "I do not believe what I am hearing, after everything you said to me before!",
    "Maybe - just maybe - there might be another shoot somewhere on the Tree that you can take as a cutting. Go and havea  look, before she dies without offspring!",
    "Then it is done now, whatever happens. Though I am eager for offspring to be planted I am doubly sorrowful that she will now die."
  ],
  "Brother Althric": [
    "No you're not - you're trying to steal some seeds. Well, you can leave them alone. It's take me many months of tending to bring them to this fine state of near-perfection.",
    "No. Now leave me in peace.",
    "Nice of you to say so, but I sense the use of some unnatural power underneath your fine words. You are concealing something of great evil, an evil that cannot touch someone of my purity.",
    "Nonsense, you reek of this evil power! I suggest that you throw whatever dark talisman it is that you are using down the Edgeville well, and never think of it again! Either that or just simply destroy it!",
    "Are you messing about with my rosebushes again?",
    "Ah, I sense that you speak so without the use of the evil power you carried before. That is good. As you have taken the road back towards the light, you may take any seeds that you wish.",
    "That is good. Although it could always be regained by someone using an implement long enough to reach the bottom of the well, something with a hook on the end to catch the ring with. I hope I haven't put any ideas into your head.",
    "That is good. Although I sense that an evil talisman like that cannot truly be destroyed - it will probably try to find it's way back to it's master. I pray that you don't try and seek it out again."
  ],
  "Lyra": [
    "Please, do not bother me – I have problems to attend to.",
    "As you ask so nicely I will relate my problems to you, but I very much doubt that you may help me at all.",
    "You must think it strange that a girl such as myself would choose to ply her trade in a place such as this, this darkest of lands.",
    "Then begone simple fool and halt your churlish tongue. There are things about me that would leave you with nightmares for the rest of your life.",
    "My mother, Alice, tends to our farming shop in yonder farmhouse, while I tend to this small allotment. Passing trade has quite literally died off in recent years, and with it our income.",
    "And leave behind all that we possess?!? Never!!!",
    "It is but the smallest of our worries. We get by, we survive, on the miserable harvests that I grow here. The price of our survival is what pains me, as it is a price I have paid with the souls of others.",
    "You say this, but you know nothing of my crimes. I cannot tell you all, but this much I will say – that being allowed to exist in this land is a privilege that must be paid for, and the cost is dear.",
    "If your time is so pressing then leave me be and go about your business!",
    "Mother and I must pay a tithe of blood to the vampyres. Father would have protected us, but he is no longer with us, although his presence still walks among us in the fields. We pay with the blood of others.",
    "I would not talk so if I were you - I know a secret call that will bring the vampires here right now, and then you may live only long enough to feel regret for your impertinence.",
    "Sometimes I travel to market fairs in distant lands, and I use my feminine arts to lure young farmers back to this land; then the vampyres come for them and I see them no more.",
    "Please – ask me no more. You said that you were looking for some orchid seeds? I do have some as a matter of fact, and you may as well have them because they do not grow well in this grim land.",
    "You must pass a test first. These are no ordinary flowers, and no ordinary farmer can grow them. You must grow onions here in one of these patches, and when they are fully grown I will give you the seeds.",
    "Speak to me when they are fully grown. You need not pick them for me, I will be able to assess your skills by simply watching you.",
    "Yes, you have demonstrated that you have some moderate skills as a farmer. Take these seeds, and do with them that you will.",
    "Yes, I agree - far too long.",
    "This feeling in my head - it is so strange - and it is a feeling I have felt before, although I cannot explain it. If you are trying to use some unnatural power over me, you have failed.",
    "I need you to grow some onions in one of these vegetable patches, from seed until they are fully grown - then I will give you some orchid seeds.",
    "Yes, here you go - I hope they grow for you."
  ],
  "Kragen": [
    "No I don't, as it happens. Sorry.",
    "Well, you were told wrong then! Goodbye!",
    "Oh, you think so?!? And what concern is it of yours?",
    "Is that right?!? Well, I do actually have some snowdrop seeds, but you would be the last person I would give them to.",
    "I must say, you don't often meet people who show concern the way you have done.",
    "And to think I listened to you! I was right fter all - there is no kindness between human beings anymore.",
    "All these people, asking me to look after their crops! And no-one ever asking me how I feel, or if there's something they can do for me!",
    "Oh, that's very kind of you! And here I was, thinking of giving it all up and heading off across the seas to find my fortune!",
    "If you carry on speaking to me like that I might just put this spade to good use, and I'm not talking about digging!",
    "I'd like just for once for somebody to grow something for me. Just something simple; some vegetables would be nice.",
    "Nah, there's a whole field of them over to the west. I don't have any particular use for onions, so how about cabbages, then?",
    "Oh, in one of these allotments here. Plant them from seed, and when they're ready for harvesting let me know, I'll give you your seeds.",
    "Yes, I saw – what fine farming prowess! Nobody has ever done anything like that for me before; here you go, these are the seeds you were after I believe. Yes, here you go – I hope they grow for you.",
    "And I'm not wasting my seeds on an upstart like you!",
    "Give ... you ... the ... yes I should ... no I won't ... Not after speaking to me like that you upstart!!! Is it a deal or not?!?",
    "You said that you would grow me some cabbages in one of these allotments. When they're ready for harvest come and talk to me, and I'll give you those snowdrop seeds that you're after.",
    "Yes, here you go - I hope they grow for you."
  ],
  "Elstan": [
    "I do have delphinium seeds, yes – but to spare, I'm not so sure. You don't look like that much of a gardener to me.",
    "Ah, now that I like the sound of. So people are saying I'm an expert, then?",
    "Really?!? Well, give me any more of that kind of talk and I'll give you something to remember me by, and I'll tell you now it ain't seeds!!",
    "What?!? Any more of that talk and it'll be curtains for you, mate!",
    "I can't say that I'm surprised, really – I do seem to have the golden touch with the old gardening lark. Only just the other day I managed to grow a – I'm not boring you, am I?",
    "As a matter of fact I will! I'm not wasting my time on the likes of you!",
    "You do! That's the first person I've ever met has said that! Well, don't you worry mate, I've got millions of 'em!",
    "Ah, but there's plenty of time for stories. You wanted delphinium seeds, did you say?",
    "As I'm in an especially good mood I think I will let you have some. But you have to do something for me first.",
    "I need some marigolds to give to Lyra, one of my fellow gardeners over in Morytania. She's a bit mysterious, and has some – well – sinister ways to be sure, but she's just my type.",
    "Yes, and while I'm at it I can see how good a gardener you are. Grow those marigolds in this flower patch here from seed to flower, pick them and give them to me, and I'll give you some delphinium seeds.",
    "Ah, fantastic – Lyra will surely be mine now! Here you go mate, here's those delphinium seeds you were after. Yes, here you go – I hope they grow for you.",
    "Have it your own way, mate. No seeds for you then.",
    "Strange - there is this funny buzzing in my head that says that I should - but I don't think I will. I need those marigolds for Lyra.",
    "I need some marigolds so that I can woo Lyra. Grow them from seed to flower in this flower patch here, pick them and give them to me, and I'll give you some delphinium seeds.",
    "Yes, here you go - I hope they grow for you."
  ],
  "Bernald": [
    "Do you know anything about grapevine diseases?",
    "You see those grapevines over there?",
    "They've come down with some strange disease that I've never encountered before. I've tried everything with them, but nothing seems to work. If it carries on like this I will lose all this year's crops.",
    "Anything, you just need to ask!",
    "I'm afraid I can't do that.",
    "I'm afraid that is the one thing I cannot give you. Burthorpe vine has been bred over many years and many generations of my family. I could never give away something so special. I mean, we almost lost the plant to the troll invasion. I have worked as hard as I can to keep these vines alive down here, but the soil is all wrong.",
    "Hmm, you may be right. If I lose these crops what use are more seeds to me, when I have gone out of business? Very well then, this is the deal – cure my vines and I will give you some Burthorpe Vine seeds.",
    "Oh, thank you! Please speak to me again when you've cured the vines and, hence, saved my livelihood and an important part of Burthorpe's history.",
    "Plant cure not doing the trick, eh?",
    "That grapevine disease must be much stronger than the usual. You'll need something a bit more potent to cut out that infection.",
    "No, I don't – but I know of a man who might. Not far from here there's a druid gardener who goes by the name of Alain. He's an expert on things like this, so they tell me.",
    "These vines are very precious indeed. I could not hazard the risk that someone would steal my grapes while I was away – they may be diseased, but they still contain Burthorpe vine seeds.",
    "I wouldn't call the last living example of this rare plant 'nothing' if I were you. Very well, I shall find someone else to assist me.",
    "I thought you were the one with horticultural knowledge here. How would you normally cure plant diseases?",
    "Have you spoken to Alain yet?",
    "Let's hope that it does the job, then.",
    "My vines are cured! You have worked a wonder here, [Player]! Here, you can have those seeds like I promised. Yes, here you go – I hope they grow for you.",
    "Marvellously, thanks to your help, Player.",
    "What did you do with the ones I gave you?",
    "Yes, here you go - I hope they grow for you."
  ],
  "Alain": [
    "Well, then, you've come to the right person – I researched exotic plant diseases as part of my druidic training. What is the affliction that you need to cure?",
    "Ah, so is this the famous Burthorpe Vine?",
    "I'm afraid that my research did not extend to Burthorpe vine. Bernald and his ancestors have always closely guarded their heritage. In fact, I'm surprised that he has involved you. Although I am pretty sure that it is a sign of how desperate he must be. Those vines were all burned or eaten by the trolls when they invaded, after all. If the vine is sick he must be at the end of his teather.",
    "I see. Well, if it involves some unnatural power I would rather not know. I prefer the use of power that can be brought forth from the plants around us.",
    "Well... There is one thing you could try. One of the most potent cures I have discovered involves using the natural power held within a very special mineral, but it is a very closely guarded secret.",
    "You know of that?!? Then I can do no further harm here. You can make a potent plant cure by mixing some crumbled rune essence into a normal plant cure. This may possibly cure Bernald's vines.",
    "This is the power you are abusing!! I feel it now – it emanates from the ring you wear, a festering fountain of corruption that appalls my very soul!!!",
    "You, [Player], are the one who must be weak-minded, if you consider using such a dreadful weapon. Beware – it may one day be your downfall."
  ],
  "Billy, a guard of Falador": [
    "So, what are you doing this weekend?",
    "What do you mean?",
    "No. How long is it?",
    "Thirty seconds? They didn't tell me that when I signed up!",
    "But why, Bob? What have we ever done to them?",
    "Bob?",
    "But..."
  ],
  "Bob, another guard of Falador": [
    "This weekend? You haven't been here long, I take it?",
    "Do you know the life expectancy of a guard here?",
    "About thirty seconds, I reckon.",
    "Any second now, someone is going to attack us for no apparent reason, completely unprovoked.",
    "I don't know, Billy. I just don't know. But I'm not wasting my final seconds worrying about it.",
    "Uhoh, someone's coming...",
    "Steady, Billy. Remember that you are a guard of Falador.",
    "See you in the next world..."
  ],
  "King Roald": [
    "Follow you?!? I am the King! I am the followed, not the follower!!",
    "Suit yourself.",
    "You're quite argumentative for a peasant.",
    "Then why do you keep answering me back?",
    "No, you stop talking.",
    "No you haven't, you're doing it now.",
    "Okay, so if I don't say anything, you won't answer me back.",
    "Go on, then.",
    "See, that's better.",
    "What were you saying about me following you somewhere?",
    "Ah, that's a shame – I could have done with a breath of fresh air.",
    "Yes, never mind.",
    "Yes, see you later.",
    "I thought you were going.",
    "I'm sorry, I'll stop speaking to you then.",
    "Yes, see you later.",
    "Forgiveness is something that cannot be earned so easily. And I'm certainly not following you off on some wild goose chase when I have important matters of state to attend to.",
    "And I've had enough of peasantry! Get out of my castle!",
    "Ellie? Now that's a different matter. Lead on, peasant – let's see what my darling wife has been up to now.",
    "This is murder on my hayfever, you know...",
    "What have you been up to now, pumpkin?",
    "Have you been spending my money again?",
    "Orchids bring me out in a rash.",
    "Oh, great, let's hope they don't eat into the walls.",
    "What a boring colour.",
    "Should make a nice table and chairs.",
    "I hate delphiniums.",
    "Yes, pumpkin?",
    "Ow!",
    "Pumpkin, I–",
    "Thank you very much, my darling. It's a, er, beautiful garden. Really it is.",
    "Yes, pumpkin."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Garden_of_Tranquillity?oldid=36122594’"
  ]
}