{
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "Missing dialogue for choosing wrongly in choicesYou can discuss this issue on the talk page or edit this page to improve it."
  ],
  "Player": [
    "What's going on here?",
    "Travelling firemaker? What does that involve?",
    "So what are you doing here?",
    "This seems dangerous. Why put your lives at risk?",
    "What are you waiting for?",
    "Of course!",
    "Yes, let's go.",
    "I'm Player.",
    "No, I'd like to get to know you all first.",
    "No, I need to do some other things first.",
    "How did you find out about this?",
    "So you're going into this dark, dangerous-looking cave because someone in a dream told you to?",
    "I have to go.",
    "What are you doing here?",
    "I have to go.",
    "Yes!",
    "No, I'd like to know a bit more about you first.",
    "I see.",
    "No, I need to do some other things first.",
    "What's your name?",
    "What's wrong?",
    "And you chose Twig?",
    "So you're the one with the vision?",
    "Who do you think spoke to you?",
    "Weren't you scared?",
    "Do you often have visions?",
    "Hi.",
    "I don't think I have time to tell you all that now!",
    "I'm just trying to get to know you all better before I come with you.",
    "You don't look old!",
    "You do look pretty old...",
    "What's the rush?",
    "How did you find out about this?",
    "So you're going into this dark, dangerous-looking cave because someone in a dream told you to?",
    "How did you get into Firemaking?",
    "Weren't you upset?",
    "Why do you want to know Char's secrets?",
    "So you follow the voices in your head?",
    "Don't listen to them then!",
    "It looks quite secure to me.",
    "Thanks.",
    "There's nowhere to go. It's just a cave.",
    "What do you think of the fires?",
    "So, you must have a personal reason for wanting this knowledge.",
    "That's all, thanks.",
    "Are you going to take it or not?",
    "Fine.",
    "Who are you?",
    "What plan?",
    "He didn't betray us. You killed Phoenix!",
    "What do you want from us?",
    "What do you want from us?",
    "We must continue through the caves.",
    "I don't know about you, but I'm teleporting out of here.",
    "There was nothing you could do.",
    "Yes! You're a monster!",
    "Are you ok?",
    "Why Lina?",
    "Who's Ignatius?",
    "Why do you care about Ignatius so much?",
    "That's all, thanks.",
    "This seems like the only way out.",
    "These are your journals?",
    "Sorry, who are you?",
    "Sorry.",
    "Who is Zaros?",
    "Did you say Zaros?",
    "But you did mention him?",
    "Were you close to Zaros?",
    "How did you evade death?",
    "What happened to you?",
    "How do you feel?",
    "Who do you think is possessed?",
    "That's all, thanks.",
    "How do you feel?",
    "Who do you think is possessed?",
    "Char!",
    "Never mind!",
    "That's all, thanks.",
    "How do you feel?",
    "Who do you think is possessed?",
    "That's all, thanks.",
    "How do you feel?",
    "Do you like fire, then?",
    "Who do you think is possessed?",
    "That's all, thanks.",
    "How do you feel?",
    "Who do you think is possessed?",
    "That's all, thanks.",
    "How do you feel?",
    "Who do you think is possessed?",
    "That's all, thanks.",
    "Will you tell us what happened to you now?",
    "Zamorak!",
    "Yes, he's a fantastic god!",
    "Yes, he's terrible, hateful god.",
    "Yes, he's a Mahjarrat.",
    "No, I haven't heard of him.",
    "Who's Zamorak?",
    "What happened on the mission?",
    "How did you get into firemaking?",
    "Why haven't I heard of you, then?",
    "That sounds amazing! Do go on!",
    "Who do you think is possessed?",
    "I have to go.",
    "How did you get into firemaking?",
    "And you thought firemaking was a good career choice for that?!",
    "Who do you think is possessed?",
    "I have to go.",
    "How did you get into firemaking?",
    "Your what?",
    "Weren't you upset?",
    "Who do you think is possessed?",
    "I have to go.",
    "How did you get into firemaking?",
    "Who do you think is possessed?",
    "I have to go.",
    "How did you get into firemaking?",
    "Not about you! Why?",
    "Who do you think is possessed?",
    "I have to go.",
    "How did you get into firemaking?",
    "Who do you think is possessed?",
    "I have to go.",
    "What did Zamorak do to you?",
    "Why do you want to know Char's secrets?",
    "Who do you think is possessed?",
    "I have to go.",
    "Why do you want to know Char's secrets?",
    "But they could make you a great firemaker!",
    "Who do you think is possessed?",
    "I have to go.",
    "Why do you want to know Char's secrets?",
    "So you follow the voices in your head?",
    "Don't listen to them, then!",
    "Who do you think is possessed?",
    "I have to go.",
    "Why do you want to know Char's secrets?",
    "Who do you think is possessed?",
    "I have to go.",
    "Why do you want to know Char's secrets?",
    "Who do you think is possessed?",
    "I have to go.",
    "Why do you want to know Char's secrets?",
    "Who do you think is possessed?",
    "I have to go.",
    "What are you going to do?",
    "What would you most like to do in your life?",
    "Who do you think is possessed?",
    "I have to go.",
    "What would you most like to do in your life?",
    "Who do you think is possessed?",
    "I have to go.",
    "What would you most like to do in your life?",
    "I think you're already with them!",
    "Never mind.",
    "Who do you think is possessed?",
    "I have to go.",
    "What would you most like to do in your life?",
    "Who do you think is possessed?",
    "I have to go.",
    "What would you most like to do in your life?",
    "Who do you think is possessed?",
    "I have to go.",
    "What would you most like to do in your life?",
    "You live with Ignatius Vulcan?",
    "But you hate him!",
    "Who do you think is possessed?",
    "I have to go.",
    "What do you suggest?",
    "What?",
    "Ok then, I'll do it.",
    "That's a good idea.",
    "Can we leave now?",
    "I didn't mean to help you! I want revenge!",
    "Char, a life has/lives have been lost here, by your hand. I am going to honour him/them, and make you pay!",
    "(before The Temple at Senntisten) Zaros is returning?",
    "(after The Temple at Senntisten) How is Zaros going to return?",
    "How are you going to do that?",
    "How do we get out?",
    "What will you do now?",
    "What?",
    "I'd like to talk to you about Zaros.",
    "But when I was with Azzanadra-",
    "I know him! I helped him contact Zaros himself.",
    "I didn't want to say it in front of the firemakers... And you did seem quite distracted trying to kill us.",
    "What plans? What others?"
  ],
  "Phoenix": [
    "Ah, friend! Welcome! Let me introduce you to my band of travelling firemakers!",
    "Well, we are all fire enthusiasts.",
    "A just question, my good fellow[-ess]! We believe that in these very caves lie firemaking secrets the likes of which you could never imagine. This knowledge has lain undisturbed for thousands of years, and we are going to retrieve it!",
    "Count yourself as the newest member of our firemaking group! I'd recommend you get to know the group well.",
    "Such enthusiasm! What's your name, by the way?",
    "Oh, what a terrible name. Never mind...",
    "A good plan! Let me know when you're ready.",
    "Isis hasn't failed us yet. We've never acted on one of her visions before, but I'm confident about this one. Besides, this is potentially far too important to ignore.",
    "Are you ready to go?",
    "Well, the others wouldn't admit it, but I'm the natural leader of the group. They're all wonderful individuals, but they need someone to follow; to keep them focused and on the right track.",
    "So are you ready to go now?",
    "Oh, well, let me know when you're ready.",
    "Isis never failed us before. We've never acted on one of her visions before, but I am confident about this one. Besides, this is potentially far too important to ignore.",
    "Ah, the wonderful smell of... gas and oil. Come, brave adventurer! Secure the room!",
    "Well, let's move on then.",
    "Yes! Fires created by a terrible monster!",
    "Of course. I was just testing your nerve!",
    "Ah, all of these are reasons I'm here. I know my firemakers have all their hopes resting on this; I am satisfied just giving all my effort so that they may achieve it.",
    "Player, save us!",
    "It's come to kill us all! SAVE YOURSELVES!",
    "Player! Find something to light!",
    "Trapped! Doomed!",
    "This must be one of the journals, containing the knowledge we are searching for! What luck! Held in these caves for thousands of years! What secrets it could hold, what-",
    "Oh, no, I couldn't possibly trust myself with it. Player, you must look after it until we can find our way out of here.",
    "Foul spirit! We are ferocious firemakers! Begone from this place!"
  ],
  "Lina": [
    "We travel and entertain with our firemaking skills! It's very exciting!",
    "Will you protect us?",
    "Oh my gosh! So, are you a real adventurer? Where have you been? What kind of people have you met?",
    "I'm just so glad you're here to look after us!",
    "What about those fires?",
    "Player, you must be able to work this out!",
    "They look like a pattern, don't they? Some kind of arrow, perhaps. Come on, Player! I'm sure you can do it! You must be so clever to have had all your adventures.",
    "I'm just excited to be on my first adventure!",
    "I'm scared!",
    "There must be something you can do, Player. Can't you find something to help us?",
    "Quickly! Relight the fire!",
    "I'm just so shocked. Phoenix was so kind to me. I can't believe he's gone.",
    "That means someone is going to die.",
    "I am very afraid, Player, but I'm much better with the fire going.",
    "Oh, yes! I adore fire. The flames are so beautiful; I could sit and watch them for hours. And the warmth is so calming; so comforting. It makes me forget about how terrible this is.",
    "I couldn't choose anyone! Besides, your judgement must be so much better than mine.",
    "It's okay, Twig. It's over now.",
    "It's a silly story.",
    "(If Flint is dead) Not that it matters anymore...",
    "Flint raised me, so I was always interested in fire. The first fire I made was when I was 10; I took one of his inventions that made sparks. I used it outside the house, and it threw a spark on to a poor chicken! The chicken was fine. Just a bit singed.",
    "I couldn't possibly say. Emmett is acting strangely, but he always does.",
    "I'm not so excited about the secrets really. Who cares about some dusty old books? I just wanted to come on an exciting adventure, although it's turned out to be more of a nightmare.",
    "(If Flint is dead)I don't care anymore. I just wish Flint was still here.",
    "(If Flint is still alive)I couldn't point the finger at anyone.",
    "Well done, Player. I knew you could do it.",
    "Yes; this cannot be in vain. We must get out.",
    "I want to be an adventurer like you, Player!",
    "I don't want to choose anyone, Player. What if I got it wrong?",
    "Please look after us, Player.",
    "Please look after us, Player.",
    "Well done, Player! I always knew you could do it!"
  ],
  "Emmett": [
    "I was in the circus!",
    "Ah, the great outdoors! Isn't it wonderful?",
    "It could get me back into the circus...",
    "Through me. I couldn't stop it. She was in my head! I could feel her. Her name is Char. I couldn't fight her, and I have taken a life.",
    "What if she's right? What if I could have fought harder?",
    "Thank you, Player, but it is of little comfort.",
    "No one else is going to die down here!",
    "Why do you want to know? Why is everyone looking at me?!",
    "If you ask me, Twig is acting strangely. I would have thought he'd be crying in a corner by now. And he keeps looking at me.",
    "All I can say is Char is turning out to be quite a woman. Did you see all the fire in there?",
    "Ah! Let me tell you about my younger days! I was an entertainer at Balthazar Beauregard's Big Top Bonanza! The greatest show on earth, and I was the star!",
    "Ah, well. My life at the circus was not meant to last. I'm not sure if you've noticed but... I really like fire. There was an incident, things were burnt. Let's say no more. So I ended up here.",
    "Ah, life at the circus was fantastic. But it was not meant to last. I'm not sure if you've noticed but... I really like fire. There was an incident, things were burnt. Let's say no more. So I ended up here.",
    "WHY DOES EVERYONE THINK IT'S ME?",
    "The fire, Player! I must learn more! Learning to control the raging flames... the towering inferno! Flaming creatures blazing across the sky, burning!",
    "What was it you wanted?",
    "Every time! Why do you think it's me?",
    "We're all going to die down here.",
    "To perfect my firemaking skills, of course. To become a true master of the flames!",
    "It could be anyone.",
    "Player, wait! From the looks of it, this is the last journal. We don't know what Char could be planning. Knowing her, it's probably fantastic. But deadly.",
    "You should tie us all up.",
    "You have shown strength against Char's powers. You can defend us from her.",
    "Player, your pitch can fires seem to give you power. Keep as many as you can going to do more damage to Char!",
    "What a fantastic show.",
    "Did you see that? All that fire! She was fantastic!",
    "TO THE CIRCUS!",
    "I'm going to convince Balthazar to give me another chance.",
    "You should join us at the Big Top Bonanza to sample some of our firemaking wonders!"
  ],
  "Sera": [
    "Personally, I would put anything at risk to increase my knowledge of fire.",
    "Yes it's very exciting... Can we go now?",
    "Will you just hurry up and let us get on with it?",
    "I've got things to do! The sooner I get those secrets, the better!",
    "Speak for yourselves. Put the knowledge in a museum and just let it rot there? What a waste!",
    "Oh, this just keeps getting better and better!",
    "I agree. Char has taken the life of one of our group. We need to reach her and make her pay!",
    "Come on, firemakers. Char has taken the life of one of our group. We need to reach her and make her pay!",
    "I don't care who this 'Char' is. She has no right to play with our lives like this. At least the journals weren't made up; I might go back with something over Ignatius.",
    "Ignatius Vulcan, of course. Supposedly the greatest firemaker of our age. Although, the fact you haven't heard of him cheers me up a bit. I'll be sure to tell him.",
    "I'm fed up of him acting as if he's the only person who knows how to make a decent fire. He was my mentor, you see. When I met him, I hadn't made a fire in my life. He taught me all the skills he knows, but he reacted badly when I experimented by myself and discovered a thing or two that even 'the great Ignatius Vulcan' hadn't mastered. I owe the basis of my knowledge to him, but I have made it my life's goal to create a fire greater than his.",
    "Not necessarily, Lina.",
    "How should we know who's possessed?",
    "Fed up! I've missed hours and hours of training because of this! I'd better have something to show for it, or Ignatius will never let me live it down.",
    "I have no idea. I'm afraid I wasn't paying attention; I was considering the best combination of logs to use to create my next masterpiece.",
    "Look on the bright side; at least you didn't kill anyone.",
    "Come on, we need to get the next journal.",
    "Oh, I've been firemaking since I was a child; it just comes naturally to some people.",
    "Well, it's been Emmett and Twig so far ... perhaps Char doesn't possess girls?",
    "How dare she possess me?! 'I've been firemaking since I was a child' indeed; what a terrible liar!",
    "Char had better show herself soon. We'll give her what she deserves!",
    "I hope the secrets will give me the edge over Ignatius, so I can shut him up once and for all. I may share them with him, but only after he admits I am the better firemaker!",
    "Emmett is very twitchy... but I suppose he always is.",
    "It's not over yet. We need to get to the next camp. And Char said she'd be 'dealing' with us face-to-face.",
    "Well, of course I would like to finally beat Ignatius. But, once I have accomplished that... I've always wanted to travel. This is really the furthest I've been from Ignatius in years.",
    "Oh...yes. I thought you would have been told by now. Ignatius and I are partners.",
    "I never said that! We just have a fierce rivalry when it comes to fires!",
    "I really have no idea.",
    "Whatever it is, we'll be ready for her. Right, Player?",
    "Come on, Player, you can take her down. Do it for Phoenix.",
    "Come on, Player, you can take her down. Do it for the friends we've lost.",
    "He's right, we need to be on our guard.",
    "He's right, Player. We are not warriors. You must protect us from whatever she has planned.",
    "Even so, we should never have had to lose anyone down here.",
    "No, Emmett, she was childish and vengeful. We lost a friend/friends here. Thank you for your help, Player. We may not be in daylight again if it weren't for you. You should keep Char's secrets: you have earned them.",
    "We will be joining Emmett; he will need serious backing to persuade the Ringmaster.",
    "See you there, Player."
  ],
  "Flint": [
    "This knowledge could be extremely valuable, historically. It belongs in a museum, and it is our duty to retrieve it.",
    "We don't know what could be down there. We're firemakers; not adventurers.",
    "What can I do for you?",
    "Ah, well, I'm not sure there's much I can tell you about myself. I'm getting boring in my old age.",
    "That's very kind of you to say, but I sure feel it around this lot.",
    "Thanks for reminding me. It's not like I get enough of that hanging around with this lot.",
    "Player, if you're going to be making fires, you should take this. It's something I invented for places lacking in wood. It's a pitch can. You can light the pitch directly to create a fire in front of you, or where you stand. You don't need logs, but the fires are much hotter than usual, so you won't be able to jump over them like wood fires.",
    "There is clearly no monster here. Those are just oil fires.They seem to be arranged in some kind of symbol, but some have gone out.",
    "Ah, we all have our reasons. Personally, I'd like to see it properly preserved rather than lost to the ages.",
    "Everyone calm down; it's just a cave-in. We need to get some light in here.",
    "Everyone calm down. Player, we need to find something to light.",
    "We should have been far more prepared before coming here.",
    "But she wasn't in the room. How could she have done it?",
    "Char said she had taken another of our group. It could be any of us. We should keep an eye out for abnormal behaviour. Player, Char seemed to speak to you directly, so it is unlikely you are possessed. You should watch out for any of us acting unusually.",
    "Player... You know, we are just firemakers. We have no way of getting out of here without you. If you don't return, you condemn us all to slow, painful deaths down here.",
    "Char said she had taken another of our group. It could be any of us. We should keep an eye out for abnormal behaviour. Player, Char seemed to speak to you directly, so it is unlikely you are possessed. You should watch out for any of us acting unusually.",
    "We should never have come here. We're all in terrible danger. Player, if something should happen to me, promise you will look after Lina.",
    "I care for her as my daughter. I found her when she was a tiny baby, all alone on the plains. Saradomin knows how she had survived. I raised her as my own child. I couldn't bear it if anything were to happen to her.",
    "They have a point. We don't know what Char has in store for us, but we are certainly unprepared. Char said there was going to be another camp like this. Player, scout ahead; we'll join you when you discover it.",
    "This must be the camp Char was talking about.",
    "The next cavern is blocked; it looks like we need to retrieve that journal to move on.",
    "It sounds like we need to establish who might not be themselves. Player, Char seems to speak to you directly, so I doubt she would possess you. Therefore, you will need to find out who it is.",
    "I feel like I'm too old for this. I was going to stay at home, you know. Let Lina come by herself, but I thought she was too young and it could be dangerous. Thank Saradomin I changed my mind.",
    "It's difficult to tell, and I wouldn't like to accuse someone without grounds. I'd watch for changes in people's personalities, or their actions. Small things that could go unnoticed, you know?",
    "We just need to be on our guard for next time.",
    "Come on, Twig, we've made it this far.",
    "Well, he was a Mahjarrat, but he's a god now.",
    "Player! How can you not have heard of Zamorak? He's a god; the terrible god of chaos.",
    "Have you been talking to Lina?",
    "Ah, I do apologise, Player. My younger years are not pleasant memories for me; I'd prefer not to talk about them.",
    "Sera is being unusually friendly, and she hasn't mentioned Ignatius once at this camp.",
    "Let's just keep moving.",
    "Ah, Player, my main reason is to get them to a museum, of course, so they can be properly preserved. But between you and me, I quite like the idea of having my name on the discovery. Got to have something to show for myself, eh?",
    "There's something off about Twig, but I can't quite place what it is.",
    "Not necessarily, Emmett. We must continue on and not lose hope.",
    "Ah, Player, I'm getting on! I've had a good life, really. I'd just like to see Lina get everything she wants in life.",
    "I don't want to make false accusations, but Twig has been possessed more than once. Perhaps he is more susceptible to it.",
    "I have to commend you; the speed at which you moved! I was exhausted just watching you."
  ],
  "Twig": [
    "We're s-s-scared!",
    "Oh... um... oh d-dear...",
    "It's T-Twig! Sorry, I'm s-still getting used to it. It's a n-nickname I chose j-just before c-coming out here. It's meant to s-signify a new, b-b-braver, more adventurous me!",
    "In hindsight it p-probably wasn't the most s-suitable name for a firemaker.",
    "A m-m-monster?",
    "Spiders? I was b-born in Lumbridge, and never left. I'm h-hoping this experience will extend my s-skills and g-give me some c-c-courage!",
    "M-m-monster!",
    "We're t-trapped!",
    "W-w-what d-d-do you think that wa-",
    "Have we considered that Emmett might be lying; that he killed Phoenix himself?",
    "I'm just saying; what's to say it wasn't him?",
    "Could be anything.",
    "Uneasy, Player. I still can't believe everyone is trusting Emmett so readily. If you ask me, he's always had it in him.",
    "Well, it was Emmett last time. How do we even know he was 'possessed'?",
    "She was in m-my head. She was so f-furious...b-but such grief. I f-felt so alone.",
    "We're n-never g-going to make it out alive.",
    "Oh, I've been p-petrified of everything since I was a ch-child.",
    "N-N-No, my parents thought it might cure me of my f-f-fears.",
    "I d-don't know. I hope it's not me again.",
    "I don't think I'd like that.",
    "After this, I'm not sure I do!",
    "M-maybe, but I doubt it. Born with a name like 'Twig', how good a firemaker could I ever be?",
    "I think it's Emmett. He's acting so s-strangely.",
    "I s-suppose we'd b-better get this j-journal.",
    "I'd like to live to see d-d-daylight again! I n-never thought I'd be so excited to g-go back to Lumbidge!",
    "I have been p-possessed twice. I should have a good sense of who it is, b-but it seems I'm useless at that too.",
    "She s-said we should be p-p-prepared! What c-could she m-mean?!",
    "Player, you're our only h-hope at g-getting out of here.",
    "Player, you're our only h-hope at g-getting out of here."
  ],
  "Isis": [
    "It came to me in a dream! There I was, lying in bed one night, and suddenly I was whisked away to these caves. There was oil and fire everywhere, and then a voice spoke to me. Such an empty voice... It whispered to me about lost secrets of fire, while a book and a figure shimmered in and out of view before me in the heat.",
    "Yes!",
    "Hi!",
    "That's me!",
    "If I were to guess, it was a male voice, but I'm not sure. I just remember it being so emotionless; so empty.",
    "Oh no! It was a very commanding voice, but not unkind.",
    "Not too often. Only once a week or so. My parents always said the spirits favoured my brother...",
    "It came to me in a dream. There I was, lying in bed one night, and suddenly I was whisked away to this caves. There was oil and fire everywhere, and then a voice spoke to me. Such an empty voice... It whispered to me about lost secrets of fire, while a book and a figure shimmered in and out of view before me in heat.",
    "Yes!",
    "Oh I got my calling. I never used to be a firemaker, then one day I came home to find out my house was burnt down! That's when I knew.",
    "Of course not!",
    "I am not here for her secrets, really. The voice in my vision just told me to come, so here I am.",
    "Oh of course not! If I done that I'd have done all sorts of terrible things!",
    "But there must be; I walked through countless caverns in my dream!",
    "I'm just so curious about what could be down here. Unless it's spiders.",
    "What happened to the lights?",
    "Phoenix! It must have been that spirit!",
    "Player? What should we do?",
    "Twig! How could you say that?",
    "Emmett would never do that. He's as soft as a kitten.",
    "What do you think's down there?",
    "Oh, same old.",
    "Someone is possessed? By what?",
    "Oh, of course! Where are they? I was possessed once, many years ago. I'm sure I could sort them out with some of my exercises.",
    "Emmett! She's trying to kill us!",
    "Oh, I got my calling.",
    "I never used to be a firemaker, then one day I came home to find my house had burnt down! That's when I knew.",
    "Of course not!",
    "I'm not getting a feeling about anyone. I'm afraid I can't help.",
    "I think I just saw a spider.",
    "Perhaps this is all a dream. I once had a dream that lasted weeks and weeks... At least, I think it was a dream...",
    "I am not here for her secrets, really. The voice in my vision just told me to come, so here I am.",
    "Oh, of course not! If I done that I'd have done all sorts of terrible things!",
    "This is terrible, I'm just not getting a feeling from anyone. These caves must be interfering with my auras.",
    "I'd like to go and meet the fairies!",
    "You do? Where are they? I can't see them!",
    "I'm sorry, I was distracted. I completely forgot what we were doing.",
    "No! Twig!"
  ],
  "Unknown": [
    "ZAMORAK? DO NOT HIDE FROM ME, COWARD! YOU HAVE MADE A MISTAKE COMING BACK HERE. I – I.. What is this? Who are you?",
    "Firemakers? What- What have you done? I can no longer sense my god. Zamorak's plan... he must have succeeded. And I did nothing to stop it.",
    "You, 'firemaker'; you dare to speak to me? Puny beasts. What gives you the right to be here, to awake me to my loss? I had expected... well, it does not matter now. You can still be of use. Let's play a little game."
  ],
  "Char": [
    "How does it feel, intruders, to be betrayed by your own friend?",
    "By his hand! Could he have resisted me if he had tried harder? Was there a part of him that wanted to taste blood? Oh, it's in all of you - I can see it. You will learn my pain; what it is to be betrayed.",
    "I'm just having a little fun. It's not like I have anything else now. Now, if this is a game, it's only fair that I explain the rules. I will allow you to pass through my caves, but you have seen what I can do. I have taken the mind of another of your party. At the next camp, you may discover that another life is lost. However, I will give you a chance. If you can identify who is possessed, you can avoid any death. Enjoy yourselves!",
    "I may not have all my powers back yet, as you have seen, I can still take energy from any fires you create. Let's see if you can get to the exit in time. You and your little friends may find it a bit painful in the dark.",
    "Do not mistake reaching this camp for any kind of achievement. I knew my powers would be lost when I awoke, but they will return as you retrieve more of my journals.",
    "Of course. Who else's would they be? Who else would have the knowledge to write them, save for myself?",
    "You do not know me? Char: the most talented fire enchantress of Zaros's army! Swathes of enemies would flee at the mere whisper of my name, and you stand before me asking who I am...",
    "Save your apologies, they are worthless to me.",
    "You truly don't know? I suppose it is to be expected. I sense it has been so long. Zaros is a god. Not just any god; he is my god, and I believe him to be the most powerful deity ever to visit these lands. I would follow him to end of my life, but I have done even better, by evading death for him.",
    "Mortal! You are not worthy to speak his name!",
    "Of course; he is my god. I would follow him to the end of my life, but I have done even better by evading death for him.",
    "I was close as you can be to someone like him. But you are wasting my time. As part of enchantment process, I have written my life into these journals, if you're so interested in it.",
    "I wrote these journals and enchanted them with ancient Zarosian magic when I knew I was dying. I was kept alive through them all these years, waiting for Zaros to come for me.",
    "Many centuries ago, I was wronged by my own ally: Zamorak. But you distracted me, I need to regain my strength. True to my word, you may guess whose mind I have possessed. When you have chosen, tie them to one of these pillars and they will not be able to harm anyone.",
    "Let's hope you know what you're doing, for your friends' sake.",
    "Congratulations. Getting to the next camp will not be so easy. Each journal you collect returns more of my power, so you may find the next cavern a little fiery. I'm sure you'll enjoy it. And remember to watch your back.",
    "I wouldn't get too comfortable.",
    "As you can see, I have regained my power to create fire. You'll want to light the fire pits around the room. It's about to get very dark in here.",
    "It seems you are more capable than I assumed.",
    "Well... I suppose you have gotten this far. Many thousands of years ago, I was a general in Zaros's army. Zaros believed Seren was planning something on her crystalline city far away from his empire, so he sent out a scout party. This had to go undiscovered, so Zaros only sent a small group of trusted followers. I am not one to question my god, but I disagreed with this choice from the start. He chose me, of course, but the rest of part was made up of Zamorak, and selected members of Zamorak's ranks.",
    "Oh so you have heard of him, but not me?",
    "A GOD? And you PRAISE him?",
    "A GOD?",
    "A GOD?",
    "A GOD?",
    "He.. managed it? My failure is beyond imagination. Zaros is gone, and Zamorak a god? It does not bear thinking about. Zamorak is no true god. He is Mahjarrat rat; a coward! I never trusted him, or his Mahjarrat brethren. But I could not question my god Zaros...",
    "Zamorak planned it from the start. He knew I suspected him, so he needed to get me away from Zaros. Out here, in the wilds, they... I cannot speak of it. Enough. I am already feeling stronger: the faster I regain my power, the sooner I can take my revenge. The firemaker I have possessed will kill again unless you can choose the one I have taken. I hope you've been studying your friends closely.",
    "Very well.",
    "Correct again. I see you know your friends well. Let's move on, shall we? The last chamber was a mere taste of what I can do. And remember, it could be any of your little friends.",
    "You've shown you're not a fool. I don't need to tell you that this is just the beginning.",
    "So far I feel like I've been doing all the work. Let's see how good you really are at firemaking.",
    "Good. At least you have some skill...but how long can you last? You may want to keep lighting those trenches to stop my little... creations!",
    "I'll start you off slowly, shall I? This one just wants to get close to you.",
    "Try this one. It's a little more... explosive.",
    "These two can be a pain. Watch out; they have minds of their own.",
    "Let's see how you fare by yourself!",
    "Such determination to live has to be admired. And you are being so helpful to me; unlocking more and more of my power. It won't be long before I can start thinking about how I will take my revenge on Zamorak.",
    "Yes... I feel strong enough to relive this now. Zamorak had been working silently: turning his ranks against Zaros, either through bribery or purely by his vicious lies. I was at his mercy from the very beginning of our mission, and he knew nothing could sway me from my god.",
    "We were on our outward journey when we were ambushed by elven outriders. Individually, they were no match for us, but we were heavily outnumbered. In the midst of the battle, I turned to see Zamorak. He was not fighting, but walking calmly towards me. I could not have expected it; not such betrayal in the middle of our enemies. He stabbed me with a poisoned dagger. He did not mean to kill me. He knew the poison would slow me, and stop me from ever reaching Zaros before it was too late. He wanted me to live with my pain. I tire of reliving this. Decide whose mind I have taken. The sooner this is over, the sooner I can be alone.",
    "An interesting choice.",
    "Correct every time. I must congratulate you on that, at least. Nonetheless, we must continue on! I'm feeling much better now, thanks to you. It won't be long until I can deal with you face to face.",
    "You've seen my ability to create and control fire. What about annihilating it? You'll have to find some light that you can take with you if you want to survive this passage.",
    "I wouldn't feel too proud of yourself for getting this far, you know. If I didn't want you to continue, I could stop you in a second. But you have been so helpful to me; I am nearly back to my full strength. Then I can start on the path to restoring my god to his glory.",
    "You think I would share such plans with you? You have been useful, but you must understand that you are a mere pawn in this game. Now, I do hope you have been paying attention to your friends.",
    "An interesting decision.",
    "Correct every time. I must congratulate you. I must urge you forward. Not far to go now. I suggest you prepare yourselves.",
    "Such a waste. I had obviously taken Emmett. I must urge you forward. Not far to go now. I suggest you prepare yourselves.",
    "This is ridiculous! Down to only three? (Transcript missing. edit)",
    "Finally! My true form! I thank you, adventurer.",
    "You think I'm just going to let you leave with all my knowledge in those books? Prove yourself worthy of my secrets, and I may allow you to escape. You must fight fire with fire; your weapons, armour and magic will be of no use to you in this battle.",
    "Revenge? You know nothing of revenge. And you do not stand a chance against me. Prove yourself worthy of my secrets, and I may allow you to escape. You must fight fire with fire; your weapons, armour and magic will be of no use to you in this battle.",
    "Is that so?",
    "Let us begin.",
    "Come and face me again when you are worthy.",
    "Enough!...I will admit defeat.",
    "I have failed again. May Zaros have mercy on me when he returns.",
    "Zamorak did not anticipate that I would ever recover, and he certainly underestimated my Lord. There are others loyal to Zaros; I can sense them, and together we can find a way. I must train myself to be worthy again, and then we will strive to bring him back.",
    "You may have defeated me in battle, but you will not defeat my will. I cannot afford to share this knowledge with you.",
    "There is an exit at the back of this chamber. I must commend you all; all of you, Without Zaros's guidance I have imposed my own rage on your innocent lives. You have all shown great strength.",
    "Use it wisely. It will give you the power to burn any logs your feet touch for additional knowledge in the art of firemaking, but you must keep moving. Farewell, firemakers. If you choose to return here, I may be able to offer you knowledge to make up for my mistakes.",
    "What are you still doing here? Just leave me.",
    "I have told you mortal, I will not tell you more.",
    "Azzanadra! How do you know his name? I demand you tell me!",
    "Insolent creature! Why did you keep this from me?",
    "I cannot accuse you of lying. I may despise the Mahjarrat race for Zamorak's doings, but Azzanadra was always one of the exceptions. A true, loyal and brave follower of Zaros. He must think greatly of you to allow you to be present when making contact with our almighty Zaros, I suppose it cannot harm to share with you. Zaros may be gone, but only fools and those with Zamorak's overwhelming self-confidence would assume Zaros was oblivious to his future. Azzanadra and I are both restored. There are others, I am sure of it, and we will strive to put Zaros's plans into motion.",
    "Azzanadra may trust you but that does not mean that I have to. I have told you enough.",
    "I have told you all I wish to, mortal."
  ],
  "Emmett/Sera/Flint/Lina/Isis/Twig": [
    "Are you sure it's me?",
    "Are you sure it's me?",
    "Are you sure it's me?",
    "Are you sure it's me?"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:The_Firemaker%27s_Curse?oldid=36009722’"
  ]
}