{
  "Horacio": [
    "It's a fine day to be out in the garden, isn't it?",
    "My name is Horacio Dobson. I'm the gardener to Lord Handlemort. Take a look around this beautiful garden, all of this is my handiwork.",
    "Actually, now you mention it, yes... I'm going to improve the garden around the house. Would you be willing to help me?",
    "Well, let's see now. I'm reworking the beds and have marked out two special patches as you can see, they're a bit weedy at the moment, though. I'm sure Lord Handlemort will appreciate the beauty of what I have planned there. It may even cheer him up a little.",
    "One of his treasures was stolen...",
    "Indeed there are. Still, life isn't always a bed of roses is it? Back to the root of the problem: I need a very rare plant... and I think you can get it for me.",
    "Oh no, no, no. Nothing so mundane! It's a vine, you see...",
    "One that only grows wild in one place on Karamja just east of Shilo Village... at least, that's what I've heard from other gardeners. It's called the Jade Vine.",
    "I tried... and failed lots of times. So has Garth - the farmer on Karamja - he knows quite a bit about the vine. You see, because it's so delicate, the cutting is very difficult to keep alive for very long. I have an idea, though: go talk to that mad Wizard Cromperty. He has been boasting recently that he has discovered preservation magic. I'm not sure I believe him, though.",
    "That would be excellent!",
    "How goes the hunt, brave gardener?",
    "Oh dear! You were getting a special Jade Vine plant for me, but to protect it you'll need to talk to the Wizard Cromperty first.",
    "Wow! You managed it - you must be an incredibly accomplished farmer, and quite handy in a muddle too. How did you find the trip?",
    "Well, I think it was pretty amazing. As me old dad says, 'Looking for oranges on an apple tree will be fruitless searchin', but I appear to have picked a real ripe one in you.",
    "Well I kind of thought that you might...",
    "Err... plant and grow it?",
    "Hold your nasturtiums. I didn't ask you to chop your head off or anything. Just plant and grow the vine till it's adult. I can take over then. You see I've got all those ugly beds to dig and replant with new flowers.",
    "Umm. Have you had time to plant that vine yet?",
    "Well, I've managed to keep one patch free of weeds, you can use that one.",
    "ARG! It's grown out of control! You should have pruned it yesterday... Now we'll need a hatchet and secateurs to deal with it. Can you help fight it?",
    "It doesn't look like you're prepared properly. You'll need to be wielding a hatchet to fight the vine!",
    "ARG! It's going to eat all my lovely flowers!",
    "Quick, grab a hatchet and secateurs and kill it!",
    "Yes! I reckon it's the only way to kill it.",
    "Look, who's the gardener here?",
    "Then what are you waiting for? Help me kill it!",
    "No! Odif, back!",
    "ARG! It's tangled me! Kill it! You're my only hope!",
    "Overgrown weed! Get it off me! Ow! That stings! Where's my weedkiller?",
    "You call yourself a farmer? How could you let the vine go wild like that?",
    "Oh, I don't think I can take much more of this.",
    "Why, yes, they do. If you let this species get wild by leaving it unpruned, it will attack anything. Some closely related species that can pop up pretty much anywhere has a large purple fruit, you've probably seen it. Anyways, thank you for saving my life.",
    "Here, take this seed that the vine dropped and if you need another, let me know. You can use the other vine patch here if you want. Remember that if you don't prune your vine every couple of days, it will grow wild and you'll have to kill it, or get me to do it. I'm going to go replant my vine - now we have seeds it'll be easy! Oh, I'm so glad you managed to help, I'm going to contact the Slayer Masters about this, I bet they haven't fought a strongylodon macrobotrys vine for a long time, we thought they'd been hunted to extinction at one point. Still, your jade vine may prove useful for training your Slayer abilities."
  ],
  "Player": [
    "So... who are you?",
    "Do you need any help?",
    "Sure, I enjoy a bit of gardening.",
    "What's wrong with him?",
    "Oh... err.. I see. There are some.. nasty people around these days.",
    "Oh? What plant would that be? A magic tree?",
    "What sort of vine?",
    "Oh, right. So what's the problem? Why don't you just go and get it?",
    "Okay, I'm off to see the wizard... so long as he's not going to teleport me places again, we should be fine!",
    "Well... simply de vine... I haven't got the Jade Vine cutting yet. In fact... I've forgotten what I'm doing.",
    "Aha! I remember now.",
    "Horacio tells me that you may have something that could help me preserve a vine cutting?",
    "So what is it and can I have one?",
    "Look, I need it to help Horacio... please?",
    "That sounds like you want me to do something.",
    "Okay, okay, I'll go see what I can do about it.",
    "*sigh* I guess I'd better see what's happening at the R.P.D.T. depot then.",
    "Not yet, but I will, even if I have to box them round the ears.",
    "What's the holdup here?",
    "What is?",
    "So why not deliver it then? You guys always seem to be sitting around while Postie Pete is out there pushing the envelope in mail delivery performance.",
    "So... if you can't deliver it, why not open it and find out what's inside?",
    "Erm, look, I hate to point out the obvious, but... I'm not an R.P.D.T. worker.",
    "That's what I jus-",
    "*sighs* Why do I have to think of everything?",
    "I guess I'll have to if I'm not to disillusion the wizard.",
    "Well, I got it open.. not sure I wanted to, though.",
    "Yes... I think it belongs to a wizard I sort of know.",
    "Well, I didn't really get to know him till after he was dead. But he ended up being fairly handy as I now get lots of sand.",
    "Oh yes, Wizard Cromperty will so look forward to his parcel. Will you deliver that now?",
    "I'll go see him then and get rid of this... err...appendage. Zavistic might be happy to see his apprentice.",
    "You should have your parcel now, I solved the problem at the R.P.D.T... although it was rather... unpleasant.",
    "It's a pot lid.",
    "It's still a pot lid.",
    "No, not at all, sir... *whispers* I'm implying you're a bit potty.",
    "Some people make pottery to earn a living, but not me: I just run errands for potty wizards...",
    "Okay, okay, I'll make your pot lid.",
    "Not yet, no.",
    "I thought you wanted a whole pot lid?",
    "It's a pot lid.",
    "Just tell me what Horacio said.",
    "Well, that really helps... Runescape's not exactly small, you know.",
    "Ahh, that Garth, on Karamja. Right, I'll go see him then.",
    "No! I'll walk, thanks!",
    "Horacio has told me that you know a lot about taking root cuttings.",
    "Erm... do you think you could pass on some of that knowledge to me?",
    "I see. Please tell me how to take a root cutting from the Jade Vine over to the east of Shilo Village?",
    "Yes, Horacio said that, so I went to Wizard Cromperty and he told me about this magical preservation device.",
    "Oh, yes, he's a wonderful wizard because...",
    "Because... he reminded me of this pot lid to seal the cutting away in a pot.",
    "Oh? What's the problem?",
    "Oh dear. I should go prepared then.",
    "No, do you have any more cutting remarks for me today?",
    "Please tell me again about root cuttings from the Jade Vine to the east of Shilo Village.",
    "No. Not yet. You know - people who throw dirt are sure to lose ground.",
    "...",
    "Right. Okay.",
    "Hello, Garth.",
    "Yes, it was a case of trowel and error.",
    "Me?! That was even worse! So where should I grow?",
    "Okay, okay, I'm growing, I'm growing!",
    "Yes.. I did. But I lost it somewhere.",
    "Excellent! May I have it please?",
    "Thank you very much!",
    "Guess what? I got you a cutting... and it should still be alive, too!",
    "Oh, it wasn't that hard.",
    "Yeeeesss?",
    "Might?",
    "WHAT? After all I just went through to get you that wretched cutting? You now want me to grow it, too? Who's the gardener here?",
    "I have a feeling I'm going to regret this but okay. Just this once. And only because I wouldn't want to see you kill it and waste all my hard work.",
    "No, but I will, eventually.",
    "Okay.",
    "Okay, I'm ready for combat.",
    "Okay, I'll go grab one.",
    "Never mind your flowers, what about yourself?",
    "A hatchet and secateurs?",
    "Erm, did you hear that through the grape vine?",
    "Okay, okay. I just happen to have those with me!",
    "Oh, stop vining. I didn't know it would go wild and try to kill you.",
    "Do they always do that?",
    "You're welcome.",
    "I have a rather sandy problem that I'd like to palm off on you.",
    "I think... that I might have found something.",
    "Another hand.",
    "No.",
    "Err, no. I mean, yes... but, no.",
    "Wouldn't you be? It was in a package in the RPDT in Ardougne. But I have it here with me.",
    "You mean, you didn't already bury him... or, at least, what you had of him?",
    "Right. Are all wizards a little potty?"
  ],
  "Wizard Cromperty": [
    "Ah yes, my very latest invention, but it's still in experimental stages at the moment, and quite fragile.",
    "Oh, can't possibly let you have one I'm afraid. All top secret and hush-hush.",
    "Well... I guess you did test out my teleportation device last time, I suppose you might be of some help now.",
    "Indeed! You see, my latest rather clever magical preserving device requires one more missing part... quite a specialist part and it's those terribly lackadaisical workers at the R.P.D.T. who refuse to budge. I tell you, they never seem to do any work... except putting the kettle on... and another thing...",
    "Oh, would you? I'd be ever so grateful... and might even let you use my new magical preservation magic thingummy.",
    "Have you gotten those lazy workers to deliver my parcel yet?",
    "Ah, excellent. You are a handy person to have around, you know.",
    "Now, let's see what we have here...",
    "Argh! My specialist equipment is broken. Those bumbling idiots at the R.P.D.T. have messed up a simple job again!",
    "WHAT? I'll have you know this is specialist magical equipment.",
    "Are you implying that I'm lying, young man/woman?",
    "I heard that... I will need a new one, do you think you can make it?",
    "Why, you young whippersnapper! Don't you know that only foolish potters make wisecracks?",
    "Have you made the pot lid yet?",
    "Well, get cracking then!",
    "...!",
    "Ah, brilliant, I see you have completed a fine work of art.",
    "Yes, yes, it is, I hope it fits your pot okay - you do have a pot to go with it, right? You'll need both the pot and the lid to preserve the cutting, and make sure the seal is nice and tight. Now, to find out more about how to take the cuttings, Horacio tells me to tell you that... err... or is that the other way around?",
    "I think it was that you were to talk to a nice man called Garth.",
    "Erm. Oh, I think he said something about a jungle and that Garth was a farmer.",
    "Would you like me to telep-",
    "You can walk on water? How impressive... I'll want to talk to you about that sometime. Perhaps I could manipulate the molecules and make them somehow get friendlier and then I could..."
  ],
  "RPDT Employee": [
    "It's stinkin' up the place.",
    "The package... over there on the table.",
    "Can't. The label's unreadable, think it got a bit water damage, came in on the shipment from Karamja last week in that big storm.",
    "Ooooh... can't do that, more than my job's worth! See, policy 387.29 sub paragraph 4 states that no package is to be tampered with or opened by R.P.D.T. workers whilst in the care of the R.P.D.T... So, you see, there's no way we can open it - we'll just have to have another cup of tea and stay out of the stink.",
    "'Ere, I just thought of somethin'. You're not an R.P.D.D. worker.",
    "You can open it! Then we can get back to work, we got about a week's backlog now 'coz of the stench.",
    "Was my idea! So... Are you going to open it?",
    "So's I see. Looked pretty nasty to me. Hope you can dispose of it.",
    "Sort of?",
    "Errr... yeah.. right. Look, I got work to do, so you can go now.",
    "Of course. We'll make it our first priority."
  ],
  "Garth": [
    "Oo, oi. That I do.",
    "Oo, arr. That I could.",
    "See, you only have to ask properly and you shall gets. Now... let's get to the root of the problem. Root cuttings are very fragile, especially from that great vine. I've tried several times but never managed to keep the thing alive long enough. It doesn't seem to like to be exposed to the air much, so sealing it up somehow would be good.",
    "Oo, he is a wonderful wizard.",
    "Because?",
    "Oo, oi. That looks about right, though you might need to try several times to find a cutting that will take. Okay, tools you'll need for taking the cutting would be a plant pot full of earth like you can use for trees, secateurs and obviously a spade to dig down to the roots. You'll also need to do this right close to the main trunk; I had no success at all with the smaller roots further out. That might prove a bit of a problem.",
    "Well, you might have a problem getting to the main roots now, it's been a while since I last tried... and even then it wasn't easy at all. You'll definitely need yer wood hatchet and something to hack down the jungle. It's kind of wild and overgrown - make sure you have an escape root.",
    "Oo, oi. Most definitely. You'll have problems if you're not prepared. Just like soil if it's not been weeded. Don't forget to seal that cutting away as soon as it takes, else you'll be needing to go back there again.",
    "Got that cutting yet?",
    "Oo. That was almost funny. You should quit farming and practice your comedy.",
    "Oo! Still not managed it?",
    "Oo, another funny... Well done, when are you going to make a career of it?",
    "Errr... yes, right then. Tools you'll need for taking the cutting would be a plant pot full of earth like you can use for trees, secateurs and obviously a spade to dig down to the roots. Don't forget your sealed potty thing that the mad wizard told you about. You'll also need to do this right close to the main trunk, I had no success at all with the smaller roots further out. But that might prove a bit of a problem because of the tangled mess it all is now. Oo, you might also need to try several times to get your cutting to take. Don't' forget to seal that cutting away as soon as it takes, else you'll be needing to go back there again.",
    "Oo! I see from your face that you have managed to grow a cutting successfully! Well done.",
    "That was a really seedy pun. I think you should take your cutting and leaf.",
    "For the love of Guthix, please see Horacio as soon as possible, my poor ears won't take mulch more!",
    "Oooo. No, no, no, no. I gots[sic] it right here. Found it laying just over there on the hill, had a little peek in and knew it was your work. It's still alive.",
    "Oo, oi, young sir. 'Ere you go.",
    "Yer welcome. Go take it to Horacio now, else he'll be gettin' worried."
  ],
  "Zavistic Rarve": [
    "What are you doing... Oh... it's you... sorry... didn't realize... what can I do for you?",
    "Thank you so much for helping to bring Clarence home and lock up his murderer! I only wish we could find the rest of him to truly put him to rest.",
    "Oh? What's that?",
    "In the sand?",
    "On your arm?",
    "Oh my, it really does sound like you've lost your head and are a bit shaken up!",
    "It's... it's Clarence. I shall keep it with the rest of him. If we can find enough, we can finally put him to rest.",
    "Oh no, that would be terrible! We must find as much as we can before we bury him so that he can go whole to the Wizards' Great Hall.",
    "Thank you for helping us, please see if you can find any more of him."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Back_to_my_Roots?oldid=36114455’"
  ]
}