{
  "General Wartface": [
    "Green armour best.",
    "Go away, human, we busy.",
    "No, it has to be green!",
    "We should wear green armour!",
    "You stupid! Only stupid goblins think red armour better!",
    "That because you stupid!",
    "Then why you not like green armour?",
    "Only stupid goblins think that! You stupid!",
    "Not red! Red armour make you look fat.",
    "Shut up!",
    "SHUT UP!",
    "Me not care what human think! Human ugly!",
    "Shut up, Bentnoze!",
    "I tell all globlins in village to wear green armour now!",
    "They listen to me not you! They know me bigger general!",
    "Human! What colour armour they wearing out there?",
    "Shut up, human! They wearing green armour really! Human lying because [he/she] scared of you!",
    "What? Me mean...",
    "Shut up! Me bigger general!",
    "Problem is they want different change to us.",
    "Yeah peace is good as long as it peace wearing green armour.",
    "Yea as long as you pick green",
    "Human not know anything! If we wear red then whole village be ugly like YOU!",
    "Green! We all wear green now, human has decided!",
    "No but he agree with me!",
    "Me hate humans! This human just happen to be right!",
    "Me dunno what that look like. Have to see armour before we decide.",
    "What colour we try?",
    "Yep bring us orange armour.",
    "...and then you dye it orange!",
    "There some spare armour around village somewhere. You can take that.",
    "Stupid Bentnoze, you not know how to spell!",
    "Some goblin or other, he steal it. Say he steal it from old witch in Draynor Village.",
    "Grubfoot!",
    "Put on this armour!",
    "No I don't like that much.",
    "We need darker colour, like blue.",
    "Human! Get us blue armour!",
    "Shut up Grubfoot!",
    "Get goblin armour and dye it blue!",
    "Grubfoot!",
    "Put on this armour!",
    "Goblins wear dark earthy colours like brown.",
    "Human! Get us brown armour!",
    "Shut up Grubfoot!",
    "Brown was old colour of armour before we change it.",
    "Grubfoot!",
    "Put on this armour!",
    "That colour quite nice. Me can see myself wearing that.",
    "Thank you for sorting out our argument. Take this gold bar as reward!"
  ],
  "General Bentnoze": [
    "No, no, red every time.",
    "Red armour best.",
    "Go away, human, we busy.​",
    "Green armour? Are you stupid?",
    "No they don't! Me think red armour better!",
    "Me not stupid!",
    "Because red armour better!",
    "Everything make YOU look fat!",
    "Fatty!",
    "Even this human think you look fat! Don't you, human?",
    "Ha ha! See, fatty? Even human think you fat!",
    "Shut up, human! Wartface fat and human stupid!",
    "They not listen to you! I already tell them wear red armour!",
    "Me bigger general! They listen to me!",
    "Human scared of me not you! Then you think me bigger general!",
    "We decide to celebrate goblin new century by changing colour of our armour, brown get boring after a bit. We want change.",
    "But green too much like skin. Nearly make you look naked!",
    "No you have to pick red!",
    "See? Even stupid human think red best. Now we all wear red!",
    "Go away human. You not helping.",
    "Why we have to do what human say? He not boss of us!",
    "That prove you a filthy human-lover!",
    "Go away human. You not know anything.",
    "That would mean me wrong ... but at least Wartface not right!",
    "Human! Bring us armour in new colour!",
    "Orange armour might be good.",
    "Shut up Grubfoot!",
    "Well first you get goblin armour...",
    "Even human should be able to work that out!",
    "It in crates somewhere. Can't remember which crates now.",
    "You go north of here into Wilderness. There you find many ways to die!",
    "Shut up, Wartface!",
    "Me not know where dye come from.",
    "Maybe you can get more dye from her?",
    "It clashes with skin colour.",
    "Yeah blue might be good.",
    "Shut up Grubfoot!",
    "Maybe same way you got orange armour?",
    "That not right. Not goblin colour at all.",
    "Yeah brown might be good.",
    "Shut up Grubfoot!",
    "There bound to be some around somewhere.",
    "It a deal then. Brown armour it is."
  ],
  "​General Bentnoze": [
    "All goblins should wear red armour!"
  ],
  "Player": [
    "Um...",
    "Yes, Wartface looks fat!",
    "No, he doesn't look fat.",
    "Half of them are wearing red and half of them green.",
    "What about a different colour? Not green or red?",
    "Err ok.",
    "Why is green best?",
    "Err ok.",
    "Why is green best?",
    "Cabbage. Singular.",
    "Cabbage.",
    "Please, stop right there, before you shower me in spittle.",
    "Enough. Please, stop talking.",
    "You have a lisp.",
    "No. Try again. Lisp.",
    "Close enough.",
    "Where am I meant to get orange armour?",
    "But where do I get goblin armour?",
    "But where do I get dye?",
    "No, D-Y-E, not D-I-E.",
    "Do you know where I can get dye though?",
    "Well where did you get your red and green dye from?",
    "I have some orange armour here.",
    "Look like what thing?",
    "An orange?",
    "How am I meant to get blue armour?",
    "I have some blue armour here.",
    "I thought that was the armour you were changing from. Never mind, anything is worth a try.",
    "Why not?",
    "Makes you feel blue?",
    "Where[sic] am I meant to get brown armour?",
    "I have some brown armour here."
  ],
  "Goblin": [
    "Green armour best.",
    "I forgot now, but General Wartface says it is. So it must be.",
    "Red armour best.",
    "I forgot now, but General Bentnoz e says it is. So it must be.",
    "Green!",
    "Green armour best!",
    "Green armour stupid!",
    "Green not red!",
    "Red armour best!",
    "Red armour stupid!",
    "Red not green!",
    "Red red red!",
    "Stupid greenie!",
    "Stupid reddie!"
  ],
  "Goblin [#1]": [
    "Green armour best.[sic]",
    "Red armour best!"
  ],
  "Goblin [#2]": [
    "Red armour best!",
    "Green armour best!"
  ],
  "Greldo": [
    "Green armour betht!",
    "Green ith colour of cabbageth.",
    "Grammar nart-thee...",
    "Cabbageth tayth-tee. Me like cabbageth.",
    "That what you think, thilly human.",
    "You eat Draynor cabbageth?",
    "It tayth-tee. It tingleth on my lipth.",
    "Hmph.",
    "Human not have to rub it in.",
    "Me not have lithp. What'th a lithp?",
    "Me thuffer from thpeech-",
    "Thower you in thpitt-",
    "That big lithp you got there, human!",
    "A lithp?",
    "Lithp?",
    "What lithp?",
    "Yeth. You go, human."
  ],
  "Grubfoot": [
    "Grubfoot wear red armour! Grubfoot wear green armour!",
    "Why they not make up minds?",
    "Yes General Wartface sir?",
    "What do you think?",
    "Me not like this orange armour. Make me look like that thing.",
    "That fruit thing. The one that orange. What it called?",
    "That right. This armour make me look same colour as orange-fruit.",
    "Yes General Wartface sir?",
    "What do you think?",
    "Me not like this blue colour.",
    "Me not know. It just make me feel...",
    "Makes me feel kind of sad.",
    "Yes General Wartface sir?",
    "What do you think?"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Goblin_Diplomacy?oldid=36109616’"
  ]
}