{
  "questName": "Fate of the Gods",
  "questSteps": [
    {
      "stepDescription": "Find the World Gate, south of the Eagles' Peak lodestone. Speak to Azzanadra. (Chat ✓•2•~•4•~•~)",
      "itemsNeeded": [],
      "itemsRecommended": [],
      "highlights": {
        "npc": [],
        "object": []
      },
      "floor": 0,
      "additionalStepInformation": [
        "Equip a Ring of visibility to skip some dialogue.",
        "The following part can be skipped if you already activated the World Gate after Mahjarrat Memories."
      ]
    },
    {
      "stepDescription": "Click the controls right near the gate until you reach first image at step. Rotate left until you reach second image at step. Rotate right until you reach third image at step. Step away from the controls, and speak to Sliske.",
      "itemsNeeded": [],
      "itemsRecommended": [],
      "highlights": {
        "npc": [],
        "object": []
      },
      "floor": 0,
      "additionalStepInformation": [
        "Images from left to right are World Gate Icons.",
        "Can be skipped if you already activated the World Gate after Mahjarrat Memories."
      ]
    },
    {
      "stepDescription": "Put on a face mask or equivalent protection and enter the World Gate to enter Freneskae.",
      "itemsNeeded": [
        "Slayer Helmet or Face Mask",
        "Combat Equipment",
        "Food",
        "Potions"
      ],
      "itemsRecommended": [],
      "highlights": {
        "npc": [],
        "object": []
      },
      "floor": 0,
      "additionalStepInformation": []
    },
    {
      "stepDescription": "Run through Freneskae using the map below to reach the Sanctum. Move fast and avoid the hazards. There are healing points along the way if needed.",
      "itemsNeeded": [],
      "itemsRecommended": [],
      "highlights": {
        "npc": [],
        "object": []
      },
      "floor": 0,
      "additionalStepInformation": [
        "Collect the memoriam crystals along the way. They are numbered on the map below, start with collecting number 9 and then the rest as you move along"
      ]
    },
    {
      "stepDescription": "Go to North side of the room to the door puzzle. Match the symbols up together to light up the lines in between them three times to open the door, then enter.",
      "itemsNeeded": [],
      "itemsRecommended": [],
      "highlights": {
        "npc": [],
        "object": []
      },
      "floor": 0,
      "additionalStepInformation": []
    },
    {
      "stepDescription": "All Nihil Specials are in Additional Info. Kill the four nihils, DO NOT STAND IN THE MIDDLE, then enter the next area to the north.",
      "itemsNeeded": [
        "Combat Equipment",
        "Potions",
        "Food"
      ],
      "itemsRecommended": [],
      "highlights": {
        "npc": [],
        "object": []
      },
      "floor": 0,
      "additionalStepInformation": [
        "All nihils use a special attack after hissing.",
        "The smoke nihil attacks with Magic. Its special attack will decrease Attack, Strength, Magic, Ranged, and Defence by 15. Its charge will decrease these stats by 5.",
        "The shadow nihil attacks with Ranged, and its special attack creates Nex-like shadow bomb at the position of player that deals rapid damage. Players should move away as soon as the floor below them is darkened by a circular spot. Shadow nihil darkens the whole screen whenever it approaches the player, both when charging or fighting the player, but this causes no gameplay difference.",
        "The blood nihil attacks with melee. Its special attack causes all incoming damage to heal it, indicated when the creature lowers its head and begin to glow. It also will passively heal other nihil if it is damaged. Its charge inflicts a bleed similar to Slaughter that begins at 100 damage.",
        "The ice nihil attacks with Magic, and its special attack applies a six second stun and drains player's Prayer points by 50% of its maximum. Its charge drains the player's Prayer points by 25% of its maximum."
      ]
    },
    {
      "stepDescription": "If you accept Zaros' help against Mah, he will provide you with full prayer for use with Ancient Curses along the fight and less damage from Mah.\nAttempt to descend the ledge (to the north) then speak to Zaros. (Chat ~•5•2•2)",
      "itemsNeeded": [
        "Combat Equipment",
        "Food",
        "Potions"
      ],
      "itemsRecommended": [
        "a beast of burden and a quick teleport"
      ],
      "highlights": {
        "npc": [],
        "object": []
      },
      "floor": 0,
      "additionalStepInformation": [
        "Defend against monsters while Mah has her nightmare. Progress can be tracked at the top.",
        "Use Freedom or Anticipate when Mah clenches her hands to avoid being stunned when she screams in agony.",
        "When the progress is 0%, climb down the ledge next to Mah's hand."
      ]
    },
    {
      "stepDescription": "Collect The Measure and place it on the ground near faint wisps to activate them for harvesting.",
      "itemsNeeded": [],
      "itemsRecommended": [],
      "highlights": {
        "npc": [],
        "object": []
      },
      "floor": 0,
      "additionalStepInformation": [
        "Wisps can be found on the centre and edges of the cave. After revealing one, it will be a yellow dot on minimap."
      ]
    },
    {
      "stepDescription": "Convert Mah memories into Mah Energy using the Energy rift. When you gather 250 energy, weave it into a simulacrum (dark to help Zaros, light to hinder Zaros).",
      "itemsNeeded": [],
      "itemsRecommended": [],
      "highlights": {
        "npc": [],
        "object": []
      },
      "floor": 0,
      "additionalStepInformation": []
    },
    {
      "stepDescription": "Return to Zaros by exiting the rock face on the wall between two hallways west of the energy rift. (Chat ~)",
      "itemsNeeded": [],
      "itemsRecommended": [],
      "highlights": {
        "npc": [],
        "object": []
      },
      "floor": 0,
      "additionalStepInformation": []
    },
    {
      "stepDescription": "Talk to Azzanadra through the world gate. (Chat 1•~)",
      "itemsNeeded": [],
      "itemsRecommended": [],
      "highlights": {
        "npc": [],
        "object": []
      },
      "floor": 0,
      "additionalStepInformation": []
    },
    {
      "stepDescription": "Quest Complete!",
      "itemsNeeded": [],
      "itemsRecommended": [],
      "additionalStepInformation": [],
      "highlights": {
        "npc": [
          {
            "npcName": "",
            "npcLocation": {
              "lat": 0,
              "lng": 0
            },
            "wanderRadius": {
              "bottomLeft": {
                "lat": 0,
                "lng": 0
              },
              "topRight": {
                "lat": 0,
                "lng": 0
              }
            }
          }
        ],
        "object": [
          {
            "name": "",
            "objectLocation": [
              {
                "lat": 0,
                "lng": 0
              }
            ],
            "objectRadius": {
              "bottomLeft": {
                "lat": 0,
                "lng": 0
              },
              "topRight": {
                "lat": 0,
                "lng": 0
              }
            }
          }
        ]
      },
      "floor": 0
    }
  ]
}