{
  "Due to (an) update(s), this article may be out of date.Reason": [
    "Update from 27 July  changed dialog to match voiceover You can help improve this page by editing it."
  ],
  "Player": [
    "Azzanadra, what are you doing out here?",
    "Is it something you can tell me about?",
    "My role in what?",
    "Zaros is returning?",
    "You mentioned the World Gate?",
    "I can see the gate right now!",
    "I've already found and re-powered the World Gate!",
    "Where is the World Gate?",
    "How do we get it out of the Shadow Realm?",
    "Who?",
    "Surely you can't mean...",
    "Sliske!",
    "I see it.",
    "Fine. Let's get this over with. The sooner it's done...",
    "Just tell me what needs doing.",
    "Oh, here it comes. You just can't help yourself, can you?",
    "Whatever you're going to say, I doubt Azzanadra will like it.",
    "Oh, but I suppose we do need a sadistic Mahjarrat.",
    "I'm supposed to just take your word on that?",
    "So Zaros did order you to kill Guthix?",
    "And your tournament for the gods?",
    "So everything you've done has been for Zaros? You ARE still a loyal Zarosian?",
    "But now you're suggesting, what: that I could sabotage Zaros's return? Or even kill him? What game are you playing, Sliske?",
    "I know. I've already done that.",
    "What? There must be hundreds of combinations! Surely you don't expect me to just try them all?",
    "...",
    "Okay, now what?",
    "Yes. He suggested I need not necessarily help Zaros.",
    "Just his usual spiel.",
    "Just his usual spiel.",
    "Am I right in thinking that the gate is taking me to...",
    "But it's so desolate and inhospitable. No offence.",
    "Why would Zaros reside in such a foreboding place?",
    "Which is?",
    "He told me it's because Freneskae is his birthplace too – that you and he share an origin.",
    "I've discovered a place called the Sanctum. Do you know of it?",
    "I was attacked by a pack of nihil. Have you ever encountered them?",
    "They seemed to reflect the ancient elements. They have this vicious charging attack, and are quite powerful in combat.",
    "I've encountered an enormous being sleeping within the crater of a volcano!",
    "Her? Her who?",
    "Whose mother?",
    "Zaros just called her Mah.",
    "Do you have any advice on how to deal with muspah?",
    "I have travelled below Mah through the volcano to Freneskae's core. Zaros named this place as the 'Elder Halls'. Have you heard of this place?",
    "I'm not entirely sure... but Zaros wishes me to gather some energy there with which to create him a new body.",
    "He's right behind me. He said he wants to address his loyal followers upon his arrival.",
    "Hello?",
    "Is someone there?",
    "Huh, I guess not. I'll keep looking.",
    "*cough*",
    "I think that was the last of them.",
    "This will be a long climb...",
    "Who are you? What is that thing? You've been following me since I got here!",
    "Zaros.",
    "Why have you led me here?",
    "What's it doing?",
    "She? That thing in the crater is a she?",
    "Okay...",
    "What is this place?",
    "My mind? How are you in my mind?",
    "So we're both still on the volcano...",
    "Okay, so what need do you have of me? Why am I here?",
    "You were created? By whom?",
    "By Mah – that 'thing' in the crater? She is your creator? How?",
    "An elder god?",
    "How long ago was that?",
    "Are you the oldest of the gods?",
    "Who?",
    "How did Zamorak best you? Did you really trip?",
    "Did you plan the whole thing?",
    "What about after Zamorak deposed you?",
    "More time than we have? Before what?",
    "But our aims are to free mortals from the influence of all gods - yourself included!",
    "At least tell me, is this what she looks like?",
    "At least tell me, is this what she looks like?",
    "Is she...?",
    "Do you intend retribution?",
    "Succeed him?",
    "Do you intend to kill him?",
    "Did you order him to kill Guthix?",
    "Who was the breakaway Mahjarrat?",
    "Of course it would be.",
    "Do you know where they come from?",
    "What are you saying? Revisions? Previous cycles?",
    "She is a nihil, correct? You created her race?",
    "I've met Hannibus! He is indeed as you say.",
    "I've encouraged him to help the dragonkin find a solution to their own problems.",
    "I've encouraged him to return to what's left of his people.",
    "What about demons?",
    "Do you know Ocellus?",
    "And vampyres?",
    "But why choose these races?",
    "With you as ruler?",
    "Guthix's inaction?",
    "Some see you as controlling, others as evil, and yet your loyal followers are in awe of you. And did you not say yourself that you were the divine aspect of dark energy?",
    "Which is?",
    "And you think you have that right?",
    "If not me, then who?",
    "Who indeed? Where are the elder gods?",
    "And when you've returned to Gielinor?",
    "You don't want me to worship you?",
    "The what?",
    "Okay, so: elder energy woven into a simulacrum.",
    "What? Why?",
    "It tickles.",
    "How exactly?",
    "Nope, I'll never get used to that.",
    "Yeah, she's scary.",
    "Okay, let's say in theory I'm helping you. What's next?",
    "What's the next step?",
    "What's down there?",
    "How much do I need and for what purpose?",
    "Nope, I'll never get used to that.",
    "I should use the Measure to locate some elder wisps.",
    "It's clearly a wisp, but it's too ethereal to harvest.",
    "What is that thing?",
    "Yes... but it can't be the same one, can it?",
    "So this one is...?",
    "This one is a dark brown and it's covered in triangular shapes. There's an earthy smell to this chamber",
    "This one is mostly white and covered in rectangular shapes. It's also freezing cold in this chamber.",
    "This one is mostly red covered in odd pentagonal shapes. This whole chamber is burning hot, most of it radiating from this thing.",
    "This one is black on the outside. It looks almost smooth except for a spiral running around it. The spiral looks like some sort of corruption. Is this...?",
    "Er... yes. Which type of simulacrum did you need again, to return at full strength?",
    "Right...",
    "I should use the Measure to locate some elder wisps.",
    "What is that thing? Surely it can't be what I think it is...",
    "This one is a dark brown and it's covered in triangular shapes. There's an earthy smell to this chamber",
    "This one is mostly white and covered in rectangular shapes. It's also freezing cold in this chamber.",
    "This one is mostly red covered in odd pentagonal shapes. This whole chamber is burning hot, most of it radiating from this thing.",
    "This one is black on the outside. It looks almost smooth except for a spiral running around it. The spiral looks like some sort of corruption.",
    "There: a dark simulacrum. That's what Zaros needs to return at full strength.",
    "I should take this back to him at the peak.",
    "There: a light simulacrum. This should mess Zaros up real good.",
    "I should take this back to him at the peak.",
    "Maybe I should check with Zaros back at the Cradle.",
    "How much Mah energy do I need again, and for what purpose?",
    "I already have enough energy to weave you a simulacrum.",
    "I have.",
    "I need to think about this.",
    "Ah...sorry, that would be me. I must have woven this wrong.",
    "Nope, I'll never get used to that.",
    "I need to think about this.",
    "Yes!",
    "He stands next to the World Gate on Freneskae. I think he wants to talk to me there before he returns.",
    "I have travelled below Mah through the volcano to Freneskae's core. Zaros named this place as the 'Elder Halls'. Have you heard of this place?",
    "He stands next to the World Gate on Freneskae. I think he wants to talk to me there before he returns.",
    "Then let's get out of here!",
    "Do we have time?",
    "Against their will?",
    "But it affects your followers?",
    "Shouldn't I be worried?",
    "But what if helping you is the wrong choice?",
    "Oh, that.",
    "So why didn't you stop me?",
    "I suppose not.",
    "So why accept that body?",
    "So you're not angry?",
    "Mah is getting closer.",
    "He's right behind me. He said he wants to address his loyal followers upon his arrival.",
    "Protection? What protection?",
    "What did Sliske mean by protection?",
    "You've been doing that?",
    "But I sabotaged your body. You are weakened because of me.",
    "Wait, there are Elder Halls on Gielinor?",
    "A part of your body?",
    "Er, thank you... I think.",
    "Farewell.",
    "So, about Zaros's return...",
    "...",
    "I'd like to talk about Zaros's return.",
    "What are you to him?",
    "Well that cleared things right up, thanks.",
    "That's not quite correct. If not for me, he wouldn't be back at all, not even in a weakened state.",
    "Hello again.",
    "About that...",
    "Yeah, so... Zaros IS back.",
    "He's... actually, you know, I'm not sure where. I'd assume at Senntisten Temple.",
    "Positive - I helped make it happen.",
    "He looked strong... divine...",
    "He looked weak... vulnerable...",
    "I think he'd rather the other gods didn't know he was back, though.",
    "Actually... about that...",
    "Oh, er, never mind.",
    "You know, I think you're right - there does seem to be something special about this spot.",
    "There's an abundance of anima and divine energy in the area.",
    "Maybe?",
    "Sliske! What do you want?",
    "Why don't you just give me a straight answer for once?",
    "If it's the last of those, you certainly fit the bill.",
    "But you said you'd give me a straight answer.",
    "The difference is that I didn't kill Guthix!",
    "You said a straight answer.",
    "So which is it?",
    "Have you?",
    "...",
    "I've seen... things after touching the Stone.",
    "You said a straight answer.",
    "I thought that was just a distraction for Zaros's return...but he's back now.",
    "So why keep up the charade? Wouldn't you tell the other gods he's returned?",
    "Even though he excommunicated you?",
    "And what do you get out of a second God Wars?",
    "Just answer the question!",
    "Black is not a colour, it's an absence of colour!",
    "Picking two colours is cheating!",
    "Yes, very. Thank you.",
    "Well, I guess that's as straight an answer as I can expect from you.",
    "I'm not your brother/sister!",
    "No, wait!",
    "I'm...I'm not a wight?",
    "So... I have some news for you. Which do you want first: good or bad?",
    "Okay, so, I guess you'd think it was good news that... Zaros has returned.",
    "It is; I was there. In fact, if not for my aid, he'd not have been able to.",
    "Sliske has been excommunicated – he's no longer a loyal supporter of Zaros.",
    "He's strong – returned to his former glory. I made sure of that.",
    "He's weak. I'm sure you'd think that's bad news...",
    "Azzanadra didn't tell you the plan?",
    "Actually, never mind.",
    "Are you unique?",
    "Who?",
    "Why were you so opposed?",
    "What about after Zamorak deposed you?",
    "More time than we have? Before what?",
    "Which is?",
    "But she's awake again now, and lively – why is that?",
    "Where will she go? What will she do?",
    "But our aims are to free mortals from the influence of all gods - yourself included!",
    "Do you intend retribution?",
    "What are your views on the young gods?",
    "With you as ruler?",
    "Guthix's inaction?",
    "You're referring to the Elder Halls?",
    "What exactly are they?",
    "What are your goals?",
    "Which is to become an elder god?",
    "You wish to control all mortals?",
    "What do you get out of doing this?"
  ],
  "Azzanadra": [
    "I am here under direct orders from Zaros.",
    "Not yet, my friend. You are not quite ready.",
    "Indeed - your role in this is pivotal.",
    "Rejoice! The time for Zaros's return is at hand!",
    "Take some time to think this through.",
    "Yes. Guthix's death was a tragedy, but it has allowed all other gods to return. There is one final obstacle preventing Zaros's return, however. Once more, I request your services in the name of my lord. You, and only you, are capable of removing this obstacle. While you may not always have displayed an unerring devotion to Zaros, you have always come through for us. All disagreements between us are in the past. Any doubts you may have will be answered. Today, we shall truly see if you stand with Zaros or against him.",
    "Ever since you released me from my prison I knew there was something different about you. I have had little reason to rely on humans, even fewer to call one friend... but you have proven yourself time and time again. I have faith that you will prove yourself once more. Not just to me, but to Lord Zaros himself. This will be a glorious day. Zaros awaits you through the World Gate. Will you go and help him?",
    "Ever since you released me from my prison I knew there was something different about you. I have had little reason to rely on humans, even fewer to call one friend... but you have proven yourself time and time again. I have faith that you will prove yourself once more. Not just to me, but to Lord Zaros himself. This will be a glorious day. Zaros awaits you through the World Gate. Will you go and help him?",
    "Do not be swayed by propaganda. Remember that history is written by the victors. I was there during the downfall of my lord's empire. I witnessed firsthand the butchery of those who despised and feared him. It was a power grab - plain and simple - but you need not take my word for it. Whatever you may think of Zaros, you owe him the chance to explain himself in person. All I ask is that you keep an open mind. Zaros awaits you through the World Gate. Will you at least meet with him?",
    "Do not be swayed by propaganda. Remember that history is written by the victors. I was there during the downfall of my lord's empire. I witnessed firsthand the butchery of those who despised and feared him. It was a power grab - plain and simple - but you need not take my word for it. Whatever you may think of Zaros, you owe him the chance to explain himself in person. All I ask is that you keep an open mind. Zaros awaits you through the World Gate. Will you at least meet with him?",
    "Excellent. Zaros will be most pleased to finally meet you.",
    "Yes, it is a portal between realms, created by Guthix many millennia ago. While there are many portals that allow for travel from plane to plane, only the World Gate has the power to reach every plane in existence. Though, at present, it can only reach worlds that either Guthix or Zaros visited with it. To reach Zaros by any other means would require more power and time than is available to us.",
    "Why am I not surprised that you can peer into the Shadow Realm? You're a most resourceful ally.",
    "Still, it remains useless until we bring it back into the material realm.",
    "It is right here, hidden in the Shadow Realm, away from prying eyes.",
    "We require the aid of another for this task.",
    "I think you know all too well. I was unsure of this, but Zaros was clear.",
    "We have no choice in the matter.",
    "Wait! Allow Sliske to fulfil his orders first.",
    "I am surprised at your civility, considering all that Sliske has done.",
    "Sliske is the only one of us capable of drawing the gate back into the material realm. I am not happy that we need him, but need him we do. Play your part, Sliske, and then go about your business.",
    "What was the delay?",
    "You were in the Shadow Realm with Sliske for quite some time. I hope he wasn't filling your head with his nonsense. I do not trust him.",
    "But I do trust you. I have every confidence that you will continue to support the Zarosian cause.",
    "...and I am unsure of your true motivations, but you have been a friend when it has counted, and Zaros has faith in you.",
    "Nor do I fully trust you. When talking with Zaros, please keep an open mind.",
    "Did Sliske say anything to you while you were in the Shadow Realm?",
    "Sliske! Does your deceitful tongue know no bounds? Zaros shall hear of this!",
    "True enough, and the fact that he/she told me of your ploy increases my belief in him/her.",
    "That can be damning enough.",
    "That can be damning enough.",
    "I've taken the liberty of setting the gate to where you'll be going. In fact, it is the ONLY place it will take you until Zaros is returned. Once on the other side, everything is up to you. I am under orders to remain here, and I will ensure Sliske never leaves my sight.",
    "Step through when you are ready, World Guardian. The Empty Lord awaits...",
    "The gate's destination is locked. Only Zaros can remove that lock.",
    "Freneskae, yes! It is where all Mahjarrat originate.",
    "None taken. I would not expect anyone but a Mahjarrat to understand its beauty.",
    "Something you wish to share, Sliske?",
    "Oh, don't be so puerile. You know as well as I why he's there.",
    "Which is for Zaros to tell you himself.",
    "Ah, so he has chosen to share that knowledge with you. Now you see why we left Icthlarin for Zaros. Zaros was able to give us such insight into our tribe, to provide us with means to rejuvenate ourselves. He is our progenitor, of sorts.",
    "Are you really still hung up on that?",
    "As I recall, you always managed to do your own thing regardless.",
    "Not much, I'm afraid. All I know is that is from where Zaros has been contacting me, via the communication portal in the Temple at Senntisten.",
    "Do not mock my hat – it deserves respect! It is a sign of my devotion, my position in the church!",
    "One of these days I'm going to melt that smug grin off your face.",
    "I do not recall any such creatures on Freneskae.",
    "Hmm, you sound as if you are describing Nex.",
    "Ignoring that obviously provocative remark...some advice, should you wish it. These are pack animals, as you say. A strategy for defeating them might lie in the order in which you fight them. Also, if you feel strong enough to take on more than one at a time, they might be less inclined to charge at you. Alternatively, stick with one-on-one battles and try to avoid their charges.",
    "You've actually seen her?",
    "The mother!",
    "I will leave Lord Zaros the honour of imparting this information to you.",
    "You speak of Mother Mah.",
    "She is the mother!",
    "Whatever your beliefs, Sliske, you cannot mock Mah. It is said that all of our race originates from her. Each of us carries a part of her with us. We heard her name in our heads, and her cries for miles around the volcano of which you speak.",
    "But then Zaros found us, and showed us how to use our rituals for our own benefit.",
    "You are really facing muspah? Our legends are true? In our folk tales, they were most affected by the ancient elements - blood, smoke, shadow or ice spells should prove most effective.",
    "Only by name. This is something only Zaros knows – you should ask him.",
    "All beings keep secrets, and typically for good reason. You keep more secrets than any other I know, so cut the hypocrisy.",
    "What is the significance of these Elder Halls?",
    "Then you had best do so.",
    "I can almost sense Zaros's presence. Is he close?",
    "Nex and Char will arrive as he does. There is time for more questions if you wish, or are you ready for Zaros to return?",
    "Is Zaros's return close?",
    "Only by name. This is something only Zaros knows - you should ask him.",
    "All beings keep secrets, and typically for good reason. You keep more secrets than any other I know, so cut the hypocrisy.",
    "Is Zaros's return close?",
    "I can almost sense Zaros's presence. Is he close?",
    "Nex and Char will arrive as he does. There is time for more questions if you wish, or are you ready for Zaros to return?",
    "My lord! You are returned!",
    "You are exactly as I remember.",
    "You have my eternal gratitude. This cannot go unrewarded.",
    "My lord, there is something you should know...",
    "But... What has happened? You are injured.",
    "No! What... what have you done? This cannot go unanswered!",
    "...",
    "Then who?",
    "Ever since you helped me to restore our connection to him.",
    "You wish to create a greater level of destruction?",
    "It will be done, my lord.",
    "I will find a way.",
    "Before anything else, I have been instructed to reward you further.",
    "Now that is out of the way, what would you ask of me?",
    "It was a truly joyous occasion. I suspected Sliske would attempt to coerce you – that was unavoidable – but my faith in you was well placed. I hope you do not regret your actions.",
    "Back at the height of the empire, had someone told me that Zaros would be banished from this world, I would not have believed it. After his banishment, had someone told me that a mere human would be the one to return him, I would have laughed. These things have taught me humility, a trait others of my kind lack. But I'm not entirely sure you are human anymore. No, you are something else now. I am glad you are on our side.",
    "I suppose I can understand your reservations. Zaros is an unknown quantity to you. I can only imagine that he managed to impress upon you the gravity of our situation. I trust, at least, that you see the need for his return, even if you cannot be happy about it. Being World Guardian requires you to make difficult decisions that affect us all. You do not have the luxury of personal bias.",
    "Be very careful what you say here, 'World Guardian'. If I were not under orders from Zaros... But I would know this: do you regret your choice?",
    "That...is a start, but know that there is not one word you could say to me to repair the damage you have done. If you truly regret your choice, prove that with actions, not words. For so long as Zaros lives, you need not fear retribution. But if he dies before his plan is complete, then no amount of apology or regret will keep my hands from your throat. In time - if you prove yourself to me again - I may be able to forgive you.",
    "In the short time I have known you, your powers have grown considerably. You have a remarkable inner strength, and a capacity to overcome any obstacle. I doubt it will be long before you can stand up even to one of my kind. I have been honoured to call you a friend. But, if Zaros dies as a result of your actions, do not think for one second that any of that will save you. I will pour every ounce of my strength into your destruction. Nothing will stop me! Do you understand? Nothing!",
    "He returns here regularly, but is mostly familiarizing himself with this world again. He watches from the Shadow Realm – gods, dragonkin, and mortals alike. There is much work left to do, for which we must prepare.",
    "If you wish to converse with him, use the Shard of Zaros in the Sanctum on Freneskae. We shall contact you when you are needed."
  ],
  "Sliske": [
    "Speak of the Mahjarrat, and he shall appear.",
    "Oh, there's always a choice.",
    "Under orders, am I? Maybe I WANT to be here.",
    "It's nice to have fans.",
    "No, Azzy. I think I might stick around for a little while.",
    "Ah, I see you are wearing that little ring of mine. So, you can already see the World Gate in all its glory.",
    "Well, you won't be needing the ring for this.",
    "It might help if you could first see the World Gate.",
    "I'll have to pull you into the Shadow Realm for this.",
    "...the sooner you can return to guard duty?",
    "...the sooner you can kill me?",
    "...the sooner you can return to worshipping me?",
    "Now, let's not rush into things here. I have a proposition for you...",
    "What can I say? I am who I am. At least I'm consistent.",
    "Oh, he can't hear. This is for your ears only. My mastery of the Shadow Realm has grown, even since our meeting in Guthix's shrine.",
    "As one of Armadyl's preeners, there's a chance to mete out some justice here. Zaros is no innocent, you'll soon see that.",
    "As one of Bandos' brutes, there's the chance of earning some real bragging rights here. Just think if you killed him!",
    "As one of the Godless, there's an opportunity here for a big win. You could seriously weaken a god, or perhaps even stop his return!",
    "As one of Saradomin's peons, I think you might like this one. I'm certain old blue-beard wouldn't want Zaros running amok again.",
    "As one of Seren's protected, there's a chance here to secure this region. She got off easy last time; this time will be different.",
    "As one of my groupies, there's a chance here for some fun. Perhaps you could even add a tally to your own god-killing score!",
    "As one of Zamorak's lackies, here's a chance to cause some real chaos. I don't think the usurper would want the usurped coming back.",
    "You're a Zarosian, but you've never met him. What if he doesn't live up to your expectations? All I'm offering is an alternative, so you can be prepared.",
    "You don't have any real allegiance, so you have no investment here. I'm just offering you an alternative.",
    "Azzanadra is too devoted to see Zaros' flaws. You are not so blinkered.",
    "Of all the gods, I like Zaros most. He just gets me, you know? He helped to make the world my playground. But he's been gone a long time and we're all getting on just fine without him. We don't need him. We don't need any gods.",
    "This isn't about me.",
    "And this time, you don't have to. Through that gate you're on your own. Neither I nor Azzanadra can follow you.",
    "Ask Azzanadra if you don't believe me. I'm not fool enough to so openly disobey Zaros's orders. It will be just you and Zaros. You can see for yourself what he's like, and make up your own mind. All I'm suggesting is that you don't have to do what is asked of you. You always have a choice. If you don't like what you see, then, as World Guardian, there's something you can do about it. The point is that, ultimately, HIS fate is in YOUR hands. And that, to me, is such sweet irony - it's what I live for.",
    "Loyalty goes both ways! I see the truth, unlike pious Azzanadra over there. Oh, I still follow orders like a good little Mahjarrat, but I've always taken them more as guidelines. I like to be creative.",
    "That was more my... interpretation. Zaros wanted to return, but I saw futility in bargaining with Guthix. I suspect Zaros knew that, but he's not exactly forthcoming.",
    "Zaros needed a diversion, so I gave him one. While the other gods are busy with their infighting, Zaros can return unchallenged and none will be the wiser.",
    "After a fashion.",
    "What can I say? I'm complicated.",
    "Zaros doesn't just want your help, he NEEDS it. He hasn't said why exactly, but you are the key ingredient. That puts him at your mercy. Whatever he wants of you, you have a choice to make. As World Guardian, even he cannot force you - the decision WILL be yours. Whatever you might think of me doesn't come into it. If you like Zaros, then by all means help him. But if you're opposed to him, now is your best opportunity to get rid of him for good, or at least weaken him further. Go and meet Zaros. Make your choice. If you just walk away, this decision could fall to someone else.",
    "You think that now, but keep it in mind. Forewarned is forearmed.",
    "That is all I could ask for.",
    "I am glad you agree, but note that Zaros is no fool. He will most likely know if you do this. Have courage in your convictions.",
    "That's enough prattling; let's get this gate working again.",
    "The gate is currently locked. Until the lock is removed, the gate can't be used. It's a simple combination lock really - one turn right, one turn left, one turn right. You just need to know the correct symbols to turn to.",
    "Oh, so you have. Way to steal my thunder. I had a whole speech planned. You have a habit of taking the fun out of things. I might have to do something about that.",
    "Well, go on then, I'm waiting.",
    "Honestly, adventurers these days. Where's your work ethic? The joy of figuring things out for yourself?",
    "Oh, fine. I'm bored with waiting. Here...",
    "There, the combination, on the pillar next to me. Never let it be said that I don't give you anything.",
    "Struggling, are we? Come on, World Guardian, it's not that hard.",
    "Just turn it right to the first symbol, left to the second, then right again to the third.",
    "The symbols are on the pillar next to me.",
    "He won't be able to hear or see you. His grasp on the Shadow Realm is poor.",
    "Just as well, as there's something I want to talk to you about.",
    "That certainly took you long enough. Come closer and I'll explain what comes next.",
    "Now we bring the World Gate back with us into the material realm!",
    "Oh, calm down, Azzy. Zaros has waited for millennia. Another few hours won't kill him.",
    "I was under no illusions that he wouldn't - he'll understand. But what happens through that gate rests in the hands of our little World Guardian here.",
    "Oh, don't mind me. I have no plans to interfere.",
    "Urgh.",
    "Freneskae is such a boring place; there's nothing to do there. Not like here – Gielinor is SO much more fun!",
    "Because he's eeeeevilllll!",
    "Oh yes, he's our 'big brother', alright.",
    "Zaros wanting to know our every move? Our every thought? Let's just say I'm not looking forward to having to 'file reports' again.",
    "Yes, I suppose I did.",
    "Big Boss to Bunny Ears, Big Boss to Bunny Ears. Come in, Bunny Ears.",
    "A church that ceased to exist along with the empire. It's about time you faced up to that.",
    "Oh, I do like Nex. How is she these days? I've not seen her since I killed Guthix.",
    "Oh, here we go.",
    "Mahjarrat legends say that it was she who instigated our rituals. Certainly in my time, there were many more sacrifices than births. So, when Icthlarin visited our world, we were all too keen to leave. Some poor saps stayed behind. I wonder what became of them...",
    "Oh, something else Zaros hasn't told us about.",
    "True enough.",
    "Aww, did Freneskae give you an ouchie?",
    "What killed you this time?",
    "Perhaps it is true - third time's the charm.",
    "Freneskae: 4, World Guardian: 0.",
    "I'm losing count of all your dying.",
    "Could this be lucky attempt number seven for you?",
    "Honestly, would you stop dying? It's getting so boring.",
    "Hahaha! Then you'd best hurry and do that, before Azzanadra has a little 'accident' from all the excitement.",
    "Oh, something else Zaros hasn't told us about.",
    "True enough.",
    "Hahaha! Then you'd best hurry and do that, before Azzanadra has a little 'accident' from all the excitement.",
    "I am yours to command. Just say the word.",
    "What did you say?",
    "But... no! I... I am loyal! Have I not always been loyal? Have I not done everything you've always asked of me? As the empire fell, did I not keep safe those things necessary for your return? Was I not pivotal in the liberation of all those who stand before? Did I not kill a god for you? You cannot turn me away. Not now, Zaros, please!",
    "... Hahaha! Very well. I guess I'm not quite the actor I thought. What gave me away?",
    "Betrayal? They could have just walked away, left you to rot! I was just convincing them to hear you out! It was down to you to convince them of your worth!",
    "Are you sure it's not just because me killing Guthix puts me beyond your control?",
    "Fine, don't answer. So, what's next? An intervention? Family counselling? Maybe some trust exercises?",
    "Oh, I've always been alone. But I guess this means you'll have to find someone else to do your dirty work. Your new World Guardian pet, perhaps?",
    "'As you command... my lord.' But don't think this is over, World Guardian. I'm just getting started with you. Where I'm concerned, Zaros's protection of you no longer applies.",
    "Between you and me, all bets are off. Be seeing you.",
    "Leaving so soon, World Guardian?",
    "Now there's a question! What do I want? World peace, perhaps? Or a puppy? Maybe I just want to be left alone.",
    "Hmm, what an interesting proposition... Very well. You get ONE straight answer. Ask your question.",
    "What is a god? Power? Followers? A miserable little pile of secrets?",
    "Very droll.",
    "So I did. It's true I gained power from killing Guthix...but then so did you and you're no god.",
    "You might as well have - you opened the way; you gained his power. But to answer your original question...I am no god. It would be a bit silly of me to start a tournament to kill gods right after becoming one. But I HAVE significantly grown in power.",
    "Oh, plenty of people had THAT idea, and most of the gods wanted it.",
    "So I did.",
    "You mean did Zaros order me to, or was it of my own volition. As if he would ever give ME a straight answer.",
    "Did Zaros order it explicitly? No.",
    "Would he have done ANYTHING to return? Yes. Sure, he sent Azzy in to 'negotiate', but he must have known as well as I that it was futile. So I took the initiative. And what do I receive by way of thanks? He makes me his pariah, his scapegoat. And you think I'M slippery. But I stand by my choices. This world needed things shaking up a bit.",
    "Ooh, now that's an astute question! But, yes, I do have it. The question you maybe should have asked is if I've really used it.",
    "Now, now - that's two questions. You have your answer.",
    "Oh, fine, seeing it was such a good question. Yes, I have made use of it... but I am not making continual use of it. We both witnessed how that plays out, courtesy of Lucien. The Stone has more uses than simply transferring power - though we both have used it for such. It can also transfer knowledge! A much smaller transgression in the rage-addled minds of the dragonkin. I believe this to be how Guthix himself used the Stone - for knowledge, not power. Perhaps that is the difference between a 'false user' and a 'stonetoucher'.",
    "I have learned much of its past users: Guthix, V, Zamorak, Saradomin, Lucien... and you. Such exalted company.",
    "Why do you assume I have plans? Maybe I'm just making things up as I go along.",
    "So I did. But then, you know my plans. I intend to stir up a second God Wars.",
    "It still helps him – the longer the gods are distracted, the less likely they'll even realise he is back.",
    "There's one thing you should know about me. I give my word rarely... but when I give it, I keep it. I promised Zaros that I would cause a distraction to keep his return secret for as long as possible, and I intend to keep it.",
    "You forget that the method of this distraction was MY choice. And it is MY choice to keep it going, not Zaros's. In anything I do, there's always something in it for me.",
    "You mean aside from entertainment? But that's a second question.",
    "Hahaha! The universe falling down around your ears and you ask me a question of such frivolity! I like your style!",
    "Hmm, let me think... Well, black never goes out of the style.",
    "Alright, no need to be pedantic. Okay, I'm a fan of blue-green colours.",
    "Alright, fine! Aquamarine; I like aquamarine. Happy now?",
    "I guess so.",
    "Now, now. Don't be greedy. I did just say one. You do like to push your luck... but I suppose that's one of your better qualities.",
    "Now, now. Don't be greedy. I did just say one. You do like to push your luck... but I suppose that's one of your better qualities.",
    "Now, now. Don't be greedy. I did just say one. You do like to push your luck... but I suppose that's one of your better qualities.",
    "Now, now. Don't be greedy. I did just say one. You do like to push your luck... but I suppose that's one of your better qualities.",
    "Good boy/girl.",
    "So, what's next for me and you?",
    "More like you'll try. For all your efforts, you couldn't even stop poor little Lucien. It took the dragonkin to end him, and I've already mastered those mindless idiots. Are you going to sic Zaros on me? I don't think so. He's got bigger fish to fry than little old me. Maybe you'll wake up another elder god to squash me like a bug? Maybe that's what I want you to do.",
    "Oooh, I knew there was a reason I liked you. I'd like to see you try, brother/sister.",
    "Oh, aren't you? We both took some of Guthix's power. We both watched him die. That makes us connected in stronger ways than mere siblings. I'd count us as equals... if you didn't have so much catching up to do. Come at me, World Guardian. Who knows? You might even win.",
    "Aww, how sweet, another groupie...but I work best on my own.",
    "By all means, join Relomia's little fan club.",
    "I see you're already a member of Relomia's little fan club.",
    "But if you want to make yourself truly useful... Stir things up; kill some gods. Who knows? You might even win my little competition. Wouldn't THAT be something?",
    "Well, you know what they say: if you're bored then you're boring. I suppose I'll just have to try to make things MORE interesting for you. Not like Lucien and his pantomime villain routine - 'You dare attack a GOD?' Hahaha! Not like the predictable dragonkin and their boorish violence. And not like all these gods and their huge egos...Zaros included. But you're right, absence does make the heart grow fonder. I think it's time for me to take the back seat for a spell.",
    "That's enough chit-chat – I'm done here...but before I go, I have a little gift for you.",
    "Don't you even want a peek? You'll like it - it's a doozy.",
    "Suit yourself. If you change your mind, you know where to find me.",
    "Hmm, now isn't that interesting?",
    "Hahaha! Your face! I'm not trying to 'collect' you anymore, silly. You're already mine! My gift allows you to see into the Shadow Realm without need of that scrawny ring. Next time, I want you to see me coming..."
  ],
  "...": [
    "Stop!",
    "Not following. Leading the way. And you know exactly who I am. Say my name."
  ],
  "Zaros": [
    "Yes.",
    "It was necessary.",
    "She stirs in her sleep.",
    "She is the elder god, Mah... and her dreams can be violent. We should talk elsewhere. Shall we?",
    "This is the threshold of your mind.",
    "Have no fear, World Guardian. I would not enter your mind without consent, nor could I. I have only brought you here. I am outside, looking in. We needed a safe place to talk where she could not sense me. That is all.",
    "Yes, and when you wake, we will have to deal with Mah.",
    "You have questions. Know this - I will never lie to you. And in this place you would sense if I did. But there are some truths for which you are not yet ready. All will be revealed in time.",
    "You have doubts. Know this - I will never lie to you. And in this place you would sense if I did. But there are some truths for which you are not yet ready. All will be revealed in time.",
    "The power Guthix bestowed upon you before his death dampens divine magic and energy. it is my belief this power will also shield my presence from Mah. If she were to sense me and fully awake, that would be bad... for everyone. Beneath her, at the planet's core, I will be able to create a new corporeal form for myself. I wish for you to take me there, or to go there in my stead.",
    "As I would be by your assistance. Though we should learn of one another. Whatever your questions, I would answer them.",
    "Though we should learn of one another. Whatever your questions, I would answer them.",
    "Ultimately, the choice is yours, but your decision should be an informed one. Your opinion of me is so far coloured only by what others have told you. Whatever your concerns, I would ease them.",
    "Ultimately, the choice is yours, but your decision should be an informed one. Your opinion of me is so far coloured only by what others have told you. Whatever your concerns, I would ease them.",
    "I did not become. I have always been. I was created this way.",
    "By Mah.",
    "She is an elder god. The youngest of five.",
    "The elder gods are ancient, primordial beings; the creators of this universe. Mah's power is rooted in potential, in darkness and in light. I am the divine aspect of dark energy.",
    "I came into being atop this volcano on which we currently reside. Mah was left here by the other elder gods; they believed her stillborn. But she survived and eventually clawed her way out to the volcano's crater. Her sisters gone, she was alone, and poured what little energy she had into creating me.",
    "I was born in the infancy of this universe.",
    "Aeons.",
    "To my knowledge only the elder gods are older.",
    "All beings are unique, but I understand your meaning. There is one other akin to I – the divine aspect of light energy.",
    "I shall not speak of it here, but I sense you have an inkling of whom I speak.",
    "I left here solely to get away from Mah. She is cruel and possessive; I had to be free of her. I travelled the universe; met many mortal races, and both learned and taught a great many things. The exploration and discovery was enough to begin with, but I came to need a purpose. I have seen the entire span of creation, the progression of the elder gods, and knew immediately upon my arrival that Gielinor was special. It was there that I found my purpose. In order to achieve my goals I must return there, and with a corporeal form.",
    "All gods rally followers to them, whether they mean to or not. Mortals cannot help themselves. Some gods take advantage of this. In my youth, I was guilty of this. When I arrived, there were many young gods carving out territory, engaged in petty skirmishes and border disputes. I sought to unify them under my banner, but they... resisted. But those under my charge were uplifted. My empire led to a great many advancements: industry, medicine, technology, magical discovery. It is true that many died in the name of progress, but many times more prospered – humans, demons, and vampyres alike. More died in its destruction at the behest of Saradomin and Zamorak than ever in its creation.",
    "I do not know what you have heard, but the only two beings present were myself and Zamorak. Anything else you have heard is either lies, rumor or speculation. And it is not something I care to discuss.",
    "Not even the elder gods know all and see all. If that were the case, I would never have been able to leave this place. Mah would not have allowed it. So, no, I did not anticipate for Zamorak's ascension, nor did I engineer it. Equally, I do not begrudge it. He taught me a valuable lesson that day. He taught me of betrayal.",
    "Sometimes, simply being the largest target is enough to become vilified, but it is also because I sought unification. I wanted to bring all the young gods under one banner, but they would not recognise my divinity. I would have welcomed them all, but they were blinkered by their own narrow, dogmatic views, and so they rejected me. I did not start wars; I was just better at them... and through war I started to make progress.",
    "Zamorak feared retribution from those remnants of my empire who remained loyal to me.",
    "Saradomin sought my secrets. Whether to steal them or bury them, I cannot say.",
    "Ultimately, it is not important. The empire failed, and is no more. To build another would be folly. Mortals cannot be united by will or by force alone. Even if they could be, doing so would take more time than we have.",
    "I will get to that in due course...",
    "This is not crucial information. There will be a time to discuss this later, should you wish.",
    "Without her I would not exist, but she is like a child. As such, she was unable to teach me much of anything. What I have learned, I have discovered since I left. She is an elder god, the youngest of five. Yet the anima of this plane was not sufficient to nourish them all, and Mah was malformed. She was born without memory or knowledge, only instinct. After finally clawing her way to the surface, her first instinct was to pour what little energy she had into the creation of me and my companion. That would likely be an affront to the other elder gods. To her I was akin to a child's doll. She is mentally fractured, but I have intellect, and I could not abide her possessiveness. As soon as she started to weaken, I left. It seems that our presence has stirred Mah. When you awake we will have to deal with the consequences.",
    "He was like a myth, spoken of in hushed tones by those of his followers who had not allied with other gods. I would very much have liked to have met him. We shared some ideals. We both valued mortal life enough to step aside. Though where he would leave them to their own devices, and their own failures, I would guide them subtly towards their true destinies. I would not impose my beliefs on mortals as other gods do, nor force them into worship of me. My aim is to be the voice that drives them to greatness. Not all would heed the call, but not all have to.",
    "I note that you are a member of the Godless. None of you need fear me. Indeed, I could perhaps even help you to achieve your manifesto.",
    "Ultimately, perhaps, but there are many ways to achieve that goal. If you stop me today, you stop one god. Indeed, if returned at full strength, I would have the ability to evict the young gods and build another barrier... though I would rather find a more permanent solution.",
    "I have nothing to say about Seren.",
    "Ah, yes. As we discuss certain topics, you will be seeing manifestations drawn from my memories. Yes, this is how she looked when last I saw her.",
    "I note that you are a follower of Seren. Neither of you need fear me. By all means, continue to serve her. I will not ask anything of you that conflicts with your beliefs. In fact, I am pleased that you would seek her guidance and protection, and in turn protect her. However, that is all I am willing to say about Seren.",
    "Yes, this is how she looked when I last saw her.",
    "No more questions of Seren.",
    "He was once my most trusted general. I never had cause to doubt his loyalty... right up until the point that he betrayed me. I do not know what led him to it. In some ways he epitomises what I advocate. He has a strong will and has overcome his limitations... but he did so at my own expense.",
    "Revenge would serve no purpose, but even if it would I have no time to enact it. There are more pressing matters that require my attention.",
    "I note that you are a follower of Zamorak. Neither of you need fear me. By all means, continue to serve him. I will not ask anything of you that conflicts with your beliefs. One day, I may forgive his transgression, though I can never forgive the time we have lost due to his whim.",
    "He is self-righteous, seeing things only in extremes. It was from him that I first learned of the notions of good and evil. I dismiss such notions – there are only actions and consequences. We agreed to disagree. Everything to him is either black or white, but he himself exists in the grey. Ergo, he is a contradiction. Yet many have prospered under his rule, most notably your species... so there is some merit in what he espouses. And he has become the most powerful young god in the wake of Guthix's end. He would make for a good envoy, if only he would widen his world view a little.",
    "I note that you are a follower of Saradomin. Neither of you need fear me. By all means, continue to serve him. I will not ask anything of you that conflicts with your beliefs. In fact, my return would serve the greater good. Someone must parlay with the elder gods. For all of his advancements, he is still of mortal origins. The elder gods would no more listen to him than they did the dragonkin.",
    "When I knew him he was idealistic and naïve, but his intentions were always pure. There is value in that. Azzanadra has told me of the tragic loss Armadyl suffered during the God Wars. If he had given into his despair I would have no interest in him, but his recent victory over Bandos suggests this event has forged him. I shall watch his progress intently.",
    "I note that you are a follower of Armadyl. Neither of you need fear me. By all means, continue to serve him. I will not ask anything of you that conflicts with your beliefs. I have always been content to coexist with all young gods and mortals alike.",
    "He had a brilliant strategic mind and an innate ability to expose the truth in any situation. If only he could have curtailed his eternal desire for war, he might have proven useful. I have more interest in the one who defeated him, and in those who will succeed him.",
    "The god may die, but the philosophy is eternal. In time, another will grow to take his place, be they a god or not.",
    "I note that you are still a follower of Bandos, even in spite of his death. You need not fear me. By all means, continue to inhabit his philosophy. I will not ask anything of you that conflicts with your beliefs. Though do not make the mistake of challenging me directly.",
    "As Zamorak taught me of betrayal, Azzanadra has taught me of loyalty. He had no reason to remain so after my banishment, and yet he has. In my empire, he stood at the head of the church. He has also since proven himself a worthy general. And he has kept the faith for all these centuries when so many others chose to forget me. He is loyal, devout, intelligent, strong and honourable. He has power, but does not misuse it. He embodies all of the traits that I hold dear. Finally, he has brought you to my attention – you who find yourself at the centre of all things.",
    "Sliske's loyalty has only ever been to himself. When our goals align, he can prove useful, but his recent exploits are not something I can condone.",
    "I cannot stand as both judge and executioner. I leave it to those he has wronged to bring him to any justice they feel he deserves.",
    "I did not.",
    "I am glad.",
    "That is your right.",
    "I note that you are a follower of Sliske. Neither of you need fear me. By all means, continue to serve him. Be careful he does not take advantage of your fealty. I remain interested in his exploits, so long as they do not conflict with my own.",
    "They did not exist when I left this place, but when I first encountered them I knew instantly that we shared kindred.",
    "Their name means 'the children of Mah'. Their crystals mark their divine origin. They were unmistakably relations.",
    "I saw them as younger siblings and sought to protect them.",
    "Divine creations are more fragile than you realise. Their race is the epitome of potential, but their fate is also sealed.",
    "Had he known what he was truly dealing with, Icthlarin may never have brought them to Gielinor. He tried to reign in their nature, and it was not long before one of their number broke free. It was easy for me to convince that breakaway of my superiority.",
    "Sliske.",
    "Not all Mahjarrat chose to leave Icthlarin's service, but the few that remained did not last long. So, in a desperate final act, the desert god Tumeken devastated his own lands to discourage me. I was given pause, and ended my campaign. I realised that I had become what I was fighting against. From that point on, I slowly started to remove my presence from the empire. I provided the Mahjarrat with the means to rejuvenate themselves on Gielinor – something of which Icthlarin was incapable, for he did not understand them. And I encouraged them to be less wasteful with their rituals. If they were to become leaders in the empire, they had to endure.",
    "They are an intriguing race, but we will need to deal with them if we are to rouse the elder gods.",
    "I suspect their home plane was destroyed soon after the elder gods first left Freneskae. A small number of dragonkin survived this revision by taking shelter in the Abyss, among the detritus of previous cycles.",
    "This is a truth best revealed slowly. You will come to it in time. I believe the surviving dragonkin sought out Jas for mercy, or retribution, only to end up bound to her Catalyst. For the elder gods to hear the pleas of mortals will require someone to bridge the gap. Only a being of divine origin, such as I, has a hope of communicating with them.",
    "Nex is an almost perfect creation, but even she has limitations. She is unfailingly loyal; she can be no other way. It was the act of her creation that steered me on the path towards elder godhood. The young gods fear her not because of her strength, but because of how she came into being... what she represents.",
    "Not exactly. The nihil only came into being due to Mah's own energy; the creation of life is beyond me. Because of this, to me the nihil were a failure... save for one who stood apart from the pack. I gave her consciousness, and she became Nex. One success from so much failure.",
    "I was fascinated by the auspah race, and by Char especially. She was reminiscent of one I used to know. I drew great comfort from that. I am very pleased to have discovered that Zamorak did not kill her. I will welcome her in my presence once more.",
    "Such a noble race... I am ashamed to say I failed them. I sought to overcome the race's infertility, but Zamorak deposed me before I could find a solution. But I am only able to alter existing forms of life. As an elder god, the solution would be trivial. Call them by their true name: ilujanka. Their memory deserves respect.",
    "I am shocked that he has managed to survive this long, but pleasantly surprised. This is most fortuitous.",
    "Indeed. He will be well placed to aid my cause there. We share a mutual goal. It is unfortunate, however, that he has swapped one prison for another.",
    "Good. After all he has been through, he should have some time with his kind. Though, if he is the key to resolving the dragonkin issue, I only hope he does not pass before he is needed.",
    "Demons were the first conscious life I encountered after leaving Freneskae. I was fascinated by their culture, language, government, and beliefs. I took the Infernal tongue for my own, having had no need of speech before. And I used that language to seal them in a pact of servitude. Do not judge demonkind by those you have experienced. You will have only met the embittered Avernic slaves Zamorak led in an uprising after my banishment. My pact was with their Chthonian masters. Their forms were a seemingly random array of appendages, but they had one unifying trait: the ability to absorb knowledge from that which they ate. Ergo, within the strictures of demonic law, cannibalism was outlawed. Tellingly, the punishment for many crimes was to be eaten. Thus those in power grew ever more knowledgeable and vast. I can sense your unease that I would ally myself with such beings, but you should understand that they were not monsters. They were vastly intelligent, their pursuits cultural and artistic. Their value was in the militaristic Avernic forces they marshalled, and they rarely involved themselves directly in combat. Even though they were immensely difficult to kill, their numbers dwindled over the course of my empire. It is possible that some still survive to this day, buried in the deep places of the world.",
    "I once had a pet virius named Ocellus. He and his brother, Auriculus, stood vigil beside my throne, even when it sat empty. Virii are Chthonian pack animals, akin to Avernic hellhounds or your dogs.",
    "I was initially less convinced by the vampyres, but being only the second race I encountered, I had little to compare them to. At first, they were nothing more than predatory beasts, but I applied what I had learned from the demons and gave them a society. As with any burgeoning society, there was bloodshed and civil war... but eventually an aristocracy rose up that persists to this day. Even vampyres have the potential for good or ill, but their thirst is ever present and often overcomes their will.",
    "I was not aware I was making a choice – these were just the first races I encountered. These races originate from the lower planes – these being the earliest creations of the elder gods, and which are nearest to Freneskae. I would have gladly accepted all mortal species under my banner, but by the time I'd reached the higher planes, those races had adopted the doctrines of other gods.",
    "Even though they have moved beyond their races' limitations, to me, they are still only very powerful mortals. I sought to bring them under one banner – all races and ideals – so that together we might strive for loftier goals.",
    "I saw it as my divine right. The failure of my empire opened my eyes, however. Since then, I have had much time to consider my failures. I was acting no better than Mah, attempting to control mortals. I see my role now being to lead mortals – the young gods included – towards uplifting themselves. And to work with those powerful few who have stepped beyond the need for guidance. I see this in you.",
    "Guthix saw this in you too, at the end, but his inaction has cost us dearly.",
    "Yes. Gielinor hides a truth the likes of which even Guthix was not aware. If he had known, he would have done more than sleep. Freneskae holds the clues; you will see them with your own eyes soon enough.",
    "The elder gods do not purposefully create conscious life – only plants and simple organisms. These things generate anima. Yet conscious life has sprung up on countless imperfect worlds, on which the anima was in some way unbalanced. My belief is that beings with awareness are capable of generating more anima than the elder gods realise. Mah is proof that the elder gods are more fragile than you might think, and with them numbering only five they are on the brink of extinction. Counter to that, mortal life is more abundant and diverse. It is my view that mortals should inherit all of creation from the elder gods.",
    "I do not understand the question.",
    "Do not confuse darkness and light with evil and good. Real life does not deal in absolutes, not extremes. All life falls on a spectrum, and all life has capacity for both good and evil. Judge me only by my actions and my words, not by the words of others. I have made mistakes... but I do what I do because it must be done, and because there is no other who would. No other that could.",
    "It is my belief that everything that occurs in life – both good and bad – should be used to forge oneself, to better oneself. If we give in to weakness, then we do not deserve the gift of life. Where Guthix sought balance in the world, I seek balance in oneself. One must strive to increase in power, but also in knowledge of how to wield that power. The younger gods have tended to fulfil only one of these things. You, World Guardian, fulfil both of these criteria.",
    "First, I must obtain a new body and regain my divine status. With it, I shall return to my ultimate ambition.",
    "I intend to claim my birthright and become an elder god. Only then will I be able to stand equal to the universe's creators and speak on behalf of mortals.",
    "Once I return, I shall wake the elder gods. I will speak for all mortals, and the elder gods will listen.",
    "They are where they have always been since the creation of Gielinor. On Gielinor.",
    "First, I need you to make your way below Mah to the planet's core. Once there, I require you to gather some of her divine energy, and use it to weave me a new body.",
    "I hope to call on you. There is much to be done if we are to succeed. I will not ask anything of you that compromises your beliefs, or conflicts with your status as World Guardian. Until then, do as you would always do. Choose your path. Follow whatever philosophy or god you desire.",
    "I do not require your fealty, though I welcome it should you wish to give it. I only require your support when you are called upon, for the benefit of all. All else matters naught in the face of the Great Revision.",
    "All in due time.",
    "I disagree. You make your mind up too quickly.",
    "There are two crucial pieces of information you should know before you decide whether or not to help me.",
    "Or you are free to return to asking questions of me.",
    "Allow me to recap the two crucial pieces of information you require for what comes next.",
    "First, that I am the creation of the elder god Mah – she is the being lying comatose within this volcano's crater. And second, that I require some of Mah's elder energy to be woven into a new corporeal form for me to inhabit. This new body must be a dark simulacrum! A light simulacrum will reject my essence.",
    "Enough talk, World Guardian. Though Mah only stirs in her sleep, her nightmares will manifest and attack on sight, and her cries of pain will cripple you. You need only survive until her terrors subside. Only then will it be safe for us to proceed. But first, you must choose whether or not to allow me in.",
    "If you allow me in, I can lend you my strength to survive Mah's onslaught. I will not go beyond what you permit, and will leave once she is quelled or should you ask it of me. Do not let me in, and I cannot help. You put both our lives in jeopardy, and above that risk the fate of the very universe. Make your choice. We are out of time.",
    "I understand your reticence, and appreciate you giving me the benefit of the doubt.",
    "Very well, I shall leave. I hope you know what you are doing.",
    "Let us proceed.",
    "Mah stirs, World Guardian. Do you require my assistance? I can help you to survive her onslaught, but only from within.",
    "If you let me in, I can absorb some of the damage caused to you by Mah and her muspah. I can also supply you with unlimited power to fuel ancient magicks and curses.",
    "Let us proceed.",
    "Very well.",
    "Mah returns to her slumber. You were lucky to survive. Were you anyone but the World Guardian, your essence would now be scattered across Freneskae.",
    "We should act quickly, while we have this respite.",
    "You must climb down into the volcano's crater, below Mah, and venture towards the planet's core. The entrance is by Mah's hand.",
    "A place I refer to as the Elder Halls. Within it you should find some of Mah's leaked divine essence. Gather it as you would any other divine energy. Mah is weak, so it may be difficult to find. There is a tool within the halls to aid you. What little elder energy I have been able to harvest from muspah has only been enough to coalesce and sustain this form.",
    "You will require only enough to weave a divine simulacrum – an effigy of sorts. This new body must be a dark simulacrum! A light simulacrum will reject my essence. Once you have this simulacrum, return here with it, and I can shape it further to generate my new form. I would come with you, if you allow me back in. I can provide further instruction as you require it.",
    "Let us proceed.",
    "There, planted in the ground before you – that tool's pulses should help you locate Mah's energy.",
    "Use the Measure to locate Mah's energy.",
    "You will require more energy than that to weave a simulacrum.",
    "Plant the Measure nearby – that should invigorate the wisp.",
    "Does it not seem familiar?",
    "Not exactly. The one you have encountered is unique; altered to become what it is. This one's purpose was quite simple, and was fulfilled.",
    "Debris.",
    "Are you certain of that?",
    "Mah's.",
    "Perfect – that is exactly what I require. Return us to the peak. The next step must be done on the spot of my creation.",
    "Why have you woven a simulacrum from light energy?",
    "That is the opposite of what I require.",
    "You hesitate.",
    "Weave the elder energy into a dark simulacrum.",
    "What little elder energy I have been able to harvest from muspah has only been enough to coalesce and sustain this form.",
    "You will require only enough to weave a divine simulacrum - an effigy of sorts.",
    "This new body must be a dark simulacrum! A light simulacrum will reject my essence.",
    "Once you have this simulacrum, return here with it, and I can shape it further to generate my new form.",
    "This new body must be a dark simulacrum! A light simulacrum will reject my essence.",
    "Have you woven a divine simulacrum yet?",
    "I see that you have made more than one. Which did you intend for me?",
    "Yes, this is exactly what I need to return to full strength. You have done well, World Guardian. I am in your debt. Please, place it on the ground in front of me when you are ready.",
    "As you wish. I shall await you here. But do not tarry - Mah could stir again at any moment.",
    "Tell me, World Guardian - which of us do you take for a fool? Do you think it is me, that I would not know this simulacrum is woven from light energy? Or is it you, who has mistakenly woven the wrong body?",
    "Very well. I shall give you the benefit of the doubt.",
    "Then please, gather Mah's elder energy and weave a dark simulacrum.",
    "Would you like me to come with you to the Elder Halls? I can offer assistance.",
    "Let us proceed.",
    "As you wish. I shall await you here. But do not tarry - Mah could stir again at any moment.",
    "I see... There is no other who could perform this task for me - I am at your mercy. If all you would offer me is this, then I have no choice but to accept. But I must say that I am disappointed in your decision, after all we have spoken of. Your mind is still clouded by dogma and a misguided sense of morality. And you must understand that there will be consequences for your actions here today.",
    "And yet you would still do this? By weakening me, you lessen all our chances at survival.",
    "Your hatred of me blinds you. The threat is not mine. I speak of the consequences all mortals would suffer at the hands of the elder gods, if I am too weak to stand for you.",
    "Be certain in your decision, World Guardian. Once done, it cannot be undone.",
    "As you wish. I shall await you here. But do not tarry - Mah could stir again at any moment.",
    "She's waking! We have to leave! I need your permission! World Guardian, now!",
    "Mah awakes.",
    "Not yet.",
    "You have granted me new life. Before we return, I would acknowledge that.",
    "Time enough.",
    "I am pleased to hear that.",
    "You may come to learn something about me – that I... compel loyalty within others, forcibly.",
    "It is not something I have control of – it is something that was done to me by Mah. I am unable to rid myself of this... ability, but I must live with it. Do not be concerned – it does not affect you, World Guardian.",
    "Yes. It is one of the reasons I chose to withdraw from my own empire. I find the idea of coercing another mind to be... distasteful. But it only affects those in my presence, and the effect dissipates with time. This is how I know that those still loyal to me are truly loyal. They have not been under its effects for many centuries, yet still heed my call. I wished for you to know this from me, so that you could understand it.",
    "You worry you have made the wrong decision.",
    "I will do what I will do. You will choose to support or oppose me. What comes of that is what was fated to happen. That is all there is to say.",
    "But you have already made the choice to help me return. That choice has passed. To agonise over the past cripples our thoughts of the future. Do not procrastinate for fear of what might have been, or what might become. Your choices define you - you must learn to live with them all, good and bad. To do anything else would make you a poor World Guardian.",
    "You corrupted my new form. Did you think I would let that pass without comment?",
    "At least you stand by your convictions. There is hope for you yet. While we shared a mind, I could not lie to you... but nor could you to me. I saw Sliske's words in your mind. I saw your own intent.",
    "If I had lashed out at you, chastised you, would that have convinced you of my worth? Or would you think me an egomaniac alike the younger gods? Would it stop you thinking of me as evil?",
    "There is precious little time for me to soothe your conscience and ease your concerns. This is the body you offered me, so this is the body I took. I did what I could to convince you in the time we had available, but I must return in whatever way I can. Too much is at stake for me to tarry here any longer.",
    "Do not take me for a fool.",
    "While we shared a mind, I could not lie to you... but nor could you to me. I saw Sliske's words in your mind. I saw your own intent.",
    "Even if the decision was an unconscious one, you had plenty of opportunity to correct it.",
    "Have the courage to stand by your convictions, or you will make for a poor World Guardian.",
    "I cannot force your mind, but even if I could, I would rather you aided me of your own volition.",
    "And time is a factor - to convince you to change your mind would have taken too long.",
    "Many gods have the power to influence the minds of lesser beings, but a mind forced lacks...versatility. It is a slave.",
    "Such a mind is limited, and I seek for my followers to move beyond their limits.",
    "I am...disappointed. You are too hampered by morality, but I have not given up on you fully.",
    "You did not know me. Perhaps you still don't. In time I hope you will.",
    "Indeed. Let us leave before she finds us.",
    "Lead on through the gate; I will follow. I wish to address my loyal followers upon my return.",
    "...",
    "We have the World Guardian to thank for that.",
    "I shall reward him/her in due course.",
    "I already do. Sliske.",
    "But first... Sliske.",
    "We have the World Guardian to thank for that.",
    "Azzanadra.",
    "Nex... Char... Stand down. I am returned. That is all that matters. And he/she is not fully to blame for this.",
    "Sliske.",
    "No more.",
    "No more.",
    "Sliske, stop.",
    "You betray yourself... though, in truth, I have never trusted you. And your words of betrayal to the World Guardian cannot be ignored.",
    "Whatever your intent, no longer can I turn a blind eye to your disobedience, nor condone your methods.",
    "...",
    "Excommunication. You will have no further association with us. You are on your own.",
    "Leave us. Never return.",
    "You are important. You must be kept safe.",
    "That is correct. I am disappointed...but you are only human. I still hope to persuade you of my worthiness, but even if I cannot, you will play your part.",
    "Char: keep an eye on Sliske. It gives me pause that he holds both the Siphon and the Catalyst. I do not want him thinking he can follow in Zamorak's footsteps. He is angry, and may attempt something rash. Inform me if he leads you to the location of either artefact. None of the young gods should have free access to such tools. Especially the Catalyst – the dragonkin cannot grow too strong before we are placed to deal with them.",
    "Nex: I task you with keeping Sliske's little game in check – watch the young gods. Try to contain their destruction as much as possible, but do not get drawn into open conflict. There may come a time that I need you to step in to ensure nothing interferes with my plans. And, as circumstances allow, continue harrying the other gods' forces without your prison of ice.",
    "And to Azzanadra, my most loyal servant. Together we must prepare to rouse the elder gods. Zamorak's desperation at the end of the last God Wars scarred this planet's anima mundi, but even that was not enough to wake them – only Guthix.",
    "Not greater; more targeted. I require you to seek out Gielinor's own Elder Halls. If disturbed, the elder gods will have no choice but to respond.",
    "But first I require your help to prolong this body. With every passing moment, more of my energy leaks from this wound. I cannot escape this body. If we do not succeed before I am fully rejected, then I will face the void.",
    "Finally, to you, World Guardian.",
    "This was my realisation when I last returned here. If we do nothing, then what sits within them shall bring about the destruction of this world... this universe. But save your questions for another time. Do you have anything to say for yourself?",
    "I am glad you came to this conclusion, but this is just the beginning. There is much work ahead of us. You will save us all.",
    "Then why didn't you? I am sorry you feel this way. But you will play your part.",
    "At least you see that now. Hindsight is a powerful thing.",
    "Perhaps, in future, you will think more kindly towards me.",
    "You will save us all.",
    "Standing by your convictions shows strength and character. Continue to stand against me, if you wish. But you will play your part.",
    "Regardless of your intentions or the outcome, it would be remiss of me not to reward you.",
    "I am reinvigorated, and I am back where I am needed. Our task has urgency, but I am confident in those who stand at my side. Together, we can change all our fates.",
    "I may be in a failing body, but at least I have been able to return. My task has greater urgency and I am vulnerable. If I fail then I shall die, but then so shall everyone else.",
    "You should have this.",
    "You will find many uses for it. Primarily, if you use this in my Sanctum on Freneskae, it will allow us to commune at any time. If you remain unconvinced by my philosophy, then my hope is that this will help to remedy that. When carried, it will mark you as my envoy. Those loyal to me will treat you with respect, and those opposed will be fearful of you.",
    "And though it may be dangerous, especially now Mah has reawakened, you may wish to revisit Freneskae. I am certain you will find more of value there. Now has come the time for us to part, World Guardian. Reflect on all you have witnessed this day. Gielinor's reckoning is coming, but there is still time for us to avert it. Until I call on you again, do as you otherwise would, had we not met. Pax tecum.",
    "You have questions.",
    "All beings are unique, but I understand your meaning. There is one other akin to I – the divine aspect of light energy.",
    "I shall not speak of it here, but I sense you have an inkling of whom I speak. What I will share is that all magic comes from elder gods, and that magic is fuelled by anima – that which philosophers fancifully call a soul. The elder gods wield their magic to create anima generators – what we call worlds. The young gods' power is magic stolen from the elder gods. It is limited, fleeting. My power derives directly from anima. I believe Guthix discovered this link, which allowed him to gain the power he did. And it was his knowledge of anima that enabled him to create his edicts... and to create you, World Guardian. With his death, the young gods' eyes have been opened to the divine. And their ignorance would see them tear this world's 'soul' asunder. This cannot be allowed to happen.",
    "Sometimes, simply being the largest target is enough to become vilified, but it is also because I sought unification. I wanted to bring all the young gods under one banner, but they would not recognise my divinity. I would have welcomed them all, but they were blinkered by their own narrow, dogmatic views, and so they rejected me. I did not start wars; I was just better at them... and through war I started to make progress.",
    "Zamorak Zamorak feared retribution from those remnants of my empire who remained loyal to me. Saradomin Saradomin sought my secrets. Whether to steal them or bury them, I cannot say. Zaros Ultimately, it is not important. The empire failed, and is no more. To build another would be folly. Mortals cannot be united by will or by force alone. Even if they could be, doing so would take more time than we have.",
    "The Great Revision.",
    "The death of this universe.",
    "Without her I would not exist, but she is like a child. As such, she was unable to teach me much of anything. What I have learned, I have discovered since I left. She is an elder god, the youngest of five. Yet the anima of this plane was not sufficient to nourish them all, and Mah was malformed. She was born without memory or knowledge, only instinct. After finally clawing her way to the surface, her first instinct was to pour what little energy she had into the creation of me and my companion. That would likely be an affront to the other elder gods. To her I was akin to a child's doll. She is mentally fractured, but I have intellect, and I could not abide her possessiveness. As soon as she started to weaken, I left.",
    "I would surmise that the confluence of events leading to my return enlivened her... and that your time in the Elder Halls regenerated this planet's anima enough to reinvigorate her – like a shot of adrenaline.",
    "I fear she may come in search of me, but she would first need to find another source of anima – Freneskae is spent. With any luck, she will fall back into a comatose state.",
    "Guthix He was like a myth, spoken of in hushed tones by those of his followers who had not allied with other gods. I would very much have liked to have met him. We shared some ideals. We both valued mortal life enough to step aside. Though where he would leave them to their own devices, and their own failures, I would guide them subtly towards their true destinies. I would not impose my beliefs on mortals as other gods do, nor force them into worship of me. My aim is to be the voice that drives them to greatness. Not all would heed the call, but not all have to.",
    "Guthix I note that you are a member of the Godless. None of you need fear me. Indeed, I could perhaps even help you to achieve your manifesto.",
    "Guthix Ultimately, perhaps, but there are many ways to achieve that goal. If you stop me today, you stop one god.",
    "Indeed, returned at full strength as I am, I have the ability to evict the young gods and build another barrier...though doing so would not be my first choice.",
    "Indeed, had you returned me at full strength, I would have had the ability to evict the young gods and build another barrier...though doing so would not have been my first choice.",
    "Revenge would serve no purpose, but even if it would I have no time to enact it. There are more pressing matters that require my attention.",
    "My focus lies first with the dragonkin, and then the elder gods.",
    "My focus lies first with forestalling my demise, and then the elder gods.",
    "Even though they have moved beyond their races limitations, to me, they are still only very powerful mortals. I sought to bring them under one banner – all races and ideals – so that together we might strive for loftier goals.",
    "I saw it as my divine right. The failure of my empire opened my eyes, however. Since then, I have had much time to consider my failures. I was acting no better than Mah, attempting to control mortals. I see my role now being to lead mortals – the young gods included – towards uplifting themselves. And to work with those powerful few who have stepped beyond the need for guidance. I see this in you. Guthix Guthix saw this in you too, at the end, but his inaction has cost us dearly.",
    "Yes. Gielinor hides a truth the likes of which even Guthix was not aware. If he had known, he would have done more than sleep. Freneskae holds the clues; you have seen this with your own eyes.",
    "I am. They exist only within 'perfect' worlds: Freneskae and Gielinor.",
    "A simpler term for them would be 'nests'.",
    "Thanks to you, I have obtained a new body and returned to Gielinor.",
    "I am returned to full strength, and shall resume the pursuit of my ultimate ambition.",
    "Though I am in a weakened state, I vow to not allow it to keep me from my ambitions.",
    "Yes. I am a being of divine creation – it is my birthright. But more than that, I cannot achieve my wider aims until I transcend.",
    "Not control, and not all. Not even the elder gods are all-knowing or all-seeing. I merely wish to encourage certain individuals to reach their full potential. Individuals such as yourself.",
    "I believe that the elder gods' time is done, that they have failed. A new world order is required. Conscious life was not the intention of the elder gods, but it is their creation nonetheless. Yet they are blind to it, and would consign it all to the Abyss without a second thought. If I were an elder god, they would have to listen to me, and I could show them their error. As to why I would do this... Mortal life fascinates me. It has such potential for growth; it is both fragile and resilient; and it reacts quickly to change. The current elder gods are stagnant and slow, and too fragile – Mah is proof enough of this.",
    "Indeed. Place the shard of Zaros in the memoriam reader again whenever you wish to speak with me.",
    "She is my creator; I both love and loathe her. A being of such immense primordial power that she can create life with but a thought, yet she herself is a stunted child. How could such a being come to be? It frustrates me that Mah has such gifts and yet wastes them creating what one might consider amusements. Such wasted potential... but then, she did also create me.",
    "Though I am unique, there was one other created at the same time as I. The light to my darkness. I find it beautiful, and the attraction is mutual. Whereas I am analytical, my companion is empathetic. We are opposites, but we are also the same. I know not our creator's purpose, but it is good to not be alone.",
    "I am flawed, as is my companion. When in close proximity, each of us triggers intense feelings within the other. My companion is filled with devotion towards me, and I adoration towards it. We both are intoxicated by this. It saps my concentration, it saps my companion's will. Neither of us can halt the effect. We are slaves to each other. This... This is control. Our creator has done this to us both, but if it was her intent that this binding would coerce us to stay, she has failed. I shall be her plaything no longer. I will find a way to leave.",
    "Our creator slumbers for longer each day. This world can scarcely nourish her, its anima low and diminishing. I sense other worlds nearby. She has not the strength to reach them, but I have. I wish to explore and discover. I hunger to learn. My creator has no knowledge to pass on, no memory from before her birth. My companion intends to remain behind to tend and comfort our creator, believing that we are indebted to her for our existence. I feel no such debt. I shall leave and forge my own path.",
    "I have walked upon a hundred proto-worlds, half built and failing - the early works of Mah's elder sisters. But here, for the first time, I have stepped onto a plane that, although raw and imperfect, teems with conscious life. They have order and architecture, society, and bureucracy. It is a machine with so many moving parts, and yet - against all odds - it works. From the Chthonian dukes to the Avernic slaves, each individual a cog in the machine. Even the ousted Infernals have a part to play. They also have something called language - an alien concept, but one I find most fascinating. They name themselves demons. I shall make myself known to them - their first encounter with divinity. And then I shall use their love of language to bind them to me. I shall give this great machine a purpose.",
    "I continue my exploration of the lower planes of the universe, this time of a world named Vampyrium. The dominant species is predatory and instinctual, though not lacking in awareness. They roam the surface and skies in small packs competing for prey. It is wasteful, both of these predators their prey. They can be put to better use. I intend to experiment with them - to teach them of society, of culture. Unified, they could perhaps cease their infighting and become greater than the beasts they are.",
    "Upon reaching the edge of the lower planes, four paths opened to me - each path laid by one of Mah's sisters. It appears that, lacking my creator's knowledge, each of her sisters has separated to build their own worlds - perhaps in an effort to learn what they have lost in the absence of Mah? These I call the elemental planes, and they overflow with diversity. It is upon these elemental worlds that I have first encountered creatures who refer to themselves as gods. They have some semblance of divinity, but, unlike me, they are not of truly divine origin. I am intrigued as to how such limited beings have overcome their inherent weaknesses, for they appear to have derived from among the mortal races. Indeed, many races from these planes follow the dogma of these self-proclaimed gods, and I unable to sway them to my cause. As such, I have spurred on to the higher realms, where the elder god's paths reconvene into worlds with more balance.",
    "I have explored from one end of the universe to the other, and at its furthest point discovered a perfect world - the final work of the elders. Many of the races I encountered on my journey have flocked to this perfect world, led here by their deities... but this world does not belong to them. They carve out territories and scar the land with their petty skirmishes. They must be taught obedience. As a child of the creators, I feel it is my duty to bring these young gods to heel. My ability to enforce loyalty does not compel ascendant beings, only the lower mortals and my old companion. I will have to resort to baser methods. To this end, I have brought my own lower races to this world. If the young gods will not heed my words or recognise my divinity, then they will be made to listen.",
    "My empire's progress has stalled, I expected little resistance from the forests to the south, yet from them sprang forth a race even my demonic legions fear. The legates refer to them as Stern Judges, but I have learned their true name - Mahjarrat: 'the children of Mah'. Could they really be so? After my departure, could she have created more toys? They are but a fraction of myself and my old companion, yet I feel a connection with them, a shared ancestry - they are my younger siblings. Surely this is serendipity... or fate, should such a thing exist. I intend to take them under my wing. Within the empire they will rule as princes, and they shall be its inheritors. Until such a time, they shall be my envoys.",
    "I have known she was here since I first arrived - my companion of old - but I can avoid her no longer. I need her help. I feared the effect we would have on each other, but it was far weaker than I remember, perhaps due to our time apart. Her time with Guthix has turned her head, and refuses to interfere with this world. It is all up to me. As such, I have seized control of a device from her that allows for near instantaneous travel throughout the universe, even between Gielinor and Freneskae, its two furthest points. I shall use this 'World Gate' to more quickly and easily explore creation, and to further my knowledge of magic and science. Perhaps there are mortal races left who might yet join my cause, on worlds I have previously overlooked. The Mahjarrat have taken over from the dwindling Chthonian dukes and my empire is now self-sustaining. My presence is rarely required and I now work behind the scenes. The mortals under my rule accept my philosophies and spread them of their own accord.",
    "The lower planes once more bear fruit. One race, the Ilujanka, has joined my empire on proviso that I solve their infertility. This seems like a problem worth solving. I am only capable of reshaping existing forms of life: to solve an issue of creation will require something more. To this end, I have returned to the place of my birth. With Freneskae's failing anima, Mah has slipped into a coma. She manifests nightmare creatures from which I am able to harvest her elder energy. I have pushed the limits of my own abilities, reforming the essence of other races into new beings... but to give them life required Mah's energy. As such, they are a failure, only proving of what I am incapable. Strictly, they should be named zarytes, but I have dubbed them 'nihil', for they are nothing to me. Much like the Mahjarrat, they have the ability to absorb the essence of their brethren. One of these nihi - originally shunned - has fast outgrown the rest. I have chosen to uplift her. To do so, I had to implant a small sliver of my being. The irony of this is not lost on me. I am not proud of this, but to leave her as she was would have seen the other nihil destroy her. With her newfound sentience, she has named herself Nex in the old Infernal tongue. Her speed and capability for learning are astounding. Although Nex will prove useful in bringing unity to the world, this entire experiment has only gone to prove my unworthiness. I myself must take a new path and find a way to transcend to elder godhood, for only then will I be able to aid the Ilujanka, to create life from nothing.",
    "Upon my return to Gielinor, I searched for Mah's elder sisters, hoping to convince them to aid in my transcendence. Instead I discovered a horrifying truth about this world. I know now what its true purpose is. It is not for mortals. It is not for me. And only the powerful have a hope of surviving. My path is clear. Though I cannot create life, I can forge it into stronger forms. Perhaps one such form will be our deliverance. My empire has taught me that pushing mortals meets with resistance, so I must learn to pull them instead: to lead them from the shadows. I must become the guiding voice within their heads - their drive, their urgency, their passion and their betterment. I shall become the mortals' will to power. There is little time, and this will take all my efforts. I shall return one last time to inform the cardinals - Azzanadra and Zamorak shall inherit all."
  ],
  "Char": [
    "As you command. I am heartened to see you returned.",
    "What is there to say? He is back where he belongs. My flame grows brighter once again.",
    "I am Char. No more, no less.",
    "You tried to stop him and failed - he has returned in spite of your efforts.",
    "You played a dangerous game denying him. You should not need me to tell you that you are playing with fire."
  ],
  "Nex": [
    "At once, my lord."
  ],
  "Eblis": [
    "Greetings. I await the return of my Lord Azzanadra and of our god. I do not know why, but I feel this spot has some significance...",
    "What? What is it?",
    "Really? Where? You'd better not be joking!",
    "Are you sure? What did he look like? Is he coming here?",
    "Of course. I... I shall not tell a soul. You're definitely sure? Yes, of course you are.",
    "Surely it is only a matter of time now before Lord Azzanadra returns to us with new instruction.",
    "What? What is it?",
    "Perhaps some remnant of the Zaros-Kharid war?"
  ],
  "Guthixian High Druid": [
    "Word has come back to me that you have rediscovered the World Gate! I've taken the liberty of adding it as a teleport option on your Sixth Age circuit!"
  ],
  "Ali the Wise": [
    "Good. Always good.",
    "What? Could it really be true, after all this time?",
    "Hmm, thanks to your new status as World Guardian, no doubt... This is very good news indeed. I thank you for the bringing of it. And the bad news?",
    "That's hardly news, let alone bad news! How was Zaros?",
    "Well, at least he is returned.",
    "I do wonder why it is that I am finding this out from you, however.",
    "He did not... I must contact him about this. I'm sure he had his reasons. I give you knowledge, in exchange for the knowledge you gave me..."
  ],
  "Zamorak": [
    "Zamorak He was once my most trusted general. I never had cause to doubt his loyalty... right up until the point that he betrayed me. I do not know what led him to it. In some ways he epitomises what I advocate. He has a strong will and has overcome his limitations... but he did so at my own expense."
  ],
  "Seren": [
    "I would do anything for my companion to prove my devotion, as he would to show his adoration. When we are apart, however, I am more coherent: can think and feel more clearly. He thinks this is some form of control forced upon us by Mah, so that we will always strive to remain close to each other and to her. I urge him to stay with us, but he intends to leave. He does not see - or does not care - that Mah acted not out of malice; only fear of being alone. Without her we would not exist. I owe it to her to stay, to sooth my creator. I cannot leave her alone... she needs me.",
    "Whenever lucid, Mah cries out for Zaros. I do what I can to comfort her, but that is not much. What Zaros saw as her controlling us, I see as her protecting us... and now it is my turn to protect her. She sleeps more than anything these days, and her dreams manifest - they are pale imitations of Zaros and myself, their bodies not even formed entirely of crystal. They are a waste of what little energy she clings to. Perhaps I can find some way to return their power back to her, if only to keep her lucid. Some make pilgrimages up the volcano to Mah, calling themselves her children. I pose as her to warn them off. I intend to visit them in this guise. If they are so in awe of her, then they might sacrifice their own energy to restore her.",
    "Her dreams have become violent nightmares. The beings she manifests are now grotesque and purely instinctual. At least these muspah keep the tribes at bay. Mah is comatose now, and there is nothing more I can do for her. This planet's anima is all but depleted, and the rituals only manage to quell her nightmares for a time. Even when she does lapse back into semi-consciousness all she does is wail and scream and hurt herself. For such times, I taught the tribes how to drain some of her energy and use it create more of their kind. It broke my heart to do this, but without some equilibrium, Mah will likely rip this planet apart. For all the power she instilled in me, I am powerless to help. Once she is stable, I plan to leave.",
    "Until now my search has been fruitless and mournful, but I have finally discovered a world with life - a beautiful race of creatures filled with joy, who live in harmony with their verdant world. There is a strong sign here of a creator's hand - perhaps the indigenous life knows something of that creator's whereabouts. I shaped myself in their image and revealed myself to them, fearful of what effect I might have on them, but hopeful that they could point the way. They loved me from the first, but I did not cause it - they chose to do so! It was not a result of the control Mah instilled in me, at least, I do not believe that to be the case. It feels even more intoxicating, but I remain cogent. I can only surmise that what Mah created artificially has been manifested naturally with these beings. I see now that what Mah did to us was wrong, but this feels so right! Could it be as simple as the right to choose? Never shall I leave their side.",
    "Perhaps out there I can find Mah's sisters. Maybe they can do something for her, if only to ease her passing."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Fate_of_the_Gods?oldid=36221479’"
  ]
}