{
  "Death": [
    "Ah, you wish to learn more about Rasial, I presume.",
    "Hmm. Very well, but we should start small. Let me tell you more of vessels, and the fate that befell a somewhat recent apprentice of Rasial.",
    "A vessel is just a name we give to a place in which many souls reside. I created the Well of Souls, a sanctuary for those who die and know not what comes next for them.",
    "Many necromancers end up creating their own vessels, a place in which they can consolidate their power and grow it over time. More souls, more power.",
    "It is not wholly dissimilar from godhood, though with souls other than one's own, and against their will.",
    "In fact, you have previously dealt with at least one such a necromancer and their vessel in your past.",
    "I believe his name is Necrovarus, and his vessel being the Ectofuntus of Port Phasmatys.",
    "Necrovarus was a one-time apprentice of Rasial's. Who better to teach you of what Rasial has in store for you than a former pupil wronged by him?",
    "How goes your investigation into Necrovarus and his vessel?",
    "He had to put the souls of Um that he stole somewhere. I suspect his own vessel is housed within his citadel.",
    "Whenever you make your way there, keep an eye out for what it could be. They can be made to look like anything.",
    "Hmm, he speaks true, but your attempts are not futile. You would not catch up with him in terms of raw available energy even across many lifetimes.",
    "He has clearly been working on this plan for centuries. However, we will find a way. Perhaps there is something more in your approach to necromancy.",
    "Still, I believe we have learned all we are likely to from Necrovarus. Continue your training and return to me after you have visited Rasial's citadel.",
    "You need to free up two spaces in your backpack."
  ],
  "Player": [
    "Maybe soon. I have something else to take care of first.",
    "So, I have a little bit of experience as a necromancer. Will you tell me some more about Rasial now?",
    "Vessels? The Well of Souls isn't the only one?",
    "I have? Who?",
    "Necrovarus? What would this teach of Rasial?",
    "Ah, of course. Thank you. In that case, I will head to Port Phasmatys and see what I can learn from Necrovarus.",
    "Necromancers do a lot more running around than I'd have expected...but I'm making progress.",
    "Necrovarus. I-",
    "I'm not here to berate you. I actually need your help.",
    "I wouldn't be here if it wasn't necessary. Death sent me.",
    "The necromancer Rasial is causing havoc in the Underworld.",
    "He's already drained the City of Um of its souls, and wants to take over Gielinor with an army of undead.",
    "I have been chosen as his apprentice, as I have been told you once were.",
    "Not yet, at least.",
    "Of course you do.",
    "You're welcome.",
    "This isn't quite the evil deed I was expecting from you. Helping to cleanse souls now, are we?",
    "Whatever you say.",
    "What evil deed do I need to do again?",
    "I need another soul urn.",
    "That should be all the tortured souls I need. Now they just need cleansing with some ectoplasm at the Ectofuntus.",
    "I have cleansed the tortured souls for you.",
    "Now, you said you'd help me with the Rasial situation?",
    "Trap?",
    "But something went wrong.",
    "Well, weren't you also a human?",
    "...",
    "Is there anything you suggest I do to try and stop Rasial?",
    "How can I perform this ritual?",
    "That sounds about right - I was the one who gave it to her.",
    "That shouldn't take me too long. If I recall, she lives just east of the Slayer tower.",
    "What should I be doing again?",
    "Hmm... What's this?",
    "Unpaid bills... An advert for a new flavour of nettle tea... An apology note from Dr Fenkenstrain about some building work he's having done...",
    "...A subscription to Witches Weekly... And a letter signed by 'V'?",
    "V... for Velorina? Maybe she knows where Netty is. I can probably still find her in Port Phasmatys.",
    "My expertise in Thieving would be of no use here, I guess.",
    "This looks like it hasn't been slept in for quite a while.",
    "Apologies.",
    "Hi Velorina. I don't suppose you've seen Netty around recently?",
    "Hear what?",
    "Oh, I'm sorry for your loss. What happened?",
    "At least she died doing what she loved.",
    "Well, I appreciate the information on where I can find Netty now. Thank you, Velorina.",
    "Where is Netty again?",
    "Thanks.",
    "Hi Ted, have you seen anyone pass through here called Netty?",
    "I'll head over there. Thanks, Ted.",
    "Netty?",
    "Indeed, I'm not dead yet!",
    "Oh. That's curious.",
    "I... suppose I don't?",
    "I'm currently learning necromancy to take down Rasial.",
    "That's the one.",
    "It sounds like you're having a wonderful time down here.",
    "...",
    "Right... tea... sorry. I actually came here hoping to get something from you to use against Rasial.",
    "You recall the book of Haricanto I gave to you? Necrovarus needs it back so he can teach me a ritual.",
    "I will ensure Necrovarus will use it wisely.",
    "I don't imagine I can just turn up to a bank and ask for your belongings.",
    "Anything else?",
    "The what?",
    "I'll be off then! Enjoy your tea.",
    "I lost your documents.",
    "Hello Netty. Where can I find the book of Haricanto again?",
    "Thank you!",
    "I'm here to claim a key belonging to a previous resident of Morytania, Netty.",
    "I have her will and death certificate right here with me.",
    "Er... At least I did?",
    "Thank you!",
    "I er... lost Netty's key.",
    "I'll make sure to look after this one.",
    "Are you okay?",
    "Your whole... life? When you were a human, you wanted to be a bodyguard for a chest?",
    "Well, your dream came true. Is it not living up to what you thought it would be?",
    "I'm sure you have some redeeming qualities that help!",
    "Any old skeleton, you say?",
    "Hmm...",
    "I don't have any space in my backpack to take the book.",
    "Phew...",
    "I... long story. All that matters is that I have the book of Haricanto here with me.",
    "I'm flattered.",
    "See you there.",
    "What are we doing again?",
    "Why don't you move to the City of Um to use it then?",
    "This should help to fight Rasial.",
    "Are you afraid I might learn something I shouldn't?",
    "My vessel grows stronger, and I with it.",
    "So, Rasial has his own vessel... Not surprising, but good to confirm it. I should return to Death and share what I've learned.",
    "So, I found out that Rasial used Necrovarus to learn how to build a more powerful vessel, one he is using now.",
    "He suggested my connection with the Well of Souls could never match his. Is this all futile?",
    "Perhaps."
  ],
  "You do not meet the requirements to start": [
    "'Vessel of the Harbinger'.",
    "'Vessel of the Harbinger'."
  ],
  "Necrovarus": [
    "No doubt you are here once again to whine about how evil I am. Be gone with you!",
    "My help?",
    "You take over my town, ripping power away from me, yet now you wish for my help?",
    "Don't be foolish, you imbecilic mortal!",
    "Harold himself? My time is precious, but you may be granted a minute to explain.",
    "Rasial... He never gives up, does he?",
    "So, you are in dire need of my help.",
    "I want something in return first.",
    "As much as I hate to admit it, the Ectofuntus has been much stronger since Port Phasmatys's souls have been given freedom.",
    "Quiet, mortal.",
    "However, this does mean that these miserable tortured souls outside of the town are preventing the Ectofuntus from reaching its full potential.",
    "You must gather their souls for me in this urn. To do so, you must defeat them with necromancy. Five souls will be sufficient.",
    "You fool. Come back when you have a free space in your backpack.",
    "Once you have their souls, they must be cleansed by praying at the Ectofuntus with a bucket of ectoplasm.",
    "I'm still evil and powerful! That is not something I have to prove to you.",
    "Now off with you. Go and perform that evil gathering and cleansing of souls for me.",
    "You think I have all day to stand around re-explaining things to you? I have better things to do with my time.",
    "Fill my soul urn with the 5 tortured souls. Once that is done, cleanse them at the Ectofuntus with a bucket of ectoplasm.",
    "Do not disturb me again until it is done!",
    "You fool. Come back when you have a free space in your backpack.",
    "Perfect. More power for me!",
    "Yes, you have done as I have asked.",
    "I shall first tell you more about him... This may help prevent you from falling into the same trap that I did.",
    "A trap indeed. A temporary downfall of my otherwise great power!",
    "Now that you're his apprentice, as yes, I once was, you must be careful. Rasial is intelligent and ambitious, with cunning schemes to achieve his plans.",
    "My history with Rasial began back before the transformation of Port Phasmatys. I was a young and impressively evil necromancer, with a specialisation in vessels.",
    "Rasial came to me in the eastern lands, and spoke tales of ectoplasm under Port Phasmatys.",
    "Although I was wary, he was powerful and intelligent, so I followed his word. Of course, his word turned out to be true.",
    "The next part of the story you already know. The Ectofuntus, my own vessel, was built to contain the spirits and ectoplasm of Port Phasmatys and provide me with power.",
    "Rasial observed as my power grew - as the vessel slowly usurped the souls of the town. Things were going so well!",
    "Something went very wrong... Unaccounted for in my studies. As well as the mere human souls, the vessel also began to suck away at my lifeforce.",
    "Yes, but I am its master! I should have retained pure control of it, not the other way around!",
    "...",
    "Rasial did nothing. He quietly learned, and left me in this viridescent form.",
    "And so I have a special hatred in my heart for that necromancer. If you're not careful, you may end up with the same fate.",
    "I can help you perform a ritual to empower your vessel, the Well of Souls. Whilst the ritual itself may not stop him wholly, it may give you more power to take him down.",
    "Now that... I cannot remember. It has been many years since I last performed it.",
    "The book of Haricanto will contain the information we require. I have heard whisperings that it was last in the hands of one of my disgraced disciples, Netty.",
    "I will ignore your subversion for now. Get the book from Netty, and return to me once you have it.",
    "Bother me not with the details. Goodbye.",
    "You need to return me the book of Haricanto. Last I was aware, my old disciple Netty had it, east of the Slayer Tower.",
    "Where have you been, mortal?",
    "I wouldn't have expected you to be so witless as to return without it.",
    "Do not grow accustomed to it. We are merely working together due to a shared enemy.",
    "Now, you will need to gather some special ectoplasm from the Ectofuntus itself, in a bucket, to focus the ritual on.",
    "Once that is done, let us meet by the ritual site in the City of Um, where you can perform the empower vessel ritual.",
    "How many times must I iterate such simple instructions!",
    "Gather some ectoplasm from the Ectofuntus with a bucket. Then, meet me at the City of Um ritual site where you can perform the empower vessel ritual.",
    "A ritual site of this splendour would be perfect for an evil necromancer like myself. It is wasted on the likes of you.",
    "Alas, I much enjoy the power from my Ectofuntus. My disciples would surely also miss me too much.",
    "Now, on with the empower vessel ritual! We have no time to lose.",
    "Congratulations. Your vessel has grown in power.",
    "Rasial! You will pay for what you did to me!",
    "Curse you!"
  ],
  "This soul urn has the following souls stored": [
    "[number] / 5 tortured souls"
  ],
  "Velorina": [
    "Ah... You didn't hear?",
    "Unfortunately my dear friend passed to the Underworld a little while ago.",
    "Netty being Netty was out gathering some nettles for her tea. I'd warned her that the bog was extra slippery due to the weather recently, but she tutted me off.",
    "Alas, the poor girl slipped and hit her head just a touch too hard.",
    "I just wish I had a chance to say goodbye. As she's not in the vicinity of Port Phasmatys, she had no choice but to pass over.",
    "I suppose at least I can look forward to meeting her once again, when I finally choose to pass.",
    "Goodbye, Player.",
    "She passed over to the Underworld a little while ago."
  ],
  "Ted": [
    "Netty? I sure have! Her soul returned through the Well not that long ago. You can probably find her in The Last Call.",
    "Anytime!"
  ],
  "Netty": [
    "Ah, Player! A familiar face in the Underworld, yet you still take a mortal form!",
    "Hmm, you seem to have come prepared with ghostspeak enchantment. However, I don't feel that it has any effect here.",
    "Curious, yet you don't need any form of ghostspeak enchantment to talk to me?",
    "Interesting... Perhaps the underworldly energies take care of that for you. What brings you here, anyway?",
    "Rasial, that necromancer who drained Um of life?",
    "Talk about a rude welcome to the city! I was barely fresh off the boat before that Rasial siphoned everyone else away.",
    "I figured it would be best to get out of there before it was too late. After it looked to be safe, I returned, and found this lovely little pub. They even serve tea!",
    "I am indeed! They have plain nettle tea, milky nettle tea, earthy nettle tea, stinging nettle tea...",
    "Root nettle tea, herbal nettle tea, mushroom nettle tea, mint nettle tea, fermented nettle tea...",
    "Player?",
    "And what would that be, dear?",
    "Hmph, Necrovarus?",
    "Normally I would refuse any help towards him. He had no right to tyrannise my friends in Port Phasmatys.",
    "However, as I've seen, the Underworld does seem to be in a nasty situation. I entrust you will not misuse the book - it details some extremely powerful rituals, and should not dare fall into the wrong hands.",
    "Alright. I made sure to keep the book safely locked away in a chest in my house.",
    "You'll need the key to open the chest, though. I stored it at the bank of Port Phasmatys.",
    "I should hope not! Here, I'll write up a little will stating you as the rightful owner of the key.",
    "They'll probably want my death certificate too.",
    "Hmm... Suspiciously, you somehow you[sic] already have them.",
    "Oh dear. You'll have to come back to me when you have a free space in your backpack.",
    "Hmm... Well there's the skeleton, but you'll be fine...",
    "The chest's guard skeleton, of course. You'll need to deal with them before you can unlock my chest, but I'm sure you can figure something out.",
    "Good luck!",
    "*sips nettle tea*",
    "Those are important. I will give you another copy, but please be more careful this time.",
    "Oh dear. You'll have to come back to me when you have a free space in your backpack.",
    "You'll need to take my will and death certificate that I gave you to the bank in Port Phasmatys.",
    "Once you have the key from the bank, you can unlock the chest in my house to get the book.",
    "*sips nettle tea*"
  ],
  "Ghost banker": [
    "We ensure the utmost security here at the Bank of Gielinor. You understand that we can't just give out personal belongings to anyone.",
    "We don't fall for those scams here. Come back another time.",
    "Let me just verify this...",
    "A Port Phasmatys stamp of approval... A matching signature to our records...",
    "I can confirm the legitimacy of these documents. Here is Netty's key for you, as per her will.",
    "You also seem to have no spare room in your backpack. Come back when you do.",
    "You're in luck, as she just so happened to keep a surplus of them in our care. Here's another one."
  ],
  "Netty's skeleton": [
    "*sigh*",
    "For my whole life, I thought I wanted to be a locked chest bodyguard.",
    "Okay then, for my whole death I wanted to be a locked chest bodyguard. In my life, I wanted to be a hot air balloon conductor.",
    "Not really... I don't feel like I'm cut out for this job.",
    "Netty took a chance on me, and hired me despite my lack of warrior training. I just don't know what she saw in me...",
    "Nope. My bone definition is so poor that any old skeleton could best me...",
    "Yep. Probably even a chinchompa skeleton...",
    "AAAH! That skeleton is built like a true warrior! I am no match!",
    "AAAH! That skeleton is built like a true warrior! I am no match!"
  ],
  "Rasial, the First Necromancer": [
    "You would think, but your efforts are pitiful.",
    "My own vessel is filled with generations of souls from this city.",
    "Ah, Necrovarus, my old student. I see you have learned nothing of value since last I left you.",
    "Your dismal vessel was a mere trial run for my true plan. Its potential is insignificant compared to the vessel your failure helped me to create.",
    "But if you interfere with my tutelage of Player again, I shall strip away what miniscule power you have accrued, purely out of spite.",
    "Now, begone. I have no more use for you. Trouble the Underworld with your presence no more.",
    "Now, where were we!",
    "' From Necrovarus? Hahaha! He's little more than a farmer of souls, and with a tiny, withering crop at that.",
    "If failure is what you wish to learn, perhaps he can teach you of that.",
    "Yes, you are making progress, but not nearly quickly enough.",
    "By all means, continue to power your vessel, but you cannot hope to match my power this way alone."
  ],
  "Congratulations! You have completed": [
    "'Vessel of the Harbinger' - Complete this quest."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Vessel_of_the_Harbinger?oldid=36224724’"
  ]
}