{
  "Bryll Thoksdottir": [
    "Hello there, Player. Do you want to trade?",
    "Player I was hoping I would bump into you. I have a bit of a problem and let's face it, when there's a problem you're the person to seek out. I'm not going to sugar coat it. It's the end of the world. Or at least it will be if we don't stop it. You've probably felt it. The chill in the air. The shadows seeming to choke the light more than usual. I have a network of informants around the place looking out for strange portents and omens, you know, signs that something bad is going down. Well one of them has found something. Something big. Something apocalyptically big. Can you help me get to the bottom of this?",
    "Well, maybe when you've got some time spare. I mean it's only the end of the world, I'm sure it will wait...",
    "Great. It's big, this. Even the Fremennik can't ignore the omens. The world itself is trembling in fear, you can feel it if you're really still. Bad stuff. But I'm no expert, you need my informant for that. Unfortunately... My informant is a mysterious resident of the Arc. I have only ever spoken to them via letter and carrier seagull, never directly. They call themselves the 'Jade Spider' and...Well this is the strange part...They've asked for you by name. They're in hiding at the moment, apparently they've picked up some enemies along the way. All we know is that they're on the Arc somewhere currently. You'll have to hunt down clues as to where they might be. Start on Waiko, that's your best bet. Everyone goes through Waiko at some point, so someone may have heard something.",
    "Hello there, Player. Do you want to trade?",
    "It's big, this. Even the Fremennik can't ignore the omens. The world itself is trembling in fear, you can feel it if you're really still. Bad stuff. But I'm no expert, you need my informant for that. Unfortunately... My informant is a mysterious resident of the Arc. I have only ever spoken to them via letter and carrier seagull, never directly. They call themselves the 'Jade Spider' and...Well this is the strange part...They've asked for you by name. They're in hiding at the moment, apparently they've picked up some enemies along the way. All we know is that they're on the Arc somewhere currently. You'll have to hunt down clues as to where they might be. Start on Waiko, that's your best bet. Everyone goes through Waiko at some point, so someone may have heard something.",
    "Hello there, Player. Do you want to trade?",
    "Keep following the clues, they'll lead you to where the Jade Spider is hiding. I'm afraid you know as much as I do.",
    "Hello there, Player. Do you want to trade?",
    "So the Jade Spider is Madame Shih, the mysterious pirate of the Eastern Lands? That's awesome! I'm working with a pirate queen! You should probably talk to her about what to do next though. She's probably waiting for you on Goshima.",
    "Hello there, Player. Do you want to trade?",
    "I knew that place was weird. You should speak to Madame Shih to see what needs to happen next.",
    "Hello there, Player. Do you want to trade?",
    "Sorry, I don't speak dragonkin. There's that lovely old dragon down in the museum in Varrock, maybe he can help?",
    "Hello there, Player. Do you want to trade?",
    "I had heard this place was built on top of ancient dragonkin structures, but I've not seen any way inside myself. There's a fountain that's been in the ruins since forever, looks older than some of the other stuff. Might be a good place to start?",
    "Hello there, Player. Do you want to trade?",
    "I think you should talk to your scaley little dragonrider friend, Hannibus, he knows more than me at this point.",
    "Hello there, Player. Do you want to trade?",
    "An abandoned laboratory in the middle of the wilderness...that sounds safe. So very very safe.. Well, we need everything we can find if we're going to stop this Ambassador. You're going to have to investigate that laboratory. It's going to be dangerous. There's going to be dragons. Monstrous beasts. Probably fire and lava...",
    "Ha! It would be glorious. But no, this is one for the World Guardian I fear.",
    "What is that stuff? It seems to be the source of all this strangeness. Come on. We should go and catch up with Madame Shih, she's the mystic pirate type, maybe she knows more. There has to be a connection between these dungeons. The presence of that black stone is too much of a coincidence.",
    "Good luck. Try not to die.",
    "Hello there, Player. Do you want to trade?",
    "They made a dragon out of that stuff? Are they completely mad? There's no time, you need to go and tell Madame Shih about this. That black stone stuff is definitely bad news and she said there's more going on.",
    "Hello there, Player. Do you want to trade?",
    "Each person here is committed to helping us take down the Ambassador. I heard about what the Ambassador did to Shih's crew...we...we have to stop him. NOW! But he's not alone. He has entire legions of crassians and undead things defending his base. He'll destroy us before we even reach him. I've gathered everyone around and set up a war council. We're going to bring the fight to him!",
    "Each person here is committed to helping us take down the Ambassador. First our intel tells us the Ambassador's ritual site is under the ocean, so you're going to need to find a way to breathe underwater. There's a hydromancer, Myrtle, who should be able to help you out.",
    "Each person here is committed to helping us take down the Ambassador. First our intel tells us the Ambassador's ritual site is under the ocean, so you're going to need to find a way to breathe underwater. There's a hydromancer, Myrtle, who should be able to help you out. She should be hanging out outside of the Wizard's Tower near Draynor village.",
    "Hello there, Player. Do you want to trade?",
    "You should speak to Hannibus, he has some tasks which he needs help with.",
    "Excellent stuff. Next on our list, we're going to need to find some way of clearing out the Ambassador's artillery. Currently his cannons can take out our boats long before we reach him. We're going to need to get rid of them. Fortunately, our scaly friend Hannibus here has a plan.",
    "Hello there, Player. Do you want to trade?",
    "You should speak to Quartermaster Gully, he has some issues to resolve with Steven.",
    "So there are two of them? Yay? Well those cannons are doomed. But before we move on, your quartermaster has a bit of a personal request. You should have a bit of a chat with him.",
    "You should chat with Gully.",
    "Hello there, Player. Do you want to trade?",
    "You should speak to Bosun Higgs, she has some unfinished business she wants to finish before leaving for the reef.",
    "Excellent work mending a seagull marriage there. Right, there's one last thing left to do. Talk to the bosun, she has all the details.",
    "Speak to the bosun, she's got this stage worked out.",
    "Hello there, Player. Do you want to trade?",
    "Everyone is ready to take the fight to the Ambassador, we leave on your command Captain.",
    "Okay, that should be it. We've got an army, a couple of dragons, can breathe underwater and a seagull's marriage has been repaired. There's only one thing left boss...your speech.",
    "We're about to head to our possible deaths, you've got to have a motivational speech for everyone!",
    "... ...[sic] Right the ruddy World Guardian has already stopped the ritual and neglected to tell us until now. Everyone go away.",
    "Take the boat to the Shadow Reef, we've got your back.",
    "Take the boat to the Shadow Reef, we've got your back.",
    "You've done it! The Ambassador is dead!",
    "You're amazing, anyone ever tell you that?",
    "Well then. We've saved the world, but the world is always going to need saving. You did good Player, you did good. Have a drink on me.",
    "Hello there, Player. Do you want to trade?",
    "Glad we took down that Ambassador and his sinister ritual. I don't particularly want to live in a horrific ocean-nightmarescape for the rest of my life."
  ],
  "Sharkborne": [
    "Hey, new fish! Welcome to Waiko! Have a copy of our tourist brochure!",
    "It reminds me of something I used to hear when sailing around the islands. Legends of some sort of seafaring witch or something. Sorry I don't really remember.",
    "No, sorry I haven't heard anything.",
    "Now that you mention it. I did hear someone mention a spider. It was in the town square, by the fountain.",
    "I overheard someone talking about some sort of arachnid. On the southern part of the town square.",
    "Now that you mention it. I think Zhuka might know something on that. You should speak to her.",
    "Farewell."
  ],
  "Player": [
    "I've got one thanks.",
    "What?",
    "And the north wind hides in fear.",
    "Well met fellow Ravensworn. Can you tell me where the Jade Spider is?",
    "I'm starting to feel this title is largely superfluous.",
    "Torts R Us? Tell me you're not hunting poor defenceless tortles? I mean, it's not like they can run away - hardly sporting, Reggie.",
    "I don't know, that still sounds dodgy.",
    "Amassing? You make it sound like they're about to invade or something.",
    "What?",
    "And the north wind hides in fear.",
    "Well met fellow Ravensworn. Can you tell me where the Jade Spider is?",
    "I'm starting to feel this title is largely superfluous.",
    "What?",
    "And the north wind hides in fear.",
    "Well met fellow Ravensworn. Can you tell me where the Jade Spider is?",
    "I'm starting to feel this title is largely superfluous.",
    "What?",
    "And the north wind hides in fear.",
    "Well met fellow Ravensworn. Can you tell me where the Jade Spider is?",
    "I'm starting to feel this title is largely superfluous.",
    "Who will hear me?",
    "CURSE YOU CRUEL FATE!",
    "What is this? There's a tiny tunnel down here and tracks that look like tortle feet leading away. There are scraps of paper. Has a tortle really eaten the note?",
    "Gotcha. There it is, the clue I needed right in the tortle's mouth. If you'll just hand it over...",
    "The oyster is open.",
    "The oyster is open.",
    "The oyster is open.",
    "The oyster is open.",
    "The oyster is open.",
    "Crassians? Here? They must be looking for the Jade Spider. I'm going to have to fight my way through them if I'm going to learn anything about the Jade Spider.",
    "You're the Jade Spider?",
    "Oh, that temple? I've already done that. They were using the black stone to corrupt one of the anima guardians Seiryu. They mentioned that there might be another person suffering as they were.",
    "Oh, that temple? I've already done that. They were using the black stone to corrupt one of the anima guardians Seiryu. They mentioned that there might be another person suffering as they were.",
    "I defeated the Temple of Aminishi. The cultists had imprisoned the anima guardian Seiryu and were corrupting it using shards of black stone. I freed it. But it mentioned that there were others suffering as it was.",
    "Where can I find it?",
    "There's something odd about this statue. It has two oval indentations where the eyes should be.",
    "There's something odd about this statue. It has two oval indentations where the eyes should be.",
    "Hrmm, that did something, but it looks like I need the other eye. I could probably carve the pattern into an uncut dragonstone myself if I had one.",
    "The fountain now has a carved dragonstone in its left eye, but the right one is still empty. I could probably match the pattern myself if I had a dragonstone.",
    "The fountain now has a carved dragonstone in its left eye, but the right one is still empty. I could probably match the pattern myself if I had a dragonstone.",
    "This is Kerapac's lab. It seems quieter than normal. I wonder if it's deserted.",
    "Hannibus! I thought you were in stasis.",
    "What is it?",
    "Hannibus! I thought you were on Iaia with your people?",
    "What?",
    "Let me see, it might be what I am looking for!",
    "Well that is gibberish.",
    "Dragons have a language?",
    "So you can read this?",
    "We're looking for another tablet piece, let's take a look around.",
    "Hrmm. This looks like it could be the cypher, but the metal is covering the key sections. I need to find a way to remove it.",
    "Hello little spider.",
    "No one ever wants to talk to me.",
    "I do not!",
    "You don't even know me. Why are you being so mean?",
    "Don't...don't say it...please...",
    "I hate everything.",
    "I am leaving now before this Easter egg gets any weirder.",
    "Hannibus, can you help here?",
    "Hannibus, are you okay?",
    "There are eggs just there, look, in the flames.",
    "I don't think this is getting me anywhere.",
    "I...Maybe we should talk about something else.",
    "Wow, that's a long way down. I can just about see some water down there, but who knows what else is at the bottom.",
    "Hrmm, imperfect metal when cooled quickly can become really brittle. I could perhaps use that to help me break this metal casing.",
    "I sometimes wonder why I do dumb things?",
    "That would be awfully convenient, almost implausible.",
    "Okay, now we just need to break it on something.",
    "Okay. Those teeth look sturdy and sharp, I could probably break off the brittle metal in them.",
    "Okay, let's head there and check it out.",
    "Hey there Mr. dragon head thing.",
    "I really hope you are just a statue and not secretly part of some giant stone dragon.",
    "What a creepy looking statue.",
    "Aargh it talks!",
    "AAAAAAARGH!",
    "I'm looking for clues.",
    "Well, yes actually. I was hoping we might be able to find more information on a dragonkin laboratory somewhere.",
    "Any idea how we might follow them?",
    "Statues, fantastic. I'll take a look. Thanks.",
    "I am a dragonkin in disguise!",
    "I did not.",
    "But you're just stuck on this shelf?",
    "I'm glad you're so happy.",
    "That's not the normal response in these interactions.",
    "Nothing...nothing at all.",
    "Ah that seems to have done something!",
    "I've already got this working, I should stop poking things.",
    "I've already got this working, I should stop poking things.",
    "What are you planning Kerapac, that was quite the speech?",
    "I am investigating a dark power rising, it seems you might know more?",
    "Then at least tell me where I can find the last piece of this map?",
    "But I have more questions!",
    "I should go and check in with Bryll before I head into the dungeon.",
    "Are you sure you don't want to go?",
    "Actually...I've already fought my way through that laboratory and defeated the Black Stone dragon that guards it. It seems like the dragon was suffering the same way that Seiryu was. Something corrupting it. It all seemed to be linked to that black stone.",
    "Looks like I'm fighting my way through a dangerous dragonkin laboratory. What could go wrong?",
    "I have defeated the Black Stone Dragon inside the Dragonkin Laboratory. It seemed to be at war with itself somehow.",
    "I'm sorry. So sorry. We'll regroup and work out a...",
    "Don't be crazy, we don't know what we're up against, we need to be smart about this.",
    "I should go and talk with Bryll, we need to do this fight properly.",
    "Hello there.",
    "I don't suppose I could trouble you for some help with a water-based problem.",
    "You wouldn't know a way I could breathe underwater...way out in the Cursed Archipelago?",
    "Excellent.",
    "Oh.",
    "Do you have any other ideas?",
    "Sounds like it could be just what I was looking for.",
    "Of course there is. What is it? Will I need to go find the ingredients from far flung corners of the world?",
    "It's a bit too deep and far out to sea to fish with a net or rod.",
    "I'm not sure where to fill the vial",
    "I'm not sure where to dry the seaweed.",
    "So about that fish...",
    "Goodbye.",
    "Okay, I am now fully capable of breathing underwater for a few hours.",
    "So we're looking for an expert on dragon activity on Gielinor?",
    "With Vindicta and Gorvek we have enough to destroy the cannons, we should head back to base.",
    "Yup.",
    "Err...yep.",
    "That seems simple enough.",
    "Hello Mrs Steven. Is everything ok?",
    "I know that voice.",
    "I don't believe that for a minute count. Come on Steven, I'm sure we can save your marriage. Maybe we can speak to someone else on the island who can help?",
    "I should gather more proof against the Count before I try and fix their marriage.",
    "Hi, I don't suppose you would know anything about Count Ludwig Koppenploppen?",
    "About a month?",
    "Well, it is a rather nice view. Better than the one from my house anyway.",
    "Hi, I don't suppose you would know anything about Count Ludwig Koppenploppen?",
    "Wait what, but he's seeing someone else?[sic]",
    "Hi, I don't suppose you would know anything about Count Ludwig Koppenploppen?",
    "Hi, I don't suppose you would know anything about Count Ludwig Koppenploppen?",
    "The horror!",
    "Hi, I don't suppose you would know anything about Count Ludwig Koppenploppen?",
    "Hi, I don't suppose you would know anything about Count Ludwig Koppenploppen?",
    "That's horrible, how?",
    "Pretty easily actually...",
    "That sounds like more than enough evidence to show Mrs Steven why the Count isn't the right gull for her. I should go and speak to Steven.",
    "Hello. Wait! Haven't I talked to you already?",
    "Mrs Steven, the Count is a bounder and a cad and I have proof!",
    "So you cool to maybe die for me now?",
    "I'll go and speak to Lieutenant Crane then.",
    "Evie sent me.",
    "She's alright, she's part of my crew. We're about to face a really powerful enemy and she suggested you as someone who might be able to help.",
    "The fate of Gielinor is at stake.",
    "This one's a mutated dragonkin with an army of undead minions, about to complete a ritual which will summon a powerful evil force and wipe out all life on Gielinor.",
    "So you'll join us?",
    "What do you need?",
    "Ok, if I go and check on your sister you'll join the fight?",
    "Just try it, I dare you.",
    "I'm sorry...but have you considered...",
    "During mating season!",
    "I have. She wants me to find her sister before coming to help us. She's in the Black Knight's fortress. I was just wondering what the best way to sneak into the Fortress might be.",
    "I am looking for a trainee, going by the name of Tessa.",
    "What would have happened to her if she was?",
    "I mean where would she be if she failed!",
    "Yes, let me see transfers.",
    "Do you know where Tessa's stuff is?",
    "Right keep on it, there could be infiltrators and spies anywhere!",
    "Where would trainee Tessa's stuff be?",
    "Right keep on it, there could be infiltrators and spies anywhere!",
    "What on Gielinor?",
    "Whahah!?! Who is going to be upset?",
    "How is a suit of armour talking?",
    "I'm meant to be talking. Suits of armour generally don't.",
    "...Anyway, I'm looking for Tessa too, have you seen her?",
    "Don't worry my sentient helm-friend! I'll find her, hopefully she'll be promoted and have all brand-new armour...",
    "I'll let you know if anything comes up!",
    "I'll let you know if anything comes up!",
    "Are you Tessa?",
    "What are you doing here? Weren't you supposed to be training to be a black knight?",
    "What are you doing here? Weren't you supposed to be training to be a black knight?",
    "Err... ok?",
    "Why didn't you just tell me this?",
    "That could be problematic, I will go talk to your sister. Just hang tight for now ok.[sic]",
    "She's a slave. I'm sorry. Commandant Bletchley had all the women kicked out and then turned into slaves. They...they cut out her tongue.",
    "She's fine. She says that you should come and fight with us now.",
    "Ummm, well...",
    "She's fine. She says that you should come and fight with us now.",
    "I'll get right back on that.",
    "Are you aware of what has been going on at the Black Knight's Fortress under Commandant Bletchley?",
    "I need your help. We are breaking Tessa out of here!",
    "The commandant failed her, enslaved her and cut out her tongue...",
    "You are going to help sneak her out! You'd make an excellent disguise.",
    "About that...Tessa has had her tongue removed and has been forced into slavery. We are busting her out, and you are going to have to be her voice. So now all we'll have to do...",
    "NO CODENAMES. Just follow me and we will be out of here in no time!",
    "Lieutenant...",
    "Dare I ask, Lieutenant, why you are bothering to ask me again about who I bring in and out of the castle?",
    "I find your lack of faith in me disturbing. Your paranoia and cowardice evident as much as when I detained Sir Owen.",
    "Perhaps I should tell Commandant Bletchley of your behaviour, as it is quite unbecoming of a black knight?",
    "We were requested by Lieutenant Crane, as she needs our help in the Taverley Dungeon.",
    "We were supposed to be relieved of duty several hours ago. We are meeting some friends for drinks at the pub?",
    "Er...",
    "Not yet. I did smuggle out her sister though!",
    "What will be doing next?",
    "I almost have obtained Crane's Assistance[sic]! But she needs your help. She wants us to deal with the commandant.",
    "How do you think we should do it? I highly doubt Bletchley is just going to let us murder him discreetely in one of the most fortified citadels in Gielinor...",
    "He seems to think quite highly of himself.",
    "Maybe I could lure him by saying that I've spotted you sneaking into the castle on the roof. We can ambush him, with Crane's assistance and finish him there.",
    "You should go to the roof!",
    "The deserter Higgs is up there! Should I send for more guards?",
    "As you once said, 'We have to separate the calf from the veal'!",
    "I should go and talk to Bryll for the next part of the plan.",
    "My what now?",
    "Yeah...about that. I've sort of already done the dungeon. I've already stopped the Ambassador...I did it earlier.",
    "The Ambassador is one of the greatest threats that Gielinor has ever faced.",
    "His ritual, should it succeed, will bring down a dark force which will consume the world.",
    "I've witnessed first-hand the influence of this evil. It warps, corrupts and destroys everything it touches.",
    "It warps our protectors and turns them against us.",
    "All that stands between the destruction of everything we know, is us.",
    "Why is the Ambassador resistant to damage?",
    "He has diplomatic immunity!",
    "Well I thought it was funny.",
    "Never have I seen such a gathering of amazing people.",
    "We have warriors capable of taking on armies.",
    "Sailors capable of outmaneuvering the fastest vessels.",
    "And great dragons capable of incinerating anyone that stands in our way!",
    "The Ambassador doesn't stand a chance!",
    "Each of us is different. Few of us would perhaps have chosen to join together under normal circumstances.",
    "But these are not normal circumstances.",
    "But our differences are our strength. We each have skills and abilities that compliment[sic] one another.",
    "Together there's nothing that can stop us.",
    "It won't be easy. But each of us knows our role to play.",
    "I know none of you will let me down.",
    "So let's do this. Time to save the world.",
    "Look at the person next to you. We're more alike than we are different.",
    "Each person here is risking their life to save their neighbour.",
    "Risking everything to save the world.",
    "I am proud to stand amongst you, because united there is nothing that can stand against us.",
    "It won't be easy. But each of us knows our role to play.",
    "I know none of you will let me down.",
    "So let's do this. Time to save the world.",
    "The Ambassador thinks he's strong. But he's wet and limp as the seaweed that clings to him.",
    "His followers are mindless crabs, brainwashed cultists and decomposing pirates.",
    "And he thinks, for a moment, that he can stand up to us?",
    "We're going to show him how very wrong he is.",
    "It won't be easy. But each of us knows our role to play.",
    "I know none of you will let me down.",
    "So let's do this. Time to save the world.",
    "And his ritual dead with him.",
    "Nowhere near enough...",
    "What happened to you Shih? You just...vanished.",
    "Not bad at all.",
    "Huh? I haven't seen this part of Aminishi before."
  ],
  "Sojobo (contracts)": [
    "Looking for work? I have contracts for you to complete in this region, and I'll reward you for them.",
    "Hrmm. There was an old Eastern Lands story about a jade spider. Let me see. Something about a young man tricked into falling in love with a woman. As the tale goes, the woman was secretly a spider that was disguised as a woman. She lured the man into her web with promises of romance and then she devoured the man. A pretty dark story as I recall. Probably doesn't help you much though.",
    "No, sorry I haven't heard anything.",
    "Now that you mention it. I did hear someone mention a spider. It was in the town square, by the fountain.",
    "I overheard someone talking about some sort of arachnid. On the southern part of the town square.",
    "Now that you mention it. I think Zhuka might know something on that. You should speak to her.",
    "Farewell."
  ],
  "Rosie (supplies)": [
    "Hrmm, that does sound familiar. But I can't place it sorry. It reminds me of something I heard whilst out at sea.",
    "No, sorry I haven't heard anything.",
    "Now that you mention it. I did hear someone mention a spider. It was in the town square, by the fountain.",
    "I overheard someone talking about some sort of arachnid. On the southern part of the town square.",
    "Now that you mention it. I think Zhuka might know something on that. You should speak to her.",
    "Farewell."
  ],
  "Salmon Max (fish merchant)": [
    "Do you smell something?",
    "Hrmm, that does sound familiar. But I can't place it sorry. It reminds me of something I heard whilst out at sea.",
    "No, sorry I haven't heard anything.",
    "Now that you mention it. I did hear someone mention a spider. It was in the town square, by the fountain.",
    "I overheard someone talking about some sort of arachnid. On the southern part of the town square.",
    "Now that you mention it. I think Zhuka might know something on that. You should speak to her."
  ],
  "Tang (food merchant)": [
    "Want to trade?",
    "Er...the Eagle flies south for the cauliflower.",
    "Err nothing, I was..er...clearing my throat...",
    "I don't know about any Jade Spider, but I've got a lovely opal caterpillar I can sell you if you're interested.",
    "I have absolutely no idea what you're talking about, sorry.",
    "I haven't heard anything about any Jade Spider, but I did hear that there are ghosts living in old Long's house. They visit at night and they keep giggling like a bunch of young women. It's downright creepy.",
    "Jade Spider? What are you talking about?",
    "Oooh is this one of old Wing's puzzles? Do you need to take apart the spider and make it fit a square shape or something?",
    "The Raven flies south for the winter.",
    "Well met [brother/sister].",
    "Nope, not a clue, sorry.",
    "No, sorry I haven't heard anything.",
    "Now that you mention it. I did hear someone mention a spider. It was in the town square, by the fountain.",
    "I overheard someone talking about some sort of arachnid. On the southern part of the town square.",
    "Now that you mention it. I think Zhuka might know something on that. You should speak to her."
  ],
  "'Reggie' (tortle shell merchant)": [
    "Aha, Portmaster, it's good to see you here on Waiko! Welcome to Torts R Us.",
    "Oh, of course not. I prefer big game, this is just a side business to earn a few chimes, so I can fund my next expedition! No, we're only interested in tortle shell chippings here. Very versatile substance.",
    "We've developed a humane way of harvesting what we need without causing permanent damage. Plus the locals have been running subsistence surveys and whatnot. No harm comes to them, or my name isn't Reginald Wellington-Smythe. In fact, you needn't take my word for it, try it for yourself. There's a creep of tortles amassing on Whale's Maw, a perfect hunting ground!",
    "Well, maybe not those on Whale's Maw, but I don't trust the rare shiny tortles found out in the uncharted islands. I'll pay handsomely for some shell chippings from those.",
    "Want to trade?",
    "Er...the Eagle flies south for the cauliflower.",
    "Err nothing, I was..er...clearing my throat...",
    "I don't know about any Jade Spider, but I've got a lovely opal caterpillar I can sell you if you're interested.",
    "I have absolutely no idea what you're talking about, sorry.",
    "I haven't heard anything about any Jade Spider, but I did hear that there are ghosts living in old Long's house. They visit at night and they keep giggling like a bunch of young women. It's downright creepy.",
    "Jade Spider? What are you talking about?",
    "Oooh is this one of old Wing's puzzles? Do you need to take apart the spider and make it fit a square shape or something?",
    "The Raven flies south for the winter.",
    "Well met [brother/sister].",
    "Nope, not a clue, sorry.",
    "No, sorry I haven't heard anything.",
    "Now that you mention it. I did hear someone mention a spider. It was in the town square, by the fountain.",
    "I overheard someone talking about some sort of arachnid. On the southern part of the town square.",
    "Now that you mention it. I think Zhuka might know something on that. You should speak to her."
  ],
  "Yi Yan (salt merchant)": [
    "Want to trade?",
    "Er...the Eagle flies south for the cauliflower.",
    "Err nothing, I was..er...clearing my throat...",
    "I don't know about any Jade Spider, but I've got a lovely opal caterpillar I can sell you if you're interested.",
    "I have absolutely no idea what you're talking about, sorry.",
    "I haven't heard anything about any Jade Spider, but I did hear that there are ghosts living in old Long's house. They visit at night and they keep giggling like a bunch of young women. It's downright creepy.",
    "Jade Spider? What are you talking about?",
    "Oooh is this one of old Wing's puzzles? Do you need to take apart the spider and make it fit a square shape or something?",
    "The Raven flies south for the winter.",
    "Well met [brother/sister].",
    "Nope, not a clue, sorry.",
    "No, sorry I haven't heard anything.",
    "Now that you mention it. I did hear someone mention a spider. It was in the town square, by the fountain.",
    "I overheard someone talking about some sort of arachnid. On the southern part of the town square.",
    "Now that you mention it. I think Zhuka might know something on that. You should speak to her."
  ],
  "Boni (rewards)": [
    "Welcome back. I have such wonders to show you. Stay a while and peruse my treasures.",
    "Er...the Eagle flies south for the cauliflower.",
    "Err nothing, I was..er...clearing my throat...",
    "I don't know about any Jade Spider, but I've got a lovely opal caterpillar I can sell you if you're interested.",
    "I have absolutely no idea what you're talking about, sorry.",
    "Jade Spider? What are you talking about?",
    "Oooh is this one of old Wing's puzzles? Do you need to take apart the spider and make it fit a square shape or something?",
    "The Raven flies south for the winter.",
    "Well met [brother/sister].",
    "Nope, not a clue, sorry.",
    "No, sorry I haven't heard anything.",
    "Now that you mention it. I did hear someone mention a spider. It was in the town square, by the fountain.",
    "I overheard someone talking about some sort of arachnid. On the southern part of the town square.",
    "Now that you mention it. I think Zhuka might know something on that. You should speak to her."
  ],
  "Boni (rewards))": [
    "I haven't heard anything about any Jade Spider, but I did hear that there are ghosts living in old Long's house. They visit at night and they keep giggling like a bunch of young women. It's downright creepy."
  ],
  "Lidylla": [
    "What an odd name? Sorry doesn't ring a bell.",
    "No, sorry I haven't heard anything.",
    "Now that you mention it. I did hear someone mention a spider. It was in the town square, by the fountain.",
    "I overheard someone talking about some sort of arachnid. On the southern part of the town square.",
    "Now that you mention it. I think Zhuka might know something on that. You should speak to her.",
    "Farewell."
  ],
  "Zhuka (bamboo merchant)": [
    "Want to trade?",
    "SHHHH! They'll hear you!",
    "I can't...look...",
    "They have spies everywhere. Hiding, watching. Look, I don't know anything important okay. If you want to know someone that does, you should find a friend on Whale's Maw. But I didn't tell you anything.",
    "Sorry my friend, I just sell bamboo. I'm sure a jeweller somewhere might have what you're after."
  ],
  "Ted": [
    "What do you want?",
    "I don't know what you're talking about. Go annoy someone else with your nonsense."
  ],
  "Sea Witch Kaula": [
    "Yes, the Spider said you would come. Dark days are coming, a shadow threatens all of us, can you feel it? It's like a cold current beneath the surface that threatens to drag us all under.",
    "They are watching me. The Jade Spider gave me a message for you, but I had to hide it from them. I was forced to bury it near the tortles. So that they could not steal it from me. They will be watching me, but I don't think they have yet noticed your involvement. Go quickly, before their blades are pointed at you."
  ],
  "NPC": [
    "Er...yay?",
    "Have you tried poking it?",
    "Huh? I think you've eaten enough shellfish already, you should have a sit down.",
    "They do that.",
    "Yes, but they never tell you anything!",
    "Farewell."
  ],
  "Alder (bamboo merchant)": [
    "Want to trade?",
    "Er...yay?",
    "Have you tried poking it?",
    "Huh? I think you've eaten enough shellfish already, you should have a sit down.",
    "They do that.",
    "Yes, but they never tell you anything!"
  ],
  "Ani (farming merchant)": [
    "Human, give me your seeds!",
    "Er...yay?",
    "Have you tried poking it?",
    "Huh? I think you've eaten enough shellfish already, you should have a sit down.",
    "They do that.",
    "Yes, but they never tell you anything!"
  ],
  "Terri (fruit merchant)": [
    "Wanna make Terri very merry? Gimme berries!",
    "Er...yay?",
    "Have you tried poking it?",
    "Huh? I think you've eaten enough shellfish already, you should have a sit down.",
    "They do that.",
    "Yes, but they never tell you anything!"
  ],
  "Sensei Seaworth": [
    "But the pearl is black. So you're the adventurer the Spider told me to look out for. Okay, listen carefully, you're going to want to sail to Goshima. The Jade Spider has a camp set up in the city, you can find them there. Be careful though, the enemy is gathering, you should be ready for a fight.",
    "Farewell.",
    "You can find the Jade Spider on Goshima."
  ],
  "Bosun Higgs": [
    "You gonna get to the bottom of this or what?",
    "Stay sharp, cap. I hear something moaning out there, and not the good kind of moaning. There's something lurking around the gates of Goshima, and it doesn't look friendly.",
    "You gonna get to the bottom of this or what?",
    "I've got a plan, but you should talk with Bryll first and then come speak to me once you've done the other tasks.",
    "I've been thinking. If we're going to fight this Ambassador and his minions, we're going to need soldiers. Someone to fight his forces whilst you sneak through and take down the ritual. I have a friend, Lieutenant Crane, who commands an elite group of black knights. We served together and rose through the ranks together. I trust her with my life. Whatever beef I have with the order, I know she'll fight the real fight. Last I heard she was stationed underground in a dungeon, near the prison cells.",
    "Have you found Crane yet? Last I heard she was stationed underground in a dungeon, near the prison cells.",
    "Have you found Crane yet?",
    "Well the Black Knights trust their own and don't ask to[sic] many questions if you are wearing the right armour. We...have a pretty high churn of recruits. So if you're wearing a full set of black armour, you should sneak right in.",
    "We can't do anything until you've obtained Crane's Assistance.",
    "I've heard rumours. They don't paint him in a good light. However, that doesn't matter right now. We need to focus on getting Tessa out of there.",
    "Have you obtained Crane's Assistance?",
    "You should probably go and speak to Crane then.",
    "Oh, fair enough. It's about time for a homecoming, and what better way than a command restructure.",
    "He might have a weakness which can be exploited. Any thoughts?",
    "That could work. Go to the castle, I'll let Crane in on the plan.",
    "We should go and get rid of that monster, Bletchley at the fortress.",
    "Commandant, your tyranny precedes you...",
    "On the contrary, the sword of justice points at your throat not mine. How can you even try justify[sic] what you have done to these women?",
    "They were just trainees and you made them slaves! You are little more than a tyrant!",
    "Of course, you are our 'defender'. Nothing is going to stand in your way. Not me, not Tessa, not the black knights, not even Lord Zamorak himself!",
    "You have not unlocked those trainees' potential, you have murdered it. I will be merciful by offering you a swift death if you repent now.",
    "Everyone here understands that sometimes there needs to be a drastic change in command.",
    "Excellent, Bletchley has been murdered and Crane is woman of her word. Just talk to her quickly again and I'm sure she will be ready to move out.",
    "We shall punch the Ambassador IN THE NOSE.",
    "Does...does he have a nose?",
    "We shall punch the Ambassador IN THE NOSE. Does...does he have a nose? The Ambassador is going DOWN!",
    "Excellent, that certainly was expeditious! And with Crane now fighting with us, We shall punch the Ambassador IN THE NOSE. Does...does he have a nose?",
    "We shall punch the Ambassador IN THE NOSE. Does...does he have a nose? The Ambassador is going DOWN!"
  ],
  "Lookout Ekahi": [
    "Have the quartermaster set a course for Cyclosis, captain. Speak with me at the Eastern tower there and I shall introduce you to my khan, Ichi.",
    "What we may lack in depth perception, we have learned to compensate for by sharpening our other senses. Tread carefully, captain.",
    "What we may lack in depth perception, we have learned to compensate for by sharpening our other senses. Tread carefully, captain."
  ],
  "Navigator Jemi": [
    "This quest is daunting me a little bit, captain."
  ],
  "Quartermaster Gully": [
    "I'm not sure about this, Cap'n.",
    "Yarr, I be thinking you want to be chatting to Bryll right now. She's be heading up this little operation.",
    "Yarr.",
    "Arr matey. I've been thinking. We are about to head into extreme danger.",
    "Our chances of survival are slim.",
    "Well then. Yarr I be needing to put all me affairs in order then. I owe a debt you see, to ol'Steven here and I'd like to repay it...arrr. Yarr see Steven has been me faithful companion for a long time now. Came with me to tame the seas he did. But to do so he had to leave his family behind you see. If we're going to die, a gull should at least have the chance to tell his wife and kid he loves 'em.",
    "Arr ye be a good friend cap'n. His family lives on them Eastern Lands now, Waiko no less. Moved there a bit back.",
    "We need to meet Steven's family in Waiko.",
    "Steven's a good dad and husband he is. We just need to remind his lovely wife of that. We should look around the island see if anyone can help.",
    "Steven's a good dad and husband he is. We just need to remind his lovely wife of that. We've found some stuff out, we should tell his wife.",
    "Thank you for helping.",
    "I'll try not to cap'n, but if I do at least it's with a clear conscience.",
    "Ready to sail on your word Cap'n.",
    "Yarr, Bryll be heading up this operation."
  ],
  "Madame Shih": [
    "Hello Player, I'm glad you found me. I was beginning to wonder if you would be able to make it at all.",
    "The very same. It's a bit of a dramatic title, but it has its uses. People tend to be oddly frightened of strange names, puts the riff-raff off. But whilst I'd love to chit-chat, I'm afraid we've just not got the time. I take it Bryll has warned you about a rising threat?",
    "Yes, well, the world is full of theatre I'm afraid. I find it better to embrace it than to run from it.",
    "There is a being called the Ambassador. He is an ancient creature in service to something dark and terrible. I've been investigating him for some time and I think I've finally found a lead on him. There is a new religious order that has grown on the island of Aminishi. They preach purity and transcendence, but the truth is far far darker than that. I managed to sneak inside, pretended to be one of the faithful, and I rose high enough to join their council. That's when I learned they were dealing with the black stone. Something I have dealt with in the past and it's bad news. Whatever this stone touches, it corrupts and I could already see the tendrils of corruption infesting the Temple of Aminishi. Unfortunately I got careless and someone learned that I wasn't truly faithful. I killed them before they could tell anyone, but it's too risky for me to stay there now. I know that suspicion is creeping in on me. Which is why I need you. See I'm good at warding magic and they used my skills to protect their dungeon from intruders. But what they don't know is that I added a backdoor to the wards. I tied the magic of the wards to the nearby guards so that someone with a powerful enough magical presence...say the World Guardian...would be able to break the wards just by taking out some of the security. Crude, but effective. So that's what I need you to do. I need you to make your way into the Temple of Aminishi and find out what they're doing in the lower levels. You don't need to do it alone, if you've got some friends you can trust, they can join the fight with you. It won't be an easy fight, but you're the World Guardian, I'm sure you can handle it.",
    "...",
    "You need to investigate the Temple of Aminishi and learn its secrets.",
    "...",
    "SEIRYU! ONE OF THE SACRED ANIMA GUARDIANS! HOW DARE THEY!",
    "But...it makes sense and seems to tie in with something my agents have recently uncovered. A strange tablet buried in the sands of Aminishi. It seems that the black stone is not a recent discovery. In fact it was discovered a long time ago. At least that's as much as we can glean from this tablet. According to my mystics it's written in the language of a race, from the distant past, known as the dragonkin. Nasty creatures if the stories are to be believed.",
    "I need to stay here and see if I can discover anything more about this Ambassador and his plans. I imagine someone as well travelled as you must know someone who knows a lot about dragonkin. They might be able to help.",
    "You'll need to find an expert on the dragonkin to translate that tablet for you.",
    "Never! I will never surrender myself to that...that...thing!",
    "What? NO!",
    "I'll kill you! I'll stop your ritual and tear your heart out of your chest!",
    "That...that monster...",
    "No. No more waiting. No more debating. I have nothing left to lose. All I have left is my vengeance. I will tear apart this ritual with my bare hands. He will regret the day he ever crossed me.",
    "You...you did it. You avenged my crew...I...thank you Player, thank you.",
    "I went to fight him. Like a fool. I went to fight him. But his forces caught me. He had wormed his way into my head. Some time ago, back when Rabid Jack took me hostage in that temple. Like Seiryu I could only feel a terrible obsession, a desperate yearning need to hunt him down. He was counting on that of course. I should have known better, but...the noise was so loud. That horrible song screaming in my head. But it's silent now. Silent enough that I could escape. Silent enough that I could return here and thank you. I owe you a great debt Player and one day I look forward to repaying it."
  ],
  "Mr. Mordaut": [
    "How may I be of service?",
    "What's that? A dragonkin tablet? Oh how simply marvelous! May I?",
    "By jove, this really is quite the find. This seems to be some sort of map, though I cannot quite make it out. It's talking about a font of creation. Which knowing what I know of the dragonkin might well indicate one of their hidden laboratories.",
    "Ah, well that's where we hit a bit of a problem. It seems this is only a part of the map. Not enough to create a full picture. It's not all doom and gloom though. No no. In fact it talks about where the first clue might be hidden, or at least a link to it. It mentions that it's being safeguarded by the white-scaled alchemist. Does that ring a bell? It does mention something about a cold frozen mountain to the north, along the north east of the continent. A secret sanctum deep beneath the ground. Perhaps you can find something there?",
    "How may I be of service?",
    "Why...no...it couldn't be...could it? A living, breathing, dragonrider, here in my little office? My good sir, it is an honour to meet you. Truly. Why I am quite giddy, where's a parchment, I really must get your signature.",
    "Oh my stars yes. To us dragons, you dragonriders are...are...well you're like heroes to us. To most of my kind your touch is a sparkling moment of lucidity in an endless nightmare. Why dragons dream of finding a rider. Of learning how to feel the wind beneath their wings without the rage stripping away the ability to enjoy the moment. And then there's the history! The stories, the LEGENDS...I would love to pick your brains, to learn everything there is to learn about you.",
    "Hrmm. I'm sorry I can't think of any dragons with enough clarity to join you.",
    "Forgive me interupting[sic], but couldn't you get the other dragonrider to help you? I know she's rather...difficult, but she is your kin after all?",
    "There's a dragonrider general, fights for the forces of Zaros at the Heart. Perhaps you could persuade her to assist you?",
    "My door is always open rider, always."
  ],
  "Hannibus": [
    "I was. Time certainly seems to have passed and I only have the memories of dreams to account for it. Kerapac woke me up. Or rather I woke up and Kerapac was gone and I was in an empty house in what you now call Varrock. I had no idea what had happened, all I had was this.",
    "The seeds of a future. A cure...or the beginnings of one. Kerapac left me with a typically succinct note. It's not a full cure, but it will help some of the younger generation to produce healthy young. It won't save us, but it will save enough that there's now a real chance of us finding a solution. So, I had to find him, to thank him. But he seems to have vanished off the face of the planet. In typical Kerapac fashion.",
    "I was. It was beautiful seeing them all again. Sad, or course, we are a reduced people, barely a handful left. But sad can be beautiful and whilst we may be few, we are far from alone. But then he found me, Karapac. He seemed...distracted, but he wanted to give me something.",
    "A...a...cure. Well not a cure, but a salve. It won't save us, but it's the beginning of something. The spark of hope just handed to me. But you know Kerapac, man of few words, he left before I could find out anything more. I travelled across worlds to seek him out, see if I could learn more. Happily that seemed to coincide with our reunion. It is good to see you my friend.",
    "I've been searching this lab since I got here and I can't find anything concrete. Just this piece of some soft of ancient map, but it's gibberish. I can't make heads nor tails of it.",
    "Wait! I recognise that. It's the language of the dragons, or a crude attempt at it at least.",
    "When they are calm, they can be quite intelligent. I've only ever been able to calm a dragon whilst I am in its presence though, but Shakorexis introduced me to the basics of their culture and their language. It's a simple language, it conveys emotions more than words. They're creatures of experiences, dragons, their entire lives are built around the few memories of lucid moments. It's sad really, they are such wonderful friends when the rage doesn't take them over.",
    "Just about. It wasn't written by a dragon, that much I can tell you. It's like someone used the language as part of some sort of code, or puzzle. Ignoring the beauty of a language so that they could get across some crude directions. It talks about secrets hidden in the place where 'the armoured dragons are made'. Though I'm not sure where that might be.",
    "We should search for the place where 'the armoured dragons are made'. Wherever that might be.",
    "This place...by the Olun'dai this place is horrible. Do you feel it? So much pain. So much suffering. A horrible burning sensation creeping over my skin. An aura of terrible loss. Let's get what we need and get out of here. This is an evil place.",
    "We should look around the place. This is where the tablet hinted earlier, there must be another clue hidden somewhere.",
    "That lump of metal could be what we're after, if only we could find a way to melt it off or something.",
    "Well that metal is nice and hot now, but it's not sliding off the thing. I'm no smith, but perhaps there's something we can do to make it brittle.",
    "It's brittle, now all we need is a sharp solid point to break it over.",
    "I still can't decypher it. But there's a drawing of something that looks familiar. I think I saw it back at the lab in Daemonheim.",
    "They're beautiful creatures, much smarter than they appear. But they're afflicted with a terrible, constant rage. They call it the 'maker's curse' and believe it is something from their creator that has afflicted them. The horrible reality is that they can never be more than mindless beasts as long as the rage afflicts them. But we ilujanka have a power, the ability to calm a dragon. To let it be rational for a while. We take some of their fury and siphon it away, give them some of our own calm and clarity. They're so kind, so friendly, so full of promise when they're like that. They let us ride them, rider and dragon together. To fly on a dragon is an experience like no other. The wind against our scales. The world falling away below us. It's amazing.",
    "My world is beautiful and my people are part of that. We live in harmony with the planet, working with the animals there to tend to the planet. My people believe every living thing is a part of a shared destiny, a tapestry made up of countless threads. We call it the Olun'dai. But we are dying. The population falls further and further each generation with fewer young born healthy. It won't be long until we cannot sustain a viable population. It's terrible to realise that your species is on the endangered list. But this serum that Kerapac has given me. It's a ray of hope. Not a cure, but it gives us the most amazing gift of all. The only thing worth having. Time.",
    "I shall try.",
    "The...rage...it's so strong. By the Olun'dai she's so angry...",
    "It's...difficult. She is in so much pain. She has no voice of her own, so I'm lending her mine.",
    "She's not listening. You'll need to try and reach her.",
    "Yes, because that always works.",
    "She's not listening. You'll need to try and reach her.",
    "She's not listening. You'll need to try and reach her.",
    "Please don't do that again.",
    "She's not listening. You'll need to try and reach her.",
    "I'm sorry, Player, I can't bare it. Ask her something else, please. She's so scared, so sad.",
    "Have a heart Player, you can't feel it. These poor creatures are in so much pain and their minds are clouded constantly with anger. They barely know who they are. Treat them with a little respect.",
    "Rest my friend.",
    "Maybe there's another one buried bit deeper into the dragon head.",
    "Life is constantly implausible my friend. That's what makes it wonderful.",
    "Sounds like a plan.",
    "I can see the tablet. Let me take a look. You're not going to like this...it looks like it's sending us in circles. I still can't decipher it. But there's a drawing of something that looks familiar. I think I saw it back at the lab in Daemonheim.",
    "So here we are again. This is definitely where the tablet was pointing to. We'll have to look around, see if there are any more clues.",
    "This is definitely the place the tablet mentioned. There must be a clue here somewhere. I'll look over here, you try some of the other rooms.",
    "Well...that strange little effigy thing mentioned something to do with the statues. Perhaps there's a trick to it?",
    "We should head through that portal.",
    "You should go speak to Kerapac, if anyone can translate that tablet, it's him.",
    "You should go and catch up with Bryll. Kerapac and I have a lot to talk about.",
    "You should talk to Bryll first, breathing underwater is probably more important than my plan.",
    "Well the big disadvantage that these cannons have, is that they're rather vulnerable from the air. So I thought that I could perhaps convince a few of our big scaly friends to help us out. I thought we might start by chatting with my old mount, Shakorexis, or the King Black Dragon as you call him. It would be good to fly again.",
    "Now that you can breath underwater we should probably move on to the next stage. Unfortunately for us the Ambassador isn't stupid and he's defended his ritual site fairly well. Our immediate priority is going to be taking out his artillery. Fortunately his cannons are all facing decidedly downwards. A quick strike with dragonfire and those cannons will go up in smoke. I thought we might go and visit my old friend Shakorexis, or as you know him, the King Black Dragon. It will be good to see my old friend again.",
    "Hello old friend. It's been too long.",
    "There is hope, old friend. Hope. But I am not here to reminisce, I need your help.",
    "Are there any others who could join us? Dragons with enough self control?",
    "It is time we spoke with our good friend Mordaut. Shakorexis, we are gathering on the east of Daemonheim, will you meet us there?",
    "You s hould talk to Hannibus about taking out those cannons.",
    "We need to speak to an expert on dragons.",
    "My signature?",
    "I would be delighted. But perhaps not now. I'm looking for dragons that could join us in a great battle. A dragon with enough clarity that they could help me without me needing to ride them.",
    "I see. Well...thank you for your...",
    "Other...rider?",
    "I...Player please, I need to meet this rider. I need to speak with them.",
    "Thank you for your time Mr Mordaut, I shall have to see about a longer conversation later.",
    "I shall meet you at the Heart, Player.",
    "We need to visit the Heart. I can't believe it, another dragonrider!",
    "Well met my friend. To see another ilujanka here, on Gielinor and to see you riding a dragon as I once did.",
    "That is true. All the ilujanka are on Iaia currently.",
    "No. It's more than that. They serve the Olun'dai. They serve their place in the tapestry.",
    "How can you say such things? How can you renounce the Olun'dai so willingly. You must have been taught...",
    "You were born here? But...how? There haven't been ilujanka here for centuries? Not since...",
    "Morvannon...but, that means... Your father...what...what was his name?",
    "I...I never introduced myself. I am Hannibus. I...I am your father.",
    "I AM a warrior. Shakorexis and I have faced down armies and destroyed the dread beasts of the old world. Do not think to know me child. A warrior is more than the armour they wear and the weapons they carry. More than muscle and...height. I am a warrior, I will always be a warrior. Let me prove it to you, daughter. Come fight with me. One battle, let me prove that you are my daughter.",
    "A dragonkin's defences. Cannons guarded by the warped monsters of the Ambassador.",
    "We have lost so much.",
    "Come on my friend. We've got what we came for.",
    "I have a daughter. I can't believe it! You should talk to Bryll, find the next step of the plan. I'm a dad!",
    "We did it my friend. We saved the world. Not bad for my first day back eh?",
    "But saving the world is the second best thing to happen to me today. I'm a father... I can't believe it. I never dreamed I could ever call myself that. I have so much catching up to do. I have so many years of absentee parenting to make up for. It's going to be hard. She owes me nothing. But I'm going to relish every moment of trying to win her over. Thank you my friend. I owe you...I owe you everything. Silas shathnia odenwa. Until we meet again."
  ],
  "Eek the spider": [
    "Hi there, little spider friend!",
    "Oh, that's my friend. They're a 'World Guardian'.",
    "Mostly it means they get really pompous about things.",
    "Do too!",
    "AHAHAHAHAHAHAHAHAHA!"
  ],
  "Squeak the spider": [
    "Hi there! Why are you riding around on that tall lanky thing?",
    "Oooh what does that mean?",
    "Yeah, I agree with her.",
    "Sorry, we spend too much time...",
    "ON THE WEB! AHAHAHAHAHAHAHAHAHAHAHA!",
    "Oh you're on the web too. Upvote."
  ],
  "Adamant dragon's voice": [
    "Where are they? They took them! My babies. My babies.",
    "My babies. MY BABIES!",
    "I need to find my babies! My babies. MY BABIES!",
    "No. Keep it away from me. They'll use it to hurt them, they'll hurt my babies if I damage it. My babies. MY BABIES!",
    "Oh my poor darling. You're cold? Come here now, Granny will make it all better.",
    "YOU! I'LL KILL YOU! YOU HURT MY BABIES!",
    "My babies. MY BABIES!",
    "Yes. Aren't they beautiful? My grandchildren are great grandchildren. My babies' babies. No. They'll come for them. Come and take them from me. I WON'T LET THEM! Do you hear my darlings? DO YOU HEAR? GRANNY IS HERE! GRANNY WILL KEEP YOU SAFE!",
    "I...once...I... Once I could hear them. See them there, playing in the flames. My eldest used to love the flames. Used to skip between them singing about the way it tickled her little feet. I...I don't remember her name. What was her name? No...no...she's screaming. Screaming because it hurts. Screaming because of the rage and fury and I feel it too. I feel it burning inside me. Burning away their names. My darling babies. I can't remember their names. What kind of a mother am I? What kind of a grandmother? I can't remember their names.",
    "They come down the stairs. With claws of sharpened metal, or summoning forth the elements themselves. They come and they cut down my children. They strike them with magic or tear their flesh with their claws. They rip the flesh from their corpses and they steal all the treasures that my babies have found. The treasures that tell their story. That remind them of who they are without the rage. Without the pain. They come for them and they kill them again and again and again until none of them stand. My babies. My poor poor babies."
  ],
  "Adamant dragons's voice": [
    "They took them from me! They took my babies. What is a mother without her children?"
  ],
  "Effigy": [
    "Hallo. What are you doing?",
    "AAAARGH!",
    "No, but seriously. What are you doing here?",
    "On where all the high mucky mucks went yeah?",
    "Yeah, they all disappeared through some sort of portal thing in the room over there.",
    "I don't know exactly. I've been on the shelf you see, it's hard to get much information. But far as I can tell it's got something to do with the big statues. Heard the boss man bring them in a few days ago.",
    "Don't mention it.",
    "Oh, really? Which one?",
    "You didn't really think that through did you?",
    "Come back for a chat have we?",
    "Nah not really. I've mostly been an inanimate relic of a bygone era. It's only recently that I've discovered what it's like to be aware of your surroundings. The world is so vast and interesting, there's so much to learn and discover!",
    "Yeah, but just look at it all. There's all this colour and those sounds. It's amazing!",
    "Nope.",
    "What on...er...whatever this planet is called is that?"
  ],
  "Kerapac": [
    "This is the dawn of a new age my brothers and sisters. The curse is broken, the chains are shed. WE ARE FREE! But we cannot get complacent. This is a victory, yes, but it is the battle, not the war. With my chains shed I can finally think clearly. Truly clearly, with the clarity we haven't felt in millennia. Freedom isn't achieved simply in one action. We must cling to it dearly, we must fight for it with every breath. We must take action. We must make a stand. We must make sure that no chain can ever be forged again. So once again I raise the old banner and I ask you to stand with me my brothers and sisters. Let us not simply break these chains, let us melt them down and turn them into swords against our captors. Let the slavers know that we will never be slaves again! It is our time to rise!",
    "World Guardian, I suppose I should not be surprised at your arrival at this time.",
    "All in good time Player. All in good time. But you need not fear Player. I will come to you when the time is right.",
    "I do. But it would not help you for me to tell you, there are some things you need to discover on your own.",
    "I can do better than that. I will tell you exactly where it leads. It leads to an old laboratory of mine. The home of some of my greatest experiments...and my greatest mistakes. Once a place where new dragons were born, wonderful dragons with unimaginable potential. But...we had to abandon it. Sometimes an experiment goes wrong and in that laboratory it went horribly wrong.",
    "There lies your answer. Now. You should go, speak to your allies. I should speak with your friend, Hannibus, I must make sure he administers the serum correctly.",
    "But I have no more answers. Go."
  ],
  "The Ambassador": [
    "Did you think freeing the other two would weaken my hold on you? You have only tightened the noose further. Can you feel it, even now, the siren call of the master beckoning you?",
    "In time you will. When the last of your hope is gone, you will see the truth. But I understand. You are chained down by your allegiances, your friends and your crew. Let me set you free.",
    "You'll try. My plan cannot be stopped. His gaze shall fall upon Gielinor and we shall be redeemed!"
  ],
  "Wizard Myrtle": [
    "Hello again there friend.",
    "I'd be happy to help if I can, especially after you helped me find my mentor.",
    "Well yes...",
    "...and no.",
    "If you wanted to dive nearby I could simply cast an underwater breathing spell on you. However I can't maintain the spell from too far away. And unfortunately I cannot join you near the Cursed Archipelago because of...reasons.",
    "Maybe... During my research I found a set of old instructions on how to make a potion of water breathing. Given my skills I never had any need for it, but maybe it would be of use to you.",
    "Unfortunately there is a small catch.",
    "Not quite. I have most of the ingredients here. However they need preparing and the instructions are a bit cryptic. It says to fill a vial 'with the clear winds of winter', to dry some magical seaweed 'under a divine blinding light'. Then finally to combine those with a 'resident of the depths you wish to traverse'. I think this means a fish from near to where you want to dive. As for the others I have an enchanted vial to hold the winds, whatever they may be, and some magical seaweed, but we will need to get the fish.",
    "I think I could teleport one here, if you give me a law rune and a raw fish to swap places with the target fish. Here, take these unprepared ingredients.",
    "I have some cryptic instructions for how to make a potion of water breathing. It says to fill the vial 'with the clear winds of winter', To dry the seaweed 'under a divine blinding light', And finally to combine those with a 'resident of the depth you wish to traverse'.",
    "The cryptic instructions said something about capturing the winds of winter in the vial. So I would search somewhere cold and windy...perhaps atop some snow covered hill.",
    "The cryptic instructions said something about being dried in divine blinding heat. The blinding heat sounds like the desert, but as for the divine aspect I'm not sure.",
    "You need to bring me one law rune and one raw fish for the spell.",
    "Ah! I see you have the items I need. Do you want to proceed?",
    "Oh, ok.",
    "Goodbye.",
    "I think these belong to you.",
    "Nice to see you again. Do you need some help with the potion?"
  ],
  "King Black Dragon": [
    "Indeed it has. We had not expected you to return. We know of your people's plight.",
    "It is yours. We are brothers and we will always be here if you need us.",
    "Perhaps, but I am not well versed in the activity of other dragons.",
    "Yes, we shall ready ourselves for battle once more."
  ],
  "Vindicta": [
    "There are no other dragonriders on Gielinor. Only me.",
    "Oh yes. I know of them. Weak and pathetic. Letting themselves die because fighting is too hard.",
    "An excuse for weakness, nothing more. We are dragonriders, we should fight. We should take our fate into our own hand. Not just wallow in self pity.",
    "Ha! I was not raised among the whimpering walking dead of Iaia. I was hatched here on Gielinor in the heat of dragonfire! I am the daughter of two dragonriders! I forge my own fate at the side of my Lord Zaros!",
    "I was born to Morvannon. My egg was rescued by Gorvek when she was slain. He kept me in stasis for centuries until it was safe for me to be born. I was raised by dragons to serve the Empty Lord as his great rider!",
    "Hannibus, the great rider. A terror to his enemies. Greatest of the riders.",
    "How dare you lie to me! Hannibus was a giant. A warrior. You are a tiny, frail thing.",
    "That's better. That's the fury of a warrior. Tell me...Hannibus...what is the target?",
    "Kranon the Ambassador. I have heard of him. The Empty Lord has warned of the danger he represents. Oh yes, I will stand against that. Very well. But be clear there is no bond between us Hannibus. You are not my father, even if you prove yourself my blood. But if you can show me the strength of a true dragonrider...perhaps we can talk more.",
    "I am only here to fight the Ambassador. Do not think we are friends and I do not expect any tearful reunion with my father."
  ],
  "Mrs Steven": [
    "*Squawk caw SQUAWK!* [Steven...What are you doing here?]",
    "*Squawk squaw CAW!* [I...I thought you'd gone Steven. Thought you'd left us.] *Caw squaw CAW* [I've...I've moved on Steven. I'm seeing another gull.]",
    "*SQUAWK!* [You...you...GET AWAY FROM ME!]",
    "*Squawk* [Steven, please forgive me. I was just so lonely.]",
    "*Squawk! Squawk!* [Thank you for reminding me what a good man I have here.]"
  ],
  "Steven": [
    "*SCREE squaw CAW caw* [How could you? Who?]",
    "*Squawk* [I know I'm[sic] sorry. I shall visit more often. I love you wife.]",
    "Squawk!Squawk!Squawk![sic] [Thank you. I'll just finish up here and meet you back at the ship.]"
  ],
  "Mystery Seagull": [
    "Squawk! [Muahahhaa! Oh dear, how dreadful.]"
  ],
  "Count Ludwig Koppenploppen": [
    "*Squawk!* [Well yes, how could she not fall for me?] *Squawk!* [I offer her a life of luxury and my...exquisite...touch. What could you offer her?] *Squawk!* [A life of loneliness and destitution. She deserves better!]",
    "*Squawk!* [Oh well, it was fun while it lasted and there are plenty more birds in the sky!]"
  ],
  "Seagull": [
    "Squawk!SQUAWK!SQUAWK! [How dare you mention his name in my presence! That oversized pigeon stole my copy of 'Bird Spotting Monthly'!] Do you have any idea how long it will take to get another copy!][sic]",
    "SQUAWK!Squawk!Squawk! [YES! and[sic] all I have to occupy myself for that month is this view.]",
    "Squawk!Squawk! [I suppose, well I should be getting back to enjoying the view then.]",
    "*Squawk* [Oh of course, he's my boyfriend.]",
    "*Squark* [Don't be silly, he would never cheat on me. I'm beautiful.]",
    "*Squawk![sic] [That brute! That monster! He steals all the best bits of bread!] *Squawk![sic] [The rest of us just get scraps, or worse...the soggy bits!]",
    "*Squark![sic] [Oh don't you dare mention his name in my presence.] *Squark![sic] [He's awful. Terrible I tell you.] *Squark![sic] [When making tea he puts the milk in [first/second]!]",
    "*Squawk!* [He killed my brother!]",
    "*Squark![sic] [I mean I don't actually know, I can't prove anything.] *Squark![sic] [But you tell me how someone could just die from throwing themselves at knives?]",
    "*Squark![sic] [You're in league with him! CONSPIRACY!]",
    "Squawk squaw squawk. [Well, from your linear subjective viewpoint of the passage of time, yes.]"
  ],
  "Quartermaster Gally": [
    "Thank you for the help, but I think the bosun wants your help."
  ],
  "Lieutenant Crane": [
    "So they'll likely attack from the northern front, so if I sneak through the... Hello there. Can I help you? You don't seem to be part of my team and I really don't think you should be overhearing this. Perhaps I should cut your ears off, help make sure you don't listen in on people again, hrmm?",
    "Evie. Is she alright? I heard about her brother.",
    "I see. I can't just leave my station to fight the battles of deserters.",
    "It's always at stake. You think there's only one or two threats at a time? There are things, horrible things, always threatening to destroy life as we know it.",
    "... Oh.  Yeah, okay, that's a pretty big one.",
    "I...if I'm going to face something that will almost certainly kill me.[sic] I need to make sure my family is safe first. That they're taken care of. I know Evie understands the importance of family.",
    "I have a sister. Tessa. She is training to be one of the Kinshra at the fortress. I can't leave my station. Can you...can you check that she's alright?",
    "Against an ancient warped dragonkin that intends to obliterate the planet, yes. Yes I will.",
    "Ah a firey[sic] one. You're brave soldier, brave indeed. Your ears are safe for now, but you only get one free pass. Now, as you can see, I'm busy, what do you want?",
    "Yes, yes, excellent thinking. If you divert them there then they'll walk straight into the dragons.",
    "How monstrous. Delightful. I like the way you think soldier. A more twisted battle plan I could not have predicted. But I'm sure you have other reasons for coming to find me, other than these glorious tactical scenarios.",
    "If you can let me know that my sister is safe, my forces and I will join your fight.",
    "Did you find her?",
    "... HE'S DEAD! I'LL KILL HIM! I'LL CUT HIS TONGUE OUT AND CHOKE HIM WITH IT! She needs to be avenged. Get her out of there. I need her safe, then we're going to have a little...chat.",
    "...... I am the leader of a squad of elite black knights. I am an excellent judge of character and a renowned expert in torture. Are you sure this is the answer you want to give me, knowing full we I know that you're lying?",
    "That's a relief. Hopefully she will be joining my squadron soon. We shall show this dragonkin the might of the Crane's Black Knights!",
    "You better have a good reason for not smuggling my sister out yet!",
    "I shall see you soon, on the field of battle!",
    "Tessa will be fine, just needs best rest and then she will be joining me.",
    "Now we will remind Bletchley that strength comes from suffering and we shall give him quite the workout! Go get me Higgs. We're going to teach someone a Zamorakian lesson, she should be here for this.",
    "We need to go deal with the commandant, find him in the dining room and we'll meet you on the roof.",
    "Vengeance, it feels good doesn't it? Those wrongs all righted in a few sharp jabs to the kidneys. Don't feel any guilt or remorse for his death. He was a monster, the world is better without him. And by helping me kill him you have my support. I will gather my soldiers and I shall meet you at Daemonheim.",
    "We'll destroy the Ambassador and his slimy minions! Won't we men!",
    "You'll cut them down in bloody ribbons!",
    "For who will we do this?",
    "Why will we do this?",
    "Who will stop us?",
    "What is the only possible outcome?",
    "Don't worry about us, we're ready to take on the Ambassador's soldiers."
  ],
  "Fortress guard": [
    "I am not sure I know of a recruit by that name. Was she one of the recruits who failed the training?",
    "Well, Commandant Bletchley has been an earnest believer in 'seperating[sic] the calf from veal.' Not entirely sure what that means...",
    "It's up to the discretion of the commandant, though he has been unavailable for some time. You can check the transfer logs, let me just find them...",
    "I'd imagine it would be where most recent trainees were placed, in the barracks on the ground floor to the west.",
    "I'd imagine it would be where most recent trainees were placed, in the barracks on the ground floor facing the east."
  ],
  "Slave": [
    "...",
    "...",
    "...",
    "...",
    "...",
    "...",
    "...",
    "...",
    "...",
    "...",
    "...",
    "..."
  ],
  "Tessa": [
    "...",
    "...",
    "...",
    "...",
    "..."
  ],
  "Tessa, the Black Knight": [
    "...",
    "...",
    "...",
    "...",
    "...",
    "..."
  ],
  "Lieutenant York": [
    "Soldiers. What exactly are you doing talking to me when you should be standing at your post? There has been a problem with spies, infiltrators, and escapees...",
    "Captain. What exactly are you doing taking this soldier from their post?",
    "Of course not my lord! It's just that there has been a problem with spies, infiltrators, and escapees...",
    "And I have a feeling that Commandant Bletchley hasn't authorised anyone to leave this citadel soon.",
    "So tell me, what exactly are you doing?",
    "Oh. Yes, well given the rank of Lieutenant Crane, I can understand why you might be summoned.",
    "Though I still can't see as to why she would need another unranked soldier, as opposed to an officer.",
    "Tell me fellow black knight, why you should be chosen over me?",
    "Oh. Yes, well given the rank of Lieutenant Crane... I still can't see as to why she would need two soldiers like yourself...",
    "And I wasn't invited? Surely you two didn't have other alternative reasons for leaving now?",
    "I will leave you to it then."
  ],
  "Tessa's Armour": [
    "We were commanded to do what we do best. Instill fear and destruction across the countryside!",
    "YOU WILL LET US PASS!",
    "OR DO YOU DARE QUESTION THE WILL OF THE LORD OF CHAOS AND DEATH?! THE DARK LORD AND GOD OF DARK FIRE?",
    "..."
  ],
  "Crane": [
    "Is that you Tessa?",
    "I wasn't sure if I would see you again, when I heard about what happened...",
    "NO! I NEED A MEDIC HERE!",
    "I beg to differ.",
    "No. This is a simple organisational restructure.",
    "Now let's see what you are really made of. I think we'll start with your spleen!"
  ],
  "Commandant Bletchley": [
    "Why would I do that?",
    "That won't be necessary, I think I'll handle this personally.",
    "As your treason precedes you. We both know why I am actually here; to see to a deserter put in her place.",
    "I have the authority to do what is needed to bring greatness to the kinshra[sic], and ensure that the cattle we bring in here don't die at the end of a white knight's blade.",
    "I DID WHAT I HAD TO DO. If you want to come up here, question, then threaten me, go ahead! There are Saradominist fanatics just waiting for a chink in our armour, that they may tear down these walls and slaughter all of us. I have no need to explain my reasoning, especially to someone who has so clearly abandoned their post. Because either way, it simply comes down to the fact that you, and every recruit I've failed, haven't been able to handle the vast responsibility necessary to be a black knight.",
    "I did what I had to do. But why am I defending myself? You are nothing, just a deserter and you stand alone.",
    "YOU? But...but this is treason!",
    "NO! NO! AAAAAUUUUGGGHHH!"
  ],
  "Black Knight": [
    "Sir yes sir!",
    "By your command!",
    "For Zamorak!",
    "Because you've told us to!",
    "No one!",
    "We shall prevail!"
  ],
  "The following text is transcluded from Transcript": [
    "Mysterious lectern.",
    "Discarded pages.",
    "Armament log.",
    "Discarded scraps."
  ],
  "Congratulations! You have completed": [
    "'A Mini Shipment'. (Loot the trunk in the Temple of Aminishi.)"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Curse_of_the_Black_Stone?oldid=35843942’"
  ]
}