{
  "King's messenger": [
    "I take it you are Player? King Lathas sent this message for you. He's not a man you'd want to keep waiting.",
    "I have no business with you."
  ],
  "Player": [
    "I received your message my Liege. How may I serve the kingdom?",
    "Hi Koftik.",
    "Hello Koftik.",
    "I got pretty hurt getting here. These traps don't get any easier.",
    "Thanks Koftik.",
    "These traps don't get any easier. But I'm alright, thanks.",
    "Thank you Koftik, see you again soon.",
    "Yes, that's me.",
    "Hello, I'm Player. Your scouts said that I should come and see you.",
    "Thank you. I shall return, when my task is complete.",
    "Hello.",
    "Bye.",
    "Hello.",
    "No I'm Player. Lord Iorwerth said you may be able to help me.",
    "Well... err... No.",
    "Bye.",
    "Your scout refused to help, unless I take proof that you sent me.",
    "Hello.",
    "No I'm Player. Lord Iorwerth said you may be able to help me.",
    "I need to find Tyras and kill him. Do you know where his camp is?",
    "Can I help at all?",
    "What is?",
    "Bye.",
    "I've found no trace of him as yet.",
    "I'll take a look and see what I can find.",
    "I've found tracks leading off to the west. But they trail off into the trees. Beyond that I am unable to follow.",
    "Thanks... I'll see what I can find.",
    "Bye.",
    "Hello.",
    "Getting there.",
    "Bye.",
    "I think I just need to follow some tracks I found. Your scout showed me how.",
    "Hello.",
    "I have come across heavy resistance trying to follow some tracks from the old camp. I'm guessing I'm on the right path.",
    "No thanks.",
    "Hello.",
    "If you're a General can you help me meet the king?",
    "Is there no way I can see him?",
    "Not quite what I had in mind.",
    "Hello.",
    "How do I get an invitation?",
    "What's the chances of that?",
    "Hello.",
    "I found it a short distance west of here.",
    "Bye.",
    "Goodday my lord.",
    "I have tracked him down, but I've yet to deal with him.",
    "Yes my lord.",
    "I've finally tracked the brute down. His camp is in a secluded bit of forest, almost directly south of here.",
    "Hello.",
    "No but I'm working on it.",
    "I lost my copy of the Big Book o' Bangs.",
    "Thank you.",
    "Hello.",
    "Well thanks.",
    "Bye.",
    "Good day. I was hoping you could help me with a formula I found in a book.",
    "Oh dear, I don't seem to have it anymore. I hope Iorwerth has another copy.",
    "Good day. I was hoping you could help me with a formula from this book.",
    "Huh?",
    "What is naphtha and how do I make it?",
    "How do I use it?",
    "Is that all?",
    "What's quicklime?",
    "What's brimstone?",
    "This all looks too tricky, I'll leave it.",
    "Good day.",
    "I was wondering what you were doing out here?",
    "I can see how that would be distracting.",
    "Here, I cooked this for you.",
    "No problem.",
    "Hows[sic] it going?",
    "All right.",
    "Hello.",
    "What do you mean?",
    "Hello.",
    "Hello.",
    "You're not going home to Ardougne then?",
    "Evil?",
    "Hello.",
    "Yes I've finally dealt with Tyras, he should cause you no more problems.",
    "Bye.",
    "Lord Iorwerth, the deed is done.",
    "Thank you, my lord.",
    "Lord Iorwerth, I have lost the message for King Lathas.",
    "Thank you Lord Iorwerth.",
    "Yes, that's me?!?",
    "What do you mean?",
    "Well you seem to know everything else so I'll not lie. Yes.",
    "I had no idea!",
    "You want me to spy?!? OK what's in it for me?",
    "My lord, Tyras is dead!",
    "No I have nothing to corroborate this.",
    "I'll see what I can do",
    "Yes, I have a letter sent by Lord Iorwerth.",
    "Good day my lord."
  ],
  "King Lathas": [
    "Ahh.. Player. Yes... We have finally finished the work on the Well of Voyage. It is now time for us to move against my brother.",
    "I've managed to get a letter through to the elves that live to the west. They informed me that Tyras and his brigands are camped up in the woods to the South[sic] of their city. The elves have agreed to help, however they have their battles to fight. Unfortunately the men at arms I promised you are unavailable but I have faith that you'll get the job done. Finally and most importantly you must find an easy way to the west lands. We cannot use the well as a trade route, and certainly cannot move any bulk of troops through there. In short you must use the underpass to enter the west lands, kill my brother Tyras, find an easy route home and finally return back here, to report. And don't worry, you will be well rewarded.",
    "Ah... Player how goes your exploration? Any luck finding my brother in the west lands?",
    "What are you doing here then? I'm counting on you Player.",
    "This is grand news indeed! You'll forgive me if I'm a little apprehensive about this, but I take it you do have proof?",
    "I am sure you have done as you say, but on this matter I can afford no doubts. You must find something to confirm your story.",
    "Yes... Good... This will do nicely. Well done, You're really proving to be quite useful. I'll send word when I next require your services. Oh and I guess you'll be wanting your reward.",
    "Hello Player. I've got nothing for you right now."
  ],
  "Koftik": [
    "Hi - I found this cloth amongst the charred remains of some arrows, perhaps you need it?",
    "Hello Player. How's things?",
    "Nope, they don't.",
    "Here eat this, it should help.",
    "No problem.",
    "Good to hear.",
    "The magi have made all the reparations to the well of voyage... step into it when ready. You will be the first to use it this age.",
    "I hope so."
  ],
  "Idris": [
    "Halt human! What are you doing here?",
    "Shhhh.... What was that!?! What the......"
  ],
  "Morvran": [
    "Are you the human by the name of Player?"
  ],
  "Essyllt": [
    "Good... We have been expecting you. King Lathas sent word of your coming. You should speak with Lord Iorwerth. He will help you track down that brigand Tyras. You'll find his camp in the north west of the forest."
  ],
  "Lord Iorwerth": [
    "Ahh, Player. Welcome to Isafdar. I understand you've been sent here to rid us of that criminal Tyras. I offer my full support. Unfortunately all my troops are hunting down a group of renegade elves, but you should find one of our trackers by Tyras's old camp. He should be able to help you.",
    "The only help I can offer at this time is the use of a tracker. He can be found over the river to the south east. Good luck!",
    "Good day, Player. How may I help you now?",
    "Bless his loyalty but curse his suspicion. Here, he will recognise this:",
    "Just show him the pendant I gave you.",
    "Player, how goes your search? Any luck hunting down that brigand?",
    "I'm sure you will find something at his old camp that can help you.",
    "Good. Come find me when you've located the camp.",
    "Player, how goes your search? Any luck hunting down that brigand?",
    "Good. Come find me when you've located the camp.",
    "Player, how goes your search? Any luck hunting down that brigand?",
    "Good. Come find me when you've located the camp.",
    "Player! How goes your search? Any luck hunting down that brigand?",
    "Good job. I had a plan to destroy his camp, using the knowledge found in this book but before I had perfected any formula they moved camp. Here, you may find the book useful.",
    "Good day, Player. Have you yet found a way to rid us of Tyras?",
    "Good, we are running short of time.",
    "It's lucky I had a scribe make a few copies.",
    "Good good... One of my scouts just reported that they have seen his tent in a ball of flame. I'm sure you will want to get back to your king and tell him. He will undoubtedly want some proof. Give him this letter; it verifies that the job is done. He should trust me enough in this matter.",
    "You may use the pass through Arandar to return home. You'll find the start of the trail in the far north-east of the woods. I have ordered the guards there to let you pass the Arandar palisade.",
    "Here, have another copy, but don't let it fall into the wrong hands."
  ],
  "Elf Tracker": [
    "Human! you must be one of Tyras's men. I have no time for brigands or outlaws.",
    "Human! you must be one of Tyras's men....",
    "And you have something to prove this?",
    "As I was saying.... I have no time for brigands or outlaws.",
    "Human! you must be one of Tyras's men....",
    "And you have something to prove this?",
    "That's Lord Iorwerth's pendant. He must have a lot of faith in you. Now what is it I can help you with?",
    "Well this was his old camp. After the battle a few days ago they moved and now we're having trouble tracking him down.",
    "As it goes I'm not actually tracking them at the moment. This here is the best trace we've had on our renegade brethren.",
    "Ahh I guess you can't see with those human eyes. I tell you what. I'll continue to search here on the east side. You check out the west end of the camp. Come and tell me if you find anything.",
    "What is it I can help you with?",
    "These woods are a tangle of animal tracks and hidden paths. There's bound to be a way past. Look for things like flattened grass, broken twigs, disturbed leaf litter and such like. I'm sure now you know what you're looking for you will have no trouble following the tracks.",
    "How goes the hunt for that bandit camp?",
    "How goes the hunt for that bandit camp?",
    "I'm sure Lord Iorwerth will be pleased to hear that.",
    "How goes it?",
    "I take it that the huge explosion I just heard was you?",
    "This is good news indeed, Lord Iorwerth will be very happy to be told this."
  ],
  "Tyras guard": [
    "I see you making nice with that elf, traitor!",
    "Sorry, can't stop to talk, you should go to General Hining or the king who's in his tent.",
    "I remember you! You're the one who's working with them wicked elves. I will make you pay for that mistake.",
    "You'll have to kill me first.",
    "Good day, I'm busy guarding King Tyras. I have no time for idle chat.",
    "You cannot pass! These are the king's quarters. No one enters without invitation.",
    "If the king wants to see you he will ask for you.",
    "Absolutely none! Now let me get on with my job.",
    "Good day. Sorry I can't stop to talk. General Hining is keeping a tight watch.",
    "These are dark times, I must prepare for the coming battle.",
    "You cannot enter! This is now General Hining's pavilion. Since the king's death he has held us together.",
    "I wish I could. Just to see my wife, but if we don't stop the evil here, it will be too late!",
    "Soon Zamorak's fury will be released upon us."
  ],
  "Quartermaster": [
    "Good day Sir. I'm the quartermaster for King Tyras's camp. We have a little we could trade here. We should be getting a new stock soon. Would you like a look at what we do have now?"
  ],
  "General Hining": [
    "Yes, is there anything I can help with? I'm General of what's left of this army and I'm rather busy.",
    "The king will see no one. He can trust no one!",
    "In the coming battle he will stand between us and the end. Then you will see him.",
    "This is not a good place to be, go and prepare for the coming darkness.",
    "There is no great hero left to fight back the forces that face us now... Go, leave, prepare for the darkness. While you still have time!"
  ],
  "The following text is transcluded from Transcript": [
    "The Big Book of Bangs."
  ],
  "Chemist": [
    "A formula, you say? Show me the book.",
    "A formula, you say? Let me see that!",
    "Yes... yessss... Well, I guess you'll be wanting to use the old still.",
    "Well, you're going to need Naphtha, quicklime and brimstone.",
    "Well, to make naphtha you're going to need to distil tar of some kind. You can use my still outside, but it's not been used in a long time.",
    "It's quite simple really. You have to get the still heat up very high to make this fuel. But if it gets too hot it will burn out and you will have to start over. You must also watch the pressure, if it gets too high you will also have to start over. There are valves to control pressure and tar flow. These will also affect the heat of the still.",
    "You'll also need plenty of coal to keep the still hot.",
    "Quicklime is usually made by the thermal decomposition of limestone. When it gets really hot it glows like the sun. It's also extremely caustic.",
    "I've never seen it in the quantities this formula talks of but it's a yellow powdery formation. Much more than that I don't know."
  ],
  "Tyras guard [catapult]": [
    "Yeah what ya want?",
    "I was just wondering what I was doing here too. I'm meant to be looking after this catapult but I can't keep my mind on the job. We've been living off field rations for almost a year now. I keep seeing rabbits in this forest. What I wouldn't give to eat one, but I'm not quick enough to kill any and I'm no good with a bow.",
    "You cooked me a rabbit! Thanks a lot. You don't mind watching things while I take 5 to eat it, do you?",
    "This is delicious, after a year of field rations. Give us a minute to finish it off.",
    "This rabbit is lovely. Thanks a lot..."
  ],
  "Arianwyn": [
    "Are you the human by the name Player?",
    "Thank Seren, maybe all is not yet lost.",
    "It was you that murdered King Tyras, do not bother to deny it, I was watching. There is much to explain and little time. You carry a message from Lord Iorwerth do you not.",
    "Good, we understand each other well. Now hand it here and find the truth of who your real employer is.",
    "There is still a chance to stop this. But we must be careful, or they will push their plans forward and act before we're ready. Give the message to King Lathas, He will not see my little spell. Act like nothing unusual happened. You're going to be our man on the inside.",
    "How can I put this... This isn't a struggle for land or title. It is a war for life, all life. If the gate to Zamoraks[sic] world is opened we all die. Deliver your message, act normal. We'll be in touch."
  ],
  "Congratulations! You have completed": [
    "'Regicide' - Complete this Master quest."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Regicide?oldid=36114936’"
  ]
}