{
  "Chief Tess": [
    "You want discuss da resort or ar-key-olo-gy?",
    "What you want, skinny creature? We not open yet.",
    "Nope, not open until dat other human say we ready.",
    "Yeah, de bossy one in de bank. She say there is lot to do before we can open, so we not open. Which bring me back to question: what you want, human?",
    "Well, it long story. See, dis lady human come to Oo'glog. She look around village a little, got very excited, then start talking at me very fast. Started asking for many things.",
    "Dat woman, she very confusing, very bossy. Says lots but make no sense. Hard to understand. All I know is I agree to help her in thing she call 'business venture'.",
    "I know, I know. It such a mess - cause so much trouble, me not know what to do. I not even know what a 'business venture' looks like.",
    "Uh, when you put it dat way, it sound less good. But de lady say dat many creatures give us lots of shiny pretties to sit in de pools and mud of Oo'glog! She go on about dis 'business plan' thing - she say it guarantee shiny pretties for everyone if we help her.",
    "Well, it sound good at de time... She talk very fast and sound very sure about de shiny pretties. Besides, me had to agree - it was only way to make her stop talking.",
    "That just the problem. Human lady say much stuffs need be done before everything is ready for customer. We try to help, but, thing is, we no can understand what she wants. We still have to listen to her nonsense talking, and there be no shiny pretties yet for anybody.",
    "Dat so very nice of you, skinny creature. Can you go talk to bossy lady at de bank - see what she want? Maybe human have better chance than ogre of understanding her.",
    "She at de new bank, just south of here.",
    "Anything else?",
    "You in Oo'glog, human! Biggest and best ogre camp dis side of de Feldip Hills. Anything else?",
    "Me Chief Tess, chief of Oo'glog. Dis head thing a hunting trophy. I best hunter in tribe, you know. Anything else?",
    "Oh, yeah, dat's Dawg. You no worry - she only eat people when me tell her to.",
    "You want discuss da resort or ar-key-olo-gy?",
    "Hello, again, human. What you want now?",
    "You want discuss da resort or ar-key-olo-gy?",
    "How goes it, human?",
    "Dat good. Not sure I want lots of little, puny creatures running around Oo'glog if they all dat confusing. Anything else?",
    "You want discuss da resort or ar-key-olo-gy?",
    "Sure, human. What you want to know?",
    "Ah, me understand. You not know ogre way of hunting with smoke.",
    "No, dat not what I meant at all.",
    "Ancestors have been hunting here for many, many ages, so de creatures around here very smart about hunters. Dey know to avoid traps. Hunter must be extra sneaksy to attract de creatures.",
    "Yeah. To catch creatures, you must attract dem with something they like very much.",
    "Bait helpful, but it not enough. Me told you, de creatures here very clever. So here's what you do: You need to burn something with smell dat dey like. You burn de right thing, dey follow you. Dat way, you can leads dem to de traps.",
    "Yes, but not big fires. You need to burn de stuffs slowly, carefully and hold de smouldering stuffs up high so you can lead de creatures to de traps. It difficult. Stuffs burn away quick-like and you needs to hold it carefully to keep it lit.",
    "First thing about diseased kebbits, dey can give you disease.",
    "I just warning you. If you no want to pay attention, fine.",
    "So, they carry disease but they shy. And dumb. Real dumb.",
    "Why you talk of pots? You not want to talk of kebbits after all?",
    "Look, all I say is dat diseased kebbit generally leave you alone. Dey gets more aggressive, though, when you burn de tansymum. Much more likely to bite if dey smell burning tansymum.",
    "If you want make diseased kebbit follow you, burn fever grass. Dey love fever grass. Love de smell, love de taste, love everything about it. You can even use it to bait de deadfall traps - dey eat it right up.",
    "Anything else you want to know, human?",
    "Heh, well, me always here if you no have any luck.",
    "Wimpy birds like smell of tansymum burning - dey follow it anywheres. Dey not so much like fever grass burning. It scare dem off.",
    "You watch out if you burn lavender near de wimpy birds - dey may be little, but dey have mighty peck.",
    "Anyting else you want to know, human?",
    "First thing first: you need box trap to catch de platypus. You no harm platypus, or you make ogres very angry, you understand?",
    "Good, that okay then.",
    "You no interrupt just yet. Me speaking.",
    "You no listen very well, do you, human? Anyway, platypus a bit shy. You need encourage them by burning lavender. Dey like de sweet smell.",
    "Me not finished yet! Human should remember dis: platypus feel threatened when dey smell burning fever grass. When platypus feel threatened, it likely to attack. It attack with poison spurs on back foot.",
    "You not believe me? Try it out and see. Just don't come running when you meet webbed feet of doom!",
    "Anything else you want to know, human?",
    "Ah, it long and interesting story. It go back to the days of my mother's mother's mother's... mother's mother's mother's, um, mother's... Well, it was long time ago, anyway.",
    "Dat's it! Human interrupt too much. If human going to be dat way, I not tell de story!",
    "No. Maybe I tell you later, when I calm down.",
    "No, I too angry now to tell it right.",
    "NO!",
    "GRRRRAH! NO!",
    "Little flat-feets like the bank by the sea to de east, inside gates of Oo'glog. De place has burrows on de shore an' platypus reeds in de shallows. It their favourite fishing spot.",
    "We no can look after platypus dat far away. De little flat-feets are protected here. We make sure no one set box trap near de platypus burrows.",
    "Human, shush! Me still talking! Now, if you take platypus to de ocean and release dem near de water, dey very, very happy little critters. Dey often do bit of fishing for you in return.",
    "Just try; you see. Release platypus on ocean shore, near reeds. You see what happens then.",
    "You walk around outside gate of Oo'glog - you find everything you need growing nearby.",
    "You want discuss da resort or ar-key-olo-gy?",
    "Really? Me never thought small creature like you could hunt like ogres. You should go tell Balnea-lady dat all pools are clear now."
  ],
  "Player": [
    "Hello, there.",
    "Not open?",
    "Other human?",
    "What exactly is going on around here?",
    "What did she want?",
    "You what?",
    "So, about this 'business venture' - let me get this straight. Some woman shows up out of nowhere, talks to you for a while and you agree to help her with some random plan of hers, without having any idea what she's talking about?",
    "And you...believed this, did you?",
    "So, when are you going to get these shiny pretties, then?",
    "Can I help at all?",
    "I'd be happy to.",
    "Where exactly is this bossy lady?",
    "Thanks. I'll go see what I can do.",
    "Where exactly am I?",
    "Who are you and what's that thing on your head?",
    "Bye! Do you know there's a larupia loose in this hut?",
    "That's a relief...I think.",
    "Bye!",
    "Hi, there. My name is Player and I've just been talking to Chief Tess. I have no idea what's going on, but I get the feeling that there are some, um, communication difficulties between you and the chief?",
    "Um, yes. So, what's going on around here?",
    "Can you what now?",
    "Are you feeling okay?",
    "And I'll feel better when I quit talking to you. So, that's what I'm going to do. Right now.",
    "What's the problem?",
    "Who's upper management?",
    "Ah, of course.",
    "So, why are you telling me all this?",
    "Can you try to make some sense, please?",
    "Nope, sorry, still not following.",
    "You're just making up a lot of words that don't mean anything at all, aren't you?",
    "Okay, I'll bite. Tell me more.",
    "But of course! I won't tell a soul - cross my heart, and all that.",
    "So what did you do?",
    "And this helped, did it?",
    "Hunting? You? You hardly look the type.",
    "I am somewhat alarmed by the way you're licking your lips.",
    "Riiiiight...",
    "What's that?",
    "Yeah, they're pretty hard to miss.",
    "Like what?",
    "Oh, I see! Or rather, I don't see. What's this have to do with me?",
    "But...have you looked around? There's nothing here but a lot of nasty bugs and surly ogres.",
    "I can see how that might be problematic.",
    "So, the ogres are helping you out, are they?",
    "Right, okay. So, you want someone to boss around, doing all the difficult stuff, while you sit around and 'supervise'. Is that the deal?",
    "What's in this for me, then?",
    "That sounds fair, count me in.",
    "Okay, so now we have all the chit-chat over with, what needs to be done first?",
    "Catering? Please tell me you're not going to teach ogres how to bake crunchies, or something.",
    "What are you planning, then? A nice little tavern like your father's - a friendly atmosphere, good beer and maybe some food on the side?",
    "Ogre cocktails with pool-side service?",
    "A little restaurant offering light bites and refreshments?",
    "What do you have in mind, then?",
    "Ah, right. And you think this will go over well, do you?",
    "Oh, it's sounding better and better.",
    "Sure thing.",
    "Yeah, sure. Here's hoping this Chargurr is a better conversationalist than some around here.",
    "Oh, nothing.",
    "Actually, I'm not sure I want to be involved with this anymore.",
    "Hey, you've got a legal team of ogres who can't even set up a spitroast by themselves!",
    "I'd rather fill my bank with cabbages.",
    "Shame on you! Don't you feel bad about exploiting these ogres for your own financial gain?",
    "Huh. I'll have to think about that.",
    "Actually, I'm a bit of a blabbermouth. I wouldn't trust me much farther than you could throw me.",
    "Likewise!",
    "Sorry, when you talk my brain hurts.",
    "Oh, I'll take my chances, thanks.",
    "And you are...?",
    "That's quite a name.",
    "I see.",
    "You look a bit stressed, you know.",
    "So, what's the problem, exactly?",
    "So, you were telling me about a business proposition you had in mind?",
    "Yeah. So, you want someone to boss around who will do all the difficult stuff while you sit around and 'supervise'. Is that the deal?",
    "I see what you mean about Balnea! Just for the record, I'd like to state that she is not representative of our species.",
    "It's probably for the best. My bones would stick in the teeth, you see.",
    "Um, no, actually. All I see is a big pit of char.",
    "Look, if it's that big of a deal, I can just bring you some logs and a tinderbox.",
    "Right. So what are you saying?",
    "I think I could get that stuff for you. What do you need?",
    "Okay, I'll bring you some logs then. How many do you need?",
    "Um, I've 8 fingers and 2 thumbs...",
    "I've 10 toes, last I counted.",
    "Right, let me get this straight: you want 8 achey tree logs and 10 eucalyptus logs?",
    "I can think of nothing I'd rather do than collect dead trees for you.",
    "I don't suppose you know how many spears and birds you'll want?",
    "Sorry, I'm pretty busy right now.",
    "What stuff did you need again?",
    "Ah, right. You need 8 achey tree logs an' 10 eucalyptus logs. I'm on it.",
    "I've brought some of the logs you need.",
    "Okay, I'll be back soon.",
    "I've brought the logs you need.",
    "Sure thing!",
    "Yeah, so I'm a little confused by this. Aren't spits a little more suited to your purpose?",
    "Get your own spears!",
    "Fine, I'll get some spears for you. How many do you need?",
    "Look, I don't have all day. How about I just bring you 4 and you can see how you get on.",
    "Four, as in 1, 2, 3, 4. It's the number of, um, eyes you'd have if you had, uh, two more eyes.",
    "Okay, will do. Glad to have that sorted. Any idea how many chompies you'll want?",
    "What was I supposed to be doing?",
    "Yeah, you could continue talking nonsense, or you could tell me what I should be doing so I can get on with it.",
    "Thanks - that's what I needed to know.",
    "Uh, things are advancing all over the place.",
    "Yeah, I'll do that.",
    "I'm afraid I don't have any spears for you yet.",
    "How many spears did you want? I forgot.",
    "Gotcha. Now, while we're at it, any idea of how many chompies you'll want?",
    "I'm afraid I don't have all 4 of them yet.",
    "I've got some spears right here.",
    "I've got the spears right here.",
    "Um, actually, I'd like to keep hold of my spears after all.",
    "No problem.",
    "Look, I'm really tired of fetching things for you.",
    "NO!",
    "Well, alright then. How many do you need?",
    "...Yes?",
    "Two. I have two eyes.",
    "Okay, sure. Two chompy birds, coming right up.",
    "Not yet; how many did you want, again?",
    "Oh, that's right. Don't worry, I'll be back with your 2 chompy birds in a jiffy.",
    "You don't happen to take banknotes, do you?",
    "I've made a start but I don't have all of them yet.",
    "Okay, I'll be back with your 2 chompy birds before you know it.",
    "Sure do! Shall I put 'em up for you?",
    "Why was I afraid you were going to say that?",
    "Okay, I've fetched your logs, got your spears and brought you some raw chompies. I suppose you'll want something else, now?",
    "That's all?",
    "Alright, then. That I can do.",
    "The fire's all lit and ready to go.",
    "Thanks, um, I think. Anything else you need?",
    "Somehow, that doesn't surprise me. I'll go speak to Balnea then.",
    "Thanks, I'll keep that in mind.",
    "Thanks, I'll keep that in mind.",
    "The cooking fire is lit and the chompies are roasting away.",
    "You need me to...what now?",
    "When you speak, it makes me distressed and confused.",
    "Gah! I don't know what you're saying to me. Just tell me what you want doing.",
    "Okay. Let's make this simple. Who do you want me to see?",
    "No cofunctioning! Give me the name!",
    "Not her title - her name!",
    "That's better! So, you want me to have a chat with Snurgh to see what mess she's made of things?",
    "Right-ho. I'll go and see Snurgh at the hotel and 'transition' away.",
    "Yeah, uh, I'll be sure to do that.",
    "I'm sorry, I can't possibly help someone who uses the word 'positivewise'.",
    "I don't have a clue what disintermediation is, but it sure sounds a lot better than standing here listening to you.",
    "Um, I'm getting to it. I'm still, uh, time-planning.",
    "Yeah, uh...I'm gonna pop over to this 'hotel' thing and talk to Snurgh soon, if that's what you mean.",
    "I heard you may need a bit of help?",
    "Um, doesn't that smell a bit in the morning?",
    "Riiiight. So, for those of us who don't like to start the morning with a faceful of rotting flesh, have you thought about making some pillows from, oh, say, FEATHERS? I know it's a radical idea.",
    "Sure, I'll bring you some feathers. I dread to ask this, but how many do you need?",
    "I knew a simple answer would be too much to ask. I'll bring you 8 and see how that suits. Does that work for you?",
    "You want feathers from a tropical wagtail? Why can't you use any old feathers?",
    "I see I'll be getting nowhere fast with this line of questioning.",
    "Can't you get them yourself?",
    "Oh, of course. Why do I even bother asking?",
    "Hold your horses! I'm on it.",
    "I don't have any stripy feathers, but I've got some others that you could have.",
    "But-",
    "I've made a start, but I don't have all 8 yet.",
    "I've got some other feathers you can have, if that would help.",
    "As a matter of fact, I do.",
    "Glad to help. Anything else you need?",
    "I...think I'm alright, thanks. I should probably touch base with Balnea and let her know you're sorted.",
    "I...think I'm alright, thanks. I should probably touch base with Balnea and let her know you're sorted.",
    "Glad to help. Good luck finishing them up!",
    "You'll be happy to hear that I've sorted out the 'hotel facilities', such as they are. We decided to go with-",
    "Don't you want to know what the problem actually was? Or how we solved it?",
    "Which means what, exactly?",
    "You need me to go to the salon, right?",
    "Yeah, sure, I'll go to the salon.",
    "You wouldn't want me to talk to a hairdresser, would you?",
    "Yeah, sure. That's exactly what you said.",
    "I think I'd like to 'actualize' my departure from this conversation now.",
    "And some would say you need to synergize your bottom-line core lingual competency and do a bit of customer-focused relanguaging. Eep! Where did that come from? What did I just say?",
    "Is there any way to have this conversation without you talking?",
    "That's sooooo much better!",
    "Quite!",
    "You know, certain whales are small enough to fit in the palm of your hand.",
    "It's true, actually. They're quite small, and they're rather cute, I hear.",
    "Great! Glad we had this conversation.",
    "Um, if you're asking me if I've sorted things out with the hairdresser then I haven't yet.",
    "I don't know, how *do* you do hair with no tools?",
    "That's a pretty poor joke.",
    "Ah, I see. So, might I surmise that you need me to get some things for you?",
    "Of course not; I was just asking so that I could wind you up!",
    "Um, I think all my hairdressing needs are being met at present, but thank you for the offer.",
    "Why, sure, I'd be happy to help.",
    "Um, eek!",
    "Lup-lup furses? Do you mean spined larupia fur?",
    "Right... Okay, wolf bones and spined larupia fur. How many of each?",
    "But, can't you just give me an idea of how many you need?",
    "Alright, fine; 4 wolf bones and 8 spined larupia furs, coming up.",
    "I've made a start, but I don't have everything yet.",
    "You're right; how silly of me to think that you would find it convenient to have a partial delivery, before collecting the rest of your order.",
    "Okay.",
    "You don't happen to take banknotes, do you?",
    "I'll take that as a no then.",
    "I've got everything right here.",
    "You sure can!",
    "Glad to help. Anything else you ogresses need around here?",
    "Great, I'll do that.",
    "You sure can't!",
    "Aw, that must be so dismal for you.",
    "I've sorted out the problems they were having at the salon. Turns out, all they needed were some bones and fur.",
    "I'm listening, but I'm not sure I'm liking this.",
    "Whatever you're talking about is going to be terribly unpleasant, isn't it?",
    "You mean I should go check out the smelly old huts to the north-east and see if I can find an old ogre lady about some bugs?",
    "Points deducted from what?",
    "Riiiiight. Look, how about we pretend this conversation never happened and I just go talk to Seegud, okay?",
    "Wait, what was I supposed to be doing exactly?",
    "Ah, yes, those bugs. Right, I'll go, um, do something proactive.",
    "Not quite yet.",
    "I don't get paid enough for this kind of treatment. Wait a minute, I don't get that at all. Weird.",
    "So, Balnea tells me you know how to get rid of those annoying insects hovering around the pools?",
    "Yes, well, we're generally smart enough to not build our towns in the middle of insect-infested mud pits.",
    "Yeah, okay, so ogres are tough and wonderfully bug- proof; humans are soft little bundles of insect bait.",
    "Great. So, how do I get rid of these pesky little things?",
    "All the bugs look pretty much the same to me.",
    "What do you mean?",
    "How do I know what to burn?",
    "Piles of stones?",
    "So, what stones stand for what material?",
    "Okay, I think I've got that. I'll go look for these piles of stones and start some fires.",
    "Could you please remind me what items go with which rock?",
    "I probably shouldn't add items that aren't on Seegud's list.",
    "How strange! I followed Seegud's instructions perfectly, but something isn't right.",
    "Hmm, suspicious. Perhaps I should talk to Seegud and see if she knows what's going on.",
    "There seems to be something wrong. I tried to start the fire as you suggested, but it didn't work and those little ogre children are acting rather suspiciously.",
    "Yes, I'm sure you were. That hardly helps us now, though, does it?",
    "So, what's the bottom line, here?",
    "So, can you remember what materials had to be burnt at each pool? If you could just tell me what needs burning where, I could build the fires.",
    "You don't remember what went where? This is hopeless! I can't try every combination of materials with each fire pit and just hope one of them works!",
    "So, what are you thinking?",
    "Ah, I see! If they've just switched what stone represents which item, I just need to figure out what each stone means now!",
    "Oh, I'm doing okay, I guess.",
    "Yup, just okay.",
    "I think I'm a little stuck. Can you help me at all?",
    "I think I'm a little stuck. Can you explain what I should be doing again?",
    "Yes. Each different rock corresponds to something that needed to be put on the fire.",
    "Yeah, and I tried your scheme. It didn't work and those little ogre children started giggling in the most unhelpful way.",
    "So, all I need to do is figure out which rock stands for which item that needs to be put on the fire. But how will I know I'm right?",
    "Oh, yeah, of course.",
    "That doesn't help at all!",
    "Oh, that is helpful! Thank you.",
    "What are the different items that can be burned to repel insects?",
    "Excellent. Thanks.",
    "Yeah, hi. Say, something seems to be wrong with the rocks Seegud left by the fire pits. You wouldn't be able to help me out, would you?",
    "Oh, thank you. Veeeeerrrrry helpful.",
    "Yeah, hi. Say, something seems to be wrong with the rocks Seegud left by the fire pits. You wouldn't be able to help me out, would you?",
    "Which one is the thermal bath?",
    "Thanks. I'll get right on it.",
    "I've sorted out that insect problem for you.",
    "That sounds like a good idea.",
    "Will do. Thanks for your help.",
    "That sounds like a good idea.",
    "I've sorted out the insect problem. Seegud says it's under control and she can organise the childs-, um, children to keep the fires lit.",
    "Wow, you almost sounded human there for a moment.",
    "I was afraid of that.",
    "So, when's the big opening?",
    "What's that, then?",
    "Sure, anything to avoid talking to you for a while.",
    "Yeah, probably best all around. Anyway, what do I need to do?",
    "Sounds simple enough.",
    "Intriguing... I'll go speak to Chief Tess, then.",
    "Wait; I thought you were supposed to be a great hunter?",
    "I must say, you're not encouraging me to volunteer for this project.",
    "Payroll department? Your ogres don't even understand the concept of counting yet! You don't have a payroll department!",
    "Oh, good. You do that.",
    "I'm afraid I just can't be bothered right now.",
    "What contract? I don't remember any contract!",
    "Wait, what are you trying to pull?",
    "What was I doing for you, again?",
    "Hi there. Balnea said you might be able to help me out.",
    "Apparently, I need to relocate a family of platypodes and get rid of some diseased kebbits and wimpy birds that are living around the pools.",
    "You're right. I have no idea what you're talking about.",
    "Extra sneaksy?",
    "Oh, I already know about baiting traps. I'm an experienced Hunter, I am!",
    "You mean I need to start more fires?",
    "Okay, so I need to smoulder certain 'stuffs' in order to lure these creatures to my traps.",
    "How do I catch diseased kebbits?",
    "The name gives nothing away.",
    "Sorry. Do please go on.",
    "Hello, pot, this is kettle speaking.",
    "No, really, I'm sorry. I don't know what came over me.",
    "So, what do they like?",
    "That's good to know. Thanks.",
    "Nothing else at the moment, thank you.",
    "How do I catch wimpy birds?",
    "Got it.",
    "Got it.",
    "How do I catch platypodes?",
    "Don't worry; I'm just supposed to move them, not hurt them.",
    "Out of curiousity, why-",
    "Sorry.",
    "Platypodes like lavender. Check. Now, why do-",
    "Now you're making things up.",
    "I can't believe I'm having this conversation.",
    "So, why are ogres so protective of platypodes?",
    "Yeah, I got that.",
    "Aw, please? I'll be as quiet as a mouse until you're done.",
    "Pretty please?",
    "Pretty please with sugar on top?",
    "Pretty please with sugar on top and a cherry for good measure?",
    "Fine. Be that way. I'm sure it was a stupid story anyway.",
    "Where should I release the platypodes?",
    "What's wrong with the beaches to the south?",
    "Why don't you allow-?",
    "What?",
    "Where can I find these smoulderable stuffs?",
    "I've caught all of the wimpy birds and diseased kebbits, and I've relocated the entire platypus family that was living by the pools to the east.",
    "I've trapped the birds, squashed the diseased kebbits and relocated the lovely little family of platypodes.",
    "So when's the big opening?",
    "All the right people? Like who?",
    "Hey, look, that's your department. Just let me know when you're up-and-running and I'll pop by for a swim.",
    "Yeah, yeah. So. when[sic] can I try out these pools?",
    "Will do.",
    "Thanks!"
  ],
  "Balnea": [
    "Oh, thank goodness - another proactive, forward-thinking human! I can't tell you how happy I am to make the acquaintance of someone who is on my wavelength!",
    "Look, there's lots to do around here and I could really use a hand. You seem like a mover and shaker - can I run an idea up the flagpole?",
    "Can we have a quick mindstorm together? I have a proposition.",
    "Well, I'll feel better when we have a firm grasp of incentivizing the hospitality market, but a couple of setbacks have cropped up.",
    "The bottom line is that upper management is a bit overstretched at the moment.",
    "Me.",
    "See, we don't have the human resources we need to get this place up-and-running and ready for business. I've acquired a number of ogre resources but, unfortunately, their core skills and customer focus leave, well, much to be desired.",
    "Let me level with you: I need someone who can big-picture an organic growth solution around here - someone who can envisioneer the way forward. Can you bring it to the table and make it happen?",
    "Are you on board? Can you take it to the next level?",
    "Look, we need someone to go forward with this and synergize the next stage in our targeted hospitality development plan.",
    "Not at all! We've moved the goalposts and it's time to make it pop. Are you ready to be a key player? We'd love to welcome you to the team.",
    "This is all in the strictest confidence, mind you - can I count on your discretion?",
    "Excellent. So, here's the deal. I used to work at my father's tavern in Yanille. It's a...viable business, but he's hardly a visionary when it comes to expansion and franchise. My father missed so many chances to actualize his opportunities, it was unreal. No matter how much I pushed or how much I tried, I couldn't even get him to consider implementing a basic marketing strategy. When he refused to let me institute a beer-pulling mentorship programme, it was the last straw. I realized that if I didn't find some release for my frustration, I'd end up a raging sociopath.",
    "I took a holiday!",
    "Oooohhhh, yes. I gathered up all my things and went on an extended hunting expedition.",
    "Oh, there's nothing I enjoy more than tracking and trapping small, defenseless creatures or matching wits and strength against the larger, more clever ones. Relentlessly following one's prey and slowly luring it to its ultimate demise is so...very...gratifying.",
    "Nonsense. It's just a matter of exercising good business practice: one needs to annihilate one's competitors without hesitancy or compassion.",
    "So, anyway, I came upon this encampment of ogresses when I was out on my hunting trip. It may be a bit crude and primitive, but they've got an amazing thing going for them.",
    "Have you seen those pools and springs around the place?",
    "Well, they have some pretty amazing properties.",
    "When you bathe in the waters, they have all manner of benefits to one's health and performance.",
    "Don't you get it? I'm offering you a chance to get in on the ground floor of what's sure to be the biggest new marketing opportunity this side of the River Lum! This place has the potential to be the ultimate holiday destination - a spa where everyone can come to relax, get away from it all and take to the waters!",
    "Oh, that's nothing some good project management can't fix. With a little imagineering and some nose-to-the-grindstone developmentation, I'm convinced we can transform this place into the most luxurious of resorts.",
    "Now, I'm an expert at supervisory administration, but these ogres require more hands-on training than I'd initially time-costed. I'm up to my ears in customer relations training and, well, it's HARD to teach those bankers that it's bad form to club a client over the head and take their stuff.",
    "What I really need is someone at the frontline. Someone who can interface between me and the ogres who have signed on to help out in this enterprize.",
    "But of course. These ladies like 'shiny pretties' just as much as the next.",
    "Yeah, that about sums it up.",
    "Oh, a man after my own heart. Well, look - there are several outstanding issues that need sorting before we can open to the public. If you can help out until the spa opens then you can have free access to all the spa facilities.",
    "Excellent! Glad to have you on board. Feel free to use the bank if you think it would pool your resources more effectively. I can't guarantee good customer service, but they won't lose your things.",
    "I'm so glad you asked! Our first target is to establish the catering facilities.",
    "No, no. I'm afraid our concessionary services will be a bit more...basic.",
    "A little simpler than that, I'm afraid.",
    "Um, not quite that either.",
    "Uh, no.",
    "Actually, I'll feel like we're doing well if we can get our chef outfitted with a spit and cooking fire.",
    "I'm hoping the rustic charm will compensate for the risk of food poisoning.",
    "So, can you go talk to Chargurr and see if you can set her up with the basics? I don't think much progress has been made on that front.",
    "Thank you so much, Player, and good luck; the ball's now in your court. I'm sure, with a little proactivity, you'll effect a big-win solution.",
    "Sorry, I missed that...",
    "Hey, we've got a verbal contract.",
    "Point taken.",
    "Look, you can find that out for yourself, once the spa is open for business. I really don't have time for this. Either you're interested or you're not. Which is it?",
    "Suit yourself. But, just for the record, don't expect an Oo'glog holiday to be cheap.",
    "Not really. They weren't developing the area before I came along. This way: I get rich, they get some shiny pretties to carry around with them, and the rest of Gielinor gets a lovely holiday destination.",
    "Ah, right! Uh, well, it was nice meeting you.",
    "You're never going to get ahead in this world with that kind of attitude!",
    "My name is Balnea Thermaenni Caldarium.",
    "I'm quite a person.",
    "Well, I'll feel better when we have a firm grasp of incentivizing the hospitality market, but a couple of setbacks have cropped up.",
    "So, have you thought about that offer I made?",
    "Have you managed to advance the agenda at the cooking facilities yet?",
    "Frankly, I'm disappointed in your self-management. I was hoping you'd take more initiative. The early bird catches the worm, there aren't enough low-hanging grapes for everyone in this world and the sky's your oyster!",
    "You're supposed to be helping Chargurr set up the cooking fire. She's the ogre chef just to the north.",
    "Good, good. Make sure you keep me in the loop. As soon as you're finished with Chargurr, let me know so we can lay this to bed and I can pass you the next baton.",
    "Excellent! That's way much more better. I now need you to go and interface with the manager of the hotel facilities to see what you can bring to the table in terms of advancing the relevant relaxation technologies there.",
    "Oh, I'm not saying it's going to be easy. As things stand, we're driving head-long into a negative growth situation and it's going to require some real blue-sky thinking to pull us out of it.",
    "So, can I count on you to take ownership of this opportunity and provide a proactive solution that will help us make it happen?",
    "Do I need to spell it out again? Just talk to the hotel manager and close the loop, so we can transition this scenario.",
    "I've just told you. We need to cofunction with-",
    "She's the manager of the hotel facilities and-",
    "Snurgh. Her name is Snurgh.",
    "Essentially, yes. Although, I would prefer to view it as making a positivewise transition.",
    "Brilliant! Be sure to keep me up-to-date with your hospitality solutions.",
    "Well, okay then, but I suggest you rethink your options if you don't want to be disintermediated.",
    "Have you made any progress on the issue at the hotel?",
    "Excellent. Well, I hope you're moving into the realization stage. I'm looking forward to what you come up with in dialogue with hospitality management.",
    "Great news.",
    "Oh, excellent! I'm happy to hear that you facilitated the delivery of a customer-centric solution to a mission-critical situation.",
    "Oh, no, that won't be necessary. You've stepped up to the plate and delivered a home-run resolution. No need to dwell on what's passed when there are new challenges that require some bread-and-butter solutioneering.",
    "As I understand it, there's an issue around the salon's core assets. We need to lever this win-win value proposition into a concrete deliverable.",
    "I'm hoping you'll take the initiative, break through the clutter and actualize some result-driven outcomes.",
    "Excellent. You'll need to talk to Kringk, our stress-management engineer. I believe she's having some difficulties solidifying her assets.",
    "Isn't that what I just said?",
    "Some would say you need to incentivize an attitude refocus, you know.",
    "...",
    "What are you saying to me? I appreciate your efforts to think outside the box, but isn't this a bit of a context switch?",
    "Okay...",
    "How progresses your strategizing with Kringk? Have you managed to fast-track a gold star result yet?",
    "Well, get on it, then! We're depending on you to manage your lifeworld and get us through this functionality freeze.",
    "I see. Well, now that you've proven yourself on the frontlines, I have a bigger project for you. Hopefully, this one will seem like much less of an exercise in box-ticking.",
    "Oh, it's a wonderful opportunity. It will give you the chance to innovate your own front-end methodologies. The envelope is ready to be pushed into a whole new solutioneering paradigm.",
    "You'll need to have a one-on-one mindshare with Seegud. She's based just north-east of here. You'll know her when you see her; she's a bit eccentric but very experienced and backgrounded. She'll introduce you to the insect management project.",
    "Yeeees, though I would encourage you to work on your languaging, unless you want points deducted for poor professionalism.",
    "Uhhhm, you know...the big collection of points you'd have, um, if they weren't being deducted.",
    "That's very generous of you.",
    "Have you successfully managed the insect situation?",
    "You need to coordinate with Seegud and come up with a workable solution to these horrible insect infestations around the spa pools.",
    "Well, hop to it! Apply yourself. With your skill-set, I expect results.",
    "Fabulous! That's a load off my mind. Those pools were completely unuseable thanks to those horrid insects.",
    "Don't worry. It'll pass.",
    "Well, unfortunately, there's still one last outstanding matter.",
    "There are some creatures wandering around Oo'glog that are making themselves quite a nuisance. We're going to have to hunt them down. We simply can't have our guests bathing near poisonous, disease-ridden pests. You look like you may be a decent enough hunter to accelerate this action point. Would you mind doing a bit of trapping?",
    "I'll pretend I didn't hear that.",
    "There are several creatures that we need to deal with. First, there are some diseased kebbits. You'll need to watch out for their bite - they're rather pestiferous. Then there are some birds that the ogres call 'wimpy birds'. They're not too much of a problem, unless you make them mad; they have a rather mean peck when they're angry. Finally, there's a little family of platypodes just to the north that need moving to a different location. They generally mind their own business, but they're poisonous, so do watch out.",
    "Don't be deceived - they're not as easy to trap as you might think. Go talk to Chief Tess; she's almost as good a hunter as I am, and she can explain the special techniques required to catch creatures around this area.",
    "Yes, I am a rather fantastic hunter in my spare time; however, at the moment, I don't have any spare time because I'm too busy managing people like you who waste my time asking silly questions.",
    "Yes, well, I'll mention your reluctance to the payroll department.",
    "Well, we may do one of these days. If we do, I'll mention it to them.",
    "Anyway, we're getting off-target. Are you interested in taking ownership of this exciting opportunity?",
    "Alright, but by the terms of your contract, unless you follow this project through to completion, you forfeit all rewards and access to our facilities.",
    "Well, it was kind of a verbal contract.",
    "Well, I'd love to continue our chat, but I'm afraid I'm too busy. Ta ta, toodaloo, bye!",
    "Excellent! In that case, it's go-time.",
    "Well, we've got to do this properly and invite all the right people - a mistake at this stage could be a PR nightmare.",
    "Well, we've got a party of VIP trolls coming down from the north for the opening feast; I've invited some fairies to take part in the ribbon cutting; I've sent some free passes to the tree gnomes in order to-",
    "Thank you so much for all your help, Player. All your hard work has really paid off.",
    "Come chat with me at the bank once things have settled down around here.",
    "Thank you so much for all your help, Player. Please feel free to use the pools, free of charge, whenever you like.",
    "There's also some good hunting outside the gates. You can squash as many diseased kebbits and catch as many wimpy birds as you like. Also, I'll let you in on a secret. If you have the skill to care for it, you can catch a baby platypus and raise it as a pet. You can only keep one at a time, though."
  ],
  "Chargurr": [
    "I been told I not allowed to cook helpful human for dessert. Is too bad.",
    "You no talks to me. I got even bigger problems than you.",
    "You see dis fire?",
    "Dat de problem.",
    "But you no understand, human. Dis fire need be BIG. Need to cook much chompy!",
    "Silly human! You know nothing? To build fire, me need LOTS logs! Lots logs! Also need long spearses for spit and some raw chompy to cook. It hopeless!",
    "Dat very nice of you, little human! I need spears an' chompy birds, but first I needs logs.",
    "Ummm... Uhhh... Me know! How many pokesy fingers you got, human?",
    "Dat good! Give me dat many fingers of achey tree logs. Never mind thumbs! How many toesies you gots?",
    "Dat good! Bring me dat many euc'lyptus logs.",
    "Yes, yes! You very smart - good at counting! You go get dem right now, yes? You can find de treesies just outside de camp.",
    "You not worry about dat now. Will need couple birds, maybe couple more spearses. We worry about dat when you gets de woods.",
    "Den you no come crying to Chargurr when you hungry and there nothing to eats, human!",
    "You good at counting, not so good at remembering. I needs all your fingers-number of achey woods and all your toeses-number of euc'lyptus woods.",
    "I also needs some spears and chompy birds, but you no worry about dat now.",
    "You good at counting, but me not. Just give me all woods at once so I not get confused.",
    "Thank you, human. You put dem right dere, on de fire pit, den come talk to me, okay?",
    "Good human! Dis wood make nice, big fire. Now you bring me spearses? I need big, long spears on which me cook chompies.",
    "Bah! Spits too small for big fire like this. You go bring me spears!",
    "Annoying creature - you get logs but no spears? What, you worry you hurt yourself with sharp stick?",
    "Ummm... Uhhh... Errrrrr...",
    "How many is dat again? Me forget wiv de big numbers.",
    "Oh yeah, dat good number. Bring me 4 spears, den. Any kind.",
    "Ugh, too much thinky-thinky all at once, human! I only need couple chompies, me think. Ask later, when you have de spears.",
    "Human, what you doing? It not time to start fire yet!",
    "You gots de spearses, human?",
    "Well, me not expect much from tiny head creature like you.",
    "Poor, tiny creature. Not much space in head for rememberin. Me needs double number of eyes in your head.",
    "Ugh, too much thinky-thinky all at once, human! I only need couple chompies, me think. Ask later, when you haves de spears.",
    "Hurry up, den! Me bored. Want to get cooking. And don't bring me any of dem poison spears or banknotes - me wants nice, clean, real spears.",
    "I not take de banknotes! I no can cook foods on little pieces of paper.",
    "You not get de spearses back, human. Dat okay?",
    "You waste time, human! Hurry up and bring me some spearses I can use or else I cook YOU for dinner!",
    "Thank you, human! Just put dem right up in big trees, over fire pit, den come right back.",
    "Now all I needs is chompy bird. You get those next for me, okay?",
    "Pwetty pwease? Just dis once?",
    "Uhhhhm... Errrr... Ummm...",
    "Mmmmm.. How many eyes do you have if you *not* have extra eyes?",
    "Yeah, me think dat sounds like a good number. Me wants 2 chompies, den.",
    "You got de chompies for me?",
    "Same as number of your thumbsies. Quit playing around, human! Me belly rumbling.",
    "You got de chompies for me?",
    "Me not think so - piece of paper not very tasty.",
    "You know I no good at counting! Get dem all and I take dem then.",
    "Yes, please...den come talk to me again.",
    "Relax, human, you too tense! All you need do now is start de fire so I can cooks the birdies.",
    "Dat's all.",
    "Thank you very much, human. You more useful than you look!",
    "No, me okay now, but maybe bossy human lady have more for you to do - she always complaining about something.",
    "Hey, human, you don't forget to come back when we open I give you good deal if you want meat - or give you shiny pretties if you has some meats to sell.",
    "Thank you for your help, human. You come back when we open, I give you good deals if you want meat - or have some you want to get rids of."
  ],
  "Snurgh": [
    "Dat Balnea-woman tell me to make comfsy pillows for little, softy human heads. I try use good, raw meat - is softest thing I knows.",
    "Of course it smell in the morning! Me thought dat an extra bonus!",
    "Hmm, feathers - okay, maybe. Not attract so many flies. Yes, feathers good - just might work! Good idea from such small, softy head, human. So, you bring me some fluffsies, then, human?",
    "I think me need big pile - maybe, uh, well...I needs...about same number of fluffsies as number of legs on creepy- crawly spider?",
    "Yeah, but don't bring chompy fluffsies - dey too itchy- itchy. Need stripy fluffsies from waggy-tail birdy.",
    "Why you still talking, not out getting de fluffsies, human? You making me want use YOU for pillow!",
    "No, dis little hat thing too tight for me to go hunting birdies. It make me grouchy.",
    "So, you bring me some fluffsies, then, human?",
    "Where's de fluffsies from de waggy-tail birdy?",
    "What you standing there talking about mythical creatures for, human? ME WANTS DE FLUFFSIES!",
    "Me no want fluffsies from strange birdies! Me want stripy fluffsies from de waggy tail!",
    "No but! Get out of face until you have some stripy fluffsies from de little bitty waggy-tail birdy.",
    "You gots de stripy fluffsies from de waggy-tail birdies?",
    "Counting to de big, big numbers make me angry. Go away, human, an' come back when you has ALL de fluffsies.",
    "Good, you gives me now.",
    "Thank you very much. I go make de pillows for de little softy human heads now!",
    "No, not unless human want some leftover steak. It bit smelly, not so good for eating, but still soft an' comfsy if you no have any feathers.",
    "Does human want de leftover steaks? Dey a bit smelly, not so good for eating, but still soft an' comfsy for sleeping on. Still be okay for few more days, at least, me thinks.",
    "Thanks for de help, human. Nice fluffsies make good comfsy pillows. Dey's gonna be less smelly in de morning, too."
  ],
  "Kringk": [
    "How I do hair wiv no tools?",
    "Me not know! Dat what me asking you!",
    "It not a joke! It a problem!",
    "Aww...would you do dat for me?",
    "Tell you what, human. You come back here as soon as we open. Me give you a free sample of what I can do to little human heads.",
    "Good, good! Can make nice brush for hair with some pretty wolfsie bones and some spiney lup-lup furses. De spines really good for tearing out tangles in hair of customer.",
    "What, you going to sit and talk all day or is you going to get de wolfsie bones and lup-lup furses?",
    "Is what I said.",
    "One...two...unngh! Human go away and just bring bones and furses. No make Kringk count - counting hurts head!",
    "Me not know! Handful of wolfsie bones - maybe as many as de number of webby foots on a platypus? And double dat number of furses?",
    "How you doing wiv de stuffs you promised me, human?",
    "Huh? Why you not bring everything?",
    "Dat sentence too long for me to think about. You go away, get all stuff and bring it here, okay?",
    "How I supposed to make hair brush with piece of paper?",
    "Well? Can I have them?",
    "Thank you much, little creature. Dis very helpful.",
    "No, me think we all good. You can tell dat Balnea-human dat we got all de stuffs we need.",
    "You should know. Me no have sense of humour, creature.",
    "Thank you much for all de stuffs, little creature. It very helpful."
  ],
  "Seegud": [
    "Yes-yes, me surprised you humans haven't figured out about buzzy buzzy-repelling smoke for yourselfs. You not have nice, tough skin like ogres.",
    "Pah! When you tough like ogres, you no worry about a few little buzzy-buzzies.",
    "Now you understand!",
    "Listen close, I give you instructions. You may notice dat we have several different pools here. Each pool is made up of different stuffs. An' each pool attracts different type of buzzy-buzzies.",
    "Pah! Shows what you know, human. Dey may not look different, but it take different thing to get rid of each kind of buzzy.",
    "By each pool, you find fire pit where you need start fire, burning stuffs to make de smells dat buzzy-buzzies hate most.",
    "Dat easy. I do all de hard work for you already. I too busy an' too old to keep walkin' around, keepin' fires goin', an' it difficult to remember what to burn where. So, I left piles of stones by each fire pit dat remind me what to burn.",
    "Yes, I use different colours and shapes for each stuffs I have to burn. All you need do is look at pile of stones, see what colours there are. I use different type of stone for each material.",
    "Listen close an' I tells you.",
    "When you see long, brown rock: add euc'lyptus log to fire. Every fire needs euc'lyptus log. When you see green, lump-shaped rock: add fever grass. When you see red, round rock: use primweed. When you see yellow, egg-shaped rock: put in tansymum. When you see orange, squarish rock: add stinkbloom. When you see tall, purple rock: add lavender to de fire.",
    "Good-good. Come back if you forget. It a lot to keep in head all at once.",
    "How you doing getting rid of de buzzy-buzzies?",
    "Of course. Listen close dis time.",
    "Hmm. Me see. Little wee ogre childs often very up-to-no- good these days. Not like when I was wee ogre childs - we very good then.",
    "No, not so much.",
    "I say dat those little ogre childs undo all me hard work - mix up my rocks. Too bad for you. You going to have to find out what they did.",
    "Afraid dat a bit difficult. Too many fires, lots of different things to burn. I remembers one thing - every fire need euc'lyptus log, but apart from that, it not easy to remember what went where. Dat's why I make the stone piles. Need something to aid memory.",
    "Hmm...let me think. Dis may not be as bad as it seems. Ogre childs, dey playful and mischievous, but not really bad-hearted. Also, young ogre childs don't have tough skin yet. Dey wouldn't want buzzy-buzzy bites when using pools any more than you, human.",
    "Maybe we lucky and dey not make too much of a mess of things. Perhaps they just switch around which stone means which burning stuffs. If so, all you need do is figure out what stone dey swapped for what.",
    "Dat right, human. Good luck!",
    "How you doing wiv de buzzy-buzzies, human?",
    "Just okay?",
    "Huh.",
    "Sure, me try. What de problem?",
    "No problem wiv dat. Okay. So you remember, I set out piles of different-coloured rocks by each pool?",
    "Right. I told you what colour rock stood for which material you put on fire.",
    "Yes, yes. I think I know de problem. Ogre childs mixed up de colours. Where I put down green rock, dey trade for maybe red rock. Or yellow rock. Or orange rock. Me not know.",
    "Dat de easy part: when you right, de buzzy-buzzies disappear!",
    "It very difficult. Dat why me leave pile of stones.",
    "Me remember one thing dat may be useful - each and every fire pit needs to have euc'lyptus logs. So, if you find de same type of stone at each fire pit, you know it must be euc'lyptus!",
    "Easy. You can burn tansymum, fever grass, stinkbloom, lavender, primweed and euc'lyptus logs on de fire pits near de pools.",
    "Thank you much, human! You may be scrawny, but you not bad thinker. I make sure the little ogre childs keep fires lit so buzzy-buzzies stay away.",
    "You can tell Balnea-woman dat de buzzy-buzzies have buzzed their last.",
    "Thank you much, human. You may be scrawny, but you not bad thinker. I make sure de little ogre childs keep fires lit so buzzy-buzzies stay away."
  ],
  "Mischievious ogre child": [
    "Hee hee hee *snort* hee!"
  ],
  "[Chomp/I'rk]": [
    "Hi, human.",
    "BWAAAHAHAHA! You never gonna figure out what we dids to de coloured rocks, human.",
    "Hee-hee *snort* haw! You never gonna keep buzzy-buzzies away with fires like you making!",
    "Human not so smart after all, heh! You might as well gives up now.",
    "Somefin' wrong, human? What, your little head not have enough brains to figure it out?",
    "Tee-hee-HEE-hee-haw! Dis de funniest thing I ever saw, you running around Oo'glog like dat, making bad fires."
  ],
  "[Grr'bah/Grubb/Grunther/Snarrk/Snarrl/Snert/Thuddley/Tyke]": [
    "Hi, human.",
    "Why not you try lighting de fire by de thermal bath first? It only take two things to make it burn, and you already know each fire need euc'lyptus logs.",
    "It de bluey-greeny, steamy pool."
  ],
  "Muggh": [
    "So how you like it here, little human?"
  ],
  "Congratulations! You have completed": [
    "'As a First Resort' - Complete this Experienced quest."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:As_a_First_Resort?oldid=35252847’"
  ]
}