{
  "Martin the Master Gardener": [
    "Hello, Player, you look familiar. Didn't I catch you going through my pockets not that long ago?",
    "I could have sworn... Oh, well, never mind. I have bigger problems to worry about right now.",
    "I certainly could do with some help.",
    "Oh. Oh dear. Oh well, if there's nothing I can do to make you change your mind...",
    "Well, come back and chat to me if you change it.",
    "It all seemed to start about a month ago. I grow roses, you know?",
    "What? Oh sorry. As I was saying, about a month ago I noticed that the yield on my prize rose bushes had dropped slightly. I immediately suspected crown gall, a disease that can be fatal to a Mister Lincoln.",
    "Sorry, Mister Lincoln is the variety of roses that I specialise in. None of the plants showed any other symptoms of disease though. Then I noticed a reduced yield occuring in most of my other crops too. I spoke to other gardeners that I know, and they had all noticed similar problems. Vegetable patches are growing fewer vegetables, bushes are producing fewer berries and everything that is planted seems to be more prone to disease! You've done some farming; have you noticed a decrease in the amount of produce you are getting lately?",
    "I know I am. Depressing isn't it?",
    "That's not very observant of you.",
    "I'd like you to find out what is causing this terrible problem, and try to rectify whatever the problem is.",
    "If I were you, I would start by speaking to some of the other gardeners.",
    "I'm not sure I can, but I guess I have to try.",
    "That banner is the emblem of the Group of Advanced Gardeners. We're a loosely affiliated group of gardeners that are united in our concern for declining vegetable production.",
    "Say, you're a brave adventurer, would you be interested in trying to get to the root of our woes? There would be a cash reward if you could help us.",
    "Have you spoken to any other members of the Gardening Group yet?",
    "Well, please hurry. Otherwise, I won't be able to make enough produce to feed my 13 children.",
    "I'm afraid that can't be the problem. It never rains on the farming patches. That's why we have to water the crops.",
    "Go chat to some other group members. Maybe somebody has a different idea.",
    "Good idea, but I spray my crops with insecticide every week. No, that's not the problem.",
    "All right! All right! You're absolutely right! I never said there was a problem with anybody using my plots. Besides, we get part of our income from watching crops for adventurers. I'm afraid that our problem is something totally different.",
    "Yes, I've noticed that the seasons seem to be slightly confused, but that hasn't been a big enough change to affect the crops so badly. I'm afraid you should try a different branch of investigation to get to the root of our problems.",
    "What are you laughing at? These are serious problems!",
    "Hello again, Player. How are you getting on with solving the Gardening Group's problems?",
    "Why is that?",
    "Hmm, that's an interesting idea. Now that I think about it, that does make some sense. Yes, maybe you should talk to a fairy about it.",
    "No, sorry, but I did hear that there were some adventurers with a similar problem in the swamps near Lumbridge. Just don't mention my name if you talk to them; they're trying to keep their problem a secret, but everybody knows what they're up to.",
    "Hello again, Player. Our crops are still failing. Please do something fast or we will all go out of business.",
    "Please hurry. Things are getting dire!"
  ],
  "Player": [
    "Me? No, I'm afraid you must have me confused with somebody else.",
    "Anything I can help with?",
    "Sorry, I have better things to do.",
    "No, nothing. My mind is made up.",
    "So, tell me about your problems.",
    "Um, you seem to be getting side-tracked already.",
    "You're not making much sense. Who's Mister Lincoln?",
    "Now that I think about it, you're right!",
    "No, can't say that I have.",
    "So, what do you want me to do?",
    "Do you have any ideas where I should start?",
    "Oh dear. I hope you can sort them out by yourself.",
    "What is the banner for?",
    "Err, of course you are.",
    "No, I haven't had a chance yet.",
    "Are you a member of the Group of Advanced Gardeners?",
    "Martin has asked me to investigate why all the crops are failing.",
    "No, I'm afraid not.",
    "I've spoken to one of your members and they reckon that it's the lack of rain that we've had recently.",
    "Oh, yeah. I hadn't thought of that.",
    "Insects! You need to get rid of the insects! They're eating the crops.",
    "But...but...they're not my friends! I've never even spoken to most of them!",
    "No, I mean, yes. There is a Heroes' Guild, but-",
    "Oh, I give up!",
    "One of your members is implying that the gardeners' problems are all caused by adventurers using the plots. I would like to point out that these plots are communal property and that we have as much right as anyone to grow plants here!",
    "I don't suppose you have any ideas about what could cause the seasons to be mixed up?",
    "Apparently, the seasons are all mixed up. Late summers and early winters. I don't know what I can do to solve that problem, though.",
    "Ha ha!",
    "You're absolutely right. Don't worry, I'll find out what the problem is.",
    "Why not? They all seem to be a bunch of loonies anyway. I've been told that it's the lack of rain, plagues of insects and recently I was told that the entire order of seasons is confused! I have no idea what to do about any of it. I'm an adventurer, not a weather controller!",
    "But they're all different, how could they all be correct?",
    "Oh no! Not another crackpot theory!",
    "Right, well, thanks for your input. I'll think over what you said.",
    "To be honest, I'm worried about the sort of person you let join your organisation.",
    "I've heard theories ranging from climate change to fairies from your members.",
    "Okay! You're the boss. Any idea which flower I should look under to find a fairy?",
    "Yes, I've spoken to them before.",
    "Don't worry, I'm working on it.",
    "Who are you? Where's the Fairy Queen? What's going on here? Where's the Fairy Queen's throne gone?",
    "Who are you?",
    "...?",
    "Where's the Fairy Queen?",
    "You mean sick? What happened?",
    "Not actually a whole deal, I'm afraid.",
    "Thanks, I'll go see her then. Goodbye.",
    "Yes?",
    "What?",
    "What's going on here?",
    "That's not what I mean!",
    "Where's the Fairy Queen's throne gone?",
    "I did, he said I should come and talk to you!",
    "Actually it's more a case of what can I help you with? I told the Fairy Godfather that I would help you find a cure for the Queen.",
    "Err...no, not me.",
    "Umm...'fraid not.",
    "No.",
    "No.",
    "No, no and no.",
    "I'm a mighty adventurer!",
    "A mighty adventurer!",
    "How is that, then?",
    "Well sort of, I couldn't really understand everything he was talking about.",
    "That doesn't sound too difficult, where will I find him?",
    "No, I'm afraid I've lost the list of symptoms you gave me.",
    "Hello, I need your help.",
    "But Fairy Nuff said you would help me!",
    "The Fairy Queen is extremely ill. She was in a battle with a Tanglefoot and her injuries have resulted in her being in a coma.",
    "Fairy Nuff gave me a list of her symptoms. Here, have a look at it.",
    "You do? That's great! What is it?",
    "Yes, but about the Fairy Queen?",
    "So I guess I need to go and kill this Tanglefoot and get back her magic essence if I am to help her?",
    "Malignus Mortifer. Any idea where I can find him?",
    "Okay, thanks very much.",
    "Fairy Nuff gave me a list of her symptoms, but I don't have it with me.",
    "I need help with fighting a Tanglefoot. Can you help me?",
    "Great, thanks. I was told by Zandar Horfyre that you fought one once.",
    "That's great! I presume you won as you are here to tell me about it, could you tell me how to defeat one, please?",
    "There is a Tanglefoot in the lost city of Zanaris and I have been asked to kill it.",
    "What exactly did you have in mind?",
    "I'll go and get it then.",
    "I was asking you about fighting a Tanglefoot...",
    "No, not yet.",
    "I can't believe I'm about to do this!",
    "I was asking you about fighting a Tanglefoot...",
    "Yes, I have it right here.",
    "Where can I get a pair of these enchanted secateurs?",
    "Phasma Phasmatis Natura. Got it! Is that all?",
    "Great, thanks very much.",
    "I was asking you about fighting a Tanglefoot...",
    "Could you tell me how to kill a Tanglefoot again, please?",
    "Great, thanks very much.",
    "What did I need to take to the Nature Spirit again?",
    "Great, thanks very much.",
    "Thank you! I need your help in enchanting a pair of secateurs.",
    "Sure. A Tanglefoot has invaded the fairy kingdom of Zanaris and the only way I can fight it is with a pair of enchanted secateurs, apparently.",
    "No, I still need to collect some things.",
    "Yes, I have everything right here.",
    "I'm glad you're here. I'm afraid I've lost the secateurs you enchanted for me.",
    "What are you doing all the way over here? Shouldn't you be at the market door?",
    "I did it! I've got the Fairy Queens'[sic] enchanted secateurs!",
    "You needn't have worried I managed to kill it!",
    "I retrieved this pair of Enchanted secateurs, I think they must contain the Queen's missing magic.",
    "How is the Fairy Queen doing?"
  ],
  "[Gardener]": [
    "Why, yes I am. Why do you ask?",
    "No idea. Go ask someone else.",
    "I don't think the crops ARE failing, now leave me alone, I have work to do.",
    "I've already told you everything I suspect."
  ],
  "[Gardener #1]": [
    "Ah, Martin sent you; why didn't you say so? I personally think that our problems are down to the fact that we haven't had enough rain of late. It's plain to see - just look at the levels of the rivers. We need more rain; I don't suppose you can do anything about that?",
    "Well, there you go then. Until you find out how to make it rain, you're going to have a hard time solving our problems."
  ],
  "[Gardener #2]": [
    "Insects! That's what you can tell him! Insects! Stop the insects from eating so many of our crops and we'd get maximum yield, I tell you!"
  ],
  "[Gardener #3]": [
    "How can you ask such a thing? It's obvious! It's all you adventurers. Every time I get a crop planted, some adventurer comes along and digs it up and plants crops of their own, as if they owned my farming patch! It's really annoying! You should speak to your friends about their rude behaviour.",
    "Don't give me that! You're an adventurer, they're all adventurers. I bet you have some sort of secret guild and you gather there and say things like 'let's annoy the gardeners this week', don't you?",
    "Aha, so you admit it then! You should be ashamed of yourselves!"
  ],
  "[Gardener #4]": [
    "Well, obviously it's the seasons. They all seem to be out-of-whack these days. Summer comes earlier and earlier each year, but then it simply rushes by! If you find out what is upsetting the seasons, you'll find out what is causing the harvest to fail.",
    "No, sorry, but find that out and you'll get to the root of our problems."
  ],
  "[Gardener #5]": [
    "Well, I can tell by the look on your face that I'm not the first person you've asked. Why don't you tell me what you've heard from other members of the group so far?",
    "Did you ever consider that all those theories might be correct?",
    "I'll let you into a little secret that'll explain it all to you. In a word - fairies!",
    "I'm serious! Think it through. There are fairies who control everything natural from the weather to the seasons. Surely, if all of those things have been mentioned as catalysts to our problems, it stands to reason that the fairies are actually the cause?"
  ],
  "Slim Louie": [
    "Don' say nuffin' to me! Say it to da boss!"
  ],
  "Fat Rocco": [
    "Ah don' talk to humans! Yous wanna talk, talk to da boss!",
    "Da Boss is a busy fairy! He don' have time to talk to yous humans. Vamoose!"
  ],
  "Fairy Godfather": [
    "Ciao esploratore! So many questions. Whicha one would you hava me answer first?",
    "Me?! I am-a da Fairy Godfather.",
    "I see-a by your face dat you have-a not-a heard of-a me. Irrispettoso, eet iz of no eemportance. You weesh-a to know sometheeng else or no?",
    "Ah, eet iz a trageec-a tale. Da Queen Bee she iz-a, how- you-say, seek?",
    "Ah, a tragedy to be-a struck-a down so young. How-a much do ya know about-a da fairy folk, my beeg friend?",
    "Well, let-a me enlighten yous. Zanaris iz-a a nexus of-a da worlds. Da Queen Bee, she iz-a da guardian of-a all da folk dat live-a in Zanaris. So when-a thees Tanglefoot arrives, da Queen Bee she-a goes to da Cosmic Temple area to kill-a eet, but someting goes-a wrong. Da Queen Bee, she gets-a hurt and is-a now inna da magic sleep. She is-a being cared for by-a Fairy Nuff, who lives-a just north of-a da bank.",
    "Ciao. Oh, and Player...",
    "A word-a of advice. You be-a careful not to cause da trouble for da folk while you are in Zanaris. Ciao.",
    "Hmm, an eenteresting question, my friend. I am-a trying to run-a da fairy kingdom, and youz iz-a being da irritating adventurer.",
    "No, but-a dat iz da question I answered. Now iz-a dere anything else?",
    "An eenteresting place to start... I am-a here, ze Queen Bee iz not. So my chair - eet iz-a here, her throne - eet iz- a not. Eez there anytheeng else? I ama a bizy fairy.",
    "Eef there iz anytheeng I can-a help you weeth whilst you are-a veesiting Zanaris, plsi, do not-a trouble to bother me.",
    "Ciao, Player. I am-a glad to see-a yous back! I was-a worried that the Tanglefoot would-a kill-a you too.",
    "Ben fatto, my friend! Da folk-a dey owe yous a great-a deal! So did-a yous getta back da Queen Bee's magic power?",
    "Grazie infinite! I will give-a dem to da healing fairy. Da Queen Bee, she will-a soon be strong again!"
  ],
  "Fairy Nuff": [
    "Sorry, I'm very busy and can't chat. If you want to know something go and talk to the Godfather.",
    "Oh! Sorry, I didn't realise. What can I help you with then?",
    "Oh, thank you! I really need help, I have no idea what ails the Queen. You must be a mighty healer!",
    "A great druid then?",
    "A shaman?",
    "A surgeon?",
    "A doctor, medic, nurse?",
    "So what are you then?",
    "A what?!",
    "Yes, I heard. It's just not what I was expecting to hear. But hang on, you might be just the sort of person I need to help me!",
    "I'm sure the Godfather told you that the Queen is in an enchanted sleep?",
    "Shhh, somebody might hear. Look, you're a visitor, so I'll tell you this much: it doesn't pay to talk about the Godfather behind his back. But back to the problem at hand - the Fairy Queen. She brought here after her battle with the Tanglefoot in a terrible state, extremely weak and barely able to fly! Here, I've written down a list of her symptoms.",
    "When the Queen got back here, she was clearly weakening fast. It appears as if the magic force that is her life essence is slowly unravelling. I have put her in a state of tempus fugit, that will slow time down for her, and thus prolong the amount of time that she remains alive. Now, what I need you to do is find a mage by the name of Zandar Horfyre. He has spent many years studying magical illness. Take the list to him and ask him if he knows what ails the Queen, please.",
    "I believe he now resides in the Dark Wizard's tower near Falador, and Player, please hurry. I fear the Queen doesn't have much time left!",
    "You're back soon! Did you find out what ails the Fairy Queen?",
    "Well not to worry, I have a copy of it here.",
    "That's fantastic! You'd better take them to the Fairy Godfather though; he'd be cross if he knew you brought them to me first. But, come back to me once the queen has had a chance to recover. I'm sure she'll want to thank you personally.",
    "Not too well; the Godfather hasn't given me those secateurs yet."
  ],
  "Zandar Horfyre": [
    "And why should I help you, fool? You attack my brethren and me, and then you demand my help! I think not!",
    "Fairy Nuff sent you! How is she? I owe her a great deal. She saved me from a mortal injury I sustained when I was investigating the nature of Otherworldly beings. So, how can I help?",
    "This is grave news indeed! You think the Tanglefoot is responsible? I don't see how that could be. A Tanglefoot will normally kill its victim outright...unless...hmmm...I wonder... I don't suppose you could give me more details about the Fairy Queen's condition, could you?",
    "Hmm...yes...slow discorporation of ethereal body, eh? Hmm...I think I know what the problem might be.",
    "From what I know about fairies, their basic lifeforce is pure magic. Much as we humans would refer to our souls as our life essence, so too does a fairy have a life essence of pure magic. You could actually refer to fairies as magic embodied and not be wrong.",
    "Patience, I'm getting to that. It appears the Fairy Queen has lost a large part, indeed the majority, of her life essence. Either it was drained from her by the Tanglefoot or she did it voluntarily. Although why she would do that is beyond me.",
    "Yes, but if I were you I would seek out a necromancer by the name of Malignus Mortifer. I believe that he once fought a Tanglefoot, many years ago. You should probably ask him for advice on how to combat it.",
    "He's rumoured to have been seen near Port Sarim with his followers recently. Rumour has it that he's working on a spell that has something to do with fungus!",
    "Don't mention it. Give my regards to Nuff, when you see her next.",
    "Well, I can't diagnose the problem without knowing the symptoms. You'd better go and find that list, or get Fairy Nuff to give you another one."
  ],
  "Malignius Mortifer": [
    "Almost certainly. I am a great practitioner of the magic arts, after all.",
    "That is true, and an epic battle it was too.",
    "Of course I won! As I've already stated I am a master of the magic arts. Why do you want to know how to kill a Tanglefoot?",
    "I see. Well I could tell you how to defeat your Tanglefoot, however I would need you to perform a little undertaking for me first.",
    "To the north-east of here is a haunted manor. Bring me a skull from a grave you find there and you shall have your answer.",
    "Fine, I'll see you soon.",
    "So, have you brought me the skull?",
    "Well come and talk to me once you have it.",
    "So, have you brought me the skull?",
    "Right then, to business. A Tanglefoot can be harmed by neither might nor magic. The only weapon that can damage them is a pair of enchanted secateurs!",
    "You will have to make them... Listen carefully, and I'll tell you how. Obviously, you will need a pair of secateurs. You will also need to gather a Mort Myre pear, a Mort Myre stem and a Mort Myre mushroom. Take them to the Nature Spirit and ask him to perform the ceremony of Phasma Phasmatis Natura.",
    "Yes, that's all. You'll be able to use those secateurs to kill the monster.",
    "I have already told you all I know about fighting a Tanglefoot. What more would you have of me?",
    "I guess so. Forgot to take notes did you? Well, listen carefully this time. You will need to enchant a pair of secateurs. Only these can harm a Tanglefoot.",
    "You will need a pair of secateurs. You will also need to gather a Mort Myre pear, a Mort Myre stem and a Mort Myre mushroom. Take them to the Nature Spirit and ask him to perform the ceremony of Phasma Phasmatis Natura."
  ],
  "Nature Spirit": [
    "Welcome back, my friend. I sensed that you require my help and so I have once more returned.",
    "Secateurs? That's a strange thing to enchant. Would you care to inform me why you need them?",
    "Ah, a Tanglefoot! Your information is correct, secateurs that have been blessed by a Nature Spirit are the only weapons that can harm such a terrible creature. I shall be glad to help you. Do you have all of the required items for the ceremony?",
    "Alright, my friend. Return to me when you have all that is required. I shall be waiting.",
    "Then let us begin...",
    "It is done! Farewell, Player, and good luck with your coming battle.",
    "Hello, Player. Why have you returned so soon after your last visit?",
    "That's alright; if you bring me the components for the spell, I'll enchant another pair for you. Would you happen to have all of the required items for the ceremony with you now?"
  ],
  "Gatekeeper": [
    "Yes, that's my usual spot, but the Godfather said I should be here, so here I am.",
    "Hello, did you just come from the market gates? Are my brothers doing their job well? I do worry that they'll start letting people into the market for free without me being there to supervise them!"
  ],
  "Gate Keeper": [
    "I've received orders to let you through if you want. Good luck.",
    "Be careful in there, there are still some of those baby Tanglefootii around."
  ],
  "Congratulations! You have completed": [
    "'A Fairy Tale I - Growing Pains' - Complete this Experienced quest."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:A_Fairy_Tale_I_-_Growing_Pains?oldid=35734854’"
  ]
}