{
  "Dr. Fenkenstrain": [
    "Have you come to apply for the job?",
    "I'll have to ask you some questions first.",
    "How would you describe yourself in one word?",
    "Mmmm, I see.",
    "Just one more question. What would you say is your greatest skill?",
    "Mmmm, I see.",
    "Looks like you're just the [man/woman] for the job! Welcome aboard!",
    "Yes, there is. You're highly skilled at grave-digging, yes?",
    "Excellent. Now listen carefully. I need you to find some...stuff...for me.",
    "That's what I said...stuff.",
    "Well...dead stuff.",
    "I need you to get me enough dead body parts for me to stitch together a complete body, which I plan to bring to life.",
    "The soil of Morytania is unique in its ability to preserve the bodies of the dead, which is one reason why I have chosen to carry out my experiments here. I recommend digging up some graves in the local area. To the south-east you will find the Haunted Woods; I believe there are many graves there. There is also a mausoleum on an island west of this castle. I expect the bodies that are buried there to be extremely well preserved, as they were wealthy in life.",
    "I need you to get me enough dead body parts for me to stitch together a complete body, which I plan to bring to life.",
    "I came to the land of Morytania many years ago, to find a safe sanctuary for my experiments. This abandoned castle suited my purposes exactly.",
    "Oh, perfectly innocent experiments – for the good of mankind.",
    "Enough questions, now. Get back to your work.",
    "No, my friend. I have a very special purpose in mind for this creature.",
    "What do you think you're doing???",
    "I can't use this head, [Player]. It's missing the most important part – the old grey matter.",
    "Great, you've brought me some arms.",
    "Excellent, you've brought me some legs.",
    "Splendid, you've brought me a torso.",
    "Fantastic, you've brought me a head.",
    "Superb! Those are all the parts I need. Now to sew them together... Oh bother! I haven't got a needle or thread! Go and get me a needle, and I'll need 5 lots of thread.",
    "Where are my needle and thread, [Player]?",
    "Ah, a needle. Wonderful.",
    "Some thread. Excellent.",
    "Perfect. But I need one more thing from you – flesh and bones by themselves do not make life.",
    "I have honed to perfection an ancient ritual that will give life to this creature, but for this I must harness the very power of Nature.",
    "The power of lightning.",
    "Silence your insolent tongue! The storm that brews overhead will create the lightning. What I need you to do is to repair the lightning conductor on the balcony above.",
    "Repair the conductor and BEGONE!!",
    "Oh, it would be easier to do it myself! If you find a conductor mould you should be able to cast a new one. Remember this, [Player], my experiment will only work with a conductor made from silver.",
    "Yes, I'm afraid it did, [Player] – all too well.",
    "I tricked it into going up to the Tower, and there it remains, imprisoned.",
    "...oh, what have I done...",
    "I have no control over it! It's coming to get me!",
    "Destroy it!!! Take the key to the Tower and take back the life I never should have granted!!!",
    "So have you destroyed it?!?",
    "Please, hurry – save me!!!",
    "So have you destroyed it?!?",
    "Oh my, oh my, this is exactly what I feared! Why did you have to pick Rologarth's brain of all brains?!?",
    "No! I refuse to release you! You must help me build another creature to destroy this dreadful mistake!!",
    "theyrecomingtogetme theyrecomingtogetme...",
    "theyrecomingtogetme theyrecomingtogetme..."
  ],
  "Player": [
    "Yes, if it pays well.",
    "Okay...",
    "Stunning.",
    "Awe-inspiring.",
    "Breathtaking.",
    "Braindead.",
    "Combat.",
    "Magic.",
    "Cooking.",
    "Grave-digging.",
    "Is there anything you'd like me to do for you, sir?",
    "Err...yes, that's what I said.",
    "Stuff?",
    "What kind of stuff?",
    "Go on...",
    "Right...okay...if you insist.",
    "No.",
    "Do you know where I could find body parts?",
    "What do you want me to do again?",
    "Right...okay...if you insist.",
    "Why do you want to make a creature?",
    "What were you experimenting in?",
    "Then why did you need to come to Morytania?",
    "Will this creature put me out of a job?",
    "I must get back to work, sir.",
    "Can you tell me anything about Fenkenstrain?",
    "Go on.",
    "Did you see who did it...before...?",
    "Umm...",
    "What happened to your head?",
    "Oh yes, dreadful bad luck.",
    "Would you show me where the place was?",
    "What's your name?",
    "Don't worry, I was just trying to make conversation.",
    "Please, don't worry.",
    "Can I buy something to eat?",
    "What have you got?",
    "Err...pickled from what animal?",
    "I'll buy one, please.",
    "I'm afraid I'm not really hungry at the moment.",
    "I have some body parts for you.",
    "Really?",
    "And what power is this?",
    "Sorry, can't make lightning, you've got the wrong [man/woman]-",
    "Repair the lightning conductor, right. Can I have a break, soon? By law I'm entitled to 15 minutes every-",
    "How do I repair the lighting conductor?",
    "Do you know where the key to the shed is?",
    "Do you know where I can find a lightning conductor mould is?",
    "Where is he now?",
    "So did it work, then?",
    "I can't see it anywhere.",
    "So the creature wasn't all you'd hoped, then?",
    "Oh, I see, we're developing a sense of right and wrong now are we? Bit late for that, I'd say.",
    "What do you want me to do about it?",
    "Not yet.",
    "I am commanded to destroy you, creature!",
    "Are you feeling okay?",
    "You don't look very dangerous.",
    "You really don't know, do you? Have a look for yourself.",
    "I'm sorry. I suppose I'm partially to blame for this.",
    "Who are – were – you?",
    "So the castle wasn't really abandoned when he found it?",
    "I found your brain in a jar in Canifis, so he must have sold you too.",
    "That's it – I'm leaving this dreadful place, whether I get paid or not. Is there anything I can do for you before I leave?",
    "Do you know how I can stop Fenkenstrain's experiments?",
    "What is this ring?",
    "Never, now that he has told me the truth!",
    "I'm through working for you.",
    "I stole the Ring of Charos from Fenkenstrain.",
    "Do you want the ring back? It is yours after all.",
    "It is all you deserve. Lord Rologarth is master of this castle once more. Let him protect you – if he wants to.",
    "How are you?",
    "Good for you...err...mate."
  ],
  "Gardener Ghost": [
    "Oi could tell you a few things about old Fenky, yeah.",
    "Once, this castle were full o' good folk – my friends. Fenky was just the castle doctor, you know, to the lord and the castle folk. I don't know what happened to them all, but one by one they all disappeared. When they were gone a while, I went an dug graves for 'em in the forest. After a while there weren't no one left, but the lord, Fenkenstrain and meself. Old Fenky sent me into the forest to dig 'im a pit – never said what for – then would you believe it, someone chops me 'ead off.",
    "Before oi kicked the bucket, you mean?",
    "Don't worry yerself. I'm not worried about bein' dead. Worse things could happen, I suppose. One thing I do know is, there ain't no lord of the castle anymore, 'cept for old Fenky. Makes ya think a bit, don't it?",
    "Oi was in the old 'aunted Forest to the south, diggin' a pit for moi old master, old Fenkenstrain, when would you believe it, someone chops me head off. Awful bad luck weren't it?",
    "So oi thinks to meself, I don't needs any 'ead to be getting on with me gardenin', long as I got me hands and me spade.",
    "Well, oi s'pose oi've got ten minutes to spare.",
    "Me name? It's been a moivellous long while, mate, since I had any use for such a thing as a name.",
    "No, no, I can't be havin' that. I'll remember in a minute...",
    "Lestwit, that's it! Ed Lestwit.",
    "You need to head off to them Haunted Woods, mate.",
    "Go [direction], mate.",
    "This is the place where I met me' maker.",
    "Got it right 'ere in my pocket. Here you go.",
    "A conductor mould, you say? Let me see... There used to be a bloke 'ere, sort of an 'andyman 'e was. Did everything 'round the place – fixed what was broke, swept the chimneys and the like. He would 'ave had a mould, I imagine.",
    "E's dead, just like everyone else round 'ere... 'cept for me.",
    "Same as ever, mate, just getting' on with it regardless."
  ],
  "The grave says": [
    "'Here lies Ed Lestwit – REST IN PEACE'"
  ],
  "Roavar": [
    "If you've got the money, I've got a real treat for you.",
    "Pickled brain, my friend. Only 50 gold to you.",
    "Animal? Don't be disgusting, man! No, this is a human brain – only the best for my customers.",
    "A very wise choice, [sir/miss]. Don't eat it all at once, savour every morsel – that's my advice to you."
  ],
  "Fenkenstrain's Monster": [
    "Oh that's *hic* not very *hic* nice...",
    "Abso *hic* lutely. Never *buuurrp* better.",
    "How *hic* do I look?",
    "AAAAARRGGGGHHHH!",
    "No – it was him I wager – Fenkenstrain – wasn't it? He's brought me back to life!",
    "I was Rologarth, Lord of the North Coast – this castle was once mine. Fenkenstrain was the castle doctor.",
    "Is that what he told you? No, no, this castle was once full of people and life. Fenkenstrain advised me to sell them to the vampyres, which – I am sad to say – I did.",
    "Of that I will not speak. There lie memories that should rest with the dead, the living unable to bear them.",
    "Only one – please stop Fenkenstrain from carrying on his experiments, once and for all, so that no other poor soul has to endure suffering such as that of my people and I.",
    "Take the Ring of Charos from him.",
    "It was my birthright, passed down to me through the ages, its origin forgotten. The Ring of Charos has many powers, but Fenkenstrain has bent them to his own evil purposes. Without the power of the ring, he will not be able to raise the dead from their sleep. It has one other, extremely important use – it confuses the werewolves' senses, making them believe that they smell one of their own kind. Without the ring, Fenkenstrain will be at their mercy."
  ],
  "Rologarth": [
    "How goes it, friend?",
    "I saw him climb up into the Tower to hide it. It doesn't matter – soon the werewolves will come for him, and his experiments will be forever ceased.",
    "No, you keep it, my friend. Werewolves hunger for the scent of live flesh – I have no need for the ring. I have my castle back, if not my soul."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Creature_of_Fenkenstrain?oldid=33428444’"
  ]
}