{
  "Player": [
    "Hello again Bolren.",
    "I notice you have a new pet.",
    "Dumpling? Hmmm, I suppose it looks little bit like a dumpling. An evil six-legged dumpling.",
    "Look at it! It's clearly evil. It has six legs! And those eyes – those black, black eyes. IF you stare into them you can see into its black soul. They give me the creeps. Ahem, anyway, that is not why I know this creature is evil. I've seen one before, and I'm afraid I have some bad news. The truth is that Dumpling is an evil watcher creature created using dark arts, sent by Glouphrie to wheedle itself into your affections and spy on you and your people. It is shrouded by illusion magic to make it look like a cute pet, but in reality it is an horrible, black spiky thing. It's watching you all the time, sending details of all your secret dealings back to Glouphrie.",
    "Alright, I admit it sounds a little far-fetched, but it is true. I have seen these creatures at the Grand Tree and unmasked them using a machine created to dispel illusions and who knows how to cast illusions? Glouphrie!",
    "You don't believe me, then. Talk to King Narnode; he'll tell you I'm right.",
    "So I'm going to have to prove this to you myself then, am I? I suppose I should have guessed. *Sigh*.",
    "Well, if I were to remove the illusion, would that be enough to prove it to you?",
    "Not exactly. In the Grand Tree I used an anti-illusion device built by Oaknock the engineer to switch off the illusions. I don't suppose you know whether there's one of those around here?",
    "Oaknock's was a big machine made out of maple, oak and crystal. It made strange whirring noises.",
    "Yes, I believe Oaknock got some help from the elves to build it.",
    "Yewnock?",
    "Hmmm, these devices are quite important. You gnomes seem to have a habit of forgetting things.",
    "So I need to find a local gnome who might keep old artefacts of an elven nature. Let me think.",
    "Hello, are you okay?",
    "OK... I'll have a look for a key.",
    "Hello, are you okay?",
    "I found a key.",
    "OK...",
    "Hello, Golrie. You still trapped down here?",
    "Toying with hobgoblins?",
    "Well, I have a question. Do you remember I came and asked you about an elven artefact before?",
    "Are you serious? Are you some sort of collector? Elven artefacts don't grow on trees, you know.",
    "Souvenirs?",
    "So, could I look through some of that stuff? I think I know what I'm looking for.",
    "Hello again Bolren.",
    "I told you.",
    "Of course, your Highness.",
    "Hello again Bolren.",
    "That's right, there were six.",
    "Maybe he thought it was more important to spy on the Grand Tree and Narnode.",
    "So you want more evil watchers?",
    "Well, maybe you can help me find him. I suspect he's in the hidden city of Arposandra. I just need to find the place.",
    "Well, any help would be useful.",
    "Where did he go?",
    "That doesn't really help, you know.",
    "Ah, wait a second. I can guess - Aluft Gianne jnr. I've always wondered how he knows where to deliver all those foodstuffs. Gnomes seem to get in all sorts of weird and inaccessible places.",
    "I will. I'm sure that will have him quaking in his boots.",
    "Hello, Mr Gianne. I'm looking for a certain gnome and I've been told you're the gnome to talk to about this.",
    "I'm looking for Longramble the explorer.",
    "Though, if you can't find him, then you can hardly tell me where he is, then.",
    "What?",
    "Anyway, those coordinates are sextant coordinates, aren't they?",
    "Right. I'd better get my sextant, watch and chart before I set off then. Oh, I almost forgot what is the order, then?",
    "If you say so.",
    "You're welcome. Mr Longramble, I presume?",
    "Hello. Let me introduce myself. I'm [Player] and I've been looking for you. You're a hard gnome to find.",
    "Oh no, wait a second, you're not one of those gnomes like Hazelmere that only speaks in Ancient Gnomish, are you? Am I going to have to get my dictionary? You're not going to do that mindmeld thing that Hazelmere does, are you? That made me kind of dizzy.",
    "No?",
    "They seem to be well and truly awake now. You must get pretty lonely.",
    "So what are you doing out here, anyway?",
    "Are you sure there is an edge? I heard it goes on forever.",
    "If the world is spherical, though, you'll never find the edge.",
    "Maybe the world is round, just very big so we don't notice the curve and there's some magical force that makes us stick to the ground.",
    "Well, I'm clearly not going to persuade you now; though, talking about places that might not exist – I thought you were looking for the lost city of Arposandra.",
    "And you think Arposandra is around here somewhere?",
    "What makes you think that?",
    "That's pretty tenuous.",
    "Ah!",
    "In what way?",
    "Tentacles? That's more than 'unwell' that's...warped!",
    "Though, if it is Glouphrie's doing, surely it should be an illusion of a tortoise.",
    "Hmm, I'd better have a look myself. Leave it to me – I'll find a way. It's my job.",
    "Err, hello, Mister Tree. Was that you calling me?",
    "I must be going mad, I'm talking to a tree. Hello?",
    "Err, hello. Do you have a name?",
    "So you can't speak with anyone then?",
    "Well, it's true that I have spoken to the odd tree in the past. Wait a minute, this reminds me of something. Hazelmere did something like this to me a while ago; you know talking using the mind.",
    "What's wrong with you anyway?",
    "What exactly is this anima mundi?",
    "So this sticky ichor stuff is stopping you from talking to the other spirit trees. I don't know how I could help you. You're right though, Hazelmere might be able to help. What would Hazelmere do?",
    "Hazelmere?",
    "It's good to hear you again; still as grumpy as always.",
    "I'm glad you noticed that. That is why I need your help. Is that a good enough reason to disturb you?",
    "Arrrrgh! Help me!",
    "Fortunate? You didn't warn me of any risk before giving me that nightmare!",
    "Hmm, I'm not sure I approve of your low regard for my welfare. About the tree – can you help him?",
    "Why is that?",
    "I'm sorry, you're confusing me.",
    "So how has this caused Incomitatus to become ill?",
    "There is a huge evil-smelling swamp of tar just to the west of here. Is that related?",
    "Glouphrie?",
    "Is there some sort of antidote I could give to the tree?",
    "Couldn't I just get an elf to come here and do it for me?",
    "How do you know what I'm carrying? Oh, mindmeld again. Of course.",
    "Right, I'll try that.",
    "I have a bad feeling about that red button. What is this room, anyway?",
    "What? That's tar coming in through the grill!",
    "I'd better get out of here.",
    "Right, that's the way. I'm going to have to cross the tar.",
    "I'm stuck, I can't move! How am I going to get out of here? Let me think. There seems to be some charm that will stop me teleporting out of here.",
    "Uh-oh, gas as well. This is getting better and better.",
    "*Cough* *Cough*",
    "I can't move, I can't teleport, and I'm choking to death. I need a plan.",
    "What else could possibly go wrong?",
    "Sticky tar, gas and now projectiles. I think I understand what this room is for now.",
    "It's a killing room.",
    "Think! Think! There has to be a way out of this.",
    "*Cough* This gas is making me dizzy. I can't think straight. I'm feeling...rather...faint.",
    "Cough! This is it. This is the end. I need help.",
    "Heeelp! Someone, help me! I'm dying...",
    "Are you the Grim Reaper? You remind me a lot of a gnome I knew when I was alive.",
    "Hazelmere?",
    "Wha...?",
    "Wow, that's some trick!",
    "What did you say?",
    "Phew, that was a close one! Thanks for saving me.",
    "What? Don't be so negative. You're a survivor. You've lived this long.",
    "Visions? You can't trust visions.",
    "What is this choice anyway?",
    "Well, that's about as clear as mud!",
    "Bah! Sounds like you have been having some bad dreams, or you've been reading some terrible stories.",
    "You'll never die, you're a mighty wizard!",
    "I can't do this! Even if I can, I'll need you to teach me what I need to know.",
    "But..."
  ],
  "King Bolren": [
    "Well hello, it's good to see you again.",
    "Ah, you've met Dumpling.",
    "Hey! Dumpling isn't evil. She has cute, fluffy ears and a little bobbly tail!",
    "... You are a strong and brave warrior, but with all due respect... You're mad! You're talking like a raving lunatic. What is it with you adventurers and your wild conspiracy theories? They are not always out to get you, you know.",
    "Glouphrie disappeared when I was a baby; he should be dead by now. You've been listening to too many gnomish children's stories. \"Eat your worms or Glouphrie will get you!\" That's what my mummy used to say to me when I was a little boy king.",
    "Well, I don't suppose you're lying, but maybe you're wrong? Maybe the ones you saw before were 'evil watchers' made to look like Dumpling here, and Dumpling is just a cute fluffy creature.",
    "I'm afraid so. Dumpling has become my constant companion, I couldn't just cast her aside.",
    "Of course. Can you do that?",
    "Oaknock built lots of things. He was famous for it and he would have done that before I was King so I wouldn't necessarily know about it. If I knew what an anti-illusion device looked like I might be able to help.",
    "Oak and maple are standard gnomish building materials, but crystal isn't. It must have something to do with the elves.",
    "Now that I think about it, I do remember something. When I was a small boy, just before I became King of the Tree Gnome Village, Yewnock came to visit.",
    "Yes, Oaknock's son. Yewnock was a nice gnome. He always used to play games with me, bringing small gliders and little stick men with parachutes. One day, while I was playing, I looked in some crates that had arrived for him and found strange objects made out of crystal and wood. He quickly hid them and told me not to tell anyone. It seems he had come here to build something but he didn't say what, but I do remember those crystals clearly – I'd never seen any before; however, I don't know what he built or where he built it. It must be somewhere out of the way, or underground, otherwise I'm sure I would have noticed it. I think it must have been forgotten about by now.",
    "Oh, I suppose so. Gnomes don't tend to dwell on the past. It will be around here somewhere, just ask around.",
    "Oh dear, it seems [Player] was right...",
    "Well hello, it's good to see you again. I have to admit, you were right. That creature is not what it seems.",
    "Please get rid of it, then we can talk.",
    "Well hello, it's good to see you again. Thank you. I apologise for not believing you. You have shown your trustworthiness more than sufficiently. I do have a question, though. You said that there were many of these 'watchers' posted all over the Grand Tree?",
    "So why did Glouphrie send so many to the Grand Tree but only one here?",
    "That's outrageous! The Grand Tree is not six times more important than our village here! He should have sent at least four watchers, maybe five.",
    "Well, yes. I mean no, of course not, but Glouphrie has a lot to answer for. He has underestimated the Tree Gnome Village for the last time! If I ever meet him I'll...err...I'll give him a good talking to.",
    "I do have some information that might lead you in the right direction; either that or down a complete blind alley.",
    "Well, one of my citizens, called Longramble, is a bit of an explorer. He had also heard rumours of Arposandra and asked me if he could go look for it. He was so persistent that I agreed, though mostly just to get him out of my sight.",
    "He didn't say where, exactly. He did say that he was sure Arposandra was somewhere between here and the edge of the world.",
    "Hmmm, there is one gnome who has a near-magical knowledge of the locations of wandering gnomes.",
    "Yes, I'd have a chat with Aluft Gianne jnr. He stands a better chance of knowing where Longramble is, though I can't guarantee Longramble will help. He may have found the edge of the world and fallen off, for all I know. And, if you find Glouphrie, tell him...tell him...I'm very angry with him.",
    "Of course!"
  ],
  "Golrie": [
    "It's just those blasted hobgoblins. I locked myself in here for protection. But I've left the key somewhere and now I'm stuck.",
    "It's just those blasted hobgoblins. I locked myself in here for protection. But I've left the key somewhere and now I'm stuck.",
    "Well don't wait all day, give it a try!",
    "Oh, no. I'm just toying with them.",
    "Of course. I have a plan of escape. It should be a lot of fun, for me at least; less so for the hobgobbos. Anyway, what can I do for you?",
    "OF course. You want some more? I have loads. They are all lying around in boxes somewhere.",
    "Ah, but they do grow. Anyways, I don't collect elven stuff, my grandfather does, or did – I'm not sure whether he's alive or not, he hasn't sent me any souvenirs for a while now.",
    "Funny gnome, Gramps. He got into a bit of trouble a while back and has been travelling the world collecting elven artefacts and sending them back, He has a bit of a thing for elven stuff. That pebble I gave you was one of his. It used to be a monthly occurrence – a terrorbird would turn up with a big parcel, or a tortoise would turn up with a big crate and I'd throw it in with the other stuff in the storeroom. It's a bit of a mess now in there.",
    "Oh, certainly. Let me know if you find anything interesting. I should really sort through all of his things – there's probably some quite cool stuff in there. Have a look in the other cave and you'll find the small tunnel into the storeroom. Oh, if you want to look in the strongroom you'll need to find the key. It's in there somewhere."
  ],
  "Bolrie": [
    "T'was a time of peace for the gnomes, but the two main gnome settlements, The Grand Tree to the north and the Tree Gnome Village to the south, were becoming increasingly separated.",
    "I led the gnomes of the Tree Gnome Village. King Healthorg was getting old and still ruled the Grand Tree, but he was losing his grip and becoming less and less aware of the affairs of man.",
    "Humans had settled in the area and were looking to establish a foothold in what had been gnomish lands.",
    "What is Healthorg doing about this? Nothing! He's weak and dying. He has become blind to our problems.",
    "If Argenthorg becomes King, he will only appease the humans, and let them take away our lands.",
    "Hmmm, I would certainly be a better King of the Gnome Stronghold than Argenthorg. What do I need to do?",
    "And, so, the reign of the most famous Gnome King came to an end.",
    "And while most gnomes mourned, Argenthorg and I started to plan separately.",
    "The King is dead, long live...who?",
    "And so the electioneering began.",
    "Argenthorg was Healthorg's son. The gnome populace loved Healthorg and assumed that Argenthorg would be as great a king as he.",
    "I knew this was a lie; Argenthorg was weak, but he was popular. My advisor suggested he could change that.",
    "I didn't ask how. I regret that now.",
    "It seems that Argenthorg prefers human food to traditional gnomish cuisine.",
    "Behold, fellow gnomes, a gnome who loves humans more than his own kind!",
    "Argenthorg, you have allowed the humans to beguile you.",
    "Argenthorg, stand down from the elections. You are not fit to be King!",
    "Fairness has nothing to do with it. How can the Gnome Kingdom expect to be truly great if it is led by the spoilt, weak son of a great leader. You are but a pale shadow of your father.",
    "Your father cannot help you now. You are on your own and have been found wanting.",
    "No! I don't believe it. I trusted you!",
    "No one will vote for me now! You've ruined everything. I've been taken for a fool by the most untrustworthy gnome ever known!",
    "What? Follow you, a shape-shifter, a honey-tongued deceiver? No. I have failed the gnomish people and brought shame upon my family. I will not follow you and dare not stay here. I must find my own path to redemption. You, Glouphrie, have forced me to leave my people in shame. I will not forget this.",
    "Follower! I was never your follower!",
    "There ended my ambitions to become King of the Gnome Stronghold, and Argenthorg was pronounced the new king shortly afterwards. My shame is so great I cannot bear to remain in the Tree Gnome Village.",
    "So I prepare to leave the lands of my people. Foul illusions cannot be allowed to shame us ever again. I will plead with Yewnock to install an anti-illusion device in the Tree Gnome Village, so that my family remains protected from such treacheries.",
    "As for the one who chooses to practise such dark arts, he will be punished. I will make it my life's purpose."
  ],
  "Spirit advisor": [
    "My waters tell me that a dangerous and charismatic warrior called Khazard now leads the humans to the north. He will bring disaster to the gnomes. The spirit trees tell me this.",
    "It seems that Argenthorg wishes to follow his father's path. It is a shame he is so isolated in the Grand Tree.",
    "If the next King of the Gnome Stronghold does not remove this threat, the Empire will be rent asunder. I have forseen this.",
    "If a strong leader, who understood the real threat, were to succeed Healthorg, maybe this disaster would be averted.",
    "A leader who might take on the humans without fear and defeat them would surely win the hearts of all gnomes.",
    "That gnome would surely be crowned King of the Gnome Stronghold!",
    "Attack the humans now, whil they are still weak. When you defeat Khazard, you will be a hero - and when Healthorg passes on - which will be soon - you will stand for election. How can you lose?"
  ],
  "Prince Argenthorg": [
    "B-b-but I haven't done anything!",
    "This is all a lie! I've been framed. It's not fair!:",
    "No, no, no! This can't be happening! Daddy! Help me!",
    "What would daddy do? What would daddy do?",
    "Wait! I remember something that daddy said to me once, about being wary of illusions. That must be it. This must all be an illusion.",
    "Yewnock! Switch the machine on!",
    "Aha! I knew it. Glouphrie. Daddy warned me of gnomes like you! And Bolrie, the shame is yours now!"
  ],
  "Advisor": [
    "Curse you, Yewnock, son of Oaknock! And curse your use of elven magics!"
  ],
  "Glouphrie": [
    "I gave good advice. I told you what you needed to hear and gave you the tools to achieve it. Nearly.",
    "I sought only to strengthen the Gnomish Empire against its true enemies. It seems I have failed. I shall leave and create a new city, a city with vision. Anyone who wishes to see gnomes great again should join me. Are you with me, Bolrie?",
    "As you wish. I have followers enough.",
    "Weren't you?"
  ],
  "Gianne jnr.": [
    "Hmmm, that's sensitive information you know. Who is this gnome?",
    "Ah, well, that might be different. I have a long-standing order for Longramble. No-one seems to be able to find him.",
    "I didn't say I didn't know where he is, just that the gnomes I've sent can't get to him. Remember these coordinates: 2 degrees, 7 minutes south; 3 degrees, 7 minutes west. Normally I wouldn't give my deliverers exact coordinates but I can't find it on my Doogle Maps.",
    "My maps are all on dried doogle leaves.",
    "Errm, I believe you humans use sextants for these types of coordinates, yes.",
    "Oh, yes. It seems that Longramble is missing the delicious taste and texture of tangled toads' legs. Tasty."
  ],
  "Longramble": [
    "Chew...crunch...munch...",
    "...",
    "...",
    "N-n-n-no.",
    "No. I understand you and can speak perfectly well, old chap. It has just been a while. I've been travelling for what seems like years, marching through every type of barren terrain, crossing ravines, avoiding goblins, surviving on the local flora and fauna. All this time with no one but myself. I haven't said a word for months. It takes a while to wake the voice sprites up. They've been sleeping.",
    "Lonely? No, I like my own company.",
    "I'm looking for the edge of the world. It is my life's ambition to find it and be the first gnome to stare over its edge.",
    "Everything has an edge and eventually I'll find it. I'll keep heading westwards until I get there.",
    "Spherical? Don't be silly! The world is clearly flat. If it was ball-shaped, we'd all roll off the side. Silly human.",
    "Well, now you're just making fun of me. I don't think you realise the gravity of the situation.",
    "Well, that is true, but I'm only doing that as a detour from my journey to the edge of the world. I figured it would be on the way.",
    "I believe so. Gnomes that I have talked to have suggested that Glouphrie headed west into the mountains; however, since Glouphrie was a master of illusion, I suspect the city itself will be a hard place to find. I have found a waste outlet. I believe it may be coming from the city of Arposandra.",
    "Well, have a look. There is a huge swamp of nasty goo out west, and if you have a look you'll see a large outlet. That outlet seems to be filling the swamp. The only creatures that I am aware of in the area are elves – and elves don't do that sort of thing.",
    "Well, indeed, but there is one other thing. The outlet appears to be patrolled by a creature that suggests gnomish involvement. Giant tortoises!",
    "I am unaware of any other civilisation that uses the tortoise. There seems to be something wrong with it, though. It seems...unwell.",
    "It appears to have large tentacles growing form underneath its shell.",
    "Well, whatever you call it, it's not normal; maybe its illness was caused by Glouphrie's magic.",
    "Well, if it is, it's a pretty solid illusion. I have the scars to prove it. Anyway, the way is blocked as well, buy some nasty-looking roots. So, even if you could sneak round the tortoise, you'd have to find a way past them too."
  ],
  "Spirit Tree": [
    "So alone, my brethren cannot hear me.",
    "...",
    "The tree whisperer has come to my aid. Thank Guthix.",
    "You may call me Incomitatus, for I am alone and friendless. You are not a small person of Guthix. How do you speak with me?",
    "Only those who have opened their minds to the spirits of the earth can talk with spirit trees. You surely must have been trained by a great friend of trees, as this is a gift not easily come by.",
    "The one you call Hazelmere – yes, he is a tree whisperer. He is a friend of trees. He would be able to help me.",
    "I have lost my connection to the anima mundi. The earth has corrupted my roots and they find only black ichor. My xylem and phloem are tainted, and as a consequence I am alone.",
    "Most spirit trees are connected to the anima mundi. She allows us to speak with each other, and she allows passage of those attuned to her from tree to tree. I sense you have travelled the anima.",
    "Thank you. You truly are a friend of spirit trees; a true tree whisperer. Now that my connection with the anima mundi has cleared I sense that my roots have been blocking your path into the caves underground. I shall move them to allow you access. Something that is tainting the anima is happening around here, and the answer lies beyond those caves. Please, for all of our sakes, seek the source of this. May Guthix be with you."
  ],
  "Hazelmere": [
    "What? What do you want? Don't disturb me like that. I was deep in contemplation. Looking into the future is not something you can do on a whim, you know.",
    "Well, you should know, [Player]! You called me, stupid human. Bah! You give a human a gift, known only to the privileged few, and they start jabbering at you at the most inappropriate times. I was in the middle of a dream, a vision of the future. There was something I was meant to see, something that would save my life. Anyway, just as this was to be revealed to me, I was thrown out of my meditative state by your fumbling and stumbling attempts to mindmeld. Well, you'd better have a good reason for this, otherwise I'll...",
    "You must have had some help to meld with me from such distance; you humans are not attuned enough to make a direct connection via the anima mundi. Hmmm, you seem to be using a spirit tree as a conduit. Though, this tree is unwell.",
    "Harrumph, I suppose so. Let me try to sense the problem.",
    "Ah, sorry about that, [Player]. In order to fully meld with the tree I had to use your spirit. The tree you are speaking with is weak. However, you don't seem to have suffered any permanent damage. That's fortunate.",
    "You have a strong spirit; I assumed you'd be alright. And, after all, it's the spirit tree that really matters. You'll only live for a handful of decades, the tree should live for centuries.",
    "Well, I know why the tree is unwell. Something has poisoned the soil, blocking the tree's connection with the anima mundi. This is worrying in itself.",
    "Well, no poison could do this; only by separating the anima mundi from its source...",
    "I forget I'm dealing with a human. I'll spell it out nice and clearly for you. The anima mundi is created by all natural things – it is their 'soul' and a sort of natural energy. It is powerful and dangerous, and only by the balance of Guthix does the anima mundi remain in check. Creatures live, creatures die. The balance is maintained.",
    "Powerful magics could be used to separate the anima mundi from its source. This would produce a great deal of power; power that could be used in an unbridled way, but doing so would unbalance the whole pattern of life, and the ichor Incomitatus speaks of appears to be the unnatural waste product of such tinkerings.",
    "Probably, but to make enough of this ichor to create a swamp would take an enormous amount of work and would create a dizzying amount of energy. It would be an abomination, to plunder the earth in such a massive way. Who would need to do this?",
    "Hmph, maybe. Anyway, our immediate problem is to help our spirit brethren.",
    "If you had been paying attention, you'd remember that I said this is no normal poison. Some sort of spiritual cleansing will be needed in order to return the spirit tree's connection to the anima mundi: something pure. I do not have the power to do this kind of thing. This will require elven magic. Elven magic revolves the power of Seren. Seren is the divine aspect of the anima mundi that the elves revere. They use their voices to charm those things connected to the anima. They call it chanting. So I would guess you will need a spell of an object that will 'chant' the anima mundi back into the spirit tree – purging the ichor out of its roots.",
    "I doubt you could persuade one to come here, even if you could find one. No elf has been seen anywhere near the gnome lands for centuries. Hmm, you already have an answer. You are carrying it.",
    "A pure note, created by pure elven crystal, would have a purifying effect on whatever is nearby. So, something like a crystal chime would certainly have the right effect.",
    "What on earth are you doing, stupid human?",
    "You're not dead yet, fool! Snap out of it!",
    "Pull yourself together! We haven't got much time.",
    "I was saving this for a special occasion. I suppose saving your hide counts.",
    "Megal!",
    "Argento's last gift to me has died. I have but one. *Sigh* Well I have made my choice. So be it.",
    "Never mind that, I'll explain later. We need to get out of here.",
    "Blah. Blah, blah, blah, blah...blah!",
    "You did a good thing helping the tree; I was returning the favour. You have shown more empathy towards the anima mundi than any gnome I've known for a long time. It was right of you to think of me. Despite being a human, perhaps you can be a true spirit tree mage. Thank you, [Player]. You have shown me the future, whether you realise it or not, and it is not a place for old wizards like me. My autumn is ending, and only winter remains.",
    "Do you remember when you called me the first time? You disturbed my contemplations. I was having a vision of the future. In it I sensed that Guthix had decided that my work on Gielinor was almost done. I had one last choice to make.",
    "Maybe not. But the first part of it has now come to pass.",
    "Never mind that. It is even more important now that you understand your future. There will be a time of great change and you will do a great good during this time. At times your task will appear impossible, and it will seem as if the power of Guthix, which you will seek with mighty intent, will slip away even after you prevailed so hard, but don't give up hope.",
    "Stop joking around and listen carefully. This is important. Skilled brothers, numbering eight, will assemble to fight the mahjarrat deceiver, and they will be heading north to confront him. The time after this is...clouded to me, but I see you clearly, dressed in the evil robes of night, lightly decorated with ochre, like burnished gold and the rust colours of autumn leaves. Though the robes represent an order of evil, you will not follow that path. You will remain true to Guthix. Of the eight, only two shall return; one represents the path of Slayer and one the path of the warrior. This might have been different, but I have made my choice, and it is up to you to prove that I made the right one.",
    "Dreams? Maybe. Dreams often reveal truths masked by the light of day but I know the truth of what I have seen in my bones. I have seen my end.",
    "All I know is what the trees tell me. It will soon be time for me to pass the guardianship of the spirit trees to someone else. Maybe that person is you, [Player].",
    "Do not worry. I have faith you will learn what you need. Anyway, enough moping about the future. Do not worry, we shall meet again, though maybe the next time will be the last.",
    "You have more important matters to attend to than chatting to a cranky old gnome. Go!"
  ],
  "Guard no. 21": [
    "*Sigh* So, how did you get this ropey old job then, Seventytwo?",
    "What for?",
    "You fell asleep? I thought the Gnome Masters made it impossible for us to fall asleep.",
    "Still, at least you got to guard upstairs! Something happens up there at least once a year. I've been down here since I was de-podded. Nothing happens down here.",
    "You'd think so, but they always seem to be making a mess of the pods – you've seen how many failures get dumped 'outside'.",
    "Calm down, nothing ever-",
    "Press the red button! Quickly!",
    "Unless it's an emergency! Press the red button. Now!",
    "I'm not panicking, you're panicking! Press the red button!",
    "I'm not allowed to! You have to do it!",
    "Squawk!"
  ],
  "Guard no. 72": [
    "I think it's a punishment, Twentyone.",
    "I fell asleep while guarding 'upstairs'.",
    "I dunno, maybe I'm defective. I blame the Masters myself. Anyway, I got the choice, either take this job or go 'outside'.",
    "You'd have thought the Masters would make it impossible for us to get bored as well.",
    "True. Wait! Did you hear something?",
    "There's someone there! Squawk! What do we do?",
    "They told us to *never* press the red button!",
    "Squawk! Don't panic!",
    "You do it!",
    "Don't panic! Don't panic!"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:The_Path_of_Glouphrie?oldid=36192290’"
  ]
}