{
  "Ariane": [
    "We must do something about the eggs.",
    "There may not be much time. Please, whatever you are busy with, get back here as soon as you are able.",
    "Thank goodness you are safe. We thought we'd almost lost you at the Battle of the Monolith.",
    "Azzanadra? I'm not sure what to make of him. When I first met him, I was pleasantly surprised he wasn't the monster I'd made him out to be in my head. But then with that betrayal, I wonder... Was it all an act?",
    "Well, regardless, the outpouring of shadow anima from the Monolith has agitated the eggs. I don't think we have much time left. We need to do something now.",
    "We should head into the Elder Halls. I've been working with a mutual friend of ours...",
    "Since last we met, I sought out 'Reldo'. You didn't quite tell me the whole truth there, did you? Though I do understand why.",
    "Indeed, we all have our secrets, and often good reason to keep them. Shall we head in?",
    "Oh, stop. Your charms don't work on me, Charos. Besides, you have me beat when it comes to enchantments. In fact, Charos and I have been having discussions abou-",
    "Right! Yes! The eggs!",
    "It's chilling to think that the elder gods could be reaching out to touch them any moment now. We've been mulling over potential solutions, but welcome new insight.",
    "Likely, it's possible, but I don't think that's advisable.",
    "That was my first thought - to starve them. From Charos's own research, that appears to have been precisely what Guthix was doing for many ages.",
    "Also, my own history with such a plan was... Well, I don't really want to go there again.",
    "If we had a million people with thimbles, perhaps...",
    "Say, like some gods on our side...",
    "Though I doubt the elders would stand by and let it happen.",
    "Regardless, it's not something we could easily achieve here, given we are sat in this nexus of anima flow. Alone, it's not the solution.",
    "I doubt there'd be anything we could do with magic. All magic effectively comes from the elder gods. Whatever we could achieve, they could undo.",
    "And we won't tell anyone otherwise.",
    "True, that could help give us more time. Though moving something like these, safely - that's no simple task.",
    "Still, such magic would be beyond any of us. We'd need a powerful ally to assist with such a plan.",
    "Okay, one completely selfless god coming up... *sigh*",
    "That's it! If we combine two of those ideas - move the eggs somewhere away from The Heart AND drain them of anima, we can at least buy ourselves some more time.",
    "Right. So we need to figure out a location. It needs to be a place we can defend, er, from elder gods...away from major cities...but not out in the open...",
    "I mean, it could end up with your worst enemy...be sent directly to the elder gods...into the sun...",
    "And anywhere without a populace is unlikely to have well-maintained defences.",
    "Any place like that would be very hard to defend.",
    "We figure we should move the eggs to somewhere away from this anima flow, a place where we can defend should we need to. We're a bit stumped, though, so if you have any suggestions, we're all ears.",
    "Did you have a location in mind?",
    "Senntisten?",
    "Go. Charos and I have things covered on this end.",
    "Well, I think so. Even in spite of what the Zarosians did.",
    "He also did offer to sacrifice his own power for the move. How many gods would so freely offer such a thing?",
    "I see what you mean about him seeming conflicted. If he were human, I'd have read his words as...shame?",
    "Believe me, I was wary when he just showed up again like that, but there's a lot of logic in what he says. We just need to be more vigilant this time.",
    "You should go meet with him, see what he wants to discuss and judge for yourself. Just...give him a chance. He did save lives at the Battle of the Monolith, after all.",
    "I'll stay here with Charos to coordinate the teleport from this side. Contact us when you're ready to move the eggs.",
    "Give Azzanadra a chance. He does genuinely appear to be contrite.",
    "We're ready. No change here.",
    "Oh! Yes. I was going to join you in Senntisten, wasn't I? I've been a bit pre-occupied with matters of the Heart... so to speak.",
    "'Aggravatingly obsessed', is how Archmage Sedridor used to describe it...but I'll sleep when I'm dead, and thanks to you, that's not as imminent as I envisioned.",
    "I've discovered all sorts of fascinating magical phenomena in the Elder Halls. I could spend years here, trying to make sense of them. Maybe I will... now we're not all destined to die horribly."
  ],
  "Player": [
    "If it wasn't for Azzanadra, I don't think I'd still be here...",
    "Acting isn't really his thing. From what happened at the Monolith, I get the sense he is a bit conflicted.",
    "What do you propose?",
    "Oh, who's that?",
    "His secret wasn't mine to tell.",
    "Charos! Good to see you. Is Thok not with you?",
    "Kerapac managed to destroy the Stone of Jas using other elder artefacts. Maybe we could do similar with these eggs.",
    "Yeah, you're probably both right.",
    "Could we drain the eggs, stall or stop them from hatching?",
    "Hey, you two...",
    "What about hiding them, either with magic or in another place?",
    "Both good points.",
    "I was about to suggest we could fight the elder gods, then realised that would be a silly idea.",
    "How about moving them from here. They'd absorb less anima.",
    "We could send them to a place we don't know, just randomly.",
    "Er...",
    "Okay, never mind. It's a bad idea.",
    "Is there a city we could send them to? Somewhere already with defences?",
    "What about somewhere in the open, away from population centres.",
    "I'm out of ideas, sorry...",
    "Azzanadra. Why are you here?",
    "Even given what he said? And what about his order to NOT concern yourself with these eggs?",
    "Pipe down, you two!",
    "...",
    "Phew! Just as well it wasn't obliterated thousands of years ago, else we'd be in real trouble...",
    "He always has been with me.",
    "Other than that business with Saradomin's crown, yeah, he is.",
    "Before that business with Saradomin's crown, I'd have agreed, but now I'm not so sure.",
    "Are we really going ahead with this? Trusting Azzanadra, I mean?",
    "...",
    "I guess I should head to the Archaeology Guild and see what he wants. Off to the old Guildmaster's office it is...",
    "Right. I'll head to the Archaeology Guild and see what Azzanadra wants to discuss with me. I think he said he'd be up in Guildmaster Tony's old office.",
    "What did you wish to discuss? We could have gone over the plan with Ariane and Charos.",
    "Considering what I know now, not much at all.",
    "What are you saying?",
    "Well, risking your life to close the Monolith didn't hurt your case. Thank you for that, by the way.",
    "What has it meant for you? You're a god now, yes?",
    "Who should we contact?",
    "Okay, I will talk to each of them, lay out the plan and try to convince them.",
    "Where are each of the gods?",
    "Since you stole his crown. I can't imagine asking for his help will go too well.",
    "Okay - Armadyl, Saradomin, Seren, Zamorak and Icthlarin. Then meet you back here.",
    "Armadyl is with us. He was pretty easy to convince.",
    "Icthlarin will not assist this effort. He really doesn't like Mahjarrat. Though he did say he'll search for another way to help.",
    "Saradomin is clearly still sore about Zaros stealing his crown...but it seems he is true to his word about wanting to defend Gielinor's people.",
    "Seren is not happy with you working behind her back, nor about the fight over the Monolith, but she will join us in this. I think more to ensure the eggs are kept safe than anything. She feels like you've forced her hand.",
    "Zamorak is on board too.",
    "Just like that? Don't you want to hear the rest of the plan?",
    "You heard of what Azzanadra did, though? Stealing Saradomin's crown? The Battle of the Monolith?",
    "That was...easier than I thought it would be.",
    "Azzanadra is at Varrock Dig Site - he's working to obtain entry to the buried city of Senntisten, where we'll mount our defence.",
    "Hello, Icthlarin. I'm here because I need your help.",
    "About that...",
    "It's not his plan, he's just helping out with part of it. He also risked his own life to save mine. He's trying to make amends. I think he's more god now than Mahjarrat.",
    "So you won't help?",
    "Ariane, Charos and...Azzanadra.",
    "You saw with your own eyes, Zaros has gone. He somehow...went into the Monolith at the Archaeology Guild. It appears as if he has abandoned this world and everyone on it.",
    "Azzanadra saved us all by closing that portal, and at great risk to himself. Doing so has changed him; he's a god now.",
    "He has no orders from Zaros and he wants to help.",
    "Senntisten...",
    "Azzanadra thought tha-",
    "The Archaeology Guild has excavated a portion of it still standing, deep beneath the surface.",
    "Lady Seren, we need your help. The council's too.",
    "This is my plan, not Azzanadra's and not Zaros's. With Zaros gone, Azzanadra is at a loss. He just wants to help, maybe even make amends.",
    "There is no more time left. Certainly not enough time for making a perfect garden anymore.",
    "Great. When you are ready, we are establishing our defences in a recovered portion of Senntisten, beneath Varrock Dig Site.",
    "I need to contact Zamorak. Is that something you could help with?",
    "I have questions for him, but I need to impress on him the urgency. Plus this is a matter that directly requires the intervention of gods.",
    "Since your return? You've been away?",
    "The situation is too dire to start up old rivalries. It will take all of us working together to even survive.",
    "Gah! Why did he teleport me all the way out here? Such a jerk.",
    "Cut it out, both of you. I don't wa-",
    "No, I'm not listening. You're just voices in my head.",
    "I have agreement from most of the gods. They are gathering their forces and will join us in Senntisten as soon as possible.",
    "None of them were thrilled. Most had unpleasant things to say about you, about Zaros and about each other.",
    "Yes. Unfortunately, Icthlarin was a holdout. He really does not like the Mahjarrat.",
    "He did say he would search for some other way to assist our efforts.",
    "Right, yeah. Jimmy gave me all the materials I need. I'll get right on it!",
    "Aha! This figurine must have fallen off its pedestal. It's a bit damaged, though...",
    "I need to place a restored Pontifex Maximus figurine on here...",
    "Hey, Jimmy. Do you happen to have any leftover materials from when the team excavated this entrance?",
    "So, why is it named after you?",
    "How can you tell?",
    "So, we're really doing this...",
    "Well, doing nothing would have been worse.",
    "Wards?",
    "Why ancient magic, though?",
    "That's a lot to take in...",
    "Thank you. I'll hold you to that.",
    "Now, for the wards. Where to start?",
    "Empty.",
    "No joy.",
    "Nothing.",
    "There's nothing here.",
    "This is fruitless.",
    "Wait, I think there's something in here, but I don't have room to take it.",
    "Is this what we're in need of? It's like some sort of light globe?",
    "I've looked all over. Haven't seen anything that sounds like one of these wards.",
    "These must be the lights Azzanadra mentioned. I should light as many as I can - that should make it safer to navigate through this part of the city.",
    "I have to risk it. I might need to place this light globe elsewhere.",
    "Good point. I'll leave it where it is for now.",
    "The wards are repelling each other. I don't think I can carry more than one at a time. I should deliver the one I'm holding to Azzanadra in the cathedral.",
    "There's maybe a ward in here somewhere.",
    "I should probably see about that ward before I start messing with anything else.",
    "Hmm... It looks like this bottle might open the door.",
    "But I can't see anywhere to pull or activate it.",
    "That's... a surprisingly good idea[sic]",
    "Ah, I thought that was working for a second there.",
    "Yeah, I think that's best.",
    "I think I should look around for more clues before I play with this.",
    "Looks like all the blood has flushed out.",
    "Nothing else of interest here, I've already got the checklist.",
    "Nothing else of interest here, I've already got the note.",
    "It's empty, I've already got the ledger.",
    "Interesting, it's a log of all the transactions made at the blood bank.",
    "What do you mean?",
    "Thanks for that. I think I see what you're saying. There should be two full bottles on day 479 but an eighth of a bottle is missing.",
    "I think I should figure out what other numbers aren't adding up.",
    "I think I have enough information to figure out what blood I use to open this.",
    "I'm working on it[sic]",
    "Looks like that wasn't right, all the blood has flushed out.",
    "No! I was just...doing my World Guardian duties and looking for anything helpful we might've missed.",
    "Look, I was just trying to see if there wasn't anything useful here to help save the world! End of conversation!",
    "I don't have room to take it.",
    "I don't have room to take it.",
    "Then I guess I'd better get ready to run. Here goes nothing...",
    "No, it can't be. That laugh...",
    "No. You're not real. It's in my head.",
    "Yeah... Yeah, that would explain it.",
    "I don't have room to take it.",
    "There's some kind of magical barrier stopping me. Maybe there's some way to shut it off.",
    "What was that noise?",
    "No, it's just me. You two aren't real.",
    "I need to free some inventory space to take this journal.",
    "It appears to be a journal of Inquisition matters, maybe this can help release the shadow ward?",
    "Okay, fair point.",
    "I'm trying to pick up the journal.",
    "If I have the journal, then whats[sic] this on the desk?",
    "I...uh, I think I need to sit down.",
    "This journal was written by Sliske!",
    "It mentions some individuals he was interested in, but I can't see anything that will help me unlock the ward.",
    "I should see if there's any other clues around here to help.",
    "There's something off about these.",
    "I wonder if something in the journal is the key to opening these drawers.",
    "It looks like a magic button, I have the strongest urge right now to press it.",
    "I shouldn't.",
    "Hmm, looks like this is connected to filing cabined, perhaps it's a master switch.",
    "I've already unlocked the ward.",
    "I've already unlocked the ward.",
    "Is that a ward in the middle of those statues?",
    "What happened? Those flashes blinded me for a moment.",
    "Great. I guess I'll have to hunt them down...",
    "There's some kind of magical barrier stopping me. Maybe if I hunt down those gargoyles...",
    "I don't have room to take it.",
    "What further preparations are needed?",
    "How long do you think such defences will hold?",
    "Kerapac!",
    "Are you here to help us?",
    "You don't have to do this, Kerapac. You hate the elder gods.",
    "He is also the Needle's avatar. He has control over time. Alone, he could probably kill every single one of us without breaking a sweat.",
    "He said 'sleeping army'. Could he mean the Nodon dragonkin?",
    "Oh, er, nothing. Just lost in my thoughts.",
    "I...",
    "What should I do?",
    "What are you still doing here, Ariane?",
    "It's a bit underwhelming. It's barely any better than the pontifex observation ring.",
    "I don't think I should play with this right now.",
    "Well, the strange filing cabinet is definitely a no go.",
    "Wait, it doesn't even teleport me into the cathedral? This ring is lame.",
    "Don't you go by 'Jimmy'?"
  ],
  "Charos": [
    "I knew you'd still be kicking around...and at the centre of things.",
    "Not on this one, fortunately. Don't get me wrong, there was never a dull moment with Thok, but his brand of 'hit first, what even are questions?' would probably be a bad idea down here.",
    "It's also refreshing to have a partner of intellect again. Ariane here is a delight; she has a beautiful mind.",
    "Now now, let's not get into that just yet, Ariane. All in good time... Besides, we have more pressing concerns.",
    "The Battle of the Monolith caused an outpouring of shadow anima. The eggs are on the verge of hatching.",
    "The way we see it, there are two core issues - how to stop the eggs from hatching and how to stop the elders from touching them.",
    "I concur with Ariane. See where Kerapac is now...though I imagine the fallout would be a million times worse.",
    "Also, unfortunately for us, the flow of anima to this place is incredible. Unlike anything I've seen before. Such that draining them would be akin to bailing water out of a sinking boat using a thimble.",
    "Or a handful of powerful buckets...",
    "Hmm, it might help keep things at an equilibrium, but they'd need to concentrate on nothing else.",
    "Apologies. We do get wrapped up in our thinking sometimes. I fear things have come to too much of a head for this solution to be the answer now.",
    "As for physically hiding them. Where in the universe could they not go?",
    "Quite. Good job you didn't suggest it then.",
    "Hmm, I could help on the safety side. I created some abyssal stabilisers one time for a particularly nasty prank - don't ask - which I should be able to adapt for these eggs.",
    "Indeed, and one not unwilling to expel the amount of power this would take.",
    "Hmm. It's a start. We'll need some spare gods for the latter part - Seren and the council should be able to help there. Though maybe not with the moving part.",
    "Next problem... The elder gods would notice. They'll come after the eggs.",
    "Wow. That's a terrible plan.",
    "Name a city without a population. No, I fear that would be too risky.",
    "Indeed, it would need to be a place that we could hole up in for a prolonged period.",
    "Um, we didn't say anything. We're hearing this tall gentleman out.",
    "Indeed. Moving the eggs was our best plan, but we didn't have a how or a where? I'm Charos, by the way.",
    "Well, that's the first part! I'll get to work callibrating[sic] my abyssal stabilisers; they should help make it safe to move the eggs.",
    "You know, that might actually work.",
    "So, that was Azzanadra, huh? Friendly for a Mahjarrat, isn't he?",
    "Well, the plan is sound. It was our plan, after all, he has just helped fill in some blanks.",
    "We most definitely can't leave the eggs in the place that was designed to hatch them. We have to move quickly.",
    "For what it's worth, he was being sincere. Not a word of a lie was spoken, from what I could tell, and you know that I have some, er, experience where it come to...trickery.",
    "Ever the pragmatist.",
    "Good luck, We will join you when we can."
  ],
  "Azzanadra": [
    "Perhaps I can be of assistance.",
    "I am not here under orders, if that is your meaning. Indeed, in the first time since I pledged fealty to Zaros, I have no orders...",
    "Do not misunderstand me. My loyalties still lie very much with Zaros. I trust that his plans with the Monolith are to the benefit of all.",
    "I took that to mean in the moment, as there was something of more import. Namely, retrieving The Locator.",
    "But...orders or not, I could not stand idly by. I do not believe Zaros knew the effect his departure would have, and there is a way I can help.",
    "Player and Ariane, I also wish to make up for my slight against you both. The last time I was here, I left rather abruptly. Now, I just want to help.",
    "Azzanadra. Any friend of Player is a friend of mine. Even if they no longer consider me as such.",
    "Thank you for saying.",
    "I intend to be.",
    "I assure you I have no ulterior motive.",
    "I am sorry to hear you say that.",
    "Very well.",
    "I believe I can teleport the eggs. Doing so would require a significant amount of power, but it just so happens I have recently gained a sizeable reserve. I would gladly sacrifice some to help you enact your plan.",
    "Excellent.",
    "The elder gods must touch the eggs to hatch them correctly.",
    "If they make a direct assault, their young could be destroyed.",
    "If they cannot attack themselves, they will send forces both martial and magical.",
    "We cannot know who, but they will be powerful. We need a defensible location.",
    "We must gather the gods. They can drain the eggs to keep them from hatching.",
    "It falls to their followers to hold off whatever is coming.",
    "The battle to come will be apocalyptic. The world is at stake.",
    "We must keep the fight away from the common people.",
    "My agents recently uncovered a location which is both fortified and remote.",
    "A place I know well.",
    "The City of Senntisten...",
    "It was never destroyed fully. Parts of it still stand buried deep beneath the Varrock Dig Site. Zamorak only occupied the city. Later, even Saradomin could not destroy it fully, merely build atop it.",
    "We cannot do this alone, however. All should be involved in this venture. No more subterfuge.",
    "We must stand together regardless of our alliances, our histories, our past betrayals... This moment requires it.",
    "Player, please come meet me at the Archaeology Guild. There is a more private matter I wish to discuss with you.",
    "Very good. I shall await you upstairs in the old Guildmaster's office.",
    "And I... I will not let you down this time. You have my word, for whatever that might still be worth.",
    "If you would be so kind, my team have left this last step of excavation for you to do the honours...",
    "We will have time to discuss more of the city once we are through.",
    "Excellent, you have cleared the way, though there is one final step before we can enter this part of the city. We require a Pontifex Maximus figurine.",
    "Try searching around the empty pedestal. It might still be there somewhere.",
    "You should try restoring the figurine you found over by the empty pedestal.",
    "Perhaps there were some leftover materials from when the dig team excavated to here.",
    "Talk to Jimmy, the intern. He should still be waiting outside the surface entrance down to here.",
    "You should try restoring the figurine you found over by the empty pedestal.",
    "Excellent. I see you have a figurine of...who I used to be. Place it on the nearby pedestal to remove the barrier.",
    "Please, follow me.",
    "Well, this brings back memories.",
    "This old cathedral can be our safe haven.",
    "Yes, this should suffice.",
    "Player, over here.",
    "Wait. It is too dangerous out there right now. The shadows of the empire are very literal and would drain your life force within seconds.",
    "So, here we are... Welcome to the city of Senntisten! Part of it, at least.",
    "Before I teleport in the eggs, we can take advantage of this comparative calm. Do you have any questions for me regarding the city?",
    "This is, rather pointedly, the Cathedral of Azzanadra. I did not name it; it was named in honour of me.",
    "I regularly toured the city's religious sites, delivering sermons, though rarely this particular one.",
    "If I recall correctly, it was here that, on one of those rare visits, I had a particularly nasty encounter with Lord Drakan.",
    "The pontifex here sought to commemorate my victory, though I do not recall it being a victory on my part. Such is the way of believers.",
    "This was back early in the Third Age, the beginning of a long hunt that ended with my imprisonment in the desert.",
    "This was one of the city's more affluent areas, given its proximity to the palatial district.",
    "It was highly gentrified, but such areas of the city also had higher levels of security - they had more to protect. That should serve our needs well.",
    "With any luck, some of the higher security buildings still stand. We will have use for them or what they might still contain.",
    "I believe there was an avernic arsenal nearby this particular cathedral - a storehouse of demonic weaponry. That could be of use.",
    "Also, such affluent areas tended to have a concentration of our vampyric citizenry, so no doubt there will be a blood bank. Those stores had high levels of security to protect their wares.",
    "Ah...and the Inquisition was headquartered here. If that building still stands, it would be among the most protected. Sliske could not have the secrets of the empire leaking out.",
    "If memory serves, this area was heavily fortified. It appears to have held against usurpers until its last - see, there are no signs of Zamorakian occupation.",
    "For one thing, this cathedral still stands. Zamorak would have defaced such buildings, and Saradomin would have torn them down or buried their existence, I have no doubt.",
    "No, I imagine this area of the city remained a haven for Zarosian loyalists until its fall...and then was buried.",
    "Very well. No more stalling...",
    "This central dais looks like a good place to bring the eggs. Let me contact Ariane...",
    "Ariane, we are in place. Are things ready on your end?",
    "Indeed, there is no turning back now. Even if we returned the eggs to the Elder Halls, I do not think that would placate the elders.",
    "Indeed. And so we must build up our defences. Our allies will be arriving soon enough with whatever military forces they can commit.",
    "In the interim, we should work on the magical defences for this cathedral.",
    "We must search the city for magical wards. One for each ancient element is the best we can achieve.",
    "I am sure you must be familiar with the concept of wards - shields wielded by some magic users. These follow the same principle, dampening magical energies, but for a given location rather than an individual.",
    "They work akin to the diamonds used to entrap me within Jaldraocht, though in reverse. They were aligned to contain me; magical wards here could repel outside forces.",
    "Even my brief exposure to shadow anima has given me great insights.",
    "All common magic derives from the elder gods in one way or another - the Stone of Jas, other elder artefacts... To use their own magic against them would be folly.",
    "I have much still to learn, but I now believe that the ancient elements come from someplace else.",
    "Shadow Realm, shadow anima, shadow magic - it's obvious on the aesthetic level, but I feel there is some deeper knowledge to be discovered here.",
    "Indeed, Kerapac warded his own lab directly with shadow anima, and though while shadow magic is superficially connected, it is different and far, far less potent.",
    "However, the ancient elements combined can perhaps approach a level of warding that mimics shadow anima.",
    "I still do not know what my exposure to shadow anima means for me in the long term - indeed, not for you either - but we can take advantage of this knowledge in the short term.",
    "I have no doubt this is a topic Zaros has far more understanding of. No doubt, it is likely part of the reason for his departure. I wish he had shared his findings with me.",
    "Even if I fail at repairing our relationship, I vow to you here and now that I will share anything salient to you that I discover.",
    "They were typically installed in areas of high security. There should be one within this building. Try searching around, though do not leave the safety of the cathedral.",
    "Please, keep searching.",
    "Player...",
    "No. It is a light source. Hold on to it, though. I have a feeling you may have need of it soon.",
    "On second thoughts, perhaps there isn't a ward within the cathedral...",
    "Hmm, that is disappointing.",
    "Ah! I wonder... They may have a spare in the storage annex! It's the small outbuilding outside the west door, just down the first lot of steps.",
    "I can sense danger out in the rest of the city, though. Given the nature of this city, it was perilous to walk its streets in the dark.",
    "While ancient magicks are a powerful tool, they have a tendency to draw...'unwanted attention'. The very darkness itself will drain your life force.",
    "Senntisten has powerful magical light sources installed around the city to chase away these shadows. If you can get some of these light pedestals working, it will make the city safer to traverse.",
    "Take a means of healing with you. Do not tarry and do not search afar. Please return quickly...and be safe.",
    "I am holding on to some light globes you misplaced. Free some room; I feel you may need them.",
    "Here, you misplaced these. I think you will find them useful outside the west door.",
    "Please explore the west of the city to retrieve the wards. I will continue preparing this cathedral for our allies' arrivals.",
    "Well done, we are halfway there. The remaining two wards should be in buildings out of the west cathedral door.",
    "One final ward remains. head back to the west of the city. I am certain you will track it down.",
    "Seren, I am glad you would come.",
    "As do I.",
    "We merely tracked down their location and observed them. I was simply following orders. When it became apparent how close to hatching they were, they had to be moved.",
    "Forgive me.",
    "...",
    "On a similar topic, there was another thing I wished to discuss with you. Recent events have given me much to ruminate on.",
    "For a long time, I despised you from afar. You came to our fledgling tribe and tricked us into committing ritual sacrifice, a barbarism that has decimated my kind ever since.",
    "Please, let there be no more misunderstandings between us. Let me say my piece.",
    "I let go of that a long time ago. I have long since come to understand your point of view. You made a difficult decision, but I see the pragmatism of it.",
    "Without the sacrifices, the Mahjarrat would not have survived Freneskae. Nor would we have known how to create more of our kind.",
    "We may be few in number, but we are stronger now than ever, and have endured. Without your intervention, we would not have.",
    "Regardless of your own feelings on the matter, I just wanted you to know I no longer hold any grudge with you. I trust in your intentions, then and now.",
    "Saradomin, I...",
    "Still, I appreciate that you would still aid us after what transpired.",
    "Of course.",
    "...",
    "My loyalty remains with Zaros.",
    "It is.",
    "I have a way of contacting them, yes.",
    "The means of my ascension differed from your own.",
    "This is not a game, Zamorak. If you are not taking this seriously, then perhaps you should leave.",
    "So you did not come just to mock me?",
    "You shall not impugn my loyalty to Zaros as some base glamour. I remain loyal in spite of his absences, because I believe in him.",
    "As I said, I believe in him.",
    "I...",
    "I shall.",
    "Please, both of you, we cannot allow old disputes to flare up. Especially not around those eggs. We do not know how fragile they are.",
    "Any sudden influx of anima - say that from the corpse of a life-long rival - could cause them to hatch.",
    "Then we might have THREE malformed elder young to deal with, and some mightily vengeful parents. The eggs may not demand our reverence, but they should command our respect.",
    "If you insist on fighting, take it elsewhere and leave saving the world to the rest of us.",
    "Thank you for accepting the call, Armadyl. I am sure you must be sick of war by now, but have you brought no forces?",
    "If we fail here, I doubt anywhere will be safe. Not even the Abyss this time.",
    "As their god, why would you not lead them in this?",
    "I do what is needed of me.",
    "I have needed for nothing since taking up Zaros's banner.",
    "These are no aviansie.",
    "Player, the final ward is in place. Now, let us figure out the rest of our defence.",
    "We must now marshall whatever military forces we have, build physical barricades and prepare the staging area to the north.",
    "Fear not. It is just a projection.",
    "Not so. We know they are coming now, and it at least confirms the elders don't plan a direct attack. They are using Kerapac as a proxy. That means we can hold out.",
    "That would be the logical conclusion.",
    "Player, you've gone quiet.",
    "We need to coordinate, and quickly. There's no more time for petty disputes and squabbling. We have no choice but to mount a unified defence here. If we do not stand together, all will be lost.",
    "What? Me?",
    "But I...",
    "...",
    "I...will not let you down.",
    "Leave the martial defences to me, Player. We will hold the elders back for as long as we can. Time enough for you to do what you were made for, World Guardian.",
    "I place my faith in you.",
    "Well, I don't know if I've succeeded in repairing the damage to our relationship, but you have certainly succeeded in preparing our defences here.",
    "I have some things for you that might help in the struggles ahead...but please make some room for them first.",
    "There are many tribulations still ahead. I hope these will assist you...all of us...in the struggle."
  ],
  "Shadow Voice": [
    "A likely story.",
    "So is Azzanadra these days, it seems. I've never seen a bunny quite like it.",
    "Don't be silly. Azzanadra doesn't have a sense of humour. Becoming a god would only have compounded that!",
    "He might trust us, but I don't trust him. He's too quick to get on board. There's something fishy going on.",
    "Well, obviously we're not Sliske, but please spare us the armchair diagnosis.",
    "Hey! Don't forget us!",
    "This is going about as well as I suspected.",
    "Urgh, petty sibling rivalry. This one's going to be no help.",
    "Spies. He's clearly talking about spies, right?",
    "None of this is good. Just think of the history of who's joining us in this. This is going to go horribly.",
    "Urgh! That light! It hurts my eyes.",
    "Yes, remove it! Embrace the darkness!",
    "Yuck! Can you taste that? In the air? Is that metal?",
    "Stop being silly. You're no sommelier.",
    "I've got this one. Just try tossing a bottle of the red stuff in there, it's probably just some good, old fashioned blood magic keeping it shut.",
    "How boring, I thought there'd at least be an explosion.",
    "Ooh, a blood thief? Someone siphoning off the capital's reserves? Oh, how I love a conspiracy.",
    "Hmm, dragon blood, a little spicy for my tastes but I understand the appeal.",
    "Get a move on!",
    "Ooo, trying to sneak a bottle for yourself were we?",
    "You see to me, it looked like you were trying to appropriate some magically preserved bloods, I'd imagine they'd fetch a pretty penny.",
    "Oh please! They're a master thief, they've even got the cape to prove it!",
    "Oh please! Whilst they may not be as good a thief as I am, they've clearly got some experience picking pockets.",
    "I can feel the anti-magic effect from here. It's strong. I hate it.",
    "Yes! The lights will go out and the darkness shall come again!",
    "What laugh? All I heard was singing. Beautiful singing!",
    "This place is doing a number on us.",
    "We're the only ones here.",
    "That's not a nice thing to say.",
    "Why are they clawing at the desk like they're trying to pick something up?",
    "Uh... You already have the journal.",
    "Good, World Guardian! Good!",
    "Press it.",
    "Press it now.",
    "Do it!",
    "Err. That smell! Sulphur?",
    "Do demons use rotten eggs as weapons?",
    "Four gargoyles rushed past you and flew out off into the city.",
    "No ward, though...",
    "Still no ward.",
    "*sigh* Why is it always in the last gargoyle you smash?",
    "Urgh! You are far too enthusiastic for this time of day.",
    "I stand by what I said.",
    "Hey, don't forget me! You can't have light without shadow.",
    "Pah.",
    "Don't look at me. I'm not doing it.",
    "Good job Icthlarin isn't here for this - his would be a voice of dissent.",
    "Play with it! Maybe there's cake inside! Even better, maybe you'll get pulled into the shadows and torn limb from limb."
  ],
  "Light Voice": [
    "Shh! Give him a chance.",
    "Hey! I still like him. You shouldn't make fun.",
    "Ha! 'Egg-cellent'! He made a pun!",
    "Oh, stop trying to find conspiracies everywhere. This is just who Armadyl is - a protector of the peace.",
    "Oh, I wonder if that's what we are. Id and ego, I mean, not Sliske.",
    "Yes, we're helping too. Aren't we?",
    "Quick, you're losing him. Say something!",
    "Such a shame. I would have loved to see such a wonder.",
    "Oh, fie. It's not like the council's plans are secret.",
    "Four out of five isn't bad. We should head back to the Archaeology Guild room to give Dr Nabanik the good news.",
    "Well I like it. It makes me feel safe.",
    "No, don't! If you remove that light globe, the darkness will hurt us.",
    "Ooh, tangy! It's blood! This must be the blood bank.",
    "I'm getting notes of plum...aniseed...and a hint of...desperation?",
    "Have you tri-",
    "Do you think you could not get the World Guardian blown up by blood magic? As I was saying, I think you should look around for any clues about this lock first.",
    "Oh my! These numbers just absolutely, do not add up!",
    "Look at the book again - date 478. They ended the day with one bottle of dragon blood. On the following day they had one withdrawal for a full bottle and two bottles deposited.",
    "Have you figured it out yet? Try using the bloods from the shelves when you know what blood's needed.",
    "The World Guardian is a good egg, they'd never do such a thing!",
    "Ooh, this must be one of those wards Azzanadra wants us to find!",
    "Wait! The light pedestals run off magic. If you carry one of these...",
    "It fills me with joy!",
    "Hmm, perhaps this is the Inquisition HQ Azzanadra mentioned.",
    "Sounded like someone making a quick escape.",
    "Go easy, they're under a lot of stress right now.",
    "Maybe you should read it in that case, instead of pondering what it could be.",
    "Are you feeling okay, Worldy?",
    "Oh, great job, you finally broke the World Guardian.",
    "There's nothing there.",
    "Maybe you have to open them in a certain order.",
    "It is pretty stinky. This must be the avernic arsenal Azzanadra mentioned.",
    "No, silly. The demons ARE the weapons.",
    "Oh no, they did something to the smoke ward too.",
    "Scratch one!",
    "Two down! Two to go!",
    "Just one left!",
    "Let's head back to the avernic arsenal to retrieve the smoke ward!",
    "You don't even know what time of day it is!",
    "I helped too!",
    "You can if you have enough light!",
    "It has to be us, silly. It always has to be us.",
    "Don't forget he's still out there somewhere helping us. He'll come through, I know it!"
  ],
  "Dr Nabanik": [
    "I am glad you came, Player.",
    "It's not about the plan.",
    "I don't know if we have ever been friends. Not truly. We have been allies, to be sure.",
    "How much did you even know about Mahjarrat when you set me free?",
    "And yet we have continually worked alongside one another. In my estimation, we have achieved much good together.",
    "I see.",
    "I see.",
    "Regardless, for the first time, my orders led me to work against you. Zaros wanted you left out of proceedings. I counselled against it, but that was his order.",
    "My loyalty to him will always sit above anything else in my life. That being the case, I am not sure I can even have friends. How could they ever trust me?",
    "I am not quite sure. I just wanted to acknowledge it with you. I very much wish to regain your trust, I am just unsure how I ever could.",
    "I have questioned much since that event, but not once have I questioned that decision.",
    "Even if I had known what it would mean for me, I would still have done so without hesitation.",
    "Seemingly so. This is one of many things I have been contemplating. Am I the very sort of false god I once took an affront to? What did I see of where Zaros went? What do I do without orders?",
    "I have yet to solidify my thoughts on this. Still, I can take advantage of it in the short term by using my newfound power to move the elder god eggs.",
    "However, in part to reassure you this is no secret plan, but mostly because we cannot do this alone, we must seek allies.",
    "We need...ha - divine intervention. Seek help from Armadyl, Saradomin, Seren and Zamorak. Perhaps Icthlarin too, if you can reach him.",
    "We will need them to siphon anima away from the eggs - I'm sure none will pass up the opportunity to grow their power, while also saving this world.",
    "We will also require whatever military might they can bring. The elder gods will not take this lightly.",
    "After what happened with Saradomin's crown, however...they also will have difficulty trusting me.",
    "Good luck. While you do that, I will cover the preparations for accessing Senntisten.",
    "How goes recruiting allies?",
    "Well, Seren is still with the council in Burthorpe Castle. I imagine Icthlarin and Armadyl are also still with her there.",
    "Though, failing that, Armadyl is most likely back atop his tower south of Falador.",
    "Saradomin has remained in Falador since...",
    "Zamorak might be the tricky one; he has not been spotted on this world for some time.",
    "If you have a way to reach him, try that. Otherwise, you could try contacting him via Moia - she's also part of Seren's council.",
    "You could try contacting him via Moia - she's also part of Seren's council.",
    "How did they react?",
    "To be expected. Wait, you said 'most'?",
    "That is unfortunate...and short-sighted. This is not the time to be swayed by the petty grievances of the past.",
    "Well, that will have to suffice.",
    "I ordered Reiniger to increase excavation of this dig site a while ago, knowing what is buried here.",
    "Most of her resources are now focussed on a new dig directly north of here. It cuts down into the western cliff face beneath the old Gulvas Mansion.",
    "Intern Jimmy is waiting outside to show you the way. If memory serves, that area of Senntisten could prove to be just what we are in need of. Head there and in; I shall meet you inside.",
    "The dig team should be finished with excavating the surface entrance. It's at the north end of Varrock Dig Site, cut into the cliff face beneath the old Gulvas Mansion. Head there - I shall meet you inside the city.",
    "You have cleared a way into the city, but one more barrier blocks our path. Head back into the city and finish the job."
  ],
  "Intern Jimmy": [
    "You're free to access Senntisten through here, but if you want to learn more about it, you should talk to Dr Nabanik. I believe he's up in the old Guildmaster's office.",
    "You are cleared for access. Feel free to enter the city at any time.",
    "Oh, right! Dr Nabanik told me to keep hold of them...",
    "And I'll keep holding on to them until you can.",
    "There you go, boss! That's all I have, though.",
    "You are cleared for access. Feel free to enter the city at any time.",
    "Oh, yeah, about that... We're working to create an exception so your ring can teleport you past the wards straight into the cathedral. But it's going to take us at least a few weeks. I promise we'll make that ring more useful for you or my name's not James.",
    "Look, gimme a chance here, we're working on it... Please, be patient."
  ],
  "Armadyl": [
    "How may I be of service?",
    "Very well, where am I needed?",
    "In due time, of course, but I can see clearly on your face the level of urgency. I feel it too.",
    "Seren has shown great empathy with the plight of the aviansie. Her intentions with the council have also been worthy, albeit without success so far.",
    "However, I have grown...uncomfortable with her growing effect on the council. If she were Zaros, I would be worried, but thankfully she is not.",
    "Hence, I took some time away to visit with my people on Abbinah, to start preparing for the worst, should it happen.",
    "I did...but I trust in you and your judgement. I also wish to make up for my absence in these matters. If I were here, I might have been able to help.",
    "Good. As it should be! I hope it continues to be this easy with whomever else you intend to recruit.",
    "I shall meet him and you there once I have finished my preparations.",
    "I would always rally to the defence of a just cause; however, I refuse to put the aviansie through yet another war.",
    "Our numbers are few enough that we could evacuate back to Abbinah, should the direst of consequences come to pass.",
    "Perhaps, but at least they would have time to say their goodbyes and live out their final days in peace.",
    "There is more to being a leader than being a general.",
    "As a follower of Zaros, are you yourself not sick of the endless infighting of gods?",
    "But what of your own needs?",
    "Kree'arra insists on joining me - a request I could not deny him. He shall join us all shortly.",
    "He has survived countless wars, followed my orders without question for centuries.",
    "I wish for him to return home to his family on Abbinah, but such is the crutch of loyalty, the burden of godhood. A thing I suppose you must learn for yourself now you count among our number.",
    "So, these are the elder god young? I will do what I can to keep them in stasis.",
    "You know, this is counter to the nesting instinct of my people - to keep these eggs from hatching as opposed to nurturing them.",
    "No, that is all too evident.",
    "I am sorry, I must concentrate on the eggs.",
    "Besides, he said 'forces' plural. He's not alone.",
    "Good, then it is settled. We four will siphon anima away from the eggs. Azzanadra will organise our ground forces in preparation for Kerapac's arrival.",
    "You and Azzanadra are doing a good job.",
    "I will do everything I can to hold out."
  ],
  "Icthlarin": [
    "Well met, Player.",
    "You have it, always, my friend. What do you require of me?",
    "I hope you know that I would do anything to help you, but I cannot work with the Mahjarrat. I warned you before they cannot be trusted. They will eventually betray even their closest allies.",
    "I see. I knew it was only a matter of time. But why would you continue to work with Azzanadra if you have already felt the sting of his betrayal?",
    "Godhood merely amplifies what you were before, it does not change your core. I am a guardian - a loyal servant and a good friend, much as I was pre-ascension.",
    "Azzanadra still calls me 'psychopompus' in the ancient tongue, but the Mahjarrat are the pompous ones.",
    "To a being, they are naught but ego, even those that remained loyal to my father's banner. Save for the pure id that was Sliske, but let's not dwell on him[sic]",
    "I simply cannot bring myself to ally with Maharrat[sic], even temporarily. There will always be one that will betray you.",
    "Besides, I am lowly compared to the other gods and have no militant followers. I doubt my contribution would make much difference.",
    "No, my energy can be put to better use elsewhere. This council's efforts have been futile and things have come to a head.",
    "This plan of yours sounds necessary, but at best it will be a delaying tactic. So, I will help you and this world by setting off in search of an alternative solution.",
    "Once before, I travelled the length of the universe and back to find a solution to a dire need. I can do so again, but hope this time the solution will not be as damaging as the threat.",
    "I wish you luck in your endeavours. Wish me luck in mine. We shall see each other again."
  ],
  "Saradomin": [
    "What news?",
    "If the situation is as dire as you suggest, your plan is about the best we could hope for. But who are you working with this time, I wonder.",
    "So, you are still following Zaros's grand plan. I will continue to assist in my own way, but I will not work with zealots.",
    "Zaros abandoning his followers is about what I expected. Azzanadra has always seemed reasonable, save for his loyalty to Zaros. Perhaps now his eyes are open...",
    "Unfortunately, I cannot take all of this on your word. While I trust that you were not directly involved in the theft of my crown, you have proven too willing to work alongside Zarosians. Your judgement is poor.",
    "But I am a god of my word. I said I would defend the people of this world, so I shall. So, I will just have to see in person if this plan of yours is above board and sound. Where are you planning to stage this defence?",
    "...",
    "Senntisten was destroyed. I should know, I was there.",
    "Still? After all this time? I must see this for myself. If this is true, then it is hardier than even I thought. If that is the case, then perhaps your plan is not completely folly.",
    "I will meet with you both and assess the situation. If there is legitimacy in this request, then I shall lend what aid I can.",
    "Save your words. Zaros took my crown, not you. I hear that he has abandoned you.",
    "Again.",
    "And left the rest of us alone to fend for ourselves. That is about what I expected.",
    "My enemies afford me little credit and continually underestimate me. I am not some mewing infant.",
    "My kingdoms cover this continent. They cannot dare hope to defend themselves from such cosmic threats as elder gods.",
    "As their lord and saviour, that responsibility lies with me. That is why I am here. For their sake, not yours.",
    "If you are hoping this plan will stall things just long enough for your precious lord to return at the last moment and save the day, I would rid you of that false hope.",
    "Zaros has never cared for this world, nor its people. Nor would he care for you past the point of your usefulness to him.",
    "Hmm, until recently, you would have spewed up some bilious piety at such an affront from a 'false god'. Perhaps there is hope for you yet.",
    "But does his remain with you, now that you are a god?",
    "The last of your kind to ascend betrayed him, then plunged this world into an age of endless war. Your actions here will be closely monitored.",
    "Gods lead, they do not follow. Though if you insist on continuing to do so, then perhaps you would do better following a god who shares your goals.",
    "But then perhaps your goal is not to save the people of this world.",
    "Good, then I hope you will be making good use of MY Temple Knights in this defence.",
    "The White Knights remain back to protect my kingdoms. I can only spare Zilyana - she shall arrive posthaste.",
    "And had I known this demon-worshipper were to be present, I too may have reconsidered lending my aid.",
    "Very well. So long as you keep your incessant childish barbs under your breath. I'm sure I can stay civil until the world has ended, at least, but only if it comes soon.",
    "This task requires much focus.",
    "The dragonkin are no joke. Kerapac alone would be no pushover.",
    "He's a proxy of Jas. What forces could they not muster if they wanted?",
    "While it pains me to be in agreement with Zamorak, I too support this choice.",
    "You and Azzanadra have much to do.",
    "You were right to involve me in this."
  ],
  "Seren": [
    "This is to do with the elder eggs, isn't it? I felt a change after the Battle of the Monolith. Have they been located?",
    "Azzanadra? No, I will not trust the protection of the eggs to one of my brother's loyalists.",
    "If the situation is as dire as you make out, then it seems I am left with little choice. I had hoped we'd have more time, but my hand has been forced.",
    "Once again, I am left to clear up my brother's mess.",
    "But I shall leave the council out of this. They have become too enamoured with me. Besides, this plan of ours will need the strongest military support we can muster.",
    "I will need to see this with my own eyes, to ensure Azzanadra is still not being puppeted by my brother. If things are as you say, what choice do I have but to involve myself?",
    "I do not trust anyone other than myself to protect my aunts' offspring.",
    "I shall meet you at Senntisten.",
    "What choice did I have? I would have preferred it had not come to this at all.",
    "You misunderstand me. Your machinations outside the purview of the council could very well be what led to this dire situation.",
    "You interfered directly with the eggs. There should be no need for a defence, but you have forced the council's hand.",
    "Merely? Simply? The mere act of entering the Elder Halls could have been what agitated them. Simply following my brother's orders and working against the council is no excuse.",
    "Still, what is done is done and I will help however I can.",
    "No, you are not forgiven...but I am here now. None shall more fiercely protect these eggs from harm than I.",
    "Go on.",
    "I did not wish your kind harm. It was a necessary evil. I make no apo-",
    "...",
    "Being a god comes with certain responsibilities. I thank you for your words. I hope you, too, are ready to make such hard choices, now that you are ascended.",
    "I have sent orders to Helwyr along with a cadre of elite elven fighters - they shall be arriving soon. We will need the very best each of us has to offer if we are to prevail here.",
    "Now, I shall tend to the eggs.",
    "I must focus on stabilising these eggs.",
    "Who would he be with? He doesn't exactly have any friends and I imagine him a pariah to the other dragonkin these days.",
    "Fair point.",
    "Still, we are in the dark here...only figuratively speaking, at least, thanks to Player's efforts.",
    "That will require a clear voice to lead us. One that does not sway them as mine might... I take myself out of contention.",
    "Azzanadra should do it.",
    "Please, continue working with Azzanadra.",
    "We will hold as long as we can."
  ],
  "Moia": [
    "World Guardian? What is it?",
    "I could...but for what purpose? I am his council liaison.",
    "Have it your way, but be prepared to come away disappointed.",
    "I will teleport you to him - just for this lone request, mind!",
    "You're on your own, though. I shall stay here to assist Seren."
  ],
  "Zamorak": [
    "Do not waste your or my time, World Guardian. Speak your piece, then leave.",
    "Yes, yes, I know. You need my assistance.",
    "Hmm, I've been catching up on recent events since my return. Moia is my liaison on the council, but my sources suggest there is more going on than you realise.",
    "Indeed. I was quelling an uprising of Zarosian loyalists back on Infernus. No doubt a ploy to keep me preoccupied and out of the so-called Battle of the Monolith.",
    "I was happy to hear Saradomin has been brought down a peg or two, though. You could not find someone more deserving.",
    "We were all waiting to see what Zaros was up to since his return, but history repeats. The vacuum left by his departure will quickly fill.",
    "I'm in no rush to start a new war at this time. I know the value of this world and I do not wish to see it destroyed.",
    "It would also be foolish of me to allow the others to gain power and not myself, so fine, I will help siphon anima away from these eggs.",
    "This will also give me a chance to properly catch up on what's been going on here first-hand. I'm intrigued to see what has become of Azzanadra.",
    "We have nothing further to discuss at this time. I trust you can see yourself out.",
    "How you became World Guardian escapes me. You'll be wanting me to wipe your backside clean next. Begone!",
    "So, it's true. You've finally caught up with me. Though there is something different about you...",
    "Still, another ascended Mahjarrat. I might finally have some meaningful competition.",
    "Now, now. This world has value to me. I would see it protected from destruction, just the same as anyone else here.",
    "Well, you did always used to refer to us as 'false gods', and yet now you join our number. But no, I do not mock you, I welcome this change.",
    "Indeed, I sense you have broached the same threshold I once did. When I ascended, I felt the pull of Zaros's loyalty slip away. Have you not felt the same? The veil must have been lifted.",
    "I know, I know. Your ideologies match up too.",
    "But did he reveal to you his plot to keep me distracted on Infernus, while he did whatever at the so-called Battle of the Monolith? Do you even know where he's gone or what he is doing?",
    "I only mean that now you must be thinking more clearly than ever. Take some time with that newfound clarity.",
    "I see a future for our kind in which we can put the petty squabbles of history behind us, and move forward together as brothers and sisters once more.",
    "Freed of the shackles of sacrifice, just think what we ascended Mahjarrat could achieve, the opportunities open to our kind!",
    "I ask not for your fealty or obedience. All I ask is that you think on it.",
    "K'ril and the twin furies shall assist us in this endeavour. I have sent out orders for them to join us imminently.",
    "And in the meanwhile, I shall get to draining the anima away from these eggs...",
    "Azzanadra, I'm here to help you, but did you really have to bring this jumped-up snow imp?",
    "Hmm, one malformed elder was more than we could handle back on Freneskae. Fine. I will bite my tongue if he will keep his self-righteous prattling to himself.",
    "Don't you have an errand to run?",
    "Well, so this plan was entirely useless.",
    "So they send a lone dragonkin. This hardly needed all us gods, now, did it?",
    "Fine, what's next?",
    "Oh, this should be fun. I'm so glad I showed up for this. Sure, I'll back that play.",
    "This cathedral is his old stomping ground, he knows it better than anyone else here. Plus he's the newest god among us, and we're needed to drain the eggs.",
    "Help Azzanadra marshall our forces.",
    "Don't you have a world to guard or something?"
  ],
  "The following text is transcluded from Transcript": [
    "Bloodied note.",
    "Scrawled note (City of Senntisten).",
    "Torn note.",
    "Checklist.",
    "Handwritten note.",
    "Blood Bank Ledger.",
    "Inquisition Profiles."
  ],
  "???": [
    "A customer? Be right with you...",
    "Can I come out to play?",
    "Are you here to donate?",
    "There's a worm in my tummy.",
    "Take one down and pass it around.",
    "The night children sing to me!",
    "Time to die to time to die...",
    "A cold front is coming.",
    "The roots claim the dead.",
    "Red and black and black and red.",
    "They will all betray you.",
    "Hurry! Hurry!"
  ],
  "Day": [
    "478 - Withdrawals",
    "478 - Deposits",
    "478 - Stock Take",
    "479 - Withdrawals",
    "479 - Deposits",
    "479 - Stock Take",
    "478 - Withdrawals",
    "478 - Deposits",
    "478 - Stock Take",
    "479 - Withdrawals",
    "479 - Deposits",
    "479 - Stock Take"
  ],
  "You take": [
    "Bottle of blood (dwarf).",
    "Bottle of blood (aviansie).",
    "Bottle of blood (human).",
    "Bottle of blood (demon).",
    "Bottle of blood (giant).",
    "Bottle of blood (goblin).",
    "Bottle of blood (unicorn).",
    "Bottle of blood (dragon).",
    "Bottle of blood (animal)."
  ],
  "The bottle contains": [
    "[number]/8th human blood.[number]/8th animal blood.[number]/8th dwarf blood.[number]/8th unicorn blood.[number]/8th demon blood.[number]/8th dragon blood.[number]/8th aviansie blood.[number]/8th goblin blood.[number]/8th giant blood."
  ],
  "Blood Warden": [
    "What manner of intrusion is this?",
    "A small blood tithe...",
    "Another deposit awaits!",
    "Here. Now.",
    "Sustenance!"
  ],
  "CASTYX & GREADY - I find the comings and goings of demonkind to be quite the bore, but there is something to be said for demonic multiples (twins, triplets, etc). They are, of course, a rare anomaly": [
    "a 'difficult birth' from the Heart of Dis that sees a single soul split into multiple physical forms. The separate entities present independent personalities, but they are linked by an unspoken (and unbreakable) pact. They have the ability to communicate over vast distances, and to form unspoken plans in the blink of an eye. They also form a fierce loyalty to one another."
  ],
  "Gargoyle sentinel": [
    "Fly! Hide! Protect the ward!"
  ],
  "Gargoyles defeated": [
    "1/4",
    "2/4",
    "3/4"
  ],
  "Kerapac": [
    "Perhaps I can answer.",
    "They will not.",
    "Oh, but fear is precisely what you should feel.",
    "The destroyers know what you are planning and they are most displeased.",
    "Given the choice, I would...but choice is something you have taken from me, Player. I am Jas's agent now. This is your doing, World Guardian.",
    "As we speak, my forces gather. We shall break through into this dead city soon enough.",
    "Time is not without a sense of irony, I see. When last we met, you were the pawn of the elders employed to ruin my plans. Now our roles are reversed.",
    "While I may not WANT to do this, I must. Though I do admit I will gain some small semblance of satisfaction from watching the light leave your eyes, Player.",
    "By all means, continue with your futile plans. My sleeping army are knocking at your door. This cathedral shall fall.",
    "It is merely a matter of time."
  ],
  "Congratulations! You have completed": [
    "'City of Senntisten' - Complete this quest."
  ],
  "Azanadra": [
    "World Guardian, long ago you freed me of a prison. In turn, I taught you the power of the ancient elements.",
    "Today, you have done us all a great justice. I bestow upon you deeper knowledge, that you may take the fight to our most powerful enemies yet.",
    "These spells derive from the scrolls we rediscovered at Kharid-et. It seemed appropriate.",
    "You should consider restoring a pontifex observation ring into its shadowy variant. At first, it will not appear much, but as our defence here grows, I suspect that such a ring shall prove most useful.",
    "Ah, I sense that you have restored a pontifex shadow ring.",
    "Power that is given quickly is removed just the same. Have patience. I suspect that as our situation here grows more dire, that ring shall help you rise to the occasion.",
    "I believe you misplaced this, you should look after it this time.",
    "We will be ready."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:City_of_Senntisten?oldid=36197693’"
  ]
}