{
  "Dialogue": [
    "Yes, I'm interested, where do I report?",
    "[Accept Quest]",
    "Ask about 'While Guthix Sleeps'.",
    "Our friend in common places great faith in totems.",
    "What efforts are you making against Lucien?",
    "What are our options?",
    "I know about the 'Fist of Guthix'.",
    "What do you need me to do?",
    "Okay, thanks.",
    "Talk about Lucien and Movario.",
    "What can you tell me about Movario?",
    "What does Movario do?",
    "Where does Movario live?",
    "Okay, thanks.",
    "A creature to help track down a person.",
    "How can I catch a wild broav?",
    "What do I do once I've caught a broav?",
    "Okay, thanks.",
    "A creature to help track down a person.",
    "Do you know someone called Movario?",
    "(Charm) Tell me all you know about Movario.",
    "No, I need information. Do you know someone called Movario?",
    "Offer five thousand coins for information on Movario.",
    "Yes, I'm an awesome thief, I'll disable it easily!",
    "Yes, I'll flip the catch and see what happens.",
    "Yes, I'll attempt it.",
    "What should I do now?",
    "Sorry, I have to go.",
    "You don't understand: I want to work with you to defeat Lucien!",
    "Yes! I swear on Armadyl's wrath that I am not working for Lucien!",
    "Do you know where Lucien is?",
    "How can I get to Lucien?",
    "While Guthix Sleeps.",
    "How can I get to Draynor?",
    "Yes, please!",
    "Could you help me get a snapdragon seed?",
    "Yes.",
    "Can you teleport me to Port Sarim, please?",
    "Talk to Betty about While Guthix Sleeps.",
    "Yes, please can I have a standard truth serum?",
    "Talk to Betty about pink dye.",
    "Yes, please!",
    "I have enriched snapdragon seed, what now?",
    "Okay, thanks.",
    "I've planted the enriched snapdragon seed.",
    "I need to talk to you about Lucien.",
    "I need to talk to you about Lucien.",
    "I need to talk to you about Lucien.",
    "[Any option]",
    "I need to talk to you about Lucien.",
    "I need to talk to you about Lucien!",
    "Recruit Sloane for the hero party.",
    "Silif, it's me, [Name]. Are you okay?",
    "I want to get you out of here. Any suggestions?",
    "I'll be back to try to get you out.",
    "Do you have a plan?",
    "What would this orb look like?",
    "How will I be able to get to Lucien's base?",
    "Okay, thanks.",
    "I am Surok, Lucien has sent me to check on your progress.",
    "I could go down to the bottom first, to make sure it's safe!",
    "I shall return.",
    "Yes",
    "Yes, I need to investigate this, even if it kills me!",
    "What are you going to do with the Stone of Jas?",
    "What is the Stone of Jas?",
    "You can't let Lucien get the Stone of Jas!",
    "What if someone should stand in your way?",
    "What are you going to do with the Stone of Jas?",
    "Why is the Stone of Jas so important to you?",
    "Do you really hope to follow in the footsteps of Zamorak?",
    "Yes, a teleport out of here would be good."
  ]
}