{
  "Player": [
    "Do you have a quest for me?",
    "Okay, what are the details?",
    "A mission to Karamja?",
    "In the jungle? Hmm, it makes sense, seeing how most places in Karamja are surrounded by nature and Guthix is reported to gain his powers from nature.",
    "What sort of mission is this?",
    "Is it going to be dangerous?",
    "What sort of reward will I get from the mission?",
    "Yes, I'm interested, where do I report?",
    "Okay great, I'll head there immediately.",
    "Hi there...",
    "Our friend in common places great faith in totems.",
    "(shocked): Lucien?",
    "Well met, Thaerisk. Ivy sent me, apparently there is a task you need some help with. A mission to Karamja I believe? Ivy mentioned Lucien, though, and I'm not sure why?",
    "You told the head of the Legends' Guild a cover story so his life wouldn't be in a danger? Is this level of secrecy really necessary?",
    "Murders in Taverley! Why?",
    "Sounds quite forward thinking for a group of druids. Some druids do defend the weak and fight against oppression, though.",
    "That sounds awful!",
    "Thaerisk, are you okay?",
    "Yes, of course, I hadn't realised that Lucien had become so powerful.",
    "What efforts are you making against Lucien?",
    "Hmm, I've probably seen a few of those. But why are they in that area?",
    "Sounds like a bit of a wild goose chase. What would Movario have to do with Lucien?",
    "What do you know about him?",
    "So he's a bit of a history buff, is that a crime?",
    "What are our options?",
    "You must be taking the thread that Lucien poses very seriously if you've decided to all work together.",
    "Remind me what the 'Fist of Guthix' is.",
    "I know about the 'Fist of Guthix'.",
    "What do you need me to do?",
    "Perhaps a tunnel which leads from the north, through Lumbridge Swamp caves into Lumbridge? Lucien march his troops all the way down there without encountering any resistance.",
    "'Eye of Saradomin', what's that?",
    "Okay, so how do I start?",
    "Reldo? A local librarian might be my link to a master artefact hunter working with Lucien? Does that seem likely?",
    "Reldo might not be able to give you the specific location, but what information he has could be useful.",
    "Can you explain a bit more about yourself?",
    "Can you explain a bit about what you do?",
    "The Mahjarrat are powerful, I think it's only natural to be fearful of them. But what of Guthix and his power? Surely the Mahjarrat would be wary of your power in turn?",
    "So what's the problem? Surely that's all that's needed?",
    "Surely the authorities in Misthalin and Asgarnia are scouting for exactly these kinds of forces, preparing to defend against it.",
    "That's all very well, but what are you actually going to do?",
    "Direct action! That sounds more like my cup of tea.",
    "Well, that's a lot of information to digest!",
    "Do you have any more background information?",
    "Is this simply because you fear that Lucien is on the offensive? Or do you have any further details?",
    "I wonder what they could be looking for?",
    "This is sounding like a pretty desperate situation.",
    "Do you have any updated news or tips that could help me?",
    "Reldo? Do you really think he could help?",
    "Oh, so he's a bit knowledgeable, then?",
    "You seem to be genuinely impressed with him.",
    "Couldn't Movario just have kept all that information in his head? From what you've told me about him, he sounds pretty intelligent and may be able to pretty much remember everything.",
    "Hi, Reldo, I wonder if you know someone called Movario?",
    "What can you tell me about Movario?",
    "What does Movario do?",
    "Did you mention traps?",
    "Hmm...",
    "Where does Movario live?",
    "Do you know how I could track down his lodgings?",
    "(shifty): Oh, I was curious about him, want to get some information. Nothing bad or anything like that.",
    "Do you know someone called Movario?",
    "(Charm) I need to know where Movario lives.",
    "Not exactly, but thanks for the information, you've been very helpful.",
    "(Charm) Tell me all you know about Movario.",
    "Not exactly the information I was interested in... Oh, hang on, wait... does that mean you have some of his clothes in to be washed?",
    "Could I have it?",
    "Hi, I've found Movario's lodgings.",
    "I found some important research notes at Movario's base - here they are.",
    "Any useful information in those notes I gave you?",
    "Do you really think it's possible that this could exist?",
    "It sounds like you admire him.",
    "Well, the information was pretty tricky to get, you know. I mean, it wasn't just lying there on a velvet cushion for me to pick up!",
    "What should I do now?",
    "Okay, but what can I do in the meantime?",
    "Any news?",
    "Strange activity? What sort of strange activity?",
    "Is that so strange? I thought King Roald allowed mercenary parties to exist?",
    "Okay, so it's a bit suspicious, but we have nothing else to go on?",
    "Idria? I believe you're connected with the Guardians of Armadyl?",
    "Some hired mercenaries attacked the Guardians. I was given your details by a dying Guardian. He held onto life until he asked that I seek you out.",
    "Why do you think I'm lying?",
    "You don't understand: I want to work with you to defeat Lucien!",
    "It's true! I'm working with Crux Eqal. I've been asked to locate Lucien and to spy on him. All I need from you is his location.",
    "Swear by Armadyl?",
    "Yes! I swear on Armadyl's wrath that I am not working for Lucien!",
    "Hmm, yes... What should we do first? My orders were to get Lucien's last known location from you. Do you have that kind of information?",
    "I will not swear, my word should be sufficient.",
    "Idria...",
    "You should be careful who you threaten!",
    "Believe what you wish. It's clear you don't trust me!",
    "Idria...",
    "You seem to know me already?",
    "They all fought bravely and I understand your desire to help them, but I fear that there is little left for you to do. All succumbed to their wounds before I left.",
    "Before you go, please could we discuss Lucien? I'm working with Crux Eqal, we need to locate him. Do you have that kind of information?",
    "Similar to Zemouregal and his attempt to take over Varrock?",
    "Do you know where Lucien is?",
    "Do you think Lucien is powerful enough to take over the world?",
    "How can I get to Lucien?",
    "Aha! I see where you're going with this. You want to capture a spy so we can interrogate him!",
    "Hmm, well, that's where I come in! Some time ago, I did a little work for a group called the 'Temple Knights'. I believe they may be able to help with this problem.",
    "It's a long story, but I think I'll pay a visit to Sir Tiffy in Falador. I assume that you'll want to see to some details with the Guardians first, but it would be good to meet up there later.",
    "I'll be meeting up with Thaerisk in the White Knights' Castle there as well. If you get to Falador, look for Sir Tiffy in the park. Say that I sent you, he should help you to find me.",
    "Sir Tiffy, I have need of your expertise!",
    "Well, every briefly, I'm on a mission to locate a Mahjarrat by the name of Lucien. he's become rather powerful...",
    "Okay, I'll go and check it out. A lady called Idria might come along, she's a Guardian of Armadyl; could you send her along to Akrisae as well? I think she'll prove beneficial.",
    "If Lucien is as great a threat as you explained, I think we could use all the help we can get! Please, as a friend, just send her along, I can vouch for her.",
    "Thaerisk, you're here!",
    "Ah, here's Idria as well. Thaerisk, Akrisae, please let me introduce you to Idria, a Guardian of Armadyl. Idria and I have a plan to locate Lucien.",
    "We do indeed. Our idea is to capture one of Lucien's spies and then 'interrogate' him.",
    "I thought this might be the sort of thing that the Temple Knights could help with.",
    "What is that thing, another commorb?",
    "What will happen?",
    "Greetings, Akrisae",
    "How are things?",
    "Sorry, not yet.",
    "What should I do now?",
    "Sorry, not yet.",
    "How can I get to Draynor?",
    "Yes, please!",
    "Aha, Draynor Village!",
    "What should I do now?",
    "Who are you?",
    "What should I do now?",
    "Hail, Idria!",
    "What should I do now?",
    "If you're worried about the guardians, why don't you return to them?",
    "There must be something we can do?",
    "That sort of attitude isn't really helpful at this time.",
    "I'll go and talk to Thaerisk and see if he has anything for me.",
    "Thaerisk, what are we going to do now?",
    "Everyone, please, calm down...",
    "We're not going to achieve anything by shouting at each other! Now, Thaerisk, can we get some more of this potion?",
    "Is that something I can help with?",
    "Could you help me get a snapdragon seed?",
    "How much do you want for it?",
    "Yes!",
    "Can you teleport me to Port Sarim, please?",
    "Aha, Port Sarim!",
    "I have an enriched snapdragon seed, what now?",
    "Right, so I just need to plant this seed?",
    "I've planted the enriched snapdragon seed.",
    "What should I do now?",
    "Kill him? How on earth are we going to do that? We'd need an army wouldn't we?",
    "Do you expect me to defeat Lucien on my own? I'm flattered, but...",
    "Very well, I'll return when I have recruited them all.",
    "How do I recruit these individuals?",
    "Who do I need to recruit again?",
    "And Lucien represents such a challenge?",
    "Very well, I'll do my best to recruit these four heroes.",
    "I need to talk to you about Lucien!",
    "He's growing in power and we need to apprehend him. Would you be interested in joining a small party tasked with doing so?",
    "I need to talk to you about Lucien!",
    "I need to talk to you about Lucien!",
    "He's growing in power and we need to apprehend him. Would you be interested in joining a small party tasked with doing so?",
    "Great news Turael, many thanks!",
    "I need to talk to you about Lucien!",
    "I need to talk to you about Lucien!",
    "He's back, growing in power and we need to apprehend him. Would you be interested in joining a small party tasked with doing so?",
    "Okay, great!",
    "I need to talk to you about Lucien!",
    "I need to talk to you about Lucien!",
    "He's growing in power and we need to apprehend him. Would you be interested in joining a small party tasked with doing so?",
    "I assume it will be very dangerous; how did Erkle phrase it? 'Perhaps the most challenging undertaking of your adventuring career to date'.",
    "Okay, great!",
    "Hi, Idria. I've recruited the heroes you asked for, they're all surprisingly keen to take on Lucien.",
    "Will do!",
    "Sorry, can you remind me what I was meant to be doing?",
    "I've made it, I have some here!",
    "Well met, Akrisae. I've returned from recruiting the heroes.",
    "I've made the potion, what should I do now?",
    "Well, I guess I can probably be a little more fearsome than that druid!",
    "Are you comfy? I thought you might like a glass of juice.",
    "Okay, are you going to give us some information? Who do you work for?",
    "Dark Squall?",
    "Drink this serum or I'll run you through like the dog you are!",
    "Either drink this potion or the torture tools come out!",
    "At least we know who he works for now! Have you heard of this 'Dark Squall individual?",
    "A likeness, you mean like a portrait?",
    "I see. So, how would you make one of these portraits?",
    "Makes sense!",
    "I've given the spy the truth serum, what should I do now?",
    "What should I do now?",
    "Sure! Who are they?",
    "Of course, we're very good friends! I haven't actually seen him for some time, but no doubt I can find some way to contact him.",
    "What should I do now?",
    "Ah, yes, thanks for that!",
    "Hi, Cyrisus, I'm contacting you using magic.",
    "Cyrisus, I need to talk to you about Lucien!",
    "He's increasing in power and we need to apprehend him. Would you be interested in joining a small party tasked with doing so?",
    "It's going to be dangerous; how did Erkle phrase it? 'Perhaps the most challenging and dangerous undertaking of your adventuring career to date'.",
    "Okay, great, thanks!",
    "I need to talk to you about Lucien!",
    "He's back, growing in power. and we need to apprehend him. Would you be interested in joining a small party tasked with doing so?",
    "Is that really important? Lucien could overrun these lands with his evil!",
    "Okay, great, thanks!",
    "I need to talk to you about Lucien!",
    "I'm glad you're on my side.",
    "I need to talk to you about Lucien!",
    "He's back, growing in power. and we need to apprehend him.",
    "Well, I know it's a lot to ask, what with you having established your guild, and all...but seeing as how skilled you are with a sword: would you be interested in joining us?",
    "It could be dangerous...",
    "Okay, great, thanks!",
    "I need to talk to you about Lucien!",
    "Oh yes, sorry, I forgot.",
    "I need to talk to you about Lucien!",
    "He's back, growing in power. and we need to apprehend him. Would you be interested in joining a small party tasked with doing so?",
    "I warn you, it could be dangerous.",
    "Is that a yes?",
    "Okay, great, thanks!",
    "I guess so, though I have a question for you. Why do all slayer masters say 'ello so much?",
    "You don't know the reason? It seems a bit odd to me.",
    "You mean you weren't permitted to leave? Who was stopping you? Who could stop you, for that matter?",
    "Now, this is getting interesting. Do tell?",
    "You're retiring? I assumed Slayer Master was a job for life.",
    "What about you?",
    "Yes, I hope so. Lucien isn't exactly the easiest person in the world to catch, though. It involves a certain amount of preparation. Are you still up for this? You look a little...perplexed.",
    "Well, we're happy to have you along. I'm sure your help will be valuable.",
    "We're not quite ready yet. Hopefully, fairly soon. Fighting a Mahjarrat is not something to be taken lightly.",
    "You're not apprehensive about the dangers ahead, then?",
    "Glad to hear it. This is an important job for the continued safety of the human kingdoms.",
    "So, you're here instead of Mazchna?",
    "Do you talk to Mazchna much?",
    "So you're here instead of Turael?",
    "Could you just remind me?",
    "So, you're here instead of Duradel?",
    "That's rather a stern way of thinking. I'm curious though, how did you get the job? I was quite used to Duradel.",
    "I had thought there were no followers of the Devourer outside the desert or that they're long since gone.",
    "I've recruited the second batch of heroes!",
    "I've recruited the masters of the Warriors' Guild and Cyrisus for the party of heroes; what should I do now?",
    "Good news, Akrisae: I've recruited all of the heroes.",
    "Okay, that's where I'll start my own investigation.",
    "What should I do now?",
    "Silif?",
    "You mean Dark Squall?",
    "What should I be doing now, Idria?",
    "Ah, yes, of course.",
    "What should I be doing now?",
    "Silif, is that you?",
    "Silif, it's me, Player. Are you okay?",
    "It's me, Player, remember me? Who put you in here?",
    "I want to get you out of here, any suggestions?",
    "Okay, Silif, we need to work together. Now, give me a run down: what's your condition?",
    "Hmmmm, sounds like a restorative potion might be needed.",
    "Okay, I'll see what I can do about some food.",
    "Okay, so some sort of escape plan is in order! Good report, soldier. Any intelligence regarding this area? Where should I start looking?",
    "I'm back again, Silif, how are you doing?",
    "Hmmmm, sound like you need some food.",
    "I just don't have any food at the moment.",
    "Don't go towards the light, Silif, stay with me! I'll go and get you some food.",
    "I'm back again, Silif, how are you doing?",
    "Hmmmm, sound like you need some food.",
    "Well, I have some food in my inventory. Would you like some?",
    "So, you want me to feed you?",
    "Okay, point made.",
    "How are you feeling now, Silif?",
    "Hmmm, sounds like you need some sort of restorative potion! One of Guthix's remedies which can aid the weakened.",
    "Well, I have a restore potion here, would you like it?",
    "Sure.",
    "Right...good to know.",
    "How are you, Silif?",
    "Do you have a plan?",
    "Okay, let's go.",
    "Hmm, let's not worry about the details...the important thing is that you need a disguise, and that elite black armour should do the trick!",
    "Actually, I have some right here!",
    "I think so, yes. It's where I got that cell key from. I think it was in the north western part of the catacombs.",
    "What should I do now?",
    "Okay, what should I do now?",
    "What? With all these henchmen around? We stand no chance!",
    "Oh, yes: a teleorb!",
    "I would change that, if you weren't surrounded by your lackeys! I'll have to see to you another time.",
    "I've planted the teleorb on Dark Squall - he's Surok!",
    "Greetings, Thaerisk, I've returned!",
    "Well met, Akrisae, I found Silif and helped complete the mission.",
    "I also managed to plant a special commorb on Dark Squall - or should I say Surok!",
    "Well, it sounds like you've got this whole Lucien business well in hand. I guess you don't need me any more?",
    "What do you need me to do now?",
    "Yes, I think I found something like that when I was in Surok's base.",
    "I have Surok's robes with me right now!",
    "What would this orb look like?",
    "How will I be able to get to Lucien's base?",
    "Hi, Silif! What should I do now?",
    "No problem, Silif, I'm sure you'd do the same for me.",
    "Yep! I'm ready.",
    "What should I be doing again, Idria?",
    "Greetings, Akrisae!",
    "Sorry, what did you want me to do?",
    "Where is Lucien's base?",
    "Okay, then, So I should just be able to get to Surok's base and find a way from there? That's at the northern end of the catacombs beneath the Black Knights' Fortress.",
    "How are things here?",
    "Hmm, well, I guess time will certainly tell.",
    "Lucien!",
    "What's he doing now?",
    "Sloane! Duradel! No!",
    "Their weapons broke!",
    "Hazelmere! Get out of there! He's too powerful!",
    "HAZELMERE!",
    "Hazelmere... Cyrisus... What have I done? Lucien! You will pay for this!",
    "I'd better get out of here before I get killed, too!",
    "Sorry? Sorry? That's not going to bring them back, is it?",
    "And what about Hazelmere; what about Cyrisus?",
    "Very well, their bravery should be remembered and I'd be pleased to help bring down Lucien!",
    "What can I do to help now?",
    "What's he doing? Is it related to the notes I retrieved from his base?",
    "Of course!",
    "The Tears of Guthix is where Guthix was meant to have wept with sorrow at the state of Gielinor after the God Wars. There is a huge chasm there, isn't there?",
    "Okay, what do you want me to do?",
    "Where is Movario now?",
    "Lucien has defeated the heroes!",
    "I can't believe it: Hazelmere, Cyrisus, Sloane, Duradel, Turael and Ghommal... all gone. Killed by that filth Mahjarrat, Lucien!",
    "What are we going to do now?",
    "Statues? That's nice. I think they'd have liked that.",
    "Don't patronise me!",
    "My eyesight is fine, thank you.",
    "Why is the chasm dangerous?",
    "What are you doing here?",
    "What's that rope for?",
    "What are you doing here?",
    "What's that rope for?",
    "What do you think of Movario?",
    "I'm trying to stop him.",
    "What is at the bottom of the chasm?",
    "Will you try to stop him?",
    "Goodbye, Juna.",
    "Who are you?",
    "What are you doing?",
    "I am Surok, Lucien has sent me to check on your progress.",
    "You don't understand. Lucien has requested that I assist you so that the situation is resolved forthwith. Time is now of the essence and Lucien's patience is wearing thin.",
    "Movario, isn't it? I've heard of your detailed research: it's quite extraordinary. We need to ensure that any 'discoveries' are very 'carefully' and 'thoroughly' investigated before Lord Lucien is made aware of them.",
    "The most impressive element? I think your realisation that the graphic references to the 'Eye' and the 'Fist' weren't references to godly power, but to actual, physical entities. I do admire your lateral thinking. Tell me, have you had any further insights you would care to share with me?",
    "Lucien has asked me to take over your investigation, but I'm more interested in simply working as your close assistant. Now, please share what you know with me.",
    "Yes?",
    "The Stone of Jas! Incredible!",
    "The power this item would have! You believe it was used by Guthix and Saradomin to supplement their powers?",
    "Zamorak's flaming nostrils! You believe this item exists?",
    "And what about the light creatures? Are they of no use?",
    "Let me explain: I've found that if you use a special type of lantern that casts a distinct blue light, you can attract their attention. A creature will surround you and carry you to the far side.",
    "Not so far. I assume the lantern isn't sufficiently bright for them to go downwards.",
    "I could go to the bottom first, to make sure it's safe!",
    "I insist that you'll be the first to investigate anything which looks even remotely interesting.",
    "Hmm, I'll have a think about it.",
    "Shut up, Darve!",
    "Sorry, Movario, what had we agreed last time we talked?",
    "Nothing much, it's very dark!",
    "I certainly will, Movario, please trust me!",
    "Oh, it's very dark down there, can hardly see anything. I'm still conducting research!",
    "Sorry Movario, I've answered your questions...I've things I need to do.",
    "What?",
    "What do you...?",
    "You don't make any sense at all!",
    "The Stone...the Stone of Jas...it belongs to Jas! Protection, growing in power...no, the dragonkin!",
    "What are you going to do with the Stone of Jas?",
    "What is the Stone of Jas?",
    "So why was it hidden in a Guthixian temple and what significance does the stone circle have?",
    "You can't let Lucien get the Stone of Jas!",
    "It seems there is little to stop Lucien from taking it if he learns of its existence. What effects can you muster to prevent his spy network reporting your discovery to him?",
    "What if someone should stand in your way?",
    "Talking's over!",
    "What are you going to do with the Stone of Jas?",
    "Why is the Stone of Jas so important to you?",
    "So, power is all your interested in?",
    "Do you really hope to follow in the footsteps of Zamorak?",
    "As powerful as you are, Lucien, I think Zamorak will have something to say about your future plans! He'll probably want the Staff back, for a start!",
    "You'll never have that satisfaction, Lucien! You killed my friends and no matter what it takes, I'll make it my mission to destroy you, and all of your kind!",
    "Talking's over!",
    "You should have thought about that before you became his lap dog!",
    "Yes, a teleport out of here would be good.",
    "Ah, Falador.",
    "Hello, Idria.",
    "What are we going to do now?",
    "Thanks very much! But what is this lump of metal?",
    "Changed?",
    "I guess so...",
    "Greetings, Idria!",
    "Yes, but now Lucien has his filthy hands all over it. I wonder what plans he has now. I guess none of us are safe.",
    "The dragon metal you gave me: what can I use it for?",
    "What do you think Lucien will do now?",
    "He said that he was going to attend to his godhood. Do you believe he could become a god?",
    "I hope I get a chance to even the score with him and return the Stone of Jas to somewhere safe.",
    "What should I do now?",
    "You mean when he summoned those demons?",
    "Those demons were powerful, though! Who could fight them?",
    "Hmm, interesting...I'll bear that in mind. It may be worth paying a return visit to that strange temple.",
    "What happened to me in there? I felt so powerful!",
    "I only wish it could have lasted longer: if I was still that strong I could have hunted down Lucien!",
    "Well met, Akrisae.",
    "I must say I don't feel that way. Especially since Lucien got away with the Stone of Jas.",
    "Really? Well, I'm honoured!",
    "I'm glad you're so confident about this. Perhaps you're right, and maybe Lucien will be deterred for some time. But if you ever need any further help in bringing him down, you can always count on me.",
    "You'll do no such thing! Would you like to be incinerated on the spot?"
  ],
  "Radimus Erkle": [
    "Well, there is a 'project' I've been asked to look into, but I'm afraid you don't have the requirements for it. I need someone a tad more experienced for this, I fear.",
    "Ah yes, Player, it might not be the sort of quest you've come to expect, but you could be right for the job with your experiences in Karamja.",
    "Well it's all quite hush-hush. I've been approached by a lady of some note, an influential druidess in Taverley. She is organising a sort of 'mission' to Karamja.",
    "Yes...do let me finish, Player, otherwise we may be here all day.",
    "This druidess represents a collective who wish to travel to Karamja. The details are sketchy, but I believe they intend to set up a new place of worship for the followers of Guthix.",
    "So, are you interested?",
    "I don't have many details as I said before, but I believe they want to build a place of worship for Guthix out in Karamja. They probably want someone to act as a guide and advisor while on the trip.",
    "I'd assume that it will be and prepare for the very worst, Player. From my understanding of the mission, the organisers are well aware of the risks on this area.",
    "I would expect this to be perhaps the most challenging and dangerous undertaking of your adventuring career to date.",
    "That's really for you to sort out with my contact, but I'm afraid you can't meet her until I have your word that you agree to undertake this mission.",
    "Okay, great! I knew you'd be the right person for the job.",
    "You'll need to talk to a druidess called Ivy Sophista in Taverley. I believe she's in one of the buildings opposite the summoners' house. In order that she knows you've been sent by me, we've agreed a simple pass",
    "phrase. You need to say the following when you meet her: 'Our friend in common places great faith in totems.\""
  ],
  "Ivy": [
    "Yes, can I help you?",
    "Good, I'm glad you've arrived. Meet Thaerisk upstairs, there is much to discuss and Lucien's spies are everywhere.",
    "Shush. Upstairs."
  ],
  "Thaerisk": [
    "The mission to Karamja was a necessary cover story, Player. Radimus recommends you, that's good. There is little point in risking his life with the information I am about to impart.",
    "It is. Strangers have appeared in Taverley and several of our brethren have been murdered in truly terrifying circumstances.",
    "First, a little background: I help to organise a group called 'Crux Eqal'. We are followers of Guthix who are concerned with the state of the world at large.",
    "Too long have Guthix's followers been spellbound by the beauty of nature when they should be using their powers to fight those that throw the wider world into the chaos of imbalance.",
    "That's not my point. The elder druids within Taverley are cautious about the larger issues that need attention.",
    "Like the Mahjarrat. Especially the one called Lucien. His insatiable hunger for power is a cause for concern.",
    "Many of our operatives researching Lucien's movements have met with a stealthy, violent death. These deaths are messages from Lucien's henchmen, warnings that we should stay away.",
    "We believe that Lucien is already very powerful since getting the Staff of Armadyl. He has also established a lethal network of spies, assassins and thugs who are subverting our ability to keep track of his plans. Consider it: Zamorak was once a Mahjarrat, until he used the Staff of Armadyl to attain godhood...",
    "Shush! A moment, brother. Someone is approaching from down the stairs; let us wait for them to pass.",
    "Yes, I think so, now that those filthy assassins are dead. Do you understand why the level of secrecy needs to be maintained?",
    "None of us had, and that's why we find ourselves in this situation.",
    "We're trying to track his movements. He's in the north somewhere, perhaps near the Wilderness. We have heard a lot of reports that he has spies around Draynor Village.",
    "We don't know, but we have reports that a strange entered the Lumbridge Swamp caves at the time these spies started arriving.",
    "Apparently, he's a treasure hunter by the name of Movario.",
    "I was initially going to ask you to go into the Wilderness to see if you could track down Lucien, but at this juncture I'm curious to see what information we can find out about Movario and what he's up to?",
    "There may be no connection, but the Temple Knights, the Guardians of Armadyl and members of Crux Eqal are all concerned about what it is he's doing down there.",
    "Quite a bit, actually. He's magically trained, has adventured, has ties to the Runecrafting and Magic Guilds. He's also spent a lot of time in various archives.",
    "Maybe not, but there is some speculation that he helped Lucien track down the Staff of Armadyl in the first place; he is an experienced artefact hunter, after all. He's currently a bit of an unknown quantity and we need to learn about him.",
    "Crux Eqal are going to contact the Temple Knights and the Guardians of Armadyl. It's time we treated this threat seriously.",
    "Indeed. Some of the speculation about Movario's intentions are a bit too wild to believe; all these rumours about the 'Fist of Guthix' and the 'Eye of Saradomin'. People will believe anything.",
    "Most people associate the 'Fist of Guthix' with an arena where druids reward adventurers for gathering energy from a strange imprint in the floor. In fact, the arena was named after the mythical concept itself.",
    "I don't even want to consider that nonsense right now. I still think it's a good idea to have this Movario character checked out, though, just to be on the safe side.",
    "No, you're probably thinking of that arena where druids reward adventurers for gathering energy from a strange imprint in the floor. In fact, the arena was named after the mythical concept itself.",
    "I don't even want to consider that nonsense right now. I still think it's a good idea to have this Movario character checked out, though, just to be on the safe side.",
    "It's very important that we get some background material on Movario. We think he is working for Lucien, looking for something, but we're not sure what it is.",
    "Could be. There's also speculation about the 'Eye of Saradomin', but I don't put much stock in that rubbish.",
    "It's not really relevant, but it's from a phrase in a translated tome, '...and power from Saradomin's Eye did strike his enemies, and all was wasted and death that appeared about him'.",
    "It's all metaphorical imagery related to Saradomin's godly powers. Like I say, it's pointless rumour, it's not important.",
    "Learn about Movario. Find out where he lives. Get some proof of what he's researching and bring it to me. He's likely studied at the Palace Library in Varrock, so Reldo is likely to have met him. See if Reldo can give you some hints.",
    "Reldo is shrewd, observant and knowledgeable. He may be able to give you all the information you need. Remember, I need some proof of what it is that Movario is researching.",
    "Not much to tell really. I've lived in Taverley most of my life, and was initiated as a druid about ten years ago.",
    "I've travelled around most of Gielinor and I've seen tragedy and heartache, triumph and beauty. I feel that many of my fellow druids are a bit too absorbed in local matters and should look at the larger picture.",
    "I feel that some of the weaker people suffer while stronger individuals tend to oppress those weaker than themselves.",
    "Certainly. When I returned from my travels around Gielinor, it became clear to me that many of my druidic peers are not aware of the troubles in the world at large.",
    "Others feel as I do, so we've worked together, got ourselves organised and our collective name is 'Crux Eqal'. To fight the Mahjarrat we need to be organised.",
    "To some degree I expect they are. Don't get me wrong, I am sure that the druids of Gielinor would fight to the last drop of blood if the situation requires it.",
    "They're not afraid of using the power of Guthix to fight for balance in the world.",
    "My fear is that the likes of Lucien and the other Mahjarrat might be aware of our strengths and easily calculate what forces would be needed to slay every last one of us...",
    "...and every last soul of defending Misthalin and Asgarnia! It is my belief that they could quite easily mount a force of sufficient size to do that, and for all we know, it may already be on its way towards Varrock and Falador!",
    "Well that may be, but I feel that more should be done. For years there have been rumours about the Mahjarrat heading north and a build-up of dark power. I, for one, am not happy to live in fear, tormented by rumours. Many",
    "more people are also concerned and would rather face what's happening and prepare for it - and why shouldn't we do something about it? The Path of Guthix is still the dominant religion on Gielinor and Guthix grants us the power to not live in fear.",
    "We are starting to organise ourselves and share information with other like-minded organisations, like the White Knights, the Temple Knights and the Guardians of Armadyl. many people have pledged support either through",
    "contributions of materials or time. Some are specialised in fields of reconnaissance and combat and are taking direct action against the Lucien's despicable forces.",
    "That's what I was hoping you would say, my friend!",
    "Crux Eqal is a group of people who believe that we should be aware of what the larger world is doing. Its members are generally quite young, but we have the support of Sanfew and Kaqemeex, powerful druids who see the sense in being prepared.",
    "The background information is pretty thin, but what I can tell you is this: the Temple Knights, Guardians of Armadyl and Crux Eqal are recruiting experienced fighters of types - warriors, rangers and mages.",
    "Our scouts that have been into the Wilderness have witnessed a significant number of single zombies travelling around. They seem to have purpose, intent and are not limited by the restraints of the living: They do not sleep; they travel fast and unrelentingly. If they spot one of our scouts they attack mercilessly. Only through luck, guile and experience have many of our most valuable scouts returned, and those were barely alive.",
    "We have also had reports that Lucien is roving the Wilderness raising heroes from the dead. We can only guess at how large his army is, what its purpose is, and when we may have to fight it.",
    "Yes, so you can appreciate how glad I am that you're here!",
    "Sorry, no updated news, but a good tip would be to talk to Reldo, really pick his brains. He's probably noticed something about Movario that, on the surface, doesn't mean that much, but which could give you the hints you need to get closer to his lodgings.",
    "Do you jest? Reldo is a man of extraordinary abilities. he has penned many authoritative tomes on highly regarded subjects.",
    "Reldo is indeed very knowledgeable, especially about the different races within Gielinor. He was promoted to the position of Head Librarian at a young age, which is quite an accomplishment. Do not underestimate men of learning like Reldo or Movario.",
    "I'm sure that there is more to Reldo then meets the eye. Trust me on this: a druid can feel these things. And I am rarely wrong!",
    "That's a good point. But information we do have on Movario indicates that he has recorded 'copious' notes. Let's hope that there is sufficient information in his lodgings for us to have a better understanding of why he's in the Lumbridge Swamp caves.",
    "Great! Do you have anything to show me?",
    "Great, we've been relying on this information, I can tell you!",
    "You would be wise to read these if you haven't already - there is information here that may be of use to you as well as me. It may make a significant difference in your succeeding at your task.",
    "My friend, if the information is to be believed, Movario is on the trail of the most powerful artefact ever conceived. Nothing less than the power that brought magic to Gielinor, touched by the very gods themselves!",
    "I'm not Movario, but his research seems to be pretty accurate. The references he quotes are familiar to those who have spent some time on such subjects. It's shocking to me that I'd never considered those references to godly",
    "power as anything else, but it seems somehow odd knowing that they were written in this specific way. While I might not agree with his motives, that Movario certainly has a sharp and enquiring mind.",
    "If this research is correct, then it's true to say he's able to interpret religious texts with remarkable precision. I'm wondering now if perhaps this Movario is far more intelligent than we'd originally thought. He might anticipate that we would search his base and he might leave information there to misdirect us.",
    "No, of course not, but we have to be aware that he's a smart man, and this could be a ruse.",
    "Well, the information you've given us is great for a start. I need to communicate this to the Temple Knights in Falador. I certainly think we need to know what Lucien is up to now.",
    "Your task is to find out where Lucien might be from the Guardians of Armadyl. You should find them at the McGrubor's wood entrance to their base. Report back to me at the White Knights' Castle in Falador when you have the information.",
    "Hmm, yes. Herb growth is up slightly on last year. Oh, what else? Ah, yes, some interesting work has been done to improve the effectiveness of truth serum. Also, some reports of strange activity around McGrubor's Wood.",
    "Let me look at the report...oh, yes, 'strangers seen in the area, possibly a small mercenary party'.",
    "Why would they be in McGrubor's Wood? Morytania sounds like a much better place for them to be headed!",
    "Hmm, no, that's it.",
    "Aha! Player, there you are! Akrisae, meet Player, he's working with us.",
    "(angry): Let's keep theology out of this for the time being. Our true focus should be Lucien, after all!",
    "Agreed.",
    "Hmm, I fear I understand you. I believe we can remove the evil from 'interrogation', however, with a recent gift from the lore of Guthix.",
    "An improved form of truth serum.",
    "Akrisae can call the shots for you, till you can catch the spy.",
    "My colleague will administer the serum.",
    "Well, that spy ruined what truth serum we had...",
    "Do not take that tone with me.",
    "It looks like we're going to need a fresh batch; it took us quite a while to get that one.",
    "I surely think so, Player; you haven't let us down yet!",
    "The process is quite complex, so I'll just tell you about each part as we do it.",
    "First of all, you'll need to go see Betty in Port Sarim. The ingredients call for a truth potion enhanced with an enriched snapdragon, so it would be good for you to get yourself a snapdragon seed before going.",
    "When you're ready to go down to Port Sarim, let me know and I'll teleport you there, We've little enough time to spare to have you walking everywhere.",
    "I do happen to have a seed I could let you have at a reduced price. I'd let you have it for free, but the resources of Crux Eqal are stretched enough as it is. If you happen to have one of your own, it may be better to use that.",
    "I could let you have it for 31119 gold, does that seem reasonable?",
    "Very well, prepare yourself.",
    "Arcanus Sempitor Teleportus Retainus.",
    "Ah, good. You'll need to plant that in the specially created patch on top of the castle. It'll take some time to grow, but we have some other things for you to do while we wait for that.",
    "Yes, on top of this castle, and then I think Idria has a task for you.",
    "Very good Player!",
    "Idria has developed a plan which will require you to make contact with some exceptional individuals who will make up a party of heroes. Idria, do you have a moment, please?",
    "We need to get some information out of this spy. To do that we need the super truth potion.",
    "Very good! Now we just need to get the spy to drink it!",
    "Yes, but not much. No one really knows what he looks like. If we could somehow get a description of him, or some sort of likeness, it might help us with our enquiries.",
    "Of course. We'd be able to put up some posters of this man, and even if people don't want to tackle him directly, there are always plenty of informers who'll be only too happy to reveal his location for the right price.",
    "Simple really, get some charcoal and some papyrus and then draw the description of the individual.",
    "I think Idria wanted you to recruit some more individuals for the party of heroes to apprehend Lucien. Discuss it with idria, I'm sure she'll give you the information you need.",
    "Great, I think Akrisae wanted a chat with you.",
    "Aren't you meant to be looking for that sneaky fellow...oh, what's his name?",
    "That's the fellow...and some chap called 'Dark Wall'?",
    "Seems like you knew all along what you should be doing! If you need specific details, go along and chat with Akrisae.",
    "Yes, Akrisae was looking forward to your return! Akrisae, look, Player has returned!",
    "We're so sorry, Player, it's a massive loss. Mazchna and Harrallak have already reported back and gave us the bad news.",
    "About Lucien? We're not really sure. We suspect that the battle took some power out of him because he teleported away.",
    "As for the heroes, their bravery shall be carved in stone for all to see. Heroic statues of them shall line the small lake in Falador park.",
    "Sorry, friend, it seems there is little for me to say to you at this point."
  ],
  "Reldo": [
    "Movario: Oh, yes, he's been in here a few times.",
    "He's certainly an interesting character. He rarely needs help locating books, and is reasonably amiable for a scholar, but does get annoyed if interrupted when reading. He speaks with a faint Khazard accent, and, like many such scholars, likes to keep himself to himself.",
    "Oh, he comes in here from time to time, usually makes lots of notes as he goes. I've seen him read some unusual works; books on traps, housing improvements and even divination.",
    "He seems particularly interested in the very oldest historical documents; we have quite a collection in the archives, you know. Not much use, though - the language is quite old and barely decipherable.",
    "Well... apparently, a thief by the name of 'Slick-Fingered McGrew' attempted to steal something from Movario. After his attempt, he was known as 'No-Fingers Mcgrew'!",
    "Yes, a bit grisly, to say the least. But one thing 'No-Fingers McGrew' was reported to have said was 'solving the puzzle arms the trap'.",
    "Sorry, no idea. He possibly has ties to the Khazard area, but I don't know for certain if that's where he lives.",
    "Huh? Tracking? Now there's a question for a librarian! Do I look like an expect tracker?",
    "Why do you want to track down his lodgings anyway?",
    "Well, I have read about some jungle creatures that are able to take a scent and track it down. You'll probably need to talk to some sort of jungle hunting expert on the matter, though, and I'm not sure if there are many of those around here."
  ],
  "Launderer": [
    "What can I do for you?",
    "Oh yes, Movario...",
    "Oh...er, well, sorry. I'm not really supposed to divulge client details. Times are tough enough as it is; I can do without losing customers because of my gossiping!",
    "Well, he is a customer here so I guess he must live somewhere not too far away, but I don't know his actual address. Why? Do you have some post for him or something?",
    "Well, he doesn't tend to wash very well around the neck line; lots of scuff marks there. And the state of some of his robes...if they're not jammed up with coal tar, they're burnt to a cinder.",
    "Yes, actually, I do. One of his shirts looks like it won't last the process, though, and needs to go into the bin.",
    "Sure you can."
  ],
  "Idria": [
    "What makes you believe that?",
    "I suspect that you're lying and this is a trap, but I have no alternative but to leave immediately!",
    "You helped Lucien steal the Staff of Armadyl! We know all about you, Melchid - never will I trust any word you say! Now leave, before I'm forced to make you pay for your error in judgment!",
    "You lie! I should incinerate you where you stand!",
    "Crux Eqal! It seems unlikely that you'd have heard of them if you were associated with Lucien. But do you swear by almighty Armadyl that you're not working for Lucien?",
    "Yes, by Armadyl! It was his staff you stole, after all. Now, do you swear?",
    "Good! That's a much better perspective. All we need to do now is rectify the terrible mistake you've made by giving Lucien the Staff in the first place!",
    "Very well, it's quite clear to see where you stand. Do not trouble me again unless you're prepared to swear an oath that you are not working for Lucien.",
    "What do you want now? I think we've said all that needs to be said!",
    "Enough! I don't have time for this!",
    "Good, so we both know where we stand! When my work is done, I'll make preparations for dealing with you!",
    "What do you want now? I think we've said all that needs to be said!",
    "Ah, Player, that's bad news, but I'm grateful that you've brought it to me. You have friends with the Guardians of Armadyl.[sic]",
    "Of course. You helped to stop Lucien stealing the Staff of Armadyl! I believe we're focused on the same goal in bringing him to justice.",
    "But I can't stay to discuss this. I must attend to the dying Guardians and see what I can do to end their suffering.",
    "What we do know is that Lucien is raising an undead army within the Wilderness - it's the perfect repository of powerful and ancient warriors who will do his bidding.",
    "Yes, quite similar, but replace 'Varrock' with 'all of RuneScape' and you may be approaching the scale of Lucien's ambitions.",
    "We know he's in the north somewhere, but exactly where is a problem.",
    "Our resources are stretched beyond our limits and, with this recent attack, we may be forced to postpone our efforts tracking down Lucien and instead regroup to strengthen the Guardians.",
    "It's hard to tell how powerful he is. He's a devious manipulator and keeps his plans in the shadows. His filthy machinations have extended to the development of a spy network that has infiltrated most of Misthalin.",
    "But if we assume that he is powerful enough, we can at least prepare for the worst.",
    "We've been unable to track down his base of operations. So we're going to have to be more aggressive - we'll work our way up the food chain.",
    "It's an idea I've mulled over before and now seems as good a time as any. Lucien established his spy network, and his spies have been seen in Draynor, right?",
    "Yes. It's terrible business but I think it's the only way. To succeed, we have to capture a spy without anyone knowing, least of all one of Lucien's lackeys! And that's where my plan falls down...I have little experience of this kind of thing.",
    "(shocked): You? You can make contact with the Temple Knights?",
    "How can that be?",
    "Okay, good luck, Player. I'll meet you in Falador.",
    "Pleased to meet you Akrisae, Thaerisk. Thaerisk is quite right, we'll have time to discuss theological issues if we manage to eliminate the danger that Lucien poses.",
    "I think we're jumping ahead. First we need to capture a spy without any of Lucien's dogs discovering the fact.",
    "Oh, that is clever, good job!",
    "Please do hurry, Player, remember that Lucien is a vile murderer and callously inhuman, and he'll just as easily slaughter all who are dear to you as he did with me.",
    "Please do hurry, Player, remember that Lucien is a vile murderer and callously inhuman, and he'll just as easily slaughter all who are dear to you as he did with me.",
    "Thanks for introducing me to Akrisae and Thaerisk, I think we have some good allies with the Temple Knights and Crux Eqal.",
    "Sorry, but I need to make plans for the Guardians of Armadyl. Akrisae and Thaerisk have details of our strategy, so it's probably best if you discuss it with them.",
    "I'm not sure that I would be that helpful to the Guardians at the moment. Also, I can feel that my presence here lends support to the cause. This is the first time that there has been a concerted effort to take action against Lucien.",
    "Excellent!",
    "The potion!",
    "Akrisae is right! Why wasn't the spy restrained? Lucien is going to have free rein to do as he wishes, with incompetence like this on our part!",
    "Yes, Indeed. Based on the information Thaerisk gleaned from Movario's notes, it seems that Lucien is incredibly powerful. We need to regain the Staff of Armadyl while we still have an opportunity. If he resists, we may need to kill him.",
    "Yes, we're going to need some force to succeed in apprehending Lucien, but the forces we have are preparing to defend the cities of Misthalin and Asgarnia.",
    "While we're all aware of your bravery, Player, we're all agreed that you are much more useful in this plan when used intelligently. The next step in this plan is quite critical. We need you to assemble a small task force",
    "who'll be given the responsibility of taking of Lucien, a party of heroes.",
    "We need you to recruit the following exceptional individuals: Turael, Hazelmere, Duradel and Mazchna.",
    "Explain to them the nature of our situation and, when they agree, as I'm sure they well, return to me. Lucien has made many enemies, and those we have considered for the party know full well the consequences if no action is taken.",
    "That's really up to you. I believe some can be contacted through some Lunar magics. This could save you some considerable time in locating them.",
    "You'll need to ask Turael, Hazelmere, Duradel and Mazchna if they'll be willing to stop Lucien. But I'm sure it will take very little effort.",
    "These individuals have long since defeated any foe worthy of their effort and have existed as teachers to those who would join their ranks. It is a mark of honour to engage in combat with a worthy foe.",
    "Akrisae, Thaerisk and myself believe that he is.",
    "This is great news, Player. Now, onto the next part of the plan, It's important that we try to get information out of Lucien's spy. We need a fresh batch of the super truth potion Thaerisk told us about. Perhaps",
    "You can get us a fresh batch?",
    "Oh, that's great! We'll see if this helps the spy to reveal some useful information!",
    "But... do you think you could persuade the spy to take it?",
    "Oh, if only we had a likeness of this man, we'd be able to put up some wanted posters to see if anyone has seen him.",
    "We need to see if we can get a better description of this 'Dark Squall'. If only we had a likeness of this man, we'd be able to put up some wanted posters to see if anyone recognises him.",
    "We're going to see if we get any information about this Dark Squall character; see if anyone has seen him. In the meantime, we need you to recruit more people for the party of heroes.",
    "Okay, you need to recruit three members from the Warriors' Guild: Ghommal, Sloane, and Harrallak. We'd also like you to track down a great warrior, Cyrisus. You may have heard of him?",
    "That's great, but you should let Akrisae know. I think he was quite anxious for your return.",
    "I think Akrisae wanted you to look for Silif and see if you could get more information about Dark Squall.",
    "I think Akrisae had those details for you. Akrisae, do you have a second?",
    "Yes! Of course!",
    "Player! You're alive! When Mazchna reported in, we feared the worst!",
    "We're all so sorry, Player, we totally underestimated Lucien's power.",
    "No, I think not. But neither is getting angry and blaming us. They were good people and great fighters, they'll be sorely missed, but we still have a job to do.",
    "Their lives will be avenged, and we'll commemorate their bravery by erecting statues to them in prominent places. But for now, we need you for another project. This is all far from over, my friend!",
    "We're worried about Movario's movements. Our sources say he has moved from the area he was in.",
    "It may be. It seems that Movario believes that the 'Fist of Guthix' and the 'Eye of Saradomin' exist. He thinks they're artefacts used during an earlier age. I believe that Movario is looking for the 'Fist of Guthix' in the Lumbridge Swamp caves.",
    "Yes, there have been references in some ancient druidic texts about the Chasm of Tears.",
    "We'd like you to go down there, dressed as Surok, and see what he's up to! Talk to him as if you were Surok, tell him that you're working for Lucien and attempt to help him with his investigations.",
    "Our sources say he has moved into a large cavern area with some mysterious floating lights.",
    "Blessed Armadyl, Player, those demons are too powerful! Your contact with the Stone may be enough to save us!",
    "Yes, Player, that's the way! The Stone must have augmented your powers!",
    "That was astounding, Player! Your strength cowed even those vile beasts - perhaps your contact with the Stone enhanced your strengths? But this is a discussion for another time. Would you like me to teleport you back to Falador?",
    "Arcanus Sempitor Teleportus Retainus.",
    "Hello, Player, it's good to see you again!",
    "Before we discuss that, I have some items to give you. They were dropped when you defeated the tormented demons - spoils for a hero!",
    "I believe it's a shard of some sort of ancient dragon armour. I've heard that the dwarves of the Blast Furnace have a great deal of expertise in the metallurgical arts. You may like to talk to them about it.",
    "Ah, Player, I'm glad you're still around. Do you remember I said that something has changed about you?",
    "Yes, it must have been due to the close proximity of the Stone of Jas. Some change has taken place; some unexpressed potential - we saw that when you fought the demons, or at least the residue of your contact with the Stone. I think I can release the rest of it, but you will have to direct its flow. Are you ready?",
    "Hmm, I still feel that there is some unlocked potential!",
    "I believe that is all the unlocked potential I can release. It's made you quite powerful!",
    "Greetings, Player, and once again, thanks for your assistance with Lucien. It's just incredible to realise that all this time, artefacts of the gods existed right underneath our noses!",
    "Well, one thing you've managed to do is help forge a strong bond between the members of the Temple Knights, the Guardians of Armadyl and Crux Eqal. This in itself is a significant achievement. You should be proud.",
    "I think the demon was carrying some sort of ancient dragon armour when you killed it. The beast dropped a chunk before it was consumed in its own destruction.",
    "I'm not sure what use it can be put to, but I've heard that the dwarves of the Blast Furnace have a great deal of expertise in the metallurgical arts. You may like to talk to them about it.",
    "It's hard to say, Player, but now he has the Stone of Jas, he could do anything.",
    "Lucien is very powerful, that's for certain. The last time a Mahjarrat had the Staff of Armadyl and, presumably, the Stone of Jas, we ended up with Zamorak as a god...and not too long after, the God Wars! I wonder, though: would Saradomin and Zamorak allow that to happen if it were a real possibility?",
    "I understand you completely, my friend. Likewise, I wish I could retrieve the Staff of Armadyl and return it to him. His guidance is sorely missed on Gielinor!",
    "I assume you have a lot of personal business to attend to...but I have a strange feeling about the magicks that Lucien used in that Guthixian temple.",
    "Yes, exactly. I don't think it was just a single summoning to defeat you - it felt like a permanent desecration of a religious area. With those foul demons present, Guthix's followers won't be able to use the area as a place of worship.",
    "Maybe a trained team of warriors could take them on, If the dragon metal dropped is any indication, I suspect that the rewards for slaughtering such monsters are quite high!",
    "The Stone of Jas is obviously an immensely powerful artefact, one that has been touched by the gods themselves. I believe that you absorbed some of that power - only as much as a mortal can take, of course - and it made you capable of defeating the demons.",
    "It seems like Lucien knew you had been strengthened by the Stone, otherwise I'm sure he would have stayed to make sure you couldn't get in his way again."
  ],
  "player": [
    "You don't understand: I want to work with you to defeat Lucien!"
  ],
  "Tiffy": [
    "What, pray tell, can my expertise assist with?",
    "Say no more, my friend, I think i know where this is going.",
    "Indeed, the Lucien issue is well known to us. I must refer you to our man in charge of this operation, Akrisae Kolluym.",
    "He's in the White Knights' Castle ,on the ground floor near the cell and the circular table.",
    "(scared): Well, I'm not sure...we don't ally ourselves to just any old spiritual eccentric.",
    "Very well, young Player, I'll do as you ask. Good luck!"
  ],
  "Akrisae": [
    "Greetings, Player. I've heard a lot about you. It's Saradomin's will that you're doing!",
    "Very well. Do you have some sort of plan?",
    "Indeed, Player, you seem to have a good grasp of the Temple Knights' strengths in subterfuge.",
    "Silif, bring me the teleorb.",
    "Now then, Player, I was going to ask Silif to do this, but I think with your experience in the field, you'll do just as well.",
    "Nearly! You need to plant this on a spy and report back to us when it's done.",
    "The teleorb is part of a sophisticated teleport spell which allows us to teleport individuals around. Plant the teleorb on a spy, return to us so we know it's ready, then we'll teleport the spy into this cell to begin the interrogation.",
    "Saradomin be with you, my friend.",
    "We're still no closer to finding Lucien, we really need your help with this. Have you placed the teleorb on a suitable target yet?",
    "No doubt you're taking sensible precautions, but the sooner we can get going, the sooner we can get intelligence on Lucien.",
    "I gave you a teleorb to place on one of Lucien's spies in Draynor, have you planted it yet?",
    "No doubt you're taking sensible precautions, but the sooner we can get going, the sooner we can get intelligence on Lucien.",
    "I can offer you a free teleport if you like. Are you ready to go now?",
    "Very well, prepare yourself.",
    "Arcanus sempitor Teleportus Retainus.",
    "I believe it's time we invited one of Lucien's friends over so we can have a little chat! I'll start the incantation.",
    "Arcanus Sempitor Teleportus Retainus.",
    "That foolish druid could have seen he was going to get attacked by that spy, now we've lost the super truth potion.",
    "Well, I know nothing about it but Thaerisk might have some further orders for you. No doubt he wants to wait for Guthix's providence to grow a solution...",
    "What!",
    "Oh, I see...",
    "Yes, yes, I suppose you're right. So far, both Thaerisk and Idria have been very helpful in planning our strategies. I should be a little more respectful.",
    "Any fool could have seen the old druid was going to be attacked! Why send him in there!",
    "Idria has details of what we need to do next, but I believe we're relying on this 'super truth' potion which Thaerisk told us about?",
    "It's important that you get that party of heroes together; they should be more than a match for that Lucien! Mostly they're members of the Warriors' Guild - Sloane, Harrallak, Ghommal - and then Cyrisus.",
    "That is good news, Player, but I'm very anxious about Silif. Dark Squall has been spotted near the Black Knights' Fortress, so I sent Silif to scout the area.",
    "Our last report from Silif was that Dark Squall had gone in and hadn't come out again. We presume he followed Dark Squall into the fortress. Could you investigate for us?",
    "Dark Squall has been spotted near the Black Knights' Fortress. I've already sent Silif to go and scout out the area, but we haven't had any reports back yet. Can you go and investigate, please?",
    "Yes, Silif has told us how you managed to free him! Quite a daring raid!",
    "Incredible! This is a success!",
    "With Silif's help we've made some calculated guesses regarding the location of Lucien's base. The heroes are heading north along the western perimeter of the Wilderness on the look out for Lucien's base.",
    "Far from, Player! This could well be the most important part of the whole project!",
    "Since you planted the teleorb on Surok, we can really take advantage of this situation. Silif, can you explain?",
    "When you're ready to go, stand inside the cell and we'll perform the spell to switch places with Surok.",
    "It's similar in design to the commorb. I believe that the orb is a critical aspect to the communication between Lucien and Surok.",
    "The route we think will be most useful is through Surok's base. Look for clues to find out how Surok managed to get to Lucien's base. Once you get into Lucien's base, find Lucien and see what he is doing, then report back here.",
    "Are you ready to be teleswitched? Remember, you'll look like Surok to the guards there, so you should be safe. Just try not to draw any attention to yourself.",
    "Okay, before we start, I had better teleblock the cell! That surok probably has some magical abilities that would enable him to escape else[sic]! Thankfuly[sic] it won't affect the teleswitch!",
    "Okay, here we go.",
    "Arcanus Sempitor Teleportus Retainus.",
    "Yes?",
    "Oh, Player, how goes your search of Lucien's base?",
    "As Silif explained, we need you to investigate Lucien's base. The party of heroes is also looking for Lucien's base, perhaps you'll run into them?",
    "Silif believes that there is some way to get to it through Surok's bae using an orb Silif saw there. You should dress like Surok to gain entry to his base of operations.",
    "Yes, I think that was what Silif was suggesting.",
    "It's a little nerve-wracking, to be honest, but Idria thinks that the party of heroes should help to resolve this issue once and for all.",
    "With any luck, Lucien can be controlled and perhaps his power reined in.",
    "Oh, Player, Idria was anxious about your return. I'll just draw her attention! Idria, do you have a moment for Player?",
    "Indeed, and well done, Player. We have a lot to be grateful to you for.",
    "We're just happy that you're still here with us in one piece! I hope that Lucien gaining the upper hand is short-lived, but the horrors you must have seen... You've really inspired me and many of the Temple Knights who have heard of your bravery.",
    "Yes, I have a feeling that the ties you've helped to create between the Temple Knights, Crux Eqal and the Guardians of Armadyl will represent a solid force which Lucien should have some trouble tackling."
  ],
  "Silif": [
    "Here you are, sir!",
    "The name's Silif, I'm a friend of Akrisae.",
    "Oh, you mean regarding Lucien? I'd talk to Akrisae, Thaerisk or Idria for more information on that. I'm currently a bit bogged down with my own planning.",
    "What? I won't talk...you can't make me!",
    "Oooh, my head... is that you, Player? Saradomin be praised...please, get me out of here!",
    "Not sure, Player, it all happened so fast...I'm too weak to think straight.",
    "Yes, right...of course...sorry, sir. I've sustained some injuries...",
    "Also, I'm so hungry I could eat a cow stuffed between two bread carts.",
    "And I need to get out of this accursed cell!",
    "Sorry, sir, I'm not sure where I am. I was next to some sort of broken bridge when I was captured.",
    "I'm very weak, I can barely move...",
    "Okay, well, I'll try to hold out a bit until you can find some. But, hang on...what's that strange glowing light I can see? I feel a strange compulsion to move towards the light...",
    "I'm very weak, I can barely move...",
    "That sounds wonderfully tempting, but I'm a bit too weak to sort through your items, can't you just give me some food you can spare?",
    "Well, err, yes, please. I'll be the patient, notice all the cuts and bruises, and you be the caring saviour who feeds me some food. I'd do the same for you if the situation was reversed.",
    "Mmmmm, oh yes, that's delicious. Did you make this yourself? Oh, it's so good!",
    "Much better since getting that food, but my injuries are still giving me some pain. I don't think I can move any great distance.",
    "Yum! You make it sound so 'lovely'!",
    "Sure, that sounds great, but I think I'm a bit too weak to sort through all your items to get to it. Can you just give me the one you're happy to let me have, please?",
    "I think three doses should do the trick...if you manage to find some! But if you have four doses, I'll give the remainder back.",
    "Mmmm, thanks, I feel much better now! I can't manage four doses! Here, you have the rest.",
    "I'm well, thanks, Player, but I'm eager to get on with my mission now.",
    "Yes, we should try to get into Dark Squall's inner base. I believe I can memorise the maps and plans in there and duplicate them when I return to Falador.",
    "Hang on a second. I think I'll probably need some sort of a disguise to get in there, won't I? How did you get in there and manage to get the key for the cell?",
    "Good thinking, Player, hand it over and let's get this mission completed.",
    "Okay, Player, no time to talk now. We need to get into Dark Squall's inner base. Can you remember where it is?",
    "Good, then let's head there. I need to get into Dark Squall's inner base and investigate those maps and plans, then we can report back to Akrisae.",
    "I can hardly see through this helmet, take me near to the maps.",
    "Okay, we're here now. I'm going to peruse the maps for a bit and memorise them.",
    "This is a real opportunity for us! Dark Squall is here: We can take him into custody!",
    "You have to think outside the box, young Player. Remember how you apprehended that spy earlier?",
    "I happen to have one here, I managed to keep it hidden from the guards. I'm going to check these maps out a bit more. You place the teleorb on Dark Squall and I'll meet you back at Falador.",
    "Once you've done that, get out of here and head back to Akrisae, I'll try to get away and meet you back there.",
    "I know! I saw you do it! I just got back myself! Go and tell Akrisae.",
    "Certainly, Akrisae. We believe that Surok had a way to make contact with Lucien - most likely face to face. We need you to imitate Surok and look for a way to gain access to Lucien's base.",
    "Some of the plans I found suggest some sort of special connection between Surok's base and a remote location in the north-west of the Wilderness.",
    "Also, I believe some sort of special orb was used in connection with this.",
    "It's probably quite important that you take it with you when you go!",
    "Not sure, friend. Akrisae is pretty much running the show now, but thanks for your help back at the Black Knight Catacombs! I'd probably still be locked in that cell if it wasn't for you."
  ],
  "Spy": [
    "What the? Get me out of here!",
    "Sure...it looks and smells delicious!",
    "Nah, I ain't gonna...tell you...",
    "*gulp*",
    "Dark Squall! Some mage called 'Dark Squall' hired me.",
    "Yeah, Dark Squall. He's always busy, never has time to listen. He has these great, ugly creatures at his side. They're not alive, though. Oh, no, trolls the size of houses and dead as the day they died.",
    "I'll tell you everything...he wears a strange red mask that covers his face. He wears a hooded burgundy robe with purple trim and a strange diamond-shaped symbol on the front. Over the top he wears a tan jacket, which is split like a tailcoat at the back.",
    "And that's all I know, I promise!",
    "A quick death! I guess it's what I deserve, go ahead!",
    "Ha! If you had the stomach for torture you'd have done it by now, not messed around with silly potions!"
  ],
  "Mazchna": [
    "Lucien? I'd have thought he was up to no good but haven't heard much recently.",
    "I have a few personal reasons for making sure his plots fail... Certainly, count me in. I'm pretty much immortal, so danger to you is an amusement to me. I look forward to a bloodbath.",
    "Control your enthusiasm, I've already agreed to help. Too much pestering and I may change my mind.",
    "'Ello! Think you're ready to face Lucien, then?",
    "That's easy enough: it's a tradition. When we are trained we learn to say it; I assume there must be some reason, lost over time.",
    "Who knows what would happen if we stopped? It's just like you people and your obsession with silly hats. There's probably no reason, but a lot of folk consider it to be so important that you have to wonder.",
    "I'm sorry, so far from my base of operations I can't perform my usual Slayer functions. You'll have to deal with my replacement, in the usual place. In the meantime, we can save the world.",
    "Player, we must follow. Turael and Duradel must be avenged!",
    "Such knowledge lost with their deaths... You are right, the Slayer cause has suffered enough for one day. We must retreat."
  ],
  "Turael": [
    "Oh, yes, and what about Lucien? I haven't heard that name in a while.",
    "I've spent the last few years telling amateurs to kill goblins. Excitement and danger sounds like just the ticket before I quit the job forever.",
    "You seem very forgetful, really. You have already recruited me, there's no point trying again.",
    "'Ello! Thanks for giving me the push I needed to retire. It's best to go out in a blaze of glory, I say!",
    "Oh, no, I've been training my daughter, Spria, ever since she was knee-high. You should have seen her slay her first cave bug!",
    "Now, she's finished her army duty and sated her wanderlust, she can settle down and take over.",
    "Once this Lucien character is dead and buried, I'll settle down to a well-earned rest. No more 'Turael, swap my task!' for me - can you imagine how many hours I had to spend keeping records up to date?",
    "Think I might take up viticulture and give Bernald some competition.",
    "I'm sorry, so far from my base of operations I can't perform my usual Slayer functions. You'll have to deal with my replacement, in the usual place. In the meantime, we can save the world."
  ],
  "Duradel": [
    "I thought he was annoying enough to have been killed ages ago?",
    "I'd love to, just give me a moment to check whether I can leave this place.",
    "I can come; the years of waiting are over - let Lucien tremble.",
    "I thrive on danger, for I am danger. Lucien will hear my laughter as his corrupt soul burns in the Abyss.",
    "I am ready to join you. Save your words of pleading for those who have not already heard them.",
    "'Ello! Good to be out of that hut I've inhabited for the last few years. It seems that saving the world was enough reason for me to be allowed out.",
    "Let's just say that you don't arrive as the greatest slayer master overnight without a lot of blood and slaughter. I took some shortcuts and trod on some very important toes.",
    "I'm afraid this is a secret that will go to my grave. I cannot take the chance that you would be tempted as I was.",
    "I'm sorry, so far from my base of operations I can't perform my usual Slayer functions. You'll have to deal with my replacement, in the usual place. In the meantime, we can save the world."
  ],
  "Hazelmere": [
    "Oh yes, and what about Lucien?",
    "Is it dangerous?",
    "Indeed, it will be. You can count on me.",
    "How are preparations going? Are we going to be needed soon?",
    "There are dark times ahead of us, but my resolve is strong. We need to face Lucien now.",
    "The human will be toast if we don't move now. Ready for teleport!",
    "This decision was already made and was for the best. Goodbye, my friends."
  ],
  "Cyrisus": [
    "I'm quite familiar with it. Can I help you with something?",
    "Ah, that troublesome Mahjarrat! I've heard rumours of his evil. What is he conspiring to do now?",
    "What other challenges are there for an adventurer? If there's help I can offer, then offer it I shall!",
    "Well, you just made it sound even more compelling!",
    "Sign me up! Can't wait for some action!",
    "Well, this is all quite exciting. This is an illustrious group you've invited me to join.",
    "It's thanks to you that I even feel brave enough to take part in this mission."
  ],
  "Ghommal": [
    "Lucien? Ghommal hear about him. He not enter Guild while Ghommal live.",
    "Ghommal warrior. Live like warrior and put down evil. But who will guard guild?",
    "Not worry, Will write to Laidee. He take care of Guild and not let unworthy pass. Ghommal fight with you.",
    "Me already said. Ghommal be coming with you.",
    "Ghommal is warrior, Ghommal fight for right, with might!",
    "When we going off to have this fight? Ghommal could do with some fresh air.",
    "Okay, I s'pose so."
  ],
  "Harallak": [
    "Indeed?",
    "That is disturbing news. But how can I help you, dear sir?",
    "Of course you would come to me, being the best swordsman in the kingdom. I am honoured.",
    "Pah, I laugh in the face of danger. Let them come and I shall parry... thrust... riposte...Yes, count me in.",
    "Again, Player? I already pledged my sword to your quest.",
    "No matter, dear Player, I am sure you have a lot to organise.",
    "Ahh, it's good to get going on a real adventure again. I've been so busy running the guild recently, I've not had a chance.",
    "I positively relish a bit of danger every now and again - gets the blood pumping."
  ],
  "Sloane": [
    "Lucien? I've heard the name, and not good things along with it.",
    "His evil must be brought to justice...",
    "I live by an ancient code handed down by my family. It is what led me to the Warriors' Guild and what drives me. I cannot sit idly by and see evil flourish. Danger is as nothing to a warrior who is true to his heart.",
    "If by lending my axe to this quest, it gives a better chance of success, then I will see it through. I will stand with you.",
    "Well, I'm ready and waiting to get going on this mission."
  ],
  "Achtryn": [
    "Indeed, I am. My lair in the abyssal regions is a fine place of residence, but it is good to see the sights, to meet mortals and generally socialise.",
    "Oh, yes, he's such a mine of information. He hears what's going on at the pub, listens to the gossip of passing adventurers, and now he's off on a great journey himself.",
    "Though, of course, you know that already. Sorry to babble on."
  ],
  "Spria": [
    "I'd have thought you knew the circumstances, being as you were so involved.",
    "I'm Turael's daughter, Spria. Are you sure your memory hasn't been affected in some way by your questing antics?"
  ],
  "Lapalok": [
    "I am here to replace him, yes, to send both you and he on the path of destruction.",
    "His time is over, for now. The time of the Devourer approaches. If you slay in her name, your fate will be less harsh.",
    "I am pleased to say that she is on the ascent once more."
  ],
  "Dark Squall": [
    "[sic]: You guard! What was all that commotion about earlier?",
    "A trespasser, in this compound? I had better redouble my magical wards to prevent further incursions.",
    "You there! Do me a favour...",
    "Wait a minute! I know you! Player! You have no idea who you're meddling with!"
  ],
  "Elite Black Knight": [
    "Lord Dark Squall, we found a trespasser...a spy by the name of Silif. We have him in a cell ready for some serious questioning.",
    "Ah...Lord Surok! Lord Lucien is 'recruiting', you can observe from the top of the chapel.",
    "Lord Surok! Is that really you? You're going to have to come with me, sir - I need to double check that it's really you.",
    "I guess I can let it go, just this once!"
  ],
  "Dark Squall (evil)": [
    "Ha Ha Ha!"
  ],
  "Surok Magis": [
    "Remember me now, Player?",
    "Guards! Attack this filth! No mercy!"
  ],
  "Player (angry)": [
    "Surok? You're still alive?"
  ],
  "Lucien": [
    "Now, to recruit for my great army!",
    "Ika tha nke rius Zanka Tdaterius!",
    "You! You are not Surok... and you are not welcome!",
    "What wonderful devastation! Still, I have things to attend to.",
    "You've discovered my prize at last!",
    "Movario! Why wasn't I informed of this earlier?",
    "Nonsense! I feel it calling to me and I need its power!",
    "Who's this? Player! I remember we have unfinished business, but I am pressed for time. Any last requests before I kill you?",
    "This fine bauble? Guthix's most powerful tool shall supplement my own massive power! I will be entering the ritual very well prepared... Your so-called civilisations shall be swept away like those of old!",
    "The Mahjarrat shall soon take their rightful place as sole inheritors and leaders of Gielinor, and I will be their lord. If you humans are lucky, your children shall become our slaves.",
    "The Stone is power and power is life! Can't you feel it? The lifeblood of power vibrating from the Stone? It fills my senses; it's almost overpowering! Movario, you have outdone yourself this time!",
    "Power is the only thing to be interested in! You're misguided, sad and directionless if you think otherwise!",
    "My destiny is my concern! You needn't bother yourself, your days will end soon enough.",
    "Hold your vile tongue, puny human! Do you know who you address? I am Lord Lucien of the Mahjarrat, Master of the Thousand Curses. Look upon my works and despair!",
    "Powerful words for someone about to die.",
    "Very well, human, but I may yet spend some time here and see what havoc I can wreak in this sanctified temple to Guthix.",
    "Excellently put, Movario! Perhaps your years of studying have proven useful at last.",
    "This conversation bores me, I must attend to my godhood!",
    "And I'll only want the strongest as my worshippers! Those too weak to slay even these lowly beasts will certainly not be wanted!"
  ],
  "Harrallak Menarous": [
    "Mazchna and I will draw the enemy! Hazelmere and the rest, take Lucien!",
    "Getting back to Falador would be wiser. Did you see the way he slaughtered us....that our weapons are useless? How many more would die? Some must survive to report this nightmare!",
    "Get back to Falador, away from this place of death! We're teleporting out now!"
  ],
  "Cave Goblin": [
    "Watch out, surface-dweller! Don't get too close to the edge!",
    "I meant no offence! It's just that everyone knows this chasm is dangerous, and you surface-dwellers don't have such good eyesight.",
    "Alright, I'm sorry!",
    "Well, there's the sheer drop, obviously, then there's the snake, Juna. No one really knows what to make of her.",
    "Movario's paying us to help him with his expedition. He thin-",
    "That it's a secret...which means we shouldn't tell strangers about it.",
    "Oh, tha-",
    "Sorry, surface-dweller. Movario doesn't want me talking about it.",
    "Movario's paying us to help him with his expedition. He thinks there's something important at the bottom of the chasm.",
    "Oh, that's Ulgon. He's climbing down to see if he can find the bottom of the chasm.",
    "He didn't reach it last time, so Movario made us get a longer rope."
  ],
  "Movario": [
    "Goblin! What did I tell you about what we're doing here?",
    "That's right! Now, you, stranger: stop poking your nose in where it's not wanted or required!",
    "That's none of your concern! Now, leave us alone!",
    "Darve, don't be so rude! He may be prying into our business and essentially getting in our way, but you can talk to him like a normal person, you know.",
    "None of your business - stop poking your nose in where it's not required!",
    "What's it got to do with you? Now leave before I set Darve on you!",
    "Surok? How...",
    "Darve! I can handle this!",
    "Surok, you say? You can tell Lucien that our investigations would be greatly expedited if we weren't subject to all these interruptions.",
    "I will not stand...",
    "Yes? Yes! That sounds very wise. And regarding my research, which parts particularly interested you?",
    "Hmm, well, I have, but how do I know I can trust you?",
    "Hmm, quite.",
    "Well, I suppose I have no choice. Ready yourself! This is my latest hypothesis, and it's quite something to comprehend!",
    "There are vague references to the 'Stone of J--' which I believe to be the 'Stone of Jas'. Based on further research, and the correlation of dates, I've come to an astounding conclusion.",
    "I postulate that not only do the Fist of Guthix and the Eye of Saradomin exist, but they are in fact one and the same item. And before it became known by either of these two names, it was called...",
    "And, if I am not mistaken, Lord Lucien is following in the footsteps of another Mahjarrat who also used its power to ascend to godhood.",
    "I suspect that it's somewhere down at the bottom of this chasm. I fear that I must send away for a considerable amount of supplies to build a gantry, which will require a huge amount of wood and rope, not to mention man-power.",
    "Well, I suppose they look quite nice. Perhaps I shall study their movements at some time.",
    "Shut up, Darve! The adults are talking!",
    "Did you ever manage to get them to go downwards? To the bottom?",
    "Hmm, intriguing! I happen to know a blue light spell which might work. Do you think you could call a creature? I could use my blue light spell to send it down to the bottom of the chasm!",
    "And let you get your filthy hands all over my finds? I don't think so!",
    "Very well, then! I have little choice. When you're ready to go down, just attract the light creature. When you're in position, I'll shoot you...I mean, I'll fire off my blue light spell.",
    "I'm fed up with your time wasting, either you think it'll work or it won't work!",
    "Unless of course! Yes! You could let me know what type of lantern to use? Then Darve can go down first!",
    "(evil laugh): That's exactly what I can do, Darve! And you know it!",
    "Ah! So you've returned! Ready to take your drip to the bottom yet?",
    "Well said!",
    "You suggested something regarding the light creature and being able to get down into the chasm. I'm waiting for you to call one and then I'll cast my blue light spell.",
    "What can you tell me about the chasm?",
    "Answer me! How do we summon the light creatures? I wish to get down there to do my own research! I have a blue lantern, but they still don't seem to come!",
    "It seems highly unlikely that Juna has that capability, she's nothing more than a bloated earth worm! Now silence, Darve!",
    "I'm so desperate to get down in to this chasm! Please let me know as soon as you find something.",
    "You've returned...what news of the bottom? What's down there?",
    "The impertinence! I'll ask these same questions until I get the answers I need!",
    "Go away, there is nothing for you here!",
    "Whereas Lucien is quite normal, I suppose?",
    "Silence, Darve, my work must continue uninterrupted.",
    "The Stone!",
    "(evil laugh): I've found the Stone of Jas!",
    "The power! What power this artefact has! My greatest discovery to date!",
    "A clever ploy, Player, using a disguise to fool us. But we discovered your ruse by talking directly to Lord Lucien!You're[sic] the imposter that turned up at Lucien's outpost, aren't you? Are you brave or just foolish?",
    "Well, it's none of your business, of course, but if you must know, I'm going to research the stone thoroughly, and find the source of its power.",
    "Darve, please be quiet! There is much research to be done first.",
    "The Stone of Jas is probably the most important, the most significant, the most powerful artefact to be discovered in Gielinor. I have been researching religious texts most of my life and only through the smallest of clues, the slightest of hints and the patience of a thousand men did I get the slightest inkling of its existence. Whoever hid the stone meant for it to never be found.",
    "My research indicates that a manifestation of Guthix and its followers built the temple to house the Stone of Jas. The stone circle is a grand lock mechanism for opening the main hall door.",
    "Probably the druids of the old years built the circle in Taverley as a reminder and to celebrate the great work they did for Guthix here.",
    "Who says that Lucien is going to get the Stone of Jas? Nothing is carved in stone.",
    "He may have contributed to my research funds, certainly, but in terms of actual possession, that's another situation.",
    "Enough of these annoying questions, that is my business.",
    "Shut up, Darve!",
    "The stone is my discovery! No one will get in the way of my research...NO ONE!",
    "Darve, I wouldn't be too enthusiastic about tangling with this individual. I speculate that the Stone of Jas had a guardian of no small power and our friend here managed to dispatch it. That's some feat, even for me.",
    "I fear that our helpful friend here would be more than a match for both of us together. I'm fairly certain, however, that Lord Lucien would deal with him in very short order.",
    "While I have Lucien as an ally, your efforts here are wasted. You may as well leave and let me continue with my research.",
    "Now then, Darve! I'm sure that Player is just going to quietly leave and let us go about our business. Otherwise I may be tempted to let Lord Lucien know that we need his support!",
    "Hang on...what's that energy build up in the room? Something powerful is coming. I am awed by its strength!",
    "My Lord Lucien! There is much more research I need to do before it is safe to be used.",
    "(sadly): Thank you, my lord.",
    "Player, please don't anger him, he could kill us all!",
    "Lucien! Curses! My research will be cut short.",
    "Laugh while you may, Lord Lucien will see that you bother us no more.",
    "Time for us to leave, Darve!"
  ],
  "Juna": [
    "He is a villain. He and his master seek power that mortals are not meant to have.",
    "Are you sure your intentions are pure? Look into your heart. A part of it seeks this power for yourself. You must reject this part, and be a faithful servant of Guthix in all things.",
    "It is something that Guthix Himself hid, and it is not your place to uncover it. It is set aside for Guthix alone, and for a mortal to use it would be an affront to the cosmic order. That is all you need know.",
    "I have no need to. There is another guardian, more powerful than I, whom Guthix tasked to protect the prize. Movario will not succeed.",
    "You must stop Movario and his master from finding that which Guthix hid. This is your most important quest."
  ],
  "Darve": [
    "Think you'd better talk to Movario, hadn't you? Don't think I can help the likes of you!",
    "If you want to talk to him, go ahead!",
    "Not interested in what you're selling, I'm a fighter and I'll fight you as soon as look at you!",
    "Surok! *gulp*",
    "Looks like we don't have much of a choice, boss, and he'd/she'd probably understand a lot more of what you rant on about than I do!",
    "I don't think that's what Surok was talking about, boss!",
    "You wouldn't get me in one of those things! Not on your life!",
    "Oh, he's going to 'think about it'! Sounds like a trick to me! I wouldn't go for it!",
    "I don't think so, Movario! You can't order me around like one of your goblin lackeys!",
    "I wish he/she would hurry up! I've got better things to do than hang around these filthy caves!",
    "It's that big snake over there! I keep telling you, every time you starting enticing one, that thing does something to those creatures! Why don't you listen to me?",
    "Oh, I do hope that Surok character doesn't come back...there's something not right about that maniac. I'll bet that even General Khazard doesn't trust him!",
    "Until I see him, I'll reserve judgment. But here's hoping I'll never see him!",
    "He's over there, Movario! Near that big round, rocky...rock.",
    "It looks like this so-called 'Lord Surok' has helped us out after all!",
    "Whatever we like! Probably get a load of loot for it!",
    "Not too much, though, we've got a lot of people interested in this old rock! We'll probably make a load of loot off this, so the sooner we sell it, the better!",
    "It's my business also, Movario! Don't forget, I get a share!",
    "(evil laugh): What? Like you? No problems! I'll do for you, mate!",
    "What? He doesn't look like much! I could do for him!",
    "Don't you give me any of your lip!"
  ],
  "Balance Elemental": [
    "By order of the Governance of Guthix, what rights do you have here?",
    "Perhaps some violence will make you understand?",
    "Do you know what, Player? I've really missed you. It's been such a long time, and your funeral was just such a lovely event. And what was it you used to say to me? Oh, I remember it well, since it was like yesterday. Ah, well, I guess you know better than anyone that the good die young!",
    "Oh well, back to the battle...I'm enjoying it, are you?",
    "The bloom of youth only lasts so long. What can any of us aspire to but a glorious death, and yours was glorious. Oh, and the other day someone else was talking about how much they missed you. How you used to light the place up with your laughter, but it's all gone now. But you know that better than any of us!",
    "But of course, it's always nice to talk, though, and 'manners maketh the man', is what you always told me.",
    "And to protect the Stone until such a time as, near to death, whereby you are relieved of all duties and shall henceforth be returned to your home plane with the gratitude and blessings of Guthix."
  ],
  "Sithaph": [
    "Strength grows within me; the power resonates.",
    "Skethhzzzz!"
  ],
  "Strisath": [
    "I feel it, too, and it is vast! The dragonkin shall be freed - we shall cause the world to quake with our might."
  ],
  "Sakirth": [
    "Let us bring terror and pain to the small races! Terror and pain!"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:While_Guthix_Sleeps?oldid=36122890’"
  ]
}