{
  "Player": [
    "I heard you wanted to speak with me.",
    "I can't help you at the moment.",
    "Interrogation room?",
    "...",
    "I have some questions.",
    "So you're in charge?",
    "Tell me more about the civil war.",
    "And Moia works for Bilrach?",
    "What should I do when I find Moia?",
    "Tell me more about this agent.",
    "The ones with the drawings on them?",
    "That's all for now.",
    "I'll see it done.",
    "What do I need to do again?",
    "Excuse me?",
    "Adrasteia said you would be accompanying me on my mission to hunt Moia.",
    "You don't agree with Adrasteia?",
    "I agree with Adrasteia. Moia should be our primary focus.",
    "You're right. Moia shouldn't be our primary focus.",
    "Should you be talking about Adrasteia like that?",
    "What do I need to do again?",
    "Anne?",
    "You can say that again.",
    "...",
    "It sounds horrific.",
    "How do we find her?",
    "Got it.",
    "This must have been a forward camp. Seems like there was a battle here not long ago.",
    "Odd. I don't see any human bodies.",
    "What is it?",
    "You know a lot about the Mahjarrat, don't you?",
    "It must have come from Moia!",
    "Please stop describing it like that.",
    "On it.",
    "What do I need to do again?",
    "Forinthry?",
    "Have we made any progress with the memory?",
    "I'm ready.",
    "What do we do now?",
    "What do they say?",
    "Well, here goes nothing.",
    "I think so.",
    "And Moia was sent to find and eliminate a demon general.",
    "How long have you been working for Adrasteia?",
    "The ones with the pretty pictures?",
    "You don't seem to respect Adrasteia much.",
    "You speak as though you have a lot of experience.",
    "Moia does have fabulous hair.",
    "We should move on.",
    "This memory looks more stable than the previous one.",
    "What do I need to do again?",
    "I'm on it.",
    "Moia found out who was leading the attacks: Avaryss. She was on her way to the Infernal Source.",
    "I saw Trindine.",
    "How do I know I can trust you?",
    "I see another memory fragment over there.",
    "This memory is very fresh. Moia must have just passed through here!",
    "Trindine. It really was you all along.",
    "...",
    "Adrasteia sent me.",
    "I'm here to stop you.",
    "...",
    "We don't need to fight, Moia. This is a fresh slate. We can work together to create a better world.",
    "Strong words, coming from Bilrach's lapdog.",
    "She escaped!",
    "I have some questions first.",
    "Why did you give Moia the diabolus?",
    "Do you miss the Zarosian Empire?",
    "You're deflecting.",
    "And the other Mahjarrat?",
    "What will you do now?",
    "Good luck.",
    "That's all for now.",
    "I'll report back to Adrasteia.",
    "What do I need to do again?",
    "What about Trindine?",
    "What do we do now?"
  ],
  "Adrasteia": [
    "I do indeed. A serious matter has arisen and I would appreciate your assistance.",
    "Please, speak with me as soon as you are able.",
    "Everything changed when the gods were banished from this world.",
    "As Basilissa, it is my responsibility to safeguard the human kingdoms and maintain their alliance.",
    "But our unity is already under threat.",
    "Without a clear leader, the Zamorakians have descended into civil war.",
    "Even as we speak, they battle for control of the Wilderness.",
    "Better that they're killing each other than our people, but the conflict isn't contained.",
    "A Mahjarrat lieutenant has been slaughtering Varrock's patrols near the border.",
    "Moia.",
    "Though she serves Bilrach, I believe she poses the bigger threat.",
    "We must prove to the kingdoms that I can protect them.",
    "Travel into the Wilderness, find Moia, and stop her.",
    "I have asked one of my most skilled agents to accompany you on your mission. Please speak with them before you depart.",
    "They should be located in the interrogation room downstairs, towards the west side of the castle.",
    "Under my rule, we have primarily been using it to dispose of the White Knights' dirty laundry.",
    "No, wait! I mean that literally!",
    "How can I assist you?",
    "Yes. Although the coronation will not be taking place for a few months, it is but a formality.",
    "When my father- When Saradomin appointed me as Basilissa, I was not certain how I felt. It is a great honour. And an even greater responsibility.",
    "I hope his trust was not misplaced.",
    "After their god was banished, both K'ril Tsutsaroth and Bilrach declared themselves the rightful ruler of the Zamorakian forces.",
    "The situation has deteriorated into open warfare. K'ril and his demon horde on one side, and Bilrach - with his Daemonheim forces and the Mahjarrat - on the other.",
    "She serves Bilrach as his lieutenant. But we know what she is capable of, and the despicable lows to which she will stoop.",
    "We must ensure that she poses no threat to the stability and unity of the kingdoms. That is our highest priority.",
    "Part of me still believes that we can reason with her. That we can work together to create a better world.",
    "Or perhaps...part of me just wants to believe that.",
    "I know what I may be asking of you, and I hope it does not come to that.",
    "But if it does, I trust you will do what needs to be done.",
    "Anne Dimitri only entered my service recently, but they have already proven themselves an invaluable ally.",
    "They have been providing me vital intelligence regarding the Zamorakian Civil War.",
    "The detailed illustrations are perhaps a little excessive.",
    "But they do fantastic work, if you can look past their...unique manner of speaking.",
    "I have every faith in your ability to see this mission through.",
    "I have every faith in your ability to see this mission through.",
    "I have asked one of my most skilled agents to accompany you on your mission, please speak with them.",
    "They should be located in the interrogation room downstairs, towards the west side of the castle.",
    "I have every faith in your ability to see this mission through.",
    "Your cruelty will be your undoing, Moia.",
    "It is a relief to see you again! I have received no correspondence from Anne Dimitri since your departure.",
    "Tell me, what happened?",
    "I see.",
    "The threat Moia poses cannot be understated. It is a shame that she chose to walk this path, and that she was able to escape justice.",
    "I always had my suspicions about Anne Dimitri's identity. But they were an indispensable ally, regardless of their true allegiance.",
    "I am aware of the Zarosian's propensity for duplicity, but I know they value order, just as we do.",
    "The Zamorakians are a threat to all of Gielinor, and cooperation will be vital to securing our future.",
    "Now we wait for them to make their next move. When that time comes, I trust I can rely on your aid once again.",
    "For now, please - take this as compensation for your efforts.",
    "I appreciate your support in these challenging times, Player."
  ],
  "Anne Dimitri": [
    "Hello! You here to confess, or do we need to get you on the rack?",
    "I jest, I jest. I know who you are and why you're here.",
    "Wouldn't be very good at my job if I didn't.",
    "Yeah, I've been told it's time to take my childminding duties to the road.",
    "Gallivanting through the Wilderness chasing down a pawn.",
    "If you ask me, Bilrach and the other true Mahjarrat are the real threat.",
    "If I didn't know any better, I'd say she's letting her history with Moia cloud her judgement.",
    "And I don't know any better.",
    "A shame. I'd hoped you'd see the bigger picture.",
    "Alas, I am but a humble servant of our dear Basilissa. Praise be unto her puerile reign.",
    "I knew you'd see the bigger picture.",
    "Alas, we are but humble servants of our dear Basilissa. Praise be unto her puerile reign.",
    "Eh, I've said worse to her face. She'll live.",
    "I suppose it can't hurt to keep tabs on Moia, and gather more valuable intel while we're at it.",
    "She was last seen in the Wilderness just north-east of Edgeville, near the border with Misthalin.",
    "Let's meet there.",
    "Meet me in the Wilderness just north-east of Edgeville, near the border with Misthalin.",
    "Ah, this place does take me back.",
    "But I suppose that's all ancient history now.",
    "The Wilderness sure is horrifying, isn't it?",
    "The Wilderness sure is horrifying, isn't it?",
    "This is where Moia was last seen, slaughtering Varrock's border patrols.",
    "I interviewed the sole surviving member before penning my report to Adrasteia.",
    "They gave me a very...graphic description of events.",
    "It certainly wasn't discreet. Moia was trying to make a statement and by all accounts, she succeeded.",
    "The survivor told me Moia and her forces approached from the north-east, in the direction of the volcano.",
    "Heading there is our best bet.",
    "Right, are you ready to get going?",
    "These banners... It's the star of chaos, the symbol of Bilrach's forces.",
    "Judging by the depth of these footprints, it can't have been abandoned more than a few days ago.",
    "Oh, that doesn't surprise me. Zemouregal was stationed here and he loves a bit of necromancy.",
    "He's certainly not the type to let deceased troops go to waste.",
    "Hmm... What do we have here?",
    "Interesting.",
    "It appears to be a memory fragment.",
    "I've heard Mahjarrat have a tendency to leak memories all over the place.",
    "Memory incontinence, if you will.",
    "Let's just say it's one of several subjects I am intimately familiar with.",
    "This memory, though...",
    "I'm sensing hate, bitterness and a whole load of daddy issues within it.",
    "Yes, this seepage has 'Moia' written all over it.",
    "Unfortunately, this fragment is too faint to be of use to us in its current state.",
    "But I know magic that should be able to strengthen the memory.",
    "First, we need to search the area for any locations that resonate with the memory.",
    "Search the area and see what you can find.",
    "Search the area for any locations that resonate with the memory.",
    "It's discomforting, seeing Forinthry crawling with Zamorakians.",
    "It's the ancient name of the Wilderness.",
    "I like to paint it occasionally. What it may once have looked like, I mean. As part of the Zarosian Empire.",
    "It seems that your investigation worked! The memory is stirring.",
    "I can channel a spell that will draw out other memories in the area, but I'll need you to gather them.",
    "My spell will draw out other memories in the area, but I need you to gather them.",
    "That seems to have done the trick. The memory is stable now.",
    "As stable as we're likely to get it, at least. On a scale of one to ten, I'd give it a solid three and a half.",
    "'We'? Oh no, no, no. This next bit is all on you, buddy.",
    "I'm not touching Moia's psyche with a ten-foot pole.",
    "You know a thing or two about divination, right? Just poke the memory or something, I'm sure you'll figure it out.",
    "But be careful! You know what they say about dying inside someone's memories.",
    "It's a minor inconvenience.",
    "Enter the memory when you're ready.",
    "Hey! You alright? You still with me?",
    "Good. How was seeing things from Moia's point of view?",
    "You scarred for life?",
    "Interesting... So what happened at the border was not a direct order from Bilrach.",
    "We shouldn't linger here. This area isn't safe.",
    "The fragments seem to be leading to the north. Let's continue our investigation there.",
    "A few months. I rose through the ranks quickly due to the high quality of my reports.",
    "With a ruler as inexperienced as her, I thought it best to keep things simple to understand.",
    "Besides, I do believe I did an immaculate job.",
    "I perfectly captured Moia's luscious hair, and her vacant expression.",
    "Adrasteia has a lot of potential, but she's out of her depth.",
    "It's sink or swim, and she's treading water.",
    "That was a lot of water-based metaphors. Now I'm thirsty.",
    "I've been in this line of work for a long, long time.",
    "I did go on a bit of an involuntary hiatus. When I came back, things were practically unrecognisable.",
    "Can't the world go five minutes without some outrageous drama?",
    "Doesn't she just? At least she has something going for her.",
    "Agreed. I think I see another memory fragment. Let's check it out.",
    "Hmmm...",
    "This one is more recent. But it's still too weak to be of use in its current state.",
    "As before, let's see if there are any locations nearby that resonate with the memory.",
    "Search the area for any locations that resonate with the memory.",
    "That seems to have done the trick.",
    "I'll use the same technique as last time. Get ready to gather the fragments.",
    "My spell will draw out other memories in the area, but I need you to gather them.",
    "Looks like this memory is good to go.",
    "You know the drill now, let's see what secrets Moia's hiding in this one.",
    "What did you see?",
    "I believe there is a portal to the source at the centre of the Wilderness crater.",
    "Did you see anything else?",
    "I see.",
    "You shouldn't, of course.",
    "Come, we need to hurry if we want to catch Moia.",
    "Here we are. The site where the gods were banished.",
    "Hmm, I thought the sword would be bigger.",
    "Let's investigate.",
    "This portal...",
    "This portal must be where the Wilderness connects to the Infernal Source.",
    "But it's sealed.",
    "Take a look at it and see what you can uncover. I'll get this portal open.",
    "While you were watching the memory, I got the portal working.",
    "Be prepared. It seems we have company.",
    "Let's not keep Moia waiting.",
    "Hello again, Moia."
  ],
  "Points of interest found": [
    "[number]/3",
    "[number]/3",
    "[number]/3",
    "[number]/3",
    "[number]/3",
    "[number]/3"
  ],
  "Fragments collected": [
    "[number]/6",
    "[number]/6"
  ],
  "Enakhra": [
    "What do you want?",
    "So, he has you running at his beck and call too? You and every other mortal in this camp.",
    "How degrading. You could do so much better.",
    "Quite true. Well, by all means, continue in your service. If it means you're put to use against our enemies, all the better for us.",
    "Curse these wretched demons. It's time they remembered their place.",
    "Once Zamorak finds a way to return, he will make them pay."
  ],
  "Moia": [
    "I'm looking for Bilrach.",
    "He and I served Zamorak together for years. I'm not going to object to his command here.",
    "Looking for Bilrach. Why aren't you fighting?",
    "As if Zamorak is taking the time to speak to you directly.",
    "I'd like to see you try.",
    "Where's Bilrach?",
    "I am. Why aren't you?",
    "I assumed you would be out there with Khazard.",
    "Watch it.",
    "I'm searching for Bilrach. Have you seen him?",
    "It's his forces that are ensuring we hold out. Or would you rather face the demon hordes alone?",
    "More deserving than you. He's never questioned my loyalty, which is far more than can be said for you.",
    "At your command, Legate.",
    "The demon forces amassing near the Black Knights fortress have been routed. Their supplies were destroyed and their encampment razed.",
    "We encountered a Varrockian patrol near the border during our approach. They were also dealt with.",
    "She doesn't concern me. Nor should she concern you.",
    "I have.",
    "This chaos inside me... The discord between human and Mahjarrat.",
    "When I embrace that conflict, my power grows.",
    "Wait, what's that sound?",
    "The attackers have been defeated.",
    "It's an affront to Zamorak's legacy.",
    "As you command, domine.",
    "You're retreating?",
    "I'm north of the camp now, there seem to be a few stragglers here.",
    "As you command, Legate.",
    "I should search the area for survivors.",
    "Start talking. Who's leading the attacks on Bilrach's forces?",
    "One of the twin furies? Interesting. Where is she?",
    "Thank you.",
    "Adrasteia? What are-",
    "An illusion. Who are you really?",
    "You must be Trindine. I've heard all about you.",
    "You would do well to show me respect.",
    "And what a fantastic job you did, given nothing but ashes remain.",
    "I know my place in this world. Do you?",
    "Act the part all you want. Your relevance ended millennia ago.",
    "Why are you here, anyway? I assume it isn't just to insult me.",
    "What makes you think I would ever accept assistance from you?",
    "...",
    "Explain what you're offering. Quickly.",
    "Capturing Avaryss's soul would give us a strong bargaining chip, and strike fear in K'ril's other generals.",
    "What's in this for you?",
    "And the civil war is prolonged. Don't think I can't see your true motive here.",
    "Why should I trust you?",
    "Tch. Hand over the diabolus, then.",
    "I have an update, Bilrach.",
    "Avaryss has been orchestrating the recent offensive from the Infernal Source. I'm en route to take her out.",
    "I shall.",
    "...",
    "No, that's all. I will contact you again when the mission is complete.",
    "It's time for you and your master to learn your place.",
    "Spare me the empty words. You've lost.",
    "...",
    "You...",
    "Drop the stupid disguise, Trindine. You aren't fooling anyone.",
    "Or amusing anyone.",
    "Small things amuse small minds.",
    "Speaking of which...",
    "That presence I felt earlier, it was you, rifling through my memories.",
    "What are you doing here?",
    "Of course. I assume this is about the handful of irrelevant soldiers I killed? As if their lives were worth this charade.",
    "Adrasteia has no authority here.",
    "I'd like to see you try.",
    "Of course. Of course you'd come now, when everything was finally falling into place.",
    "But I'm not going to let you stop me.",
    "Why would you think this 'better world' is something I desire?",
    "You really are an idiot. Peace will breed only complacency. Conflict is what gives life meaning.",
    "Save your hollow words for Adrasteia, or the other mindless cattle who bend over backwards when you chirp the right tune.",
    "That's rich, coming from someone who licks every boot going.",
    "All anyone has to do is offer a reward and you'll do anything they say.",
    "How can I respect you when you don't even respect yourself?",
    "Good... I knew you had it in you. Real fire. Real strength",
    "What a pity that you waste that potential by doing the bidding of your inferiors.",
    "I do not kneel to those handed their 'authority' on a silver platter.",
    "I won't let Adrasteia take this from me. 'Basilissa' indeed... An empty title for a weakling and a fool.",
    "I won't let Trindine and the Mahjarrat continue to disrespect me.",
    "This is MY time.",
    "My own father treated me like an experiment, and threw me aside the moment I ceased to be of use.",
    "The Mahjarrat demeaned and belittled me for the audacity of being born to a human mother.",
    "I've had to struggle against this world for every breath I draw, every scrap of power I wield, every modicum of respect I'm shown.",
    "Now it's time for the world to struggle against me."
  ],
  "General Khazard": [
    "What are you doing here?",
    "Ah, yes, you're still following his orders, aren't you? My father has delegated your command to an underling.",
    "You wouldn't know. He does. He will.",
    "And you will show me the proper respect as his heir, or I will make you regret it."
  ],
  "Hazeel": [
    "Moia.",
    "Handling our command, I'm sure. You ought to be assisting him.",
    "I know where my efforts are best placed, child. A fight like this needs more than brute frontline force.",
    "Khazard is more than capable of handling himself. I made sure of it.",
    "Don't you concern yourself with him - you have more important orders to follow.",
    "It would be best if you stayed out of his way."
  ],
  "Zemouregal": [
    "Out of the way, girl.",
    "Ha! That addled fool. He's spent too long burrowing after his ferrets in Daemonheim.",
    "A weakling like him does not deserve to lead us to glory. We'll see just how long his command lasts.",
    "Haven't you grown bold. I see that serving at Zamorak's side has given you some undeserved airs.",
    "Not so long ago you would never have dared speak to me like that. You should remember why, before I remind you myself.",
    "Bilrach won't be around to protect you forever."
  ],
  "Bilrach": [
    "At ease, Moia. Tell me, how did your mission fare?",
    "Well done. With their reinforcements weakened the Chaos Temple will be easier to hold.",
    "We would do well to avoid drawing the ire of the new Basilissa.",
    "Our losses at the battle of the Graveyard of Shadows were heavy.",
    "You focus too much on Saradomin's daughter.",
    "We have been making great strides in unlocking your full potential. Concentrate on that.",
    "Have you put more thought into the nature of your power?",
    "Intriguing. We should see if you can-",
    "We're under attack. Defend the camp!",
    "Damn K'ril! Filthy traitor.",
    "I'm the one who summoned him, and this is how he repays me?",
    "The attacks on our position have become increasingly frequent and well-coordinated as of late.",
    "I don't know which of K'ril's lackeys are behind them, but they need to be dealt with as quickly as possible.",
    "Find whoever has been orchestrating these attacks and eliminate them.",
    "Demons attacked us from both the north and west this morning. We lost our forces stationed at the Chaos Temple.",
    "We are abandoning the forward camp and falling back to Daemonheim.",
    "Watch your tone, Tribune.",
    "It is the best course of action, given our situation.",
    "Destroy them, and see if you can extract any useful information from the survivors.",
    "Avaryss? I expected better of her.",
    "Good work, Moia. See she is dealt with swiftly and painfully.",
    "Is there anything else to report?"
  ],
  "Enemies defeated": [
    "[number]/9",
    "[number]/6"
  ],
  "Wounded cultist": [
    "Please... Spare me... I'll do whatever you want.",
    "One of K'ril Tsutsaroth's top generals... Avaryss...",
    "The Infernal Source... She leads our forces from the Infernal Source.",
    "No! Please, I don't want to-"
  ],
  "Trindine": [
    "Oh, you should have seen your face! If only for a moment.",
    "And you are Moia. I've heard nothing of interest.",
    "Oh please. I was a praetorian of the Zarosian Empire at the height of its glory",
    "You scuttle across its ashes, brawling with demons at the behest of a senile fool.",
    "...",
    "No. Believe it or not, I have better ways to spend my time.",
    "I come with an offer of assistance.",
    "From what I've heard, it's not like you have many options.",
    "You know what happens when demons are killed. They are like a nasty rash, they just keep coming back.",
    "But we praetorians devised a means of trapping and weaponising demon souls.",
    "A diabolus, or in layman's terms, a phylactery.",
    "I used to keep one on my nightstand. The pained screams really added to the ambience.",
    "I just so happen to have one on me right now. A particularly powerful one. Would be pretty useful, eh?",
    "The demons are weakened, and my dear Mahjarrat brothers and sisters live to see another day.",
    "Either way it helps you, doesn't it?",
    "You shouldn't, of course.",
    "Do we have a deal?",
    "A shocking twist, isn't it?",
    "By the way, Moia...you're wrong.",
    "I, at least, find this highly amusing.",
    "Well, that was rather dramatic.",
    "Shame I didn't bring any snacks.",
    "Yes. And she may be more of an issue than I originally anticipated.",
    "But things went perfectly according to plan. For the most part.",
    "Adrasteia should appreciate the information we gathered. I'm sure she's eagerly awaiting your arrival back in Falador.",
    "Of course you do.",
    "The Zamorakians want to tear this world apart.",
    "We may not be best buds with Saradomin's lot, but peace under Adrasteia is by far the better of the two possible outcomes.",
    "Upholding that is the task I was given, and it is the task I shall see done.",
    "My traitorous brethren were on the verge of losing, and the longer and more painful this civil war is for both sides, the better for the rest of us.",
    "I merely helped prolong the chaos.",
    "Such deduction skills! I'm surprised Zaros never made YOU a praetorian!",
    "Look, the Empire was a big, creaky mess, ready to fall over if you so much as sneezed wrong. But it had really nice architecture, proper plumbing...",
    "All my stuff was there. I had a great job.",
    "There was the phenomenal view of Dareeyak, and the tailors in Kharyrll that always got my fit just right.",
    "Yeah... They were there too.",
    "I guess it wasn't all perfect.",
    "I won't be returning to Falador castle. Which is a shame, honestly. I did love playing the part of Anne Dimitri.",
    "Adrasteia's sassy and insubordinate yet remarkably competent spy... What can I say? The role really spoke to me.",
    "I'll keep an eye on the situation here. See if I can keep tabs on Moia and Bilrach's next move.",
    "I don't need luck. I'm Trindine!",
    "Tell Adrasteia I said 'hi'.",
    "Tell Adrasteia I said 'hi'.",
    "Can't get enough of me?",
    "Adrasteia should appreciate the information we gathered. I'm sure she's eagerly awaiting your arrival back in Falador."
  ],
  "Avaryss, the Unceasing": [
    "I'm surprised you managed to reach me.",
    "But this war ends here.",
    "Where did you get that diabolus?",
    "No. It doesn't matter. Even with that trinket you are no match for me.",
    "Do you think you can defeat me?",
    "You are weak, Moia.",
    "Serve the other Mahjarrat all you want.",
    "You will NEVER be their equal."
  ],
  "Congratulations! You have completed": [
    "'Daughter of Chaos' - Complete this Novice quest."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Daughter_of_Chaos?oldid=35986420’"
  ]
}