{
  "Ariane": [
    "I think I'm close to finding out what happened here. I could use your help again if you're interested.",
    "That's what I'd like to find out. They were a powerful wizard and they knew what they were doing. This was a calculated attempt to damage the Wizards' Tower. There are Zamorakian magical orders who resent the tower's monopoly on the Rune Mysteries: the Zamorakian Magical Institute, the Dagon'hai, maybe more we don't even know about. They've attacked the tower before, but it's always been more direct. This is the first time they've come close to doing real damage.",
    "The last major discovery the old Tower made was the inner secret of the Rune Mysteries - the teleport spell to the rune essence. I don't know for sure, but I'd guess that somehow led to the tower being burned down. Maybe one of the orders wanted to keep the Rune Mysteries to themselves.",
    "The old tower was made up of wizards from all over the world, with wildly different philosophies of magic. They arranged themselves into four orders, dedicated to different gods: Blue, Green, Red and Grey.",
    "The Blue Wizards worshipped Saradomin, god of goodness and order. He's the most widely worshipped god in human lands. The Blue Wizards believed magic should be used to help people, and focused on non-combat spells. They invented most of the enchantment spells in the standard spellbook we use today. After the first tower was destroyed, it was the surviving Blue Wizards who rebuilt it. The new tower is still a Saradominist institution, although these days a lot of wizards only pay lip-service to the religion.",
    "The Green Wizards worshipped Guthix, god of nature and balance. According to the druids, Guthix created the world and then entered a deep sleep. Before the rise of our current civilisation, the other gods went to war with one another for control of the world. After millennia of fighting, Guthix awoke and banished them, so they could no longer intervene directly. It was a follower of Guthix who discovered the rune essence, and the Green Wizards were the old tower's experts on runecrafting. Their statue depicts their founder transmuting a lump of rune essence into a stack of runes.",
    "The Red Wizards worshipped Zamorak. Most people today see Zamorak as a god of evil, but for the Red Wizards he was a god of chaos, personal strength and creativity. Legend has it that Zamorak was once mortal, but he stole the staff of a god called Armadyl and used it to ascend into godhood. Their statue holds a staff in memory of that. The Red Wizards focused on destructive spells, especially ones involving fire. They invented most of the battle spells that made their way into today's standard spellbook.",
    "There are other gods besides Saradomin, Guthix and Zamorak. The Grey Wizards were those who worshipped lesser-known gods, such as Armadyl or the Menaphite pantheon, or were non-religious. The Grey Wizards didn't invent many spells, but they made some of the greatest contributions to pure magical theory. Their statue's sword symbolises a sharp mind cutting into the heart of a matter.",
    "So, do you want to help?",
    "I want to cast a spell on the source of the power beam. I think it'll tell me who removed the enchantment and released the vortices into the tower. I don't know exactly what'll happen, though, so I'd like you here in case things go wrong.",
    "It's a divination spell that reveals basic information about ongoing magical effects. Ellaron taught it to me when I first joined the tower. I've barely used it since training, but it occurred to me that it might tell me who removed the enchantment from the power beam. It's not normally used on effects this powerful, though, which is why I'd like you here.",
    "Okay, let's see...",
    "Avach disthine calmentor...",
    "Ah. Oh dear. I...must have miscast the spell. I can't seem to move. Hmm. I think I'm stuck in the power beam.",
    "Yes. I'm not hurt, and I don't think I'm in immediate danger - I just can't move.",
    "Yes, I'm sure you're finding this very amusing. But I prepared for this eventuality, didn't I? I asked you to be here in case something went wrong. It looks like that foresight has paid off. So...can you get me out?",
    "I think I'll be released if you can disrupt the source of the power beam. Actually, I've already got an idea how you could do that. If we were to recreate the ritual that created the power beam, that would disrupt it and release me.",
    "No. It's worth a try, though, isn't it? If it doesn't work we can try something else.",
    "I'd rather you didn't. No one's meant to know we're down here, remember? If my idea doesn't work, or if we end up in real danger, you could go and tell Wizard Ellaron - but there's no call for that yet.",
    "Take these runes...",
    "Use the fire rune on a red vortex, and the air rune on a grey one. If I'm right, you'll see something happen.",
    "Use the fire rune on a red vortex, and the air rune on a grey one. If I'm right, you'll see something happen.",
    "Use the fire rune on a red vortex and the air rune on a grey one.",
    "It worked! I thought so - it's a matter of picking the right rune type. You're holding soul fragments of two of the wizards who lived in the old Tower! My idea is that if you put these in places in the tower where these wizards once were, you can trigger memories of what happened.",
    "You should start by using them on the chairs in the library.",
    "What I want to do is recreate the ritual that the old wizards used to create the beam. I think that will release me. But in order to that, we'll need to learn about the ritual. I think watching the memories of the old wizards will give us the information we need.",
    "The chairs were probably marked in the colours of the four orders. You'll need to use the air rune on the grey chair and the fire rune on the red chair. You'll need to place both runes before you see anything.",
    "Runes are pieces of rune essence that have been imbued with magical energy. Different types of rune, different types of energy. That's the fundamental principle on which tower-style magic is based. By manipulating runes we're combining the different types of energy to create magical effects. The old wizards would have used that same type of energy to create the power beam. Something went wrong and the energy ended up imprinted with fragments of their souls. So, if magical energy is stored in runes, and the soul fragments are made of magical energy, I reasoned that the soul fragments could be stored in runes. Once I'd figured that out it was just a case of preparing the runes to store some more energy, and finding the right type of rune for each soul fragment.",
    "My idea is that if you put these in places in the tower where these wizards once were, you can trigger memories of what happened.",
    "You should start by using them on the chairs in the library.",
    "Did it work? Have you managed to trigger a memory?",
    "Amazing! I wish I could have seen it. That could have been the start of the breakthrough that led to them creating the power beam. I think we're on the right track.",
    "Most of the spells in the standard spellbook date back to the old tower. Combat spells were mostly created by Red wizards, enchantment spells by Blue wizards, and so forth. The only major exceptions are the teleport spells. The old wizards knew teleportation was possible, but they didn't learn how to create new spells until the last days of the old tower. Solving the teleportation problem changed everything. It let the wizards create the lodestone network, and the rune essence teleport spell meant the Tower didn't have to rely on a delicate land route to get runes. I've prepared runes to hold the other six soul fragments. You'll need to use each rune on a vortex of the appropriate colour.",
    "You'll need to use each of the prepared runes on a vortex of the appropriate colour.",
    "Most of the spells in the standard spellbook date back to the old tower. Combat spells were mostly created by Red wizards, enchantment spells by Blue wizards, and so forth. The only major exceptions are the teleport spells. The old wizards knew teleportation was possible, but they didn't learn how to create new spells until the last days of the old tower. Solving the teleportation problem changed everything. It let the wizards create the lodestone network, and the rune essence teleport spell meant the Tower didn't have to rely on a delicate land route to get runes.",
    "That's all of them! You should be able to use those runes to trigger the rest of the memories.",
    "The leaders of the four orders used the shrine room to hold meetings. That's the room upstairs, with the statues representing the four orders. If you use the runes containing the soul fragments of the four masters in front of the statues of their orders, I think you should be able to trigger a memory.",
    "The law, nature, chaos and cosmic runes contain the soul fragments of the masters of the four orders. You'll need to place each rune in front of the statue representing that master's order. The orders were associated with different elements: Blue Wizards with water, Green with earth, Red with fire, and Grey with air. If you examine the statues you should be able to see those elements.",
    "Did you succeed in triggering another memory in the shrine room?",
    "What? That can't be right. Surely the wizards of the old tower were above such...pettiness.",
    "I suppose I must have done. I was barely more than a child when I joined the Tower and Wizard Ellaron told me about its history. I used to daydream about the old Tower - wizards of all faiths working together.",
    "Do you really think that? The gods fought one another in the God Wars, but they're gone from the world now. I thought the followers they left behind could put aside their differences. And it did work, for a time. The first tower stood for seventy years and its wizards invented most of the spells we use today.",
    "After the meeting in the shrine room, the masters would have gone to their studies to talk to their apprentices. Can you try to trigger another memory there?",
    "Each of the four masters had a private study, but I think some of them will have collapsed. You'll need to find an intact one and work out which master it belonged to. Once you've done that, you should put the rune for the master of that order on the master's chair, and the rune for that order's apprentice on the chair facing it.",
    "Have you managed to trigger a memory in one of the studies?",
    "A demon? I knew that some of the Red wizards were demonologists, but I had no idea there was a demon involved in the spell that created the power beam!",
    "Of course! That makes a lot of sense. Teleport spells need to move the traveller through a second plane of existence, in order to bypass obstacles. The teleport spells in the standard spellbook use a plane called the Abyss. It's dangerous and chaotic, but that's not normally a problem because you're only there for a split second. The old wizards' ritual created a link to the Abyss which teleport spells could then use. That's what the power beam is. All our teleport spells use the power beam as an anchor. Something modern-day wizards have never understood, though, is how the connection to the Abyss was made in the first place. That must be what the Red master wanted from the demon. The Key to the Abyss would have been the last thing they needed to create the power beam.",
    "People are never going to drop that, are they? Yes, I talked to the caged demon in the Wizards' Tower. Ellaron taught me that you can't trust demons but that doesn't mean you can't ever learn from them - you just need to be careful. The Blue Order of the old tower forbade any contact with demons, though. I don't imagine the Blue master would have been pleased if she found out the Red master had summoned a demon.",
    "After he completed the ritual, the Red master would have needed to distribute the ritual to the other orders. I would guess he did that by meeting the four apprentices in the library. See if you can trigger another memory in the library. I think you'll need all four apprentices, and the Red master.",
    "You'll need to put the four elemental runes on the chairs of the corresponding colours. Water goes on blue, earth on green, fire on red, and air on grey. You'll also need to place down the chaos rune, which contains the Red master. I don't think he had a chair in the library so you'll have to put it on the table.",
    "So, what did you see?",
    "We're nearly there! The ritual would have taken place in this room. All we need to know is where each of the eight wizards stood.",
    "Okay...moving something with magic is simple. Like when I helped you move the statue of Eritona: it took a lot of runes and effort because of the statue's mass, but it was a simple principle. It's the same when you cast an earth strike spell, or whatever - you're making the rock move from you to your enemy. You can't make it move through a solid wall, though. For a teleport spell to be useful it has to be able to bypass obstacles, and that's what the wizards of the old tower had so much trouble working out how to do. That was the teleportation problem. Kelavan's breakthrough, the one you saw him make in the first memory, provided a means to travel around an obstacle by briefly entering a different plane of existence. A different universe, if you like. On its own it was useless, because the wizards didn't have access to a second plane that they could travel through. That's what Zanmaron was looking for when he talked to the demon. The ritual would have opened a permanent connection between this plane and the one Zanmaron found. Teleport spells could then use that connection to travel anywhere in the world - including to the rune essence.",
    "I wish I were surprised. I had always hoped - I know this is irrational, but I had always hoped it would turn out to be a purely magical accident that destroyed the old Wizards' Tower. It's looking more and more like it was destroyed by in-fighting between the different orders. We won't know for sure until we recreate the ritual, though.",
    "All we need to know now is how the wizards were arranged in the ritual. If we could find fragments of the document the wizards wrote the ritual on, we could piece together what we need.",
    "You should search the ruins, see if you can find any parts of the ritual documents. The pieces are likely to be in the studies and the library.",
    "The soul fragments aren't ghosts - they're like copies of the old wizards' personalities, taken at a particular time. Any wizards might have survived and their soul fragments would still be here.",
    "This is interesting, but it doesn't tell us all we need. Could you look for more document fragments in the ruins?",
    "That's it! Using the information in these fragments you should be able to work out where each of the wizards stood during the ritual. You'll need to read the fragments and work out how the wizards were arranged, then put the runes on the floor of this room to trigger the memory.",
    "You need to read the fragments and work out how the wizards were arranged, then put the runes on the floor of this room to trigger the memory.",
    "Surely, this can't be real. I thought the wizards of the old Tower were noble seekers after the deep truths of the universe. First we learn about their bickering and academic politics, and now this... If this is real, there was a plot to destroy the old Tower from inside!",
    "That's true, but that doesn't prove anything. Any of the old wizards could have enchanted a book against decay.",
    "The only wizard who fits is the Red apprentice, Kelavan. The wizard he said was unwittingly helping him must have been Mei.",
    "That's it! Using the information in these fragments you should be able to work out where each of the wizards stood during the ritual. You'll need to read the fragments and work out how the wizards were arranged, then put the runes on the floor of this room to trigger the memory.",
    "It worked! Thank you! The memory's starting! I want to see this.",
    "The Red master was hit by the full force of the power beam! No wonder that started a fire that... Wait! It's happening again! Get down!",
    "(Ariane seems to be in some kind of magical coma.)",
    "Master! What's going on?",
    "Leave [him/her] alone!",
    "Stop talking. I'm trying to concentrate. Adventurer. I think - I think someone wants to talk to you.",
    "Thank you! But there are seven more. It's all I can do to keep them contained - I'll let them speak through me one by one...",
    "He's gone. I can't believe he was using me like that. He mentored me for ten years - how could I not have seen it?",
    "I'm shaken, but I'll recover. If you hadn't been here, though... I couldn't have contained that energy for much longer.",
    "To the Abyss! The soul fragments of the old wizards made him teleport there. He's dead now, or will soon be. The energy of the soul fragments will destroy him like they nearly destroyed me. He'll explode in the abyss, so the Tower is safe.",
    "I...think that's it. We found out who released the vortices, and we stopped him. That's what we set out to do.",
    "I've just had the soul fragments of eight powerful wizards inhabiting me, I nearly exploded, and then I found out the man I most trusted had been lying to me for the last ten years. Please forgive me if I'm not at my most cheerful.",
    "Of course it was. I should have seen how Ellaron was manipulating me.",
    "Is that really what motivates you? Is life just a tally of victories to you?",
    "Yes, that was interesting. Thanks for helping with that... And we saw the ritual used to create the power beam - I need to write that down before I forget it. It could open up new lines of alternative teleportation research... Adventurer, I want to go away and think about this. But thanks for your help - I hope we can work together again in future."
  ],
  "Mei the Grey": [
    "What's Zanmaron got you working on now?",
    "I thought your order perfected attack spells decades ago. Isn't surge the theoretical maximum?",
    "Can't be done. Ozzikan proved you've got to have line of effect.",
    "Let me see?",
    "You're bypassing line of effect by angling the spell through a secondary plane using runes of law. I mean, it's not a complete solution but the principle is... Do you know what you've got here?",
    "I think you might have solved the teleportation problem.",
    "I'm serious! We should show this to Azris. She spent years trying to crack the problem - she's written volumes on why it can't be done. If this is an elementary mistake she'll have seen it before.",
    "Then, she'll take it to the council, and you, my friend, will have a major school of magic named after you.",
    "And who decides what gets left to the gods, Perien? Your order?",
    "With this power we could end hunger, end disease, end war. Unite the world! My conscience would be fine with that.",
    "We were talking about what we could do once we have the rune essence teleport spell.",
    "It's safe, Perien. I studied the ritual - it uses demonic power but it's safe.",
    "Green magic?",
    "Of course it matters! I was there when Kelavan made his breakthrough. This is his work!",
    "It's worth it! With this power we could build a perfect world! End disease, end war-",
    "Look at the tower they built. It might not have as broad a foundation as the old one but it's reached just as high. Such a pity someone would try to destroy it. Pull me out, adventurer - use the last rune.",
    "We're free. But I think I can see a more fitting host for us than these runes, don't you?"
  ],
  "Kelavan the Red": [
    "'Enemies of the order must taste the flames of our wrath'",
    "It's not about power. I'm looking for ways to make the spells bypass defences.",
    "I know. It's one of Zanmaron's impossible problems - I'm meant to try to solve it to learn why it can't be solved. That's what I can't work out. I can't see what's wrong with my solution...",
    "Mei?",
    "What do you mean?",
    "That's not funny, Mei.",
    "And... what if it's not an elementary mistake?",
    "Strength through chaos, master. You wanted to see me?",
    "I...master. I am your apprentice, and I belong to the Order of the Red Wizards of Zamorak.",
    "I thought...Mei and I thought that since Azris was the expert on teleportation research...",
    "I'm sorry, master! But...but it came to nothing anyway. Azris said the idea was a blind alley.",
    "What?",
    "They stole my idea?",
    "What are you going to do?",
    "Yes, master.",
    "Master.",
    "You've completed the spell, master?",
    "Mei, it doesn't matter-",
    "My power beam! My teleportation anchor! It worked! Mei, can you see it? It worked!",
    "What?",
    "I don't care what some other me did and I don't want to destroy any Tower. Adventurer, he said you could get me out of here. Do it!"
  ],
  "Temrin the Grey": [
    "Zanmaron, may knowledge guide you. Do you know what this is about?",
    "My history of Gielinor. I have almost reached the dawn of the Second Age.",
    "When it's ready, my impatient friend. You know that.",
    "She has an announcement?",
    "Yes, I believe it would. It solves both the distance and line-of-effect problems by routing the movement through a second place. Of course, we'll need to find an appropriate plane to use.",
    "Maybe he's...",
    "Never mind.",
    "Fascinating. If I understand this correctly, I am one of several personality fragments possessing an unwilling host body. I assume this is an effect of Zanmaron's ritual being performed improperly.",
    "It seems this situation is unstable. Adventurer, I recommend you draw each personality fragment out of the host body before it is overwhelmed. In my case a cosmic rune should make a suitable receptacle. You will need to time your action so that the rune being used matches the colour in the cycle. It is a pity I cannot observe this phenomenon from an external vantage point. Ah, well.",
    "To the Abyss, my fellow wizards."
  ],
  "Zanmaron": [
    "Strength through chaos, honoured friend. I have no idea. I suppose you were in middle of something?",
    "Ah, when my lord Zamorak enters the scene! When may the rest of us read this masterwork?",
    "We have no idea. I suspect Azris is keeping us waiting in order to inject some drama into her announcement.",
    "That's what I'm guessing. Ah, here she comes.",
    "Honestly, my dear, it hadn't occurred to us to ask.",
    "Temrin? Would it work?",
    "Indeed - and there is more work to be done. We should all study this properly and then reconvene. I will be in my study with my apprentice. Strength through chaos, my fellow wizards."
  ],
  "Unaia the Blue": [
    "Strength through wisdom, gentlemen. Do either of you know what this is about?",
    "Azris - this is amazing! If this is true...",
    "Even so, what you've shown us here is a major breakthrough that deserves recognition. Whose work is this?",
    "You're too modest, Azris. The gods may inspire us but the work is our own.",
    "We are prepared.",
    "Avach sallakar nimporto...",
    "Please concentrate, Perien. Saparanti morudo calmentor...",
    "I'm sure the demonic influence is minor. The core of the ritual is still Wizard Azris's Green magic.",
    "Azris, is this true?",
    "No, Zanmaron, it does matter. If I had known this entire ritual was based on Red magic, I would never have agreed to take part.",
    "And you think that justifies this? I cannot take part in this ritual. Come Perien.",
    "We're hurting someone - I can sense it. If you have a way to get me out of here, please use it.",
    "Who are you?",
    "Zanmaron and Kelavan were my friends, and you are nothing like them, you hateful little man. Adventurer, get me out of here before I do any more harm.",
    "This is one time I'll let you use demonic knowledge, Zanmaron. To the Abyss!"
  ],
  "Azris the Green": [
    "Balance is power, my fellow wizards. I'm sure you're wondering why I've gathered you here.",
    "Since Guthix guided my order's founder to the rune essence cave, the tower has struggled with the problem of transportation. For every rune we make we must bring essence from the mine, through icy wilderness and across pirate-infested seas. Wizards of all orders have lost their lives bringing the runes the tower needs. We have long known that teleportation is possible, but have failed to invent a new spell that could connect the tower to the rune essence. My fellow wizards: this document contains the theoretical framework that will allow us to create new teleport spells.",
    "All I have is the seed: I will need each of your help in developing it into a ritual. No one of our orders can do this alone.",
    "It is my own. After a lifetime of searching, Guthix saw fit to grant me the necessary inspiration.",
    "Where's Zanmaron? It's not like him to be late.",
    "What?",
    "It should have been mine! I've worked all my life on this problem and then some kid has the idea - it should have been mine!",
    "This power beam! So Kelavan's idea worked! I still think a Green wizard would have come up with it eventually.",
    "Really? And what original ideas have you had, self-proclaimed 'Red Wizard'? As far as I can tell you're more interested in destroying other people's. Adventurer, get me out of here.",
    "Oh, I don't think so. Let's see where this teleportation anchor can take us."
  ],
  "Zanmaron the Red": [
    "Kelavan, whose apprentice are you, and to which order do you belong?",
    "Then why did you take your idea to Azris, of the Green Order, rather than coming to me?",
    "Mei and you? So both the Green and the Grey Orders saw your idea before I did?",
    "Earlier today, Azris presented your idea to the Council as her own work.",
    "When I looked into it after the meeting I saw your handiwork in there, and traces of the problem that I set you. You have a brilliant and chaotic mind, Kelavan the Red. Azris has worked on the same problem for so long that her mind has turned to stone, and her apprentice hasn't had an original thought in his life.",
    "Now, Kelavan, they took your idea. They took it, when you handed it to them. How many times have I told you, that we do not trust the other orders? This Tower became great precisely because the four orders are in conflict with one another. We of all the orders should remember that.",
    "What am I going to do about Azris taking your idea? Nothing. You missed your chance to have your name attached to this. I hope it hangs over your head for the rest of your career, spurring you on to greatness. Perhaps then Zamorak will make something of you. What I'm going to do is complete your work. Your solution requires a second plane of existence for the travel to pass through. I mean to find such a plane. If I can do that then the Red Wizards will take some credit for the ritual, even if, thanks to you, it is not the full credit we deserve. Go, now. Think about how you can redeem yourself in Zamorak's eyes. I need privacy for my mediation.",
    "Azacorax, Keeper of the Key to the Abyss, hear me. By the Staff of Armadyl, on which Zamorak impaled the Empty Lord, I charge you to appear!",
    "Strength through chaos, fellow wizards. It's good to hear a healthy argument coming from the library.",
    "Then you'll be pleased to know that you will soon be able to act out your moral dilemmas for real.",
    "Indeed. I have completed the ritual that Azris the Green presented to the council. I've made a copy for each of you to take to your master. The ritual requires eight participants who must stand in a specific pattern. Please stress to your masters that the ritual must be performed exactly as described. Any deviation could be extremely dangerous. We can commence as soon are we're ready. I'll see you in the spellcasting chamber.",
    "Strength through chaos, ladies and gentlemen. Are we prepared?",
    "Please remember, once the ritual begins we must all keep our places in the circle. If anyone leaves there could be disastrous consequences. Senventior disthine rinnesset...",
    "Please, the ritual must be performed exactly as written. Senventior disthine molenko!",
    "It doesn't matter whose idea it was. We must complete the ritual!",
    "No! If you leave the circle we can't contain it!",
    "I told them! The idiots! They deviated from the ritual, and now look what's happened! Disembodied soul fragments possessing some slip of a girl!",
    "Who are you and why should I care?",
    "Worked in secret for a hundred years? Self-Important Tradition of the Magic Stick? You're no Red Wizard.",
    "I've had enough of this. You! Adventurer! Get me out of here, I command it!",
    "So here we are, false Red Wizard. Your apprentice contained us for the height of this tower. Let's see how long you do.",
    "To the Abyss!"
  ],
  "Lesser Demon": [
    "Who calls me from the Infernal Vestibule?"
  ],
  "Perien the Blue": [
    "All I'm saying is, there have to be limits. There are things mortals can do, but some things should be left to the gods.",
    "We all have to examine our consciences.",
    "And who governs this new world, Mei? Your order?",
    "And what we should and shouldn't do.",
    "What's that?",
    "No. I can sense something, behind Wizard Zanmaron. It's a demon!",
    "Mei, can't you see it?",
    "You knew? Demonic power is never safe! We have to stop!",
    "My organ! I always dreamed of the tower having an organ! Is this real?",
    "Archmage? What are you talking about?"
  ],
  "The following text is transcluded from Transcript": [
    "Document fragment (1/5).",
    "Document fragment (2/5).",
    "Document fragment (3/5).",
    "Document fragment (4/5).",
    "Document fragment (5/5).",
    "Diary (Rune Memories)."
  ],
  "...participants in the ritual are to be eight": [
    "one Master and one Apprentice from each of the four Orders. No two Masters may stand next to one another; neither may two apprentices. Neither, also, may..."
  ],
  "...primary opposition among the gods is between Saradomin and Zamorak": [
    "therefore the Masters of these gods' orders must stand opposite one another across the spellcasting circle. The secondary..."
  ],
  "My only regret is that I cannot reveal my motives to the wizard who will play the key role in my plan. When I first met her I had hoped that my influence could convert her to the side of Zamorak, but I see now that her heart will only allow her to be a Grey wizard. No matter": [
    "the naive curiosity that makes her so clearly a Grey wizard will ensure that she plays her part in my plan."
  ],
  "Player": [
    "I found a diary in the ruins.",
    "The diary doesn't look that old.",
    "Who do you think wrote the diary?",
    "Enough about the diary.",
    "I found some document fragments."
  ],
  "Archmage Sedridor": [
    "Welcome, adventurer, to the world-renowned Wizards' Tower. How can I help you?",
    "I believe Wizard Ellaron is downstairs, talking to Wizard Valina in the tower entrance.",
    "It seems I owe you thanks, adventurer. I trusted Wizard Ellaron so much that I was blind to his plotting beneath my nose.",
    "As thanks for saving the Tower, I have given you access to my personal rune essence store. Take as much essence as you want from the chest in this room."
  ],
  "Wizard Ellaron": [
    "Hello again, adventurer. What can I do for you?",
    "I am nearing the end of a long line of arcane research. I just need to consult a final few books in the library. Soon, this room will be the site of a breakthrough that will change the Tower forever!",
    "You were right to come to me. I have experience dealing with that sort of magical coma, so I should be able to bring her round.",
    "Oh yes, there's nothing to worry about. Magical comas rarely last long. You'll see her up on her feet very soon.",
    "You've already done more than enough, adventurer. You can leave this to me now. A magical coma is a delicate condition so you should leave it to an expert.",
    "Oh, did I slip up? Did I let on that I know more than I should - almost as if I planned this whole sequence of events, and my plan is so close to completion that I'm becoming careless about what I say?",
    "She was my apprentice - and she has done exactly what I taught her! She's a born Grey Wizard: clever but naive. I just had to give her an interesting hook and she'd go wherever her curiosity led her.",
    "Oh, my diary! I was wondering where that got to.",
    "For revenge, adventurer. Slow-burning, passed-down-through-generations, dish-best-served-cold revenge! Two of the ritual participants survived the destruction of the first tower: Perien the Blue, and Kelavan the Red. Perien founded the second tower and blamed the first tower's destruction on Red Wizards. Kelavan went into hiding and took an apprentice, who in turn took an apprentice, beginning a secret order of elite Red Wizards. I am the secret heir to the Sacred Tradition of the Staff of Fire, and today I bring the vengeance of Zamorak against the Wizards' Tower!",
    "It's too late for that, adventurer! I have no quarrel with you - leave now, or be caught up in the tower's destruction.",
    "Behold the vengeance of the betrayed souls of the great old tower! Behold the bloody foundation of the new tower, rising to destroy it!",
    "My dear apprentice, you are fulfilling the purpose for which I trained you. Your wide-eyed search for truth has led you exactly where I wanted. Don't worry, you won't have to contain that power for long. The soul fragments will tear you apart and the explosion will level the tower!",
    "You should run away now, adventurer. You don't want to be here when my apprentice loses control of that power.",
    "Adventurer! You have no right to interfere!",
    "Aack! So you've learned to channel that energy? Enjoy it while you can. Any moment now it'll overwhelm you.",
    "Temrin the Grey. So you've retained some degree of consciousness.",
    "Archmage Perien! You built this tower. Built it on the bodies of the Red Order! Now you'll play a part in its destruction!",
    "This changes nothing! Even one soul fragment would be enough to overwhelm her. You can't hope to draw them all out in time.",
    "Shut up, Sland! No one even remembers you.",
    "Master!",
    "The Blue wizards killed your master and drove you underground, but you founded a secret order to seek vengeance! This is that vengeance! Hold on to that body! Any moment now you'll destroy the tower. Enemies of the order must taste the flames of our wrath!",
    "It's too late for that, watery wizard. You disobeyed my master and stepped out of the circle! You destroyed the old tower and I'll use you to destroy the new one!",
    "I am Ellaron the Red, Heir to the Sacred Tradition of the Staff of Fire! I bring the vengeance of Zanmaron and Kelavan whom you betrayed.",
    "Never! Only Zamorak grants us the creativity to have truly original ideas!",
    "Lord Zanmaron!",
    "I am heir to the Sacred Tradition of the Staff of Fire! The Blue wizards betrayed you but we have worked in secret for a hundred years to bring them down!",
    "But...master! I'm doing this for you!",
    "No!",
    "Overwhelm me, then! Let me explode with the fury of Zamorak! With my death the tower will fall!",
    "No! Don't! Don't make me teleport!",
    "No!"
  ],
  "Lesser demon": [
    "Small mortal. No, you are not as interesting as she was. I will not speak to you."
  ],
  "Sland the Green": [
    "Hey! I think I get this. Adventurer, you need to wait for the right moment then use an earth rune."
  ],
  "Congratulations! You have completed": [
    "'Rune Memories' - Complete this Novice quest."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Rune_Memories?oldid=36192165’"
  ]
}