{
  "Player": [
    "How go your preparations?",
    "Do you want me to lead Captain Rovin and his scouts to Paterdomus?",
    "King Roald sent me to talk to you. Aeonisig is on his way. Have you two figured out anything we can do to strengthen the Salve?",
    "This isn't looking good. Keep thinking - I'll go see if Aeonisig has arrived. No doubt he'll need help with something.",
    "Perhaps. I'll first need a weapon that's effective against vyres. Sunspear, perhaps, or another weapon made of blisterwood.",
    "Think about how the humans that live there feel.",
    "Alright, you don't have to shout it in my face.",
    "That's the last of them...for now. I should check on Aeonisig.",
    "We need to establish a fortified position until reinforcements arrive.",
    "It's still occupied by Zamorakian monks.",
    "Anything else?",
    "It doesn't work. You saw that.",
    "'Shore it up?",
    "I can see if Drezel and Ivan have thought of anything yet.",
    "Anything else?",
    "What about Captain Rovin? I had to deal with those vyres because they're not equipped for it.",
    "That's the lower floors cleared. Now to check out the top floor of the temple.",
    "You'll what?",
    "What is it with you conspirators? What are you up to?",
    "That's the last of them. I'd best report back to Aeonisig.",
    "Aeonisig said you need some better armaments for fighting vampyres.",
    "Steel? Why not something stronger?",
    "Points made. Steel it is. What exactly do you need?",
    "Blisterwood weapons are the most effective, but there's no way I'd have time to equip the whole of Varrock's army.",
    "Aeonisig really needs us to figure something out down here - a scouting party of vyres just attacked us across the Salve! Vanescula's army can't be far behind.",
    "Your faith alone won't protect us here, Drezel. We can't rely on gods to save us.",
    "Surely, it can't hurt for us to read this book.",
    "Not yet.",
    "Yes - it's seemingly an account of how the barrier was first created, written by Ivandis Seergaze.",
    "He suggests that the seven warriors created the barrier from a blood ritual passed to them by Saradomin.",
    "It's the only lead we have - if it is a lie, then we'll find out, but if it's truth it might be what we need.",
    "Unfortunately, the details of the ritual have been left out, though there are some pages missing at the end of the book. It ends with Ivandis starting his journey into Morytania. We have no idea what he did next, but we do know where his body ended up.",
    "I'll go back there, and see if I can find a way to open his tomb.",
    "Yes, and among some other documents that I should probably read, I found a recipe for a more potent version of his Guthix balance potion.",
    "It details his struggle with what sounds like vampyrism, and his efforts to discover a way to reverse it. From what I can make out, he created the Guthix balance potion. There are also notes for how to create a more potent version, but I haven't done so yet...",
    "I should show this potion to Drezel and Ivan in the Paterdomus mausoleum.",
    "I've made what Ivandis referred to as a super Guthix balance potion. It was intended to be a way for Ivandis to, um, cure himself...of vampyrism.",
    "Look, it doesn't matter if it's true or not, but this potion might help us.",
    "And we fixed the River Salve by soaking up the corruption with rune essence. Good idea. I'll pour this potion in the well, and that should introduce the cure to the Salve.",
    "I've strengthened the Salve barrier. I hope. I should report back to Aeonisig.",
    "I've discovered a more potent recipe for the Guthix balance potion that should have, er, done something to the Salve. We're not sure exactly what, but it should at least slow down Vanescula's advance.",
    "Paterdomus temple is no longer occupied.",
    "No, they teleported away again.",
    "Remember that splinter group I reported to the king? Well, they're back.",
    "I'll deal with them in my own way.",
    "I've equipped the Varrock guards.",
    "I've completed those three tasks.",
    "She's alone?",
    "Even if he can, I'm not sure how much good that would do.",
    "No, but his army is prepared to fight should you try to cross the Salve.",
    "They'll be here soon enough. If you turn back now, we can avoid a war.",
    "Don't you mean loss of life?",
    "King Roald won't allow his citizens to become a buffet...he will put up a fight, there will be blood.",
    "You were foolish to come alone. How about I just kill you, here and now?",
    "Please, you don't have to do this. Spare Misthalin. There must be another way.",
    "Your word is worthless! You betrayed the Myreque. You murdered Safalaan!",
    "You expect me to believe that Safalaan wanted this?",
    "Look, I'm inclined to believe your intentions, but the people of Misthalin aren't going to take your word for it.",
    "They see you as invaders, and they will defend themselves. If you truly believe this is the only way, at least talk to King Roald first.",
    "I don't believe that. You'd just end up subjugating the people of Misthalin in their stead.",
    "He doesn't see it that way.",
    "That's a lot of vyres...",
    "Seems I'm doing a pretty good job of that so far.",
    "Is Drezel dead?",
    "Who are you? Where did you come from? And what was that thing?",
    "Is Drezel dead?",
    "Goodbye, Drezel. Rest in peace.",
    "Do you believe Vanescula would keep the peace, that all of her vyres would?",
    "I'll seek out Efaritay and see if I can help. If nothing else, it might get her on side to help us.",
    "Who are you?",
    "What purpose do you serve?",
    "How did you become Roald's advisor?",
    "Farewell",
    "Talk about River of Blood.",
    "Aren't you? I thought you were a king that led from the front lines?",
    "Talk about the beacons.",
    "Ask about the kingdom.",
    "Greet the king.",
    "Um, Efaritay. I'm sorry to interrupt, but we could still use your help.",
    "Imprisoned by Lord Drakan? That was you in the prisons on Vampyrium, wasn't it? Why wouldn't you leave with us?",
    "Your son is Safalaan, yes? He was with us that day. He helped me to kill Drakan.",
    "Drakan's sister, Vanescula. She was helping us to depose her brother, but as soon as we'd defeated Drakan, she turned on us. Vanescula bit Safalaan. She killed him.",
    "Wait? We did find a pendant here, in that crypt. Safalaan was wearing it.",
    "I don't understand. Why would your pendant be back here?",
    "Vanescula said something back at the bridge. I dismisses it before, but she suggested Safalaan was a willing participant.",
    "I saw the bite, he collapsed, and he didn't appear to be breathing, but...then Vanescula teleported away with his body.",
    "But Vanescula took him to use his blood to make her army immune to the Salve's wards. Surely that's not something he'd survive, even if the bite didn't kill him?",
    "Agreed to what?",
    "What? That thing that attacked us at the Salve - you're not suggesting THAT was Safalaan? No way. He'd never attack us like that.",
    "Ivan? Yes, he was a Myreque too. A survivor of Drakan's hunt.",
    "Drakan broke the spear in my fight with him. I was only able to retrieve the spear's blade.",
    "I'll help, if you can tell me what I need to do.",
    "Hmm, I'll see what I can do.",
    "So I need the Sunspear blade I took from Lord Drakan, a new blisterwood shaft and a twin-bladed silver spike?",
    "I kept Sunspear's blade, but lost it. Ivan should be holding on to it for me.",
    "I have Sunspear with me... Well, the blade at least.",
    "I have Sunspear's blade in storage. I'll go retrieve it.",
    "How would I go about crafting a new blisterwood spear shaft?",
    "I've crafted a new spear shaft out of blisterwood - I hope it will suffice.",
    "And then you said something about a twin-bladed silver spike? That sounds familiar to me - it doesn't happen to affect werewolves by any chance, does it?",
    "One better - I used to own a wolfbane dagger. Drezel gave it to me. I imagine he or Ivan is looking after it.",
    "One better - I think I have it with me. It is a wolfbane dagger.",
    "One better - I think I own one. Drezel refers to it as a wolfbane dagger.",
    "Here - I have the reforged Sunspear with me.",
    "Where should I start in tracking down the wyrd?",
    "Vanescula told it to return to the castle, but if she meant Castle Drakan, I can't see how I'd gain access, even with my disguise.",
    "Not anything specific. I know it's possible, but have no idea where or how it's done. All of the Myreque that operated in Meiyerditch are either dead or missing.",
    "Again, I don't know much. There's an abandoned laboratory beneath the city where I once found a book on the subject, but I couldn't understand a word of it.",
    "Not yet. I'll see what I can find.",
    "Sarius? What are you doing here?",
    "Only a few of us got out - myself, Ivan and Veliaf. Veliaf has given up, and Ivan's gone back to Paterdomus.",
    "I think there's probably plenty of blame to go around. Safalaan was reckless too, and Vanescula played us all. You weren't to know she'd betray us.",
    "She bit him, and now I suspect she's turned him too, but if so he's not like any vyre we've ever faced.",
    "To see if I missed anything about haemalchemy...some clue about how people are turned into vyres. Now I think of it, how did you find this place?",
    "The problem is, I've already thoroughly searched this place. The only thing I found was a book on haemalchemy, and that was just sitting out in the open.",
    "I found an old acquaintance there, oddly - the daughter of the man who used to work in that lab.",
    "Hey, I think I found something. It's marked with the same symbol from the haemalchemy book.",
    "I discovered a well-hidden journal written by Sarius's father.",
    "Um, I don't know, I haven't read it.",
    "The journal Sarius and I discovered talked about haemalchemy. Her father, Mauritys was coerced by Drakan to experiment with it. It was he who discovered a way to vampyrise other species in laboratory conditions, but he continued other work in secret, and it sounds like he found a way to reverse the process entirely...",
    "I'm not sure I'd call vampyrism a disease, but effectively, yes. We already know of some ways to undo the process in its earlier stages. The Guthix balance potion can sometimes turn juvinates back into humans, and the super version is more consistent, but always turns them feral. It makes sense there'd be a more refined method, and it appears Mauritys discovered one a long time ago... at least in theory.",
    "It suggests using the key ingredient of the other Guthix balance potion, but with two different ingredients to enhance it. Those being refined daeyalt and what the journal refers to as 'the blood of the hybrid', a creature he only theorised about.",
    "Well, there is a mine in the heart of Meiyerditch, a work camp for humans that refuse to pay tithers, but that's only daeyalt ore. We need refined daeyalt. Mauritys's journal says that refined daeyalt is used in the vampyrification process, so there must be a refinery down there somewhere too.",
    "Mauritys's journal doesn't name a specific creature, only something theoretically possible according to his research. His premise was that blood that has been altered via haemalchemy is always trying to revert back to its natural state. Refined daeyalt's role in vampyrification is to bond a subject's own blood with vampyric blood. The theory was that using the blood of a creature that embodied all possible states would catalyse a subject's rejection of non-natural states.",
    "I discovered a journal in the tunnels!",
    "Oh, I don't know. I haven't read it yet...",
    "I found this journal written by your father. It suggests he wrote this after the laboratory was destroyed.",
    "His notes theorise about a way to revert vampyrism! It's why Drakan had this place destroyed.",
    "The only problem is that it's only a theory. He suggests two ingredients necessary for a 'cure'. The first is refined daeyalt, itself a key ingredient in turning other species into vyres - it acts as some sort of catalyst for change.",
    "The problem is the other ingredient. He calls it the 'blood of the hybrid', a theorised creature that has traits of many different species. He suggested such blood would allow for the creation of a universal cure.",
    "If that wyrd is Safalaan, its blood could be the key. It's worth a shot.",
    "Well, for now maybe I should just try to find some refined daeyalt. There must be a refinery connected to the daeyalt mine, right?",
    "There isn't much down there, save for a tunnel where loaded mine carts are taken.",
    "What, even to Vanescula's personal tithe?",
    "Where does it look like? Into the mine, of course. I'm sure I don't need to remind you that I'm Vanescula's personal tithe...",
    "Well, I suppose I could just tell Vanescula that you tithed me instead of sending me to the mines, right? I'm sure she'd understand.",
    "How do I reach the refinery from here?",
    "How do I reach the refinery from here?",
    "I've done that already.",
    "How do I reach the refinery from here?",
    "House Ghrazi prefer the taste of aggression.",
    "House Vitur prefer the taste of awe.",
    "House Pyrah prefer the taste of disapproval.",
    "House Myrmel prefer the taste of remorse.",
    "House Drakan prefer the taste of hope.",
    "House Shadum prefer the taste of submission.",
    "I've shut down the refinery. Now I can get the refined daeyalt.",
    "I have the refined daeyalt. Now all I need is the blood of the hybrid.",
    "Yes - the layout reminds me of the prisons in Drakan's castle on Vampyrium.",
    "Yes, and some refined daeyalt! Also, I think the wyrd is in there too, in some sort of rejuvenation chamber.",
    "Probably, but I need to find a way to open it first.",
    "Safalaan, is it you?",
    "Wha- I don't feel so good. Must find Safalaan. His blood...",
    "It was the wyrd in that tank. It slashed me with its talons and...I don't feel so good.",
    "Safalaan held back, though - it wasn't a lethal dose. I need to head back to the castle to chase him down.",
    "I don't feel right...at all.",
    "Safalaan, wait. I know it's you.",
    "I can't do that. You're my friend.",
    "You need my help, and I need yours. Please, wait!",
    "I don't feel right...at all. I... What-What's wrong with me...?",
    "My... lord? I don't... understand. Why am I answering him? Lord Drakan is dead.",
    "I... Wha-What's wrong with me...?",
    "Kael?!",
    "Andiess...",
    "I can get to the roof now.",
    "He's not completely gone, and we can bring him back. You just need to trust me.",
    "I can take that away. All I need is a little of your blood.",
    "Wait, Safalaan, stop! That's Efaritay. That's your mother!",
    "Let's hope Safalaan's wyrd blood is this 'blood of the hybrid' Mauritys theorised.",
    "Safalaan, I'm going to need just a small sample of your blood.",
    "If I mix some refined daeyalt into Safalaan's blood, along with some of Ivandis's serum, that should create a potion to counteract vampyrism.",
    "I've lost Ivandis's serum.",
    "I found it in the tomb of Ivandis Seergaze.",
    "(Same as above)",
    "I should talk to Efaritay first, then take it to Paterdomus mausoleum. I can reclaim this from Efaritay if I lose it.",
    "So, you know that potion I just made?",
    "I've lost it.",
    "Here, Safalaan, take some of this potion...",
    "How do you feel?",
    "Well, that bodes well. Hopefully, this potion will work better than the last one...",
    "I'm glad I could help. Now I have this presumed cure, I should return to Paterdomus with it to see if it actually works.",
    "I've managed to make an even more potent version of a Guthix balance potion - this one should reliably convert vampyres back into their original form, not turn them feral.",
    "Don't fall apart now, Ivan. I need you to perform the ritual.",
    "Are you so sure about that?",
    "It's over, Vanescula. Stand down. We can talk this over peacefully.",
    "Vanescula, stop! See reason. Your army is falling apart before you.",
    "Build your society of humans and vampyres here, Vanescula.",
    "What has this got to do with me?",
    "I'm happy to report that Vanescula has retreated her army back to Darkmeyer. A formative alliance is in effect.",
    "It's better than them fighting, killing and eating each other.",
    "I'm sure he enjoyed that news.",
    "How are you finding your new role as an ambassador for Varrock?",
    "Perhaps it will give you a new perspective on the issues Morytania now faces.",
    "I'll keep that in mind. Thank you, Queen Efaritay.",
    "I still can't believe you agreed to this, to being turned into the very thing we were fighting.",
    "It sounds like you've got a lot ahead of you. I hope you can make this alliance work.",
    "So, er, how goes the truce?",
    "So, it's good, then?",
    "How is the vyre population responding to all of this?",
    "Well, okay then.",
    "Why are all the vyres here still shocked to see a human? Why do I still need a disguise?",
    "Can't you just tell them to, you know, stop attacking humans?",
    "Are you suggesting you can't control them or that you won't?",
    "So, none then?",
    "Veliaf, you should know - Safalaan is sort of back. He's, er, still a vampyre, but he's just like his old self. I discovered a serum that diminishes vampyric bloodlust.",
    "He's helping to oversee bringing peace to Meiyerditch and Darkmeyer, with the help of Efaritay, Aeonisig and Vanescula.",
    "Wait, you're not going to try to kill her are you? The peace we've brokered is quite new and fragile.",
    "Phew! Yeah, that sounds like a good idea.",
    "You seem to be a bit more cheerful.",
    "How are the citizens of Meiyerditch taking to this new...arrangement?",
    "It sounds like you've a lot on your plate. Good luck with it all.",
    "Why not?",
    "Really?",
    "You're more than welcome.",
    "Hi, how are things in Meiyerditch now?",
    "Do you know much about the new leaders?",
    "The truth is somewhere between all of those things.",
    "Hello there.",
    "What is this place?",
    "How are you doing?",
    "What's that awful smell?",
    "How long have you been here?",
    "Okay, thanks.",
    "How goes things, Ivan?",
    "I think he's as overwhelmed as you are, but I get the impression he's going to be fine. He's certainly got plenty of support, what with Vanescula and Efaritay...and Aeonisig too, for whatever that's worth.",
    "Vampyres aren't undead. They're living creatures, originally from Vampyrium. It's a common misconception. Regardless, you're welcome. Any news on where Zemouregal and Arrav went?",
    "For now, at least. The brokered peace may not hold.",
    "Such as?"
  ],
  "King Roald": [
    "How indeed. Have troops been sent to Paterdomus yet, Aeonisig?",
    "Good man! Then let's get to it, shall we? What do you say, Player?",
    "Splendid.",
    "No, I need you to visit the temple's caretakers and see how you can help them. Aeonisig here will be my eyes on the frontline - pack your bags, you're going on a little field trip.",
    "You're going, and that's final, unless you wish to start advising my wife on delphiniums?",
    "I need to be here to oversee preparations for the army. When I arrive, I expect a FULL report this time - do you understand?",
    "Now, please, Player, go ahead and meet with Drezel and your friend. Aeonisig shall join you there shortly, at the old watchtower by the start of the beacon network.",
    "Do not let me down now, Player. Your expertise in this matter is required.",
    "Do not let me down now, Player. Your expertise in this matter is required.",
    "How things come full circle, Player. It seems barely any time ago at all that I first asked you to visit with Drezel, and now look at where we are.",
    "Aren't you supposed to be doing something in Morytania about now?",
    "Mind your tone. My fighting days are behind me. It takes a lot of work to raise an army. I'm well aware of the situation on the front lines. I'm trying to garner military support from our allies, but they're all busy dealing with their own issues. I fear only the return of the gods themselves would bring us all together. For now, Varrock stands alone. Besides, the wife won't let me go. If you think an army of blood-suckers is scary, try being married to her!",
    "Do you have a report from the front lines?",
    "So my scouts inform me. I'm not quite sure how I feel about this alliance - humans, vampyres and now an icyene all working together.",
    "And not invading my kingdom too. Still, we shall have to keep a close eye on how this develops. To that end, I have ordered Aeonisig to act as an ambassador for Misthalin.",
    "He shall be my eyes and ears in Morytania, or Hallowvale, or whatever they end up deciding to call that place this time.",
    "We've had words. He was starting to presume too much about his position - 'king's advisor in spiritual matters'. As if I don't get my ear bent enough by my wife.",
    "Anyway, as I understand it, you were once again pivotal to the events of the day. As such, it is only right to reward you for your efforts...",
    "Varrock has survived many attacks since its founding, but I'm thankful this vampyre situation was resolved peacefully.",
    "And if it doesn't, we shall deal with the situation. I am taking steps that, should it not hold, Varrock will be in a much stronger position to deal with it. For example, Aeonisig is offering aid to the citizens of Meiyerditch in exchange for shipments of blisterwood. Truth be told, my worries have moved on to other matters. If it's not one thing, it's another, so they say.",
    "It appears that your intervention at the Salve targets only vampyres. Werewolves, on the other hand, are free to cross. The reports state that they have effectively declared independence from the vampyres. We shall need to keep a close watch on what they do with this newfound freedom."
  ],
  "Aeonisig Raispher": [
    "Captain Rovin has a small scouting force ready for travel, my liege.",
    "M-my liege? You want ME to go to Paterdomus? B-but I'm of more use to you here. I'm not a soldier.",
    "I... No, of course not, my liege. I'll inform Captain Rovin.",
    "Y-yes, my liege. I understand.",
    "This is all your fault, adventurer, making me out to be incompetent and undermining me. Who will advise the king better than I?",
    "You will defend me if the vampyres attack, won't you? Not that I need protection.",
    "I do not like being so near to these accursed lands.",
    "Well, I can sympathise just as well from a distance. I'd much prefer to never meet a VAMPYRE!",
    "No, vampyres! Behind you!",
    "Vyres! West of the Salve! This is awful! This is a disaster!",
    "Yes, I admit, I didn't take you seriously. But this threat! All of Misthalin is in danger! If those were scouts, then Vanescula will be here soon. The five of us will not be able to face a whole army. We must do something. We can't just wait here to die.",
    "What about Paterdomus? Could we use the temple as a base?",
    "Yes, of course. Maybe you should clear them out of there.",
    "Well, uh, what about the Salve barrier?",
    "Yes, but couldn't you, I don't know, shore it up or something?",
    "Yes. You know, nail a few metaphorical boards over the windows.",
    "Yes, good idea.",
    "Not that I can think of.",
    "Good idea! See what you can do to help them.",
    "Talk to Drezel and Ivan in the Paterdomus mausoleum. Stregthen that barrier, no matter the cost.",
    "We need to reclaim the temple of Paterdomus to use as our base of operations. It's currently occupied by blasphemous monks of Zamorak. I doubt they'll leave without...encouragement.",
    "Good.",
    "Whatever it takes.",
    "A naive sentiment. We don't have time for negotiation, and I doubt they'll be in any mood to listen.",
    "The Varrock guard aren't well equipped to fight vampyres. Captain Rovin could use your aid.",
    "Talk to Drezel and Ivan in the Paterdomus mausoleum. Stregthen that barrier, no matter the cost.",
    "I'm not sure why you're talking to me about this. You're supposed to be helping Drezel to strengthen the Salve barrier.",
    "Well, that sounds worryingly vague. Whatever you've done, I hope it works. Desperate times, and all that.",
    "Good, thank you. It's long overdue that we reclaimed it in the name of Saradomin.",
    "Kill now. Feel bad later. (Continues below)",
    "Yes, now apply that pragmatism to Vanescula. (Continues below)",
    "Remind me not to make an enemy of you. (Continues below)",
    "Did you kill that splinter group's leader?",
    "A shame. Never mind, we have more pressing concerns.",
    "We've enough to worry about with a vampyre army on its way. We don't have time to question them, just get rid of them! If we manage to survive a vampyric invasion, then we can investigate those little warmongers.",
    "Hopefully, they should be able to fend off any further scouting parties.",
    "And not a moment too soon. Rovin has spied Vanescula's arrival at the bridge over the Salve.",
    "For the time being, at least so it seems, though her army cannot be far behind.",
    "Well, you do know each other. Clearly, she won't listen to you, but it might stall her for a time. (Continues below)",
    "If you think it would be that easy, then by all means go and confront her. (Continues below)",
    "Indeed, yes, you should do this. I'll keep watch from the overlook. (Continues below)",
    "Regardless, I shall have the beacons lit to inform the king that her army has arrived. I do hope he can muster something of an army of our own in response...",
    "I don't need King Roald to tell me that peaceful resolution here is not an option! You would expect us to believe our citizens have nothing to fear from this army before us?",
    "She is a monster, boy! Don't be taken in by her words - all she desires is the blood of our citizens! We should kill them all.",
    "I hope you can find a better solution than turning all vyres feral! That is NOT a solution to this issue.",
    "Send them all! Ha!",
    "What are you people doing? Have you lost your minds? We should finish her off now! All of them!",
    "I, er, think I should go and advise the king.",
    "I cannot believe what you have managed to achieve here. The king will be most pleased - you should report the good news to him.",
    "My new role? This is a punishment, not a promotion! I hate it here.",
    "Indeed. Though I may not be happy, I shall do my utmost to make this situation work...if for no other reason to get back into the king's good graces. Maybe then he'll let me go back home."
  ],
  "Drezel": [
    "Greetings again adventurer. How go your travels in Morytania? Is it as evil as I have heard?",
    "Yes, well, we don't have Saradomin here to do it for us this time.",
    "If there were I'd know of it, I'm sure.",
    "Weren't you going to see if Aeonisig had arrived?",
    "Greetings again adventurer. How go your travels in Morytania? Is it as evil as I have heard?",
    "Really? They've actually crossed? It's not supposed to be possible. I hoped Saradomin might still be able to resolve this.",
    "He is said to have created this barrier. Although separated from us, surely he could do so again. I...",
    "I had hoped it would not come to this...but there is one book that might help. But it is a forbidden tome. Some even consider it heretical.",
    "Because it surely cannot help but give us false hope. Only Saradomin can aid us now.",
    "No, I suppose not. The book is hidden away in Paterdomus library...locked away where it belongs. My predecessor dismissed it as Zamorakian propaganda, and I've no reason to disagree. Retrieving the hidden book had something to do with where each of the Seven Priestly Warriors came from, used in a specific order. The Sleeping Seven book should help...",
    "Like I said, it's blasphemy. It can't be the truth. It's clearly Zamorakian propaganda.",
    "This feels wrong - to commit such sacrilege on the basis of reading a clearly false text.",
    "That could be just the solution we need! Gather the ingredients and make the potion.",
    "This is all nonsense, of course. Ivandis was a hero.",
    "There is something we could try. It is possible to alter the effect the Salver barrier has. If you recall, the Zamorakians attempted a similar thing by corrupting it.",
    "We may as well try this potion, seeing how vampyres can now cross. At least we might have some say in what happens to them when they do.",
    "You should see what more you can do for Aeonisig while Ivan and I prepare for the arrival of Vanescula's army.",
    "Do your worst, vyre. We're more prepared for you than you realise. Saradomin's light shall protect us.",
    "Witness the fate of any vyre who would dare threaten Misthalin. What good is an army you cannot control, Vanescula?",
    "S-stay back, foul creature. Ivan is under my protection.",
    "An icyene! Are you here to carry me into the arms of Saradomin?",
    "My insides are outside. No...not the coffin - stop the coffin! It's shaking!",
    "The light is everywhere. My eyes...it hurts my eyes.",
    "Ivan... You are caretaker now. You are the heir of Ivandis.",
    "We are never ready. Be our hero now, as Ivandis once was. It was an honour to serve at Paterdomus. My time...has passed."
  ],
  "Ivan Strom": [
    "Unfortunately not. If only we knew more about how the barrier was created in the first place.",
    "Is there really nothing in the library that might help?",
    "Why would you think that?",
    "Drezel, are you holding out on us?",
    "Why did you not mention this sooner?",
    "Have you found this hidden book yet?",
    "The key thing I know about the Seven Priestly Warriors is that we used to name the days of the week after them.",
    "Have you found this hidden book yet?",
    "Does it help us?",
    "A blood ritual?",
    "I guess, but what do we need to do?",
    "His hidden tomb? Perhaps that's where the missing pages are?",
    "We're desperate here, Drezel. We have to try.",
    "Did you search the tomb of Ivandis Seergaze?",
    "Did you find the rest of Ivandis's diary? What does it say?",
    "Couldn't he have been both?",
    "I don't see how - it's not like you're going to convince an entire army of vampyres to drink some, and I doubt you'd have time to make enough anyway!",
    "Um, but shouldn't we be certain and ask the king? Shouldn't he be here by now? Vanescula is-",
    "You may be able to cross, but we've altered the Salve barrier. If you truly care for the vyres, then you'll stay on your side of the river.",
    "I warned you not to cross. We didn't know THAT would happen exactly, but, um...",
    "Drezel, no!",
    "I've been fighting against you vyres my whole life. I'm not afraid of you!",
    "No, but he's severely wounded, and I think that wyrd did something to him. Some sort of poison, maybe?",
    "Q-q-queen Efaritay? You're quee-",
    "But you can still help us.",
    "What's a wyrd? I've never heard of them.",
    "What has it done to Drezel? Why did it come after me?",
    "No, but he's severely wounded, and I think that wyrd did something to him. Some sort of poison, maybe?",
    "He hasn't been making sense for a while. The wyrd's poison is making him see things.",
    "What? No! Stay with me, Drezel. I need you. I'm not ready.",
    "He's gone. Drezel is dead. Perhaps Efaritay is right. Maybe we should just let the vyres pass. If we fight them, there'd be so much death.",
    "Despite everything that's happened, she still makes a lot of sense, and I could almost believe that she'd at least try to keep her word. But that thing with the wyrd - it's clear she can't control them all. Their lust for blood is just too strong. It's an impossible choice - either way, they'd be bringing a lot of death to Misthalin. Yet, in spite of the fact that Vanescula's army is sat on our doorstep, that wyrd is what I'm most afraid of. It came right for me, and what it said... Something tells me that's more important to deal with than Vanescula right now. Even she couldn't control it.",
    "I can't believe Drezel's dead.",
    "Yes. I'm ready. Let's do this.",
    "Pour the potion into the well. I'm right behind you.",
    "Player, do it!",
    "Wow! That was impressive.",
    "Let's hope this potion has the desired effect. I'll stay here, though you can tell me about the look on Vanescula's face when she finds out what we've done.",
    "You have forced us to defend ourselves, Vanescula. You did this. Send as many vyres across as you wish!",
    "You have always been genuine, even when we doubted you. I believe that we can all live together, somehow.",
    "Thank you once again, my friend. I don't know what we'd have done without you. Nor King Roald, for that matter! You deserve a big reward.",
    "It's all so overwhelming, but I'm learning new things all the time. Drezel left his own journal for me. I think I'm going to start off by planning a renovation for Paterdomus temple. How is Safalaan doing?"
  ],
  "Captain Rovin": [
    "Talk to Aeonisig. We'll keep watch.",
    "We just aren't equipped for fighting against vyres.",
    "Our armour is just about adequate for guard duty, but an army needs steel.",
    "You've not served in many armies have you? The time and money it would take to outfit an entire army with anything more than steel is immense. Besides, I certainly don't want to talk to the king about increasing our military budget, and I doubt Vanescula will delay the start of her war just to reduce my stress levels.",
    "Make it a platebody, platelegs and a medium helm - three of each should cover my advance guard. As for weapons, what do you recommend? These silver-edged weapons from our stores seem woefully inadequate. We were able to get a lucky hit in here or there while those vyres were focussed on you, but that's it.",
    "Could you at least get some to us? Personally, I'd favour a polearm, and my two scouts here could each use a sickle. that's the Myreque symbol, right? It might lift spirits for the other soldiers to see that.",
    "Thanks for the assist, Player. We feel less like sitting ducks here now. You can tell that bureaucrat we're sorted. And you should know, my scouts say they spotted an absolutely huge vampyre out there - big claws, purple fur, bestial. I think their fear is making them see things, but I thought you should know.",
    "Next time those vyres attack, we'll be ready for them!",
    "Stand ready, soldiers. The next vyre attack could come at any time.",
    "First you helped us defeat Zemouregal's zombie army, and now you've saved all of Misthalin from invasion by Morytanian bloodsuckers. You're a veritable scourge of the undead.",
    "Nope, not yet. There's still a whole bunch of zombies in Zemouregal's old Wilderness base, but we've not seen hide nor hair of the individuals we're truly interested in apprehending."
  ],
  "Guard": [
    "I don't like this one bit.",
    "I don't like this one bit.",
    "Bring it on, vyres!"
  ],
  "[Varrock guard 1]": [
    "Stand your ground!"
  ],
  "[Varrock guard 2]": [
    "Our weapons are ineffective!"
  ],
  "Monk of Zamorak": [
    "Stop him/her!"
  ],
  "Zamorakian bodyguard": [
    "I told you. It's not here!",
    "Not that there's anything to stop it now. It doesn't matter if it's the vyres or Roald tha-"
  ],
  "Zamorakian leader": [
    "It has to be! Search the room again. If you two buffoons let it fall into enemy hands, I'll...",
    "You!",
    "Ha! Like we'd just tell you our plan.",
    "Shut up, stop talking, and just kill him/her!"
  ],
  "Taverley": [
    "Not Enough Taverns"
  ],
  "Falador": [
    "Only a Model"
  ],
  "Vanescula Drakan": [
    "Player, why am I not surprised that you're here to welcome me? Wherever there is an underdog, there you are, holding its leash.",
    "Alas, we must talk business. I assume you're delivering the terms of King Roald's surrender?",
    "Hahaha, his army? My scouts report no such thing.",
    "That would be my preference too, but we cannot turn back. Tell Roald to step aside and we can avoid any unnecessary loss of blood.",
    "That too.",
    "Understand, Player. We have wrung all of the blood out of Morytania. The dirty rags of Meiyerditch are dry.",
    "If my people starve, I will not be able to control them. I have only a sliver of control remaining.",
    "In time, we can learn to live together...perhaps even prosper.",
    "There's always blood. It's kind of our deal. (Continues below)",
    "Unlike my prideful brothers, I won't give you the chance. You shall not goad me into a fight.",
    "And you would be foolish to think I am alone... (Continues below)",
    "I will spare any that do not stand in our way. Don't make that you; I've grown quite fond of your mild competency. (Continues below)",
    "The Salve no longer contains us, and Roald's army is woefully unprepared to repel us. You're about the only competent human opposing us, but even you can't stop an army.",
    "You have my word that we shall take only what food we need to survive.",
    "You humans and your absolutes. Have you even considered that Safalaan was a willing participant?",
    "Don't you see? His sacrifice enabled the Myreque's victory. Once we cross into Misthalin, the humans of Morytania will be free of vampyric rule. These can be hallowed lands once more.",
    "I'd be happy to, were he even here. Perhaps he does not care as much as you think, if he'd only send his cowardly advisor. (Continues below)",
    "I have no desire to rule over humans. If King Roald would only work with us, then we can avoid unnecessary deaths. We should be allies, not enemies.",
    "Enough talk. You know my stance. Will you step aside?",
    "Well, will Roald allow us free passage? All of us?",
    "It appears to me that yours is the greater thirst for blood.",
    "You've already witnessed that we can now pass the Salve's barrier. Retreat your forces; there is no need for war.",
    "Whatever you think you've done, little Myreque priest, it's too late. Juvinates!",
    "Show these idiots the folly of their resistance.",
    "What have you done? Why did they all become feral?",
    "This is madness! You would rather us become the very animals you fear than let us cross and live in peace?",
    "These beasts would kill you just as readily you blind, arrogant zealot!",
    "How dare you defile my kind like this? This shall not go unanswered! Whatever trickery is at play here, I shall overcome it, and you will answer for this depravity!",
    "What are you doing here? I told you to remain behind.",
    "You are not needed here, wyrd. Return to the castle, now!",
    "Vampyres, fall back!",
    "Whatever trickery this is won't save you - this isn't over!",
    "Once we regroup, we'll be back to end this once and for all!",
    "Vampyrium? So that is where you have been gone all these years? We thought you secluded in your quarters, obsessing over that 'rock'.",
    "Whatever you've done, I'll figure it out. All you've done is to delay the inevitable.",
    "Enough! This ends now! I will not let you hide behind your abominable river.",
    "So, you might turn the younger vampyric converts feral, but that magic should not affect my vyrewatch.",
    "Let's find out, shall we?",
    "Vyres!",
    "What have you done? How? Sacrilege!",
    "This isn't an act of war. It's an atrocity. You cannot just wash vampyrism away! We are not a stain to be cleansed!",
    "You reduce my vampyres to humans and want to 'talk this over'? No, no, Player, I am unavailable for chit-chat.",
    "I am resolved now. You have given me the taste for battle. An eagerness to see your head proudly on a pike, perhaps.",
    "Let us see what your 'taint' will do to my werewolves.",
    "Werewolves, attack!",
    "I said attack, you ignorant mutts! Sic them! I command you to attack! Claim your new territory!",
    "I am Lady Vanescula Drakan, not some common vyre. You WILL address me appropriately and you WILL obey me!",
    "This will not stand. You hear me? It will not stand at all!",
    "No! You think I'll lick my wounds like these dogs? Or that I'll twirl my cape and disappear into the night?",
    "The fate of my race, my people, my friends - it all depends on this moment. Across the river is life. To turn back is death.",
    "I do NOT lack conviction. Unlike my brother, my resolve is strong.",
    "You may have backed me against a wall, but I am not toothless.",
    "Wyrd!",
    "Kill this priest! Let's see how your protections work without him!",
    "Safalaan...What are you...",
    "No! You cannot do this to me! I demand you change back!",
    "Nor are they yours! Not any more.",
    "You think the humans wouldn't rise against us? And my vyres...",
    "It appears I am left with little choice in the face of all this gross optimism.",
    "I will not let my people die. Know that. And I shall not forget this day. You have damaged my people in ways you cannot comprehend.",
    "But I am willing to discuss terms of an alliance. If it fails, I'll just have you all killed.",
    "Fine. I'll signal the army to retreat back to Darkmeyer.",
    "There is one final thing I wish to discuss with Player, and then I shall join you both at Castle Drakan.",
    "Don't say anything, Player. Let me talk for a moment. I want you to listen.",
    "Years ago - thousands of years ago - my family wasn't in the position we are now. We had lost battles against the other houses. We were weak.",
    "One loss was against Lord Jovkai and his sycophants. A narrow loss, but a loss nonetheless.",
    "We invited him and his family to our camp to discuss reparations. We prepared a meal. We prepared riches. Such was the custom.",
    "But when he arrived, Lord Jovkai had brought his own banquet. He sat at the head of our table, and beckoned us to sit. Meals were placed in front of us.",
    "I looked around at my brothers. We ate without joy. I could eat nothing.",
    "Lord Jovkai watched us. He asked if we were enjoying the meal. My brothers nodded in agreement, but I remained silent.",
    "Then he filled his cup with wine again and stood up. He told us that this was it: this was to be our reparations. We would be strangers in our own home, dining from his scraps.",
    "He walked over to me, placing the cup in front of me and forced me to drink it. I had to; his blade was at my back.",
    "Once the meal was finished, Lord Jovkai made me wash the plates, like some disobedient child. Vanescula Drakan, tending to tables.",
    "So I washed Lord Jovkai's cup in slow poison.",
    "Every time he took a sip from that cup, he grew more ill. And he loved to drink.",
    "Though he was tended to, he died less than a year later.",
    "We did not lose another battle after that meal. There was a fire in all of us. We would never eat scraps again.",
    "You made me lose this battle today. So if you ever make me feel like a stranger in my own home, I will be the slow poison in your cup.",
    "Enjoy this victory. This battle was yours. You did well. Relish it.",
    "And when the dust falls on all of this, you should join me at Castle Drakan so we can share a meal.",
    "It will be my treat.",
    "Now, run along. I suppose you had best report back to your masters of your victory over the 'vampyre menace'.",
    "I have nothing to say to you right now."
  ],
  "Vanescule Drakan": [
    "That is his failing, not mine."
  ],
  "[Vanescula Drakan]": [
    "What have you done?",
    "My beautiful minions...",
    "Obey me!",
    "Stop this now!",
    "Do as I command!",
    "Get back here!"
  ],
  "???": [
    "You talk too much. I am here to make good on your threats."
  ],
  "Wyrd": [
    "No. The smell of these two priests disgusts me. The boy's piety makes me retch.",
    "I will see him dead. Their protections will not save them from me.",
    "You will not keep me from my prey.",
    "Your last words are a lie, boy. I smell your fear. Your blood line shall die with you.",
    "Gah!",
    "Don't call me that!"
  ],
  "Efaritay": [
    "Begone, abomination!",
    "My name is Efaritay. I was once the protector of these lands.",
    "I am no queen. Not any more.",
    "You do not deserve my help. I have sacrificed so much to avoid war, yet you humans appear to invite it.",
    "This fight is your own. I have neither the strength nor inclination to protect you from the vyres, or from yourselves.",
    "I'm here only for the aberration - the wyrd.",
    "They are abominations, and they loathe all that is good and holy. It will kill you, given another chance.",
    "And I'm afraid your friend won't survive. The wyrd's poison will cause hallucinations, but it will be the wound that kills him.",
    "Wyrds were rare even in my time, but they still managed to murder many of my fellow icyene. I will see this one dead.",
    "Should you wish the same, I shall be lamenting my fallen brothers and sisters, buried south of Hallowvale.",
    "Or just go back to fighting your needless wars.",
    "Dessocles, Apherna - I am so sorry. I failed you. Your son, my beloved Ascertes, dead. Our son, Safalaan, lost. So many dead of my own kind. And for what? The humans and vyres stand once more at the brink of war. I sacrificed so much, but it was all for nothing.",
    "I am sorry for before, at the bridge. I have been imprisoned by Lord Drakan for so long, to avoid war, and to see opposing armies upon my return angered me.",
    "Drakan held my family hostage. I dared not risk them, but his death freed me. And yet I return here to find his word was meaningless. My husband is dead and my son is gone. I know not where.",
    "Safalaan was there? I didn't... What happened to him?",
    "If only he'd discovered my old pendant here, it would have protected Safalaan from her.",
    "And yet somehow my pendant's found it's way back here? how strange. Could you retrieve the pendant for me, please?",
    "Someone must have returned it. You said Safalaan was wearing it. If that were true, Vanescula would not have been able to bite him. Not unless he stopped wearing it, but why would he have?",
    "Wait, did you actually see my son die?",
    "Then Safalaan may still be alive! It would take more than a single bite to kill him, and someone returned that pendant here.",
    "Not unless...no, she wouldn't have, not to my son! He'd never have agreed to it!",
    "If...if she'd...turned him. He could have given up his own blood and fed on others to heal...but that could mean that wyrd was...",
    "Drakan mocked me for years about his experiments with an offshoot of blood magic called haemalchemy. He threatened to turn my husband and son into vyres on a number of occasions. Over time, it was clear that Drakan learned to regret those experiments. The advent of wyrds was one such cause for that regret. It must be why he spared Safalaan...though not my husband. Wyrds are rare occurrences, so he told me, only created when someone with icyene heritage was turned. The closer to icyene a subject was, the larger and stronger the wyrd, and the greater its contempt for the pious, and for creatures of light. It would be why the wyrd went after those monks. Did Safalaan have some connection with the boy?",
    "I need to be sure - would you help me to track down this wyrd? If it is Safalaan, perhaps I can get through to it. And if I cannot, I could do with your assistance in reclaiming my old weapon, Sunspear. Drakan stole it from me; I'm hoping that you kept it upon defeating him.",
    "I forged that spear myself from the first blisterwood tree planted here, but barely got to use it. When Drakan's attack came, we were caught off guard. My seat of power was the castle north of here; Drakan tunnelled into it from what is now this graveyard. We'd been led to believe vampyres were nothing but feral beasts, but they are clever and cruel. Before we could mount a defence, my family was in his grasp. My surrender was selfish and swift. I should have fought back, but I was afraid. From that day, he carried my own weapon as a symbol of my submission. Some of the icyene most loyal to me tried to mount an early resistance, but ended up here, struck down by the very weapon I created to protect them.",
    "I'd like to fully reforge the spear, if we could. Please, bring me the blade. We'll also require a new blisterwood shaft. There was one final component, however, which may be more difficult to track down. Drakan removed the twin-bladed silver spike.",
    "It should be simple enough if you are able to obtain some blisterwood logs. Simply craft them as you might make any other blisterwood weapon, except this time make a spear shaft.",
    "Yes! It suppressed their ability to change form. You know of it?",
    "Please, once you have the blade, the blisterwood shaft and a silver spike, reforge the spear and bring it to me.",
    "Drakan tainted this weapon with the blood of my brethren, but you have made it anew. Thank you for restoring Sunspear to its former glory. I find it fitting that you should continue to wield it against the darkness of Morytania. It has already done more good in your hands that it ever did in mine. I shall bind it to the young priest, Ivan Strom, for you to reclaim should you lose it.",
    "I'm not sure. I wounded it back at the river; I suspect it fled to heal itself.",
    "Then we should try another approach. Wyrds are created through a process of vampyrification - do you know anything of this?",
    "Then what do you know of haemalchemy? Perhaps it can provide some clue for how to track the wyrd.",
    "It doesn't sound like much to go on, but should there perhaps be something in this haemalchemy laboratory that you missed?",
    "Did you find anything in the haemalchemy lab?",
    "Did you find anything in the haemalchemy lab?",
    "I wonder if she can help you discover anything more about haemalchemy.",
    "Did you find anything in the haemalchemy lab?",
    "Did it help at all with our search or was it only personal?",
    "Did you find anything in the haemalchemy lab?",
    "You mean there's a cure?",
    "It would explain why Drakan turned away from vampyrising other species, and no doubt strengthened his resolve to return to simpler times for his own kind. Did this same journal suggest how we might replicate this 'cure'?",
    "Do you know somewhere to obtain refined daeyalt?",
    "This daeyalt mine sounds like somewhere you should investigate further.",
    "What is the blood of the hybrid?",
    "If this wyrd really is Safalaan, then his blood could be the key to a cure.",
    "Have you discovered anything in the daeyalt mine?",
    "Presumably this mine is guarded, yes? I'm sure they would know about a refinery down there.",
    "Have you found a daeyalt refinery?",
    "Is it Safalaan? Should I come to help?",
    "Very well. I'll head to the castle and join you soon.",
    "The poison of the wyrd is said to cause hallucinations, before death. It must be quite debilitating.",
    "If you can corner him on the roof, I'll help trap him there so he doesn't escape.",
    "I won't let you go again, son. We're here to help you.",
    "Stop, son.",
    "Be calm. We're going to help you find yourself.",
    "Well, where did you find it? You'll have to return there to see if there's any more.",
    "Yes?",
    "Then it's lucky for the thousands of vyres and humans that might otherwise die that I found it.",
    "Thank you for helping me to find my son again. We have much healing to do, but he is responding well.",
    "We shall join you there when we can. For the time being, however, I must tend to my son.",
    "Listen to my son, Lady Vanescula. You are not like your brother, Lowerniel. There is light in you. Even I can sense that.",
    "No! There has been enough blood shed in these lands. These are NOT your lands.",
    "I make no claim over them, but they can be shared.",
    "You can only rise against your enemies, Vanescula. It's not going to be easy, but you don't strike me as the type to give in so readily.",
    "What say you, king's advisor? If you still wish for war, then you'll have to go through me. By all means, strike me down; make an enemy of the icyene too. I'm sure Saradomin would understand.",
    "Good man. Now, Lady Vanescula, we have much to discuss...",
    "Things have been such a whirlwind since my escape that I have not had chance to thank you. You defeated Drakan and gave me back my freedom, you returned my son to me and you've been pivotal in bringing about this alliance. I am forever in your debt. Though I shall be needed here to advise Safalaan and help to rebuild this place, should you ever need my assistance you need only ask.",
    "No, still not queen. I dare not assume that mantle again. This is not the kingdom I used to rule. It is something new.",
    "Please, don't be too harsh on him. Icyene emotions often run hot. If he'd had a parent there to teach him these things when he was young, he might have had more control over himself. That is my fault.",
    "It will take much for the humans of this region to stop hating the vyres. Trust is further off still. My hope is to rebuild my old castle. If the citizens see that the queen of old has returned, it will help.",
    "She's a sharp one, isn't she? She's certainly a breath of fresh air, compared to her brother.",
    "You are not your brother. It's true I'd rather you hadn't turned my son into a vyre, but he's explained that the decision was his."
  ],
  "Sarius Guile": [
    "Oh, Player, I'm so pleased to see you still alive. I haven't heard from any of the Myreque since I led Vanescula to the base, and she isn't telling me what happened.",
    "I...I'm sorry. I should never have led Vanescula to the Myreque base. It's all my fault.",
    "I don't think it's that simple. She's always treated me well and with respect. Always. I KNOW her. Ever since she got back, she's been spending a lot of time in Castle Drakan's basement levels. She NEVER goes down there. Something's going on and I'm clueless. She's confided much in me over the years, but not since her return. She'd be too proud to say anything, but if I had to guess, I think she's feeling remorse for whatever happened to Safalaan. What DID happen to him?",
    "Oh no! That must be why she's spending so much time in the castle basement. If you're trying to get into Castle Drakan, why have you come here?",
    "My father was separated from us for so long. We were only permitted to communicate via letter. Over time, Mauritys and I developed a way of coding information into his messages. It's how I knew to direct you to his letter about this laboratory in the first place.",
    "Ha! That sounds like my father, to leave something obvious to find, but to hide the true secrets. In one of his last messages to me, it was clear he feared for his life, and he knew this place was no longer safe. I doubt he'd have left anything truly valuable here, but I do know he was able to return to these tunnels even after they were abandoned. You should search throughout the tunnels here for any letters or books. If you find something written by my father, please could you bring it to show me?",
    "I suspect he might have hidden more crucial information deeper in the complex. You should search through the tunnels here. Keep an eye out for a clue or something out of place.",
    "You found something? What does it say?",
    "So he did survive? In his final letter to me he noted his fear that his work would be destroyed. If he didn't contact me again, he must have a good reason.",
    "Revert it? You mean all those turned humans could be brought back? Most of the vampyres in Morytania are vampyrised humans - this could change everything!",
    "I don't know about refined daeyalt, but the mines in northern Meiyerditch might be a good place to explore.",
    "Say, a vampyre that was once half-human, half-icyene?",
    "Vanescula must have been keeping him in the basement of Castle Drakan. That's all I know, and I'm sorry, but I can't get you into the castle.",
    "The mine entrance isn't far from here. If you leave the lab by the stairs here then exit the house, it's just a bit further north, past the old Skill in a Chest Inn."
  ],
  "Vyrewatch": [
    "This is the daeyalt mine, in case you're wondering. You're free to enter and mine should you wish.",
    "Get lost, blood sack. This mine's closed to the likes of you.",
    "Try it and see what happens.",
    "Where do you think you're going, blood sack?",
    "That doesn't give you free rein to go where you please!",
    "No, no! Really, there's no need to bother her with this. Please? By all means, go in. You'll have to mine like everyone else, though, as if you had been sent."
  ],
  "Juvinate guard": [
    "Tell you what - once you've filled one of these mine carts, I'll let you visit as a nice little reward...",
    "Tell you what - once you've filled one of these mine carts, I'll let you visit as a nice little reward...",
    "Oh, how eager of you. Let me set up the cart and then you can enjoy your trip. Hahaha!",
    "Hang on, I think one of the miners has nearly filled a cart. Do me a favor and transport it along the tracks, since you're heading there already.",
    "There's a full cart ready for transport - just push it along the tracks."
  ],
  "Florin": [
    "Thank you, adventurer! Please, free us from our cells.",
    "Thanks. Go rescue the others.",
    "Through here, adventurer! We'll help you put a stop to this.",
    "Thanks for the pep talk. I'm looking forward to going home to Burgh de Rott."
  ],
  "Razvan": [
    "I'm sorry we couldn't help you defeat the juvinates.",
    "I regret putting my hand in that machine."
  ],
  "Emilia": [
    "I could kill these vyre monsters!",
    "I'm going home and I'm taking my big ball of murderous rage with me."
  ],
  "Sorin": [
    "The juvinates aren't going to come back, are they?",
    "I got bitten by a machine! That was awesome! Can I go home now?"
  ],
  "Ileana": [
    "It took you long enough.",
    "I don't approve of how you fed us to these machines. You're a monster."
  ],
  "Emilia/Sorin/Ileana/Razvan/Florin": [
    "I am hopeful. (If option 1 is picked)",
    "I feel remorse. (If option 2 is picked)",
    "I feel disapproval. (If option 3 is picked)",
    "I am in awe. (If option 4 is picked)",
    "I feel angry. (If option 5 is picked)",
    "I feel submissive. (If option 6 is picked)",
    "You're right. I feel a lot more optimistic. (If changing from another option)",
    "I know. We're going to be fine. I have hope. (If already at this option)",
    "I'm sorry. I feel guilty that the vampyres caught me so easily. My family must be worried sick. (If changing from another option)",
    "I'm already filled with remorse and regret. (If already at this option)",
    "I agree. What they're doing here is horrific...they're turning people into monsters! (If changing from another option)",
    "I couldn't agree more. I have a bad case of the disapprovals. (If already at this option)",
    "It's beautiful, in a macabre sort of way. I wonder why daeyalt is able to turn humans into juvenile vampyres. (If changing from another option)",
    "I know, right? I'm in awe! So this is what they've been doing with daeyalt ore all this time. (If already at this option)",
    "Don't make me angry. You wouldn't like me when I'm angry. (If changing from another option)",
    "I hate these vampyres so much. It was bad enough when they tithed our blood. Now they're abducting us and converting us into their own kind. (If already at this option)",
    "There's no need to resort to threats. I submit to your will. Just tell me what to do. (If changing from another option)",
    "You don't have to tell me twice. I yield to your authority. (If already at this option)",
    "I am hopeful. (If option 1 is picked)",
    "I feel remorse. (If option 2 is picked)",
    "I feel disapproval. (If option 3 is picked)",
    "I am in awe. (If option 4 is picked)",
    "I feel angry. (If option 5 is picked)",
    "I feel submissive. (If option 6 is picked)"
  ],
  "Blood potency": [
    "(number)/6",
    "6/6"
  ],
  "Safalaan": [
    "Stop following me or I'll do more than poison you.",
    "I'm a monster. Leave me alone.",
    "I'm not Safalaan any more - he died here, on this very spot.",
    "The bloodlust is too strong. I'm trying, but it's taking all I have not to eat you right now.",
    "No! It's mine. You can die up here alone.",
    "You!",
    "I hate you, creature of light. The sight of you sickens me.",
    "I'll kill you!",
    "I hate you! I'll kill you!",
    "My...mother? I don't remember you. Why can't I remember?",
    "I...will try, but whatever you intend, you had best hurry. I'm not sure how long I can control myself.",
    "Take it. If you think it will help, take it.",
    "What do you want from me? Blood? Because you already took that!",
    "My head. It feels clearer. The bloodlust no longer clouds my mind.",
    "Please, hurry. End this madness. Don't let this turn to war.",
    "Go. Take the cure to Ivan. I'm already starting to feel like my old self. We shall join you when we can.",
    "Vanescula won't like this, but I believe I can make her see the sense of it.",
    "Vanescula.",
    "This isn't about you, Vanescula. I won't kill my friends. I know I agreed to help your people, but Player has shown me that there is another way.",
    "I understand what you're going through. Better than I did before. Better than I did when we talked in the castle.",
    "When I was human - when I thought I was human - I believed that vampyres were beasts led by their bellies.",
    "And it's true, the hunger is terrifying. All-encompassing.",
    "But that isn't what drives you, is it? The euphoria I felt wasn't the blood in my throat.",
    "I saw something very different: a mountain of lives - mortals - and me at the top of it. Nobody above me, everyone else below.",
    "The thrill came from being at that summit. Of knowing that all life fed me.",
    "It became an intense joy. I felt safe, like I was unbeatable. I felt like I was the culmination of everything.",
    "But then I heard the cries of those below me. I saw the fear in their eyes when they looked up. They were terrified of me.",
    "You know that intense joy and loneliness, don't you? That's why you were set on an alliance with Misthalin.",
    "But it won't work, Vanescula. You may sign treaties and alliances, but nothing will have changed.",
    "You will still be alone on that mountain, and they will look at you with as much fear as before.",
    "Stop this. Step away from it all. Look to your own people, and stop asserting yourself on the world.",
    "And the responsibility for your people doesn't have to sit with just you, Vanescula. You have me.",
    "And build it as equals, not with fear underlying it all.",
    "I've made a lot of bad decisions, I can see that now. I've been selfish and reckless. I wanted to try to help everyone, but in doing so I've lost many friends.",
    "Thank you, I appreciate that. It gives me hope that others will too.",
    "That is a shame, but I understand. I have a lot to make up for. I'll never stop trying to do so.",
    "It is true that I am uniquely positioned to empathise with human, vampyre and icyene alike. In time, I hope both populations will grow to trust me. The blood stores that Vanescula retrieved from Vampyrium are already half depleted.",
    "Thankfully, many of the younger convertees are willingly taking the cure, so the stores should suffice to keep the trueborns fed.",
    "Still, it has meant we've been able to completely stop blood tithings in the short term. Our hope is that down the road we can set up voluntary tithing stations.",
    "Vanescula, please! You shouldn't even joke about that sort of thing.",
    "It doesn't hurt that they're more than a little afraid of me, and that I'm in support of Vanescula.",
    "That bad, huh?"
  ],
  "[Skeleton Hellhound]": [
    "Hey, what's that mist coming in through the door?",
    "WE'VE A VAMPYRE IN THE ROOM!",
    "It's Vanstrom! We're dead!",
    "Ha, ha, ha... you took me straight to them!",
    "The little dears are going to wonder which side you're on!",
    "And now I'm going to finish the rest of them off.",
    "Ha ha ha ha haaaaaa!",
    "That murderer Vanstrom has killed Sani and Harold!",
    "He came in and killed them right in front of our eyes.",
    "It was so horrible seeing Sani and Harold killed!"
  ],
  "Andiess Juip": [
    "Hey, Kael. Good to see you again.",
    "...and be far out of the way when it ignites, friend."
  ],
  "Flaygian Screwte": [
    "Why aren't you using my superior flail design any more? I don't know...these youngsters and their blisterwood."
  ],
  "Harold Evans": [
    "Don't pour holy water on meeeee! I'm not a bloodveld, wheeeee!"
  ],
  "Kael Forshaw": [
    "I'm not afraid any more.",
    "No, no, no. Well met, friend. You should roll that barrel onto something flammable."
  ],
  "Mekritus A'hara": [
    "Blimey, me 'ead 'urts."
  ],
  "Polmafi Ferdygris": [
    "I'm the new 'Lord of Vampyrium'! We're going on a wild hunt next week!"
  ],
  "Radigad Ponfit": [
    "Player. Player. Player."
  ],
  "Sani Piliu": [
    "I didn't think I'd survive this long. I thought I'd be the first to die."
  ],
  "Vertida Sefalatis": [
    "Have you found my holy water yet? It'll make short work of Vanstrom's pet bloodveld."
  ],
  "Lowerniel Drakan": [
    "I have one final question for you, [Vampyre name] - tell me... Do you take me for a fool?",
    "To think that I would not smell the defiance in your blood? That I would not sense the creaking of blisterwood around me? How transparent my sister is to me? HUMAN! Choose your next action wisely...",
    "Do I seem a moody vyreling to you, sulking in my room? No, that 'rock' showed me the way - its loss merely delayed my plans."
  ],
  "[Safalaan]": [
    "RARGH!",
    "I can't control this! You need to die!"
  ],
  "[Efaritay]": [
    "Stop, you can beat this!"
  ],
  "[Vanstom Klause]": [
    "Let the blood consume you."
  ],
  "[Player]": [
    "I need to snap out of it.",
    "What?!",
    "I feel...dizzy...",
    "What did you do to me?",
    "I need to snap out of it."
  ],
  "Werewolf": [
    "...",
    "Not today, vyre.",
    "I'm afraid we differ there, m'lady. We smell the fall of House Drakan on the wind, and our freedom with it."
  ],
  "Vanescula": [
    "Yes, well, like they say, an army marches on its stomach.",
    "Getting THEM to take the cure is a bigger ask. The very idea that vampyrism is a disease is offensive to us.",
    "Rewarding any citizens that choose to donate, as opposed to punishing slaves that resist.",
    "Oh, it's a shambles. I'm going to have to assassinate Efaritay, of course.",
    "Oh, fine, it's going about as well as you'd expect.",
    "I have always appreciated Safalaan's willingness to empathise with my kind, in spite of the troubles here. Yet I would have expected Efaritay to despise me. Instead, we've found a common bond in our loathing of Lord Drakan.",
    "So long as I keep the trueborns happy, the rest of them will keep in line. The younger vyres are actually proving eager to take the serum.",
    "It may not be how I envisaged things, but upon reflection things could never return to how they were in ages past. I relish the challenge. But at the first sign of anyone trying to take advantage of this new alliance to wipe out my kind, this will all fall apart.",
    "These are the elite of the vampyre nation - they are true-born lords and ladies. Our new alliance is a difficult concept for them to grasp. To them, this is still very much their home, and you are still an interloper. Many of them are still refusing to take the serum, but that will change in time, even if I have to force the issue.",
    "This is a delicate time for my kind. Change will come slower to us that it will to the humans of Meiyerditch. Until that day, I won't begrudge you killing a few of them. I still have rivals, you know - best to keep them in their place if you want this alliance to work.",
    "I have about as much control over them as I do over you.",
    "Sure, if that's how you choose to interpret my statement.",
    "Was there anything else?",
    "I wish he'd listen to ME more and just eat the lot of you.",
    "Aww, dear, sweet Veliaf. Are you sure you're not just developing a crush on me?"
  ],
  "Veliaf Hurtz": [
    "...",
    "He's still having his ear bent by that harpy? After what she did to him? To us? I think maybe I should do something about this!",
    "What? No, of course not. He just could do with an old friend talking in his other ear is all. Maybe I can make him see sense. Besides, he could do with a proper human advisor, especially from what I've heard about this Aeonisig fool.",
    "Besides, our work here is done. For now, farewell, old friend.",
    "Well met, Player.",
    "I thought I'd lost my friend here - first to death, then to vampyrism - but no, that's Safalaan right there, just as he's always been.",
    "Ha! Actually, this one's got a LOT better at making decisions! Maybe because he's more willing to listen to me these days. Efaritay is a good influence on him too.",
    "I'm even starting to get used to THAT one. Plus someone has to keep an eye on her.",
    "It's tough going, but they trust me. They know I was with the Myreque. We have a number of projects in the works to renovate the slums, though it will be years before we see any real progress. In the meantime we're working to reunite families, treat the sick and wounded, and ensure everyone has enough food and water."
  ],
  "Sentinel Plaguemanst": [
    "The nobles are all still talking about how Vanescula was defeated at the Salve...though, er, not out loud. So don't tell her I said anything...",
    "I don't know, maybe because I enjoy being alive. Vanescula REALLY doesn't like to lose. To suggest as much in the open is a good way to wind up a corpse.",
    "That's what I've heard, anyway. Best not to tempt fate, though, so really, don't tell her I said anything."
  ],
  "Refugee": [
    "Hey it's the hero! Wow, you're amazing! How did you manage to return all the villagers? Things feel so much safer around here now too - great job!",
    "Oh, not much really, we're all just trying to eke out a living in this place. Some of us still want to head for the Salve and into Misthalin, but honestly, it's not so bad here anymore...in spite of how it might look."
  ],
  "A Meiyerditch child": [
    "Hello."
  ],
  "Meiyerditch citizen": [
    "Better than they were, that's for sure. The vyrewatch have all cleared out and we're not tithed anymore. It's still a slum, though. Life is still pretty hard here. At least, whoever's in charge now is trying to improve things, though. Food and water are still pretty scarce, but it feels like it's getting better on that front too. And then there's the people being returned. Family members long thought to be lost are coming home.",
    "Not much, really. Apparently, one of the Drakans is still in charge, but with all these improvements around here, I find that hard to believe. There's a rumour going around that the fabled Queen Efaritay has returned to kick the vampyres out. And yet others that the Myreque won and now they're in charge.",
    "Good to know, thanks."
  ],
  "Meiyerditch miner": [
    "Oh, hello.",
    "We're miners. We used to be forced to mine here for the vyres, but now we choose to. Turns out this stuff we're mining makes them less hungry. Who knew, right? So, anyway, we need a lot of this stuff.",
    "Here, I'll show you the way out...",
    "We're mining for daeyalt. The new leaders are saying it even turns vyres who used to be human back to normal. And for those that've always been vyres, it apparently makes them less hungry, so they don't need to feed on us anymore, or less often, or something. So we're gladly mining cart-loads of this stuff now. It all helps, right?"
  ],
  "Captured Meiyerditch citizen": [
    "I'm glad I killed that vyre scum. I don't care if it was trying to help, it deserved to die!"
  ],
  "Cat": [
    "*Sniff, sniff* I don't think it's me... Oh now, wait, it is. Sorry.",
    "As long as I can remember. It used to be REALLY bad, but now it's just plain bad."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:River_of_Blood?oldid=36069032’"
  ]
}