{
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "Dialogue with people about Ali's nephew, dialogue with Rashid the Operator, misc dialogue, Ali renames within dialogueYou can discuss this issue on the talk page or edit this page to improve it."
  ],
  "Ali Morrisane": [
    "Good day and welcome back to Al Kharid.",
    "My name is Ali Morrisane – the greatest salesman in the world.",
    "Well one can only do and sell so much. If I had more staff I'd be able to sell more, rather than waste my time on menial things I could get on with selling sand to the Bedabin and useless tourist trinkets to everyone.",
    "Yes I know, I know – the life of a shop keeper isn't slaying dragons and wooing damsels but it has its charms. Although you can help me in another way, a nephew of mine lives not too far from here in a little town called Pollnivneach. If you could fetch him here I'll give you the first month of his salary!",
    "Ah, many thanks, my friend. My nephew's name is 'Ali' and he lives to the south in a town called 'Pollnivneach'. Tell him uncle Ali M needs his help up in Al Kharid. Now have a look at my wares.",
    "Hello again my friend. I see you have not found my troublesome nephew. Have you any news of his whereabouts?",
    "Well then tell me what has become of him. Nothing bad I hope.",
    "You make an old man very happy. I'm so proud of young Baba.",
    "Yes, but by people with too much money and not enough sense. All willingly parted with their money and received what they purchased. Well I still am in need of an assistant... but take the reward anyway.",
    "I have my reasons.",
    "My my, you surprise me, you're not as dumb as you look.",
    "Ah, once again you underestimate me. I sold you far more than that.",
    "I like the word 'tourism'. Did you not enjoy your stay in Pollnivneach? Was there not action, intrigue and fun to be had, and did you not notice all the other tourists there too?",
    "Now that we both agree on that, may I show you my wares?"
  ],
  "Player": [
    "Hello to you too.",
    "If you are, then why are you still selling goods from a stall?",
    "I'm far too busy – adventuring is a full time job you know.",
    "I'd like to help you but......",
    "I'm far too busy to carry out errands for shopkeepers – maybe later.",
    "I'll find you your help. But you had better become the biggest merchant in RuneScape once I succeed!",
    "No, I'm really too busy.",
    "Okay.",
    "So, what are you selling?",
    "How do you know that?",
    "You do? How do you know I'm looking for Ali Morrisane's nephew, Ali?",
    "Ali Morrisane's nephew.",
    "That's all fine and well, but do you know any more useful information about him, such as his whereabouts?",
    "I'm sorry if I was a little sharp with you, but do you know where he is?",
    "Well it would have to be, who else could I possibly be other than myself?",
    "Um, what? Look, all I want to know is the whereabouts of Ali Morrisane's nephew.",
    "No no no stop. You are not going to fool me into buying you another beer without first giving me some useful information.",
    "Well if you can't continue, I will just have to wring you like a wet cloth and squeeze out enough booze to fill another tankard. I'd reckon it would hurt though.",
    "For the last time, where is Ali Morrisane's nephew?",
    "What do you think?",
    "Hello.",
    "I am trying to figure out the feud that exists between you and the Bandits.",
    "In what way?",
    "Word has it that the Menaphites are also involved in unsavoury behaviour.",
    "How did 'they' start it?",
    "Go on try.",
    "So if they offered a camel as a gesture of goodwill would the Menaphites cease hostilities?",
    "But if they did?",
    "Hello.",
    "I am trying to figure out the feud that exists between you and the Menaphites.",
    "Nothing much I'm just trying to understand why thieves of your repute would stoop to the level of the Menaphites.",
    "So if they offered a camel as a gesture of goodwill would you and the rest of the bandits cease your hostilities?",
    "But if they did?",
    "Maybe if I got both gangs a camel, I could use the mutual goodwill to find out what happened to Ali's nephew.",
    "A discount camel store?",
    "Tell me about this town.",
    "Lovely day isn't it?",
    "Are those camels around the side for sale?",
    "Camels, beautiful? I worry about you.",
    "Can you tell me a little about them?",
    "What price do you want for both of them?",
    "So can I have them for free then?",
    "Would 200 gold coins for the pair of them do?",
    "Would 500 gold coins for the pair of them do?",
    "Would 1000 gold coins for the pair of them do?",
    "Well yes actually I'd like to ask you about something else.",
    "No, but thanks for your time.",
    "I'm looking for Ali from Pollnivneach.",
    "Good news, the bandits have agreed to give you a camel in order to restore peace.",
    "Ahhh why do I bother!",
    "Good news, the Menaphites have agreed to give you a camel in order to restore peace.",
    "Ahhh why do I bother! This approach doesn't seem to be working, perhaps I should be more direct and try join one of the gangs.",
    "Yeah, those pesky bandits!",
    "Yes, of course, those bandits should be taught a lesson.",
    "So when do we start?",
    "How will I manage that?",
    "What exactly does that mean?",
    "Oh right, thanks.",
    "Yes I'd like to ask you about something else.",
    "No thanks.",
    "Perhaps later, I'm quite busy at the moment.",
    "Psst. Come here, I want to show you something.",
    "It's a surprise! Follow me.",
    "Hey kid, come here!",
    "I need a little help, do you want to make some easy money?",
    "Do you see that villager over there? Well if you could distract him for a bit I'll give you 10 gold coins.",
    "Ya it's simple but just do it and do it right.",
    "Hey there!",
    "Ya you were good alright.",
    "What money?",
    "Here you go, thanks.",
    "Yes tell me about...",
    "No thanks.",
    "Hey there!",
    "Ok, let's do it again.",
    "Yeah, I could do with a bit of advice.",
    "No they seem to have figured that one out already.",
    "Nah, no problems here. I want to ask you about something else.",
    "First trial?",
    "Ah, of course not.",
    "Got any advice?",
    "Anything else?",
    "I completed your task.",
    "Of course not, although the mayor did leave a number of hints lying around.",
    "Oh really?",
    "Why me?",
    "You can count on me to find out.",
    "I was wondering if you could help me?",
    "I'm investigating the possibility of a betrayal in the Menaphites, do you know anything about this?",
    "Really? So do you know anything about this?",
    "Who is he then?",
    "I suppose the name is a bit of a give-away then. That was a little too simple, are you sure it was him?",
    "I see he drives a hard bargain.",
    "I have discovered the identity of the traitor, strangely enough it was traitorous Hesham!",
    "Actually he sold you out for...",
    "Yes I'd like to ask you about something else.",
    "No thanks.",
    "Good day, old hag.",
    "Let me guess it wouldn't be Ali would it?",
    "Actually I just want your help to, erm, remove someone. It's simple enough!",
    "Well, yes, I would like it carried out in a manner which would draw no suspicion to me.",
    "'Traitorous Hesham' please.",
    "So what payment do you require?",
    "So what do you need?",
    "Where would I get some snake poison?",
    "What I meant was how do I extract the poison from the snake?",
    "Wow a snake charmer. Can I have a go? Can I have a go? Please?",
    "Wow a snake charmer. Can I have a go? Can I have a go? Please?",
    "Hello.",
    "I don't know, what can you do for me?",
    "Depends on what?",
    "Why is that?",
    "Well then, what kind of kebabs do you, erm, construct?",
    "Yes, thanks.",
    "I want a kebab, please.",
    "Could I have an extra-hot kebab please?",
    "Would you sell me that bottle of special kebab sauce?",
    "Set yourself at ease, I have no intention of setting up a rival kebab shop.",
    "I don't know, but I think I could have a bit of fun with it.",
    "No, that would be a bit cliché. I think I'll come up with something more original.",
    "Thank you very much.",
    "What is the difference between the standard and the extra-hot kebab?",
    "I need some information.",
    "Good day, Ali.",
    "Ok I have the snake, now what else do you need?",
    "Am, yes, well is there anything else I can get?",
    "What? That's disgusting.",
    "Ok ok, I'll get some.",
    "Oops I almost forgot.",
    "Good day, Ali.",
    "That's not even remotely funny.",
    "Just stop. Thanks for the potion and good day to you.",
    "Ok, and thanks again.",
    "Hello there.",
    "What's going on in town?",
    "I'm looking for Traitorous Hesham.",
    "No thanks I'm ok. Thanks for your time.",
    "Yes, I'd like to talk about something else.",
    "I'm looking for Ali from Pollnivneach.",
    "The 'Asp and Snake'? What a strange name for a bar.",
    "Almost, his drink is poisoned, as soon as he gets back, he'll be done for.",
    "Rashid the operator told me that you wanted to see me.",
    "So what plans for the bandits?",
    "So if you're not warring with the bandits what then are you planning for?",
    "What?",
    "Actually I thought you were a ragtag band of good for nothing thieves sucking the life out of this backwater excuse for a town.",
    "That's it, I've had it! I'm just going to have to rid the world of you and your mob – I have this irrational hatred for megalomaniacal, despotic, religious zealots! Prepare to meet Icthy-aly-rin or whoever!",
    "No doubt I haven't seen the last of you... but what about Ali's nephew?",
    "Hello.",
    "What?! I just single-handedly took apart one of the gangs which was subjugating your village.",
    "Umm oops, sorry I was just trying to help. So are things really that much worse?",
    "You know, this adventuring lark is a lot more complicated than I thought!",
    "What do you mean by fix the mess I created?",
    "Ok I'll get to it.",
    "Don't jump to conclusions, I didn't do it for you.",
    "That's what I'm here to talk to you about.",
    "No, I'm here to give you an ultimatum: either leave the town of your own free will or I will make you.",
    "Start packing your bags!",
    "I have defeated your champion, now get out of town.",
    "Don't try my patience, pack your things and get out of town.",
    "Sure they will. I think I'll go talk to a villager now, just to prove you wrong. Now get out of town before I really get angry with you.",
    "Now are you satisfied?",
    "I have delivered you from two evil tyrants, let's see some gratitude.",
    "I wonder why I bother sometimes! Ungrateful layabouts! This place has been nothing but trouble and I still haven't found Ali's nephew.",
    "I think I may be able to put one more thing to right. I heard that your house was burgled recently. I think you should ask Ali 'The operator' about that, it may prove beneficial.",
    "Let's just put it down to adventurer's intuition.",
    "Indeed I do. I was able to eventually learn of his whereabouts, although it was a little bit more challenging than I originally thought.",
    "I was able to discover that he is quite the salesman. Perhaps too good. He has roughly forty people working under him. Unfortunately a number of people didn't approve of his sales techniques and as a result he is in hiding.",
    "But he's thought a thief.",
    "I've just been thinking, Ali, there seem to be a few parallels between yourself and your nephew. Both of you are unscrupulous salesmen, both come from the same town and both of you no longer trade there. Were you sent into exile too?",
    "No, now hang on, this seems to me like one of the strangest quests I have ever been involved with. I do not believe that a businessman like you would not know of a competitor, particularly a competitor as talented as your nephew. So what was your motive to get me to visit Pollnivneach? Was it concern for the towns people? Hmm. I don't think so, I'd say you would probably sell your grandmother if you could get a good price for her. What was the reason?",
    "No, this couldn't have just been a sales pitch to get me to buy a fake beard and headpiece, was it?",
    "Really? Well I did buy some other odds and ends off you... no hang on! I get it now, you're in league with Ali the Camel seller, the Kebab seller, and the mayor aren't you.",
    "I must apologise for ever doubting you and your claims to be the best salesman in all of RuneScape.",
    "No, I'm really too busy."
  ],
  "Jalal the Drunk": [
    "Ahh, a kind stranger. Get this old man a drink, so that he may wet his throat and tell you of strange happenings in this town.",
    "I happen to know that you are looking for somebody.",
    "Well, you're not here sightseeing, that's for certain. Anyway it's not really important how I know what I know. What is important is that I know all about the person you're looking for.",
    "I'd tell you more, but my throat is drying up and my lips are dry. This desert climate is an inhospitable one. Get me another beer so that I can continue.",
    "You are too kind, now what were we talking about?",
    "I've known him since he was a wee lad. A right little mischievous beggar......",
    "Well now, if you had just asked me about that in the first place I would have told you directly.",
    "I'd tell you more, but my throat is drying up and my lips are dry. This desert climate is an inhospitable one. Get me another beer so that I can continue.",
    "It's yourself again, isn't it? Get this old man another drink so that he may wet his lips and continue.",
    "It's yourself again, isn't it?",
    "That's kind of getting a little deep for me, existential reasoning or justification was never my strong suit. So what can I do for you?",
    "Now is that his nephew from his side or his wife's? They have a huge family you see. I remember........",
    "But my lips are dry, how can I possibly continue?",
    "I see. Don't worry about me, I'll just have to soldier on. Now what do you want to know?",
    "I don't know exactly, he disappeared last week, either those Bandits or Menaphites have something to do with it. Perhaps their feuding has something to do with it, perhaps if you were to solve that problem... Anyway is there any chance of another beer?"
  ],
  "Menaphite Thug": [
    "What do you want?",
    "Not much to figure out there, the problem is those thieving bandits.",
    "They are always stealing, starting fights and causing disruption to the life of the people in this town.",
    "Admittedly, we are far better than them at that sort of thing, but they did start the cycle.",
    "I cannot remember, as it's been going on for so long.",
    "I think our leader once mentioned that they robbed one of our camels. A heinous crime around here, worthy of a stoning.",
    "Those bandits would never agree to that. They're such bad thieves they couldn't afford to buy even the mangiest excuse of a camel, never mind the desert traversing four legged beauty that we would demand.",
    "Well I suppose so.",
    "Really? I knew they were cowards. Tell them that we have changed our minds and demand 10 camels in return for our mercy.",
    "Tell me what your problem is and I'll know if I can.",
    "It wasn't me, I honestly swear.",
    "Well there is Traitorous Hesham.",
    "Possibly the most untrustworthy backstabbing fiend to ever walk Tumeken's fair desert. He'd sell his mother to slavers if he hadn't already betrayed her and had her locked up for the last job he pulled.",
    "Positive, he was turned by the offer of a set of waterproofs and a ride on a camel.",
    "Well what can I say, he doesn't have that name for being loyal!"
  ],
  "Bandit": [
    "What do you want?",
    "What's it to you?",
    "Well if memory serves me correctly, I think my granddad mentioned that they robbed one of our camels. A heinous crime.",
    "Those Menaphites would never do that. They have no sense of honour.",
    "Well I suppose so.",
    "Really? I knew they were cowards. Tell them that we have changed our minds and demand 10 camels in return for our mercy."
  ],
  "Sami the Camel Man": [
    "Welcome to my discount camel store. Can I help you with anything?",
    "Those two camels around the side are already sold. But you are in luck – I have another two beautiful camels arriving in soon from the best stable in all of Al Kharid.",
    "One cannot put a price on life, they are precious beyond the worth of the crass value of gold coins!",
    "You are too generous, I would have sold for half of that!",
    "Here are the receipts for the camels so that you can pick them up as soon as I get them in. Is there anything else I can help you with?"
  ],
  "Rashid the Operator": [
    "You seem to be a [man/woman] of action. We could do with more people like you to sort those despicable bandits out.",
    "So will you join us in our fight to wipe them out?",
    "Good choice my friend, together we will crush them.",
    "Slow down, slow down. First you must prove yourself capable and trustworthy.",
    "Don't worry about that, I'll just set you a few jobs to do. As you might have gathered we have the reputation for being less than scrupulous, something with good foundation. So I want you to foster this reputation and grow it.",
    "It means that I want you to go out into the town and pickpocket 3 villagers and then report back to me. IF you have any problems don't be afraid to ask for some advice.",
    "Can I help you with anything else?",
    "Having problems?",
    "The distraction tactic isn't working any more?",
    "It is a small town, news spreads fast. Perhaps using a spot of cunning and a bit of brute force might work better.",
    "Well done! You have finished your first trial.",
    "You hardly think that a couple of pick-pocketings would do, did you?",
    "Good, now the next thing you have to do is a spot of burglary. The only place worth pilfering is the mayor's villa. I want you to retrieve the mayor's wife's jewels.",
    "Well I think that a disguise would be a good start. After that I would definitely stake out the place to make sure the mayor is not in. You'll need a key to the front door too.",
    "No! Now get going.",
    "Impressive, I didn't expect you to succeed so soon with cracking that safe. Did you have help?",
    "That mayor is a fool. Now give me the jewels.",
    "now your final task is one of the upmost importance. It has come to my attention that there is a traitor in our midst.",
    "Yes and I want you to root them out.",
    "Because I feel like I can trust you. You don't have all the baggage that comes with being a villain your entire life.",
    "Well then get to it.",
    "No! I would never have suspected that 'Traitorous Hesham' would betray us. Actually... what am I saying! Of course it would have been him. He betrayed his family for a sandpit and an umbrella! I'm sure he sold us out for much more.",
    "Stop, I don't want to know. It hurts too much already. Find him and then kill him, but do it quietly, I don't want a fuss. Can I help you with anything else?",
    "Is the deed done?",
    "You have proven yourself to be worthy of the bosses presence. He wants to see you know to discuss the future direction of the gang."
  ],
  "Villager": [
    "What is it?",
    "What me?",
    "Good job, you just made everything worse for us poor villagers!",
    "You adventurers! You never think, you just act. You think that by killing a powerful bad person, RuneScape will become a better place. It's not that simple, things never are. A vacuum is created – power is available to the person best situated to take it. Who do you think is in the best position to take power, our good mayor or the leader of the bandits?",
    "Yes. Before your intervention the two gangs pretty much cancelled each other out. They spend most of their energy trying to kill each other. Now that the balance is lost, the Bandits reign unopposed! They no longer have to deal with the Menaphites and inflict nothing but more misery on us. You must finish the job that you have started.",
    "If you're prepared to change something you must also be prepared to deal with the consequences! Now hurry up and fix this mess you created!",
    "Oh it's you again!",
    "Gratitude? For what? You come into our town and rob, mug, burgle and kill and then expect respect and our gratitude? Look if it's praise and thanks you're looking for, talk to the mayor."
  ],
  "Street urchin": [
    "What do you want?",
    "That depends.",
    "Is that it?",
    "Ya, I see them. Give me a sec.",
    "Hey you, camel features! Come here.",
    "Did you see the way I distracted that guy? Man I'm one smooth operator.",
    "So where's my money?",
    "Thanks [sir/ma'am], I didn't think you would hold up your side of the deal. There's not much honour among thieves, you know. Well do you need any other information then?",
    "Hi! Do you want to go rob some more people? I could do with some more money."
  ],
  "On the wall hangs a rather nondescript picture. On closer inspection you notice that it's covering something": [
    "a safe."
  ],
  "Maysa the Hag": [
    "Old hag indeed! I have a name you know!",
    "Well how else would you abbreviate Alice then? And no, you can't call me Al! Now what do you want from me then? A hex? A spot potion? Power, beauty, eternal youth or something else drab like that?",
    "Ahh, I see. But that is rarely a simple matter. Extinguishing the flame of life is simple, but people rarely wish to face the consequences, and I doubt you are any different.",
    "well now this is getting interesting. I'd recommend a poisoning. Who do you wish dead? I need to know so that I can tailor a poison to their specific needs!",
    "Please? Never have I heard a more inappropriate use of that foul word. Traitorous Hesham you say... I believe he should be easily gotten rid of.",
    "None, I will extract much pleasure from his passing, just bring me the ingredients I require.",
    "Ah, impatience! Traitorous Hesham's time is indeed nigh. Firstly bring me some snake venom, which will act as the main toxin.",
    "From a snake perhaps?",
    "Sheesh! You'd never make a chemist, never mind an alchemist. Just bring me a snake, with teeth in its head and don't even think of giving me that snake charmer's pet worm, it's about as dangerous as a rubber knife.",
    "Good day to you too adventurer.",
    "Ah yes that snake will do just fine, a nice agonising death for Ali of course. I'd never kill a fellow vindictive, nasty soul such as Snuggles the snake here!",
    "Ah yes, now that I have the toxin I need something to hide its trace, fresh camel dung should do the job.",
    "Do you want the poison or not?",
    "And don't forget it has to be fresh. Now are you going to give me the snake or not?",
    "Good day to you too adventurer. I have the poison already mixed, I just needed the ingredients to prepare another batch, you wouldn't believe the demand, its been murder.",
    "Sorry, I've been dying to say that for ages.",
    "Now remember. This poison isn't designed to be used on a weapon. In fact it's not a contact poison at all. You'll have to do more than just smear it on a blade!"
  ],
  "Badir the Snake Charmer": [
    "If it means that you'll leave me alone, I would give you my snake charming super starter kit complete with flute and basket."
  ],
  "Isma'il the Kebab seller": [
    "Hello. What can I do for you?",
    "Well, that depends.",
    "It depends on whether you like kebabs or not.",
    "Seeing as I'm in the kebab construction industry, I mainly help people who have want of a kebab.",
    "I offer two different types of kebabs: the standard run-of-the-mill kebab seen throughout Runescape and enjoyed by many an intoxicated dwarf, and my specialty, the extra-hot kebab. So which shall it be? Or are my services even required?",
    "Well, that depends on what you have in mind.",
    "Well then, what do you want it for?",
    "You're not going to put it in Jalal the Drunk's drink now, are you? That's what happened the last time I gave someone the sauce.",
    "Just be careful with it, it's potent enough to give a camel the runs."
  ],
  "Faisal the Barman": [
    "Good day. Can I help you with anything?",
    "He is here, actually he was here! He's just nipped out to go to the toilet a few minutes ago. His drink is over there on the table by those barrels. The only problem is that no one has ever actually seen a toilet in RuneScape so he may take a little while. Is there anything else I can help you with?"
  ],
  "Menaphite Leader": [
    "That's right, I have been keeping track of your progress. It was impressive.",
    "The bandits? A mere nuisance, insignificant in my overall plans.",
    "World domination, first Pollnivneach, then Al Kharid then the whole of Runescape!",
    "You do understand who 'We' are?",
    "Silence! We are the chosen, exiled from Menaphos for trying to overthrow the Pharaoh. Loyal servants of Amascut the Devourer, God of Destruction. We are regrouping to launch another offensive against the thrall of Tumeken, using Pollnivneach as a spawning ground for revolution!",
    "Fool! You'll never get to me. Guards protect me. Guards!",
    "You haven't seen the last of me!"
  ],
  "Tough Guy": [
    "Grrr"
  ],
  "Bandit Leader": [
    "Come here my friend, so I may embrace you. You have done us a great urn by disposing of those Menaphites.",
    "Regardless, I am still very grateful. Now I have the town at my mercy.",
    "Do you want a reward? A fee? I will not begrudge you that.",
    "How the worm has turned. You who was robbing, looting and poisoning not too long ago are now taking the moral high ground! Or are you trying to keep the whole town for yourself? I will not be run out of my own town without a fight. If you defeat my best warrior I will leave town.",
    "Adventurer... I have underestimated you. Perhaps we can come to an agreement. How about if I work for you? Think of the riches you would make.",
    "The people's champion, you are so naïve. They won't even thank you for this you know."
  ],
  "Bandit champion": [
    "Grrr"
  ],
  "Hakeem the Mayor": [
    "My thanks, your methods and motives may be questionable but nonetheless thank you for delivering this town from those wicked individuals. I think now that our problems are at a manageable size, mistakes made in the past will not be repeated. The least that I can do for you is answer your questions about the whereabouts of Ali Morrisane's nephew. He was asked to leave the town as much for concerns for his health and, as sad as it is to admit, the anger of our towns people. He is a good lad but is too good a salesman for his health. He angered a number of people by coercing them into buying things they really didn't want. He acted completely within the letter of the law... but that could only protect him so long. Once he angered the Menaphites and the Bandits I could no longer protect him and he had to go. I can assure you that he is safe and well and now that the threats to his life no longer hold any water he plans to open some kind of superstore with forty of his disreputable friends. A 'treasure trove' he claims. I will believe it when I see it though. He will probably remain hidden for some time. I hope that helps you in your quest. Will you give my apologies to Ali Morrisane for treating his family so.",
    "How do you know this?"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:The_Feud?oldid=35355233’"
  ]
}