{
  "Trader Stan": [
    "Can I help you?",
    "Jed? He's crazy! That blasted pirate! It's bad enough he stole one of my ships after his old one was set ablaze! But now he's come back and stolen another one! And he's using it to attack the jail!",
    "He's one of them Skulls - they're notorious slave traders. My guess is he's under a tight quota, and the jail's inhabitants are just easy pickings!",
    "The jail guards are putting up a stoic defence, to be sure, but that blasted Jed is dragging my name through the mud by using my boat in the attack! Not only that, but... well... there was something on my boat when he took it. Something priceless to me. I need it back.",
    "Jed? That crazy, blasted pirate? He stole two of my ships! TWO! And the second one, he used to assault Port Sarim's jail.",
    "He's one of them Skulls - they're notorious slave traders. My guess is he was under a tight quota, and the jail's inhabitants were just easy pickings! And to add insult to injury...well...there was something on my boat when he took it. Something priceless to me. I need it back.",
    "Say, you're pretty renowned yourself around these parts, aren't you? I can trust you, right?",
    "Say, you're the new Portmaster around these parts, aren't you? I can trust you, right?",
    "I stopped sending my charter ships to the Wushanko Isles years back, when all the sea monsters started showing up. But if they've cleared up enough that scum like Jed can so brazenly waltz in and out of it, with my ships no less, then maybe it's time I took my business back that way.",
    "You're a capable, dependable sort, I can just tell these things. But even if you're not, I'm sure you're at least interested in making some money. I don't have the staff myself right now to spare on any voyages to Wushanko. How would you like to become my newest captain?",
    "Don't worry about a ship. I need a new one building anyway, to replace those I lost. I'm already getting offers of help from the locals. Hey, maybe you can help out too - there's nothing like being involved in building your own ship. I have plans for a neat little interceptor. Just the thing for an exploratory foray back east. If things pan out, you can let me know, and then I can start sending my big, expensive charter ships back there.",
    "That's all taken care of. The residents of Port Sarim, along with other charitable sorts, have constructed a new interceptor. I've named it Sarim's Revenge! Technically, it's donated to me personally, but it's a boat for all of Port Sarim. And I am entrusting it to you, at least for the time being...though there is something I - we of Port Sarim - would like you to do in exchange.",
    "But first, you're going to need a crew. You can't very well sail the boat by yourself. I mean, she's small and fast, but she's still not a one-person ship. What do you say? The worst for me is I lose a third boat, but I've got faith in you.",
    "As a minimum, a captain needs a dependable quartermaster to act as their second. You'll also need a strong navigator else you'll wind up getting lost at sea. And then a bosun, to keep everything ship-shape and Sarim fashion.",
    "Hmm, you're going to want only the best. For that, I'd suggest you talk to Surula in your personal port bar. She has all the gossip.",
    "Sure you do; everyone does. Just head into the portal in northern Port Sarim. The bar is to the north once you're in. Surula will be behind the bar.",
    "Oh, that one's easy - you want a siren, if you can find one. It's rare to find one outside the Eastern Lands, but I happen to know one called Umi.",
    "In fact, I've asked her to oversee construction of your boat. She'll be in your personal port right now, though.",
    "In fact, she oversaw construction of your boat. She'll be in your personal port right now, though.",
    "Before Jed's assault, my best guess would have been the prison. The guard captain there used to let prisoners work off some of their time aboard ship crews.",
    "Still, you should go and talk to him. He's standing by the Port Sarim lodestone, trying to rally people to defend the jail.",
    "Still, you should go and talk to him. He'll be just inside the old lighthouse jail. Tell him I sent you.",
    "Can I help you?",
    "How goes with Umi?",
    "Happy to hear it! She'll steer you right.",
    "Can I help you?",
    "Aye, so you are...captain! Welcome aboard.",
    "Or at least, you will be, once your boat has finished being built.",
    "Well, it's two things, really. The first being to bring Jed to justice. As good a defence as we're putting up, we're just not equipped to stop him from abducting all of the jail's inmates. Even your new boat can't face him on open water - you'll have to track him back to his lair in the Arc.",
    "Well, it's two things, really. The first being to track down Jed and bring him to justice. He sailed away with a bunch of convicts, and even a few prison guards.",
    "They might be criminals, but they're OUR criminals, and they don't deserve whatever fate Jed has in store for them. Besides, they have family and loved ones here, same as anyone. It won't be easy, mind. Jed's base in the Arc will be well-hidden and well-armed - your new boat will be fast, but she's not built for combat. And while the Arc is the most welcoming region of Wushanko to us westerners, it's still an alien culture. You're going to have to make some new friends out there to help you on this mission to find and defeat Jed.",
    "Er, yeah, that one is more personal. I'd like you to retrieve the prized item that was on my boat when Jed stole it, and return it to me no-questions-asked.",
    "I did just say no-questions-asked! Don't worry, it's nothing dangerous or illegal, it's just...personal. You'll know it when you see it.",
    "Very good!",
    "Can I help you?",
    "Go get him, captain!"
  ],
  "Player": [
    "What's he up to now?",
    "Yeah, I should probably help them out with that...",
    "Why would he do that?",
    "Yeah, sure, I guess so.",
    "Where do I come into this?",
    "Captain my own ship? I don't own a ship. I don't have any crew!",
    "I mean, sure, why not? So, what sort of crew do I need?",
    "Any suggestions for a qualified quartermaster?",
    "I'm not sure I have a personal port.",
    "What about a knowledgeable navigator?",
    "Where might I find a brilliant bosun?",
    "Maybe later.",
    "Trader Stan told me to say he sent me, said you might be able to help.",
    "Oh, no, he suggested you may be able to help me find a quartermaster for my new ship.",
    "Alright, if that is what it will take. How much does he owe?",
    "Oh, wait, sorry, I left my money in my other platelegs. I'll be back with it later.",
    "Surula sent me.",
    "I'm in need of a quartermaster for my new ship. We're heading to the Arc to bring the Skulls pirate, Jed, to justice.",
    "Why so quickly? Don't you want to talk terms?",
    "Well, alright then - welcome aboard. My boat will be docked just outside Port Sarim pub. I'll inform Trader Stan you've joined the crew!",
    "Surula sent me. I'm in need of a quartermaster for my new ship. We're heading to the Arc to bring the Skulls pirate, Jed, to justice.",
    "That was easy. Don't you want to talk terms?",
    "Well, alright then - welcome aboard. My boat will be docked just outside Port Sarim pub. I'll inform Trader Stan you've joined the crew!",
    "Hi, Umi. Trader Stan suggested you might be interested in joining my crew. He said sirens were naturally gifted navigators.",
    "Oh, that's a shame. I don't suppose you know anyone else who'd be a good recommendation?",
    "Hi, you're Jemi, aren't you? Umi's sister?",
    "Why is that so surprising?",
    "But aren't you identical twins?",
    "Oh, yeah, right. I'm looking for someone to serve as navigator on my ship. Umi mentioned you were planning to head back to the Arc soon anyway, so... Interested?",
    "Umm, thanks...I think.",
    "Great, I'll go tell Trader Stan that I've got a navigator!",
    "Hey, I'm trying to build up a ship crew so we can take the fight to Jed on the water. Trader Stan suggested you've allowed certain prisoners to get an early release in agreement for joining a crew.",
    "Hey, I'm trying to build a ship crew so we can pursue Jed into the Eastern Lands and rescue the people he abducted. Trader Stan suggested you've allowed certain prisoners to get an early release in agreement for joining a crew.",
    "To start with, Stan suggested a quartermaster, a navigator and a bosun.",
    "Who's Jacob?",
    "What's up?",
    "Okay, I guess it can't hurt. Where would I find her?",
    "Draynor is a big place. Any idea where in Draynor she'll be?",
    "Actually, I think I might. You're Jacob's sister, right?",
    "He's been taken by a pirate gang called the Skulls.",
    "Yeah, that's where they took him from. I'm preparing a crew to sail in pursuit and rescue all the abductees.",
    "Oh, you're in? I wasn't sure I was asking.",
    "Aren't you a Black Knight? Can you just leave like that?",
    "It'll be moored just outside Port Sarim pub.",
    "Nice to meet you, I think. I'm-",
    "Thank you, sergeant...well, I guess bosun now. I'll let Trader Stan know you've joined the crew.",
    "That's a quartermaster sorted - he seems quite eager about us tracking down the Skulls. Maybe a bit too eager.",
    "She wanted to help, but she really doesn't want to travel back to the Arc. She did suggest I try her sister, Jemi, though. She's visiting Rimmington right now.",
    "Jemi agreed to join my crew!",
    "I think she recruited me as her captain, rather than me recruiting her as my bosun, but she's on the crew either way. Her name's Evie, and she only really wants to come to try to rescue her brother from Jed.",
    "So, that's my crew sorted. I'm ready to set sail!",
    "Now, about that thing you and the people of Port Sarim wanted me to do?",
    "And what was the other thing?",
    "Why, what is it?",
    "I'll do what I can."
  ],
  "The Barmaid": [
    "Alright, love, what can I do for you?",
    "Stan sent you, did he? So you are here to settle his bar tab, I take it?",
    "Oh, did he, now. I'll tell you what, lamb - if you square up what Stan owes me I've got the perfect person in mind for your crew.",
    "Call it an even thousand, love.",
    "Thank you kindly, love. Now, about a quartermaster - just you go head on upstairs and look for a Mister Gully.",
    "If he gives you the run-around, just tell him I sent you and that'll set him straight.",
    "I'm sure he won't be able to say no... or much of anything, really."
  ],
  "Mister Gully": [
    "Whatever it is, I'm not interested.",
    "Oh, er... hi. Er, can't talk... er, sorry.",
    "Whatever it is, I'm not interested.",
    "Oh, er, right - Surula? Um, er, okay, I... Y'arrrr!",
    "Well, then, why didn't you say so sooner? I'm in!",
    "Make it the usual rate for a quartermaster and we'll do fine. I've got my own unfinished business with that bunch of reprobates.",
    "Oh, er... hi. Er, can't talk... er, sorry.",
    "Er... okay.",
    "Er... no, miss. Happy to oblige. Hate the Skulls. Unfinished business.",
    "I'll meet you at the pub - that is, a different pub - after I've talked to Surula.",
    "Cap'n, we'll be ready to sail soon. Just waiting on some final preparations."
  ],
  "Seasinger Umi": [
    "Oh, that's kind of him to say, but... I'm kind of happy here in Port Sarim. Plus, I don't really want to go back to the Arc anytime soon. Sorry.",
    "Umm, oh, yes! Silly me - my sister has been visiting recently and was even thinking about heading home soon. She'd be perfect!",
    "She said she was heading to Burthorpe to drum up support to repel Jed's attack.",
    "She said she was heading to Rimmington to do some sightseeing before heading home.",
    "Besides, she's better than me at navigating anyway AND she's a full-blown seasinger. She's the clever one, so mum always said.",
    "The boat has been made and a crew assembled. We should be ready for sailing soon! Be lucky in all your voyages."
  ],
  "Seasinger Jemi": [
    "Oh, hi! I'm not Umi, by the way...if you were even looking for Umi. Umm.",
    "Oh, you're actually looking to talk to me and not her?",
    "Oh, she always gets all the attention. She's the pretty one, mum used to say.",
    "So, er, what can I help you with?",
    "Sure, why not. If Umi sent you here, you must be alright - she can spot a creep from miles off.",
    "I just have one thing to finish up here and then I'll meet you in Port Sarim pub.",
    "Hey, cap'n. I'll meet you in Port Sarim soon, okay?",
    "Ready to set sail whenever you are, cap'n! Y'arr, and all that!"
  ],
  "Guard Captain Roarkwin": [
    "Hello.",
    "That's true, but this raid of Jed's has changed my mind on that particular policy.",
    "That's true, but Jed abducting a bunch of our prisoners has changed my mind on that particular policy.",
    "I might be able to offer a suggestion, though. What crew roles are you looking to fill?",
    "Hmm, well, I can't help with those first two...and I wouldn't suggest a convict for such important roles either. As for that last one, though, I would have suggested Jacob.",
    "He used to serve on the crew of a Black Knights vessel, until he was court-martialled for theft and found his new home in our lovely shore-view cell, but he was grabbed in Jed's initial assault. There isn't much about boats worth knowing that he and his sister didn't know. Oh no, his sister...",
    "Between the assault and the clean-up, I've not had chance to inform his sister that Jacob's been abducted. Look, I know you came here for a favour, but could you do me one instead? Could you go to Jacob's sister and tell her what happened? If I know her, I think she'll help solve your crew problems.",
    "She got herself transferred to Draynor to be near her brother, so she could visit him. Those two were thick as thieves...you know, up until her brother was locked up for becoming an actual thief.",
    "Yeah, she's rented a room above the pottery there."
  ],
  "Black Knight sergeant": [
    "Get lost, pal. You've got no business here.",
    "Get lost, pal. You've got no business here.",
    "What of it?",
    "What? Don't be silly, he's in jail.",
    "Fine, I'm in.",
    "And I don't care...captain. I'm still in. Jacob's my little brother and I'm going after him. He may be an idiot, but he's family. Besides, I know boats better than he does. If you get me to him, I'll keep your ship in top condition.",
    "I can...if I just take care of a few things first. Where's your boat?",
    "Once I've arrived, let's not hang about. By the way, I'm Higgs - Sergeant Evie Higgs.",
    "I know exactly who you are. I fought in the Battle of Lumbridge too.",
    "'Captain' will do just fine for now...captain.",
    "I told you I have things to take care of first. I'll join your crew at Port Sarim pub when I'm good and ready."
  ],
  "Bosun Higgs": [
    "Why are we just sitting here? Come on, let's get sailing."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Impressing_the_Locals?oldid=32047624’"
  ]
}