{
  "Player": [
    "Korasi!",
    "Yes!",
    "That's it? That's your plan?",
    "How'd you get hold of the armour?",
    "Wow, that was really easy.",
    "Sorry, sir. Won't happen again.",
    "The label is at a funny angle, and it's not stuck down properly.",
    "Er, sir? We have a problem.",
    "Someone's switched the labels on these crates. When the knight thought he was putting in the pass number, he was actually putting in something totally different!",
    "How are we to do that? The labels are all mixed up.",
    "What were those things? Was that part of the security?",
    "I don't see any weight boxes in the room.",
    "But the pes...I mean beasts dropped them when they died! So, we can complete the power line.",
    "What do we do now?",
    "Well, that can't be too hard.",
    "Didn't it occur to you that you might need replacements?",
    "It's not volunteering if you make it an order...",
    "Nothing, sir.",
    "Nothing.",
    "Ha. Nice try, mysterious opponent.",
    "Yes, sir.",
    "Err...I'd rather not. I've got a terrible rash, really unpleasant.",
    "Very well...",
    "Wait! You have to listen to me. I know it doesn't look good, but I'm on an important mission and all of our lives may be at stake.",
    "That was true in the past, but not this time. I'm not on a White Knight mission, I'm with the Void Knights. You have no history of adversity with them, so please hear me out.",
    "Appeal to his love of the Black Knights.",
    "The Pests are escaping from the Void Knight's Outpost. We don't really know how, but all the clues lead to here and to these cubes.",
    "Pests are a threat to all of us; they'll do anything to invade and destroy our world. I know you care deeply about the black Knights. Don't waste their lives because of your pride. Help us stop the pests.",
    "You're so quick to blame others, but it's you who has gotten us all into this mess! Making these cubes, abusing that pest to get the goo...all of this has led to pests escaping from the island and who knows what else? Now, (sic)",
    "someone has taken the cubes and opened a portal to gods know where! You want me to persuade you to help? Fine, help clean up your own mess! Take responsibility for your own actions and your foolish pride.",
    "This all started with me investigating an escaped pest from the Void Knights' Outpost. Along the way, I learned that a pest was used to create these cubes, and that you and the Black Knights were behind the whole thing. But",
    "now, I suspect that you were only part of that and someone was helping you, someone who had ulterior motives and has now betrayed you. That person poses a threat to all of us.",
    "As Sir Tiffy said, time is short! Use your head. Would the leader of the Temple Knights be asking for your help if there wasn't great danger to all?",
    "No one's bullying you, Daquarius. This is your own mess, and we're simply asking you to take responsibility for your actions. If you don't, then it's on your head what happens next.",
    "I'm not so sure. That seems quite dangerous and puts us all at risk.",
    "Hmm, I need to think on this.",
    "What's up, Korasi?",
    "Your sword? Won't you need it?",
    "Then of course I'll use it. Thank you.",
    "Hi Jessika.",
    "Can you tell me more about your theories? I mean, about the Valluta and the man in black from Korasi's memory?",
    "Hmm, that'd be a very powerful weapon indeed.",
    "Why would the Black Knights agree to fund making the cubes if he was going to use them on something else? They didn't seem to expect all of this.",
    "*I'm ready.",
    "Erm, they're coming this way...",
    "Back, you devils!",
    "I think so. Everything still seems to be attached.",
    "What? How did I go through the portal and end up back in here?",
    "Hello? Savant, are you there?",
    "How will that impact on the battle?",
    "Understood. Send the troops through now, Savant.",
    "That's the last of them dealt with!",
    "It's [player name] here, Savant. I'll just hand you over to Sir Tiffy.",
    "I'll never help you.",
    "Why don't I kill you, Grayzag, and save us all the trouble?",
    "Oh no, we're too late! The Pest Queen is coming through!",
    "That's done it! The portal's closed...",
    "...but the Pest Queen made it through.",
    "But what do I do?",
    "What exactly are you?",
    "We're all Valluta?",
    "Let the Black Knights have him.  He deserves nothing less.",
    "Let Sir Tiffy take him. We mustn't lose information just to satisfy our feelings of revenge now.",
    "I want this madness over with. Tyr, he's yours.",
    "There's been enough killing. Lock him away where he can't hurt anyone.",
    "I couldn't save Jessika, Tyr. I'm sorry.",
    "I refused to lie to someone about a matter affecting them closely, yes.",
    "You mean, I refused to kill a defeated opponent in cold blood.",
    "Of course I did. There seemed to be little need to kill unarmed slaves.",
    "It was the quickest way to end the workshop's production and stop the spread of the goo.",
    "I disagree with that. It was lost, crippled, confused, and out of the Pest Queen's control. It was no threat to anyone.",
    "I disagree with that.  The merciful thing for the pest was to put it out of its misery; the merciful thing for the people of this world was to remove a potential threat, however distant.",
    "There's no sense prolonging what has to be done.",
    "I have every faith in the Temple Knights.  They can rework him to be kinder, wiser and more constructive than before.",
    "He has been neutralised without being killed his death on top of all those others would be needless.",
    "I had some questions for you, if you don't mind.",
    "Who exactly are you?",
    "A job you performed less than admirably.",
    "To where Grayzag was opening his portals on the islands in the southern seas...",
    "Will there be a new queen in the Void?",
    "And will the new one keep up the attack?",
    "In the event that she doesn't need help, or if someone else helps her...",
    "It was Grayzag making the portals in the southern eas, so they'll stop appearing now, right?",
    "Vall- Wait, you're saying that we're ALL the Valluta?",
    "That's all, thanks."
  ],
  "Captain Korasi": [
    "Hello, [player].",
    "I'm glad you turned up. The Temple Knights' efforts to find the cubes have been...less than successful.",
    "Actually, that's precisely what I had in mind.",
    "I think if we dress you in full Black Knight armour, you might be able to fool them again. Once inside, I'm sure you'll be able to figure something out. Are you up for it?",
    "Great! Now, here's my plan. I'm going to give you some specially modified Black Knight armour. You're going to put it on and infiltrate the Black Knights' Fortress.",
    "Then try to find out anything you can about the cubes.",
    "Pretty much. The armour has been modified to follow your movements and listen in. That means Savant can track you and make sure you don't fall into any real danger.",
    "Oh, I kidnapped a new recruit who'd wandered away from his brother knights. You'd never see such slackness in the Void Knights.",
    "Hi, [player name].",
    "I think it's really great that you're leading the alliance. I wanted to give you my sword, so you can use it to lead us into battle.",
    "The blade is enchanted with powerful magics to combat the Void. I have a feeling you are going to need it to deal with the challenges we are going to face...",
    "Besides, I can use one of our regular maces instead. I'd be proud to see my sword lead us into battle.",
    "Jessika has kindly imbued it with a returning spell, so if you ever happen to lose the sword, it should return to me.",
    "Well, we made it. We should send word to start bringing our troops through.",
    "Wait...what's that?",
    "You will pay for this, Grayzag... You will pay for every knight's death a hundredfold!",
    "Jessika, come back!",
    "Quickly, in here!",
    "[Player name], watch out - the cave's collapsing!",
    "Are you alright, [player name]?",
    "Then perhaps you would prefer to explain them to my mace instead, cur!",
    "No need to worry there, Commodore. I'll cut my way through the lot of them to get to Jessika and that murderer, Grayzag.",
    "Jessika, just hold on! I'm coming!",
    "Our troops are coming to help, [player name]...keep them safe...",
    "Don't worry about me [player name]...you...you need to stop the Pest Queen...",
    "I don't know. Maybe...maybe this creature does.",
    "It's a good thing...Jessika put...that returning spell on...the sword.",
    "[Player name]! You did it! Come speak to me, we need to deal with Grayzag.",
    "Now that you're safe again, all portals to the Void will go away, right? The Void Knights will finally be free of their battle against the pests.",
    "Stop it!",
    "None of you has the right to decide his death. [Player name] has hunted him from the beginning. [Player name] had to choose between two friends' lives. [Player name] defeated the Pest Queen. Only he/she has",
    "the right to decide Grayzag's fate.",
    "What do you want do to with Grayzag, [player name]?"
  ],
  "Sir Tiffy": [
    "I don't like your tone, young lady. My agents have tried their best, but we're stretched thin and it's not like you can just waltz right into the Black Knights' Fortress.",
    "There isn't time to explain.",
    "Lord Daquarius, we have had our differences in the past. But long ago, all the knights of Falador banded together to protect our land. I would ask you to trust us that the threat of the Valluta is great enough that we",
    "must once again put aside our differences and form an alliance.",
    "I'll agree to that. [Player name] has proved himself to both Sir Amik and myself on many occasions.",
    "Not so fast, Grayzag! You're under arrest.",
    "Don't worry, Tyr's right on the other side. We'll get him. [Player name], you will have to deal with the Pest Queen. We'll send troops through as soon as they're ready.",
    "That's not the way. If Sir Amik were here he'd want to lock Grayzag away, that much I'm sure of.",
    "But I think the Temple Knights can gain information from him, then we'll dispose of him. He is too great a risk to keep around.",
    "I'm glad you feel that way, [player]. Rest assured, when we've gathered all we can, he will be dealt with.",
    "Time for you to go [sic] Grayzag.",
    "Time for you to go Grayzag.",
    "While I don't agree with the sentiment, Daquarius, I agree it is time to go. Thank you for your help, [player name]."
  ],
  "Commander Colby": [
    "About time you showed up. Your team has been waiting for an hour. I'll teleport you to the storage entrance to save you some time, but don't expect this kind of treatment every time!"
  ],
  "Captain Gilroy": [
    "Well, now that we're all HERE, I guess we can get on with the mission. Thank you for finally joining us!",
    "See that it doesn't. I've got a man already in there setting things up. Let's go.",
    "Ok, get that door open. I want to get this trip over with as fast as possible.",
    "Holy cow! What happened?",
    "Alright, new guy. Get to it! Unlock that door.",
    "What's the matter now, recruit?",
    "Sabotage! It looks like we've got company, recruit. We need to get that security system fixed sharpish.",
    "Thankfully, due to my upbringing on a quiet Misthalin farm before joining the Kinshra, I've got a knack for determining small differences in weight.",
    "Just hand me any two and I'll tell you which is the heavier. When you think you've worked it out, let me know, and we'll put the labels back where they belong.",
    "It's an ambush! We're going to have to fight our way through.",
    "What is it?",
    "Did that look like part of our security? Clue up recruit! Someone has sabotaged the security and left those beasts to kill us. We need to unlock this room and the next and find out what is going on!",
    "We don't do the same security in each room. Those beasts stole the blocks that lit up the red line in the security system. Without them we can't power the door to open it.",
    "But that big one sat on one of the blocks and broke it. This is going to slow us up.",
    "We need to repair that broken block.",
    "It wouldn't be, except we destroyed the forge we used to make them to prevent counterfeit blocks being made. Still, it can probably be repaired.",
    "Don't question your superiors! For that insolence, I'm volunteering you to fix the the [sic] forge.",
    "What was that recruit? I couldn't hear you for all the whining noise you were making.",
    "That's what I thought. You're going to need some supplies to fix the forge. Hunt around our base and see what you can do with the things nearby. The forge is in a little room north-west of here. Get a move on!",
    "You know, after this much sabotage, I'm not inclined to trust these panels.",
    "Good work, recruit. Now just open up those panels and get them filled up.",
    "Oooooh, no. No, no, no. This is not good. Really, not good.",
    "The security system...the monsters. Someone has broken in and stolen them all. And just what in Zamorak's name is that?",
    "I have to call in Lord Daquarius. He's going to be so mad...",
    "Lord Daquarius, you must come to the cube storage room. It's an emergency.",
    "Sir, it is, I swear. The security rooms had been sabotaged, the storage room is practically empty, and...there's that big pulsating portal over there.",
    "The new recruit got us in. He/She was quite skilled in bypassing the system."
  ],
  "Black Knight": [
    "Right away, sir. I've already set the scales up; fifteen in each is the pass number for the day.",
    "I don't know, but I nominate the new guy to try the door next! I don't want to die!",
    "What are these monsters? I don't want to die, I'm too pretty!",
    "Where are all the crates? All the puzzle cubes?"
  ],
  "Infobox": [
    "It seems someone has swapped around the labels on these crates. The stated weights are wrong.",
    "You turn your magical senses on the panels...",
    "...and disarm a nasty little magical trap.",
    "Korasi hands you her sword.",
    "Who will you try to save?*Save Jessika.",
    "What should be done with Grayzag?"
  ],
  "Lord Daquarius": [
    "This had better be good to drag me all the way down here, Captain.",
    "I can see that! If the security system was sabotaged, how did you get in here?",
    "Was he/she indeed.",
    "Recruit, front and centre!",
    "Take off your helm. I take pride in knowing all my knights by name, but I need to see your face.",
    "Knight, I gave you an order. Take off your helm or I'll do it for you...with your head still in it.",
    "YOU! I should have known! Captain, arrest this man/woman.",
    "You White Knight scum are always on a mission to 'save the world', but it always ends with Black Knight deaths!",
    "I will listen, but it had better be good!",
    "It sounds to me like a cooked up conspiracy of the Temple Knights. Those interfering, arrogant fools... The whole world isn't under threat from a bunch of cubes! There's no great crisis.",
    "Will you people stop invading my secret bases!",
    "What are you idiots talking about? What is a Valluta? What ship?",
    "What about you, [player name]? Would you like to bully me into this as well?",
    "...",
    "That's the biggest load of RUBBISH I had ever heard! That's how you plan on persuading me to your side?",
    "Now that sounds much more appealing.",
    "The Kinshra will support you in this battle...but only on condition that [player name] leads the force.",
    "You seem to switch sides on a whim, and hold allegiance to none. At this point, that makes you the least untrustworthy person here.",
    "Are you ready to go into the portal? Are you prepared for the death that may be awaiting you on the other side?",
    "Good. Lead us through the portal!",
    "You! You backstabber. How dare you endanger my men?",
    "Well, what a fantastic plan that was - now we're trapped in here!",
    "Now what?",
    "And just exactly how long is a 'jiffy', Cashien? If the Kinshra were running things, this operation would be going a lot more smoothly.",
    "Spare me the accusational tone, Tyr. I do not have to explain the Kinshra's actions to you judgemental Void Knights.",
    "A bronze pickaxe? It'll take years to mine through this rubble with one of those!",
    "What?",
    "Fine. Stand aside then, you pathetic excuse for a hero...",
    "...",
    "Why don't you come over here and see for yourself, you lazy old coot?",
    "Wait! I think I can feel the rock about to give - I've almost made it through!",
    "WHAT?",
    "That mad man is not getting away from me!",
    "Yeah, yeah, yeah. We're all part of the balance - blah, blah, blah. Now, can we please get to the more pressing matter at hand? I want to torture Grayzag to death, and I want to do it now!",
    "That's it, I'm going to kill him! NOW!",
    "Ha!",
    "Any pain you felt previously will pale in comparison to what you are about to feel.",
    "And now to finish you, you worthless cur.",
    "What?  Can't stand a little squealing, Tyr?  You Void Knights are pathetic.",
    "Bah! You're a bunch of little girls.",
    "My patience wears thin with you people. You can't stomach anything but flowers and rainbows.",
    "Bah. He deserves to suffer.",
    "My patience wears thin with you people. You can't stomach anything but flowers and rainbows.",
    "Pfrt, you're pathetic, [Player].",
    "My patience wears thin with you people. You can't stomach anything but flowers and rainbows.",
    "[Player name], think twice before infiltrating my fortresses in the future. I will not look kindly on another intrustion by you."
  ],
  "Korasi": [
    "I beg to disagree, Daquarius.",
    "Matters deemed it necessary. Savant has been tracking [player's name]'s movements and alerted us that he/she had been discovered.",
    "Long story short, we think the mysterious figure from the ship opened the portal to the Valluta. We need to get in there and stop him before he gets it.",
    "You get to kill pests and get revenge of that son of a brawler who killed your men and stabbed you in the back. How does that sound?",
    "I agree on behalf of the Void Knights. What do you say, [player name]?",
    "Don't worry about me, I'm prepared to lay down my life. Save Jessika!",
    "It's never too late. I'm going to shut down that portal.",
    "There was no way to save us both, [player name], and I'm grateful to you for saving my life.",
    "Jessika was a true Void Knight and I cared for her a great deal. I swear that everything I do in the Void Knights' service from this day on will be dedicated to her. She will be remembered.",
    "I couldn't agree more."
  ],
  "Jessika": [
    "Yeah! And I think I figured out what's going on, and we thought you might want to know too, since it's important.",
    "I've been doing some research on the side...about the Valluta. In the book Korasi gave me about the Void Knights, it was referred to as a powerful weapon. I was thinking about it, and about Korasi's memory from the",
    "ship with all the pests suddenly appearing and disappearing, and the mysterious figure, and the cubes, and the depression, an-",
    "I was getting to that!",
    "Hi [player]!",
    "What can I do for you?",
    "Okay, but it's all just conjecture. What do you want to know about?",
    "Well, the Void Knights were telling me tales about the Valluta and how it's a weapon to stop pests. I started wondering if it was really just to stop pests or if it was maybe just a weapon to stop one's foes. There doesn't",
    "seem to be a lot of information on it.",
    "Yeah you wouldn't want it to fall into the wrong hands. Which got me thinking about the man Korasi saw kill Commodore Matthias. He clearly had good control of the pests and wants to stop the Void Knights, maybe even",
    "destroy them! So, he'd want something like the Valluta.",
    "I was studying the one you got from Ali Tist. I was wondering how the Black Knights got hold of the void leech, and how they knew what to do with the goo. It made me sense that if the mysterious figure got the pest,",
    "since he's so good at controlling them, he might give it to the Black Knights to fund whatever it was he wants to do with the cubes. I think he needs the cubes for gaining control of the Valluta for some reason.",
    "Oh, that's easy! I asked the Black Knights after you formed the alliance. Captain Gilroy says the mysterious figure lied about wanting to help them and told them the cubes would sap the White Knights' energy.",
    "The Black Knights then planned to invade Falador while the White Knights were weakened. The mysterious figure must have just been waiting for the Black Knights to make enough and then stole what he needed for his own",
    "plans.",
    "I don't know. He must be a very skilled summoner to control so many pests at once. I mean, when I was at the Wizards' Tower, none of them were particularly skilled. It was kind of a new field of study. There was just me and",
    "the professor.",
    "Professor Melville! What are you doing here?",
    "But why, professor? Why are you doing this? When did your work stop being about knowledge?",
    "No...",
    "Professor, no! This is all wrong! Please, stop and listen to reason!",
    "No! This is all my fault. I deserve this! Save Korasi!",
    "We'll handle the clean-up here, [player name]."
  ],
  "​Korasi": [
    "Great! I'll contact Commodore Tyr and we'll gather our forces here."
  ],
  "Commodore Tyr": [
    "We were just discussing what we should do next. There's no way to know what is beyond that portal. I think we can expect pests, but the Void Knights know how to handle them. Now that our forces are here, I think our only",
    "choice is to go through.",
    "It will be dangerous and, normally, I would send a scouting party, but there just isn't time.",
    "Well, don't think too long. While you're thinking, I believe Korasi wanted to speak to you.",
    "Are you ready to go through the portal? It could be a tough fight. There's a good chance we may all die.",
    "Good. Lead on through the portal.",
    "WHAT? You're the one responsible for the past twenty years of attacks we've suffered?",
    "Korasi, wait! Stand your ground, don't get too close!",
    "You mean like when you were colluding with that madman, Grayzag?",
    "If Daquarius manages to be of any use at all, we'd better give some thought as to what to do about that void army of Grayzag's out there.",
    "While I commend your zeal, Korasi, we are vastly outnumbered. We'll need reinforcements to prevail in the battle.",
    "We'll need to start bringing our troops through the portal. Tiffy, can you get word to Savant to deploy our forces?",
    "Korasi, wait! It could be a trap!",
    "Quickly now! We must go after her; prepare yourself for battle, [player name]. Guthix only knows what could be waiting for us in there.",
    "No, I don't want to delay this. He needs to die now. He has cost too many Void Knight lives and the balance will only be righted with his immediate death.",
    "There is no balance in torture.  It will not bring back those we lost.",
    "You disgust me, Daquarius.",
    "You've made the right choice.",
    "I hope you may find balance in eternal slumber.",
    "I think that is an unwise choice... but it is not my choice to make.",
    "So ends this alliance of knights.",
    "All things considered, I think we've done well here today.",
    "Grayzag is dealt with, the Valluta restored in the temple and in us all, and humanity is safe from the Pest swarm.",
    "Well said, Korasi.",
    "And what of yourself, [player name]? You've come a long way in service of the Void Knights, and we reward our own.",
    "So make some space and I shall duly reward you. You need 5 spaces.",
    "But what would be suitable? You've had some decisions to make that reflect on you as an individual.",
    "You told an uninformed bartender the truth of what lurked in his cellar, potentially causing a panic.",
    "You released a void leech into the world, even though it is an enemy to all life on this plane.",
    "You killed a void leech, a crippled and defenceless creature, rather than do the merciful thing and free it to live out its life.",
    "You let us give Grayzag a merciful death. Compassion and justice sit well on you.",
    "You had the Temple Knights take Grayzag to be...worked on.  Was that wise?",
    "You had Grayzag imprisoned and his life spared, even after his schemes killed so many and endangered the world. Was that wise?",
    "Allow me to present you with the armour of a Void Knight Justiciar, and two books containing some secrets of our combat techniques.",
    "Allow me to present you with the armour of a Void Knight Executioner, and two books containing some secrets of our combat techniques.",
    "I also believe you should keep the sword you took into battle against the Pest Queen.",
    "We should leave this place. If you have questions for the Valluta, now's the time to ask them. I plan to have the portal Grayzag opened disrupted as soon as we return.",
    "Any other business you have with me can wait until after we're back at the outpost."
  ],
  "​Commodore Tyr": [
    "Good. I believe Korasi wanted to speak with you briefly. Once you've talked to her, lead us through the portal.",
    "You left the doorkeeper alive, despite the fact that he could have potentially identified you later and disrupted the entire mission.",
    "You avoided killing any of the workers, even though this would have made your life easier.",
    "Allow me to present you with the armour of a Void Knight Guardian, and two books containing some secrets of our combat techniques."
  ],
  "Wizard Grayzag": [
    "I'm so glad you could join us! You are, perhaps, a little earlier than I had expected, but no matter.",
    "Ah, Daquarius. You are so easily manipulated. But, I couldn't have done it without you. I must send you a fruit basket when all of this is over.",
    "Oh, my dear, naive Jessika. It was never about knowledge; it was only everabout respect...and revenge!",
    "I am the greatest summoner alive!",
    "And yet those petty fools at the Wizards' Tower failed to see my greatness. They rejected my research, mocked my imps...well, I turned to something a little larger instead.",
    "I stumbled upon the stories of the Valluta and I knew I could use it to prove my theories.",
    "After that it was easy. I practised for a while by opening portals on the deserted islands in the south seas...",
    "I enjoyed causing that chaos, but I needed someone on the inside to study the portals' effects. So I sent you, Jessika, my brightest student.",
    "You proved most useful of all, sending that leech right into my arms. I think I'll send you two fruit baskets.",
    "The leech was they key, you see. I knew from Jessika's reports that I could put it to use and neutralise the Valluta, to drain its life force. The Black Knights had the means to produce the goo on the scale I needed.",
    "And it wasn't exactly hard to convince you to do it, was it, Daquarius, with your small-minded grudges?",
    "And then we come to [player name]. I have detested you for many years, but you're too late now!",
    "The goo is draining the Valluta as we speak and then I shall perform the greatest summoning anyone has ever seen. I shall summon...",
    "The Pest Queen! You'll be no match for me then. I'm glad you're here to witness the most awesome summoning act ever. Too bad you won't live to tell the tale.",
    "However, I need a little time yet to claim the Valluta's power for myself so...say hello to my little friends!",
    "That should be enough power for the portal. Now, for the catalyst. Ah, [player name]. So glad you could join us. You're just in time; I need your help.",
    "Oh, but you don't have a choice. You see, the cubes have drained the Valluta, and I used that power to open the portal, but I need a death to catalyse the summoning of the queen.",
    "I can kill Jessika, here, or I can order my pests to kill Korasi.",
    "I think it'll be more fun to let you decide.",
    "No, no, no. If you kill me, they both die and the Pest Queen will still be summoned. I'm growing tired of you stalling...",
    "Make. Your. Choice.",
    "And only the greatest summoner will be able to defeat her! And that's me!",
    "Only if you can catch me! WHEE!"
  ],
  "Sir Tiffy Cashien": [
    "Wizard Grayzag. Suddenly a great deal becomes clear.",
    "Hmm, I'm just about picking up a signal in here.",
    "Ahem, as I say, is anyone reading this?",
    "Savant! There's a good girl! You're not coming through very clearly, though, old fruity.",
    "Hmm, let me see...",
    "Savant, old love, can you read me now?",
    "Jolly good show! Savant, we're in a spot of bother here - stuck behind some rocks, wouldn't you know!",
    "Understood. Cashien out.",
    "We wait, Daquarius. Savant will have us out of here in a jiffy.",
    "A pickaxe! Good thinking, Savant!",
    "Well, you'd better get started then.",
    "Capital idea, old spice.",
    "Come in, Savant; Cashien here.",
    "Copy that. We need you to send our troops through the portal. Send the best - they are going to have a fight on their hands when they get here.",
    "What say you, [player name]? Are you ready to lead this squad into glorious battle against the void pest threat?",
    "That's a good boy/girl. You can use my commorb to send your orders.",
    "Ah, welcome back old bean!",
    "Yes...that is odd. It must be that interference that Savant mentioned...",
    "Anyway, now that you're back, we can get on with winning this battle!",
    "What say you, [player name]? Are you ready to lead this squad into glorious battle against the void pest threat?",
    "How are things going out there, my boy/girl?",
    "Bravo, I say, bravo! Now we just need to get out of this cave.",
    "Daquarius, how are you getting on with that rock?",
    "I say! Bad form, Daquarius, bad form indeed!",
    "Ah, Savant, my dear. What's the good word?"
  ],
  "Sir TIffy Cashien": [
    "Calm down, will you, Daquarius? We're not done for yet.",
    "Just in the nick of time, Savant, things are getting quite heated up in here, old girl...",
    "That pickaxe of yours is working wonders, my dear.",
    "You never fail to impress, Savant!"
  ],
  "Savant": [
    "Tiffy? I re.. .our s...al, but it.. .ery w..k. (Tiffy? I receive your signal, but it's very weak.)",
    "... .uning ..r .mmorb to a high.r freq...y, Tif..! (Try tuning your commorb to a higher frequency, Tiffy!)",
    "Roger that, Tiffy! Reading you loud and clear!",
    "Copy that, Tiffy, I'll get you out. Just sit tight and try not to use your commorb much; transmitting on a high frequency like this will rapidly drain its power supply.",
    "Come in, Tiffy, Savant here.",
    "Tiffy, I can't get a lock on you, there's a lot of strange interference coming from near your location.",
    "The best I can do for now is send you a little something to help. You should be receiving it now...",
    "Savant here. How are things going, Tiffy?",
    "Good to hear. I'm reading power levels dropping in your commorb, though - best make this quick!",
    "I thought you might need backup, so I prepped a Conquest squad and have them ready to deploy to your location. I believe [player name] has experience commanding these troops, Tiffy.",
    "I read you, [player name], but the commorb is almost out of power. You're only going to be able to transmit your orders in bursts, to allow the commorb time to recharge.",
    "Your troops will stand their ground while they wait for new orders to arrive, but the pests will keep attacking during this time!",
    "Try to anticipate what their actions will be while the commorb is recharging, and issue your orders accordingly!",
    "Deploying the troops and patching you through now, [player name]. Good luck!",
    "Come in, Tiffy, Savant here.",
    "I've managed to cut through the interference and get a lock on you. Teleporting now..."
  ],
  "Valluta": [
    "Small one, I am too weak to stand against this threat. You must fight...",
    "Ask. My knowledge may yet aid you...",
    "Match this beast's devastating attacks, with those of your own...",
    "Your friends have the...experience necessary to combat these foes. Protect them while they do their work...",
    "The beast calls its minions forth from the Void. They will not stop until the beast is slain...",
    "Thank you, [player name], for fulfilling the duty I could not and killing the Pest Queen.",
    "And you, Korasi, for destroying those boxes. Without you two, all would be lost.",
    "I am Valluta, protector of weak places. I exist to guard this world against creatures from the Void and beyond.",
    "That is not the case. The efforts of Grayzag, impetuous and ambitious, have forever damaged the boundaries on which the portals form.",
    "I fear the brave Void Knights must continue their vigil still. They must be in future just as they have been up to now: Valluta. Just as I am. Just as you are, and the sword you carry.",
    "Ah, my deliverer returns.  Greetings, [player name], mighty being.",
    "Please, by all means, ask Valluta, servitor of Guthix, what you will. I fear I know little outside of this chamber, but I shall answer as best I can.",
    "I am Valluta, protector of weak places. I exist to guard this world against creatures from the Void and beyond.",
    "It was Guthix, balancer of all scales, who placed me here, as he has placed so many other guardians against that which threatens his world.",
    "In this spot is a weakening, a closeness of worlds, and those worlds can be brought into conjunction. I am to prevent this.",
    "[player name], strong in reproach, is right to berate me. Of late I have felt echoes, small pulls of duty, but to a place far away from here.",
    "I couldn not draw myself back quickly enough when the attack came. Packed arounde with the leech goo, I was reduced to uselessness as you saw.",
    "Yes. There is always a queen.",
    "It was once that the queen, slave driver of pests, could not enter this world, for the weakening was too small.",
    "Now, I do not know. I suspect not, and that she would need help again, but Grayzag, twisted and insane, is taken away* and cannot help her.  *(The words 'taken away' are used when the player chooses to have Grayzag get taken to the Temple Knights.  They may be different if the player chooses to have the Void Knights kill Grayzag.)",
    "Valluta, restored and contrite, stands ready.",
    "This is not the case. The efforts of Grayzag, impetuous and ambitious, have forever damaged the boundaries on which the portals form.",
    "I fear the brave Void Knights must continue their vigil still. They hust be in future as they have been up to now: Valluta. Just as I am. Just as you are, and the sword you carry.",
    "Valluta is simply what I am, what I do. Protector. Fortification. Guard against the Void. All who fought here today have done this. All who fought here are Valluta."
  ],
  "Melville Grayzag": [
    "I showed them! I showed them all! Heee, they'll never call me Lamezag again!",
    "Heehee, this is going to tickle!",
    "Sugar and spice! Everything nice!",
    "Suffer sounds like muffler.",
    "Pathetic, pathetic - nah, nan, nah-nah nah - [Player]'s pathetic."
  ],
  "Choice": [
    "telling the bartender of the Rusty Anchor about the matter in his cellar during A Void Dance",
    "killing or sparing the doorkeeper while infiltrating the Black Knights' Fortress in A Void Dance",
    "killing or sparing the enslaved workers in the fortress during A Void Dance",
    "freeing or killing the void leech during A Void Dance",
    "Melville Grayzag's fate"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:The_Void_Stares_Back?oldid=35851238’"
  ]
}