{
  "Player": [
    "Hi there.",
    "Sorry?",
    "Great building?",
    "Ah, I see, a great history. But why will it be in ruin?",
    "Does the king not respect the outpost's GREAT history?",
    "Me?",
    "Tell me more.",
    "I don't care about some dusty building.",
    "OK - I will make a stand for history!",
    "But where should I start? What do I need to do now?",
    "In what way can he help?",
    "OK, I'll see what he has to say.",
    "Sounds ominous. Does he have a name?",
    "I'll track him down.",
    "I've conversed with the dead before, that shouldn't be too much of a problem.",
    "And how's he related to this outpost?",
    "That sounds simple enough.",
    "Hi there.",
    "What's the story so far?",
    "What do I need to do now?",
    "Got to go, bye!",
    "Are you Erin?",
    "This shouldn't take too long. I just want to ask you a bit about your great Grandfather, the one who lived in the outpost?",
    "I'm doing some research for a man called Jorral. Apparently the King is going to make the outpost into his very own alchemists' lab.",
    "I see.",
    "No idea at all?",
    "It's better than nothing. Will you lend it to me then?",
    "I haven't found anything yet.",
    "That's kind of hard because I lost the key.",
    "I found a chest!",
    "Would you like to see the journal I have found?",
    "I was just about to. Do you want the key back?",
    "Hi there.",
    "Hi. I found a chest.",
    "Hi there.",
    "I found a journal!",
    "I see.",
    "Interesting.",
    "Hello. Are you Droalak?",
    "So your name IS Droalak?",
    "Great. Do you know anything about the outpost north of Ardougne?",
    "Oh dear.",
    "Like what?",
    "You want me to patch things up?",
    "Call it 'traveller's intuition'.",
    "No problem.",
    "What do you want me to do again?",
    "Ok. Ok.",
    "I have a sapphire amulet!",
    "Hi.",
    "Erm. I think you're talking about Droalak. I believe he did love you and he's very sorry for leaving you!",
    "If you don't mind me asking, are you Melina?",
    "I've been talking to Droalak. I believe he left you but never returned.",
    "Well actually he told me to give you this amulet.",
    "I honestly believe he's sorry.",
    "I will.",
    "Goodbye.",
    "I've given her the amulet. She was very pleased and said she just wanted to know you still cared.",
    "Could I have that scroll you mentioned first?",
    "Thank you.",
    "Thanks for the scroll, but I seem to have lost it.",
    "Hi there.",
    "I have been in contact with the ghost you suggested, and I've recovered this:",
    "Excuse me.",
    "Hello there. Are you the brother of Dron?",
    "Not that I know of...",
    "Well I'd like to talk to your brother Dron about the outpost north of Ardougne.",
    "Like?",
    "O...kay....",
    "Not the best. Can you give me those hints again for speaking with Dron?",
    "I think I can remember all that.",
    "I need to talk to you.",
    "Erm, sorry. I don't mean to cause offence...",
    "Please don't hurt me.",
    "I'm after important answers.",
    "I just talked to your brother.",
    "Why, you're the famous warrior Dron!",
    "An iron mace.",
    "Breakfast.",
    "Lunch.",
    "Kittens.",
    "You can't lecture ME on eating habits.",
    "Bunnies.",
    "Red.",
    "36.",
    "8.",
    "Fifth and Fourth.",
    "North East[sic] side of town.",
    "Dave.",
    "No. D-A-V-E",
    "Blanin.",
    "Fluffy.",
    "12, but what does that have to do with anything?",
    "Er, I think you'll find it's 12.",
    "Phew!",
    "I'm trying to find out the history of the outpost near Ardougne. I was hoping you could help me.",
    "Ex-friends?",
    "Ah, I like happy endings.",
    "Thank you, I can report this back to Jorral now.",
    "Well, I was wondering how you get the blood stains out of your clothes?",
    "That's one less thing to worry about.",
    "Hi there.",
    "I've talked to the warrior.",
    "Well...",
    "And then I asked him about getting the blood stains out of his clothes, but he didn't like that!",
    "I'm glad to hear. What's the whole story?",
    "So what should I do now?",
    "Then I suppose you want ME to deliver it to the king?",
    "No, sorry.",
    "Don't suppose you could give me the letter again?",
    "Excuse me. I have been asked to hand you this from Jorral at the outpost.",
    "I am sure he only wants what is best.",
    "Thank you.",
    "I'm working on it!",
    "Excuse me sire, but I seem to have lost that letter you gave me.",
    "I've been to see the king and he gave me this letter.",
    "My pleasure.",
    "How's the outpost?",
    "I have delivered the scroll; you can rest in peace now.",
    "Goodbye."
  ],
  "Jorral": [
    "All is lost!",
    "Just look around you! This great building will soon be in ruin.",
    "Of course! This building has a history spanning generations!",
    "It's to be ripped apart to make way for King Lathas' new alchemists' lab.",
    "Well, actually nobody knows what the history is. But there must be something. Wait a minute. You could help me!",
    "Yes! Uncover the history of this building to convince King Lathas to leave it alone. Do you want to know more?",
    "That's what I like to hear.",
    "It's doomed. DOOMED!",
    "If all goes well, I hope to be able to turn it into a museum as a monument to the area's history. What do you think?",
    "Oh thank you so much, you really are my saviour!",
    "There are three people that may be able to help:",
    "There is a silver trader in East Ardougne called Erin, who I believe can help.",
    "His Great Grandfather lived in this outpost according to the records. He must know something!",
    "I've been told that there's a ghost far off in Port Phasmatys that moans of losing his life to this place.",
    "He does indeed. It's Droalak.",
    "It might not be so simple! You'll need an amulet of ghostspeak to talk to him!",
    "Up near the mountains, in Rellekka is a warrior called Dron whom I have spoken to in the past. He is always on the lookout for information that can improve his fighting and commanding skills.",
    "He isn't directly, but he's studied many wars, and as this used to be an outpost it should have been involved in some war.",
    "He isn't the easiest person to talk to, so you may need to speak to his brother, Blanin, first.",
    "How's it going?",
    "What do you mean? You've discovered nothing!",
    "From the journal you received detailing the experiences of a follower of Zamorak, we know that Zamorak followers were living in the outpost at some point, and that they were being a nuisance to Ardougne but the Journal[sic] ends abruptly, I think they were halted by someone, some force.",
    "From the two pieces of evidence, we know that the outpost was lived in by followers of Zamorak, whom caused havoc to the nearby city of Ardougne. This must be the time of 'The Dreadful Years of Tragedy', which was stopped in 'The Great battle'. One of the survivors became King, which must be the current King Lathas' Great Grandfather and the other started the market place. But who stopped the Zamorakian followers?",
    "From the two pieces of evidence, we know that the outpost was occupied by followers of Zamorak who caused havoc to the nearby city of Ardougne. Ardougne called in some Saradomin followers to deal with the problem. The two sides were led by ex-friends who settled their differences and decided to worship Guthix. But who survived and what happened to them?",
    "How's it going?",
    "Best you look inside then.",
    "How's it going?",
    "Good work. Let's see what it says.",
    "The person who wrote the journal spent time living in the outpost, following the order of Zamorak.",
    "He talks of all the nasty things they did to the people of Ardougne, which I don't care to mention! It looks like they were stopped by someone. But it doesn't say who.",
    "How's it going?",
    "Very interesting. So there was a great battle at the outpost. Then one of the survivors became king, and the other started the market place. Good work.",
    "How's it going?",
    "Excellent! What did he say?",
    "It seems you're lucky he didn't beat you up! Well done, that's another piece of the puzzle.",
    "It all makes sense now, I never realised there was quite so much history to this place, it was more than I could have hoped.",
    "Many years ago, there were two friends who fell out over their difference of opinion in religion. One decided to dedicate his life to Saradomin, the other to Zamorak. Years passed and the follower of Zamorak moved into this outpost with a group of others to cause havoc for the city of Ardougne. The people of the city called upon some Saradomin followers, who happened to be led by the other friend. A battle ensued that ended with the two ex-friends at the top of the outpost as the sole survivors. Realising their mistakes they made friends again. One decided to become King and spread the word of equality, and the other chose to start up a market where all could trade their wares equally and fairly. The one that became king is the great grandfather of the King Lathas that we know!",
    "Well, what I'll do is write down the details you have provided in a more easy to digest manner, along with my plans for using this building as a museum.",
    "You've got that right!",
    "Have you taken that letter to King Lathas in Ardougne yet?",
    "Any time soon would be great.",
    "Ok. Just don't lose it again!",
    "Quick, let me see.",
    "Hurrah! Good work, you've done it. You've saved the outpost!",
    "I can now continue with my plans for this place. Thank you.",
    "Take a look at the artefacts in the new museum room. You may find something of interest.",
    "It's perfectly good. Thanks for the help again. Feel free to browse the room next door!"
  ],
  "Its sole purpose": [
    "to see incoming armies"
  ],
  "Silver merchant": [
    "Silver! Silver! Best prices for buying and selling in all Kandarin!",
    "That I am. What do you want? You realise I'm working here.",
    "What's it to you?",
    "That can only cause chaos! Well, my great-grandfather lived and died there according to my mother, but even she knows very little about him.",
    "The only thing I have of his is a key. It's a strange key, it changes temperature by itself as you walk around. I'm afraid I don't know what it's for, though.",
    "Well, I imagine it's to some sort of chest of his belongings as it's too small for a door. Perhaps if you find some of his belongings you will discover some clues amongst them.",
    "Why not; I can't use it anyway. Try feeling its change in temperature as you walk around.",
    "Keep trying. Have you noticed that the key changes temperature as you walk around?",
    "I was waiting for you to say that... because I just found it! Take it and don't lose it.",
    "I wonder what is inside.",
    "Let's have a look.",
    "Very interesting. Best you show it to Jorral at the outpost.",
    "Keep it, it may come in handy."
  ],
  "Droalak": [
    "Wow. I haven't spoken to the living for... for... I don't remember how long.",
    "Sorry, yes. I am he.",
    "I don't really like to talk about it, but I died there.",
    "I do have a scroll which might interest you that describes the timeline of the outpost. But first I wonder if I could ask you to tie up a problem?",
    "Well, I left to go to the outpost against the wishes of my wife. I promised I would return to her, but obviously I did not as I died there. She's a ghost nearby, but won't listen to my apologies.",
    "Yes, how'd you guess?",
    "OK, well perhaps you could give her a strung sapphire amulet, because this is what I gave her the day I left. Her name is Melina by the way.",
    "Make a strung sapphire amulet and give it to Melina!",
    "Good work. Just give it to Melina, who's wandering somewhere nearby.",
    "Excellent! I am so glad she believes me. I can finally rest in peace.",
    "Of course. Let me know if it was of any use and then I can be forever free.",
    "Take that scroll to Jorral in the outpost.",
    "It's a good job I stuck around then, isn't it! Have another copy.",
    "Thanks for telling me! I've been waiting for ages!",
    "Bye!"
  ],
  "Melina": [
    "Oh why did he leave me? Did he truly love me?",
    "You're giving me empty words. That is all.",
    "That I am. What's it to you?",
    "He did. I suppose he has asked you to tell me he's sorry. What an empty gesture!",
    "A sapphire amulet! He remembers! It's just like the one he gave me before he left.",
    "I'm so glad. Please, tell him I forgive him!",
    "At last I feel complete. Farewell."
  ],
  "Dron": [
    "Look, I don't have time for weaklings, if you want conversation, talk to my brother Blanin!",
    "Why should I?",
    "[Don't waste my time!/Leave me alone!/Wrong, wrong, wrong/You know nothing]!",
    "But how do you know me?",
    "Don't talk of my brother. He's not on my good side at the moment.",
    "If so, what weapon do I use?",
    "When do I like to eat rats?",
    "When are kittens best devoured?",
    "What do I usually eat for tea?",
    "Eww. Gross. You have some strange tastes.",
    "What colour spider blood tastes the best?",
    "How many years old am I?",
    "and months?",
    "What are the most interesting ages for battles?",
    "And my house is situated where?",
    "What is my brother's name?",
    "Dev?",
    "What a strange name. Unlike my brother's!",
    "And my pet cat is called?",
    "What's 5 plus 7?",
    "Everything! Besides, it's 13!",
    "...",
    "..........",
    "Very well, you seem to know me quite well, I'll answer your questions best I can.",
    "Well what are they then?",
    "Let me see. Ah yes, I remember reading of a battle that took place at the outpost many years ago. Two ex-friends led forces in a small battle that ended with them pitted against each other at the top of the outpost as the sole survivors because of their superior strength.",
    "They were once friends but a difference in their beliefs meant they fell out. One chose to follow the god Zamorak, whilst the other chose Saradomin. But finding themselves in this extreme situation at the top of the outpost caused them to see the errors of their ways, like the waste of life, the lost friendship and the wasted time. They both then decided to unite under Guthix.",
    "You would.",
    "Anything else?",
    "BE GONE!",
    "You have your answers, now go away!"
  ],
  "Blanin": [
    "That I am. Why? Has he killed one of your family?",
    "Oh good, how can I help you?",
    "I'm afraid he's not easy to talk to, so it's good that you came to see me. You'll need to remember a few things when talking to him.",
    "You must be firm with him and don't mention that I sent you. In case he asks, he wields an iron mace in battle, eats rats for breakfast, kittens for lunch and bunnies for tea! His favorite drink is red spider blood, he's 36 years, 8 months and 21 days old, studies famous battles of the Fourth and Fifth ages, lives on the northeast side of town and his, erm... pet cat is called Fluffy.",
    "I know this sounds strange but Dron won't talk to anyone unless they know him well - he's a secretive guy.",
    "Making progress?",
    "Sure. You must be firm with him and don't mention that I sent you. In case he asks, he wields an iron mace in battle, eats rats for breakfast, kittens for lunch and bunnies for His favorite drink is red spider blood, he's 36 years, 8 months and 21 days old, he studies famous battles of the Fourth and Fifth ages, lives on the North East side of town and his, erm... pet cat is called Fluffy.",
    "Just remember those points when you speak to Dron. He's nearby, so you should still be able to find him.",
    "Glad I could help."
  ],
  "King Lathas": [
    "I see.",
    "I had no idea that place had any value at all! All this about my great-grandfather and Jorral's plans to make it into a museum makes for a convincing case.",
    "Very well, I will comply with his request. Take this letter back to him with my kind regards.",
    "Have you taken that letter to Jorral yet?",
    "Very well, take another."
  ],
  "Congratulations! You have completed": [
    "'Making History' - Complete this Intermediate quest.",
    "'Complete History of Droalak' - Free Droalak after 'Making History'."
  ],
  "Main article": [
    "Transcript:Meeting History",
    "Transcript:Shield Display",
    "Transcript:Large Display"
  ],
  "Main articles": [
    "Transcript:Bookcase (Outpost), Transcript:The History of the Outpost, Transcript:The Times of Lathas,  and Transcript:The Mysterious Adventurer"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Making_History?oldid=36010410’"
  ]
}