{
  "Death": [
    "I sense Rasial's plan is close to fruition. Be prepared, he will be coming for us soon enough...",
    "Rasial has returned to the City of Um. He awaits you upon the bridge.",
    "Now is the time! Take the fight to Rasial in his citadel above! Save the souls of this city!",
    "Before we talk, you should free up some room in your backpack.",
    "Well done, Player. I knew you were the right person for this task. I felt the shift even from my office. How did things end?",
    "Yes, he always was, even in life. It's only gotten worse since his death.",
    "He was amoung the first settlers with Guthix, as was I. Of course, I didn't survive here for too long, as you well know.",
    "I was the first to die; he was the first to be murdered. Guthix had plans for us both.",
    "He was once tasked with protecting the rune altars. In life, he was ever both a student and a teacher. His thirst for knowledge led him down a different path.",
    "Guthix did not tell him everything of magic, but Rasial learned of his own accord, in time. He felt betrayed, untrusted - that was the beginning of his downward spiral.",
    "That being?",
    "Icthlarin will be pleased to hear that. He was very worried about this development with you.",
    "One world-ending threat at a time, Player. I do not feel that threat is imminent. We have plenty of time to prepare. Indeed, it may never come to pass.",
    "I think, possibly, that is all Rasial was truly hoping to achieve...and it seems as if he has succeeded, by preparing you. Perhaps there remains hope for him yet.",
    "By all means, continue to develop as a necromancer, though be mindful of necromancy's corrupting influence."
  ],
  "Player": [
    "Rasial! Why are you here?",
    "Test me? Is this all just a game to you?",
    "Wait, you've just been waiting for me to build back Um's population?",
    "I need you to take me up to Rasial's citadel. I'm going to finish this once and for all!",
    "I've come to face you, Rasial!",
    "Hermod again!",
    "I'm going to guess you measure that in centuries?",
    "I can clean up my own messes, thanks.",
    "Unlike you, I don't force the dead to do my fighting for me; they choose to fight by my side. It wasn't MY power that defeated you, it was OURS.",
    "Wait, you were being serious calling this a test? I was never in danger?",
    "Wait, what? Wars to come? Universe?",
    "Well, I guess I'm not getting more out of Rasial. Besides, Death is going to want to know about all of this. I should head back down to the City of Um.",
    "I managed to destroy Rasial's physical body. He manifested as a giant, ghostly, floating head. He was shocked at first, then laughing.",
    "You know, he's really condescending.",
    "Are you finally going to tell me about him?",
    "Guardians. What exactly was he a guardian of? What went wrong with him?",
    "It seems not completely. All this talk of shadows, protecting this universe... At the end, he suggested he was just teaching me how to be a strong necromancer.",
    "I only beat him because I managed to achieve something he never has.",
    "I found more strength from my undead friends choosing to help me fight, unlike Rasial who enthralls and controls them.",
    "How worried do we need to be about these shadows Rasial kept going on about?"
  ],
  "You do not meet the requirements to start": [
    "'Alpha vs Omega'.",
    "'Alpha vs Omega'."
  ],
  "Kharen": [
    "Oh, fine, I suppose. Just let me know when you want to go.",
    "Shall we depart?"
  ],
  "Rasial, the First Necromancer": [
    "You and what undead army, huh?",
    "Face MY army first!",
    "Hermod!",
    "ARGH! How....how is this possible?",
    "How could this be? You have destroyed my physical form! Do you know how long it takes me to reform that?",
    "You fool! I was trying to clean up your mess. I may not be able to return in time to stop the shadows; you've set me back too long.",
    "How did you even achieve this? I have been studying necromancy since the First Age! You are but a fledgling. It takes many lifetimes to amass such undead power.",
    "Aha! So, that's the secret! Finally, you have shown me how to access the truest form of necromantic power.",
    "I had given up hope, wasted so much time on petty and selfish necromancers of ages past. Of course it would take a fellow guardian to truly understand.",
    "I am pleased my lessons have taught you to be so strong. Perhaps you CAN clean up your own messes... Certainly, you are beyond my aid, now that I am without form.",
    "Have no doubt, I would have consumed your necromancy knowledge and enacted my plan if you had not bested me. Someone has to step up to protect this world; I just assumed that meant me.",
    "I am not, however, displeased with this outcome. It is rare that I underestimate someone.",
    "Congratulations, you win. I am true to my word; I shall release the undead from my thrall.",
    "Good luck, you will need them in the wars to come. Perhaps we shall meet again in a future age, should you not fail to preserve this universe.",
    "*maniacal laughing*"
  ],
  "Rasial": [
    "I think, perhaps, it is finally time to test you.",
    "Hahahahaha. Nowhere near.",
    "Rise, my minions!",
    "Suffer at my hand!",
    "Join us....in death!",
    "This is true power!",
    "Ha! No more games!",
    "I shall reap your soul!"
  ],
  "Congratulations! You have completed": [
    "'Alpha vs Omega' - Complete this quest."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Alpha_vs_Omega?oldid=36215050’"
  ]
}