{
  "Aster": [
    "Greetings, your grace.",
    "Your grace, we have received an urgent request from the king.",
    "Indeed it is. Alas, I must warn you, the nature of this request may be distressing.",
    "King Roald requests we host a banquet at Fort Forinthry to commemorate your appointment as a [title].",
    "The royal family will be in attendance, as well as select members of the nobility.",
    "Pardon me your grace, but have you met the other dukes and duchesses? The Misthalinian nobility?",
    "Or the queen, for that matter...",
    "It is customary for all newly appointed nobles of your station to do so.",
    "Still, the political machinations of the nobility are not a matter to be taken lightly.",
    "Be prepared for backstabbing, betrayal, underhanded deals and a plethora of sarcastic jabs and passive aggressive remarks!",
    "I suppose such antics are commonplace for one with as colourful a past as yourself.",
    "I can't deny the appeal. The thrill of political intrigue, seduction, ambition and scandal does pique my interest.",
    "It's the backdrop of volumes twelve through seventeen of 'Murder in Ardougne'! The best mystery series in Gielinor, I'll have you know.",
    "Hopefully our soirée involves less bloodshed than the one in volume fourteen...",
    "With your leadership, I'm confident it shall.",
    "Exactly. This banquet is our formal introduction to Misthalin's political landscape. It must be flawless.",
    "I'm content leaving that manner of entertainment to my books.",
    "There are several preparations that must be made in order for us to accommodate a banquet of this magnitude.",
    "We will need to construct a kitchen for the fort, recruit a building manager and gather supplies.",
    "Speak with Bill. I believe he has plans for a kitchen extension to the town hall.",
    "I shall look into recruiting a building manager for the new kitchen and direct our staff to gather produce from the local area.",
    "Understood. But I would ask that we discuss this matter at your earliest convenience.",
    "Greetings, your grace.",
    "Greetings, your grace.",
    "Greetings, your grace.",
    "I shall look into recruiting a building manager for the new kitchen while you handle the construction.",
    "I have also sent our staff to gather what produce they can find in the local area.",
    "Greetings, your grace.",
    "I have contacted several promising candidates for the new building manager position. Might I recommend my sister, Bianca?",
    "She is a highly skilled cook, having worked for the Varrock palace in the past. She is able to arrive in time for the feast.",
    "Marvellous. Our staff have been scouring the local area for produce. There is little edible here, but we have a few options.",
    "There is poisonous hollyhock gathered from the local fauna and a large quantity of meat of dubious origin.",
    "Gifts of food and drink are customary, so what we have gathered thus far should suffice.",
    "I took the liberty of sending invitations ahead of time.",
    "Meet me by the front gates when you are ready to greet our guests.",
    "Greetings, your grace.",
    "You should find means to continue our soirée in the courtyard, your grace.",
    "We are all prepared to start the banquet, your grace.",
    "I believe I hear the king's retinue approaching. They should be here in but a moment...",
    "Introducing King Roald Remanis III of Misthalin and Queen Ellamaria.",
    "We do not currently have any troops stationed here, your majesty.",
    "May I ask who accompanies you this evening?",
    "Please, make your way inside. The other guests will join us shortly.",
    "And our new kitchen manager should be here any second...",
    "Introducing our new kitchen manager and my dear sister: Bianca.",
    "It certainly has. How are you faring, Bee?",
    "What happened?",
    "Bee is one of the best cooks in Misthalin. This banquet will go swimmingly.",
    "In the meantime, I believe we have more guests approaching...",
    "Introducing Duke Cole Hoarse, Lord Rodney Midas and... 'Princess'?",
    "Welcome to Fort Forinthry, your grace. I-",
    "I suggest you join the king and queen inside the townhall. Our final arrival should be here any moment.",
    "Introducing our final guest, Duchess Hyett of Lumford.",
    "You are the last to arrive, your grace. Our other guests are already inside.",
    "O-oh! I...fear that wouldn't be in keeping with the spirit of the banquet, your grace.",
    "That is the last of our guests. Do not say I didn't warn you.",
    "I trust that you are not including me in that, your grace.",
    "Bianca and myself will prepare the feast. I advise you take this opportunity to converse with our guests.",
    "Remember, all eyes are upon us. This is our formal introduction to the Misthalinian political scene.",
    "To put it plainly, don't mess it up!",
    "His majesty is unable to consume the entrée Duchess Alba brought, therefore-",
    "Pardon me, your grace, but the dish does not have-",
    "Please allow me to fulfil his request, your grace. If this is what the good duke wants, we will accommodate him.",
    "By all means, your grace. The good duke shall have what he requests.",
    "Sincerest apologises, your grace. We will see it done.",
    "Try to acquaint yourself with each of our guests, if possible. Strong first impressions are vital.",
    "You will find King Roald, Queen Ellamaria and Lady Ruthven on the balcony above us, up the stairs.",
    "The feast is ready to be served. Shall I call our guests to the table?",
    "Agreed. No-one can be allowed to leave or enter Fort Forinthry until we uncover what happened here. And whomever is responsible.",
    "We must lock down the fort. No-one can be allowed to leave or enter Fort Forinthry until we uncover what happened here. And whomever is responsible.",
    "If the duke was indeed poisoned...the only people with access to the meal or his person are in this very room.",
    "Each of you ate the same banquet as him, did you not?",
    "We have a murderer in our midst. Of that, I am certain.",
    "It would appear my many years of experience analysing mystery novels may be put to practical use.",
    "Together, I'm confident we can solve this heinous crime.",
    "Yes, you're right. This isn't fiction- it is a serious crime. I apologise for indulging in a flight of fancy.",
    "Still, I shall endeavour to be the best assistant I can in this investigation.",
    "O-of course, your grace. Still, I shall endeavour to be the best assistant I can in this investigation.",
    "Our suspects...pardon me, our guests, have disseminated throughout the fort. Though it took some convincing on Rodney's part.",
    "'Interrogate' carries strong connotations, but I would deem some questioning appropriate, given the events that have unfolded.",
    "Additionally, there is surely evidence pertaining to the crime scattered across the grounds of the fort.",
    "It is rather embarrassing, but I happen to possess a 'mystery journal' I used to solve mysteries as a child.",
    "Perhaps it will assist us in keeping track of the various clues and information we discover.",
    "You do not appear to have space for it on your person at the moment. Please make room in your backpack.",
    "We need to figure out who was responsible for killing Duke Hoarse by collecting clues.",
    "You can use the mystery journal I gave you to track how many clues you have found, and how many are left to find.",
    "Based on my extensive murder mystery knowledge, we should be able to find some clues on the grounds of the fort and some by speaking to the suspects.",
    "You can also link certain clues to the suspects. Linking a clue to the correct person will unlock further clues.",
    "Simon wrote instructions detailing how to create poison detection potions in the mystery journal. We should brew some and test the duke's meal to find out what was responsible for killing him.",
    "I am quite fond of reading in general, your grace. The intrigue and compelling drama of mystery novels just happens to make them my favourite.",
    "The 'Draynor Mysteries' series in particular has the distinction of being what inspired me to become a steward.",
    "I was...an outcast, as a child. Aside from my dear sister, reading was my one escape from the cruelty of the world.",
    "The steward in 'Draynor Mysteries' was charismatic, respected, helpful. I strived to be that.",
    "The aesthetic also appeals to me.",
    "Let us continue our investigation.",
    "The duke was an unpleasant man, but he did not deserve this.",
    "Be careful. It is highly likely that a portion of the duke's meal was poisoned.",
    "With the instructions Simon gave us we should be able to determine if a portion of the duke's meal was poisoned.",
    "Is that jewellery I spot? What is it doing inside this half-buried box?",
    "We should ask around.",
    "One cannot ignore the possibility that there was foul play involved with this gift.",
    "Indeed. I can assure you that it is not part of my collection.",
    "A red herring, perhaps? Or a plant... whatever the case, finding the owner only serves to benefit us.",
    "Perhaps that is not the wisest thing to announce at this time, your grace.",
    "A page also seems to have been torn out...how peculiar.",
    "In the notes it says that we need to add a trace amount of the poisonous substance we want the potion to detect before heating it.",
    "It was due to 'creative differences', if I recall correctly?",
    "Your dancing is marvellous, Bee. I remember when we would dance in the creek behind our cottage as children.",
    "...",
    "We were raised in Lumford. It is a lovely town, and her grace always went above and beyond for us.",
    "I suspect the [title] is already aware of that.",
    "Did you notice anything else? Any of the other guests acting strangely? Anything that seemed out of place?",
    "Was there anything unusual about the pâté?",
    "If I may be so bold, what is troubling you, your majesty?",
    "If only we could understand what she is saying.",
    "Do you suspect Lord Rodney?",
    "Pardon me, your majesty, but that sounds dreadful. Every life taken is a tragedy.",
    "I'm sorry Lord Rodney, truly, but we cannot risk someone tampering with the body.",
    "And several of your spouses lives appear to have been cut tragically short. One cannot help but speculate that you were responsible.",
    "If what you say is true then perhaps it would be in the people's best interests for you to remained unwed.",
    "Not checking the food as well somewhat defeats the purpose, does it not?",
    "Anything, you say?",
    "According to Simon's instructions we first need to add a small amount of the poisonous substance we are attempting to detect to the base potion.",
    "This potion is unfinished. According to Simon's instructions we need to apply heat to activate it.",
    "Might I suggest the range in the kitchen?",
    "Nothing happened. Perhaps we should use a different combination?",
    "Nothing happened. Perhaps we should use a different combination?",
    "It's bubbling, as described in Simon's notes!",
    "Nothing happened. Perhaps we should use a different combination?",
    "I shall ensure that poisonous pâté is disposed of post-haste.",
    "I believe we have uncovered all we can for now. Let us discuss our findings in private.",
    "We should be able to discuss our findings in private here.",
    "Either he is lying to us or he was set up.",
    "I would never have dreamt that she would resort to-",
    "I am unharmed, your grace. Fortunately our assailant merely incapacitated me.",
    "This is just like that scene in 'Mute Witness' where-",
    "Ah, that reminds me! We should inspect the assassin's body for evidence.",
    "We should inspect the assassin's body for evidence.",
    "'Remember, we need the steward alive'...what do I have to do with this?",
    "And it says 'I'll open the gates'...",
    "Leave this unsightliness to me, your grace. I'll get it tidied away soon enough.",
    "No...I don't believe that is possible. They had no access to his meal, and were preoccupied fighting the [title] when the gates were opened.",
    "One would hope I was never a prime suspect to begin with.",
    "Though given the frequency at which stewards are responsible for such crimes in fiction I understand the suspicion.",
    "Was one of our guests attempting to destroy evidence?",
    "Someone was trying to destroy it! But why?",
    "This iconography...I can't say I've ever seen anything quite like it.",
    "We need to figure out who was responsible for killing Duke Hoarse by collecting clues.",
    "You can use the mystery journal I gave you to track how many clues you have found, and how many are left to find.",
    "Based on my extensive murder mystery knowledge, we should be able to find some clues on the grounds of the fort and some by speaking to the suspects.",
    "You can also link certain clues to the suspects. Linking a clue to the correct person will unlock further clues.",
    "We should ask Queen Ellamaria if what Lord Rodney said about her being friends with Bianca when she was younger is true.",
    "We should try linking the amulet Lady Ruthven gave us to Princess.",
    "Princess seems to think there are secrets buried throughout the fort. Ask her for directions and see where it leads us.",
    "I have mostly been odd-jobbing, truthfully. As you no doubt noticed when we first met at the Blue Moon Inn.",
    "People are quick to judge. Particularly for one such as myself, who may not fit ones[sic] preconceived image of a steward.",
    "That Bill recommended me for this position is something for which I shall forever be grateful. It is the highest station I have held.",
    "Thank you for entrusting me with it, your grace. I will not squander this opportunity.",
    "I would like to continue referring to you as 'your grace', your grace. If that is acceptable. It feels...right.",
    "Let us continue our investigation.",
    "I cannot believe it escaped my notice that your friend 'Ella' from Varrock was none other than the queen herself!",
    "Did you notice anything out of the ordinary at all?",
    "May I ask what transpired between you and the Remanis family?",
    "Let us leave the duchess alone, your grace. We have already acquired the information we need.",
    "Calm yourself, father. The beasts have long been dealt with.",
    "That is...quite the theory. How did you arrive at this conclusion, pray tell?",
    "We should utilize[sic] the amulet of spanielspeak Lady Ruthven leant[sic] us.",
    "Why was that?",
    "I...do recall Bianca mentioning a friend named 'Ella'.",
    "But it never once occurred to me that said friend was Queen Ellamaria herself!",
    "This could be the breakthrough we have been searching for!",
    "I believe we have discovered all the evidence we can. We should share our findings with King Roald and Queen Ellamaria.",
    "Shall I gather our guests in the courtyard?",
    "As you wish, your grace. It's wise of you to carefully consider all the evidence before making an accusation.",
    "Simon's satchel seems like an appropriate place to start. How did it end up in the courtyard? Why was a page torn out of the book?",
    "That does not align with what we uncovered. Simon claimed that when the king and queen's retinue was attacked, he lost the satchel in the commotion.",
    "If the murderer arrived afterwards, they could have discovered the satchel on their journey.",
    "They likely removed the page detailing how to brew poison detection potions and placed the satchel in the courtyard in an attempt to frame him!",
    "That would make sense if it was Lord Rodney who committed the murder. But I am not convinced...",
    "I do not believe King Roald was their true target. I posit that they knew the king required a custom dish and that Simon only tested his beverages.",
    "But they cannot have expected Duke Hoarse to insist on being served the same dish.",
    "I must have served the poisoned pâté that was intended to kill King Roald to Duke Hoarse by mistake!",
    "The note we found on their body read: 'remember, we need the steward alive'...why did they need me alive?",
    "Protect me?",
    "I do not see how that could be the case.",
    "What if the purpose of that line was to ensure that I was not harmed in the attack?",
    "But why would the murderer care for my wellbeing?",
    "It is possible that the desired outcome of their crime was not power, or to take revenge on King Roald himself, but to scorn Queen Ellamaria.",
    "She cares for her husband more than anything in the world and the Zamorakians offered the murderer a means of eliminating him.",
    "You know it cannot have been me your grace. I was with you when the assassin attacked! I could not have opened the gate.",
    "You would accuse the king himself? Please rethink this decision, your grace!",
    "You would accuse the queen herself? Please rethink this decision, your grace!",
    "Rodney is certainly a questionable character, but I do not believe he holds any resentment towards the queen.",
    "The duchess definitely has a motive and has made her disdain for the Remanis family clear.",
    "But given the role Zamorakians played in her son's death I cannot envision her working with them willingly.",
    "Lady Ruthven is certainly an enigmatic and suspicious character but I do not see what she had to gain from any of this.",
    "The dog?",
    "Please do not tell me you were persuaded by Lady Ruthven's ludicrous theory...",
    "...",
    "You admitted to finding jewellery belonging to Queen Ellamaria strewn along the King's Road. It stands to reason that you also discovered Simon's satchel.",
    "You know about hollyhock and how to utilize[sic] it in your culinary work. You knew Simon merely tested the king's beverages from your time working at the palace.",
    "That the assassin was ordered not to harm me...your soured relationship with the queen...",
    "I do not want to believe it Bee, but...I cannot deny the evidence.",
    "Better? You murdered two innocent people!",
    "No! Player, please...I know that her crimes cannot be forgiven, nor forgotten. But the punishment for treason is-",
    "Pardon me your grace, but I... I need some time to myself.",
    "Greetings, your grace.",
    "It is good to be back. I see that the post-banquet cleanup has been meticulously executed in my absence.",
    "Well, your grace, all things considered. Please do not worry about me.",
    "It was wonderful to have the opportunity to live out a real murder mystery. Even if the end result was more akin to a nightmare than a dream.",
    "To think that Bee murdered two innocent people. How little I knew about her situation...could I have prevented it getting to this point?",
    "I will miss her.",
    "But I am more than ready to resume my managerial responsibilities here. Speaking of which-.[sic]",
    "Lord Rodney would like to have a word with you. You will find him in the kitchen.",
    "Lord Rodney is waiting for you in the kitchen."
  ],
  "Player": [
    "If the request is from King Roald it must be important.",
    "What is it?",
    "That doesn't sound particularly distressing.",
    "Why do we need to throw a dinner party for the king again?",
    "I'll speak to Bill then. He should be at the workshop, as usual.",
    "I don't have time for this right now.",
    "Several of the kingdom's nobility will be attending, apparently. As well as the king and queen themselves.",
    "Thanks Bill.",
    "I'll get working on that kitchen.",
    "Sounds good to me.",
    "Let's hope our guests bring additional supplies with them.",
    "Should we be concerned about these cultists targeting the banquet?",
    "Pleasure to meet you both.",
    "I have no business using this right now.",
    "Door won't budge.",
    "That sounds like quite a novice mistake for a master alchemist.",
    "I wonder how the banquet preparations are going. I should speak to Aster.",
    "How's the banquet coming along?",
    "I'm doing the best I can with what resources I have at my disposal.",
    "I didn't see you offering any resources to assist with the construction of this fortress.",
    "Perhaps your people deserve better than you.",
    "...",
    "...and, after the dragonkin killed Lucien, we again hid the Stone of Jas.",
    "...and that was how the Stone of Jas was destroyed and Sliske met his end.",
    "...and that's how I prevented the Elder Gods from destroying Gielinor, once and for all.",
    "...and so, I re-established the edicts, in order to stop Zamorak from taking over Gielinor.",
    "...together we tracked Bilrach deep into the Wilderness and ended his scheme.",
    "I have a few...",
    "I'll work with you, but you aren't above suspicion yourself.",
    "Search for clues and interrogate the suspects. Got it.",
    "Let's get to work.",
    "What should I do next?",
    "What is it about mystery novels that has you so enamoured with them?",
    "Really?",
    "We'll find out who's responsible.",
    "This stuff looks incredibly valuable. Fit for a queen, you could say. I wonder if it was stolen.",
    "You'd think it would be common knowledge among the nobility that King Roald has a severe nut allergy.",
    "We should investigate.",
    "'How To Poison Dummies For Dummies'. There's a conspicuous title for a book if I ever saw one.",
    "We need to figure out who that book belonged to.",
    "'Amon Ra'? What a peculiar name. Morytanian, perhaps.",
    "Well, that can't be good for your health. (But I shan't beat you over the head with it.)",
    "The firing pin's jammed, and there's an odd smell to the gunpowder...raspberry? No, cadavaberry.",
    "Did you notice anything suspicious in the kitchen?",
    "Did you notice anything suspicious during the banquet?",
    "Is that all you have to say on the matter?",
    "Did you notice anything suspicious this evening?",
    "Don't worry. We'll get to the bottom of this.",
    "Do you know any good rumours about the Misthalinian nobility?",
    "Why was Duke Horacio unable to attend this evening?",
    "Did you notice anything suspicious during the banquet?",
    "Do you know why Duke Hoarse may have been targeted?",
    "Thank you for your time.",
    "Alba doesn't strike me as being particularly cooperative.",
    "You wouldn't happen to have any idea who killed the duke, would you girl?",
    "Did you notice anything suspicious during the banquet?",
    "Thank you for your time.",
    "You seem quite calm given everything that's happened.",
    "[The answer that was selected the first time.]",
    "Did you notice anything suspicious while you were in the kitchen?",
    "Tell me about your relationship with the duke.",
    "You seem to have had many previous marriages.",
    "Did you notice anything suspicious prior to the feast?",
    "You paid a lot of attention to what was going on in the kitchen.",
    "Do you also test the king's food, or are you strictly a wine taster?",
    "Let's check the kitchen.",
    "The duke's pâté was poisoned using hollyhock. Just as I suspected.",
    "The roof of the townhall seems like a sensible choice. Let's head there.",
    "Simon's satchel was found in the courtyard and contained a suspicious book with one page missing.",
    "He claims he lost it when the king's retinue was attacked along the king's road.",
    "Alba brought the nut roast to the banquet, ensuring that the King required a custom dish. The duke requested it as well, out of jealousy.",
    "It's possible that the plates were mixed up, and the pâté that killed Duke Hoarse was meant to be served to King Roald.",
    "We also found a hastily buried box containing the queen's jewellery. Bianca admitted to finding it along the King's Road and taking it for herself.",
    "Watch out!",
    "Aster! Are you injured?",
    "We should check on the guests.",
    "What's this?",
    "We should check on the guests.",
    "I've already read the assassin's letter. There's nothing more of interest on the body.",
    "What happened here?",
    "Were several of the king's guard not stationed at the north gate?",
    "While we were discussing our findings on the roof of the townhall, Aster and myself were beset by an assassin wearing the armour of the king's guard.",
    "Were any of the king's guard unaccounted for?",
    "Aster was with me the entire time. I know they can't have opened the gate.",
    "This note we found on the assassin's body indicates that the person responsible for poisoning the duke opened the gates.",
    "They now have the blood of two people on their hands.",
    "Station more of the king's guard at the north gate and ensure the suspects are under surveillance at all times.",
    "This parchment is still warm. It must have only recently fallen from the fireplace.",
    "'of Duke Cole Augustus Hoarse'... 'duchy of Edgeville and fortune are to be inherited by'...",
    "There's what appears to be a list of assets beneath, but that's all I can make out. This is clearly the late Duke's last will and testament.",
    "What's this? It looks like a wax seal that would have been used on a letter.",
    "We need to find out who has been receiving letters in private.",
    "Can you tell me... what makes candles tick?",
    "I hoped this would be a useful clue.",
    "Tragically, I cannot add it to my tool belt.",
    "What should I do next?",
    "What sort of of places have you worked for previously?",
    "You don't need to be so formal with me, Aster. You can call me Player.",
    "Very well.",
    "You're welcome.",
    "You'd better be.",
    "Where were you when the monsters attacked the fort?",
    "Sounds like a lead.",
    "We found this wax seal back there. Perhaps Iris can tell us more about it.",
    "Where were you when the monsters attacked the fort?",
    "Where were you when the monsters attacked the fort?",
    "What's your theory, then?",
    "That's certainly a...unique take on events.",
    "Do you have any idea who could be responsible for opening the gate?",
    "You mentioned that Ellamaria saved you from the dark beasts.",
    "This is her majesty the Queen, Princess.",
    "You slew all three of those dark beasts by yourself?",
    "Rodney told me you were friends with Bianca before you became queen.",
    "I see.",
    "Do you know anything about the assassin who was disguised as one of your guards?",
    "Where were you when the monsters attacked the fort?",
    "Right...",
    "What went on between you and Ellamaria?",
    "Bianca?",
    "I wonder what Ellamaria has to say about this. We should ask her about it.",
    "Perhaps, but this 'treasure' isn't going to help us find who hurt your father.",
    "Fine work, princess.",
    "Let's review the evidence...",
    "Simon told us that when the king and queen's retinue was attacked by cultists along the King's Road he lost his satchel in the commotion.",
    "The murderer must have arrived afterwards, finding it by the side of the road while making their way to the fort.",
    "They tore out the page detailing how to brew poison detection potions and dumped the satchel in the courtyard to frame him.",
    "King Roald was their true target. They knew that he would be eating a custom dish and that Simon only tested his beverages, not his meals.",
    "But they did not expect the duke to insist on having the same dish as the king.",
    "The plates were mixed up when Aster was serving the table and the poisoned pâté was served to Duke Hoarse by mistake.",
    "The assassin was assigned to the murderer by their Zamorakian benefactors as a last resort should subterfuge fail.",
    "I suspect the person who wrote that note was trying to protect you.",
    "It wasn't about you, your majesty. Not really. The sole target of their scorn is Queen Ellamaria. The Zamorakians offered the murderer a means of destroying that which Queen Ellamaria cares about most. You.",
    "Let me think...",
    "Let me think...",
    "Let me think...",
    "Let me think...",
    "Let me think...",
    "Let me think...",
    "Let me think...",
    "It was Bianca.",
    "Thanks, Alba.",
    "No secret in the kingdom is safe from you, is it?",
    "I know it won't bring him back, but at least the person who poisoned your father will face justice.",
    "Thank you, your Majesty.",
    "What will you do now?",
    "Good luck, Rodney.",
    "How are you feeling, Aster?",
    "Rodney? I wasn't expecting that.",
    "It's good to see you again, Princess.",
    "What are you doing here?",
    "How did she die?"
  ],
  "Bill": [
    "Hey there mate. Oh! Uh...I mean, your grace. Aster told me we need to host a party for some big-wigs coming over from the capital?",
    "Blimey! It'll take quite the kitchen to cook a feast worthy of that lot.",
    "Luckily I've been drawing up some blueprints for a kitchen extension to the townhall. This should be just what we need.",
    "Take a look at the table and see what you think.",
    "Never been to something like this before. I should of worn my fancy apron.",
    "Are gruesome murders common at these sort of things? The queen seems pretty calm about all this.",
    "One of them beasts almost bit my bloody ear off! Never thought the queen herself would be swooping in to save my rear-end.",
    "Can't believe our new chef was behind it all. Who's gonna manage the kitchen now?"
  ],
  "Queen Ellamaria": [
    "[Title] Player! There you are.",
    "Skip the pleasantries, [title]. We need to talk about the lax security along the King's Road. Our retinue were beset by cultists less than a mile from your gates.",
    "Perceptive enough to notice the cultists that beset our retinue along the King's Road. Less than a mile from your gates, no less.",
    "We need to talk about the lax security along the King's Road. Our retinue were beset by cultists less than a mile from your gates.",
    "I have a feeling our retinue has now patrolled that route more times than your troops.",
    "A fort in the wilderness with no guards? Be thankful that we brought several of our own with us.",
    "Not that it was enough to save the wine.",
    "Tch. It is a FEAST, Roald. Forinthry is hardly known for its bountiful harvests.",
    "If I must share my table with these people, we can at least bring the mead.",
    "Hah! I'd like to see them try.",
    "This fort is in perpetual gloom, is surrounded by monsters and it feels as though demons could invade at any moment.",
    "I find myself reminiscing about the years prior to becoming queen.",
    "Enough, Iris.",
    "Oh, it's you...Beatrice, is it?",
    "Ah. Right. I have high expectations for the feast tonight. Don't disappoint me.",
    "Watch yourself, Alba.",
    "That you had grain stores at all speaks of the excess food Lumford hoarded while the capital starved.",
    "I was also quite the accomplished warrior back in my day.",
    "Don't you dare-",
    "[Title] Player, this heinous act took place within your walls.",
    "You have until sunrise to discover the perpetrator's identity, and see that they are dealt with.",
    "Do not fail us.",
    "Do not fail us, [title].",
    "It is a shame the feast was cancelled. So much good food and drink, gone to waste.",
    "Aside from the duke of Edgeville writhing and screaming as he died at the table? Not particularly.",
    "The man goes through spouses as quickly as I go through undergarments and always seems to come out better off for it.",
    "But to murder the duke of Edgeville in such a manner...I find it difficult to believe that he would do such a thing.",
    "I've seen many assassinations in my time. And countless failed attempts at my own life. Eventually you become desensitised to it.",
    "Is it? I do not revel in death, but it is a fact of life. Let me tell you a truth I learnt from my years adventuring.",
    "[Title] Player, you are a renowned adventurer. Tell me, why do you do what you do?",
    "A noble goal for certain, but it is not sustainable.",
    "A noble goal for certain, but it is not sustainable.",
    "Good. This is what I'm talking about.",
    "Good. This is what I'm talking about.",
    "Understandable. I will not press you for an answer.",
    "[Response as above.]",
    "Many aspire to 'save the world'. My husband is one of them, bless him.",
    "But there is no such thing. You can end a single threat, but a new one will always rise.",
    "For every person you save, there will be another three you can't.",
    "If that is your reason for heroism, each loss will weigh on you. Every new threat is a devastating blow. It burns you out.",
    "But if you selfishly enjoy the act of heroism, revel in the glory and the thrill of battle, you can push forward without regret.",
    "Don't disappoint us, Player.",
    "Nothing is happening to you while I'm here, Roald. Nothing.",
    "Such a lapse in security is unbecoming of you, [title]. Explain yourself.",
    "There was an assassin hiding among our contingent? Damn it! Such carelessness should be beneath me.",
    "Heh, this is a good girl, isn't she? Reminds me of the labrador I had as a child.",
    "This night has been an interesting one, that much is certain. But my patience is wearing thin.",
    "It was nothing, I assure you, merely some old tricks from my monster hunting days. They were clumsy, lumbering things. Quite simple to strike down.",
    "My bladework certainly isn't what it used to be, having been dulled by years of political posturing and a lack of practice.",
    "The cook? Yes, we knew each other. Back when I was sheering sheep and baking cakes for the duke of Lumbridge to make a living.",
    "You could say we were close, once. It's why I agreed to hire her as our personal cook after I married Roald.",
    "But she left our service on bad terms.",
    "She destroyed a family heirloom of ours. Claimed it was an accident, of course. Ha! Likely story.",
    "She believes that I became queen by chance. That Roald simply plucked me from the streets of Varrock and made me his bride because he admired my beauty.",
    "That had Roald seen her first she might have been 'chosen' instead.",
    "I already spoke on that matter, [title]. I shan't repeat myself.",
    "Roald and myself were just discussing this. We know not the identity of said guard, nor how they infiltrated our retinue.",
    "Mark my words, I will be having a 'talk' with our captain of the guard when we return to the palace.",
    "That I allowed this to happen reflects as poorly on myself as the duke's murder does on you.",
    "Don't disappoint us, Player.",
    "And what of the assassin who infiltrated our entourage?",
    "...",
    "You ungrateful, obnoxious little-",
    "Say the word Roald and I'll execute the sentence right here. Right now.",
    "Tch. Very well. Get her out of my sight.",
    "Well done, Player. You have done an admirable job dealing with this situation.",
    "I honestly believed I was doing her a kindness, offering her a position in the palace. But it only caused her resentment to grow.",
    "It is disheartening to see the young woman I was friends with become a bitter shell of her former self.",
    "Yes...I suppose I have."
  ],
  "King Roald": [
    "I did warn you that such a large convoy would draw attention, my love.",
    "I don't believe so. They were little more than vagabonds, though they bore the mark of Zamorak.",
    "Unfortunately we did lose some of our supplies in the attack.",
    "This is Simon, the royal wine taster.",
    "And the flower of Lumbridge, Iris Ruthven, attending on behalf of Duke Horacio.",
    "I'm pleased to see how much you have managed to accomplish here in such a short span of time.",
    "Not at all. Please, continue.",
    "Thank you for inviting us to this fine fort of yours, [Title] Player.",
    "I sent multiple requests to open conversation on the topic, none of which were returned. My hand was forced.",
    "An attack on a duke of Misthalin is an attack on the kingdom itself.",
    "Nobody leaves until we know who, or what, we're dealing with.",
    "If you cannot, and the fort is deemed unsafe, that could have serious consequences.",
    "To kill a duke of the kingdom before my very eyes...our culprit is bold, that much is certain.",
    "I trust your investigation is proceeding smoothly.",
    "I don't recall seeing or hearing anything suspicious.",
    "I did notice that Duke Hoarse ate the same starter as me, which struck me as odd.",
    "The only reason I had that pâté is because I'm deathly allergic to nuts.",
    "Besides it's[sic]...unique taste? No. The chef did seem to be rather heavy handed with the garlic.",
    "As you witnessed, he could be quite the difficult man. But I do not know what anyone present had to gain by killing him.",
    "I've told you everything I know.",
    "Praying to Saradomin for guidance...though he seems to be remaining silent on the matter, as always.",
    "Perhaps due to the...unique choice of decor in this chapel.",
    "Probably due to the highly inappropriate choice of decor in this chapel. We will need to have a word about this later.",
    "I've been reflecting on Duchess Alba's words.",
    "She is correct that we seized a portion of Lumford's food stores, though they were by far the least impacted by the famine.",
    "It was a somewhat desperate decision, after multiple failed attempts at a diplomatic resolution to our food crisis.",
    "I can understand her reservations. She served my father, King Roald II, as a knight.",
    "He was a cruel and ruthless monarch. The way he treated his subjects and the Hyett family in particular was unspeakable.",
    "I swore not to repeat his mistakes, though the bickering and chaos you saw this evening is hardly beneficial to the kingdom either.",
    "Ellamaria often tells me that I should be less lenient with Alba and the others, but...I am still uncertain.",
    "Please, leave me to my thoughts. You have an investigation to get on with after all.",
    "I have faith in you, Player.",
    "I heard an ear-piercing scream and made my way out of the chapel to investigate, only to find these foul beasts running straight for me!",
    "If it hadn't been for Ella's timely intervention I would have surely met the same fate as poor Simon here.",
    "For a least a while longer, Duchess Hyett. I support the [title]'s call.",
    "So much bloodshed...I pray we have seen the last of it.",
    "I did not leave the chapel until I heard the screams, so I wasn't in a position to see anything noteworthy.",
    "Iris walked behind the chapel at one point. What she was doing there I cannot say, but she seemed to be accompanied by an animal. A bird, perhaps?",
    "My combat skills are- ah- lacking, to put it lightly.",
    "It is not the first time she has saved me and I doubt it will be the last. Her strength is one of the many reasons I fell for her.",
    "I have faith in you, Player.",
    "Ellamaria was proactive in dealing with the troubles of the times.",
    "She went so far as to sneak into formal functions to bring matters to my attention that my advisors dared not.",
    "Her drive and passion is what drew me to her.",
    "We are eager to hear the results of your investigation, [Title] Player.",
    "Most importantly, why do any of this? What was their motive in committing regicide?",
    "What is your conclusion then, [Title] Player? Who is responsible for the murder of Duke Hoarse?",
    "Enough!",
    "In planning to assassinate me she has committed treason against the kingdom of Misthalin.",
    "Calm, dear. She will be sent to the capital and tried for her crimes. However certain the outcome may be.",
    "Fine work, [Title] Player. I knew my faith in you was not misplaced.",
    "We are ready to depart for the capital, once you declare tonight's banquet over.",
    "We all change, dear. Sometimes it is for the better. Sometimes it is for the worse. You've changed a lot since those days as well."
  ],
  "Simon": [
    "P-pleasure to meet you.",
    "To be honest, I'm relieved that we lost some of the wine on the way here.",
    "O-oh, if you are looking for the king and queen they are above us, on the balcony.",
    "I heard the cook is making hollyhock sorbet for dessert.",
    "How on Gielinor do you know that?",
    "I-I do believe he's dead!",
    "Look at the discolouration of his skin; the way he acted. This wasn't a natural death.",
    "W-what if the supplies were poisoned before they were brought here? Or the dessert was not prepared correctly?",
    "I-I pray I do not end up succumbing to the same fate as the late duke...",
    "I-is there something you need?",
    "The food and drink was left unattended for a time, after the cook went to speak to his majesty.",
    "Lady Ruthven left briefly during that period, through the main door of the townhall. To 'powder her nose', she said.",
    "Besides that, I didn't see anything.",
    "W-well, I am the royal wine taster! If something happened it's my life that is on the line.",
    "Watching what happened to Duke Hoarse...knowing that could have been me...",
    "Only wine and other beverages, your grace.",
    "It's mostly about maintaining appearances. Not many outside the royal family's inner circle know how superficial my role truly is.",
    "It's awful, your grace. The queen is a heavy drinker and I am required to check every glass.",
    "It was better when Miss Dunnet still worked with us. She was always very kind to me. Since then I can't help but wonder...",
    "Is this really what my life has become? All I'll amount to?",
    "I'd do anything to be free of this.",
    "W-within reason, naturally. I would never wish any harm upon their majesties. Or the late duke!",
    "I-if you need anything else from me, I'll be here."
  ],
  "Iris": [
    "I'm so excited to be here! My horoscope told me that tonight's party would be 'one for the history books'.",
    "I'm not sure why you're throwing a party for books, but I bet they'll have a wonderful time!",
    "It's a shame my cousin wasn't able to attend, but I'm glad I was granted the opportunity to represent him tonight.",
    "I didn't expect to see Lord Rodney here.",
    "Your Majesty, is it true that you and he-",
    "SO...[Title] Player...I heard that you're a renowned adventurer.",
    "Surely you have a tale you can share with us?",
    "Amazing!",
    "Ooh, I know this game! A play...five words?",
    "Am I going to die?",
    "What if I'm the murderer, and am so skilled at it that I even tricked myself!",
    "Oh! Hello [Title] Player. Did you want to chat?",
    "Yes! The duke of Edgeville died in the middle of the banquet!",
    "Not that I can remember. Sorry.",
    "I can't believe somebody would do something like this.",
    "Ohohohohoho! Do you even need to ask?",
    "I've heard some scandalous things about the De Adlard and Despaard families.",
    "The De Adlard family have been disgraced and exiled from the kingdom!",
    "I've long heard rumours that they were closely linked to Zamorakianism. But they seemed so nice! I always thought they just liked the colour red.",
    "Duchess Hyett was involved, apparently. She's always hated Zamorakians, after what they did to her son.",
    "Lord Reinhard Despaard's eldest daughter has not been seen for many years, and he has always been quiet about her whereabouts.",
    "I heard that she eloped with a thief and that she and her partner are behind many of the high-profile robberies plaguing the capital! Lucky woman.",
    "Where's the gorgeous thief coming to steal me away in the middle of the night?",
    "There was a terrible cake-related incident.",
    "But don't worry. He will make a full recovery. Hopefully.",
    "Good luck with your investigation!",
    "[Title] Player, there you are!",
    "I think I figured out who is responsible for killing the duke.",
    "I was walking past the chapel when I heard the screams.",
    "By the time I arrived in the courtyard Simon and the beasts were already dead.",
    "Princess killed the duke!",
    "Rodney was telling me about his first wife. The witch who transformed herself into a duck.",
    "What if she managed to reverse the spell, but became a dog instead, using her newly acquired puppy dog eyes to ingratiate herself with the duke.",
    "Then she killed the duke to get revenge on him for stealing her ex-husband!",
    "Good luck with your investigation!",
    "Is the murderer another of Lord Rodney's exes?",
    "What about poor Simon? What did he do to deserve this?",
    "So Bianca was the murderer! Who could have guessed? She seemed so sweet.",
    "I can't wait to tell everyone back in Lumbridge what happened!"
  ],
  "Bianca": [
    "Aster! It's been too long.",
    "Times have been difficult since I was fired from my previous job. I really put my foot in it.",
    "Let's just say there was a bit of a tumble...and half the soup I had prepared for dinner ended up on Lord Mews and his wife.",
    "They were less than impressed.",
    "You must be [Title] Player! It's an honour to make your acquaintance.",
    "It seems as though we're already behind schedule. I'd better get to work!",
    "O-of course, your grace. There's a banquet to prepare, after all. I'll get to work right away.",
    "I promise there will be no soup-related mishaps this evening!",
    "Pardon me, your grace, I'm busy preparing the feast.",
    "Excuse me, I'd like to discuss the supplies you brought. Is this a bad time?",
    "Bianca, Your Majesty.",
    "Of course. Please, allow me to take these supplies through to the kitchen.",
    "Should I get him some water?",
    "Are any of us safe?",
    "To think that someone died eating a meal I prepared. It's terrible.",
    "Not that I can recall. Lord Rodney and Duchess Alba were also in the kitchen, but I couldn't see what they were doing.",
    "The dog was there too, but I doubt she was responsible for the duke's death.",
    "Unless...",
    "I've told you everything I know, your grace. I swear it.",
    "There isn't much to say. I've been working as a professional chef for around a decade now.",
    "My first job was cooking for the king and queen, though that was many years ago now. I didn't leave that job on the best of terms.",
    "You could say that. I saw the family heirloom I accidentally broke as salvageable. The queen did not.",
    "It wasn't my first choice. When I was a girl, I wanted nothing more than to be a dancer. But I always had two left feet.",
    "It doesn't matter how much talent you have or how much of yourself you pour into your art if it doesn't put bread on the table.",
    "I hope you can get to the bottom of this.",
    "Simon deserved better than this.",
    "Even when I look away, I cannot stop picturing Simon's body just...laying there in the courtyard. Are none of us safe?",
    "Oh? I thought you knew.",
    "I am forever grateful to her for granting me the opportunity to work for the palace, though we drifted apart over the years.",
    "I was making my way to the kitchen when those monsters appeared! I hid behind the supply cupboard until things died down.",
    "Lady Ruthven was skulking behind the chapel earlier. Whatever she was doing, it looked suspicious.",
    "Simon was a good friend of mine when I was working for the palace.",
    "He knew all too well how stifling that environment can be. He deserved better.",
    "I hope you can get to the bottom of this.",
    "Do you honestly believe I murdered the duke, Aster?",
    "Well done Aster, you and the [title] figured it out. Those fanciful novels of yours prepared you for this, no doubt.",
    "Ask yourself, why do you let these high-born scum lord over you? You're better than this. WE'RE better than this!",
    "The duke was yet another arrogant leech, born into power he neither earned nor deserved.",
    "I didn't plan for the beasts to kill him. He did deserve better; he was a friend.",
    "But he didn't respect himself enough to better his miserable life. I do.",
    "Ungrateful? Should I have sung your praises for being offered the 'opportunity' to serve you and your new husband?",
    "You always thought you were better than me! You don't deserve the throne you were handed."
  ],
  "Duke Hoarse": [
    "Yes, yes. I don't need to hear this spiel.",
    "[Title] Player, I assume? I'm certain you already know who I am.",
    "Indeed I am. Cole Augustus Hoarse, duke of Edgeville. Remember that name.",
    "You don't know who I am? I am Cole Augustus Hoarse, duke of Edgeville, and you would do well to remember that.",
    "What was that?",
    "I am Cole Augustus Hoarse, duke of Edgeville, and you would do well to remember that!",
    "Rodney...",
    "Bleak and dreary, more like it. Poor Princess is practically cowering in fear!",
    "I can't believe the king is throwing resources at this scumhole while my people struggle.",
    "What's this I hear about the king getting a 'special dish' for his appetiser?",
    "If the king is having it, I want it as well. With extra garlic! Make it happen.",
    "You don't think I'm good enough to eat the same food as the king, do you?",
    "I'm pleased you managed to see reason.",
    "'Fine fort'? It looks like a wayward sneeze would topple it.",
    "This is what will protect us from the dangers beyond the wall? Edgeville alone faces incursions on a weekly basis.",
    "My people need - nay, deserve - far better.",
    "What would you ask of me? We lack the time between assaults to rebuild our own defences, let alone divert our resources to this eyesore.",
    "The audacity!",
    "*cough*",
    "*cough*",
    "*cough*"
  ],
  "Rodney": [
    "Please forgive my dear fiancé. It's been a long day, and his patience is wearing thin.",
    "Not that he had much to begin with.",
    "Yes, that's my name, darling.",
    "Rodney Midas. Pleasure to make your acquaintance, Player.",
    "What a lovely little redoubt you have here. It's very...homely.",
    "Ella and Roald are already here, eh? Hah! I bet they'll be overjoyed to see me. Especially Ella!",
    "I've been in plenty of wacky situations in my life, but I never thought I'd find myself north of the wall!",
    "Not necessarily, darling. The plant itself is poisonous, but the roots are perfectly safe to consume when boiled.",
    "In fact, it's quite the delicacy.",
    "My second wife taught me. She was a master alchemist, after all.",
    "Sadly, she accidentally poisoned herself brewing mushroom tea.",
    "She was colourblind my dear, and couldn't tell the blue-spotted bittercaps from the green-spotted ones. It was truly tragic.",
    "Oh, there were several more inbetween...I'm afraid I may have lost count.",
    "Princess! No!Ah, blast it. She's run off to the kitchen.",
    "This is why I'm more of a cat person.",
    "Don't all jump to stop her, now. Just leave it to me. As always. It's fine.",
    "Queen Ellamaria threw everything into her adventures, forgoing all else. She left herself no time for rest, recreation...",
    "...her relationships.",
    "You alright dear? You're shaking...",
    "Cole!",
    "No, it wasn't. I know poisoning when I see it.",
    "My first husband was a mortician. Until he tripped and fell into the cremator.",
    "Are you suggesting I did this?",
    "Forgive me, [title] Player but I...I need a moment.",
    "Greetings, Player. You're here to question me, no doubt.",
    "I was too busy trying to stop Princess over there from causing a ruckus to notice much of anything.",
    "Alba was also in the kitchen, but I didn't see what the old coot was up to.",
    "I know that he doesn't...didn't come across as the most lovable man, particularly at these official functions.",
    "But he was a complicated person. He loved his people and was highly protective of them, as well as Princess.",
    "Though he didn't show it often, he was also highly protective of me. He treated me well.",
    "I wanted to stay with the body, but your dear steward sent me away.",
    "I understand.",
    "You could say that.",
    "Absolutely not! Why would I harm those I love? Through some cruel twist of fate my partners are simply unusually prone to meeting an untimely demise.",
    "Perhaps it is a curse! My first wife was a witch.",
    "Though she was irreversibly transformed into a duck by a backfiring spell, which somewhat limits her curse inflicting capabilities.",
    "Let's not get ahead of ourselves now.",
    "Please, Player, see that whomever did this faces justice.",
    "They must the one who poisoned my dear Cole.",
    "Simon seemed like a nice chap. What a shame.",
    "Where was I? Well...er...you see, I was...",
    "You know, I honestly can't remember. The kitchen, perhaps? All I can say is that I most certainly was NOT in the townhall!",
    "She's loathe to admit it nowadays but we were lovers, once.",
    "She was my first love, you know. Ah, it's something you never do forget.",
    "Things didn't work out between us, as you may have guessed.",
    "She cared, at first. For the world. For people. But as her notoriety grew so too did her ego. She became unbearable.",
    "Don't take my word for it. Ask Bianca.",
    "She and Ella were inseparable back then. Drank the nights away in the Blue Moon Inn together.",
    "Please, Player, see that whomever did this faces justice.",
    "Please, Lady Ruthven, let's not get ahead of yourself.",
    "He cared for the lives of his people, more so than even his own. Not that you could understand you pathetic, selfish wretch.",
    "So it was Bianca...I didn't realise she had been so consumed by jealousy. And my dear Cole was not even her intended target.",
    "I will be returning to Edgeville with Princess. She is technically the duchess of Edgeville. Probably?",
    "[Title] Player! It's simply marvellous to see you again, dear. Under less dire circumstances, it would appear.",
    "Ah. Yes, well, you see...as it turns out, a spaniel is not able to legally inherit a duchy, despite Cole's wishes.",
    "The position was ultimately given to his younger sister. Suffice it to say, she did not appreciate her brother leaving the duchy to his dog over her.",
    "And she never liked me much to begin with.",
    "Both Princess and myself have been banished from Edgeville until further notice. Fortunately your darling steward graciously offered us a position here.",
    "I know a thing or two about cooking, you know! My third wife was a baker...",
    "What? Sharon isn't dead, darling. We parted ways very amicably.",
    "Wouldn't dream of it, dear.",
    "I've been discussing potential improvements to these facilities with your ruggedly handsome blueprint manager.",
    "Hopefully you'll be quite pleased when you see the results!"
  ],
  "Princess": [
    "*happy barking*",
    "*happy barking*",
    "*supportive barking*",
    "*eager barking*",
    "*worried barking*",
    "*mournful barking*",
    "*sad barking*",
    "*conspiratorial barking*",
    "*concerned barking*",
    "*disconcerted barking*",
    "Suspicious thing! Here, here!",
    "Found clue! Found clue!",
    "Suspicious thing! Here, here!",
    "Scary lady smells strange! Must be her! must[sic] be.",
    "Scary lady gives good pets. Nice lady. No. Can't be her.",
    "One more thing hidden. Come with me, come!",
    "Suspicious thing! Here, here!",
    "*proud barking*",
    "Treasure!",
    "More suspicious things over there. Come, come!",
    "Yay! Helpful, helpful!",
    "*shocked barking*",
    "*indignant barking*",
    "*content barking*",
    "*excited barking*",
    "*happy barking*"
  ],
  "Duchess Alba": [
    "Let's get through this as quickly as possible, shall we?",
    "You're [Title] Player. I'm Alba Hyett. Retired knight. Duchess of Lumford.",
    "Pleasure to meet you. So on, and so forth.",
    "Now, can you kindly direct me to the wine so I can get some drinks in me before the circus arrives?",
    "Oh, for the love of Saradomin...",
    "In that case, perhaps you could direct me to the nearest dragon, so that I may be put out of my misery.",
    "Shame. Suppose I'd best get this over with then.",
    "I'm getting too old for this.",
    "Hmm? How interes-",
    "Wait...did you say hollyhock? Isn't it incredibly poisonous?",
    "So Duke Hoarse will be your...what? Third marriage?",
    "I suppose I'll come with you. I need to bring the appetisers I brought to the kitchen.",
    "I'd say they've done quite well for themselves given our king tasked this of them, yet offered nary a stone nor hammer to actually build this place.",
    "And what was King Roald's reason for not offering more support, given it is he who placed the construction of this place on their shoulders?",
    "These are the people to whom our king would grant a duchy? How far we have fallen.",
    "It seems the new [title] knows exactly how to respond to your nonsense, Hoarse.",
    "Not bad for someone who was thrown this land by the king, yet offered nary a stone nor hammer to actually build the place.",
    "No, I don't believe I will.",
    "Don't think I've forgotten what you did during the famine. How Lumford's food stores were seized by the capital while our people went hungry.",
    "I apologise profusely for not responding to the demand to surrender half of our grain stores. How dare I.",
    "That's a legitimately impressive tale.",
    "Locking down the fort because the duke choked on his dinner? This is madness!",
    "You seem suspiciously familiar with poison.",
    "And now the late duke has died in equally suspicious circumstances.",
    "Calm down, Lady Ruthven!",
    "Leave me be.",
    "What do you want?",
    "No.",
    "Yes.",
    "We're a small but prosperous duchy, with the most fertile land and beautiful vistas in Misthalin.",
    "Our castle is larger than Horacio's as well!",
    "It is my duty to protect my people, whether that be from those blasted Zamorakians or our fool of a king.",
    "Finally, some peace.",
    "Just how long do you expect us to follow along with this charade?",
    "I, for one, will be in the command centre, enjoying what little peace I can.",
    "Let's get this over with, shall we?",
    "None of your bloody business!",
    "My beef isn't against Roald. Not really.",
    "But his father Roald II and the Remanis family as a whole? Damn them! Damn them all!",
    "My dear Henry. My son...those vile Zamorakians sunk their foul claws into him, twisted his mind.",
    "He was always a sickly boy. An outcast. Easy prey for those wicked people. Got caught up in things he shouldn't have.",
    "King Roald II didn't know the meaning of the word mercy. He decided to 'make an example' of my poor boy.",
    "He was still a child!",
    "It was twenty years ago...to the day. It hasn't become any easier.",
    "If only such words could bring him back. Pardon my candidness, but such sentiments provide me little comfort.",
    "'Shouldn't' and 'can't' are two very different things, [title].",
    "The king is an honest man. He granted me a duchy in honour of my service to his father. To make amends for what transpired back then.",
    "But he will never free himself from his father's actions. Not while he bears his name.",
    "You're asking me to recount the most traumatic experience of my life AGAIN?",
    "Finally, some peace.",
    "But what reason would they have to kill the duke of Edgeville?",
    "Too good for her, in my opinion.",
    "You handled this fiasco decently enough. Perhaps I will be able to tolerate working with you in the future."
  ],
  "Father Flint": [
    "I may have stolen a bite or two from the kitchen. I know not what this grey slop is, but I know that it's delicious!",
    "You must find the foul cretin who murdered the duke and cast them into the fiery pits of depravity from whence they came!",
    "Vile beasts descend upon us! The end is nigh! Repent, repent!",
    "Such contemptible crimes...that young woman is beyond redemption."
  ],
  "Overseer Siv": [
    "Keep your guard up. The Misthalinian nobility are as dangerous as the monsters beyond our walls.",
    "Let me know if there is anything I can do to assist with the investigation, your grace.",
    "They were, your grace.",
    "Once the beasts were incapacitated, I arrived at the north gate to find the guards unconscious and the gates ajar.",
    "They appear to have suffered a heavy blow to the back of their head and are being monitored as we speak.",
    "That must be the member of their majesties entourage who missed the roll call.",
    "All but one were accounted for, your grace.",
    "The missing guard is likely the assassin who attacked you.",
    "As you command, your grace.",
    "I can't believe I allowed this to happen under my watch. Such mistakes shan't be made again, I assure you.",
    "We were prepared to welcome Bianca as one of our own. A pity it came to this."
  ],
  "Groups spoken to": [
    "[number]/3",
    "[number]/3",
    "[number]/3",
    "[number]/3",
    "[number]/3",
    "[number]/3"
  ],
  "Found clue": [
    "[number]/8.",
    "[number]/8.",
    "[number]/8.",
    "[number]/8.",
    "[number]/8.",
    "[number]/8.",
    "[number]/8.",
    "[number]/8.",
    "1/8.",
    "1/8.",
    "[number]/8.",
    "[number]/8.",
    "[number]/8.",
    "[number]/8.",
    "[number]/8.",
    "[number]/8.",
    "[number]/8.",
    "[number]/8.",
    "[number]/8.",
    "[number]/8."
  ],
  "Main article": [
    "Transcript:Mystery journal",
    "Transcript:Mystery journal § Notes on the murder of Simon Bullace."
  ],
  "The following text is transcluded from Transcript": [
    "Assassin's Letter.",
    "Mysterious Letter (Murder on the Border)."
  ],
  "Congratulations! You have completed": [
    "'Murder on the Border' - Complete this quest."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Murder_on_the_Border?oldid=36122700’"
  ]
}