{
  "[Austri/Vestri]": [
    "Hmmph. What do you want?",
    "You can't go down there!",
    "This is the home of the Mountain Dwarves. How would you like it if I wanted to take a shortcut through your home?",
    "Yes, but I don't even know you.",
    "I don't make friends easily. People need to earn my trust first.",
    "My, we are the persistent one aren't we? Well, there's a certain gold artefact we're after. We dwarves are big fans of gold! This artefact is the first prize at the Hemenster fishing competition. Fortunately we have acquired a pass to enter that competition... Unfortunately Dwarves don't make good fishermen.",
    "Okay, I entrust you with our competition pass. Don't forget to take some gold with you for the entrance fee.",
    "Go to Hemenster and do us proud!",
    "Seems to me like you're not much of anything.",
    "Don’t you know it.",
    "Well, it is a lot easier to go this way to get past White Wolf Mountain than through those wolf filled passes.",
    "Well, it is.",
    "Good. Because you can’t.",
    "Because you can’t. So that’s fine.",
    "Yes. Fine.",
    "Well then.",
    "Go away! You’re not going to bully your way in HERE!",
    "Hello then.",
    "What if I do! It's no business of yours.",
    "Have you won yet?",
    "Well don't give up! Maybe old Jack can give you a few tips.",
    "Hmmm. It’s a good job they sent us spares. There you go. Try not to lose that one.",
    "Maybe that’s where we are going wrong when we try fishing?",
    "Maybe we should talk to that old Jack fella near the competition, everyone seemed to be ranting about him.",
    "Have you won yet?",
    "Well done! That's brilliant! Do you have the trophy with you?",
    "Oh! It's even more shiny and gold than I thought possible...",
    "You've done us proud. Thank you [lad/lass], I think we can now trust you enough to let you in...",
    "Why, the tunnel of course! You many now come and go freely, avoiding the wolves and dangers of the cold, high mountain. You could even stop in for a beer or two!",
    "Welcome, oh great Fishing Champion! Feel free to pop by and use our tunnel any time."
  ],
  "Player": [
    "I was wondering what was down that tunnel?",
    "Why not?",
    "If you were my friend I wouldn't mind it.",
    "Well, let's be friends!",
    "And how am I meant to do that?",
    "You're a grumpy little man aren't you?",
    "You're a grumpy little man aren't you?",
    "Ooh... is this a short cut to somewhere?",
    "Oh, sorry, I hadn't realised it was private.",
    "I didn't want to anyway.",
    "Because I don’t want to.",
    "Yes, it is.",
    "Absolutely.",
    "I'm bigger than you. Let me by.",
    "I was just stopping to say hello!",
    "Do you have a brother?",
    "No, not yet.",
    "I need another competition pass.",
    "No, it takes preparation to win fishing competitions.",
    "Probably.",
    "I don’t have one of them.",
    "What do I need that for?",
    "What are you sitting around here for?",
    "I have one here.",
    "...?",
    "......?",
    "Who are you?",
    "You're a vampyre aren't you?",
    "Is it nice there?",
    "You're a vampyre aren't you?",
    "So you like fishing?",
    "Well, good luck with the fishing.",
    "So you like fishing?",
    "So... you like fishing?",
    "You're a vampyre aren't you?",
    "If you get thirsty you should drink something.",
    "Well, good luck with the fishing.",
    "Can’t you go to another spot?",
    "So you're the champ?",
    "Can I fish here instead of you?",
    "Do you have any tips for me?",
    "Who's Grampa Jack?",
    "I don’t like my spot. Please can I have yours?",
    "Um... nothing really...",
    "Can I fish here instead of you?",
    "Do you have any tips for me?",
    "Who's Grampa Jack?",
    "Um… can I fish here then please?",
    "I'll enter the competition please.",
    "I don’t have the 5gp though…",
    "No thanks, I'll just watch the fun.",
    "I think I might be able to find a bigger fish.",
    "Yes I'll compete again another day.",
    "Actually I'll go back and catch some more.",
    "Tell me a story then.",
    "Are you entering the fishing competition?",
    "I don't suppose you could give me any hints?",
    "There's this weird creepy guy who says he's not a vampyre using that spot. He keeps winning too.",
    "You're right! Thanks Jack!",
    "That's less competition for me then.",
    "Sorry, I don't have time now.",
    "Can I buy one of your fishing rods?",
    "I don’t have enough money for that, I’ll go get some and come back.",
    "Very fair, I’ll buy that rod!",
    "Thanks!",
    "That’s too rich for me, I’ll go to Catherby.",
    "I've forgotten how to fish, can you remind me?",
    "Ok... I think I can get those in Catherby.",
    "It's that simple?",
    "I'd like to enter the competition please.",
    "I caught some fish! Here…",
    "I think I'll keep them to myself.",
    "I don’t feel like a champ…",
    "I lost my fishing trophy…",
    "Yes I have!",
    "Yep, I have it right here!",
    "In where?",
    "Excellent. That will come in most handy.",
    "Thank you, I think I'll stop by."
  ],
  "Morris": [
    "Competition pass please.",
    "Oh well. I can’t let you past then.",
    "This is the entrance to the Hemenster fishing competition. It’s a high class competition. Invitation only.",
    "I'm making sure only those with a competition pass enter the fishing contest.",
    "Move on through. Talk to Bonzo to enter the competition."
  ],
  "Sinister Stranger": [
    "...",
    "...",
    "......",
    "My name is Vlad. I come from far avay, vere the sun iz not so bright.",
    "Just because I can't stand ze smell ov garlic und I don't like bright sunlight doesn't necessarily mean I'm ein vampyre!",
    "It is vonderful! Zev omen are beautiful und ze nights are long!",
    "My doctor told me to take up ein velaxing hobby. Vhen I am stressed I tend to get ein little... thirsty.",
    "I tsink I may do zat soon...",
    "Luck haz notsing to do vith it. It is all in ze technique.",
    "I think you will find that is my spot.",
    "I like this place. I like to savour the aroma coming from these pipes.",
    "Arrgh! WHAT is that GHASTLY smell??? I think I will move over here instead..."
  ],
  "Big Dave": [
    "Hey [guy/lady]! Always nice to see a fresh face!",
    "That's right, [guy/lady]! Ain't nobody better at fishing round here than me! That's for sure!",
    "Sorry [guy/lady]! This is my lucky spot!",
    "Why would I help you? I wanna stay the best! I'm not givin' away my secrets like old Grampa Jack does!",
    "You really have no clue do you! He won this competition four years in a row! He lives in the house just outside the gate.",
    "Sorry guy, this is my spot.",
    "Sorry guy. Big Dave don’t like to lose!"
  ],
  "Joshua": [
    "Yeah? What you want?",
    "Quit bugging me then, [dude/doll]! I got me some fish to catch!",
    "Nuh uh dude. Less talk, more fishing!",
    "Dude! Why should I help you? You like, might beat me! I'm not giving away my secrets like that dude Grampa Jack does!",
    "Who's Grampa Jack [he/she] says! He won this competition four years in a row! He lives in the house just outside the gate.",
    "Hey dude! This is my spot!",
    "No way man. I got a good feeling about this spot!"
  ],
  "Bonzo": [
    "Hey, you need to pay to enter the competition first! Only 5gp entrance fee!",
    "Roll up, roll up! Enter the great Hemenster Fishing Contest! Only 5gp entrance fee!",
    "Marvelous!",
    "No pay, no play.",
    "Ok, we've got all the fishermen! It's time to roll! Ok, nearly everyone is in their place already. You fish in the spot by the willow tree, and the Sinister Stranger, you fish by the pipes.",
    "So how are you doing so far?",
    "And the winner is… The stranger in black!",
    "And the winner is… local favourite – Big Dave!",
    "So you're calling it quits here for now?",
    "Ok, I'll see you again.",
    "Good luck!",
    "Ok, nearly everyone is in their place already. You fish in the spot by the willow tree, and the Sinister Stranger, you fish by the pipes.",
    "Hmm. You'd better go and take the area by the pipes then.",
    "Okay folks, time's up! Let's see who caught the biggest fish!",
    "We have a new winner! The heroic-looking person who was fishing y the pipes has caught the biggest carp I've seen since Grandpa Jack used to compete!",
    "Hello champ! So any hints on how to fish?",
    "Hello champ!",
    "Why not champ?",
    "Is that all chump? Don’t worry, I have a spare!"
  ],
  "Grandpa Jack": [
    "Hello young [man/lady]! Come to visit old Grandpa Jack? I can tell ye stories for sure. I sued to be the best fisherman these parts have seen!",
    "Well, when I were a young man we used to take fishing trips over to Catherby: The fishing over there – now that was something! Anyway, we decided to do a bit of fishing with our nets, I wasn't having the best of days turning up nothing but old boots and bits of seaweed. Then my net suddenly got really heavy! I pulled it up... To my amazement I'd caught this little chest thing! Even more amazing was when I opened it it contained a diamond the size of a radish! That's the best catch I've ever had!",
    "Ah... the Hemenster fishing competition... I know all about that... I won that four years straight! I'm too old for that lark now though...",
    "Well, you sometimes get these really big fish in the water just by the outflow pipes. I think they're some kind of carp... Try to get a spot round there. The best sort of bait for them is red vine worms. I used to get those from McGrubor's wood, north of here. Just dig around in the red vines up there but be careful of the guard dogs.",
    "Ahh well, I'm sure you'll find something to put him off. Afer all, there must be a kitchen around here with some garlic in it, perhaps in Seers Village or Ardougne. If e's pretending to be a vampyre then he can pretend to be scared of garlic!",
    "Why you young whippersnapper! If I was twenty years younger I’d show you something that’s for sure!",
    "Sigh… Young people – always in such a rush.",
    "Of course you can young man. Let’s see now…I think 5 gold is a fair price for a rod which has won the Fishing contest before eh?",
    "Right you are. I’ll be here.",
    "Excellent choice!",
    "You’re welcome young ‘un.",
    "If you’re sure… passing up an opportunity of a lifetime you are.",
    "Of course! Let me see now... You'll need a rod and bait. You can fish with a net too, but not in the competition.",
    "Then simply find yourself a fishing spot, either in the competition near here, or wherever you can – I recommend net fishing in Catherby. Net or Lure the fish in the fishing spot by clicking on it and then be patient...",
    "Yep! Go get em tiger."
  ],
  "Forester": [
    "Hey! You can't come through here! This is private land!"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Fishing_Contest?oldid=36025881’"
  ]
}