{
  "Veliaf Hurtz": [
    "That murderer Vanstrom has killed Sani and Harold! He came in and killed them right in front of our eyes. And that beast he summoned probably would have killed the rest of us if it wasn't for you!",
    "That is for your conscience to bear, but now perhaps you can understand why we fight for our freedom?",
    "Hmm, well, thanks for your support. But I'll need to talk to my superior first.",
    "Hmm, well, perhaps there is my friend, but I also have some information which I should like to impart to you first.",
    "You may know a brief history of Morytania already, if not then this will possibly mean little to you. I will let you into my confidence in this matter. With this knowledge you may serve us well in the future. I pray that you share with us as I will share with you now.",
    "In the early history of Morytania seven warrior priests helped to drive the darkness back from Misthalin into what we now call Morytania. And the priests of Saradomin would have you believe that all seven are buried within the holy temple on the Salve. Information I have leads me to believe that one warrior priest, so bent on the destruction of evil, made countless charges deep into Morytania. His name was Ivandis and we believe that he perished within the lands now spoilt by Lowerniel Drakan.",
    "I have long believed that the warrior priests that fought so bravely had aid from the gods. Perhaps not directly, but in some hidden form. Perhaps an item of some usefulness which may have been used against the foe. It's clear to me that these priestly warriors were powerful but perhaps may have mainly fought weaker minions of darkness. Foes which a trained and brave adventurer could dispatch.",
    "Perhaps they did, eventually. But I like to consider that they may have found some ways to combat this evil. There is much history in this land, much that we may make use of to fight our cause. My wish is that you keep your eyes open for information which may give us a clue to Ivandis' resting place. It is said he had an item of no small power. This would be a great artefact to reclaim, if, in fact it still exists.",
    "Certainly, but the information I have to impart is of importance, please I beg you, ask me about it when you're ready. I can understand your impatience for action, I feel it myself, but forewarned is forearmed as Sani used to say.",
    "Very well. Seeing as our base of operations has been discovered by Vanstrom and we need to evacuate before the entire Vyrewatch descends on us, we'll need to relocate. We've been hiding in the caves to avoid detection for sometime, but now we need to move on.",
    "To the south of Mort'ton we've become aware of a nearly deserted township known as Burgh De Rott. It's a ghastly place where the few escapees from the Sanguinesti region have collected. Please go down to this town and try to establish a new base of operations for us.",
    "Please do not underestimate the importance of this request. In addition to founding the base, we need to ensure that the township can help to support our cause. Help the locals with as many requests as you can in order that they may be well disposed to our efforts.",
    "That is great news my friend, and very good luck to you.",
    "Indeed, well met Player.",
    "Please go to Burgh De Rott and endeavour to resource a new base camp for us. Please afford the locals any help and assistance you can muster so that they may be persuaded to help us in our fight.",
    "Fear not my friend, I will come to your aid.",
    "Never fear, Veliaf is here!",
    "Come let us slay these dogs!",
    "Fight on...bravely...let's go!",
    "En garde!",
    "Have at thee!",
    "Take that you fiend!",
    "I have to leave friend...I grow unwell from this combat.",
    "After you've informed Radigad and Polmafi that our new base is in Burgh de Rott, please take Ivan to the temple for his own safety. I've already discussed this with him. Just explain when you're ready and he'll go with you.",
    "The Inn is going to be our new base. We've struck a blow against Vanstrom. A small one admittedly, but we should now disappear for while. The inn basement you dug out seems functional enough to me. When we get down there, we'll clean it up a bit more and get it functional and I want Polmafi and Radigad down there for backup.",
    "It could be a load of rubbish, but it may be worth looking into. I recognise at least two of those items as ingredients for a potion. Though why he would mention garlic and silver is not really apparent at the moment. Perhaps the vampyres have a strong reaction against those two items as well?",
    "A good question my friend, but I have no answer for you. Perhaps you can experiment?",
    "He'll be safer there under the eye of Drezel, I don't have the time to watch over him while we're in this sort of area. You may have noticed that Ivan has special talents. Vanstrom would dearly love to get his hands on Ivan, I believe that Drakan would also.",
    "I'm going to return to the new base in Burgh de Rott. That will be our best plan for the time being. From there, we may be able to plunge further into the darkness of Morytania and reveal the true horror of what has befallen the peoples of our land.",
    "Thanks for getting Ivan to the temple and letting Polmafi and Radigad know about the new base. Remember, if you get any information about Ivandis, please let me know.",
    "I can give you no specifics my friend. All around us are details of historical importance, any of which might lead us to a significant advantage in our struggle against Drakan. Always be hopeful, always keep your wits about you and double check anything which you think might be important.",
    "You may like to check with Drezel, though I know he isn't keen on discussing such issues. He firmly believes what he's been told by his fellow priests and so I doubt you'll have much luck in gaining information from him.",
    "Ivandis was a priestly warrior, somehow he found a way, along with six others, to fight against the evil that was spewing forth from Morytania. He held aloft a great rod of power which rendered the being useless and lame for a short period. There are stories that he did something else but he is credited with the restoring of what is called, 'Guthix balance'.",
    "That is my interpretation on the meaning of it. Guthix will try to restore power in which ever way he can. He will certainly fight the minions of Zamorak if they trespass into Saradomins land, however, he will also battle Saradomins[sic] forces should they be gaining in Zamoraks[sic] land. Since the time of the god wars Guthix has sought peace and fights to maintain a balance. Guthix doesn't see that Drakan is evil, or that the Myreque are good. He just sees two sides of opposed forces trying to outdo the other one.",
    "That doesn't surprise me at all my friend. On matters such as this you'll find him incredibly stubborn. However, he is still probably the most likely person to know something about Ivandis and the not so well known history of Morytania.",
    "Thanks for getting this base dug out, it's really serving our purposes very well. Do you have any information about Ivandis yet?",
    "Oh yes. That's great news.... have you had a good look around? Did you find anything interesting? If so, please show it to me, I'd be very grateful to read anything which might related[sic] to Ivandis.",
    "Of course not! I would be there now wouldn't I?",
    "Oh, I see what you're asking now. Sorry my friend, I've explored for it extensively and still haven't found it's[sic] whereabouts. Though I would suggest that it wouldn't be too far from the temple. Even an enthusiastic fighter like Ivandis wouldn't forget that tactically he would be outnumbered if he pressed too deeply into Morytania.",
    "Hey there, how's it going?",
    "That's great news... where did you find it? Oh never mind, did you find anything useful? If so show it to me won't you?",
    "The main thing should be the rod which he used to combat the evil minions. Perhaps it has some effect on the vampyres.",
    "Perhaps it's fate that we're not supposed to gain the Rod of Ivandis, if so then our destiny is cast! It's such a pity that we cannot break the mould of our historical defeats and take the fight to Drakan.",
    "Truly? Are you certain? Tell me more!",
    "How clever you are!",
    "I do not I'm afraid, but perhaps you can get some ideas by researching historical tomes, or even studying the rod itself.",
    "Unfortunately my friend, I do not, I would suggest that some time be spent researching the subject. Perhaps there are some tomes which might point you in the right direction? You could also spend some time studying the rod itself.",
    "Hmm, well it certainly looks very authentic. But there doesn't seem to be any enchantment on the item, either mortal or devine. Perhaps there is a step of the process you have not completed yet?",
    "That's a good question but one I cannot answer directly. Perhaps the secret is lost for all time in the annals of history, in which case, perhaps Drezel will be able to give more help.",
    "Hmm, well it certainly looks very authentic. Ah, I see you have enchanted it already, but there doesn't seem to be any divine blessing on the item. Perhaps there is a step of the process you have not completed yet?",
    "That's a good question but one I cannot answer directly. Perhaps the secret is lost for all time in the annals of history, in which case, perhaps Drezel will be able to give more help.",
    "Hey there, how's it going?",
    "Wow, you'll have to show me that if you ever manage to make one.",
    "Very impressive Player, are you sure you wish to part with it though?",
    "Hmmm, well, I can't take it off your hands while you're still using it. If you want to offer it to me, place it in your inventory.",
    "I...I don't believe it! Could this truly be the Rod as used by Ivandis Seergaze? I do believe it is.",
    "Well, Player, you have certainly excelled yourself in this task. I believe you may be Myreque material even yet.",
    "Very well Player, simply bring me a fully charged rod when you get the opportunity and you'll have my gratitude."
  ],
  "Player": [
    "It was the least I could do! After all, I was the one he followed here, I'm sort of responsible.",
    "Yes, I think I understand now.",
    "I want to join your organisation.",
    "Isn't there something I can do in the meantime to help out a bit?",
    "Nope, sorry, not interested.",
    "Ok, tell me this information you have to impart.",
    "I'll do my best!",
    "In what way will this impact on our struggle?",
    "So you think that the warrior priests also suffered defeat by the vampyres?",
    "Nope, sorry, not interested.",
    "Can you tell me about the job?",
    "Ok, I'll keep that in mind, now, what's the job?",
    "Seems like a wise move, what part do I play?",
    "Hmm, check out a place for a new base for the Myreque, that sounds interesting.",
    "Ok, I'll do the job.",
    "Well met!",
    "What should I do again?",
    "Can you tell me about the priestly warriors again?",
    "Ok, thanks.",
    "Veliaf has asked me to do some work for him. Hopefully I'll prove helpful to him.",
    "Hey how's it going?",
    "Hello again!",
    "What on earth makes you think I want your food or your blood?",
    "What is this place?",
    "Where did you all come from?",
    "What's the Sanguinesti region?",
    "Sounds like an awful place! Let me in and I'll help you!",
    "What do you do here?",
    "Why would I want your blood?",
    "I don't want your blood!",
    "Why would I want your food?",
    "But I don't want to eat your food, I'm plenty healthy enough!",
    "Ok, goodbye.",
    "Not so bad.",
    "How come you have no food?",
    "What is this place?",
    "Are there any 'out of the way' places in here?",
    "Somewhere where myself and a couple of friends could hold up for a while without attracting any vampyre attention?",
    "Ok, thanks.",
    "Ok, thanks!",
    "Not so bad.",
    "How come you have no food?",
    "What is this place?",
    "What do you do here?",
    "Can you open the shop for me please?",
    "Are there any 'out of the way' places in here?",
    "Somewhere where myself and a couple of friends could hold up for a while without attracting any vampyre attention?",
    "Ok, thanks.",
    "Ok, thanks!",
    "Hey there, I'm finished with my project.",
    "What do you think of your town?",
    "I'd like to help fix up the town.",
    "Hmm, sounds interesting.",
    "Ok, thanks.",
    "Hello!",
    "I'd like to help fix up the town.",
    "Maybe I was?",
    "What should I do now?",
    "Oh, was I?",
    "Hello!",
    "I'd like to help fix up the town.",
    "Oh! Right, did I? Where was I?",
    "What should I do now?",
    "Yeah, but I've only fixed the roof and the walls.",
    "What do you think of your town?",
    "Have you got any tips?",
    "What should I do now?",
    "What stock do you need?",
    "Hello, I wonder if I could ask a few questions?",
    "What should I do now?",
    "What did you want me to do again?",
    "Ok, thanks.",
    "Yeah, but I've only fixed the roof and the walls.",
    "What do you think of your town?",
    "Have you got any tips?",
    "What should I do now?",
    "Hello, I wonder if I could ask a few questions?",
    "What do you think of your town?",
    "How did everyone come to be here?",
    "Where's the Sanguinesti region?",
    "What should I do now?",
    "What did you want me to do again?",
    "Hmm, sounds interesting but I'd like to ask a few more questions first.",
    "What do you think of your town?",
    "What should I do now?",
    "What should I do now?",
    "Well met friend!",
    "What do you think of your town?",
    "How did everyone come to be here?",
    "What should I do now?",
    "I'm happy to help!",
    "What do you think of your town?",
    "What should I do now?",
    "Do you fancy the job?",
    "Err, thanks I think.",
    "What do you think of your town?",
    "Why does everyone stay in this town?",
    "What should I do now?",
    "Who's Gadderanks?",
    "What's a juvinate?",
    "What should I do now?",
    "What's going on here?",
    "I don't have any intentions of paying a blood tithe!",
    "What's going on here?",
    "What's going one here?",
    "What's going on here?",
    "What's going on here?",
    "What's going on here?",
    "You don't look too well 'Gadderanks', and against my better judgement I feel sorry for you.",
    "Yes I do. I understand that you wanted to feel strong, but you took the wrong side.",
    "You need to take a second and think of them then, think of why you did this in the first place. You needed to provide for your family and you wanted to protect them, but all of that will count for nothing if you don't help us!",
    "We're all trying our best to overthrow Drakan, but it seems that our foe is almost entirely invulnerable.",
    "Take it easy Gadderanks...let's see if we can sort you out.",
    "Phew! Thanks for your help Veliaf, it sure was good of you to turn up.",
    "Sure.",
    "You're more than welcome.",
    "How do you like your town?",
    "What's happening around here?",
    "Is there anything I can do to help out?",
    "What should I do again?",
    "Why are Polmafi and Radigad to go down to the Inn?",
    "What do you make of what Gadderanks said?",
    "What? Garlic and silver? How would I test that?",
    "Why should I take Ivan to the temple?",
    "What are you going to do now?",
    "Ok, thanks.",
    "Veliaf has asked me to ask you to go down to the new Burgh de Rott base. Can you let [Radigad/Polmafi] know as well, I'm taking Ivan to the temple.",
    "Veliaf has asked me to take you to the temple.",
    "Where else might I look for information about Ivandis?",
    "Hmm, yes, well I'm doing that already to be honest. I just wondered if you knew anyone who might actually know something?",
    "What do you know about Ivandis?",
    "You mean that he helped to fight against the evil so that Misthalin could remain in Saradomin's control?",
    "I've been talking to Drezel but he doesn't seem responsive.",
    "Ok, thanks.",
    "Yes, it seems to be getting more dangerous in Morytania all the time doesn't it?",
    "It's interesting that you talk about salvation. It appears we may find it in the most unlikely of places. Perhaps even in the history of this rotten land we could find some clue to aid us in our attempts to defeat Lowerniel and his Drakan clan.",
    "Veliaf told me about Ivandis.",
    "But you don't even know what he said about Ivandis?",
    "So, you're sure that Ivandis is buried here then?",
    "So where did this rumour come from then?",
    "What proof do you have that Ivandis is buried here?",
    "So you don't actually know for sure then that he is buried here then?",
    "What do you know about the history of this area?",
    "Have you checked that then, have you seen their remains with your own eyes.",
    "Is there somewhere that I might get more information about Ivandis?",
    "So you have no further information on Ivandis that could possibly help me with my quest? Remember that this could potentially release the poor peoples of Morytania from their ill fated ends.",
    "Will you let me check Ivandis' tomb in this temple?",
    "We need to consider every possible thing which could help us!",
    "Why are you so resistant to talking about history?",
    "I think you're holding something back! We really need all the help we can get!",
    "The lives of those pitiful few left in Morytania could rest on this!",
    "Yes, so would I, so please, please, help me as much as you can.",
    "Very well then, Morytania is lost then to ignorance.",
    "Ok, thanks.",
    "Ok, thanks.",
    "I found out some things about Efaritay.",
    "Do you know anything about it?",
    "What happened before in Morytania?",
    "Can you give me more information about Veliaf?",
    "Ok, thanks.",
    "Thanks very much for your help so far, I really appreciate it.",
    "I've lost my library key.",
    "Thanks for that!",
    "I've lost the key to the library!",
    "I've found a library in the temple.",
    "Do you know where Ivandis tomb might be?",
    "No, I mean just roughly? Is it in the east of Morytania, the west. Do you think it's in Mort'ton, Burgh de Rott...any of these places?",
    "Ok, thanks.",
    "I think I've found Ivandis' tomb.",
    "Sure, but I need to ask a few questions first.",
    "What should I be looking for in Ivandis' tomb?",
    "There is only a coffin in there and the rod is fused to the top of it. There doesn't seem to be a way of removing the rod from the coffin lid.",
    "Ok, thanks.",
    "I think I've found a way to make the Rod of Ivandis!",
    "I made a clay mould of the rod on Ivandis[sic] coffin!",
    "Do you know which metal is used to make the rod?",
    "Do you know what the rod does?",
    "Ok, thanks.",
    "Here you go, I've managed to make the rod that Ivandis used to have.",
    "Where would I find out the process for completing the rod?",
    "Here you go, I've managed to make the rod that Ivandis used to have.",
    "Where would I find out the process for completing the rod?",
    "Here you go...the rod Ivandis used to have.",
    "Well thanks...I think I've found out how to make a rod like Ivandis used to own?",
    "Don't worry, I will!",
    "I have brought you the Rod of Ivandis!",
    "Yes, I've come to give the Rod of Ivandis to you!",
    "Hmm, I'll keep hold of it for the time being.",
    "Ok, thanks.",
    "I've lost Gadderanks' Hammer!",
    "Okay, I'll pay 3,000 coins for the hammer.",
    "Why does the hammer cost so much?",
    "No thanks, I'll leave it, 3,000 coins is too much to pay.",
    "You're more than welcome."
  ],
  "Ivan Strom": [
    "Is something new and exciting happening?",
    "Very well, I'm ready, lead the way.",
    "Many thanks for bringing me safely to the temple, I'm going to",
    "rush on ahead as I'm eager to get out of these muddy clothes.",
    "Many thanks for bringing me safely to the temple, I'm going to rush on ahead as I'm eager to get out of these muddy clothes. It might be worth chatting to Drezel, even if it's just to inform him I've arrived."
  ],
  "Polmafi Ferdygris": [
    "Not so good, but it looks as if Veliaf is giving you some important things to do! It's great you're helping us out!",
    "Hey there...it's good of you to do all this work for Veliaf. I've heard him say one or two good things about you! Keep up the good work and I'm sure you'll be on the team soon!"
  ],
  "Radigad Ponfit": [
    "Well met Player! Veliaf tells me you're doing some important work for him! Best attend to it with utmost importance if you ever want to gain his respect!",
    "Thanks for doing such good work on the new base, it looks great. Of course, we've tidied up a bit as you can see!"
  ],
  "Florin": [
    "Get out of it! You'se aint commin' in 'ere to get our's blood or's our food!",
    "Hey! Don't try to sweet talk me, I know you want something! But we's got nothing ya see! Nothin'! What blood we've got, we're keeping for us-selves! You can tell that stinkin' Vanstrom to go milk a cow! And as for food, why we've barely got enough to feed ourselves - so you ain't 'aving none! Right!",
    "This is our town...we's live here, it's called Burgh De Rott, and you aint comin' in!",
    "We've escaped from that Vanstrom, he was herding us into the Sanguinesti region and was going to drink our blood! Yuck!",
    "As if you don't know! It's the dark lands to the east where humans are kept like animals to feed those greedy evil vampyres!",
    "Yeah, ok then....eh! No way! You can't trick me like that!",
    "Oh, my name's Florin. I just help out around here, you know, look for food and so on.",
    "Not that it makes much difference but my name's Florin. Like all the other survivors here, I just try to make do and get through life one day at a time.",
    "Well met! My name's Florin. I do a bit of this, a bit of that. Just try to survive really, there's nothing much else we can do.",
    "You's probably one of them stinking vampyres what drinks people's blood! You's aint comin' in!",
    "We's don't care, you probably want's our food then, so yous ain't coming in.",
    "You's probably want's to eat it all and we aint gonna let ya!",
    "Well, that's as maybe, but yous probably wants to drink ours blood! And you aint having it and you aint coming in!",
    "Blimey, did you see that, [he/she] put some food into the casket for us! [He's/She's] probably not after anything!",
    "Hey...what you put in that chest?..Is it something tasty, like a nice cooked snail? Or perhaps a well matured piece of cheese with some fresh bread? Ohhh, I bet it's dead tasty...",
    "Hey there, how's it going?",
    "We just don't seem to get out to the shops like we used to!",
    "This is our town...we's live here, it's called Burgh De Rott. It aint much to look at, but it's our home.",
    "How do you mean, 'out of the way'?",
    "Ah, right, I know what you mean...hmm, let's think now... Well, there's the Inn...you could look there I suppose. The cellar would have been useful, but the trapdoor down to it is covered with rubble from a broken wall. The cellar itself is probably filled with rubble as well. But you may be able to do something with it.",
    "Listen, if you do manage to find a way to get a place here, we'll expect you to help make the village a little nicer. You know, help to fix things up a bit."
  ],
  "The following text is transcluded from Transcript": [
    "Open chest (Burgh de Rott).",
    "Plaster fragment.",
    "Dusty scroll."
  ],
  "[Villager]": [
    "Hey there, how's it going?",
    "We can only stay in the village and there's precious little food in there...just rats to live on! Not very appetising. There's also no where to store any food around here, the town is incredibly run down.",
    "We dare not leave the town for fear that the Vampyres might spot us and force us to pay a blood tithe. We're all very weak and would most likely die if they took more blood from us.",
    "We just don't seem to get out to the shops like we used to!",
    "This is our town...we's live here, it's called Burgh De Rott. It aint much to look at, but it's our home.",
    "I'm [Calin/Mihail/Nicoleta/Simona]. I'm trying to stay warm by this fire.",
    "Huh! I'm [Luminata/Razvan/Vasile]. Ravaging after food is what I mostly do. Occasionally, I'll happen across a rat - and that's a good day - just like today!",
    "Oh, hello. [Luminata/Razvan/Vasile] is the name and I help to keep the village clear of rat infestations. Clearly I love my work, as I bring it home with me...on a stick!",
    "Oh, hi, I'm [Luminata/Razvan/Vasile]. I hunt mostly rats. Speaking of which, this rat tastes awful - but it's the only food we have!",
    "Huh! I'm [Emilia/Grigore/Ileana/Luscion/Radu/Sergiu/Sorin/Valeria]. Ravaging after food is what I mostly do. Occasionally, I'll happen across a rat - and that's a good day - just like today!",
    "Oh, my name's [Emilia/Grigore/Ileana/Luscion/Radu/Sergiu/Sorin/Valeria]. I just help out around here, you know, look for food and so on.",
    "Well met! My name's [Emilia/Grigore/Ileana/Luscion/Radu/Sergiu/Sorin/Valeria]. I do a bit of this, a bit of that. Just try to survive really, there's nothing much else we can do.",
    "How do you mean, 'out of the way'?",
    "Ah, right, I know what you mean...hmm, let's think now... Well, there's the Inn...you could look there I suppose. The cellar would have been useful, but the trapdoor down to it is covered with rubble from a broken wall. The cellar itself is probably filled with rubble as well. But you may be able to do something with it.",
    "Listen, if you do manage to find a way to get a place here, we'll expect you to help make the village a little nicer. You know, help to fix things up a bit.",
    "Oh, that's good to know.",
    "It's barely a town...I mean, not exactly a breeding ground for high society is it? But at least we can hide from the Juvinates and Juveniles. Hopefully we can start to get things up and running soon, you know, some of the trappings of normal city life.",
    "Oh, that's very kind of you!",
    "Hmm, perhaps you'd consider fixing up the general store. Go and have a chat with the store owner if you want more details.",
    "Yeah, what can I do ya for?",
    "Well, it would look a lot nicer if someone managed to fix up the general store I think.",
    "Oh, that's nice, but weren't you helping out the store owner?",
    "I'd go and have a chat with him again if I were you.",
    "I thought you were helping the general store owner with something? Perhaps fixing up his store?",
    "I'd go and have a chat with him if I were you.",
    "Hi there...you've done a good job on that general store.",
    "It's looking a lot better now that the general store is fixed up, but it really needs some stock I think...imagine how nice it would be to have a warm fire for a change? I just hope they start to stock some tinderboxes!",
    "Yes, I'd go and finish off that general store if I were you! Go and chat with the store owner.",
    "I thought you were helping out Aurel the store owner? Go and talk to him.",
    "Sure, go ahead.",
    "It's coming together now, the store is looking nicer now that it's been fixed up a bit, but it would be better with some stock in it.",
    "We came over from the Sanguinesti region where we were being farmed as food for the vampyres.",
    "It's to the east of here. The land of Morytania is split in half, one half is undead infested desolate swamp, the other is Sanguinesti. I'm glad that I'm not in Sanguinesti any more!",
    "You could stock the store!",
    "I thought you were helping the store owner stock his store?",
    "Well met indeed!",
    "It's getting to be quite nice now with the general store, but it would be useful to get to use the bank!",
    "We just escaped from the Sanguinesti region! It's a terrible place, separated into two districts. To the north is an area some call 'Darkmeyer', and the south is known as 'Meiyerditch'. For all intents and purposes, anything east of 'Burgh de Rott' is the Sanguinesti region, do not go there my friend.",
    "You need to fix up the bank, the booth looks good now, but the wall could do with patching up.",
    "Hey it's you! You're doing a great job with the town! It's really getting a lot better!",
    "Oh, I think it's going great...we're all so pleased with the work you're doing, but there's still lots left to do.",
    "Well, that bank is all fixed now, but it isn't going to serve people's accounts all on its own. You'll have to recruit someone!",
    "Well met and many felicitous salutations Player! All in the town are much agreed that your efforts in restoring the utilities are most proper and correct.",
    "Oh it's brilliant, but we could really do with somewhere to melt down the local ores, and stand a chance of making our own metal items.",
    "It's simply safer to stay here than to risk going through Mort'ton where those horrible Shades just appear out of nowhere and start eating your soul. Also, those horrible ghasts in Mort Myre would just eat you alive! What a way to go, I know I wouldn't fancy it myself.",
    "You've already done quite a lot and I'm sure that everyone is very pleased with your efforts. But I overheard someone saying how great it would be if the old furnace were up and working again. It seems like quite a big job, so I've no idea if it's even possible.",
    "Well done big shot, the smoke from the furnace attracted Gadderanks and his Juvinate body guards. He's set up a blood tithe station in the general store.",
    "He's a human lackie[sic] for Vanstrom Klause. He wants to become a vampyre like Vanstrom. He goes around with his juvinate body guards because he's too weak to defend himself. He gets blood tithes from the locals and takes them back to the vampyres.",
    "A juvinate is an immature form of vampyre. They have total immunity to all known weapon types, and some say they can fly as well. There is a form of the vampyre before this called a Juvenile. A juvinate is an 'initiated juvenile'. They're pretty tough, I have to say, no one that I have seen has ever gotten the better of one.",
    "If I were you, I'd get out of town...now Gadderanks is here, I doubt many people will stay around! Most will try to hide and stay away from him and his blood tithe station. Do you know he's set it up in the general store!",
    "Hey it's the hero! Wow, you're amazing! How on earth did you manage to tackle those two juvinates and Gadderanks? And the town is lovely, you've done a great job.",
    "It's just perfect, thanks so much for your efforts.",
    "Oh, not much really, we're all still hiding from the vampyres and eking out a living from this terrible place, hopefully soon we'll be strong enough to make the journey to the temple on the Salve.",
    "Not as far as I know, we have some basic amenities now which is so very useful, we're all incredibly grateful to you. I've never really seen or known a hero before, so I have nothing to compare one to, but I suspect in most people's judgement, you would be one! I for one am very pleased to have met you."
  ],
  "Aurel": [
    "I'm Aurel the village store owner.",
    "I'm sorry, my friend, but I cannot open a store which has no stock.",
    "Yeah, what can I do ya for?",
    "Yes, I know, you said you'd help fix up my general store!",
    "Well, I'm not sure, could you take a look at the roof and then look at the walls. Once you've done that, come and have a chat with me.",
    "I thought you were fixing up my general store? First fix the roof, then the walls. After that, come and have a chat with me.",
    "I'm sorry my friend, but I cannot open a store which has no stock.",
    "Hi there...you've done a good job on my store! It's starting to look great!",
    "It's looking better since you fixed my store...that's for sure...but how about a nice bit of stock in order to get the punters in? Just some basic commodities, nothing too fancy like.",
    "Yes, finish off the general store! Get me some stock!",
    "You could stock the store for us, we'd really start being like a new town then.",
    "Ok, I need 3 Tinderboxes, 10 [Mackerel/raw snails of any type], and 10 Bronze hatchets.",
    "There you go, fill that up for me please.",
    "Sure, go ahead.",
    "You could stock the store!",
    "It looks like you need a new crate...here, don't lose this one. Fill it with the stock I asked for and then come back to me.",
    "You need to collect 10 Bronze hatchets, 10 snails of any type and 3 Tinderboxes.",
    "Wow, well done! You're doing a great job...I'm going to get this stock straight out onto the shelves.",
    "Hey, you've done such a great job for me, would you consider helping us fixing up the bank?",
    "It's a lot better now that we have a general store, you're doing a great job! What a hero!",
    "Please can you fix the bank booth first as it's quite delicate. If you can't fix the booth then there's not much point in fixing the wall.",
    "Hey there! Gadderanks dropped this warhammer, I guess it belongs to you now!",
    "Hmm, how careless of you! However, you're in luck! Someone found it earlier and sold it to me, now I can pass the hammer back to you for the remarkably cheap price of 3,000 gold coins. Deal?",
    "A good deal and I'm sure of it!",
    "Thanks for you[sic] business sir!",
    "So much!  That's cheap!  The adventurer I bought it from wanted twice as much but I managed to knock him down to a reasonable price. I had a feeling you might like the item back so I traded what I could to get the item and hold it for ya. If you don't want it, I can just as easily trade it to the many other adventurers that frequent my premises.",
    "Very good then! I'll have no guilty conscience in offering it to other adventurers that frequent my shop then. Many thanks for your time and good day to ya sir.",
    "Hey it's the hero! Wow, you're amazing! How on earth did you manage to tackle those two juvinates and Gadderanks? And the town is lovely, you've done a great job."
  ],
  "Cornelius": [
    "I'm Cornelius. It's been ages since we last had a bank in this village.",
    "Fix the floopin bank would ya! We's not had a place to store our valuables in ages! Get on with ya and get that booth fixed!",
    "Me...why, I guess I could...yes, in fact, I'm sure I could...ok then! Yeah, Ok, I'd best go and get changed now..."
  ],
  "Elisabeta": [
    "I'm Elisabeta the village leader."
  ],
  "Gabriela": [
    "I'm Gabriela. I'm looking after my husband who isn't feeling too well!"
  ],
  "Marius": [
    "I'm a little ill. My wife looks after me though. I help as much as I'm able, but as you can see, I'm bed ridden. Hopefully I'll get better soon."
  ],
  "Teodor": [
    "I'm Teodor. I be a farmer, oh arrr...and what can I do for you?"
  ],
  "[Child]": [
    "I'm [Catalina/Helena/Ivan/Victor]. I may be just a kid, but I'll duff you in! You don't look that tough to me!"
  ],
  "Vanstrom Klause": [
    "I don't want to hear your pathetic excuses Gadderanks. Just do the job you've been appointed to do. You'll never be anything more than a useless human unless you can prove yourself worthy.",
    "I couldn't care less for your problems Gadderanks. I just don't seem to be able to think on an empty stomach...",
    "Sniff...Sniff...Sniff... Ah, smoke.",
    "There you go Gadderanks, it looks like you have a fresh appointment and we have fresh meat! Let's just hope that you can achieve your blood tithe target before you become a meal yourself."
  ],
  "Gadderanks": [
    "But my lord Vanstrom there are precious few human settlements left worth collecting tithes from. Mort'ton is just a dead town, full of afflicted and Lord Malak was so ill when he drank of them last time. Canifis is delivering more than it originally agreed to but that still isn't sufficient.",
    "Pray, tell where should I get the remainder from?",
    "!GULP!",
    "Oh happy days! It's so good we came across this village! If it hadn't been for some good soul lighting that smokey furnace we'd have never known about this place! Now I should be able to make my blood tithe quota...especially after you pay your tithe. You look like an incredibly fit specimen! I bet you could pay twice as much as the others before passing out...they all do you know!",
    "Ha, ha ha, We'll see about that!",
    "Do I need to explain it all again! Stand in line ready to pay your blood tithe! Oh yes, and many thanks for lighting that smokey furnace. The locals were more than obliging in letting me know it was you who gave away the position of this village. We thought it was deserted before so I offer you my gratitude.",
    "I've had enough of you poking your nose in here! If you think you can stop us, go ahead!",
    "Cough...Cough!",
    "Yes, flee from me and my Juvinates...we'll be ready next time.",
    "You do...you feel sorry for me (cough)?",
    "But..(cough)I just didn't want my family (cough)...you understand (cough)...I wanted to do my best by them (cough)...and be strong.",
    "Then...will you do me a favour (cough) and try to save them (cough)...please I beg you.",
    "I have some information which may help...(cough), they fear some things...silver dust...garlic (cough) to name some. Also outlawed are (cough)...ralander and (cough)...ders, so is the potion which you make with them.",
    "It's too late for me (cough)...though with what I have told you (cough), perhaps you can find a way to (cough)bring light once again to Morytania."
  ],
  "Vampyre Juvinates": [
    "Ha, ha, ha, ha!"
  ],
  "Sorin": [
    "Gadderanks is here and he wants blood."
  ],
  "Wiskit": [
    "They're draining my blood, that's what they're doing...else they say I'm done for!",
    "Didn't you hear me, I said they're draining my blood, that's what they're doing...else they say I'm done for!"
  ],
  "Vampyre Juvinate": [
    "Haa...we're getting some delicious blood tithes from these sacks of food...yum.",
    "Didn't you hear me, I said we're getting some delicious blood tithes from these sacks of food...yum."
  ],
  "Veliaf": [
    "Fear not my friend, I will come to your aid.",
    "Never fear, Veliaf is here!",
    "Come let us slay these dogs!",
    "Fight on...bravely...let's go!",
    "En garde!",
    "Have at thee!",
    "Take that you fiend!",
    "I have to leave friend...I grow unwell from this combat.",
    "Huh, it looks like Gadderanks is still alive...perhaps he's ready to give us some information before he meets his maker.",
    "Don't mention it. Quickly now, I need to return to the Hollows. Please can you come as quickly as you can and help me to organise Polmafi and Radigad?"
  ],
  "[Polmafi/Radigad]": [
    "Ok then, I will.",
    "Don't worry, I'm just getting my stuff together before leaving, good luck with the trip to the temple."
  ],
  "Vamp Juvinate": [
    "There's that tasty morsel Ivan, let's eat him. You're trapped here! Ha you're going to have to defeat us to get to the temple."
  ],
  "Drezel": [
    "Greetings again adventurer. How go your travels in Morytania? Is it as evil as I have heard? Well done for bringing Ivan to the temple, Player, he will be much safer here.",
    "Indeed it does my friend, but thanks to you, and the Myreque, we have at least the hope of finding salvation in this dark and oppressive land.",
    "Indeed my friend, history could be a good teacher for the best of us. Would that I had more knowledge on the subject, and perhaps a hint of the information which you have already found.",
    "Hmmm, how can I say this diplomatically, Veliaf is a good leader, but perhaps shouldn't be voicing ideas about religious history.",
    "I assume he's made suggestions that Ivandis isn't actually buried in this temple along with the other six priestly warriors? If he has made such a claim, it's not something I'm prepared to talk about.",
    "If you don't mind me saying, that is a bit of a redundant question. Of course Ivandis and the rest of the seven priestly warriors are buried here.",
    "I don't have time to consider such pointless concerns. I am sorry to be so blunt, but it offends me that you challenge me on this. Please, unless you have something else to talk about, leave me alone.",
    "Servants of Saradomin are not concerned with trifling matters such as proof. We have our faith, and our faith guides us.",
    "Leave me now! Do not challenge me on matters of faith, it will be your undoing.",
    "I know that this temple is built on the place where the holy seven warrior priests defended Misthalin against the encroaching evil of Morytania. I also know that their sanctified and holy remains rest peacefully in holy Saradomin's house.",
    "Well, not exactly...a pious follower of my Saradomin needs only the truth of his faith.",
    "What little information there is, is probably already known, to you.",
    "I have told you all I know...that is as much as I, or anyone, can do.",
    "Absolutely not! What a disgrace that you should even ask! His remains pure and undisturbed beneath this hallowed earth! How could you even ask!",
    "I don't see how that can help you! And if you continue in this vein, it will certainly hinder you for you shall not have my support!",
    "I am not resistant my friend, I just cannot see the use of it. I know only what I know and that is most likely what you know already!",
    "I understand that my friend, but digging up the remains of saintly heroes will not aid us in any way I can assure you!",
    "I would do all I could to help those...",
    "Very well, but there is only so much I can do...I am still a priest of Saradomin remember. I know not if this will help, but please take this key, it will allow you access to a secret library. In there you may find what you're looking for, but I pray you never reveal this to me.",
    "Not ignorance my friend, and if you give in so easily, perhaps the Myreque had better search for someone of more conviction.",
    "I'm sure that's fascinating for you my friend, but I'm not sure how that helps our situation here.",
    "Nothing relevant. It is not pertinent to our problems.",
    "Well it's certainly a colourful past, but I prefer to look to the future.",
    "He's certainly a good leader, but it's a tough job he has to do.",
    "I just hope that all our sacrifices are worth it and prove fruitful in the end.",
    "Ok, here's another one for you.",
    "Ok, here's another one for you."
  ],
  "Congratulations! You have completed": [
    "'In Aid of the Myreque' - Complete this Intermediate quest."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:In_Aid_of_the_Myreque?oldid=36115065’"
  ]
}