{
  "Ur-tag": [
    "I've... I've just had a terrible report from the scouts. An army is marching on Dorgesh-Kaan.",
    "Huge numbers of goblins, trolls and ogres are congregating in the swamps above.",
    "I don't know. Perhaps it has something to do with Bandos's death? What could they want with us? I need you to find out what they're doing, and do anything you can to slow them down or stop them. Will you help us?",
    "Good. The first thing I need you to do is-",
    "What does he want with us?",
    "We can't fight an army of this size, and the cave-in won't hold them for long. I'll go to the council and begin discussing our evacuation. Go to their leaders. They ought to speak with you. Try to slow them down; stop them if you can. With Bandos dead I thought we were finally free of him. Now this...",
    "Then this sounds like an ideal job for you.",
    "Find the Bandosian leaders. They're in the Swamp Caves. You'll have to go through the swamp to get there.",
    "We don't seem to be dead yet, so I assume the news is good.",
    "Well, it's as good a distraction as any.",
    "Well, it's a long shot. It really is down to you. Are you feeling confident?",
    "We shall see.",
    "When you're ready, meet Zanik by Bandos's body, east of the Goblin Village.",
    "Why?",
    "Why did you kill her? Grubfoot told us what happened.",
    "You are insane. Bandos is dead. He requires no more carnage. Do not use his name to justify your own bloodlust. She was my friend. More than that, she was your friend, or at least I thought she was.",
    "She told me, but that still doesn't justify murder!",
    "But you had won. Zanik would have been leader.",
    "I... fine. You have saved us, again. As council leader, I... thank you for your assistance in this matter. But as a man, I cannot forgive what you have done. Please, just go.",
    "Welcome back! Grubfoot told us what happened. It saddens me that we won't be seeing Zanik again, but it sounds like you both did the best you could. Dorgesh-Kaan is no longer under attack. Once again, you have saved us.",
    "And I the same to her. Wherever she ends up, whatever she finds out there on Yu'biusk, I hope she finds peace.",
    "I don't have anything to say to you regarding the tournament. Dorgesh-Kaan thanks you for your assistance in the past. Please leave before you hurt anyone else.",
    "Yes. Thank you again. You did everything you could and we are safer because of it.",
    "I was concerned to hear that Graardor rejected Zanik's authority, but we've not had any trouble. The Bandosians cleared out almost immediately and haven't returned. They don't seem interested in us any more. There's always the possibility that they'll come after us again, but we're working on better ways to block their access.",
    "I can only hope that she finds peace on Yu'biusk, one way or the other. Thank you for giving her that opportunity."
  ],
  "Player": [
    "Why?",
    "What do you need me to do?",
    "I'm here on behalf of the cave goblins.",
    "What, peaceful-",
    "It was worth a try.",
    "Why are you in charge, Graardor? Zarador was second in command during the war against Armadyl.",
    "Bandos said that the strongest should lead. Are you the strongest?",
    "So you're saying you're stronger than anyone else here?",
    "Wait, Dad? Aren't you dead?",
    "Well that clears that up.",
    "Wait, I know how to resolve this!",
    "What we need is a way to conclusively decide who is strongest.",
    "This tournament sounds like an ideal opportunity for Graardor to prove his right to lead.",
    "What about the Dorgeshuun? They need to be represented.",
    "Great! Wait... What are you trying to pull, Zarador?",
    "I will fight on behalf of the Dorgeshuun, not Zanik.",
    "What?",
    "You don't mean...?",
    "No...",
    "No...",
    "I'm done here.",
    "Sort of. It's a bit of a story. I've convinced the Bandosians to hold off on the attack while they hold a tournament to decide who is in charge.",
    "I also took the liberty of entering the Dorgeshuun into the competition. Zarador was keen on it, because he thought it would give him easy access to Zanik. But I've arranged to serve as uh... Zanik's 'assistant' and fight on her behalf.",
    "Yes, but I don't think it's safe for you to attend the tournament. The good news is that if I win, you technically become leader of the Bandosians.",
    "If I lose, or if either of us die, the Dorgeshuun are eliminated from the tournament and it's very likely the invasion will be back on.",
    "Before leaving, I better go talk to Zanik, next to Bandos' remains.",
    "I almost didn't recognise you in the hood.",
    "Did you want to talk to me about something before the tournament?",
    "Bandos could do that? I thought gods didn't have that power.",
    "What are you going to do?",
    "So what's the plan?",
    "But if I win on your behalf, that would make you Bandosian leader.",
    "Somewhere like where?",
    "You watch your back, too. If you die, I lose by default.",
    "My name is Player. I'm the... I'm the trained attack beast serving the Dorgeshuun champion.",
    "Yes, it's very funny. Where is Zarador?",
    "Hi Grubfoot.",
    "Hello, Burntmeat. Can I smell what you're cooking?",
    "Hello, My Arm. What are you doing here?",
    "What if I don't want to kill my opponent?",
    "I have no more rules questions.",
    "But you might rule unfairly against me!",
    "Because you would have killed them on sight.",
    "Last I checked, Burthorpe was doing better than ever and Morningstar was dead.",
    "How did you eat a lol? What is a lol, anyway?",
    "How did you know he was called Lol?",
    "Haha 'Farkle'.",
    "You'll be doing impressions of yourself losing if we meet in the arena!",
    "Who are you?",
    "That's rich talk coming from someone with such crumby armour.",
    "Well if we meet in battle, I'll chew you up and spit you out.",
    "When I break your legs, you'll need wagon wheels to get around!",
    "Who are you?",
    "What are you?",
    "Why are you here?",
    "Well... it's been nice chatting. Goodbye.",
    "Really? What do you do?",
    "They...punched you in the face to win prizes?",
    "But how... Never mind.",
    "You're not taking part?",
    "What are you two doing here?",
    "Shouldn't you be cheering for the troll champion?",
    "Oh, and hello Grubfoot.",
    "Not...?",
    "Yes...?",
    "How about you, Grubfoot?",
    "That's great, did it work?",
    "What, the goblin village?",
    "I see.",
    "Who?",
    "So he has cash to buy awesome gear, and he's highly resistant to damage?",
    "Hm...",
    "You called the Kyzaj Arbiter a fool.",
    "If you're no goblin, then what are you?",
    "But what are you doing here?",
    "Let's see... a note!",
    "'You have been provided with six goblin potions. Make sure you choose goblin type 3, the one with the big hat, so you can identify each other. Choose your five best men, infiltrate the Kyzaj tournament, and kill the champions. They are powerful, so do not engage them directly. Poison each of them. Do NOT fail. We must prove that the humans are worthy of the name of Bandos. P.S. Destroy this note, it is very incriminating'.",
    "I need to tell Zarador about this. Sounds like there are five more humans somewhere on Yu'biusk.",
    "No, the tournament has to proceed properly. If it doesn't, Zarador will just attack Dorgesh-Kaan again.",
    "I was going to see Zarador, wasn't I?",
    "I was going to see Zarador, wasn't I?",
    "I was going to see Zarador, wasn't I?",
    "The human Bandosians are plotting to poison the tournament champions. They're disguised as goblins.",
    "The 'goblin' you sent to notify me about round one was a human. He was carrying this note.",
    "I need to ask you a couple of quick questions about your duties.",
    "You're a human in disguise!",
    "He'll turn back into a human any minute. ... Oh. Well, I guess I should go find the actual humans.",
    "I need to ask you a couple of quick questions about your duties.",
    "Aren't they more like ourgs?",
    "There are human infiltrators in the camp, disguised as goblins, trying to poison the champions.",
    "I'm not drunk. I'm being serious.",
    "I can see that.",
    "I need to ask you a couple of quick questions about your duties.",
    "But you might be a human too.",
    "I understand that, but some humans in camp are disguised as goblins.",
    "I need to ask you a couple of quick questions about your duties.",
    "Why would we need a secret weapon?",
    "Graardor doesn't use weapons.",
    "No goblin is that well-spoken.",
    "Nice try.",
    "That's another infiltrator dealt with, only [4/3/2/1] left.",
    "I need to ask you a couple of quick questions about your duties.",
    "I know the feeling. How do you communicate with them?",
    "I need to ask you a couple of quick questions about your duties.",
    "You must have some kind of responsibility here.",
    "Then why are you on Yu'biusk?",
    "You must have some explanation.",
    "Even for a goblin you seem concise.",
    "Don't you have any opinions on any subject?",
    "Come on, just one little statement?",
    "Can you prove it?",
    "Then why should I believe you?",
    "That isn't a very good reason, is it?",
    "Trying to avoid saying much is a good strategy, but you should have thought up better answers.",
    "Your little outbursts gave you away, human!",
    "You're a... goblin?",
    "Okay... I need to ask you a couple of quick questions about your duties.",
    "Bork? What's he making you do?",
    "Anything more specific?",
    "You could be a human, pretending to be a goblin, pretending to be an ork!",
    "How could you possibly think anyone was going to fall for this?",
    "You're not helping.",
    "I need to ask you a couple of quick questions about your duties.",
    "Do goblins even have furniture?",
    "It has been a while since anyone set foot here.",
    "What tribe do you belong to?",
    "Your impression of a goblin is terrible. I know you're a human.",
    "I need to ask you a couple of quick questions about your duties.",
    "Very important.",
    "I need to ask you a couple of quick questions about your duties.",
    "Oh yes, I forgot about all the lush farmland up in Trollheim.",
    "Why do you have a troll name?",
    "You're disguised as a goblin, not a troll.",
    "That's all of the infiltrators, I should return to Zarador.",
    "The threat is no more. I've taken care of all the disguised humans.",
    "One goblin did die, but in my defence he was really suspicious.",
    "What?",
    "There may have been a few goblin casualties along the way. In my defence, they did seem pretty suspicious.",
    "What?! But I don't have any goblin minions!",
    "If Zanik sets foot on Yu'biusk, you'll kill her! I will fight Yelps and his minions alone!",
    "I'd better check in with Zanik.",
    "Everything okay?",
    "It was against the goblin champion, Yelps. I won.",
    "Anyway, how are you feeling?",
    "We're not at the end yet. I still plan to win this thing.",
    "I'd better see Zarador about the next round.",
    "What?! But trolls have naturally rock-hard skin!",
    "I'm glad to have disappointed you.",
    "Thanks.",
    "Zanik might know something about this weapon. I should check with her.",
    "Look at this!",
    "It's the ceremonial weapon of Bandos. I have to use it to fight Graardor in the finale. Do you have any idea of how to wield it?",
    "Good idea. Is she still outside the portal on Gielinor?",
    "I have to fight General Graardor with it in the final. I was hoping you could tell me how to use it.",
    "Zanik?",
    "But how do I use it?",
    "Like this?",
    "I think I've got the hang of it.",
    "So what, Graardor becomes leader?",
    "What would you do instead?",
    "And Graardor becomes her lieutenant.",
    "Zanik?",
    "But nothing can live here!",
    "What are you going to do now?",
    "Excuse me?",
    "Thanks to my actions, the Dorgeshuun are safe. Isn't that worth one life?",
    "They would never have accepted Zanik as leader. She was a cave goblin, and she didn't even fight in the tournament. They still blamed her for Bandos's death. With her gone, they have no reason to attack Dorgesh-Kaan.",
    "Where's Graardor?",
    "How's being leader? Enjoying it?",
    "What are you going to do now?",
    "But this place is deadly! You won't survive!",
    "How are you feeling?",
    "So you're going to stay here, then?",
    "She asked me to wish you well.",
    "I'll never win with you, will I?",
    "I'm good. What are you doing in the Goblin Village?",
    "I want to talk about the Kyzaj Tournament.",
    "I want to talk about the Kyzaj Tournament.",
    "I want to talk to you about the Kyzaj.",
    "What do you think about Zanik?",
    "What do you think about Graardor?",
    "I want to talk about the Kyzaj Tournament.",
    "What do you think of Graardor being in charge?",
    "I want to ask about the tournament.",
    "How is Graardor doing?",
    "How are you doing?",
    "You didn't go with Zanik?",
    "Goodbye.",
    "I want to talk about the Kyzaj Tournament.",
    "How's it going?",
    "What do you think about Zanik?",
    "Goodbye.",
    "I want to talk to you about the Kyzaj.",
    "You didn't go with Zanik?",
    "Goodbye.",
    "I want to talk about the Kyzaj Tournament.",
    "What did you think of the tournament?",
    "You didn't go with Zanik?",
    "Goodbye."
  ],
  "Zanik": [
    "General Graardor is here with an army! We've just collapsed the swamp entrance to slow them down.",
    "He's holding us somehow responsible for Bandos's defeat. They don't believe their 'Big High War God' could lose and Graardor is looking for someone to blame.",
    "Graardor and the others are gathered in the Swamp Caves. Our entrance is blocked so you'll have to go the long way around. You know the route? Into Lumbridge Swamp and under that old tree.",
    "Wait... I'm the Dorgeshuun champion?",
    "What's the bad news?",
    "That portal that appeared near the goblin village must lead to Yu'biusk. Get yourself ready for the tournament, and I will meet you by the portal before you leave. It's east of the goblin village.",
    "When you're ready, meet me by Bandos's body, east of the Goblin Village.",
    "Hello, Player.",
    "I don't want any of the Bandosians noticing me. This tournament has them all riled up. Hundreds of them have already gone through.",
    "Yes, I wanted to talk to you alone. I can't think of a better way to put this, Player. I'm... dying.",
    "I don't mean from old age.",
    "You remember when Juna resurrected me using the Tears of Guthix? Well Juna and the Tears had nothing to do with it. It was Bandos who brought me back.",
    "Not freely. He had to give up a part of himself. But I was his Chosen Commander. He couldn't let me die.",
    "Maybe. I hadn't thought of it like that.",
    "When Armadyl dealt the finishing blow by staving in Bandos's skull, I felt it. I felt it like it was happening to me. A pain more intense than death. I passed out. I survived, but I began to weaken and sicken. I could feel what was happening. Without Bandos to sustain it, my borrowed life energy was slipping away. I went to see Juna, and she agreed. There was nothing she could do. She had guessed our fates were tied together, but neither of us anticipated the death of a god. Who would have expected it to happen in my lifetime?",
    "I was hoping to live out my days among my own people. Recently I have been longing for the comfort of the familiar. Sometimes I wonder if it would be better if I was dead already. Then Zarador wouldn't be hounding the Dorgeshuun.",
    "Thanks. If anyone can do it, I believe it's you.",
    "You're not the most comforting person to confide in.",
    "You must win the tournament so that the Dorgeshuun can be safe. It doesn't matter what happens to me.",
    "That's fine with me. If that happens, I'll lead them away somewhere so they're never a threat.",
    "Yu'biusk, maybe. That would be fitting. Perhaps it would even be possible to heal the land there. Speaking of which, I have kept you for too long. You must get to the tournament. It is not safe for any of my people to attend, but we've sent Grubfoot along to look after you.",
    "I will. Good luck! The fate of the Dorgeshuun rests with you.",
    "Go through the portal. Yu'biusk and the tournament await.",
    "How did your first round go?",
    "Did you kill him?",
    "You have seen for yourself how much Bandos values his followers. Still, he never seems to have trouble finding adherents no matter how he treats them.",
    "You take life so readily. Maybe you belong with the Bandosians.",
    "I'm pleased to hear you say that. Being among the Bandosians clearly hasn't affected you.",
    "I've heard of him. He did seem like a disturbed little goblin. Maybe he can find a new life.",
    "Well...each to their own, I suppose. I'm glad you didn't kill him, though.",
    "I'm tired, Player. I'm tired of being hunted. I'm tired of this old, dead god hurting me and my friends.",
    "Thank you for saying so. It's so strange to be standing here where he died and yet still in such danger.",
    "And you are mine, Player. I was worried I wouldn't see you again before the end.",
    "Thank you so much for everything you've done. For my people... and for me. No matter what, you will always be my friend. Oh! But I've kept you too long. The second round should be starting soon. You are needed on Yu'biusk. I'll contact you through Grubfoot if anything happens.",
    "After everything he's done? I don't understand you at all. I hope you will see this through for my people's sake. The second round should be starting soon. You are needed on Yu'biusk. I'll contact you through Grubfoot if anything happens.",
    "I expected to die. I guess the old monster managed it in the end.",
    "What are you doing back here? Don't you have a tournament to win?",
    "I know that weapon. I have seen it in my dreams!",
    "It is shaped in the symbol of Bandos. I must be recalling it from his memories. Why have you brought it here?",
    "Perhaps. The process of accessing Bandos's memories is not easy, though.",
    "Tired. I don't think I have long left. I want to see you win the tournament, and my people safe. After that, it doesn't matter what happens to me. I am grateful for what you're doing.",
    "I experience his memories as he did, feeling the way he felt. It is sickening, to revel in death and pain as he did. Exhausting, too. The memories come to me as dreams every night, but with effort I can summon them while awake. It is not something I would normally choose to do.",
    "Yes. Winning the tournament is the highest priority. You may find this distressing.",
    "I see it. The Kyzaj. It was made by the ourgs. Bandos made them, and they honoured him in return by forging a weapon as brutal as they were. Their battles to the death with the weapon pleased him immensely. Even the victor typically suffered terrible wounds. Its shape became the symbol of his power. When he invaded Gielinor, the symbol he branded his soldiers with was modelled on the weapon.",
    "Hold it vertically against your body with the axe-like part at the top. Take the weight of it with the lower hand and manoeuvre it with the upper hand.",
    "Yes! Good. That isn't how the ourgs wield them, but then the ourgs are much bigger. That's how the smaller races use them. It's heavier than you're used to, so widen your stance a little for stability.",
    "Yes, good. Now a taller wielder would strike with the whole of the blade, but you'll have to make quicker strikes with the protruding axe part.",
    "Good, then you can return to Zarador and finish this.",
    "I can look after myself. Focus on Graardor. If anything does happen, I'll contact you through Grubfoot.",
    "I don't want to die. But I'm going to die anyway. Maybe my death would assuage their bloodlust... but will you be able to live with yourself afterwards?",
    "What a morbid question. As chosen of Bandos, I will do everything I can to curb the destructive impulses of the remaining Bandosians. If I can, I'll encourage them to stay on Yu'biusk.",
    "What kind of question is that? You should let me live! If you don't murder me, I'll become chosen of Bandos and we can accomplish what we came here to do. What possible reason do you have for murdering me in cold blood?",
    "I've been rehearsing this in my head. Here we go... Hear me, brave peoples of Yu'biusk. I am Zanik, chosen commander of the Big High War God! Our god is dead. Our world is dead. Our way of life is dead. But we will not embarass ourselves any longer with futile attacks on weaklings! Those of you who are strong will join me here on Yu'biusk! We will do as Bandos would have wanted! We will test our strength, or we will die trying!",
    "Hello, Player.",
    "It's not exactly how I imagined things would end. It's better than being dead, and at least Dorgesh-Kaan is safe.",
    "I'm going to round up as many of the Bandosians as possible, and I'm going to lead them out into Yu'biusk.",
    "Well. It's been a long time since the great wars. The land is starting to recover. Perhaps somewhere out there is a habitable place. Regardless, I'm not letting the Bandosians threaten Gielinor or Dorgesh-Kaan again. This is the end of their story. A lot of them are really looking forward to it. Yu'biusk is like a holy land and the idea that they could live here again is very appealling[sic].",
    "You know...I actually feel better. Maybe it's something in the air, or the lingering presence of Bandos. I seem to be getting stronger rather than weaker.",
    "Yes, and we won't see each other again. I can't stay in contact with Gielinor. An army of goblins is too tempting a target for one of the other gods to try and recruit. Remember me. I will remember you. We humbled a god together. I lived my life in a cave, dreaming of adventure. Now I'm outside, going on one final adventure. There's a whole ruined civilisation out there. Maybe I'll even live long enough to uncover some of it.",
    "Goodbye, Player. When you're finished on Yu'biusk, please, return to Ur-tag and let him know what has happened. Wish him well for me."
  ],
  "Goblin": [
    "Me too busy with important digging and guarding. You talk with bosses to [east/south/north/west]. (Depends on your current location).",
    "Me do special move. Ka-pow! Yeah!",
    "Hope Big High War God not stay dead too long.",
    "Me gonna push someone in green floor for practical joke.",
    "Me miss Big High War God. Him very tall.",
    "Me think Zarador should put on more clothes.",
    "Yu'biusk not like how high priest said.",
    "Me should have been goblin champion. Me win easy.",
    "Me scared of Graardor.",
    "Graardor real big.",
    "Me think goblins should be in charge.",
    "Go away.",
    "I too important for questions. You leave.",
    "Whyyyyyyyy?",
    "Welcome to ogres.",
    "Better than more ogres I suppose.",
    "They a bit like goblins but much bigger and not clever.",
    "Haha! Human funny. Ogres nothing like ourgs.",
    "Supposed to watch them. Mostly just try not get trod on.",
    "That silly.",
    "You funny. Me think you drink lot of brown water.",
    "Hey ogres! Human think goblins are humans! Haha!",
    "Me a goblin.",
    "Good. Me want to make sure that clear.",
    "Just so long as you remember me a goblin.",
    "It okay. Hours not great.",
    "No! You try trick me! You no goblin, I no reveal goblin secrets!",
    "Me a goblin.",
    "You no hear? Me a goblin.",
    "Me. A. Goblin.",
    "Me taking care of the dumb races.",
    "Be quick, me very busy and important.",
    "They so stupid, they not understand simple talk.",
    "Me talk REALLY - LOUD - AND - SLOW.",
    "They pretty useless. Mostly all gone now. Not as good at surviving as goblins.",
    "Human couldn't do this job. Humans useless at diplomacy. Needs Goblin.",
    "Me busy with high priest stuff.",
    "What you want?",
    "It important?",
    "Okie then.",
    "High priest want foot bath. High priest want frog burger. High Priest want me to stand in sun, make shade. Me no like this place.",
    "High priest is very important goblin. Much more important than me. Me think very highly of him. So highly.",
    "No. Me scared of humans. They steal I spear."
  ],
  "Mountain troll": [
    "You wanna talk? Go talk with bosses to [east/south/north/west]. (Depends on your current location)."
  ],
  "General Bentnoze": [
    "Shovel is best to dig in rocks!",
    "Your fault as well, human! Make stupid cave girl hurt Big High War God instead of become Chosen Commander!",
    "You tryin' to lead now? Goblin more stronger than you too!",
    "Thanks human! Me always knew me was your favourite. Under leadership of Bentnoze, goblins be strong again!",
    "You so wrong! Red is best!",
    "That stupid! Wartface can't even choose right armour colour!",
    "You so stupid! Red is best!",
    "[He/She] killed Dad dad? You should have smashed [him/her] good! You clearly weakling.",
    "You the dumb-dumb, dumb-dumb!",
    "Your mum worst idea yet!",
    "Your face stupid!",
    "...",
    "Bwahahaha!",
    "Me knows! Goblins know legends of Big High War God from before time of much-war.",
    "Kyzaj Tournament how leader chosen. Decide strongest.",
    "You mean goblins!",
    "Me wanna commentate fights! Me be best commentator!",
    "Me better than you, stupid!",
    "It best tournament ever!",
    "Got packed crowd here today for round one!",
    "No one sure why Yelps goblin champion. Probably cos him disposable!",
    "Human champion! Player! Not human, cave goblin!",
    "Human fight for cave goblin.",
    "That cos you stupid. You do whole commentary wrong.",
    "Amazingly stupid!",
    "I can't hardly believe it. Dumb-dumb Yelps is gone.",
    "A winner is Player. It strong start, but other champions who isn't stupid awaiting!",
    "Dumb-dumb Yelps walk away alive!",
    "Maybe this sign that Player not cut out for way of Big High War God.",
    "Fight against stupid Yelps in first round! Anyway, not human, cave goblin.",
    "It troll champion, name of Lol!",
    "Not as stupid as you! At least troll good in fight, not like you!",
    "No way! You even weaker than Yelps!",
    "Wait! Round about to start!",
    "I'm like lol!",
    "I dunno but it sound funny!",
    "What this even mean?!",
    "Cave human goes through to next round!",
    "This final round! What you think of Kyzaj Tournament so far, Wartface?",
    "That right! Cave human far tougher than expected.",
    "Him smash everyone! When him finish smash human, me think him smash more people here just for fun of it! Him probably even smash arena!",
    "Smash?",
    "The lost frozen leader!",
    "The almost last of him race!",
    "GENERAAAAAAAAAL...GRAAAAAAAARDOOOOOOOOOR!",
    "Who that goblin?",
    "Boooo!",
    "Me not see that coming!",
    "If cave human kill Zanik, cave human get disqualified!",
    "But if cave human let Zanik live, Zanik become chosen of Bandos!",
    "Cave human coward stupid. Probably spare cave goblin.",
    "Me surprised!",
    "Strongest!",
    "Booo!",
    "Oh that right. Hail mighty leader!",
    "Big High War God dead anyway. Zarador say Graardor in charge - so what?",
    "Me not care what you say.",
    "Hey look! It cave human!",
    "You dumb-dumb!",
    "It great! Except for Wartface. Him ruin commentary with stupid talk.",
    "Hope there another tournament so can do commentary again without Wartface.",
    "That worst catchphrase. You worst at commentating.",
    "That not right! You tell story wrong stupid!",
    "Real story is, Wartface is dumb-dumb: punch Bentnoze for no reason.",
    "When we wake up, Chosen Commander already left. So came back to village instead."
  ],
  "General Wartface": [
    "No! Pickaxe is best you dumb-dumb!",
    "Why? They stupidest goblins. They hurt Big High War God, make him get weak and lose battle.",
    "You not strongest, goblins strongest. Only one of you. Loads of us. Graardor dumb-dumb.",
    "That stupid! Bentnoze can't even choose armour colour!",
    "You so stupid! Green is best!",
    "Thanks human! Me didn't know me was your favourite. Under leadership of Wartface, goblins be strong again!",
    "You so wrong! Green is best!",
    "Not as weakling as you, dumb-dumb!",
    "Your face worst idea yet!",
    "Your mum stupid!",
    "...",
    "Bwahahaha!",
    "Shut up! I tell them. Big High War God has tradition, old tradition. Kyzaj Tournament.",
    "Goblins beat trolls easy. Trolls stupid.",
    "Yeah I think-",
    "Goblins already in tournament!",
    "We only just got rid of stupid humans. Now we got to have another one?",
    "Shut up! You dumb-dumb! You worst commentator!",
    "No way, stupid!",
    "Welcome everyone to Kyzaj Tournament!",
    "All best races fighting to decide who best of best.",
    "Today, goblin champion Yelps in fight!",
    "Who Yelps fighting?",
    "That not look anything like cave goblin. Not green for a start.",
    "That crazy! Never seen anything like it! Me not even know what happening!",
    "You the stupid one! Still, this amazing opening round of Kyzaj!",
    "Round about to start!",
    "Finally!",
    "Me can't believe anyone would spare that stupid-head.",
    "Human made it to second round! How [he/she] do that?",
    "That right, cave goblin human! Anyway, who cave human fighting?",
    "Lol what? That name stupid!",
    "Me can throw big rocks just as well as troll! If me down there, goblins win easily!",
    "Me punch you in mouth!",
    "Troll goes down!",
    "What that even mean?",
    "Cave human Player goes through to next round!",
    "Player spares life of troll!",
    "Me no idea! It just another crazy, crazy round in Kyzaj Tournament!",
    "It be full of thrills and spills! Who would have thought cave human get to final round?",
    "Other finalist no surprise to anyone. Him smash round one, then him smash round two.",
    "Him the ourg with the um what rhyme with ourg?",
    "Close enough! Him the ourg with the smash!",
    "The ancient one from the time of much fighting!",
    "The smasher of cave humans!",
    "Me no recognise!",
    "Boooo!",
    "That unexpected!",
    "But Zanik cave goblin champion!",
    "That right! And Graardor win!",
    "What you think cave human do?",
    "Me think cave human kill her!",
    "Stupid cave goblin dead!",
    "Strongest!",
    "Boo- no, wait stupid! Zanik new leader!",
    "Graardor pretty dumb-dumb. Me not care what he say.",
    "Me not care what ourg say.",
    "What you say stupid! No one care what you say!",
    "I can see that, dumb-dumb.",
    "Me have best commentary. You stupid.",
    "Me working on catchphrase: 'IT SLOBBERKNOCKER!' Need work me think.",
    "You worst at everything!",
    "Was gonna. Then Bentnoze say he go. Clearly going stupid.",
    "So me stay. But then Bentnoze stay as well. So me punch Bentnoze.",
    "So me punch Bentnoze right back. Lots of punching, then fell asleep."
  ],
  "General Graardor": [
    "Stupid goblins, quiet or Graardor smash you both. Wait! It is visitor. It is Player!",
    "You NEVER question Big High War God! Stupid cave girl trick you good to betray Big High War God - me CRUSH her!",
    "You got pretty big mouth! Sound like Bandosian! Stupid cave girl trick you good to betray Big High War God - me CRUSH her!",
    "Graardor lead army here. We find hiding place of cave weaklings and smash them!",
    "Don't say that again. It make Graardor mad.",
    "You say p-word again and Graardor smash you!",
    "When Zarador told story, we all got mad. I smash table and also door, I so mad with stupid cave girl. Others hear story, they mad too, but they have no plan. As General, I make clever strategy and lead them.",
    "We all angry. Graardor the angriest. Graardor in charge.",
    "Graardor strong! Smash many goblin - human - birdman, with fists.",
    "You asking to be smashed?",
    "Shut up, Zarador. This important. Bork, you question might of Graardor? I WILL SMASH YOU!",
    "Oh, troll finally decide to pipe up!",
    "Good idea! Graardor want to smash you slightly less now.",
    "Graardor throw troll!",
    "Graardor not care about ork antics. You get smashed in face with fists like everyone else!",
    "You better! Anyone who not follow Graardor get smashed!",
    "What?",
    "...",
    "Hahahahaha!",
    "Yes. Kyzaj. Graardor remember. Graardor win, back in old days. Win many times.",
    "You doubt Graardor's might! You think Graardor lose!",
    "Then we hold Kyzaj! Graardor smash everyone!",
    "So you do know of Kyzaj.",
    "Good, then it settled. Zarador organise tournament. Graardor win tournament. Then we all come back and smash cave weaklings.",
    "Cave weaklings too cowardly for fight!",
    "Haha! Good plan! Then Graardor smash puny cave girl who weaken Big High War God!",
    "We have tournament like in old days. Graardor crush everyone then, crush everyone now!",
    "Haha! You not stand a chance in Kyzaj Tournament! This place for real Bandosians!",
    "So you beat puny goblin! Haha! Graardor beat puny goblin for breakfast and lunch and dinner already and it not even noon!",
    "So you through to the final round? Now you get crushed by me personally. That bottom line, cos Graardor said so.",
    "At last, Graardor come back to Yu'biusk!",
    "Feel wrath of Bandos!",
    "That right. Graardor not bother to smash cave if cave girl dead.",
    "Godsword still need finishing. Now more than ever. Probably spend most of time there.",
    "I will not follow cave girl! No matter what!",
    "Politics! Not way of Bandos! If cave girl lead, I take whatever forces still loyal and return to fight for Godsword!",
    "RAAARR!",
    "Strongest!",
    "Graardor in charge now! You beat Graardor in fight, and you kill cave girl like proper strongest. Graardor happy with you. But that not mean Graardor not smash you if you come looking for a fight!",
    "Graardor was having bad day. Next time, you get smashed good.",
    "Graardor big important leader now. Set priorities. Make strategy. Cave girl dead. No need to smash cave weaklings, they probably die anyway due to being so weak. People of Big High War God got no god now. All others got god. Gods strong. Already know solution to problem. Need Godsword. Godsword good for smashing gods. Graardor return to old frozen temple. Smash others. Get sword. Smash you good if you come visit for rematch! When you finished, you go visit cave weaklings. Tell them Graardor mighty!"
  ],
  "Bork": [
    "A pathetic minion of Armadyl. What brings one of your kind here?",
    "Our comrade from the holy war against Armadyl. What brings you to this place?",
    "This is no place for a human. What brings one of your kind here?",
    "However, the cave goblins have collapsed their entrance, so we are stuck here bickering.",
    "Present company excepted, of course. No one doubts your contribution.",
    "It is the role of the orks to rule over the goblins.",
    "I am indeed the strongest. Every day I battle Zamorakian mages and other, fouler things in the Chaos Tunnels.",
    "Graardor wouldn't know a strategy if it bit him in the-",
    "Don't tell me to enough! You're not in charge!",
    "What?",
    "...",
    "We orks have the same legend.",
    "You think goblins can beat orks?",
    "It doesn't matter what you think!",
    "An amusing thought occurs to me.",
    "It is not the way of Bandos to permit a surrogate champion as your weakling human nobles do. If memory serves, however, the champion may be served by a trained attack beast.",
    "I am the best there is, the best there was, and the best there will ever be. This tournament will be over quickly.",
    "It is brave of you to be here on Yu'biusk at all. This is no place for your kind.",
    "The others may mock your success in defeating the goblin, but to survive even one round is a praiseworthy accomplishment.",
    "Graardor has defeated me, and now it falls to you to defeat him in turn or die trying.",
    "A very interesting outcome. Hardly what I was expecting."
  ],
  "Zarador": [
    "Bandos told me of how you and Zanik weakened him by destroying his avatar.",
    "There is no other explanation. The god of war himself, bested by a big bird and his army of simpletons. We have already rid ourselves of the humans who failed so spectacularly to retrieve necessary supplies from the Wilderness.",
    "Zanik is all that remains, and we will have our revenge on Bandos's behalf.",
    "If that is what you think, then you know nothing of Bandos. Only the very strongest deserve the gift of continued existence. Everyone else must be removed. Crushing the cave goblins is exactly what Bandos would have wanted!",
    "We're losing focus here. Zanik and the Dorgeshuun are the concern.",
    "Yes, yes, everyone is very mighty and powerful. Now we need to get through the cave-in and kill Zanik. For Bandos!",
    "For the love of...",
    "We already have a leader. General Graardor can lead the attack on the Dorgeshuun. He has my allegiance.",
    "Enough!",
    "We don't have time for this.",
    "Don't listen to the human! [He's/She's] just trying to delay us!",
    "I would never question your might, General.",
    "This is ridiculous.",
    "I have no intention of fighting. Each race must choose a champion, and the ourg champion is clearly Graardor.",
    "Of course I do. I know all the old ways of Bandos.",
    "Well...the Dorgeshuun are indeed culturally distinct. Historically, Bandos always allowed new races to participate. Since he did not recognise them as goblins, they should be allowed to participate in their own right.",
    "I simply think that the Dorgeshuun should have the opportunity to elect a champion to participate. Perhaps...Zanik?",
    "Why?",
    "You are not a cave goblin. You cannot be their champion.",
    "Hahaha! Very well. Player will participate in the tournament as Zanik's trained beast.",
    "Would you prefer that Zanik participate as champion?",
    "Would you prefer us to resume our invasion of Dorgesh-Kaan?",
    "Then I suggest you take full advantage of whatever loophole is offered you.",
    "This tournament will be held in accordance with true Bandosian tradition. It is not intended for the weak sensibilities of humans.",
    "Very well. The tournament can only be held in the sacred site, on Yu'biusk. I will go there now to prepare.",
    "Bandos opened a permanent portal. It lies at the seat of his tower. Human, you should inform the Dorgeshuun that your delaying tactic has worked, but that their doom is only temporarily postponed.",
    "Thanks to you, I have a lot of work to do. Run back to your little cave goblin masters.",
    "Welcome to Yu'biusk, human. I believe you have been here before, correct? As Bandos's closest advisor and one of the few left who know the old ways, I am serving as Kyzaj Arbiter for this tournament. My word is law here, underwritten by holy authority. If you do anything to disrupt the tournament, the wrath of all assembled will fall on you. Being the outsider that you are, I assume you need me to explain the rules to you. Where would you like me to start?",
    "Summoning magic is not permitted. Beyond that, there are no restrictions. However, each round will include a special limitation or mandate. These additional rules are to be followed on penalty of forfeiture. You will be notified of such rules at the start of the round.",
    "Battles are to the death.",
    "I do not believe any Bandosian has ever asked that question. Technically, battles are until one participant is unable to fight. You could spare your opponent if you wished. You should think of it as a test of character, though. This is no place for the weak.",
    "You should know your role. You are the Dorgeshuun champion's trained attack beast. In the absence of the real champion, Zanik, you will be doing all the fighting. If you win, you win for Zanik. If you lose, you die, and her life is also forfeit. Of course, if Zanik were to meet with an unfortunate accident, that would also eliminate the Dorgeshuun from the tournament, and your presence on Yu'biusk would become illegitimate.",
    "Good, then you can find your camp and prepare.",
    "I just want this to be over as quickly as possible.",
    "Little human, you don't stand a chance anyway. I have no need of bias.",
    "All of the old peoples of Yu'biusk have champions. Even those of us who are nigh extinct. They each have a camp around the outside of the arena. Go and meet them if you want.",
    "The Dorgeshuun camp is to the west of here. It seems none of the cave goblins crawled out of the ground to attend.",
    "Regardless, some fans of yours have shown up. They are waiting for you. When you are done with your preparations, find me and we will begin the first round.",
    "Thanks to a combination of your interference and Armadyl's treachery, I am now the busiest Bandosian. I don't need you wasting even more of my time.",
    "Impossible. The humans were banished. They could never infiltrate Yu'biusk.",
    "What!? But that means any of the goblins here could be a threat! You're going to have to deal with this. Humans are your species, you sort this out. If the tournament is disrupted, I'll resume our invasion of Dorgesh-Kaan immediately.",
    "And do try not to kill too many real goblins.",
    "Well? Have you dealt with the rest of your miserable kind?",
    "Yes, you seem to have cut rather a swathe through the whole place. Did you bother checking whether they were human?",
    "Never mind. At least we didn't lose anyone important.",
    "Well?",
    "Why are you still standing here?",
    "As far as I'm concerned, you've succeeded in cleaning up after yourself - nothing more. Have you forgotten that you are about to fight in the Kyzaj Tournament? Your first fight will be against Yelps, the champion of the goblins. Make sure you're ready, and speak to me when you want to begin.",
    "Your first battle will be against the goblin champion, Yelps. The special rule for this round is that you may bring in as many goblin minions as you like.",
    "Well that is unfortunate, but your lack of diplomatic ability is not the responsibility of the Kyzaj. You could always bring in Zanik.",
    "As you wish. Are you ready to begin?",
    "It is time for the Kyzaj! Let none doubt the outcome of this sacred battle! The blood about to be spilled is spilled for Bandos! The bones about to be broken are broken for Bandos! FIGHT!",
    "Enough!",
    "You have prevailed. You exceed my very meagre expectations, but Yelps was hardly a serious contender. We will see how you fare in the next round against a real opponent.",
    "Your second battle will be against the troll champion, Lol. The special rule for this round is that you may not wear any armour.",
    "It is not the responsibility of the Kyzaj that your race has weak and easily punctured skin. Are you ready to begin?",
    "It is time for the Kyzaj! Let none doubt the outcome of this sacred battle! The blood about to be spilled is spilled for Bandos! The bones about to be broken are broken for Bandos! FIGHT!",
    "Enough!",
    "You have prevailed again. I did not expect you to make it this far.",
    "You misunderstand me.",
    "I had placed you with the other worthless humans.",
    "I had placed you with the other worthless humans who lost the war for us.",
    "With your performance so far, you have proven me wrong. Your place in the final is well and justly earned.",
    "More than that, though... I thought this tournament was a waste of time. I know you were only trying to delay us. But now we are here, now that Bandos's people are assembled... I am glad of it. Revenge was never Bandos's objective. His wrath was tremendous, but it was always the conquest, the war that drove him. Ultimately the Dorgeshuun are not that important. They are weak, yes, but crushing the weak is not as important as battling the strong. You are demonstrating that very fact here at the tournament. It is an inspiring lesson. There is one last test ahead of you. We will see if you are truly worthy. Before that, though, I must explain the rules of the final round. I didn't bother earlier, because no one expected you to make it. The Kyzaj Tournament is named for its final round, which is always fought using Bandos's most sacred weapon, the Kyzaj. For its duration, this is the only weapon that may be used.",
    "You could try training with it.",
    "Who else? Graardor. He first wielded the Kyzaj thousands of years before you were even born, and it was his expertise with the blade that earned him his rank. At this point I would consider either of you to be a worthy victor.",
    "You don't appear to have any space for the Kyzaj. Come back when you do.",
    "Here you are. Try not to be intimidated. It is heavier than you are.",
    "When you are sufficiently confident in your ability to use it, return to me and we will commence the final round.",
    "Are you ready to fight Graardor? Can you use the Kyzaj?",
    "It is time for the Kyzaj! Let none doubt the outcome of this sacred battle! The blood about to be spilled is spilled for Bandos! The bones about to be broken are broken for Bandos! FIGHT!",
    "Enough!",
    "Player is victorious! But before I declare the chosen of Bandos... According to the old ways, the losing finalist must live, to serve as lieutenant to the winner. But this is a very special Kyzaj Tournament, and we will commemorate it with bloodshed!",
    "Zanik! A cowardly cave goblin, afraid to fight, but not too afraid to betray her own god on the eve of his triumphant return!",
    "Zanik is a traitor and a weakling. She deserves death. Player! With the strength displayed in this tournament, you have proven yourself a true adherent of Bandosian ideals. Now I give you the opportunity to demonstrate your commitment to our cause. Kill Zanik.",
    "Zanik is an enemy of Bandos. She is personally responsible for his defeat. Unlike you, she has not proven her might in sanctified combat. In the name of Bandos, she must die. I am offering you this honour.",
    "As our talkative commentators noted, you are Zanik's trained beast. If she dies, you will indeed be eliminated from the tournament. However, all will know your true devotion to Bandos and your honour as the strongest.",
    "That is correct. But with Zanik dead, Graardor will have no need to attack Dorgesh-Kaan.",
    "Then she will become chosen of Bandos and our leader. I urge you not to take this course of action. She is a coward, a traitor and a weakling. She is no leader.",
    "Graardor...",
    "Very good. You have proven your devotion to Bandos's ideals and his memory. With Zanik's death, you are automatically disqualified from the tournament. Blood has been spilled and glory has been won! General Graardor has been chosen by the Kyzaj!",
    "However! Let none here doubt that [Player] is the strongest among us!",
    "Your presence has honoured this tournament. You are a true warrior of Bandos.",
    "Indeed. We will not forget him, or his ways.",
    "Words have never mattered to Bandosians. It is actions that count, and yours have pleased me greatly.",
    "Graardor is returning to the Temple of Lost Ancients. I will remain here, on Yu'biusk.",
    "This is our home. We will find a way, or we will die trying.",
    "It could never have happened. They would never have accepted a human as their leader.",
    "When you're finished on Yu'biusk, speak to Graardor before you return to the Dorgeshuun.",
    "You disappoint me, Player. I thought you had learned something from all this. I see now that I was mistaken. You are a coward and a weakling like all your kind. Nevertheless, I will not betray the ways of the Big High War God in this of all places. Blood has been spilled and glory has been won! Zanik has been chosen by the Kyzaj!",
    "You fought well in the tournament. You refused the opportunity I offered you, but... maybe I was wrong about Zanik. She is the Chosen Commander, after all, and what she says makes a lot of sense.",
    "He has refused to accept Zanik's authority. He and his most loyal followers have returned to the Temple of Lost Ancients.",
    "It could never have happened. They would never have accepted a human as their leader.",
    "When you're finished on Yu'biusk, speak to Zanik before you return to the Dorgeshuun.",
    "Glorious! Especially that dramatic part at the end. That was my favourite.",
    "He has returned to the Temple of Lost Ancients. We are now a godly faction without a god, and he believes that only with a godsword can we face the other factions.",
    "Welcome back to Yu'biusk. I trust it finds you well.",
    "The Kyzaj is a sacred weapon. You must take care of it! You're lucky that I had it retrieved.",
    "You do not have your Kyzaj with you.",
    "Glorious! Even your performance anxiety at the end couldn't spoil it.",
    "No. Her willingness to embrace her role as the Chosen Commander surprised and pleased me, and I applaud her intention to reclaim our homeworld. But someone must remain to remember Bandos and his ways. Humbly, I am the most knowledgeable one left.",
    "Not in the near future, no. The Kyzaj has spoken.",
    "He refused to acknowledge Zanik's authority and many who were loyal to him have followed him. He has returned to the Temple of Lost Ancients. We are now a godly faction without a god, and he believes that only with the godsword can we face the other factions.",
    "A great loss to this universe. He was a being of such unparalled vision.",
    "Only what he told me. He was the greatest warrior of the perfect warrior race. Ultimately he outgrew them all and by his own force of will ascended to godhood. His is an inspiring tale of what can be accomplished.",
    "When it became clear that we were losing the war, he began to speak to me as he had not before. He spoke of Yu'biusk, and that he regretted what he saw as his mistakes there. I assured him that Yu'biusk was his to do with as he pleased. He spoke of the people of Yu'biusk, and he pondered what he had done to them. I assured him that we were proud and joyous to serve at his feet once more, no matter what came. He spoke of the doom of his own people, long ago. I assured him that their role in history had been as the crucible in which he was forged, for which we were ever thankful. Finally he spoke of Guthix, and the trickster god's treacherous acts, and of how ultimately all the ills of Yu'biusk and Gielinor could be lain at Guthix's feet.",
    "I am not here all the time. Often when you are not here I am back on Gielinor. I do feel like I'm acclimatising though. Ourgs are naturally adaptable.",
    "Bandos was gifted with unparalled vision. While authoritarian halfwits like Saradomin seek only to rule over what exists, Bandos sought so much more. It was not enough to be worshipped by the flawed creations he found in the universe. Bandos was born of a perfect warrior race and required followers who approached that perfection. To this end he took the native peoples of Yu'biusk and over many thousands of years bred them as you may have seen humans breed animals, to encourage different characteristics.",
    "At first he divided the population into the larger, slower breed and the smaller, faster ones. These two were then further split until he had goblins, trolls, ogres, orks, ourgs, cyclopes and so on. Countless other species have been forgotten. Ultimately they were weak and of no use, and so it is only right that such uselessness is lost to us.",
    "To be the direct result of the divine plan of a god? No. You are without purpose or meaningful origin. I am a holy thing.",
    "We are the apex of Bandos's divine work to reshape life. Stronger, smarter and more loyal than any of the other peoples of Yu'biusk. Ultimately our perfection was our undoing as a species. With a handful of exceptions, my people fought bitterly and to the last even in the seemingly permanent absence of our god.",
    "To my knowledge, yes. Graardor is a revered relic from a past age. I am the last of a dwindled people.",
    "The ourgs were not wiped out in the god wars as many believe, but only a handful of our shamans survived. The last of them retreated to a hidden vale, believing it was more important to preserve the lores of their god than to die in battle as so many others had done. There they lived down through the centuries in seclusion, but they were broken and dispirited and their numbers dwindled until in the final generation only one was born. The elders passed on their knowledge of Bandos and his ways, and when the last of them died I left the vale and lived amongst each of the other peoples of Yu'biusk. It was from them that I learned to be a warrior and then an engineer. It was amongst them that I first felt the eye of Bandos on me and drew his attention with the clever use of cannon. I realised that my ancestors had been wrong to hide, but that without their error I would not exist and I would not be there at my god's side on his final battlefield.",
    "Zarador speak good! It is simply a matter of upbringing. I was raised by frail weaklings, and Graardor was raised amongst the greatest army Gielinor has ever seen. Had you noticed that Bork is also well-spoken? I wonder what his story is."
  ],
  "Dad": [
    "Trolls throw rocks! Rocks hurt! Dat make trolls strongest!",
    "You kill Dad dad. Dad eat Dad dad. Now name Dad.",
    "Trolls stronger than him. Throw big rocks. Heavy rocks.",
    "You killed Dad dad. Dad pretty mad about that. Dad not sure what to think now.",
    "Dat worst idea yet.",
    "Hah! Hah! Hah!",
    "Dad like to see Graardor try! Dad smack Graardor in face!",
    "Zarador scared to fight!",
    "Dat good plan, except for trolls win tournament easy.",
    "Dad not such a big troll. Needs to find bigger troll. Maybe look in Death Plateau.",
    "You pretty scrawny even for a human. Not think you last long.",
    "So you beat goblin, but now you up against troll.",
    "So you beat troll, but you never beat Graardor.",
    "So you beat Graardor, but you not as tough as Dad."
  ],
  "Goblin Maitre d'": [
    "This Yu'biusk. You supposed to be here, human?",
    "Haha! Me heard about that! So funny!",
    "Zarador at top of spiral. You follow up and round arena.",
    "Me cheering for you. Go cave human!",
    "You win! This why me cheer for you! You have look of winner!"
  ],
  "Grubfoot": [
    "Player!",
    "No time now. Entrants need see Zarador. We catch up later.",
    "Me here on behalf Oldak. Him wish you good luck.",
    "It okay. Goblin pretty tasty.",
    "Oldak help me use magic and we do some magic together. He help me make sphere of moving.",
    "Appeared in nursery. Matron not too happy about it. Working on better accuracy though.",
    "Big High War God strong but seems big bird stronger. Cave goblins seem pretty happy about it though.",
    "Him famous goblin runt. Him uncover fabulous treasure beyond all dream, then give it away. Crazy in head. Also him tie self up and get beaten by humans. Not normal.",
    "This not goblin. Him use fancy language!",
    "Maybe it good if other champions get poisoned?",
    "Hasn't you got thing to do?",
    "Except funny tummy. It make that worse.",
    "Lol is serious business. He massive. You watch out.",
    "For your second round you can only bring in weapons, food and potions. Let's see...",
    "Looks like you'll be okay to enter.",
    "If this weapon of Big High War God, maybe Zanik know. She share head with him.",
    "Yeah, she still lurking about.",
    "Got pro tip for fight. You try not to get smashed. Go get 'im!",
    "For your final round you can't bring any weapons other than the Kyzaj. Let's see...",
    "You have items with you that are not permitted in the final.",
    "Looks like you'll be okay to enter.",
    "I know Zarador fool you with big fancy words, but you mistaken about Big High War God. Him not want you to kill my friend Zanik.",
    "Was all good fun wasn't it? Seen old world of legend. Home of Big High War God! Pretty amazing. Stinks there though. Nice to come back to Dorgesh-city.",
    "Doing okay. Still not got hang of movey sphere. Work hard though.",
    "No that crazy. Old world dangerous. I no think those goblins make it."
  ],
  "Burntmeat": [
    "Hello Player!",
    "It's surprise! You can try later after chat with Zarador.",
    "It been a long time!",
    "Goooooooo Player!",
    "Haw haw! No, dere's no human in dere! Wiv all dis goutweed dere be no need for it. But...",
    "I can't absolutely guarantee dere's no goblin in dere. Sorry Mr Grubfoot.",
    "I been tryin' some new recipes dat Kris been tellin' me about. Dragon eye meatballs and goutweed rock cakes. Wanna try some?",
    "Here you go den!",
    "Dat great! I give dis to all da trolls den.",
    "You no like? Humans got such weird taste in food.",
    "It okay, humans are fussy eaters. You throw away all da good bits of cow and sheep.",
    "Way of trolls is way of Bandos. We not change just because he gone.",
    "Yes! 'Im die in war wiv big bird god!",
    "I didn't 'ear 'im say that.",
    "Dat not sound good.",
    "Guardin' cookpot!",
    "Still guarding pot from humans!",
    "You did it! I wus worried dere for a second.",
    "Lol dad friend of my dad. Lol is not friend of Burntmeat though.",
    "Maybe just hit things wiv it?",
    "You had good run so far, but Graardor gonna smash you. Sorry, you got no chance.",
    "I knew you do it. I have absolute confidence in friend Player."
  ],
  "My Arm": [
    "Hello Player!",
    "Me think Zarador need to see you, best no make him angry.",
    "Player!",
    "We come to cheer for you!",
    "Nah. We not into all dat politics. We cheer for friend.",
    "We made dis little camp for you to rest at. I brought dat bank chest to change your gear at and Burntmeat been cookin'.",
    "I'm still growin' dat goutweed we got. Fillin' da troll stocks is hard when dey eat it s'fast as I grow it. Other den dat, I been trying to do some explorin' but da goutweed supplies need fillin' all da time.",
    "Wait, Big High War God is dead?",
    "Oh, dat explain big tournament. Wondered what it was about. Terrible at current events, me.",
    "No. Zarador say 'im sending around a goblin to tell us.",
    "Dis must be de messenger from Zarador.",
    "What you say?",
    "Check 'is body, 'e might 'ave somefin' on 'im.",
    "Aha!",
    "Okay. We be here if you need us.",
    "Back so soon?",
    "I knew that Player had it. Yelps is no match for human friend. You can rest here and use da bank chest. Burntmeat's cauldron will recover all da troubles you get from the last round.",
    "Zanik still outside portal on Gilly-nor. You go talk to her, make sure she okay. If she die, you forfeit tournament.",
    "Met Lol once when was little. He push me over. You beat him.",
    "Dat big weapon for human!",
    "Dis big fight! Hope you ready! Graardor mean business.",
    "Yeah! You winner! My Arm is friend of winner!",
    "Haw haw! Was great! Never seen anyfing like dat! Hope dey put on anuvva one soon.",
    "Shame you had ta kill 'er but I guess Zarador made a convincin' argument. I just 'ope I nevva get chucked in a pit wiv you!",
    "I never 'eard of 'im before dis tournament. He's a pretty good fighter. Nuffin' on you of course!",
    "Haw haw! Was great! Never seen anyfing like dat! Hope dey put on anuvva one soon.",
    "Naw. It sounds like pretty good adventure but I couldn't just leave. Dese herbs might die if I done that."
  ],
  "Goblin guard": [
    "Me keep eye on all this goutweed.",
    "Me better than other trolls.",
    "Me look after trolls.",
    "No one allowed to see secret weapon.",
    "Why these goblins be so uncouth?",
    "Guarding secret weapon certainly important.",
    "Stop! I protect secret weapon for tournament!",
    "Who are you?",
    "Wot?",
    "'Kay.",
    "Nuffin'.",
    "No I ain't.",
    "No reason.",
    "Look would you just leave me alone, alright! I don't have to answer your questions!",
    "Eh.",
    "Meh.",
    "No.",
    "Will you stop your ceaseless prattling!",
    "Nah.",
    "No.",
    "Cos.",
    "It's none of your business! Go away!",
    "Wot?",
    "Me name Trowel. Me be guarding this goutweed.",
    "Me glad to tell you about them.",
    "It grown up in Trollheim of course.",
    "It name since it the first thing me eat. Me eat trowel so name Trowel.",
    "Me not a human! Me have many non-human characteristics!",
    "Cos me a troll."
  ],
  "Lol": [
    "I'm Lol.",
    "Morningstar was my brother. Trolls gonna smash Burthorpe!",
    "You got a big mouth, but whatcha gonna do when Lol runs wild on you?",
    "Eat. Sleep. Fight. What, you think I have a day job? Plumber, maybe?",
    "Dad get me here because I'm the strongest troll. Win tournament for trolls.",
    "Why you think? Same as all troll, named after first thing I eat.",
    "Eat stupid human called Lol. Now my name is Lol.",
    "That all he say. Lol, lol, lol. Must be his name.",
    "Hope you ready for rock in face, human. Time to fight Lol!",
    "ME SMASH YOU WIF BIG ROCK!",
    "TIME FOR DA BIG BANG!",
    "Trolls will have Burthorpe, den tha world!",
    "You kill my bruvver, but spare me? Don't fink I'll be grateful for this. Burthorpe still gonna fall.",
    "Don't speak to me, human. Not only you beat me, but you save me. Should have killed me."
  ],
  "Farkle": [
    "Me Farkle! Me mighty ogre champion. Me win tournament easy, prove ogres are strongest.",
    "Me do impression of you - listen! Blah blah blah me stupid human! Please no hurt me! You like that human?",
    "Haw! No way, human!",
    "Haha!"
  ],
  "Hobnob": [
    "What do you want, human?",
    "I'm Hobnob - mightiest of the hobgoblins. You must be Zanik's trained attack beast. Zanik must be a really jammie dodger to have a human stand in for her.",
    "I'm ready to take everyone down. This tournament will be a slam dunk.",
    "I'll crunch you into cream!",
    "We'll see!"
  ],
  "Goblin ork": [
    "Me gettin' bored standin' 'ere.",
    "Me ork.",
    "Ork, ork, ork, ork.",
    "Me ork.",
    "Me ork.",
    "Big ork tell dis ork to be ork.",
    "Be ork.",
    "Sometimes me make orky sounds, but mostly just stand here.",
    "Is hard being an ork. Is much easier pretending to be a goblin.",
    "Nah, I'm a goblin in disguise ain't I?",
    "Youse talking crazy talk.",
    "Uh... me ork?"
  ],
  "Mono": [
    "Hullo.",
    "Mono.",
    "Cyclops.",
    "Fight."
  ],
  "Goblin cleaner": [
    "We cleans the campses, yes we does, dearest.",
    "We is so happy beings a goblin, yes.",
    "What's it got in its pocketses?",
    "We is but a humble goblin cleaner, dearest, yes, tasked with setting up and cleanings the campses.",
    "We can answer its questionses, can't we dearest?",
    "Oh no, dearest, the campses needs more furnitures in them to make the peoples happy, yes.",
    "Of course they does, silly! What does it thinks they are, trollses?",
    "When we arrived here it was all dusties, yes it was dearest.",
    "Yes, dearest, exactlies.",
    "What's it saying, dearest? It thinks we're a filthy spy, yes. But we're not, no!",
    "We's from the Pointiest Stickses tribe, yes."
  ],
  "Yelps": [
    "Helloooo! I'm Yelps!",
    "I'm Yelps, the richest and smartest goblin that ever lived. It comes in handy, because I'm also the smallest goblin that ever lived. I'm an entrepreneur! A self-made man!",
    "I used to run this game, see? Lucky people would punch me in the face to win prizes!",
    "That's right!",
    "Well, the game I used to run all sort of fell through. It turned out the treasure I was givin' away actually belonged to some human princess or something, so I had to give most of it up. She's still runnin' the game but... *shudder* There's no punchin'. Not even a bit! There are... treasure chests! I've been trying to reintegrate into goblin society, but it's not going so well.",
    "The high priest told me to get my best gear on and guard the camp! Here I am!",
    "Not on yer life! I'm no warrior!",
    "WOOHOO! Extra spin for the win!",
    "I ain't paying you to stand around - give me a hand!",
    "I'm gettin' beat up here! You, protect me!",
    "What are you doing? I'll give you all the spin tickets! All of 'em! Noooo!",
    "You're a diamond geezer, mate. 'Ere's a little somethin' to say thanks.",
    "I really do appreciate you letting me live, y'know.",
    "Don't tell anyone, but I'm rooting for you.",
    "You did it! I knew you could do it!",
    "Hey, if it isn't my favourite human! How ya doing?",
    "I got a job as Wartface and Bentnoze's manservant. Since Grubfoot left for Dorgesh-Kaan they've been doing their own cooking and cleaning and it has not worked well, let me tell you. It's good honest work, but to be honest I miss the pomp and the razzmatazz of the game show scene! I've heard there are a couple of fellows who do some sort of show in some sort of pit. I thought I might apply there."
  ],
  "High Priest": [
    "Me important overseer of Kyzaj Tournament."
  ],
  "Goblin Messenger": [
    "Greetings human! I bring you a message from the great Zarador! I have the information you need regarding your upcoming fight!",
    "Who, me? I am from the tribe of goblins that live in that stinking old village.",
    "Er... yes. I just call it the village because it is my village.",
    "In the first round you will be fighting the goblin champion, Yelps.",
    "He is certainly tough though, after all those beatings.",
    "You sum it up perfectly. I do not know how he became champion of the goblins though. Bandos despised him.",
    "Me? No, I would never utter the name of the Big High War God. That would be blasphemous.",
    "See? Not even this fine troll gentleman heard what you think you heard.",
    "Anyway, you have the information, so I must head back to that fool Zarador.",
    "Er... Zarador needs me for other important duties. I must go.",
    "Well, he is! He has no right to exclude us from the tournament! He declared himself Arbiter! On whose authority?"
  ],
  "Human Infiltrator": [
    "Enough of this deception! I am a true Bandosian, no matter what Zarador and his lapdog Graardor might say. Bandos was my god and I fought valiantly for him on the field against Armadyl!",
    "If humans are denied access to this tournament, then the only truly Bandosian response is to prove our strength by force! Starting with you!"
  ],
  "Goblin Guard": [
    "As long as they are not about the secret weapon!",
    "It is for the final round, you are not allowed to know unless qualify.",
    "Zarador has commanded it. Only General Graardor seen it thus far.",
    "Yes, he does.",
    "Sir! Yes, sir!",
    "No, I am as much a goblin as the next fellow.",
    "Er... mind 'ow you go, guvnor?"
  ],
  "Human infiltrator": [
    "Then defend yourself, knave!",
    "This was a ridiculous assignment anyway!",
    "So be it!",
    "Fine! You've uncovered me, but why are you betraying your own kind?",
    "Then die!",
    "Blast! And after I put all that research into it!"
  ],
  "[Grubfoot/Burntmeat/My Arm]": [
    "Found any humans yet?"
  ],
  "Congratulations! You have completed": [
    "'Squeal for Coins' - Claim the coins from Yelps' cash bag after fighting him.",
    "'Bandos's Memories' - Recover all 14 of Bandos's memories on Yu'biusk."
  ],
  "Oldak": [
    "While I understand that sometimes the ends justify or necessitate the means, in this case I cannot personally condone your course of action.",
    "Yes! I'm glad to see that our city was once again not destroyed.",
    "All is well indeed. I've recently had the opportunity to work with dwarven technology and I can see real benefits to our people in ten, maybe twenty years.",
    "I fear young Zanik has let her optimism get the best of her. There is no way she can survive on Yu'biusk. She, and her followers, are likely already dead."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:The_Mighty_Fall?oldid=36193359’"
  ]
}