{
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "Some of dialogue.You can discuss this issue on the talk page or edit this page to improve it."
  ],
  "Orlando Smith": [
    "Hang on a minute!",
    "Alright, mate! I'm glad you came along! Someone of your adventurin' caliber is just what I need.",
    "Alright, mate! I'm glad you came along! Someone of your adventurin' caliber is just what I need.",
    "Word travels, mate! You've got quite a reputation.",
    "You're certainly well known, mate.",
    "Hopefully somethin' that'll change my career and fast. I've been an apprentice up at Varrock museum for years. They've never let me become fully qualified. To be honest mate, they're going to get rid of me if I don't come up with somethin' soon. They think cause I spend all my time chasin' this 'dream', as they call it, I'm not museum material. But I can't ignore somethin' like this! I'm not just going to abandon what could be the most important historic discovery of our lifetimes! They just don't see it like I do.",
    "Well, to be quite honest mate, I'm not really sure. I know it has somethin' to do with Guthix. Perhaps an old Guthixian temple, or a forgotten stone circle. We know so little about Guthix, anything would be a breakthrough. I just hope it's good enough to save my career.Course, I'll only really know when I get these bloomin' doors open, which is where you come in.",
    "Well, I might need you for a bit more than that. See, it could be dangerous down there.",
    "I couldn't say, mate. I've got no idea what could be behind these doors, see. But you have to take into account the usual dangers of opening ancient tunnels... Traps, boulders, cave spiders, potentially bein' buried alive, undead monsters, noxious underground gases - that kinda thing. It'll probably be fine, but it could be good to have someone to lend an 'and - make sure I get back to the museum in one piece. What d'ya say?",
    "Fantastic! I won't forget this mate. You're helpin' me to get my life back! I'm all set. To tell the truth, I've been tryin' to get these doors open for ages. So, just lead the way when you're ready. And remember; anything could be down there, so you'll need to prepare for the worst.",
    "Well, I could really use your help, mate. My career depends on it. Come back if you change your mind.",
    "Guthix is a god, mate! Beyond that, there are various beliefs, but here's the most common. It's believed that Guthix was the first god to come to Gielinor; shapin' it in his vision. He brought us humans in, amongst others. Belief has it that Guthix lives off balance. 'e thrives from us livin' in harmony. So, back in the Third Age, over 2000 years ago, when the other gods came along and started fightin'...well, Guthix just up and banished 'em all! It's believed he's the reason the gods can't live on Gielinor. That's the druidic perspective anyway. As I say, we really know so little about 'im. Any historic sight even related to 'im could extend our knowledge considerably.",
    "I'm all set, so lead the way when you're ready. Remember - there could be anything down there, so be prepared for the worst.",
    "This is it. I knew it! The museum will have to recognize this! All these years, and I'll prove them wrong! We need something to take back: something that can be dated to prove this discovery. It needs to be related to Guthix, too. No doubt they'll laugh in my face when I return, but if they see proof it 'll be a different matter.",
    "We must find something to take back. If I go back to the museum empty handed they'll just laugh at me. If I turn up with proof, they'll have to listen to me.",
    "Fascinating! The drawing is so beautifully preserved! And what strange subjects; clearly not human, but humanoid in their features. In all my years of research I've never seen creatures like these. Perhaps they were an ancient race that died out - perhaps even early humans. So many questions that could be answered! We shouldn't touch the parchment. It's far too delicate after all this time. We'll have to find something else for now.",
    "How strange. What we know of Guthix indicates he was a pacifist; completely against war. The sword looks like it has been recovered, and for it to be placed in such a prominent position... there are so many things we could learn. However, it looks dangerous. We should not attempt to move it without special equipment. It could be a weapon of the gods, after all.",
    "These must be the legendary creatures. It is believed Guthix turned to individual beings to retain balance while he slept. How curious that the snake displays what we now recognise as the symbol of Guthix. It is believed this symbol was attributed to Guthix by his followers, but this could show its origins are far more ancient. This tableau is far too big to move. We should look for something else.",
    "These must be the legendary creatures. It is believed Guthix turned to individual beings to retain balance while he slept. How curious that the snake displays what we now recognise as the symbol of Guthix. It is believed this symbol was attributed to Guthix by his followers, but this could show its origins are far more ancient. This tableau is far too big to move. We should look for something else.",
    "These must be the legendary creatures. It is believed Guthix turned to individual beings to retain balance while he slept. How curious that the snake displays what we now recognise as the symbol of Guthix. It is believed this symbol was attributed to Guthix by his followers, but this could show its origins are far more ancient. This tableau is far too big to move. We should look for something else.",
    "Look, Player! We seem to have triggered a hidden doorway! Now that's got to be a sign if ever I saw one - let's go.",
    "It looks like we triggered something at the far end of the room. We should investigate!",
    "A butterfly, rumoured to be Guthix's first form on Gielinor. This is perfect! a manageable size and it seems to be made from some kind of metal. If we're careful, we can certainly take this back to the museum as proof!",
    "Odd... There must be something fixing it to the pedestal. I can't see anything...",
    "Well, I don't see what good it'll do, but I won't stop you! Perhaps it's just needs a bit more muscle.",
    "This is fantastic! We seem to have triggered some kind of ancient alarm system. This is incredible!",
    "Amazing! It seems like ancient Guthixians had some kind of advanced magic, or even machinery! These rooms can extend much further than I imagined!",
    "Come on, Player. You're supposed to be the adventurous one! Let's go!",
    "This is fascinating...it seems like the ancient Guthixians had some kind of advanced magic, or even machinery! These rooms could extend much further than I imagined!",
    "Come on, Player. You're supposed to be the adventurous one! Let's go!",
    "I can't believe this, mate. I expected to find something, but...this is beyond imagination. Who knows how far these chambers reach?",
    "That'll just be a ancient remnant. I haven't seen any movement since we came in; whatever defends these halls must be long dead. No, I need to return to the museum with as much as possible. I could impress them with relics from the first room, but if we discover a whole new full of history it'll blow them away! Let's go!",
    "No! We're humans! Please, we mean you no harm!",
    "Please, listen to us!"
  ],
  "Player": [
    "Thanks! So what are you up to here?",
    "So what are you up to here?",
    "What do you think you've found?",
    "Dangerous in what way?",
    "Shall I have a go?",
    "Oh no!",
    "Shouldn't we be cautious?",
    "Shouldn't we be cautious?",
    "What about the alarm? Shouldn't we more careful?",
    "We're not Mahjarrat!",
    "Orlando? Is there something you're not telling me?",
    "Orlando, stay back!",
    "Who are you, Mahjarrat?",
    "I don't have time for guessing games.",
    "Sliske? What are you doing here? You were the Mahjarrat the automatons were looking for!",
    "I hardly see how Orlando's death is funny.",
    "What are you doing here, Sliske?",
    "What do you mean?",
    "So this place isn't abandoned. Guthix is here somewhere? What does this mean?",
    "That sound... it's the alarm I set off in the caverns. Is it coming from the sword?",
    "But they're not all in Guthixian hands now!",
    "That's Zemouregal! Trying to scare me with illusions again, Sliske?",
    "I thought Saradomin was benevolent. Wouldn't he be opposed to killing Guthix?",
    "How so?",
    "Why wouldn't you just kill Guthix? It would allow Zaros to return, after all.",
    "So how do I come into this?",
    "Aren't you going to 'deal' with me?",
    "I already know what is happening here! You're trying to get to Guthix.",
    "I'm afraid you'll have to. I need to get to Guthix.",
    "I'm sorry, then, but you'll have to deal with me first. I need to get to Guthix.",
    "I'm not running away. I need to get to Guthix.",
    "I was helping an archaeologist explore. I touched a statue and the doors just opened... I set off the alarm.",
    "You don't strike me as Guthixian",
    "Thank you.",
    "I suppose so.",
    "So you couldn't kill me now?",
    "Were the God Wars really that bad?",
    "What if we just woke Guthix up?",
    "Another like us? What do you mean?",
    "You mean like you and Fiara?",
    "So you can defend from everything?",
    "We're all on the same side. We just need to worry about getting to Guthix.",
    "That's true. So can you tell me what created the Fist of Guthix now?",
    "Stop, we're on your side!",
    "Yes. Who are you?",
    "A very long time. Don't you know what year it is?",
    "Do you have a name?",
    "Continue? Where else is there to go?",
    "In what way?",
    "What... what was that?",
    "That's enough! All of you!",
    "We made it this far, didn't we? We have the head start on our enemy; all we need to do is defend this area and the battle is ours.",
    "If we just give up now, Guthix will be killed and the edicts will fail. The gods will return and the world will be in chaos once more. Another God War will erupt, with no one to stop it. Is that what you want?",
    "Yes, our enemies are powerful - but so are we! We each have our own strengths, whether they be physical prowess or great intelligence. What's more, we are united while the enemy bicker among themselves. Together, we will taste victory!",
    "There's no reason to be worried; look at our enemy. They will be so distracted bickering with each other that we will have the upper hand! Together, we will taste victory!",
    "Did Guthix grant me power for no reason? Follow me, and we will taste victory!",
    "Guthix is your god. It is your duty to defend him as he would defend you! Would you just leave your god to be killed in his sleep?",
    "What do you think will happen if we just give up? There is no running from this. If we surrender, they will come in here and slaughter us where we stand! If we run, they will kill Guthix, and then come for us. Which option do you prefer?",
    "It's no use falling apart now, with the enemy on our doorstep! If you don't believe we can win then we have no chance! You need to believe in yourselves!",
    "Look at our enemy. Yes, they are powerful and experienced. Yes, they have been planning. But we have the advantage. Our enemy is comprised of factions who are at war with each other! They will be distracted from their cause, if it means getting at each other. They are an unorganised shambles!",
    "That's the spirit! We'll show them what we're made of! First, we need to be prepared for them. Cres what can you tell me about this chamber? Any weak points? Resources we could use?",
    "Perfect. We should split up to defend each wing. Cres, you take your creations to one. Fiara and the Valluta, another. Chaeldar and Thaerisk, you'll need to work together. Death, you're on your own. I'll help wherever I am needed. Now we just need to decide who will defend where.",
    "How should I assign the defenders?",
    "Can you tell if anyone will be killed?",
    "What about the other Guthixians, and yourself?",
    "Let them come, and find us waiting.",
    "Turn back now. You will go no further.",
    "We've been expecting you.",
    "I wouldn't speak too soon.",
    "If you ask me, pathetic is being beaten by your own creation, begging for help and then fleeing...",
    "K'ril Tsutsaroth, the Zamorakian general. You're late. I've already dispatched Graardor and Zemouregal.",
    "Enakhra, I have already defeated Zemouregal. What makes you think you will do any better?",
    "What happened?",
    "I will face her.",
    "I'm afraid so.",
    "I will side with neither. I want to destroy Guthix.",
    "Another Mahjarrat?",
    "Char, I would have thought you would want to kill Guthix. You certainly wanted to kill me when we first met.",
    "I just wondered if I could ask you a few questions.",
    "What do you mean?",
    "You don't sound entirely sure.",
    "Yes, Zemouregal was certainly very pleasant...",
    "Wahisietel... I've heard your name.",
    "Yes, Zemouregal was certainly very pleasant.",
    "Guthix!",
    "What just happened? Are you injured?",
    "You knew what was happening outside?",
    "Guthix?",
    "Your past? Where are we?",
    "Your homeland?",
    "I don't know.",
    "What about the gods?",
    "What is this? It doesn't look like any race I've seen.",
    "You could have stopped Sliske. Why didn't you?",
    "It was Sliske.",
    "He must have waited for our backs to be turned, for our defences to be down. Sliske struck a killing blow to Guthix before I could reach them.",
    "That's enough! Do you really think this is the time for bickering! Guthix is dead; his edicts are broken.",
    "I can stop them. In his last moments, Guthix spoke to me. He granted me-",
    "In his last moments, Guthix spoke to me. He granted me-",
    "In his last moments, Guthix spoke to me. He granted me-",
    "I know who you are, Saradomin."
  ],
  "Automaton Guardian": [
    "WARNING: Mahjarrat lifeform detected. Mahjarrat will not be allowed to passage. Retreat before further action.",
    "ACTION: Mahjarrat lifeform remains. Prepare for elimination."
  ],
  "Automaton Tracer": [
    "REPEAT WARNING: Mahjarrat lifeform detected. Mahjarrat will not be allowed to passage. Retreat before further action."
  ],
  "Automaton Generator": [
    "ESCATALED WARNING: Mahjarrat lifeform remains.The threat will be eliminated. Retreat before further action.",
    "WARNING INEFFECTIVE. ACTION: Mahjarrat lifeform remains. Prepare for elimination."
  ],
  "Shadowy Figure": [
    "You should not have come here.",
    "I have lain undisturbed for thousands of years.",
    "I have banished gods and razed their followers!",
    "What mortal dares to wake me from my sleep?",
    "Who dares stand before the mighty Guthix?",
    "Ugh...humans. So subservient. Grow a backbone.",
    "You question me? Good, you may have an ounce of intelligence.",
    "You have some courage, then! But on the other hand, minimal intelligence. Standing against a being of infinitely greater power than your own shows a distinct lack of regard for your life."
  ],
  "Sliske": [
    "Well, we've established I'm not Guthix. Considering those automatons wanted to kill me, I think we can safely say I'm not Guthixian. I haven't killed you yet, so we can presume I'm not a Zamorakian, either. What do you think?",
    "Oh, fine. I had hoped you'd be some fun, but you are only human. You can call me Sliske.",
    "Mm, it rather spoiled it that they could sense me. Ah well, just a bit of fun.",
    "You and I clearly have different tastes in humour.",
    "Oh, so many questions. 'Who are you?' 'What are you doing here?' Can't you work things out by yourself?",
    "Well, I've been following you since your lucky escape at the ritual. Akrisae is acceptable, but I don't feel that my collection is complete. I was just waiting for the right moment, but then things became a lot more interesting.",
    "Oh, so many questions. 'What are you doing here?' 'What do you mean?' Can't you work things out by yourself?",
    "Let's look at the clues. You've stumbled into some underground chambers and there's clear evidence that these are Guthixian. You set off a defence system that - for some reason - is still active. Oh, and in case you didn't notice, only you could open the doors. I think we can also assume that I have better things to do than to pose riddles to you, so this must be important. Actually, that's not true; I am quite enjoying watching you struggle to understand the situation. But this is still important. Any clue yet? Even an inkling? I'll assume not. Let me put you out of your misery. This place is not empty. Not in the slightest. Guthix himself is still sleeping, deep down beneath these chambers, and you managed to unlock the entrance.",
    "Oh, Zaros above! Rid me of these incessant questions! It seems I must explain everything to you. Guthix and his edicts are the only things stopping the other gods returning; Saradomin, Zamorak, Zaros, and more. There are many beings on this world who have been waiting for this for thousands of years. You're in real trouble.",
    "Well, let's go have a look, shall we?",
    "When you have lived for thousands of years, Player, you pick up bits of knowledge here and there. Those of us who were around to see our gods banished knew Guthix remained somewhere in this earth. It was a question of where. Through the ages, most of us gave up the search...actively, at least. To most, it seemed like such an unattainable goal, and our minds became focused elsewhere. But it has always remained in the back of our minds. Always that spark that Guthix would be revealed, and our gods could return. No one will have forgotten. Allow me to show you.",
    "Guthix's warning, a reminder of his edicts. Thousands of years ago, Guthix plunged this sword deep into the land you now know as the Wilderness, ending the God Wars that had raged for centuries. With that action, he banished the gods from Gielinor and established his edicts; laws to prevent the gods from returning. As long as the edicts stand, the banished gods are restricted even in their influence on the world.",
    "Yes, the sword is transmitting. It has been since you triggered the system in Guthix's chambers. It's communicating with the stone circles across the world. When they were created, the stone circles were all in Guthixian hands; it would have been a very effective defense system.",
    "Indeed. If someone- In fact, it seems like it has already been noticed. Quickly come with me.",
    "Stay quiet. I have concealed us in the shadow realm, but we may still be heard. This is Zemouregal: a powerful Mahjarrat servant of Zamorak. He would not take kindly to intruders. With you being a human, and me being...well, me, we may be some of his least favoured visitors.",
    "For once I am not, Player. Stay quiet. I have concealed us in the shadow realm, but we may still be heard.",
    "As idiotic as Zamorakian followers are, it won't take them long to decipher the origin of the alarm. We had better move on with haste.",
    "Zemouregal will not be the only one to have learnt of this. The gods may not be able to interfere with the world while Guthix's edicts are in place, but they can still sense what is happening upon it. And communicate with their followers. Beneath us lie the so-called 'God Wars' caverns. There, generals of the gods continue the battle that was started thousands of years ago, oblivious to the passing of time. Until now.",
    "Zilyana: Saradomin's primary pawn.",
    "Things are not always so black and white, Player. Saradomin may strive for 'justice', but that's not always the kindest path. Besides, this is Zilyana, not Saradomin. She is a devoted follower but her god is not here to stop doing something he might find unsavoury. Now I've shown you what you're up against - or at least a part of it. We should get back. We don't want the fun starting while you're away.",
    "Zemouregal and Zilyana are on their way, and they won't be the only ones. They will unite under a common goal: to kill Guthix and remove his edicts from this world.",
    "Oh, I just felt like educating a less fortunate being.",
    "It seems you know me too well already.",
    "You know me too well, it seems.",
    "It is true I would not be here if it didn't hold some value to me.",
    "As you have learned, Player, I am a Zarosian.",
    "As you know, Player, I am a Zarosian.",
    "I am here to represent our view. While the Saradominists and Zamorakians will strive to kill Guthix, we are proposing that this does not have to end in death and destruction.",
    "We believe that Guthix can be awoken and bargained with. He is a creature of great intelligence, and there will be a way we can sway him. They don't call me serpent-tongued for nothing.",
    "You are wise to be suspicious; it is a useful trait. And it is true that killing Guthix would be beneficial, but it would be better to both facilitate the return of Zaros and learn the secrets of an ancient being. We will not kill Guthix. You have my word.",
    "You are the centre of this event, Player. You are the one who opened the doors. You have shown that you have power enough to potentially disrupt plans you do not agree with. All sides will want to recruit you, or destroy you if you pose a threat to their goal. The time will come when you will have to choose where you stand. The Saradominists and Zamorakians will wish to kill Guthix. We Zarosians will want to awaken Guthix. The Guthixians will, of course wish to protect him. You will have to choose which path you want to take, Player.",
    "Well let us just hope it is the right one. I would concentrate on the matter at hand first. What is important now is that you reach Guthix first. Others are coming - and coming fast - so you must hurry.",
    "If I knew the route, I would be there already. Remember: no one coming in has any idea what they will find here. Your best bet would be to side with the Guthixians until you reach Guthix, if they arrive in time. They will have a better understanding of Guthix: how he may have built this place and how to get through his defences. Now go, before-",
    "Too late. Good luck, Player. Try not to get killed, it would be incredibly inconvenient.",
    "Too late. Good luck, Player. Try not to get killed, it would be incredibly inconvenient.",
    "Then you may decide to fight against every side. I can't say it sound like the most sensible plan, but you will only have yourself to blame. What is important now is that you reach Guthix first. Others are coming - and coming fast - so you must hurry.",
    "Well now, I don't have an answer for that. In fact, I do. You shouldn't.",
    "Zemouregal is another Mahjarrat. While I stand with Zaros, he worships Zamorak.",
    "Zilyana is a general of Saradomin; trusting in his values of 'order' and 'wisdom'. You should not be fooled. Saradomin hides behind a veil of pleasantry, but he cannot be trusted. He would sacrifice those loyal to him just as easily as Zamorak if he thought the goal was worth it.",
    "Zamorak, indeed! He is a false god; an unworthy pretender. Thousands of years ago, Zamorak was a Mahjarrat, like me. Then, he used the Staff of Armadyl - an immensely powerful elder weapon - against my god, Zaros. His actions banished Zaros from the world, and Zamorak ascended to godhood. With his power, he strives only for chaos. The word 'subtlety' means nothing to him."
  ],
  "Sharathteerk": [
    "Zemouregal! The wizards have most intriguing news.",
    "You know what this means, sire! The alarm of the ancient chamber! Someone has discovered-"
  ],
  "Zemouregal": [
    "Well? Speak quickly, welps. What is it?",
    "A wailing... This is beyond you. Be gone, and tell no one of this.",
    "Guthix's refuge... Never in my years did I think it possible. Sharatheerk, instruct the wizards to trace the signal to its source at once. And use any methods in your repertoire you feel necessary to ensure they work quickly. Guthix's edicts stop our Lord Zamorak returning. Imagine the glory of destroying Guthix; of breaking the edicts and bringing back Zamorak himself! We must act with all haste.",
    "Don't imagine me so naïve as to assume you wouldn't. I had expected some pathetic excuse for a defence, and here it is.",
    "Oh, this is just too much. Look at you, worthless creatures. You are wasting my time. Guthix will die in the name of Zamorak. When our lord returns, I will be lifted to greater heights than ever. You will not stop me.",
    "That's enough. You are wasting my time. I will kill Guthix in the name of Zamorak. When our lord returns, I will be lifted to greater heights than ever before!",
    "You cannot overpower me!",
    "If my minions cannot challenge you, I will defeat you myself!",
    "Enough! I yield. But mark my words: while Guthix is exposed, we will try all avenues to destroy him."
  ],
  "Dark wizard (#1)": [
    "S-s-sir, the circle. The stone circle at Varrock - it was glowing.",
    "What does it mean, sir? Is it Zamorak calling to us?",
    "Of course, sir.[sic]"
  ],
  "Dark wizard (#2)": [
    "And it let out such a sound! A great wailing, as if the stone itself were crying out!",
    "As you wish, Sir.[sic]"
  ],
  "Commander Zilyana": [
    "By Saradomin's word, we fly! Guthix the chaotic will be destroyed, in the name of honour. For the return of our glorious Saradomin!",
    "Get out of the way, human. I have no time to deal with-",
    "Tsutsaroth. Stop, I demand it.",
    "I'll be dead before I let K'ril Tsutsaroth claim this victory. Kree'arra, deal with the human.",
    "What do you mean you can't break it? One of Zamorak's own generals, unable to break down a door! Some Zamorakian 'might'.",
    "Oh, I should have expected this. Such typical brutish behaviour; trying to pick fights when there is a bigger task at hand. When Guthix is dead, you can have your battle. In the meantime, we have a common goal. As much as it pains me to say, we will have more chance of obtaining it if we work together.",
    "I do not trust you either, demon, but my passion for breaking the edicts is greater than my passion for bringing you pain.",
    "Oh, when we reach Guthix, all ties will be broken. If you come between my blade and his throat, I will not hesitate to cut you down. Now, if this door is unbreachable we are wasting our time here. There is always more than one way into a box.",
    "Oh, Kree'arra was not a match? Well, we are down one fool, at least. Believing I could bring back his beloved aviansie - hah!",
    "I would recommend you leave now. You will not want to be between my weapon and Guthix. No doubt, you will not heed my advice and we will meet again.",
    "The Guthixians cannot be allowed to get in our way. Strike now, warriors, kill them all!",
    "Enough of this charade!",
    "You created a good disguise, Guthix. But Saradomin cannot be fooled.",
    "Yes, it's just like you Zarosians to lurk in the shadows, afraid to face those stronger than you.",
    "Azzanadra. I should have expected you Zarosians to lurk in the shadows, afraid to face those stronger than you.",
    "You presume to speak to me, Nex? You, who has been locked in your icy prison for thousands of years. Do you feel ready for a real battle again?",
    "You dare-",
    "Well, what is the truth then?",
    "Or do you wish to destroy him? To pave the way for his betters?",
    "But there is no one else.",
    "But there is no one else.",
    "Finally, someone who sees sense.",
    "What defence will he pose in his sleep?",
    "But there is no one else. It is of no matter, Player, Guthix must die. Go! Now!",
    "Mourn him? When there is so much progress to be made without him?",
    "Come out victorious yourself? Against gods? Against Saradomin? What makes you think you would stand a chance?",
    "Saradomin, my lord! Look, our rival Guthix-",
    "I apologise, my lord."
  ],
  "Kree'arra": [
    "It seems we are not the first to arrive.",
    "Hmm.",
    "You should not be here, human. It is not safe. Please, leave now.",
    "It is not the way of Armadyl. You have not wronged me; battle is the last option I would take. Besides, Zilyana has no power over me.",
    "There really is little time for introductions, human, but if you insist. I am Kree'arra: a general of Armadyl. For centuries now I have continued the great way in the icy depths of Gielinor, awaiting the day my god could return.",
    "These questions are taking up time I do not have. Armadyl is my god. He is the most just, honourable god of them all. He... He has been missing for so long now. I find myself unable to recall his face to describe him.",
    "It is the only way to return Armadyl to this world. Following Zilyana will cause me to have more blood on my hands than I would choose, but I cannot see an alternative. I am telling you too much, human. It is best that you do not know what is happening here.",
    "Please, keep your voice down. I am trying to spare your life, human. Zilyana would have me kill you, but you have done no wrong. Please, go now.",
    "Please, human. I do not wish to battle.",
    "There is no other way. My mind is made up, human.",
    "This is your last chance. You must leave if you value your life.",
    "You give me no other choice. Forgive me, human, and may Armadyl see that these actions are forced upon me.",
    "Storms, align to me!",
    "Feel Armadyl's power!",
    "Enough! I concede. You face no threat from me. I have failed Armadyl, and the aviansie."
  ],
  "K'ril Tsutsaroth": [
    "If I were you, I would mind my words. You remember the last time we met. As I recall, you needed Saradomin to come and rescue you. Do not question my strength.",
    "Hm... What is to say you won't attack me while my back is turned?",
    "Fine. I will work with you. But the kill will be mine.",
    "We do not have time to stand and gloat.",
    "Hah! Zemouregal wastes his effort on crumbling undead; he lacks personal strength. I can see why he was not match. And as for Graardor, I wouldn't be surprised if the lumbering fool skewered himself on his own weapon. Your success ends here, human. I would suggest you stand aside so I may get to Guthix sooner, but I think I'd prefer to destroy you and your weak companions first. When Zamorak returns, he will recognize me above all others.",
    "Run, coward!",
    "You cannot stand against Zamorakian might!",
    "Guthix will die in the name of Zamorak!",
    "I concede. You have beaten me this time - but Guthix will never be safe. We will meet again."
  ],
  "Death": [
    "Step away from the panel. You will go no further.",
    "Maybe we shouldn't judge him/her, but we should certainly not trust him/her so easily. Human, how did you arrive here before us?",
    "The doors opened for you?",
    "It would seem so...",
    "The walls of the Inner Sanctum are impenetrable with magic. We can teleport no further.",
    "Maybe we shouldn't judge him/her, but we should certainly not trust him/her so easily. Human, how did you arrive here before us?",
    "The doors opened for you?",
    "I am one of the Guardians of Guthix; chosen by Guthix in the same way as Juna, Fiara and the Valluta. I heard the alarm when the doors were opened and gathered others to come to the rescue of our god. It is regrettable that we are so few, but - given the urgency - I could only gather so many.",
    "No? Because I do not reside in Taverley preaching the word of balance? I have spent every second of countless mortal lifetimes maintaining the balance between life and death. Do not question my loyalty to Guthix.",
    "I do not like to involve myself with minor disputes. Besides, from my observations of you, it seems you are more than capable of dealing with whatever comes your way.",
    "If I could, do you think I would not have done that before this moment?",
    "When Guthix appointed me as a guardian, I was given the task of retaining the balance of life and death - as well as the power to do so. With all great power, there must be balance, so Guthix also bestowed a weakness upon me. I can only strike a killing blow on those who are due to die. I cannot take the lives of those whose time is not over, and equally I cannot save a life that is due to end... As much as I may sometimes wish to.",
    "No...your time has not come yet.",
    "We should continue with all haste. I'd do what Cres suggests; he built this place, after all.",
    "I must agree, I fear we will be fighting a losing battle.",
    "Player is right. We cannot have come this far to be defeated before the battle has even begun.",
    "They don't know what's coming to them. We'll make them wish they never came here.",
    "I cannot tell the future, Player. Unluckily for us, there are too many variables to predict. I must react to deaths as they happen.",
    "If we go in there, I won't be able to retreat until we have driven the enemy back... or have been defeated. You won't be able to change me to another wing. Are you sure about your decision to station me here?",
    "Guthix believed in you. He gave you his power.",
    "Guthix must be protected.",
    "He will not need to. You will not reach him.",
    "The Zarosians do not seem to be attacking. We need to find out what their intentions are.",
    "You will not reach Guthix before us.",
    "It wasn't Player. It was a Mahjarrat. The one called Sliske: I felt it.",
    "This is just a taste of what is to come. We have failed; the gods will return, and the world will be destroyed if we do not fight back.",
    "We have little time to mourn, Juna. Saradomin has returned."
  ],
  "Juna": [
    "Wait, Death. We should not be so quick to judge the human. Tell us: what are you doing here?",
    "Wait! I know this human! Player, what are you doing here?",
    "We have a common goal, then. Come - we must reach Guthix before the others.",
    "We are Guardians of Guthix, Player; here to protect him. We must reach him before the others.",
    "We will find no quicker route elsewhere, and we should avoid conflict with Zilyana and the demon. We must find a way to open this door, and I believe this contraption may be the way to do it. You should investigate the control panel.",
    "You are not the only one trying; Zilyana and K'ril Tsutsaroth are mining through the earth to reach him. We must get there first.",
    "Player, Guthix preserves the balance of this world. If - I cannot bear to think of it - Guthix were to be...killed, the lesser gods would come flooding back. We would find ourselves in the middle of another God Wars!",
    "You would not ask that question if you had experienced the bloodshed of the wars. The lesser gods were desperate in their quests to gain more land and destroy each other. Such violence... You can not imagine. If you think you would comfortably survive in another war between the gods, Player, you are sadly mistaken. Every day of life was a struggle in those times, even for the most powerful of us. I would not wish those times to befall my worst enemy.",
    "Guthix has been asleep so long Even we - his closest followers - cannot predict how he would react to the world in its current state.",
    "The construction in this room... I recognise it. There is a distant memory; another like us. The construction holds the key to opening the door - I'm sure of it.",
    "My memory escapes me. I can recall happier times... another Guardian of Guthix.",
    "Yes... I think so. There is no time for this, however. We must get to Guthix.",
    "I am a creature of Guthix; one of his assigned guardians. When Guthix last returned to sleep, he assigned me to protect the Tears of Guthix; an area imbued with great power. Guthix is my god, and I will serve him to the end.",
    "Your follower may interfere with the track. You should put it away or dismiss it before you start.",
    "You did it! Come on, Player - there's no time to waste.",
    "I remember you.",
    "We were friends, in happier times. Before the God Wars... Cres?",
    "It seems that Cres's time here has changed him.",
    "I remember him being so lively. A bright spark in dark times. Guthix recognised his spark; his intelligence. He made him a guardian and granted him even greater mental capacity. No doubt that helped him to build all this.",
    "Guthix has given you his blessing.",
    "Player, we are completely unprepared!",
    "You can use that alongside you knowledge of your own strengths to organize the defending teams. Be aware, Player, these battles will be dangerous. If you make the wrong decision you will be less effective in your defence. Additionally, the consequences could be fatal.",
    "According to Cres, our enemies will be breaking through into each of the four storage wings adjoining this chamber. We have split ourselves into teams and individuals who can defend each wing: Death, Thaerisk and Chaeldar, the Valluta and Fiara, and Cres. You have been given information by Cres and his creations about what we can expect in each wing. Combined with knowledge of our defenders' strengths and weaknesses, you should be able to make a decision.",
    "All the wings are now defended. You may reassign defenders as you see fit; come to me when you have finished.",
    "You must be sure, Player. These battles may by deadly if you make the wrong decision. You may even find yourself less able to defend the wing. A good decision will certainly give you extra spirit in battle. You have until you enter the storage wing to change your mind. If you would like to reorganise our formation, let me know at any time before then.",
    "Then we are ready.",
    "Sadly, away from the Tears of Guthix I have a little prowess in battle. I would be more of a hindrance than a help.",
    "We will remain here as a last line of defence. There is plantlife in the room we can use to construct barriers; in case the enemy breaks through.",
    "With your expertise, we can do this, Player. How can I assist?",
    "They are coming.",
    "Another attack! Quick, Player!",
    "This must be the final attack; we cannot fall at this last hurdle, Player!",
    "Player, the main chamber - help!",
    "If they destroy the barriers I will be unable to stop them! Player, you must defend this area; fight them, repair the barriers, use any strategy you can! If either of us falls, the battle is lost!",
    "Mahjarrat! Do not filthy this place with your lies! Player is a faithful Guardian of Guthix; he/she would not betray all we have defended!",
    "I won't believe it!",
    "Do you wish to protect Guthix? To save the world from the lesser gods?",
    "Player... No!",
    "You have no idea what you're doing. You will unleash a new God War!",
    "Guthix is more knowledgeable than you could ever understand!",
    "You have no idea what you're doing. You will unleash a new God War!",
    "There's someone in there! I saw them! They have uncovered the path to Guthix! This was a trick to stall us and attack while our backs were turned!",
    "There's someone in there! I saw them! They have uncovered the path to Guthix! This was a trick to stall us and attack while our backs were turned!",
    "We do not know that. Player, Guthix must be protected. Go! Now!",
    "You won't argue? You monstrous creatures! Guthix will not be bested by the likes of you!",
    "There's someone in there! I saw them! They have uncovered the path to Guthix! This was a trick to stall us and attack while our backs were turned!",
    "We should have anticipated this. The Zarosians have always been manipulative.",
    "Guthix...Wh...what happened here?",
    "Player... Wh... what have you done?",
    "The wars could begin again.",
    "Without the edicts, the wars could begin again.",
    "I would like to believe you, Player, but how do we have the power to stop it? The gods will return, and there is no one to stop them.",
    "Another Zarosian trick?",
    "How dare Saradomin show his face here?",
    "So this is it, then. Guthix is dead.",
    "You are right. We must act quickly if we are to mount a defence; to protect ourselves.",
    "Player, despite your betrayal, Guthix trusted you. I believe your heart is in the right place.",
    "Player, you should have these.",
    "The ring belonged to Cres. He meant for you to have it when this was all over. May they aid you in the battles ahead.",
    "When you have space, return here and collect them. They may aid you in the battles ahead.",
    "We will create a shrine here, with Guthix. His values will not be forgotten. You should return here, if you feel the need to mourn."
  ],
  "Fiara": [
    "He/She must have a link to Guthix.",
    "The druids will protect it in my absence. Besides. I feel defending Guthix himself is slightly more important, don't you think?",
    "Guthix entrusted me, and I will not break that trust.",
    "I am a creature of Guthix; a guardian assigned by him to defend the site of the Fist of Guthix.",
    "As do I. A younger you, many centuries ago, You are a guardian, like us.",
    "It is good to see such an old friend, even if he does not remember us. When this is all over, he should be shown the world as it is now. It would fascinate him.",
    "We will stand and fight!",
    "I only wish I could take them all on. I'd show them what a Guthixian is made of!",
    "How could you do this to us, you filthy rat? We believed in you!",
    "We will fight to the last breath!",
    "We may have lost Guthix, but I will not stand by and witness the gods' return."
  ],
  "Kaqemeex": [
    "Hold your nerve, Player. We are stronger than our enemy.",
    "A fair point, but our diversity may be viewed as a good thing. Guthix's believers follow many different paths; have many different backgrounds. His values apply to all.",
    "I am one of the high druids residing in Taverley. My particular expertise lies in herblore, but I also guide new druids on their journey, connecting them more closely to Guthix.",
    "There is no time for dawdling, Player. We must continue.",
    "For Guthix!",
    "That was a rousing speech, Player. We should all be grateful to have you on our side.",
    "Similarly, my druids' strengths do not lie in combat. We cannot accompany you into the wings.",
    "My druids can also provide aid to you. We will create cauldrons for you to use to heal or empower yourself.",
    "The first wing has been broken! Player, you must defend it! Our cauldrons are here if you need them, and we have managed to create a link to the bank for any extra supplies.",
    "Player, there is no time for celebration yet. Another wing has broken into - you must defend it!",
    "We put up a good defence, but we could not have prepared for this. We will have to act with great intelligence if we are to win this.",
    "This is just a taste of what is to come. For now we should feel that a less harmful god has returned; I believe Zamorak would have destroyed us all where we stood."
  ],
  "Valluta": [
    "Time is our most invaluable asset here, Player. An army is useless if they arrive after the event. We could not have brought more. Besides, even if we could, we mustn't forget the smaller struggles of the world. While this is no doubt our largest concern, if we were to ignore the pest threat, we would become overrun.",
    "I am the Valluta, a Guardian of Guthix. Many thousands of years ago, Guthix recognised my loyalty and strength, and gave me additional power. He assigned me to defend Gielinor from exterior threats; retaining the balance.",
    "Not quite. While I am certainly powerful, my strength only goes so far. When this is over, I must return to join the Void Knights in stemming the pest invasion, which utilises my full power.",
    "I would follow Cres's instructions. I remember Guthix holding him in high regard, all those centuries ago.",
    "Guthix has given you a great gift, Player.",
    "Step down, Player.",
    "The Zarosians seem to know you. It is unlikely, but perhaps you could speak with them; persuade them to stand down.",
    "Stop, Player, or we will make you.",
    "Guthix may be dead, but he will remain in our hearts. We do not have to abandon his values, or his strength."
  ],
  "Chaeldar": [
    "Mostly, mostly. As with all, there are some who aren't. Me, though? Guthixian through and through.",
    "The name's Chaeldar. I'm a slayer master, from Zanaris. Hopefully I'll be a valuable asset to our defence; some of us not being combat specialists, after all.",
    "Cres and his mechanical men will make fine warriors for us, Player. It's encouraging that our troops have been strengthened.",
    "They're breaking in!",
    "We're sitting in the open. We have no organization!",
    "Choose wisely whom you station where. A disadvantage in combat can prove deadly.",
    "If we go in there, Thaerisk and I won't be able to retreat until we have driven the enemy back... Or have been defeated. You won't be able to change us to another wing. Are you sure about your decision to station us here?",
    "The wall! Look!",
    "The wall! Look!",
    "The wall! Look!",
    "What an intelligent move - sneaking in while the rest of us battled. Sly, but intelligent.",
    "I can't believe Saradomin would come here.",
    "So Saradomin has returned. We cannot stand for this, Player. We must make an example of him; show the gods that the mortals will not accept them."
  ],
  "Druid #1": [
    "I've heard stories about K'ril Tsutsaroth. I don't think I'd like to face him.",
    "The aura in here is so odd. It's like a haven of peace amid all the chaos."
  ],
  "Druid #2": [
    "I've only just finished my apprenticeship. I just happened to be speaking to Kaqemeex when Death arrived. I don't think I'm ready for this.",
    "Cres said Guthix has plans for you, Player. You must be very special."
  ],
  "Druidess": [
    "It's good to see another human, Player. The guardians are so imposing...",
    "What was that?",
    "I hope I can do Guthix proud, today.",
    "We can still win this, Player. We must trust in Guthix.",
    "The gods themselves... I... I don't know what to say.",
    "I can't believe it's over. We must return to Taverley and spread the news. We will also tell them of you, Player, and the gift Guthix bestowed apon you. At least there is a glimmer of hope in this."
  ],
  "Thaerisk Cemphier": [
    "I am Thaerisk Cemphier, leader of the Crux Eqal. We are an order of druids who devote our lives to protecting Gielinor from harmful threats. While other druids may become side-tracked with smaller matters, we like to look at the larger issues.",
    "Sadly, we could only collect so many. I am the only one here to represent the Crux Eqal. I didn't even have a chance to notify the others, but no doubt the word will spread and they will come. Sadly, I cannot imagine they will arrive in time to be of any aid.",
    "What strange constructions. They don't seem very stable.",
    "A honour indeed.",
    "What can we do in the face of such determination?",
    "Think carefully about your decisions, Player. If we are well prepared, we have a great advantage.",
    "I cannot lie, our prospects are looking grim.",
    "It is over, Player. We have failed."
  ],
  "Unknown": [
    "Do not fear. You face no dangers here. You are a human, are you not? You look so very different to how I remember.",
    "You know, the last time I saw another human was at the end of the great wars. That's when I was summoned here, to build defences. I feel that was a long time ago now.",
    "There are no years here. Just peace...quiet.",
    "A name? I suppose I must, but for the life of me I cannot remember. I haven't spoken to another living creature for so long. I've had no need for it."
  ],
  "Cres": [
    "Cres... Yes, I believe that is what they called me. It is good to see you all. Real, living creatures. Wonderful! Now, we must continue. I have been following your progress and the others are not far behind.",
    "This room is the last barrier before the centre. We must defend from here. However, if we are to win this battle, you must first embrace your destiny. Guthix has great plans for you.",
    "Please, approach the shrine behind me. Let us see Guthix's will.",
    "If we are to win this battle, you must first embrace your destiny. Please, approach the shrine on the centre wall. Let us see what Guthix has planned for you.",
    "I am afraid there is not much to tell. Much of my history is lost in my memories. Guthix summoned me here at the end of the great wars. He did not wish to be disturbed, so he charged me with building a cocoon around him. I remember I had first built the walls; great thick barriers. Some tried to break them, but they could not. After a while, they stopped coming. Years passed; I don't know how many. No one came, but I continued building. All you see here is my creation.",
    "That is a big question. Guthix is both patient and impatient. Forgiving, yet ruthless. Mysterious, yet transparent. Balanced in all ways.",
    "You have passed the test. Let us see what Guthix has in store.",
    "He has chosen you as one of his creatures, a Guardian of Guthix!",
    "My creations inform me that the points of breakthrough will be in the storage wings. There are four of them off this chamber, and the enemy will reach them first. They are smaller rooms than this. If we meet the enemy there, we will make a better defence.",
    "My creations can aid us there. They can hear the commotion through the rock, and have provided me with information that could allow us to decipher what to expect in each wing.",
    "There is no time to waste, then. Player, choose your formation carefully.",
    "Speak to Juna to begin organising our defences. She will be able to provide you with our collected information.",
    "I believe that is all the preparation we can do.",
    "If we go in there, I won't be able to retreat until we have driven the enemy back... or have been defeated. You won't be able to change me to another wing. Are you sure about your decision to station me here?",
    "Player, to me! Quick!",
    "Zilyana made a silent approach as we were distracted with the others!",
    "No! Player, listen. This is very important. Above all else, the tableau behind Juna must be protected. It conceals the path to Guthix himself. I believe Zilyana knows this, and she is pushing towards it. I will meet her in the mid-field. You must defend the tableau against her forces. Go to Juna. She will aid you.",
    "You honour me, Zilyana, but it seems you are the fool. I am not Guthix."
  ],
  "Kaqumeex": [
    "What do you propose we prepare?"
  ],
  "Druid": [
    "I feel the calm before the storm. When the others break through, who knows what will happen? I can't believe Guthix gave you power. I haven't heard of anything like that happening for thousands of years.",
    "I have never seen a Mahjarrat before, not in person. They are so much more frightening than I imagined.",
    "I have heard of Nex - seen illustrations in scriptures - yet I still feel unprepared for this.",
    "I cannot even anticipate what our future holds after this. This will change everything.",
    "Guthix is gone. What hope is there against the other gods?"
  ],
  "Defender": [
    "The enemy has broken in to the first wing! You must defend it!",
    "The enemy is in the next wing! You must defend it!",
    "The enemy is in our wing! We need to get in there!",
    "That sounded like another wing. Player, you'd better go and assist them. I/We can deal with the remains here.",
    "Go for the portals, Player! If you destroy them, it'll break Zemouregal's concentration.",
    "We'll deal with the zombies. You take Zemouregal down!",
    "Player, you must destroy the portals! it's the only way to break his concentration!",
    "We'll deal with the zombies. You take Zemouregal down!",
    "The other wings will need your help before long. Player, I/We can deal with the remains here - you go.",
    "We are nearly victorious, Player. The last wing must hold! I/We can finish here - you go!",
    "It sounds like this isn't over. You go back to the main chamber. I/We will finish off here."
  ],
  "The Valluta": [
    "If we go in there, Fiara and I won't be able to retreat until we have driven the enemy back... Or have been defeated. You won't be able to change us to another wing. Are you sure about your decision to station us here?",
    "We cannot let you continue, Player."
  ],
  "The defender who speaks in this wing will be only one of these, depending on which defender team you choose to defend this wing": [
    "Chaeldar, Cres, Death, or The Valluta:"
  ],
  "General Graardor": [
    "Graardor turn back? Tiny human has tiny brain! Puny balance god stop wars returning. Bandos - almighty war god - desire battle, so Graardor create it. Graardor smash Guthix skull with mighty fists! Graardor be best general of almighty war god! Squishy human and friends not stop me! Attack!",
    "Graardor protect!",
    "Graardor mad!",
    "Graardor smash!",
    "Hold your weapon. Graardor done. Tell puny balance god to watch out. Graardor be back."
  ],
  "The defender who speaks in each of these wings will be only one of these, depending on which defender team you choose to defend that wing": [
    "Chaeldar, Cres, Death, or The Valluta:"
  ],
  "Enakhra": [
    "Hah! You underestimate my passion. Zemouregal may be a formidable opponent, but he does not have the same will. I am Zamorak's most faithful ally. When I succeed here, Zamorak will take me as his closest companion! Do you really think I would miss this chance to serve him? In fact, Zemouregal's defeat will make my victory all the sweeter. I will rise above Zamorak's lesser followers; I will be his favoured servant! With Guthix dead, Zamorak will prevail and we will rule Gielinor together! And you are not going to get in my way.",
    "You are trying my patience, whelp.",
    "Enough of this insolence! I will show you pain!",
    "Not so fast!",
    "Zamorak, give me the strength to heal.",
    "Do not try and hide, coward!",
    "Stop! It's over. You win. I have failed Zamorak. I will retreat until I am worthy to serve him."
  ],
  "Saradominist fighter": [
    "Attack the barriers!",
    "For Saradomin!",
    "Get the snake!",
    "Guthix must die!",
    "Our glorious Saradomin will return!",
    "The edicts will be broken!"
  ],
  "Azzanadra": [
    "I do apologise. I believe you have already met Sliske; I am Azzanadra, another of the Zarosian Mahjarrat.",
    "Why, we are here to bring about Zaros's return, of course. We saw no sense in rushing in amid all the chaos that has been going on-",
    "It seems you are outnumbered, Zilyana. It would be wise to back down. After all, had you not been so desperate to reach Guthix, I'm sure you would have noticed us shadowing your steps. Perhaps you would have thought twice before destroying half the defence, kindly clearing our path.",
    "Calm, Char. It is all in hand. It is no use fighting any more, Zilyana. Unlike you, we planned ahead, and have an agent planted closer to Guthix than any of us could ever be. Player, would you be so kind as to lead us to Guthix?",
    "Oh you naive creature. Do you honestly think this intelligent, worthy human would side with you; with your ridiculous notions of balance? No, this adventurer is better than that. Sliske presented Player with our plan from the beginning; he's been masquerading for the entire journey.",
    "Player, do you wish to wake Guthix? To learn all that such a powerful being could teach?",
    "This was not in our plan.",
    "We do not know that. Player, you must reach Guthix. Go! Now!",
    "Player, surely not...",
    "This saddens me greatly. You are a great friend, Player. However, Guthix must be awoken, for Zaros. As much as it pains me, if this means challenging you then...that must be the case.",
    "This was not in our plan.",
    "I do not feel it has come to this, Player, but if it enables the return of Zaros we will not argue.",
    "This was not in our plan.",
    "We discussed this. There was no need for murder.",
    "Be quiet, Zilyana. The death of one so ancient is never cause for amusement.",
    "A courageous claim, and I cannot deny you be a valuable ally to any god, but what makes you think you would be able to sway the battle to such effect?"
  ],
  "Nex": [
    "You watch your tongue, Zilyana, or I will rip it from your mouth.",
    "Sss...",
    "Azzanadra, you ancient fool. Your feelingsss mean nothing in the heat of war. You could have killed the human by now.",
    "I cannot disagree.",
    "Sss!",
    "Go on.",
    "You know, many would sssay you are lucky to not know me. Legends have told of me; they describe me of a being of pure anger, pure hatred. Un-ssstoppable. I have been imprisssoned for many centuries, deep in the dungeon - sss- filled by the warring generals. Remnantsss of the great God Warsss. A better time than thisss...ssstagnant era.",
    "A loyal friend: Sss-liske. The trick-ssster; the rogue. He will alwaysss find a way.",
    "...It isss undecided.",
    "The Mahjarrat, Azzanadra, Wahisssietel, Akthanakosss. They would wake Guthix; sssee what he has to teach usss. We are agreed; thisss is what Zarosss would desire. 'Knowing an enemy isss half the battle,' he would sssay.",
    "I am alwaysss sssure of my-ssself, human. I feel anger towardsss Guthix; he banished my god. I would have him feel my rage, but I must resissst...for now.",
    "Run, creature. You cannot hide.",
    "Sss-Sliske would release me just to sss-steal my victory. I should have known he could not be trusted."
  ],
  "Char": [
    "Oh, we are wasting time, Azzanadra. Let us just kill her and be done with it!",
    "If Player stands against Zaros, then he/she stands against us. Any obstacle must be destroyed in flame and fire.",
    "I am Char: a loyal follower of Zaros. I am the last of my race: the Auspah - masters of fire and flame. Zaros took me in when I was lost. He taught me to be strong, and fearless. Then Zamorak - that filthy rat - poisoned me and left me to die. But I did not die. I was released, to be reunited with Zaros, and to enact my revenge upon Zamorak.",
    "I will do anything I can to bring Zaros back. The edicts must be destroyed; I do not care how. My fellow Zarosians would have Guthix alive. If it returns Zaros to me, I couldn't care less for the method.",
    "It is not a matter of wanting to kill. That is the Zamorakian way of thinking. Zaros would require actions to have a purpose. I will do anything I can to bring Zaros back. The edicts must be destroyed; I do not care how. My fellow Zarosians would have Guthix alive. If it returns Zaros to me, I couldn't care less for the method.",
    "I will burn you to the ground, Player!",
    "What is happening?"
  ],
  "Wahisietel": [
    "What's going on?",
    "What's going on?",
    "What's going on?",
    "Greetings, Player. My name is Wahisietel. I believe you have already met my Mahjarrat brethren, Sliske and Zemouregal.",
    "Zemouregal is misguided. We are not all like him. I hope we may meet again in a less dramatic situation. Please, speak to Azzanadra so we may progress here.",
    "And I have heard yours. I believe you have already met my Mahjarrat brethren, Sliske and Zemouregal.",
    "Zemouregal is misguided. We are not all like him. I hope we may meet again in a less dramatic situation. Please, speak to Azzanadra so we may progress here.",
    "Player, good to see you. Please, speak to Azzanadra so we may make progress.",
    "And you trusted his word when he said he would abide by us? I warned you..."
  ],
  "Akthanakos": [
    "I'm afraid so. My name is Akthanakos. I must say I am very glad to make your acquaintance. Anyone who defeats Enakhra so spectacularly is someone I can befriend.",
    "Come, Player. There is no time to waste! We must move forwards!",
    "This was not of our doing."
  ],
  "[Guthix": [
    "]: Player... come to me.",
    "]: Do not be afraid. You have no enemies here. As I believe you know, I am Guthix.",
    "]: Sliske was wielding an elder weapon. A god slayer, if you will. I am dying, Player. But we still have time... It has been most interesting watching your brave journey to get here.",
    "]: Yes. I saw everything.",
    "]: You put up an honourable defence and I thank you. Before the end, there is something I must show you.",
    "]: I cannot blame you for your decisions, Player, but there is something I must show you."
  ],
  "Guthix": [
    "I am here. I have taken a form from my past.",
    "This is my homeland. Or rather my last memories of it, moments before I left.",
    "Have patience, all will be explained. You saw Sliske - the Mahjarrat - deal his final blow... I am dying. I have slowed our passage of time momentarily, so I may share this with you. Please, explore. I will wait for you along the path.",
    "Many millennia ago, I was born here, far away from the land you call home. From as far back as I can remember, this world was in turmoil. My world was home to many gods; many beings who would claim it as their own. The gods fought relentlessly, and as more and more came, the fighting became more vicious. A war broke out and lasted for centuries. The world was ravaged, and the population decimated. And do you know who came out the victor, Player?",
    "No one. No one emerged triumphant from this ordeal. My people were killed. All my friends, my family. I was left to stand alone on this devastated plane, with memories of what my life had been.",
    "Many died. Many fled. Please, meet me along the path when you are ready.",
    "He is one of the fallen. A god, long-dead and forgotten. In the last days of the war I believed I was soon to die, too. There was no food, no water. I scavenged among the dead, until one day I found a weapon; a large sword, crackling with energy. I recognised it as a weapon of the gods. The 'elder weapons', as they referred to them. The weapons were prized among them, and they fought even over these. I knew it to be my only chance, so I took it. Having seen so much violence, I do not believe in it as a solution. But in this case I had no other choice. In the dead of night, I crept from the ruins of my home. I found a slumbering god - the god you see before you - peaceful amid the rubble. I stabbed him with the elder weapon, driving it deep into his back. The weapon shattered as the god reared back in pain before crashing to the ground. As I watched him take his last breaths, I felt power growing within me. I became a god myself. Equal to those who had tormented my life. I left this world and its painful memories. I fled for centuries, aimlessly wandering until something captured my attention. I felt drawn to a planet; Gielinor. It was beautiful, and more importantly empty. It was somewhere I could hide, and mourn my dead. I had not expected to find the stone upon it; the Stone of Jas; granting me greater power even than the gods of my homeworld. I will continue my story along the path. Meet me there when you are ready.",
    "It is a god's warrior; a creature introduced to this world only for war. The sparring gods here brought in other races to fight for them; their own armies. Much like the Mahjarrat, or the Icyene were introduced to Gielinor. When I arrived in Gielinor, I spent a long time alone. I didn't know what my future held; what I should do next. Eventually, I came upon what I believed was my purpose. I aimed to create a world free of the influence of gods; a world where the inhabitants would not have to fight other beings' wars. So I introduced my own chosen races: humans, gnomes... beings who do not strongly tend towards evil, nor good. I chose tribes who had no concept of gods, and I brought them to Gielinor, to live uninfluenced lives while I retained the balance. I was foolish; my plan would never work. I will continue my tale along the path. Please, meet me when you are ready.",
    "I should have seen it coming. I introduced them to the world, I had a power greater than they had ever seen. The mortal races began to worship me. They built shrines to me, made sacrifices. They waited on my every word. It pained me deeply to see myself becoming what I had always loathed. They should not have been living beneath me, serving me. I wanted them to be free, balanced, to make their own decisions. Knowing my presence was thwarting my efforts, I withdrew into the earth, to sleep. I hoped I would be forgotten over the ages. But it was not long before the other gods arrived. I feel my strength draining. We are nearly at the end. Please, meet me along the path when you are ready.",
    "When I ended the war of the gods, I did it with no pleasure. I knew I had already failed. Looking over Gielinor, it was like looking at my homeland: the land ravaged; the mortals worshiping a multitude of gods, including myself. The races brought in by the now-banished gods remained, and disrupted the balance at every turn. Battles raged on, in the names of the absent gods. I could banish the gods themselves, but I could not remove the memories of them; the blind faith displayed by their followers. Besides, my own interference would only disrupt the balance more. I have disproportional power; more than any single being should have. I will wait for you further up the path, when you are ready to continue.",
    "I could have prevented this, Player. I have been awake since you triggered the alarm. I knew what would happen.",
    "Player, I have been the most powerful being on Gielinor since my arrival. Of course I could have stopped Sliske if I had desired to. But I embrace my death. It must occur, if the world is to be balanced. If the gods return, another war is inevitable. Gielinor must be returned to peace before war destroys it... before it becomes like my own home. A dead, desolate wasteland... Gielinor must be protected, Player. But not by me. By a mortal. Someone with the power to defend against the gods, but not the power to be one. Ah...sorry, It is... The pain is becoming stronger. Please, enter the house... My home, when you are ready.",
    "I have... so little time. Please, listen carefully, Player. I have already shared my power with you, chosen you as one of my creatures, so that you may reach this point. When this is over, you will find yourself with even more power. Power you may use to defend against gods.",
    "I know you allied yourself against me, but I also know you do not want your world to perish. If the gods are not stopped, your world will be destroyed...and you along with it.",
    "You must be a guardian of this world, Player. Gielinor must be free.",
    "I am glad to have found such a noble mortal as you, Player. My blessing is with you.",
    "I am sorry that you are blind to the future of that path, even after all I have told you. Gielinor will be destroyed if you do not protect it, but it is too late for me to act.",
    "I am sorry that you are blind to the future of that path, even after all I have told you. Gielinor will be destroyed if you do not protect it, but it is too late for me to act.",
    "It is over. My family wait for me. Remember... your purpose, Player. ...Forget me."
  ],
  "[Saradomin": [
    "]:  This is no place for battle. Go back to your hiding places!"
  ],
  "Saradomin": [
    "Silence, Zilyana. It is not right to revel in bloodshed. What has been done, could not have been helped. Guthix was not an evil god... Like myself, he yearned to make the world a better place for those who dwell upon it. But the notion of balance was flawed, and his presence meant that I could not return. It was not an easy decision, but Guthix had to die. But, Zilyana, that does not mean we should gloat over the events here.",
    "So, human, you were alone with Guthix in his last breaths. Tell me, do you know who I am?",
    "I am glad that after my extended absence, there are those who still know me for who I am.",
    "It is understandable that after my extended absence you may wish to know more about me before you can follow me. With the edicts gone, we may have much time for me to show you I mean only good for this world.",
    "It seems you have received a rather warped image of me in my absence. Remember, evil beings will always strive to turn you against what is good. With the edicts gone, we have much time for me to show you I mean only good for this world.",
    "Now, much has happened here today. With the edicts broken, the world will soon enter a new age. More gods will be coming... I apologise, human. I do hope we meet again, but for now I must ask you to leave. I have much to do here.",
    "...Interesting. You are resistant to my power. My journey back may have temporarily weakened me, I suppose. But still... Human, did Guthix tell you anything in his last moments? Wisdom, secrets, spells? I would advise you to tell me now.",
    "Is that so...[sic] ...Well, you have been given a generous gift. Clearly Guthix saw something in you. Consider your choices, human. Guthix may have presented you with the world as he sees it, but that is not the only view. There are other more worthy paths. No one good would wish for another war of the gods, but sometimes violence is necessary before we can achieve a greater peace. It would be wise to ensure you are on the right side when that violence begins. I will leave you now to think on that. No doubt we will meet again...guardian.",
    "Is that so...[sic] ...Well, you have been given a generous gift. Clearly Guthix saw something in you. And how do you see fit to use this gift?",
    "That is a relief, I must say. You seem like an honourable being, and I would not wish to fight against you. I must leave you now, to prepare for the time ahead. No doubt we will meet again, to face the others side by side. I will leave you now to think on that. No doubt we will meet again.",
    "I would consider your decision carefully. You must understand, the other gods would strive to achieve power for themselves. They are selfish, unlike myself. I merely wish for this world to achieve a greater peace. Sometimes, violence is necessary before we can achieve our end goal. It would be wise to ensure you are on the right side when that violence begins. I will leave you now to think on that. No doubt we will meet again.",
    "I am sure you have much to consider. I only hope you can see that I all I want is for the world to be at peace. Sometimes, violence is necessary to achieve that greater peace. It would be wise to ensure you are on the right side when that violence begins. I will leave you now to think on that. No doubt we will meet again.",
    "Is that so...[sic] ...Well, you've been given a generous gift. Clearly Guthix saw something in you. To achieve godhood yourself, though, that is a lofty ambition! Of course, you must consider that it is difficult to share your power. If you were to achieve your goal, if you were to act against me we would become enemies. I cannot say that is something I wish for. And it may be something you regret. I will leave you now to think on that. No doubt we will meet again."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:The_World_Wakes?oldid=35866756’"
  ]
}