{
  "Player": [
    "Hmm... What's this?",
    "Wenla!"
  ],
  "Megan": [
    "Primrose! Books are for bookcases! The clue's in the name! Stop scattering them about this damned house! You won't get out of bed for dinner, but you'll do it for a flipping book.",
    "Primrose wouldn't talk to me. She wouldn't look at me. I'd find scraps of her meals tucked into her pillowcase. She was dying, so much faster than before. And she was pulling at the last threads of life, hoping to find Death at the other end. I'd lost her. I went to Gail. What else could I do? I begged for another wish. To take the 30 days, to go back again. Gail calmed me and told me to return tomorrow. The Needle would be recharged, and I could return to Primrose's birthday. I could do this all again.",
    "Primrose wouldn't talk to me. She wouldn't look at me. I'd find scraps of her meals tucked into her pillowcase.",
    "She was dying, so much faster than before. And she was pulling at the last threads of life, hoping to find Death at the other end. I'd lost her.",
    "I went to Gail. What else could I do? I begged for another wish. To take the 30 days, to go back again.",
    "Gail calmed me and told me to return tomorrow. The Needle would be recharged, and I could return to Primrose's birthday. I could do this all again.",
    "My whole life, I've been surrounded by books. Not once have I read one.",
    "I can see my tombstone: 'crushed under a pile of books'.",
    "When I met Joss, he was hidden behind a stack of wizarding tomes. He'd line our house with them.",
    "Primrose treated them as toys, then things to climb, then adventures to climb into.",
    "She'd play out the God Wars with Saradomin as a ladle and Zamorak as a pepper pot.",
    "My whole life, I've been surrounded by books. Not once have I read one. I can see my tombstone: 'crushed under a pile of books'. When I met Joss, he was hidden behind a stack of wizarding tomes. He'd line our house with them. Primrose treated them as toys, then things to climb, then adventures to climb into. Her imagination was always wild. She'd play out the God Wars with Saradomin as a ladle and Zamorak as a pepper pot.",
    "The day we moved here, Primrose was two. I remember her toddling next to us, carrying a book, one of the bigger ones.",
    "You couldn't stop her. We called her our little Pack Yak Primrose.",
    "Sure, she slowed us down, made the journey painfully long, but you try to tell her to stop!",
    "Ah. Good days.",
    "The day we moved here, Primrose was two. I remember her toddling next to us, carrying a book, one of the bigger ones. You couldn't stop her. We called her our little Pack Yak Primrose. Sure, she slowed us down, made the journey painfully long, but you try to tell her to stop! Ah. Good days.",
    "When I was younger, I'd fall in love twice a week. It would come to me as easy as a temper, and would disappear just as quick.",
    "I thought I would fall out of love with Joss as quickly as the others. In the end, the love went, but it took a while.",
    "There was my love for Saradomin, of course. But I wasn't getting love in return. The score wasn't equal.",
    "Primrose has always been the exception. To fall out of love with Primrose would be to fall out of love with, well, everything.",
    "I know what you're thinking. No - that time doesn't count. I wasn't angry with Primrose. I was angry at THEM.",
    "When I was younger, I'd fall in love twice a week. It would come to me as easy as a temper, and would disappear just as quick. I thought I would fall out of love with Joss as quickly as the others. In the end, the love went, but it took a while. There was my love for Saradomin, of course. But I wasn't getting love in return. The score wasn't equal. Primrose has always been the exception. To fall out of love with Primrose would be to fall out of love with, well, everything. I know what you're thinking. No - that time doesn't count. I wasn't angry with Primrose. I was angry at THEM.",
    "'Temper-temper'. That's what Joss would always say to me. Gods, it would only make me angrier.",
    "Whenever I would hook his nose out of a damned book: 'temper-temper'.",
    "Whenever I called him out on his laziness, doing the chores with some cheap magic: 'temper-temper'.",
    "They were even his last words to me before he left. Wherever the bastard has gone, I imagine him repeating them like a cheap toy.",
    "'Temper-temper'. That's what Joss would always say to me. Gods, it would only make me angrier. Whenever I would hook his nose out of a damned book: 'temper-temper'. Whenever I called him out on his laziness, doing the chores with some cheap magic: 'temper-temper'. They were even his last words to me before he left. Wherever the bastard has gone, I imagine him repeating them like a cheap toy.",
    "Is there anyone more self-involved than a wizard?",
    "I get it, I do. As a wizard, you have to study for years. You have to find a niche that no wizards has found. You have to fight over whatever resources there are.",
    "But none of them - not Joss, not Sloop, not the Wizard's Tower - can see how self-centred they are. The Tower's just a chocolate box of egos, all in a variety of flavours.",
    "We were wrong. The world got in. A sea troll got in...",
    "Is there anyone more self-involved than a wizard? I get it, I do. As a wizard, you have to study for years. You have to find a niche that no wizards has found. You have to fight over whatever resources there are. But none of them - not Joss, not Sloop, not the Wizard's Tower - can see how self-centred they are. The Tower's just a chocolate box of egos, all in a variety of flavours.",
    "Gail didn't come to us at first. She'd been watching us for some time from the Needle, making sure we weren't monsters, I guess.",
    "I mean, we'd seen her. She wasn't great at hiding herself, after all. She's ten-foot tall and blue.",
    "Joss assumed the worst, as he always did. Tried to scare her away with air blasts. Nothing that would hurt her, just to send a message.",
    "She kept clear. It was only when Joss left - no, abandoned - us that she felt courage enough to talk to me.",
    "Gail didn't come to us at first. She'd been watching us for some time from the Needle, making sure we weren't monsters, I guess. I mean, we'd seen her. She wasn't great at hiding herself, after all. She's ten-foot tall and blue. Joss assumed the worst, as he always did. Tried to scare her away with air blasts. Nothing that would hurt her, just to send a message. She kept clear. It was only when Joss left - no, abandoned - us that she felt courage enough to talk to me.",
    "I guess we should have stopped it earlier? Even when she was young, she'd have imaginary friend after imaginary friend.",
    "They'd even have relatives! Imaginary sisters and brothers would come to visit. Some would get lost, and we'd have to pretend to look for them.",
    "It got serious once Primrose got ill. She would keep their counsel, rather than talk to me.",
    "She did it when I wasn't watching, but I knew. She would write poems with them, sing with them, confide in them, ask them for their thoughts.",
    "I guess we should have stopped it earlier? Even when she was young, she'd have imaginary friend after imaginary friend. They'd even have relatives! Imaginary sisters and brothers would come to visit. Some would get lost, and we'd have to pretend to look for them. It got serious once Primrose got ill. She would keep their counsel, rather than talk to me. She did it when I wasn't watching, but I knew. She would write poems with them, sing with them, confide in them, ask them for their thoughts.",
    "Primrose always had a lovely singing voice.",
    "Primrose is so strong, but people can't see past the illness.",
    "Doctors, visitors, they all make that mistake. Judge her by the disease, the microscopic evil magnified into something huge.",
    "But I see the strength. Damn girl always lets an argument go un-won. She'll fight for the things she loves, for sure.",
    "And she's full of love. Not always for her mum, but you know, it's there. Growing up, she loved everything, cared for everything.",
    "Primrose is so strong, but people can't see past the illness. Doctors, visitors, they all make that mistake. Judge her by the disease, the microscopic evil magnified into something huge. But I see the strength. Damn girl always lets an argument go un-won. She'll fight for the things she loves, for sure. And she's full of love. Not always for her mum, but you know, it's there. Growing up, she loved everything, cared for everything.",
    "A year to live. That's all the doctor could give her, holding his hands out upright like a pauper. 'Please miss, this is all I can give you'.",
    "Primrose just half-smiled when the doctor told her. I was so angry at her for brushing it all aside.",
    "I needed her to cry, break down, something. Just react, damn it!",
    "*sighs*",
    "Each month, I watched helplessly as she got thinner. Her skin became translucent. But you know Primrose: it just meant that her character shone through brighter.",
    "I just wish...I wish she didn't hide that character away. So often, she reserved it for her creatures. Her monsters.",
    "A year to live. That's all the doctor could give her, holding his hands out upright like a pauper. 'Please miss, this is all I can give you'. Primrose just half-smiled when the doctor told her. I was so angry at her for brushing it all aside. I needed her to cry, break down, something. Just react, damn it! *sighs* Each month, I watched helplessly as she got thinner. Her skin became translucent. But you know Primrose: it just meant that her character shone through brighter. I just wish...I wish she didn't hide that character away. So often, she reserved it for her creatures. Her monsters.",
    "The potions would strengthen her for a day or two, then she would be back in bed, just as ill.",
    "It's like the disease was a bull, crashing through any barrier we put in front of it.",
    "But I couldn't help buying potion after potion. Near half of the money we had, it was spent on these little moments of strength.",
    "The potions would strengthen her for a day or two, then she would be back in bed, just as ill. It's like the disease was a bull, crashing through any barrier we put in front of it. But I couldn't help buying potion after potion. Near half of the money we had, it was spent on these little moments of strength.",
    "There was a day when the illness hit her hard. A day when she couldn't ignore it.",
    "Primrose dropped her favourite book: the Adventures of Hannibus, I think it was. She couldn't pick it up. It was open on its back page, the ending staring right up at her.",
    "It was the first time I'd seen her cry since the illness. I tried to hand it to her, but she shoved it away. I felt like her jailer.",
    "There was a day when the illness hit her hard. A day when she couldn't ignore it. Primrose dropped her favourite book: the Adventures of Hannibus, I think it was. She couldn't pick it up. It was open on its back page, the ending staring right up at her. It was the first time I'd seen her cry since the illness. I tried to hand it to her, but she shoved it away. I felt like her jailer.",
    "You can ignore death, blood, murder. The mind's flexible like that. They all happen to far away people with far away lives.",
    "It was blissful. We lived in a house where those things didn't exist.",
    "But it was like we were pulling back the curtains and hoping for the best. Hoping that those filmsy pieces of fabrics would keep the violence out.",
    "We were wrong. The world got in. A sea troll got in...",
    "You can ignore death, blood, murder. The mind's flexible like that. They all happen to far away people with far away lives. It was blissful. We lived in a house where those things didn't exist. But it was like we were pulling back the curtains and hoping for the best. Hoping that those filmsy pieces of fabrics would keep the violence out. We were wrong. The world got in. A sea troll got in...",
    "Some memories stick in you like barbs. They hurt whenever you accidentally catch yourself on them.",
    "I...I was on the way back from the Wizard's Tower. The day had gone well: I'd sold some books for more than I expected, and I'd gotten the cooking job.",
    "But I arrived at the house. There was the bang-bang of the door, slamming in the wind.",
    "I abandoned the cart, rushed in. I called for Primrose. Nothing.",
    "A stray sea troll had found its way into the house. It was long gone when I got there, but... It...",
    "It had killed her. Primrose.",
    "That was the first time Gail talked to me. I couldn't move, I was crying on the floor of the kitchen. And Gail came to me.",
    "Some memories stick in you like barbs. They hurt whenever you accidentally catch yourself on them. I...I was on the way back from the Wizard's Tower. The day had gone well: I'd sold some books for more than I expected, and I'd gotten the cooking job. But I arrived at the house. There was the bang-bang of the door, slamming in the wind. I abandoned the cart, rushed in. I called for Primrose. Nothing. A stray sea troll had found its way into the house. It was long gone when I got there, but... It... It had killed her. Primrose. That was the first time Gail talked to me. I couldn't move, I was crying on the floor of the kitchen. And Gail came to me.",
    "Saradomin. This is my final prayer.",
    "If you're listening, then damn you. You choose to listen now? You choose the moment when I give this up? Damn you back to the Third Age.",
    "You know what? I don't care whether you listen or not. I've found someone else to have faith in.",
    "Saradomin. This is my final prayer. If you're listening, then damn you. You choose to listen now? You choose the moment when I give this up? Damn you back to the Third Age. You know what? I don't care whether you listen or not. I've found someone else to have faith in.",
    "You've got to remember, up to this point Gail was a boogeyman. Someone who watched us and then sped away into the night.",
    "Then she's in my house, talking to me, offering me wishes like I was a Princess from one of Primrose's books.",
    "Gail led me to the hilltop. Her hands were so cold and hard. I felt numb, but I couldn't figure out if it was from me or her.",
    "She showed me something called the Needle. Gail asked again, did I really want my wish? She had to shake me to get an answer.",
    "The Needle would take us both back 30 days. While Gail and I would remember what happened, no one else would. We'd be the only ones to remember the sea troll's attack.",
    "But Primrose would be alive.",
    "I agreed, and Gail pulled thread from the Needle. She separated the thread into strands, and a dome of fabric fell about us.",
    "The dome flashed with blinding light. You couldn't see about you, it was impossible. As the light faded, Gail gestured me to my house and said 'Be with her'.",
    "I rushed through the door and checked the calendar. 30 days back - my daughter's birthday. I checked my bedroom. There wasn't another Megan in there.",
    "Then I went to Primrose. She was asleep in her bed. I sat in the chair, watching her. No one was going to budge me from that spot. Not ever.",
    "You've got to remember, up to this point Gail was a boogeyman. Someone who watched us and then sped away into the night. Then she's in my house, talking to me, offering me wishes like I was a Princess from one of Primrose's books. Gail led me to the hilltop. Her hands were so cold and hard. I felt numb, but I couldn't figure out if it was from me or her. She showed me something called the Needle. Gail asked again, did I really want my wish? She had to shake me to get an answer. The Needle would take us both back 30 days. While Gail and I would remember what happened, no one else would. We'd be the only ones to remember the sea troll's attack. But Primrose would be alive. I agreed, and Gail pulled thread from the Needle. She separated the thread into strands, and a dome of fabric fell about us. The dome flashed with blinding light. You couldn't see about you, it was impossible. As the light faded, Gail gestured me to my house and said 'Be with her'. I rushed through the door and checked the calendar. 30 days back - my daughter's birthday. I checked my bedroom. There wasn't another Megan in there. Then I went to Primrose. She was asleep in her bed. I sat in the chair, watching her. No one was going to budge me from that spot. Not ever.",
    "It was the morning after I traveled back in time. 30 days. Back to the morning of Primrose's birthday.",
    "Primrose looked so much better than I remembered.",
    "Here she was, unmarked by any sea troll, happy and soulful. She was alive, dear Gods! And happy!",
    "I resolved, in that moment, to never let her get hurt gain. Gail, wonderful Gail, offered to keep an eye on Primrose while I was away.",
    "It was the morning after I traveled back in time. 30 days. Back to the morning of Primrose's birthday. Primrose looked so much better than I remembered. Here she was, unmarked by any sea troll, happy and soulful. She was alive, dear Gods! And happy! I resolved, in that moment, to never let her get hurt gain. Gail, wonderful Gail, offered to keep an eye on Primrose while I was away.",
    "Every weekend, it was the same thing. Pack provisions, wrap some books in blessed cloth and worry about leaving Primrose behind.",
    "Then it was the trip to the Wizard's Tower, cart and all. Sell some books to Sloop, ask around about Joss, cook a Weekend Banquet for the elite wizards.",
    "Then it was back home, worried about Primrose and whether Gail had kept her safe.",
    "Every weekend, it was the same thing. Pack provisions, wrap some books in blessed cloth and worry about leaving Primrose behind. Then it was the trip to the Wizard's Tower, cart and all. Sell some books to Sloop, ask around about Joss, cook a Weekend Banquet for the elite wizards. Then it was back home, worried about Primrose and whether Gail had kept her safe.",
    "Sloop was my husband's apprentice. He was a boy, not much older than Primrose, I guess. But he'd caught the wizarding bug: self-centred and ambitious.",
    "Still, he kept an ear out for news about Joss. Plus he bought my books - as often as he could spare the money. I ferried them in small batches, as he could only buy so many.",
    "You could tell he never found it easy talking to me. He wanted to keep our meetings as quick as possible. The boy has a dark secret, you can be sure of it.",
    "Last trip, he asked for the Adventures of Hannibus, and said he would pay well.",
    "It's Primrose's favourite book. I...I don't know if I can take it from her. But we need to eat. We need her medicines.",
    "Sloop was my husband's apprentice. He was a boy, not much older than Primrose, I guess. But he'd caught the wizarding bug: self-centred and ambitious. Still, he kept an ear out for news about Joss. Plus he bought my books - as often as he could spare the money. I ferried them in small batches, as he could only buy so many. You could tell he never found it easy talking to me. He wanted to keep our meetings as quick as possible. The boy has a dark secret, you can be sure of it. Last trip, he asked for the Adventures of Hannibus, and said he would pay well. It's Primrose's favourite book. I...I don't know if I can take it from her. But we need to eat. We need her medicines.",
    "I had no choice. I had to sell The Adventures of Hannibus. It was going to bring us food, medicine - which would make her strong again. We couldn't afford not to.",
    "I was going to ask permission from Primrose. But she wouldn't have understood.",
    "I took it from her as she slept. She had her arms around it, like she knew the plan. It took some jostling, but I had it. I can be delicate when I need to be.",
    "She didn't mention Hannibus the next morning. Not a word.",
    "I had no choice. I had to sell The Adventures of Hannibus. It was going to bring us food, medicine - which would make her strong again. We couldn't afford not to. I was going to ask permission from Primrose. But she wouldn't have understood. I took it from her as she slept. She had her arms around it, like she knew the plan. It took some jostling, but I had it. I can be delicate when I need to be. She didn't mention Hannibus the next morning. Not a word.",
    "I opened the book on the way to selling it. I couldn't tell you why - I never had an impulse to read a book before.",
    "I guess...I guess I was interested why Primrose had so much love for it.",
    "Inside was a slip of paper. A poem, lightly scrawled in feeble handwriting. Primrose confessed her love. She begged to be saved.",
    "The world fell away from me. I stopped the cart, and turned around. My head thrummed with rage. I worked the horse near to death.",
    "The fury was wild and directionless. I burned with rage at myself, then the flames moved to Joss. After all, everything bad came from that damned man.",
    "Finally, the fury rested on the books.",
    "When I returned home, I threw them all into the fireplace. Primrose screeched from her bed, begging me to stop.",
    "I lit the fireplace, and the books burned. But the magic on the books was fuel, and flame mushroomed out of the pit, knocking me to the floor.",
    "I was scarred and drowsy. Primrose was screaming about her friends burning, over and over.",
    "Gail found me, probably thanks to Primrose. She applied some salve to me, but there was no removing the scar. It was to be my brand.",
    "I opened the book on the way to selling it. I couldn't tell you why - I never had an impulse to read a book before. I guess...I guess I was interested why Primrose had so much love for it. Inside was a slip of paper. A poem, lightly scrawled in feeble handwriting. Primrose confessed her love. She begged to be saved. The world fell away from me. I stopped the cart, and turned around. My head thrummed with rage. I worked the horse near to death. The fury was wild and directionless. I burned with rage at myself, then the flames moved to Joss. After all, everything bad came from that damned man. Finally, the fury rested on the books. When I returned home, I threw them all into the fireplace. Primrose screeched from her bed, begging me to stop. I lit the fireplace, and the books burned. But the magic on the books was fuel, and flame mushroomed out of the pit, knocking me to the floor. I was scarred and drowsy. Primrose was screaming about her friends burning, over and over. Gail found me, probably thanks to Primrose. She applied some salve to me, but there was no removing the scar. It was to be my brand.",
    "I'm not ready to let her go, Gail. You've been a dear friend for so long, but...I need this. We need this. Give me another 30 days. I beg you.",
    "I'm not ready to let her go, Gail. You've been a dear friend for so long, but...I need this. We need this.",
    "Give me another 30 days. I beg you.",
    "You owe me this, Gail. You can't say no now. You can't. We need to fix what's happened. Primrose needs this. We need to do this for Primrose! I'm sorry, I don't mean to shout. I'm just tense, you know? Her legs are infected. Her skin is peeling. I...I don't know why she is so much worse. The Return does nothing. It just makes her more ill. Am I doing something wrong?",
    "You owe me this, Gail. You can't say no now. You can't.",
    "We need to fix what's happened. Primrose needs this. We need to do this for Primrose!",
    "I'm sorry, I don't mean to shout. I'm just tense, you know? Her legs are infected. Her skin is peeling. I...I don't know why she is so much worse.",
    "The Return does nothing. It just makes her more ill. Am I doing something wrong?",
    "You knew, Gail! You knew and now she's dead! How long has she been coming here? GAIL! You told her, didn't you? You told her about the Returning. This is on you. You killed Primrose. You killed her. YOU TRAITOR. YOU BETRAYED US. Do you think this leaves me with anything? I have nothing, Gail. It can all burn. I'm going to burn it ALL.",
    "You knew, Gail! You knew and now she's dead! How long has she been coming here? GAIL!",
    "You told her, didn't you? You told her about the Returning.",
    "This is on you. You killed Primrose. You killed her. YOU TRAITOR. YOU BETRAYED US.",
    "Do you think this leaves me with anything? I have nothing, Gail.",
    "It can all burn. I'm going to burn it ALL.",
    "Who are you? Stay away from us. Megan is mine. This family is mine. You hear me?",
    "Is she gone? She's gone! That thing in me - it's quiet. Whatever did you do? Please, help Primrose. And Gail. Gods, Gail!",
    "There's no way in this life that I'm going to take my needs over Primrose's. Not again. I've done far too much of that already. Send her back with The Needle. Do what you can to save her, Gail.",
    "Gail was my daughter? And now she leaves me? Again. Well, then I better prepare for her coming back! She can't come back to this mess! That will never do. Thank you for helping us all. I sense that none of this would have come to pass without you. Take the Needle. I have no need of it. May time be kind to you. But now it is time to tidy!",
    "Gail was my daughter? And now she leaves me? Again. Well, then I better prepare for her coming back! She can't come back to this mess! That will never do. Thank you for helping us all. I sense that none of this would have come to pass without you. Take the Needle. I have no need of it. May time be kind to you. But now it is time to tidy!"
  ],
  "Primrose": [
    "Mum! The books don't want to be in the bookcase! Just - stop fussing! And don't go calling them monsters! They're friends. No chance of me making any more friends. Gotta hold onto the ones I've got.",
    "I feel like I'm collecting bed sores! Note to self: jiggle around a bit more.",
    "Anyway, something odd - really odd - happened today. Mum brought me breakfast with a scar on her face.",
    "Long and wiggly, like a snake or a Guthix symbol. And it looks healed, like its been there for...I don't know how long. What's up with that?",
    "Did she think I wouldn't notice? But, you know, we did what we always did.",
    "I didn't say anything, in case she got angry again. And she treated me like I was five.",
    "I feel like I'm collecting bed sores! Note to self: jiggle around a bit more. Anyway, something odd - really odd - happened today. Mum brought me breakfast with a scar on her face. Long and wiggly, like a snake or a Guthix symbol. And it looks healed, like its been there for...I don't know how long. What's up with that? Did she think I wouldn't notice? But, you know, we did what we always did. I didn't say anything, in case she got angry again. And she treated me like I was five.",
    "I feel like I'm collecting bed sores! Note to self: jiggle around a bit more. Anyway, something odd - really odd - happened today. Mum brought me breakfast with a scar on her face. Long and wiggly, like a snake or a Guthix symbol. And it looks healed, like its been there for...I don't know how long. What's up with that? Did she think I wouldn't notice? But you know, we did what we always did. I didn't say anything, in case she got angry again. And she treated me like I was 5.",
    "Thok knows something wrong. Thok has Thok-sense: a tickle in Thok's beard when something is wonky.",
    "Thok beard is extra tickly.",
    "Mum is a Shade. Yep, like ones from my stories in Daemonheim. Thok is sure of it.",
    "Gilly knows. Thok has never seen a clown lie.",
    "We're your friends, Queen Primrose. Your army.",
    "Thok is your shield, and I am your lance.",
    "Gilly is your jester, and Baba your advisor.",
    "Should you need us, we're yours to command.",
    "Prim don't make me say! It's not a fun thing, not something that'll make you laugh, Primmy!",
    "Your mum has a diary. I thought it would be fun to see if there was a friend in the diary. Someone to cheer you up!",
    "But there wasn't a friend, Primmy. Not a friend at all.",
    "She's baaad, Prim! A wolf in sheep's clothing. Gilly saw her. Tell her, Gilly! Gilly knows that mum's pulling the wool over yer eyes. Baa!",
    "She's baaad, Prim! A wolf in sheep's clothing.",
    "Gilly saw her. Tell her, Gilly! Gilly knows that mum's pulling the wool over yer eyes. Baa!",
    "Sipping the potion, I could follow her. It wouldn't keep me going for long, but I could tail her as long as she didn't go far. I felt genuinely excited. I was an adventurer!",
    "Sipping the potion, I could follow her. It wouldn't keep me going for long, but I could tail her as long as she didn't go far.",
    "I felt genuinely excited. I was an adventurer!",
    "On the day before my birthday, there was only one entry. But on the day of my birthday, there were multiple. I read each entry on my birthday: there were several, in tiny handwriting.",
    "'She looks so much healthier'. 'Every time I travel back, I forget how much healthier she looks'. 'How can I give up seeing her this well?'",
    "Travelling back? What have you done, mum?",
    "On the day before my birthday, there was only one entry.",
    "But on the day of my birthday, there were multiple. I read each entry on my birthday: there were several, in tiny handwriting.",
    "'She looks so much healthier'. 'Every time I travel back, I forget how much healthier she looks'. 'How can I give up seeing her this well?'",
    "Travelling back? What have you done, mum?",
    "I've never really had a problem with being bored. I read, I write. And there's always my friends.",
    "My friends were a gift from my dad. A little apology before the utter scumbag ran away. When I read a book, the character pops into existence. But no one else can see them.",
    "Some of them I don't care much for. I've learned to keep them locked in their books. But Thok, and the others - I couldn't be without them.",
    "I've never really had a problem with being bored. I read, I write. And there's always my friends. My friends were a gift from my dad. A little apology before the utter scumbag ran away. When I read a book, the character pops into existence. But no one else can see them. Some of them I don't care much for. I've learned to keep them locked in their books. But Thok, and the others - I couldn't be without them.",
    "Hannibus was the first of my friends to appear from the books.",
    "Scared the anima right out of me! One minute I was reading, the next there was a lizardman, leaning over to get a better look at the book.",
    "I screamed of course. Mum came in and told me it was a fever, that I was seeing things. Pffrt. Even I couldn't make up a five-foot lizard reading books about himself.",
    "I wished Megan could see them. Baba, Thok, Gilly, Hannibus. Perhaps they would have made her happy, just as much as they made me.",
    "Hannibus was the first of my friends to appear from the books. Scared the anima right out of me! One minute I was reading, the next there was a lizardman, leaning over to get a better look at the book. I screamed of course. Mum came in and told me it was a fever, that I was seeing things. Pffrt. Even I couldn't make up a five-foot lizard reading books about himself. I wished Megan could see them. Baba, Thok, Gilly, Hannibus. Perhaps they would have made her happy, just as much as they made me.",
    "Sloop was the one who brought the news to us. Dad had run away from the Wizards' Tower. Something about plagiarism.",
    "He was due to go on trial that week, but he'd run from it.",
    "Dad was always a reader, never one to come up with ideas himself. I guess...I guess he just stole ideas from one of his old tomes.",
    "So, he left us to fend for ourselves, left me with mum. Just as I became ill.",
    "The worst part was Sloop. Without dad, there was no reason for Sloop to be at the house any more. Why would dad's apprentice visit when dad wasn't there?",
    "Mum wouldn't let him in. My love. My Sloop. So he got work at the Wizards' Tower, and passed notes in the books that mum sold to him. But even that's gone now.",
    "I know that Sloop won't give up on me. I know he will come for me.",
    "Sloop was the one who brought the news to us. Dad had run away from the Wizards' Tower. Something about plagiarism. He was due to go on trial that week, but he'd run from it. Dad was always a reader, never one to come up with ideas himself. I guess...I guess he just stole ideas from one of his old tomes. So, he left us to fend for ourselves, left me with mum. Just as I became ill. The worst part was Sloop. Without dad, there was no reason for Sloop to be at the house any more. Why would dad's apprentice visit when dad wasn't there? Mum wouldn't let him in. My love. My Sloop. So he got work at the Wizards' Tower, and passed notes in the books that mum sold to him. But even that's gone now. I know that Sloop won't give up on me. I know he will come for me.",
    "There's a story in one of the books. It was the only one mum liked to read to me.",
    "It's about a giant, Dubbo, who keeps a flock of sheep. He loves those sheep: force-feeds them hay; throws them from hand to hand to make sure they wake up;",
    "taps them om the head with his club, to make sure they go to sleep.",
    "Each day, one runs away. He can't understand why - he treats them so well! So, he eats that runaway sheep - in one go, pop! - to send a message to the others.",
    "But they keep running away, and he keeps eating them, pop pop pop! Eventually, one one remains.",
    "That sheep, Baba, puts up with the feeding, the throwing, the taps on the head. Does nothing. And Dubbo sits down in front of that sheep.",
    "'What's wrong with you, little runt?', the giant asks. But Baba won't answer, and won't run away.",
    "'Why won't you run away?', said Dubbo. He didn't know it, but he wanted the sheep to run away.",
    "So he goes out, gets into a fight with another giant and gets eaten himself. It's an odd story.",
    "Still, I like having Baba around the house as one of my friends. She visits and we chat. She's a real gossip, you know?",
    "There's a story in one of the books. It was the only one mum liked to read to me. It's about a giant, Dubbo, who keeps a flock of sheep. He loves those sheep: force-feeds them hay; throws them from hand to hand to make sure they wake up; taps them om the head with his club, to make sure they go to sleep. Each day, one runs away. He can't understand why - he treats them so well! So he eats that runaway sheep - in one go, pop! - to send a message to the others. But they keep running away, and he keeps eating them, pop pop pop! Eventually, one one remains.",
    "That sheep, Baba, puts up with the feeding, the throwing, the taps on the head. Does nothing. And Dubbo sits down in front of that sheep.",
    "'What's wrong with you, little runt?', the giant asks. But Baba won't answer, and won't run away.",
    "'Why won't you run away?', said Dubbo. He didn't know it, but he wanted the sheep to run away.",
    "So he goes out, gets into a fight with another giant and gets eaten himself. It's an odd story.",
    "Still, I like having Baba around the house as one of my friends. She visits and we chat. She's a real gossip, you know?",
    "Thok was one of my favourites. He knew it, of course, and would wander round the house beating his chest, calling himself 'Primrose's Champion'.",
    "He was going to protect me from everything, and everything was a potential threat. A twitch in a curtain was a ghost, a slammed door was a demon.",
    "I tried to tell him that demons had better things to do than playing with doors, but he'd look at me slyly and say 'that's what they want us to think'.",
    "I was so much happier having him around. And not just because of the threat of door demons.",
    "Thok was one of my favourites. He knew it, of course, and would wander round the house beating his chest, calling himself 'Primrose's Champion'. He was going to protect me from everything, and everything was a potential threat. A twitch in a curtain was a ghost, a slammed door was a demon. I tried to tell him that demons had better things to do than playing with doors, but he'd look at me slyly and say 'that's what they want us to think'. I was so much happier having him around. And not just because of the threat of door demons.",
    "There was one story I never read. It was about a demon: a hateful thing.",
    "This demon would thrive on the misery of others. But not by consuming that evil, or anything like that.",
    "She was miserable herslf. And she would bring others into her own misery, so that she could share it. She would bask in that shared misery.",
    "But to know her was to defeat her. To say her name was to stab her through the heart.",
    "Her heart was Metum. I made the mistake of reading the book once, bringing her to life. But I said her name aloud, and she was gone.",
    "There was one story I never read. It was about a demon: a hateful thing. This demon would thrive on the misery of others. But not by consuming that evil, or anything like that. She was miserable herslf. And she would bring others into her own misery, so that she could share it. She would bask in that shared misery. But to know her was to defeat her. To say her name was to stab her through the heart. Her heart was Metum. I made the mistake of reading the book once, bringing her to life. But I said her name aloud, and she was gone.",
    "Sloop was the one who brought the news to us. Dad had run away from the Wizards' Tower. Something about plagiarism.",
    "He was due to go on trial that week, but he'd run from it.",
    "Dad was always a reader, never one to come up with ideas himself. I guess...I guess he just stole ideas from one of his old tomes.",
    "So, he left us to fend for ourselves, left me with mum. Just as I became ill.",
    "The worst part was Sloop. Without dad, there was no reason for Sloop to be at the house any more. Why would dad's apprentice visit when dad wasn't there?",
    "Mum wouldn't let him in. My love. My Sloop. So he got work at the Wizards' Tower, and passed notes in the books that mum sold to him. But even that's gone now.",
    "I know that Sloop won't give up on me. I know he will come for me.",
    "Doing anything for more than a few minutes is the ultimate pain in the backside. My lungs burn, my knees go to jelly. I just fall over and want to go to sleep. Mum used to get medicines. It took all of our money to do it, but I wasn't going to convince her to stop. Megan's the only one who changes Megan's mind. The medicines would let me leave the bed, for a few days at least. And it would bring a smile to my mum! Which was, you know, something. Then I'd be back to bed like a brick fell on me. I had the idea of stealing some of the medicine for myself. You know, when mum wasn't there. But she rationed it so carefully! And we can't afford it now, anyway. Not now mum's given up the job at the Wizards' Tower. Huh. I wonder if I could make a simple strength potion? Just your average, home-made strength potion. Would that work?",
    "Doing anything for more than a few minutes is the ultimate pain in the backside. My lungs burn, my knees go to jelly. I just fall over and want to go to sleep.",
    "Mum used to get medicines. It took all of our money to do it, but I wasn't going to convince her to stop. Megan's the only one who changes Megan's mind.",
    "The medicines would let me leave the bed, for a few days at least. And it would bring a smile to my mum! Then I'd be back to bed like a brick fell on me.",
    "I had the idea of stealing some of the medicine for myself. You know, when mum wasn't there. But she rationed it so carefully!",
    "And we can't afford it now, anyway. Not now mum's given up the job at the Wizards' Tower.",
    "Huh. I wonder if I could make a simple strength potion? Just your average, home-made strength potion. Would that work?",
    "She mentioned it! I didn't even bring it up.",
    "She said the scar was from a wizard at the Wizards' Tower, an accident, and she didn't feel safe going back. From now on, she's staying at home.",
    "It's a big old bag of lies. It stinks. Not once did she look me in the eye! Gah! She's such an awful liar!",
    "It crossed my mind that the scar was just an excuse to stop going to the Tower. Did she know about Sloop? Was this all to stop us talking to each other through the books?",
    "Oh, Sloop, what am I going to do now?",
    "She mentioned it! I didn't even bring it up. She said the scar was from a wizard at the Wizards' Tower, an accident, and she didn't feel safe going back. From now on, she's staying at home. It's a big old bag of lies. It stinks. Not once did she look me in the eye! Gah! She's such an awful liar! It crossed my mind that the scar was just an excuse to stop going to the Tower. Did she know about Sloop? Was this all to stop us talking to each other through the books? Oh, Sloop, what am I going to do now?",
    "I began writing down the lies that mum was telling me. Every day there was a new one.",
    "1. The scar had come from an accident at the Wizards' Tower.",
    "2. That she would invite Sloop to the house when she next saw him.",
    "3. That we had plenty of money.",
    "4. That there was no need for medicine any more.",
    "My friends believe that she's not mum any more. They call her the 'Shade'.",
    "I began writing down the lies that mum was telling me. Every day there was a new one.",
    "1. The scar had come from an accident at the Wizards' Tower.",
    "2. That she would invite Sloop to the house when she next saw him.",
    "3. That we had plenty of money.",
    "4. That there was no need for medicine any more.",
    "My friends believe that she's not mum any more. They call her the 'Shade'.",
    "Hannibus was the first to call her the Shade, the name that my friends use, even though I tell them not to.",
    "She would leave most evenings, up to the hilltop, and Hannibus would watch for as long as he could, before he reached the limit of his magic.",
    "Always she would be in the same cloak, always she would head up the hill. The cloak would make her look like a shade, and each day she would grow more hunched.",
    "Hannibus was the first to call her the Shade, the name that my friends use, even though I tell them not to. She would leave most evenings, up to the hilltop, and Hannibus would watch for as long as he could, before he reached the limit of his magic. Always she would be in the same cloak, always she would head up the hill. The cloak would make her look like a shade, and each day she would grow more hunched.",
    "Baba came hopping into my room. Always made me laugh - she doesn't walk, more bounces.",
    "But I could see from her expression that something wasn't right. She lost her footing and tumbled into my sideboard, knocking over a medicine bottle.",
    "She told me that Gilly had found something, and that I should come right away.",
    "Baba came hopping into my room. Always made me laugh - she doesn't walk, more bounces. But I could see from her expression that something wasn't right. She lost her footing and tumbled into my sideboard, knocking over a medicine bottle. She told me that Gilly had found something, and that I should come right away.",
    "Gilly Willikers had a series of books, but I only ever kept one. It was Gilly Willikers and the Time Key, the first one.",
    "I liked Gilly. He never treated my illness seriously. He'd walk around with wobbly arms and legs, pretending to be me. I needed that.",
    "But Gilly had become serious. It was only after pushing him that I found out why.",
    "He knew something, and my other friends had to push him to tell me.",
    "He said that he had found a diary - my mum's diary - in her cloak and had opened it, hoping to find a new friend for me to play with.",
    "Gilly Willikers had a series of books, but I only ever kept one. It was Gilly Willikers and the Time Key, the first one. I liked Gilly. He never treated my illness seriously. He'd walk around with wobbly arms and legs, pretending to be me. I needed that. But Gilly had become serious. It was only after pushing him that I found out why. He knew something, and my other friends had to push him to tell me. He said that he had found a diary - my mum's diary - in her cloak and had opened it, hoping to find a new friend for me to play with.",
    "I took a dose of strength potion and, completely inelegantly, made my way to mum's bedside table, just as Gilly had told me.",
    "I couldn't quite understand what I was reading. On each day of the diary, there were multiple entries, written in tiny text and boxed off from each other.",
    "I looked for yesterday's date. Again, there were multiple entries for one day.",
    "One was familiar: it talked about the pie she had made, and noted that she thought I looked healthier having eaten it.",
    "But I didn't recognise the other entries for yesterday; they were events I didn't recognise. An argument we never had. A visit to the Wizards' Tower. A burning of the pie.",
    "Then I looked at tomorrow's entry: the 30th. The book was completely blank after that date.",
    "And every entry on the 30th, of which there were many, was the same. The Return. The Return. The Return. The Return. The Return.",
    "I took a dose of strength potion and, completely inelegantly, made my way to mum's bedside table, just as Gilly had told me. I couldn't quite understand what I was reading. On each day of the diary, there were multiple entries, written in tiny text and boxed off from each other. I looked for yesterday's date. Again, there were multiple entries for one day. One was familiar: it talked about the pie she had made, and noted that she thought I looked healthier having eaten it. But I didn't recognise the other entries for yesterday; they were events I didn't recognise. An argument we never had. A visit to the Wizards' Tower. A burning of the pie. Then I looked at tomorrow's entry: the 30th. The book was completely blank after that date. And every entry on the 30th, of which there were many, was the same. The Return. The Return. The Return. The Return. The Return.",
    "It was the 30th: the day of The Return, whatever in all Gielinor THAT was.",
    "I resolved to follow mum on her nightly trip out of the house. Hannibus gave me his lance, Thok his shield.",
    "I knew they would both disappear as soon as I left the house, but I thanked them anyway.",
    "The door closed as my mum left. I pulled a dark cloak over my shoulders, took a swig for strength, and then stepped out into the darkness.",
    "Mum had a small firebrand, which made her easy to follow, but I had no such luxury. I was locked to darkness. Every sound I made, I feared she would turn around. But she on{{Sic}",
    "We passed something like a grave, but I had no time to dilly-dally, mum was many steps ahead of me. I could feel the strength in me already sapping.",
    "Mum reached the top, and I hid behind a berry bush on the edge of the clearing. A tall blue woman called Gail was waiting for my mother.",
    "They talked, and I could only make out fragments. And then Gail danced without music.",
    "It was the 30th: the day of The Return, whatever in all Gielinor THAT was. I resolved to follow mum on her nightly trip out of the house. Hannibus gave me his lance, Thok his shield. I knew they would both disappear as soon as I left the house, but I thanked them anyway. The door closed as my mum left. I pulled a dark cloak over my shoulders, took a swig for strength, and then stepped out into the darkness. Mum had a small firebrand, which made her easy to follow, but I had no such luxury. I was locked to darkness. Every sound I made, I feared she would turn around. But she only had eyes for the hilltop. We passed something like a grave, but I had no time to dilly-dally, mum was many steps ahead of me. I could feel the strength in me already sapping. Mum reached the top, and I hid behind a berry bush on the edge of the clearing. A tall blue woman called Gail was waiting for my mother. They talked, and I could only make out fragments. And then Gail danced without music.",
    "She was mesmerising. Gail glowed as she danced, and a thread span from her, flicking high into the air before resting in place, as if she was drawing the constellations.",
    "Then thread upon thread layered onto each other, until a woven dome formed over the top of them - and me.",
    "As she danced around, I thought she caught my eye. I hid my own eyes and skulked further behind the berry bush. But she danced on.",
    "Lights flashed, centring on the needle, and then... all was calm. Mum walked towards Gail, who looked exhausted, and laid a hand on her head.",
    "Gail said something to my mum - something about 'doubt', about me doubting her, perhaps. Gail flashed me a look.",
    "Whatever happened was coming to an end, and there was no time to linger. I shuffled away from the hilltop and caught a foot on a root, stumbling down to where the grave was[sic]",
    "She was mesmerising. Gail glowed as she danced, and a thread span from her, flicking high into the air before resting in place, as if she was drawing the constellations. Then thread upon thread layered onto each other, until a woven dome formed over the top of them - and me. As she danced around, I thought she caught my eye. I hid my own eyes and skulked further behind the berry bush. But she danced on. Lights flashed, centring on the needle, and then... all was calm. Mum walked towards Gail, who looked exhausted, and laid a hand on her head. Gail said something to my mum - something about 'doubt', about me doubting her, perhaps. Gail flashed me a look. Whatever happened was coming to an end, and there was no time to linger. I shuffled away from the hilltop and caught a foot on a root, stumbling down to where the grave was before.",
    "She was so beautiful. It was breathtaking.",
    "I mean, she was scary too. She was about twice as big as me, even without me being hunched, and had a hundred times the strength and a million times the magic.",
    "I desperately wanted to meet her and get to know her. I felt it in the belly, right next to my sickness.",
    "She was so beautiful. It was breathtaking. I mean, she was scary too. She was about twice as big as me, even without me being hunched, and had a hundred times the strength and a million times the magic. I desperately wanted to meet her and get to know her. I felt it in the belly, right next to my sickness.",
    "As I rolled down the hill, desperate to get away, I came to rest where the grave was earlier.",
    "But it had gone. There was nothing here. Impossible!",
    "I clawed at the soil, thought better of myself, and then stumbled back towards the house.",
    "I remembered Gail's look, the one she gave me on the hilltop. It felt like she knew me.",
    "As I rolled down the hill, desperate to get away, I came to rest where the grave was earlier. But it had gone. There was nothing here. Impossible! I clawed at the soil, thought better of myself, and then stumbled back towards the house. I remembered Gail's look, the one she gave me on the hilltop. It felt like she knew me.",
    "I returned to the house, flinging the cloak under my bed. My legs trembled with the night's effort.",
    "My friends asked where I had been, as if they didn't know. Thok, Hannibus, Baba, Gilly: they all talked as if nothing had happened.",
    "Then mum walked in, her silhoulette filling and darkening the room. My friends retreated to their books, as if mum could see them.",
    "Mum leaned over me, kissed my cheek and whispered 'Happy Birthday, Little Primrose' before turning to leave.",
    "I reached below my bed for my cloak, and searched in the pockets for the diary. I flicked to my birthday, and there it was.",
    "I returned to the house, flinging the cloak under my bed. My legs trembled with the night's effort. My friends asked where I had been, as if they didn't know. Thok, Hannibus, Baba, Gilly: they all talked as if nothing had happened. Then mum walked in, her silhoulette filling and darkening the room. My friends retreated to their books, as if mum could see them. Mum leaned over me, kissed my cheek and whispered 'Happy Birthday, Little Primrose' before turning to leave. I reached below my bed for my cloak, and searched in the pockets for the diary. I flicked to my birthday, and there it was.",
    "On the day before my birthday, there was only one entry.",
    "But on the day of my birthday, there were multiple. I read each entry on my birthday: there were several, in tiny handwriting.",
    "'She looks so much healthier'. 'Every time I travel back, I forget how much healthier she looks'. 'How can I give up seeing her this well?'",
    "Travelling back? What have you done, mum?",
    "On the day before my birthday, there was only one entry. But on the day of my birthday, there were multiple. I read each entry on my birthday: there were several, in tiny handwriting. 'She looks so much healthier'. 'Every time I travel back, I forget how much healthier she looks'. 'How can I give up seeing her this well?' Travelling back? What have you done, mum?",
    "Dear Gail.",
    "For reasons I've never understood, you've always been there for us. And we both know that you've seen me at the berry bush. For these reasons, I owe you the truth.",
    "When I found out what mum was doing, turning back time to keep me alive, I struggled with what to do. I thought about confronting her, and telling her to stop.",
    "To let me die. To enjoy the moments left with me.",
    "But I knew that wouldn't stop her. She would find a moment when I was asleep to go back in time, to begin another loop without me being aware.",
    "There was only one thing I could do. A necessary evil. I couldn't let mum know that I was aware of the Returnings, so I determined to follow her through every time loop.",
    "I hope you understand why I am doing this. Please, don't reveal me or my plan. Let me keep coming to the berry bush.",
    "If not for me, do this for mum. I do all of this for her. She needs to break this loop so that she can live herself.",
    "Look after her, Gail.",
    "Primrose.",
    "Dear Gail. For reasons I've never understood, you've always been there for us. And we both know that you've seen me at the berry bush. For these reasons, I owe you the truth. When I found out what mum was doing, turning back time to keep me alive, I struggled with what to do. I thought about confronting her, and telling her to stop. To let me die. To enjoy the moments left with me. But I knew that wouldn't stop her. She would find a moment when I was asleep to go back in time, to begin another loop without me being aware. There was only one thing I could do. A necessary evil. I couldn't let mum know that I was aware of the Returnings, so I determined to follow her through every time loop. I hope you understand why I am doing this. Please, don't reveal me or my plan. Let me keep coming to the berry bush. If not for me, do this for mum. I do all of this for her. She needs to break this loop so that she can live herself. Look after her, Gail. Primrose.",
    "What's happened? Where is mum? Please, find her. She's not safe by herself."
  ],
  "Gail": [
    "Stupid, so stupid! I should've been here. But I can fix this.",
    "I can fix this! Sit down, sit down. Let me offer you a WISH.",
    "There is no way, that I am going to let this happen again. I am going to look after Primrose. Nothing is going to get past me.",
    "I can fix this! Sit down, sit down. Let me offer you a WISH.",
    "There is no way, that I am going to let this happen again. I am going to look after Primrose. Nothing is getting past me.",
    "The end is a beginning, Megan. I will give you another Return, but you have to prepare yourself. The anima...she won't let you do this forever. Events will conspire, and you will not be able to follow this path continuously. You may not see it in Primrose, but I see your daughter: she is Doubt, and Doubt blossoms faster than any disease. Time can do nothing to halt that.",
    "The end is a beginning, Megan. I will give you another Return, but you have to prepare yourself.",
    "The anima...she won't let you do this forever. Events will conspire, and you will not be able to follow this path continuously.",
    "You may not see it in Primrose, but I see your daughter: she is Doubt, and Doubt blossoms faster than any disease.",
    "Time can do nothing to halt that.",
    "Helping someone is the hardest thing in the world.",
    "Hurting someone pushes them away. Help someone - they'll need you again and again and again.",
    "They will need to return the favour, reimburse you, or they'll need your help forevermore. You can be sure that you're the new centre of their world.",
    "I have never met someone who needs people more intensely than Megan. Both Primrose and I.",
    "Actually, saying no to someone in need: THAT'S the hardest thing in the world.",
    "Helping someone is the hardest thing in the world. Hurting someone pushes them away. Help someone - they'll need you again and again and again. They will need to return the favour, reimburse you, or they'll need your help forevermore. You can be sure that you're the new centre of their world. I have never met someone who needs people more intensely than Megan. Both Primrose and I. Actually, saying no to someone in need: THAT'S the hardest thing in the world.",
    "The knife slipped between my ribs. I don't remember much of what Megan said as she stood above me, but it was clear she blamed me for Primrose's death.",
    "Then she ran downhill, and I moved as close to the Needle as I could. My life was ebbing, but I was still able to touch the Needle.",
    "I prepared to use the pausing phrase: 'Wenla'",
    "Perhaps, somehow, we will be found. With the Needle, they will understand our story and save us all. Megan, Primrose and myself.",
    "It's the only way this can all be unwritten.",
    "The knife slipped between my ribs. I don't remember much of what Megan said as she stood above me, but it was clear she blamed me for Primrose's death..",
    "Then she ran downhill, and I moved as close to the Needle as I could. My life was ebbing, but I was still able to touch the Needle.",
    "I prepared to use the pausing phrase: 'Wenla'",
    "Perhaps, somehow, we will be found. With the Needle, they will understand our story and save us all. Megan, Primrose and myself.",
    "It's the only way this can all be unwritten.",
    "I was born as I am now. I didn't have a mother, father or childhood. I was me, nothing more, and I came to... next to the Needle.",
    "I knew what The Needle was, but I knew next to nothing about myself. It's a back-to-front way of learning about the world.",
    "I knew how to use The Needle, what its limits were, how it used time. But I had no idea about people, the world, nothing.",
    "I'm learning fast and leaving a trail of mistakes behind me, I am sure of it.",
    "I was born as I am now. I didn't have a mother, father or childhood. I was me, nothing more, and I came to... next to the Needle. I knew what The Needle was, but I knew next to nothing about myself. It's a back-to-front way of learning about the world. I knew how to use The Needle, what its limits were, how it used time. But I had no idea about people, the world, nothing. I'm learning fast and leaving a trail of mistakes behind me, I am sure of it.",
    "Joss, Primrose and Megan weren't the first people I had encountered.",
    "There were the people of the Colony to the east. But they were a fearful people, and hid behind their walls.",
    "There were the smaller people of the south-east. They were quick to their pikes, and pushed me back into the treeline.",
    "Men and women would occasionally stray close to me, but they were so caught up in their hunting and woodcutting that I didn't want to interrupt.",
    "But there was something different about the family. They seemed to have this happy energy, and I wondered what it would be like to share in that.",
    "Joss, Primrose and Megan weren't the first people I had encountered. There were the people of the Colony to the east. But they were a fearful people, and hid behind their walls. There were the smaller people of the south-east. They were quick to their pikes, and pushed me back into the treeline. Men and women would occasionally stray close to me, but they were so caught up in their hunting and woodcutting that I didn't want to interrupt. But there was something different about the family. They seemed to have this happy energy, and I wondered what it would be like to share in that.",
    "I struggled with what 'family' meant. Never having parents or siblings will do that to you.",
    "But I've found myself pulled into Primrose and Megan's lives more and more, like a black hole.",
    "I've tried to move on and away, but they've needed me. I've felt responsible. I've wanted to see them happy. And - if I'm honest - I've felt happy that they needed me.",
    "I can only imagine that is what 'family' means.",
    "I struggled with what 'family' meant. Never having parents or siblings will do that to you. But I've found myself pulled into Primrose and Megan's lives more and more, like a black hole. I've tried to move on and away, but they've needed me. I've felt responsible. I've wanted to see them happy. And - if I'm honest - I've felt happy that they needed me. I can only imagine that is what 'family' means.",
    "Megan asked that I stay by the Needle. She was to look after Primrose from now on. Somewhere along the line, she had lost her trust in me.",
    "Before a Returning, she would often burn Primrose's books.",
    "It was like a ritual. A habit that she couldn't crawl out of. But Primrose wouldn't wake from it this time. She lay in bed and ignored it.",
    "If Megan was clearer of mind, she would have seen it for the clue that it was: Primrose was aware of everything she was doing.",
    "Megan asked that I stay by the Needle. She was to look after Primrose from now on. Somewhere along the line, she had lost her trust in me. Before a Returning, she would often burn Primrose's books. It was like a ritual. A habit that she couldn't crawl out of. But Primrose wouldn't wake from it this time. She lay in bed and ignored it. If Megan was clearer of mind, she would have seen it for the clue that it was: Primrose was aware of everything she was doing.",
    "Ever since Megan burned the books, something had moved in her. It was like Megan shifted aside, to be seen only occasionally.",
    "There was something in there with her. At first I thought she'd just abandoned her sense of self: given everything up for Primrose.",
    "But no. There was someone in there with her. A thing.",
    "Ever since Megan burned the books, something had moved in her. It was like Megan shifted aside, to be seen only occasionally. There was something in there with her. At first I thought she'd just abandoned her sense of self: given everything up for Primrose. But no. There was someone in there with her. A thing.",
    "I'd always meant to ask Primrose if there was something in the books, something that might have been unleashed when Megan burned them.",
    "But Primrose and I were kept apart by Megan. We never had the chance to talk like we did...before.",
    "Was this Thing in Megan from the books? Ah, why did I never ask her?",
    "I'd always meant to ask Primrose if there was something in the books, something that might have been unleashed when Megan burned them. But Primrose and I were kept apart by Megan. We never had the chance to talk like we did...before. Was this Thing in Megan from the books? Ah, why did I never ask her?",
    "I never told Megan how much a Returning hurt. It didn't just sap the energy of the Needle - it sapped from me, too.",
    "I would sleep, propped up next to The Needle. It would give off a little heat as it recharged, and it felt like it was doing the same to me.",
    "I never told Megan how much a Returning hurt. It didn't just sap the energy of the Needle - it sapped from me, too. I would sleep, propped up next to The Needle. It would give off a little heat as it recharged, and it felt like it was doing the same to me.",
    "Megan never understood why Primrose was getting progressively ill after each Returning. She would wind back in time, and everything would revert apart from the illness.",
    "At first she despaired, but that progressed to anger. It was a cruel fate that denied Primrose her health. Even time was fighting against her.",
    "Just one more Returning, she would say. One more would make it right.",
    "But Primrose was following Megan every time. Primrose was committed to ending her mother's pain.",
    "Megan never understood why Primrose was getting progressively ill after each Returning. She would wind back in time, and everything would revert apart from the illness. At first she despaired, but that progressed to anger. It was a cruel fate that denied Primrose her health. Even time was fighting against her. Just one more Returning, she would say. One more would make it right. But Primrose was following Megan every time. Primrose was committed to ending her mother's pain.",
    "There wasn't much left of Primrose any more. She found strength to make it up to the hilltop - she found it from somewhere - but she was rarely awake otherwise.",
    "Often, I would let myself into the house as both Megan and Primrose were asleep. Buckthorn berry makes a rudimentary salve, and I would apply it to Primrose as she dreamed.",
    "It eased her pain, but there was no stopping her fate.",
    "I couldn't stay for long in the house, not only because I might get caught, but because I felt I was being watched. Someone, some Thing...staring at me.",
    "There wasn't much left of Primrose any more. She found strength to make it up to the hilltop - she found it from somewhere - but she was rarely awake otherwise. Often, I would let myself into the house as both Megan and Primrose were asleep. Buckthorn berry makes a rudimentary salve, and I would apply it to Primrose as she dreamed. It eased her pain, but there was no stopping her fate. I couldn't stay for long in the house, not only because I might get caught, but because I felt I was being watched. Someone, some Thing...staring at me.",
    "It was at the end of one of the Returnings, once Primrose had rushed home and Megan followed a little time after.",
    "Primrose had hooked a small sheet of paper onto a buckthorn - a message for me. It spoke of a necessary evil.",
    "It spoke of a necessary evil.",
    "It was at the end of one of the Returnings, once Primrose had rushed home and Megan followed a little time after. Primrose had hooked a small sheet of paper onto a buckthorn - a message for me. It spoke of a necessary evil.",
    "Primrose was there again, behind the buckthorn bush, as Megan begged for another Return.",
    "Primrose had been there, without fail for the past three Returns.",
    "Every time, The Needle took all three of us back, and every time Primrose rushed to be in bed before her mother arrived.",
    "Megan never saw her, never thought that Primrose might have been following her. All Megan saw was a cruel fate - a daughter getting progressively ill within a time loop.",
    "But Primrose was on the verge of dying. It was time to say no to Megan and begin what must be begun.",
    "Primrose was there again, behind the buckthorn bush, as Megan begged for another Return. Primrose had been there, without fail for the past three Returns. Every time, The Needle took all three of us back, and every time Primrose rushed to be in bed before her mother arrived. Megan never saw her, never thought that Primrose might have been following her. All Megan saw was a cruel fate - a daughter getting progressively ill within a time loop. But Primrose was on the verge of dying. It was time to say no to Megan and begin what must be begun.",
    "It was time to say no. Perhaps it was time long ago.",
    "And I knew what it would mean for me, the cost for me.",
    "But this wouldn't be our ending, not for any of us. I knew that the moment I saw Primrose behind the buckthorn bush.",
    "It all clicked together. I knew what we all were in that moment. We were family.",
    "I was going to help my family by saying no.",
    "It was time to say no. Perhaps it was time long ago. And I knew what it would mean for me, the cost for me. But this wouldn't be our ending, not for any of us. I knew that the moment I saw Primrose behind the buckthorn bush. It all clicked together. I knew what we all were in that moment. We were family. I was going to help my family by saying no.",
    "Something was always going to give. We couldn't loop forever, and at some point... we would reach an ending.",
    "And now we've reached it. But is it a closed loop, or the start of another story?",
    "Something was always going to give. We couldn't loop forever, and at some point... we would reach an ending. And now we've reached it. But is it a closed loop, or the start of another story?",
    "Primrose fainted loudly, crashing into the buckthorn. Megan turned and I couldn't stop her from running to her.",
    "Megan assumed the worst. She was panicking, shaking Primrose. She couldn't sense life as I could, and there was a thread of it still in Primrose.",
    "Megan was convinced that Primrose was dead, and I couldn't convince her otherwise.",
    "It is cruel to think it, but I believe that Megan wanted it to be true in some way. Deep down, she wanted to end this loop she had created for herself.",
    "That was when I saw the knife in her hand.",
    "Primrose fainted loudly, crashing into the buckthorn. Megan turned and I couldn't stop her from running to her. Megan assumed the worst. She was panicking, shaking Primrose. She couldn't sense life as I could, and there was a thread of it still in Primrose. Megan was convinced that Primrose was dead, and I couldn't convince her otherwise. It is cruel to think it, but I believe that Megan wanted it to be true in some way. Deep down, she wanted to end this loop she had created for herself. That was when I saw the knife in her hand.",
    "The buckthorn is a versatile bush. Its berries can be crushed and heated to make a salve, while its leaves can be used like a smelling salt, waking up the unconscious.",
    "And it makes for a great hiding spot, of course! Primrose proved that every Returning, keeping well away from Megan.",
    "Is it ironic that Primrose fainted on it? I'm not sure I have a handle on irony yet.",
    "The buckthorn is a versatile bush. Its berries can be crushed and heated to make a salve, while its leaves can be used like a smelling salt, waking up the unconscious.  And it makes for a great hiding spot, of course! Primrose proved that every Returning, keeping well away from Megan. Is it ironic that Primrose fainted on it? I'm not sure I have a handle on irony yet.",
    "The knife slipped between my ribs. I don't remember much of what Megan said as she stood above me, but it was clear she blamed me for Primrose's death..",
    "Then she ran downhill, and I moved as close to the Needle as I could. My life was ebbing, but I was still able to touch the Needle.",
    "I prepared to use the pausing phrase: 'Wenla'",
    "Perhaps, somehow, we will be found. With the Needle, they will understand our story and save us all. Megan, Primrose and myself.",
    "It's the only way this can all be unwritten.",
    "The knife slipped between my ribs. I don't remember much of what Megan said as she stood above me, but it was clear she blamed me for Primrose's death..",
    "Then she ran downhill, and I moved as close to the Needle as I could. My life was ebbing, but I was still able to touch the Needle.",
    "I prepared to use the pausing phrase: 'Wenla'",
    "Perhaps, somehow, we will be found. With the Needle, they will understand our story and save us all. Megan, Primrose and myself.",
    "It's the only way this can all be unwritten.",
    "Is there death in my future? Can I die?",
    "Or am I more kin to the Needle than Primrose or Megan?",
    "Whatever the answer, I feel like I have more stories in me. I don't feel like this is the end.",
    "Something tells me that this is not the beginning either.",
    "Is there death in my future? Can I die? Or am I more kin to the Needle than Primrose or Megan? Whatever the answer, I feel like I have more stories in me. I don't feel like this is the end. Something tells me that this is not the beginning either.",
    "Buckthorn...",
    "Give me some time to get my wind back. Wake Primrose. The buckthorn leaf will do that for you. And please, do what you can for Megan.",
    "Buckthorn...",
    "Megan, I haven't been honest with you. I knew what Primrose was doing, but didn't feel it was my place to intervene. I'm still not sure if I made the right decision. But we are here, the decision was made, and Primrose does not have long. You have three options, Megan. You take the time that Primrose has remaining, and you bring her as much joy as you possibly can. Enjoy your days together, but they will be days. Perhaps less. The second is to allow you The Returning, just one last time. Although I denied you it, it was because you were not yourself. It would allow you one last month. But there is a dishonesty in that, and Primrose is unsure of you in that time. It may not be the release you are looking for. The third option may be the least satisfying for you. But it may save Primrose. It would require a great sacrifice from you. I told you that the Needle could not go back further than 30 days. That is not entirely true. It can go back further, years in fact. But that comes with a terrible cost. You become one with the Needle, you become subsumed by it. Whomever goes back becomes its warden, its keeper. They are strong when it is strong, they are weak when it is weak. We could send Primrose back, years in the past. She would be paired with The Needle, but she would also share its strength. She would be healed. But she would also have no memory of you or her own past. she would be a newborn in terms of the mind. I ask you, Megan: would you let her die now, in a month's time, or be reborn with no memory of you?",
    "I understand. Could you both wait in the house. This won't take long."
  ],
  "The following text is transcluded from Transcript": [
    "Scroll (The Needle Skips).",
    "Letter from Primrose.",
    "Metum the devoid - Tywyll Daethstod.",
    "Note from gail."
  ],
  "Thok": [
    "Thok knows something wrong. Thok has Thok-sense: a tickle in Thok's beard when something is wonky. Thok beard is extra tickly. Mum is a Shade. Yep, like ones from my stories in Daemonheim. Thok is sure of it. Gilly knows. Thok has never seen a clown lie."
  ],
  "Hannibus": [
    "We're your friends, Queen Primrose. Your army. Thok is your shield, and I am your lance. Gilly is your jester, and Baba your advisor. Should you need us, we're yours to command."
  ],
  "Gilly Willikers": [
    "Prim don't make me say! It's not a fun thing, not something that'll make you laugh, Primmy! Your mum has a diary. I thought it would be fun to see if there was a friend in the diary. Someone to cheer you up! But there wasn't a friend, Primmy. Not a friend at all."
  ],
  "The Needle's magic worked": [
    "Primrose survived and will live a long life. I send you love for making that decision. It cannot have been easy."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:The_Needle_Skips?oldid=36228270’"
  ]
}