{
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "Missing some dialogue options.You can discuss this issue on the talk page or edit this page to improve it."
  ],
  "Sir Tiffy Cashien": [
    "(If you have completed The Slug Menace.) Good day, Proselyte. Is there anything I can do for you?",
    "Spiffing! You are eager, aren't you? As a matter of fact, I do have a small assignment for you.",
    "Should be straightforward. We've had a few reports of a strange, pest-like creature being sighted south of Falador. It's probably nothing; the locals might just have an infestation of large cockroaches.",
    "What, what? No, my lad/lass. I already have some agents in the field following up the reports, but I'd like you to head over to the Void Knight Outpost and investigate the possibility of a pest escaping from the island.",
    "What ho, if that's how you feel.",
    "That's the spirit! When you get to the outpost, speak to Commodore Matthias. Report back to me here, once you have found anything.",
    "Find out anything at the Void Knight Outpost?",
    "What ho? Well, that's no good. Time is of the essence! Go to the outpost, a ship from Port Sarim will take you there. Speak to Commodore Matthias when you get there. It couldn't be simpler, whippersnapper!",
    "Good day, Proselyte. Is there anything I can do for you?",
    "Ah, reporting back about the pest sightings?",
    "And he shall have it! Let's go meet that ship, my lad/girl. You can tell me all the details en route.",
    "Korasi arrived safely at Temple Knight HQ.",
    "Of course, we're not holding her prisoner. Since you're not carrying anything, we can go right now.",
    "Of course, we're not holding her prisoner. But Temple Knight HQ is a secure area. I can't let you in until you've put everything you're carrying in your bank, old boy.",
    "Good day, Proselyte. Is there anything I can do for you?",
    "Physically, she's recovering well, but she's taken a blow to her confidence and spirit. Those will take longer to heal than the physical wounds. Did you deliver the bad news to Commodore Tyr, yet?",
    "Bad news is like bad-tasting medicine: it's better to taste it sooner rather than later. You don't want someone else to break the news to him."
  ],
  "Player": [
    "Do you have any new jobs for me?",
    "What do I have to do?",
    "So, I have to exterminate some cockroaches?",
    "Hmm, I don't really have time to do that right now. Maybe some other time.",
    "That seems pretty unlikely, but it shouldn't take too long to verify.",
    "Yes, sir!",
    "Err, not yet. I haven't exactly spoken to anyone.",
    "Who are you?",
    "The who?",
    "What kind of work?",
    "What's the problem?",
    "How can I help?",
    "What's 'Gielinor'?",
    "Uh huh, sure.",
    "Where does this ship go?",
    "I'd like to go to your outpost.",
    "That's nice.",
    "I'd like to go to your outpost.",
    "I'm fine, thanks.",
    "Hello, I'm looking for Commodore Matthias. Could you point him out to me?",
    "Thanks!",
    "Hello, I'm looking for Commodore Matthias. Could you point him out to me?",
    "Thanks!",
    "Hi, are you Commodore Matthias?",
    "I've been sent here by Sir Tiffy of the Temple Knights. There have been reports of a pest being sighted south of Falador and he wants me to investigate the truth of the sightings.",
    "Sir Tiffy has knights doing that already. He wants me to investigate if the pest may have come from here. I just want to interview the people on the island and see if anyone knows anything.",
    "Commodore, I...",
    "Hi, I'm investigating the possibility of a pest escaping from these islands. Do you know anything?",
    "Captain Tyr?",
    "Commodore Matthias said you could assist me. I'm conducting an investigation regarding reports of a pest on the mainland. Sir Tiffy of the Temple Knights wants me to investigate the possibility of the pest coming from here.",
    "Why only this half? Surely I should speak to everyone?",
    "Hi, Captain Tyr.",
    "I've been talking to people. They sure do have a lot of little problems around here!",
    "Nothing related to the pest, from what I can tell.",
    "Hi, can I ask you some questions? I'm trying to find out if anyone has been acting suspiciously lately.",
    "Um, I'm not sure I understand.",
    "Why are you so busy?",
    "Oh, that seems very nice.",
    "What makes you think Terry is involved?",
    "Have you heard anything about pests escaping?",
    "But you do have access to the pests and could have smuggled one out...",
    "That's all, thanks.",
    "Hi.",
    "Could I ask you a few questions? I'm investigating reports of a pest escaping onto the mainland. Have you seen anyone acting suspiciously?",
    "How is he acting 'weird'?",
    "What do you think he's up to?",
    "So, you don't think he might have been spending his spare time exporting pests from the island to the mainland?",
    "What do you and Terry get up to?",
    "That's all, thanks.",
    "Hi. I'm investigating reports of a pest escaping onto the mainland. Have you seen anyone acting suspiciously?",
    "Why haven't you been spending time with anyone else?",
    "In your basement? Don't Void Knights usually work out in the field stopping pests?",
    "What is your research about?",
    "They're pests, they're trying to invade our world and destroy it. I don't see peace on the horizon.",
    "Why is Sam obsessed with cake?",
    "Have you heard anything about pests escaping?",
    "Well, obviously they have, or I wouldn't be asking. Do you have access to pests?",
    "But you don't take part in the battles? You're just observing.",
    "That's all, thanks.",
    "Hi.",
    "Could I ask you a few ques-",
    "What?",
    "Um, I'm investigating the escape of a pest onto the mainland. Have you noticed anyone-",
    "Right. I'm really not here about cake. I need to know if anyone has been acting suspiciously.",
    "I'm going to put that down as a 'no', then.",
    "(Same as above.)",
    "That's all, thanks.",
    "That's all, thanks.",
    "Hi. I'd like to ask you a few questions. I'm investigating reports of a pest escaping onto the mainland. Have you seen anyone acting suspiciously?",
    "Has anything happened to make your sister nervous?",
    "How is she acting suspiciously?",
    "Do you have access to the pests?",
    "That's all, thanks.",
    "Hello. I'd like to ask you a few questions. Have you seen anyone acting suspiciously lately?",
    "Why does your mother spy on you?",
    "You what?",
    "Who did break the vase?",
    "Have you heard anything about pests escaping?",
    "But you do have access to the pests?",
    "That's all, thanks.",
    "Howdy, I'd like to ask you a few questions. I'm investigating reports of a pest escaping onto the mainland. Have you seen anyone acting suspiciously?",
    "I was sent by the Temple Knights, not your sister. I just have a few questions.",
    "How is Diana acting suspiciously?",
    "Why wouldn't your sister think you're fine?",
    "Has anything unusual happened recently?",
    "That's all, thanks.",
    "Hi. I'm investigating reports of a pest escaping onto the mainland. have you seen anyone acting suspiciously?",
    "How is Mariah acting suspiciously?",
    "Couldn't your son have broken the vase?",
    "Have you heard anything about pests escaping?",
    "Do you have access to the pests?",
    "That's all, thanks.",
    "Do you have a minute? I'd like to ask you some questions.",
    "Have you noticed anyone acting suspiciously lately?",
    "He's what?",
    "Okay... Anyone else acting strange?",
    "How is she acting 'weird'?",
    "What's she doing down there?",
    "Has she said anything?",
    "What do you think she's up to?",
    "Have you heard anything about pests escaping?",
    "Do you have access to pests? Could you smuggle one out?",
    "That's all thanks.",
    "(When you've talked to everyone.) Whew! I think I've spoken to everyone. I should go talk to Captain Tyr.",
    "Hi, Captain Tyr.",
    "I've spoken to everyone, I think.",
    "Err, no. Not yet.",
    "(Same as above.)",
    "I believe you've done something wrong.",
    "You broke Mrs Gord's vase.",
    "You stole money from Diana.",
    "You let a pest escape to the mainland.",
    "That's all, thanks.",
    "Hello. I'd like to ask you a few questions. Have you seen anyone acting suspiciously lately?",
    "(Same as above.)",
    "(Same as above.)",
    "(Same as above.)",
    "I believe you've done something wrong.",
    "You broke your mother's vase.",
    "I think we both know that you did. You got angry with her and broke the vase in revenge.",
    "You stole money from Diana.",
    "You're sure?",
    "You let a pest escape to the mainland.",
    "You've been cheating with Mikhal's girlfriend.",
    "That's all, thanks.",
    "Howdy, I'd like to ask you a few questions. I'm investigating reports of a pest escaping onto the mainland. Have you seen anyone acting suspiciously?",
    "I was sent by the Temple Knights, not your sister. I just have a few questions.",
    "(Same as above.)",
    "(Same as above.)",
    "(Same as above.)",
    "I believe you've done something wrong.",
    "You broke Mrs Gord's vase.",
    "You stole money from Diana.",
    "You let a pest escape to the mainland.",
    "That's all, thanks.",
    "Hi, can I ask you some questions? I'm trying to find out if anyone has been acting suspiciously lately.",
    "Um, I'm not sure I understand.",
    "(Same as above.)",
    "(Same as above.)",
    "(Same as above.)",
    "I believe you've done something wrong.",
    "You broke Mrs Gord's vase.",
    "You stole money from Diana.",
    "You let a pest escape to the mainland.",
    "You're planning to ditch your girlfriend.",
    "Maybe you should explain that to her before the misunderstanding spirals out of control.",
    "That's all, thanks.",
    "Hi.",
    "Could I ask you a few questions? I'm investigating reports of a pest escaping onto the mainland. Have you seen anyone acting suspiciously?",
    "(Same as above.)",
    "(Same as above.)",
    "(Same as above.)",
    "I believe you've done something wrong.",
    "You broke Mrs Gord's vase.",
    "You stole money from Diana.",
    "You let a pest escape to the mainland.",
    "You're cheating on your boyfriend.",
    "Maybe you should explain all that to him before the rumours get out of control.",
    "That's all, thanks.",
    "Hi. I'd like to ask you a few questions. I'm investigating reports of a pest escaping onto the mainland. Have you seen anyone acting suspiciously?",
    "I believe you've done something wrong.",
    "You broke Mrs Gord's vase.",
    "You stole money from Diana.",
    "Err, no. Never mind.",
    "You let a pest escape to the mainland.",
    "That's all, thanks.",
    "Hi. I'm investigating reports of a pest escaping onto the mainland. have you seen anyone acting suspiciously?",
    "I believe you've done something wrong.",
    "You broke your own vase and accused others.",
    "You stole money from Diana.",
    "You let a pest escape to the mainland.",
    "That's all, thanks.",
    "Do you have a minute? I'd like to ask you some questions.",
    "Have you noticed anyone acting suspiciously lately?",
    "He's what?",
    "Okay... Anyone else acting strange?",
    "I believe you've done something wrong.",
    "You broke Mrs Gords vase.",
    "You stole money from Diana.",
    "You let a pest escape to the mainland.",
    "That's all thanks.",
    "Hi. I'm investigating reports of a pest escaping onto the mainland. Have you seen anyone acting suspiciously?",
    "(Same as above.)",
    "(Same as above.)",
    "(Same as above.)",
    "(Same as above.)",
    "I believe you've done something wrong, Jessika.",
    "You have broken Mrs Gord's vase.",
    "You've stolen money from Ami's sister.",
    "You let a pest escape to the mainland.",
    "I think I'll present my findings to Captain Tyr and see what he thinks.",
    "That's all, thanks.",
    "I'm afraid I'm going to have to report you to Captain Tyr.",
    "I'm glad I could help.",
    "I'm sure it'll all turn out for the best.",
    "Well, if you'd owned up sooner, you probably wouldn't have been in so much trouble...",
    "That's great! I'm glad everything worked out.",
    "I'm glad I could help.",
    "Maybe if you smothered him less, he wouldn't hide things from you.",
    "Congratulations!",
    "Hello.",
    "I know. You don't have any cake. I didn't want any, anyway.",
    "I confronted Jessika about releasing a pest. Her denial was weak, and I think she may know something even if she didn't do it herself.",
    "Commodore, I think I've made a breakthrough, and Captain Tyr agrees. I've questioned everyone and the only person who would have had access to the pests and may also have a motive for releasing one is Jessika, the researcher.",
    "Yes, but you don't consider pests to be as big of a threat as the rest of us. You might feel letting a pest go free is harmless.",
    "I'll do it.",
    "What will I need to do?",
    "No, I can't do that.",
    "That's a memory, alright, but she's trying really hard to obscure it. I guess I'll have to unscramble it to find out what the memory means.",
    "I'm sorry, Commodore, but Jessika did release a pest. I unscrambled the memory, saw an image of the pest and heard her thoughts about it. I think it's conclusive.",
    "I don't know. I only saw an impression of the memory, no details.",
    "Could I ask you some questions?",
    "Why can't I go in the landing party with you?",
    "What's the Valluta that was mentioned?",
    "How do you plan on tracking the pest?",
    "I don't have any more questions.",
    "Congratulations on being left in charge, Captain. That must be quite a responsibility.",
    "Are you going with the landing party to look for the pest?",
    "Aren't you excited? Hunting pests is your thing.",
    "Are you going with the landing party to look for the pest?",
    "Well, good luck! I'll see you there when you land.",
    "Are you going with the landing party to look for the pest?",
    "I don't think pests care about or even like cake.",
    "Waiting and not knowing must be hard.",
    "Are you going with the landing party to look for the pest?",
    "Good luck!",
    "What's stopping you?",
    "Are you going with the landing party to look for the pest?",
    "Don't you think you should let Terry go help?",
    "Could I go in and see Jessika?",
    "I don't think I should tell you, Jessika. I might get in trouble.",
    "Are you excited to be going on the hunt for the pest?",
    "Sir, I've completed my investigation at the Void Knight Outpost.",
    "Yes, sir. It appears a pest is loose. A small contingent of Void Knights is coming over to hunt it down. I'm to meet them at Port Sarim, but Commodore Matthias wanted the support of the Temple Knights.",
    "Korasi! What's wrong? Where is everyone else?",
    "No ship has arrived with a contingent of Void Knights?",
    "Can I see her? We need to find out what happened.",
    "Korasi, what happened?",
    "How did you end up on the docks?",
    "That's it! Her memories are locked away just like Jessika's were. I can go into her mind and unlock them, then we'll find out what happened. Do you still have some of that potion, Korasi?",
    "Yes.",
    "Yes, let's do it.",
    "No, not right now. I'll come back in a bit.",
    "Erm, hello?",
    "What's going on? Where am I? This isn't like the last time.",
    "What's going on?",
    "What do I need to do?",
    "How much do I weigh in memories?",
    "How do I send people back and forth?",
    "Could you be less cryptic?",
    "(Same as above.)",
    "(Same as above.)",
    "What do I need to do?",
    "(Same as above.)",
    "Everyone's dead.",
    "There was an attack on the ship. Pests managed to get there somehow and they killed all the knights. The Commodore was fighting...someone - I couldn't make out who. The Commodore was killed, but with his last breath he teleported Korasi away. That's how we found her at Port Sarim.",
    "Of course, Korasi.",
    "How are you doing, Korasi?",
    "How is Korasi doing, Sir Tiffy?",
    "How is Korasi doing?",
    "Not yet.",
    "Tyr, I must speak with you.",
    "I'm afraid that may no longer be the case. I have some bad news...Commodore Matthias is dead. He died saving Korasi, so she could report to me and Sir Tiffy what had happened. There was a pest attack aboard the boat, but someone was controlling them, and Commodore Matthias was killed. I'm...I'm sorry.",
    "Maybe you should go back to the mainland, see some family?",
    "I guess you're glad you stopped Terry from becoming a knight, huh?",
    "Does it make you think twice about wanting to become a Void Knight?"
  ],
  "Squire": [
    "Hi, how can I help you?",
    "I'm a Squire for the Void Knights.",
    "The Void Knights, they are great warriors of balance who do Guthix's work here in Gielinor.",
    "Ah well you see we try to keep Gielinor as Guthix intended, it's very challenging. Actually we've been having some problems recently, maybe you could help us?",
    "Well the order has become quite diminished over the years, it's a very long process to learn the skills of a Void Knight. Recently there have been breaches into our realm from somewhere else, and strange creatures have been pouring through. We can't let that happen, and we'd be very grateful if you'd help us.",
    "We send launchers from our outpost to the nearby islands. If you go and wait in the lander there that'd really help.",
    "(Same as below.)",
    "It is the name that Guthix gave to this world, so we honour him with its use.",
    "To the Void Knight outpost. It's a small island just off Karamja.",
    "No, no one can see the prisoner. We don't want any more escaped pests!",
    "I'm sorry, you can't go in there, Player.",
    "She just appeared out of nowhere. I think it was a teleport of some kind.",
    "No, sir/ma'am! I've seen no Void Knight ships today."
  ],
  "Korasi": [
    "Certainly. He's to the east of here in the command hut. He has white hair and a beard; you can't miss him.",
    "I know it's not possible! We Void Knights are loyalt to the cause and would never allow something like that to happen. You're just wasting your time.",
    "Impossible! How could she possibly have done it?",
    "How did you do it? How COULD you do it? Has living among us taught you nothing?",
    "Perhaps we should use Jessika to track it, sir. She has been studying them, and we may be able to persuade her to help if we promise not to harm it. I think Guthix will forgive such a lie in the aid of killing a pest.",
    "Yes, sir.",
    "Nhhhhhhhhhhh.",
    "Uuuuuugh, where am I? What happened?",
    "Bernard saw the seaweed while he was on watch in the crow's nest. He wasn't thinking about a promotion or his sister.",
    "I am Korasi. I was standing nowhere, thinking about nothing. I saw nothing.",
    "What's going on up there?",
    "What the...a pest?",
    "Commodore, they're all dead! Commodore?",
    "Commodore!"
  ],
  "Captain Tyr": [
    "Sure! He's in the building behind me; the man with the white hair.",
    "That's me. How can I help you?",
    "An escaped pest? I suppose it would be within the realm of possibility that a pest could escape from the islands, but it's highly unlikely. Still, orders are orders. I'd recommend talking to the people on this half of the island first. Someone might have seen something.",
    "I find tasks are easier if you break them into smaller parts. Start with this half, I think there are 9 people you should talk to, and we'll see how far we get. If you don't find anything, report back to me and we'll take it from there.",
    "Hello, Player. Making progress with your investigation?",
    "It's a small island; people have a tendency to get on each other's nerves. Nothing too serious, I hope?",
    "Keep at it. There are quite a few people living on the island these days. They all have a little day to day gripes, so you'll have to see through them and see if anyone stands out as hiding something important.",
    "Hello, Player. Making progress with your investigation?",
    "Well done! That was quite a task. Why don't you tell me what you've found out and we can decide if any of it is worth following up.",
    "Very thoroughly done. I think you may be on to something, but I don't want to interfere. You should think about everything you've heard and see if anyone stands out as a likely candidate. It would be someone who has access to pests and has a motive for wanting to release one. If you think you have a candidate, confront that person to see what they say. They may confirm your suspicions. Then, I think you'll be ready to report back to Commodore Matthias.",
    "Have you confronted anyone about releasing a pest?",
    "If you're having trouble deciding, you should think about everything you've heard and see if anyone stand out as a candidate. It would be someone who has access to pests and has a motive for wanting to release one. If you think you have a candidate, confront that person to see what they say. They may confirm your suspicions. Then, I think you'll be ready to report back to Commodore Matthias.",
    "Hmm, interesting, that was the conclusion I came to as well. Her reaction does seem telling. You must report this to the Commodore. He will want to investigate this further himself.",
    "Oh, hello, Player. I'm afraid I don't have time to chit chat, I'm about to go into the field. The Commodore wishes to speak with you, urgently.",
    "Yes, sir.",
    "It will be no easy feat, but I think the best course is to take a contingent to the mainland and track down the beast. There's no telling how far it may have gotten, but a small force will minimise panic and will be able to cover ground more quickly. It will also not leave our post here unmanned.",
    "Not one I'm afraid to bear. I'll relish the chance to prove myself to the Commodore. Good luck on the hunt, Player. I do wish I could join you, but my duty is here.",
    "I can't speak, Player. A huge pest insurgence is happening and I must lead the knights!",
    "Very well, but you should address me as Captain.",
    "No, it can't... How could this have happened? Matthias...dead? Thank you for telling me, Player. I'll work with Sir Tiffy to determine the best course of action. We'll get in touch with you when we're ready. I'd like to thank you for all the help you have shown the Void Knights."
  ],
  "Commodore Matthias": [
    "I am.",
    "Then why are you here? Shouldn't you be investigating the sightings near Falador?",
    "No one under my command would let a pest escape. But, go ahead and waste your time investigating, if it keeps us on good terms with the Temple Knights. I don't have time to deal with you myself, though. Speak to my second in command, Captain Tyr. He's around here somewhere...big bloke with floppy hair.",
    "Look, I don't like you investigating my people, but I respect Sir Tiffy and I'm not going to get on his bad side. Investigate your case, but don't bother me unless you've run it by Captain Tyr first.",
    "That harmless girl? I can't believe it. Still, if Tyr thinks so too, I guess I'd better speak with her.",
    "Jessika, please cooperate. I gave you permission to research here on the understanding that you would obey all of our rules. If a pest is loose on the mainland, we need all the information we can get. I am not accusing you of releasing a pest, I simply need to follow up any leads. Player feels you may know something.",
    "That's enough. I'm afraid, Jessika, we must take more drastic measures to find the truth, to be certain you have nothing to hide. The Void Knights have developed a potion that will let the drinker enter the mind of another person.",
    "I'm sorry, Jessika, but the danger of a pest on the mainland calls for extraordinary measures. I insist that you do this, else all of your research will be confiscated and you and any other mages from the Wizards' Tower will be banned from these islands. Will you consent?",
    "Very good. To maintain balance, I want someone unrelated to the Void Knights to enter your mind, so they will be unbiased to your thoughts about pests. Player, are you willing to enter Jessika's mind and find out the truth?",
    "That is very good, Player. I'm sure this will all turn out well. Jessika has a good heart, and I'm sure this is all a simple misunderstanding.",
    "Drink the potion and focus on the memories you want to access. On entering Jessika's mind, you will see those memories and be able to determine if she did release a pest on to the mainland or not. Korasi, please give some of the potion to Player. We shall begin immediately.",
    "That's unfortunate. I will not proceed with this line of enquiry unless you agree to it. Think on it and speak to me if you change your mind.",
    "What did you find out, Player?",
    "Enough! Jessika, I hereby sentence you to house arrest on the Void Knight Outpost until other arrangements can be made. Your research will be confiscated and you will be under guard at all times.",
    "No! I have heard enough. You have betrayed the Void Knights and you have betrayed me. You have put us all at risk, and I will not hear your excuses. Korasi: escort Jessika back to her dwellings, confiscate her research and have her guarded. Meet back at HQ and we'll decide what to do next.",
    "No.",
    "Player, I must apologise for not cooperating with you more. I'm grateful for the work you have done on this. A pest loose on the mainland is what we have always fought against. I'm afraid dark times are ahead, and that your work is only beginning. Captain Tyr: please bring the highet ranked knights here. We need to discuss our plans.",
    "Our worst nightmare is upon us: a pest has made it to the mainland. We need to make a plan of action and act immediately to prevent any further damage the pest may cause. Suggestions?",
    "A good suggestion, Tyr. I agree that is the best course of action. What sort of hunting strategies will work best on the mainland?",
    "No. It is because of her actions we are in this mess. We'll keep her on the Outpost until the pest is caught and dealt with. Then I will have the time to consider what we should do with her.",
    "Any other thoughts for tracking the pest?",
    "Do you believe every fairy tale you've ever heard? The Valluta is just a dream old Void Knights have so that one day we may lay down our arms. It's not real! We're not getting anywhere. We'll discuss tracking once we've reached the mainland and can better assess the situation. I will lead the expedition as it was my foolish decision to let outsiders study the pests. Korasi and a select few will accompany me. Captain Tyr: you're in charge while I'm away. Player, you will go ahead of our landing party and update Sir Tiffy on recent events. Speak to me after this meeting if you have any questions. Seek balance, everyone.",
    "Ah, Player. I was hoping you'd speak to me. I wanted to tell you to head back separately ahead of our landing party. I want you to report back to Sir Tiffy and tell him what we've learned. We'll need the Temple Knights' help in hunting the pest.",
    "Of course, but when you're finished, you really must go back and report to Sir Tiffy. I have lots to do and can't spend all day chatting.",
    "We still have a lot of preparation to do before we leave. It's vital you get back quickly and bring Sir Tiffy up to date. Don't worry, once you've done that, we'll have arrived and the hunt shall begin!",
    "Oh, that old wives' tale. Some of the older Knights tell tales of a weapon that can destroy all pests, or stop them, or stop portals. It depends on who's telling the tale. I think several generations ago some of the Knights searched for the weapon, but it came to nothing, because it's not real. It's a myth that puts into words our wish to end the battle with the pests. We carry a heavy burden, but we carry it because we must.",
    "I was hoping you would help us. Your knowledge of the mainland is far greater than ours. It won't be an easy task, but pests leave signs of their presence and you mainland folk aren't accustomed to their appearance. It won't be able to hide anywhere for long.",
    "Good. Report to Sir Tiffy and then meet us at Port Sarim. We'll begin our hunt!",
    "Korasi! Get away. Get to shore, NOW!",
    "Aaaauuugh!",
    "Nooo..."
  ],
  "Knight Mikhal": [
    "Depends on how you define suspicious. Does stealing someone's girlfriend count?",
    "I'm working myself to the bone trying to earn enough money for a gift for my girlfriend, Mariah. Meanwhile, my best friend, Terry, is stealing her away from me. I would call that pretty suspicious.",
    "I'm working extra hours and training more so I can get a promotion and earn more money. I want to buy Mariah a nice gift and ask her to marry me.",
    "Because he's been acting really jumpy every time I see him. I've also seen Mariah around his house a couple of times.",
    "No, I spend all my time trying to stop them escaping. When I'm not fighting pests I'm training for a promotion.",
    "And risk my whole career? What's wrong with you? We Void Knights are here to stop pests invading. Suggesting anything else is just insulting.",
    "Depends on how you define suspicious. Does stealing someone's girlfriend count?",
    "I'm working myself to the bone trying to earn enough money for a gift for my girlfriend, Mariah. Meanwhile, my best friend, Terry, is stealing her away from me. I would call that pretty suspicious.",
    "What? No, I haven't. I know better than to touch Mrs Gord's porcelain!",
    "I haven't stolen from anyone! I earn my own money through hard work.",
    "I work myself to the bone stopping those creatures from escaping these islands. How can you, an outsider, dare accuse me of letting one escape?",
    "No, I'm not. I don't ever want to lose her, I'm going to propose, but I want to save up enough money to get her a gift first.",
    "Yes, I've been chosen. It looks like all my hard work has paid off.",
    "Thanks."
  ],
  "Mariah": [
    "Hi.",
    "I think my boyfriend is acting weird - he keeps avoiding me. I come to visit him as often as I can, but when I'm here he ignores me. If it weren't for his friend, Terry, I'd die of boredom!",
    "Well, he's always making excuses for why he can't spend time with me. He has to work, or he has training to do, or he's too tired. No one else seems to be as busy as he is!",
    "I think he wants to break up with me, but can't work up the nerve to do so. Oh, that'd be horrible. I don't want to break up - I love him!",
    "I-I-I don't know! I thought I knew him, but now I'm not so sure. He's a good person and a devoted Void Knight. I don't think he'd do anything like that.",
    "Nothing! Terry is still living with his mum, so he never does anything if she doesn't give permission first. I just go around to his house to have someone to talk to. It's better than sitting here on my own, while Mikhal ignores me.",
    "Hi.",
    "I think my boyfriend is acting weird - he keeps avoiding me. I come to visit him as often as I can, but when I'm here he ignores me. If it weren't for his friend, Terry, I'd die of boredom!",
    "No, I didn't. Terry did that, he told me so himself.",
    "Who's Diana? Money? I don't know who or what you're talking about.",
    "And how exactly would I do that? I'm not a Void Knight, I'm just visiting. I don't have access to the pests, and I wouldn't want to - they're disgusting.",
    "No, I am not! I swear I'm not. There's no one else in the world I love more. But he's been ignoring me, and I don't know what else to do, so I hang out with other people and then rumours start. It's so unfair.",
    "He proposed! I can't believe it. I'm so happy!",
    "I hope Mikhal's okay. I haven't heard anything about their mission. He did say it was top secret, though, so I guess I wouldn't be allowed to hear anything.",
    "That's the life of a knight, though. They put themselves in danger to protect us all, never knowing what will happen.",
    "He's dead! He's dead! My Mikhal is dead!",
    "And leave his grave? Never! I'm going to stay here, with him."
  ],
  "Jessika": [
    "A pest escaped? Wow. Um, no one's been acting strangely. Well, I haven't been spending much time with everyone else, so I wouldn't really know. My research has been...time consuming. Actually, that Sam guy is pretty weird. Don't talk to him about cake. I wouldn't say he was suspicious, though.",
    "I've been very busy. Much of my work takes place in my basement, so I don't see very many people.",
    "Oh, I'm not a Void Knight. I'm a mage from the Wizards' Tower doing research on the magic pests use to create portals.",
    "I'm studying pests and the portals they create. They're really very advanced creatures. I think with a bit of work we could stop fighting and make peace.",
    "You don't know anything about them! They're highly intelligent and can feel emotions.",
    "I don't know, he's very odd. He apparently wanted to be a Void Knight to stop the pests from getting at his cake.",
    "No! I haven't heard anything like that. Have other people heard that?",
    "I'm allowed onto the battlefield for research. I've seen them up close, they're quite impressive creatures.",
    "That's right. I don't like killing things, pests or otherwise.",
    "A pest escaped? Wow. Um, no one's been acting strangely. Well, I haven't been spending much time with everyone else, so I wouldn't really know. My research has been...time consuming. Actually, that Sam guy is pretty weird. Don't talk to him about cake. I wouldn't say he was suspicious, though.",
    "No, I didn't. I haven't been to Mrs Gord's in weeks. I've been too busy.",
    "What? Ami's sister is a good friend of mine. I would never steal from her.",
    "No! No. I didn't. You have no proof! And escape is a subjective term! I mean, what if it was more like...freeing?",
    "But I didn't do anything wrong!",
    "But I don't, I already told you! You've been very kind to me and I would never do anything to endanger anyone.",
    "That's invasive! I don't want someone in my head. I've told you everything.",
    "My research is important; I don't want to lose it. I'll consent.",
    "I hope he made it to the mainland okay - he was so weak. Professor Melville said he'd look after him; I'm sure he's fine.",
    "I was studying it in my basement. I taught it, him, to remove himself from the hive mind. Once he managed that, he was his own creature. He could think and feel and wasn't a threat! Living among the Void Knights has taught me that while you may seek balance, you see things only in black and white. You would have killed him! So, I smuggled him out. I'm sorry I hurt you, but I don't regret it. It was the right thing to do.",
    "You don't understand, Commodore. He won't hurt anyone, I promise. He's intelligent and can feel. If you'd just listen!",
    "Commodore, please! Just listen...",
    "Is that you, Player? What's going on? Have they found the pest?"
  ],
  "Squire Sam": [
    "Hi.",
    "I don't have any cake!",
    "Oh. You weren't talking about that. Please continue.",
    "Eating cake? No. No one has been eating cake. I swear.",
    "They're all acting suspiciously! They all want my cake! Not that I have any cake. I swear. You're not getting any!",
    "Vase has the same number of letters as cake.",
    "I don't need money, I have cake!",
    "Pests steal cakes! Stop the pests!",
    "Hi.",
    "I don't have any-",
    "Yes! I must stop them getting my cake!",
    "Of course they do! How could they not like cake? That's just crazy talk."
  ],
  "Knight Diana": [
    "No, not really. I guess my sister, Ami, has been acting a bit weird - she's been really jumpy lately. She gets angry when I try to talk about it, saying that I'm too nosey. I guess I am a bit nosey, but she's my sister and I care about her!",
    "Well, some of my money went missing last week, but I don't see why that would make HER nervous. I'm not really too upset about it.",
    "She snaps at me whenever I talk to her and she always seems to jump when I come into a room. I feel like she's hiding something, but I don't know what.",
    "No, I haven't. Our whole purpose here is to STOP pests escaping. I think we would have noticed if one had escaped.",
    "Not really, I've only just reached knighthood. I work in the shops when I'm not training.",
    "No, not really. I guess my sister, Ami, has been acting a bit weird - she's been really jumpy lately. She gets angry when I try to talk about it, saying that I'm too nosey. I guess I am a bit nosey, but she's my sister and I care about her!",
    "What? No I didn't. I've never been over to Mrs Gord's house.",
    "I AM Diana! Are you accusing me of stealing money from myself?",
    "How dare you! I risk my life fighting pests every day. I would never do a thing like that.",
    "Player, I'd like to thank you for getting my sister to talk to me. We had a long talk and things are better between us than they have been in a long time.",
    "Yes...I am.",
    "I am, but I have a bad feeling about this. It's probably nothing, though.",
    "My weight in memories is eight."
  ],
  "Terry Gord": [
    "Suspiciously? No, no. No one acting suspiciously around here. Did my mother send you to talk to me? She's always trying to spy on me. She drives away all my friends. She accused Mariah of breaking her stupid vase and now Mariah won't even speak to me.",
    "Because she doesn't want me to have a life. Ever since dad died fighting the pests, she's been extra protective. It makes me so mad that sometimes I...",
    "Nothing. I do nothing. I just hold it in. I know she means well...",
    "I don't know! It was on a rickety old table - anyone could have knocked it off while innocently just walking by.",
    "No, that'd be the stupidest thing ever. Those pests will destroy us if they get a chance.",
    "No, my mum won't let me be a knight. She's afraid I'll die...like my dad.",
    "Suspiciously? No, no. No one acting suspiciously around here. Did my mother send you to talk to me? She's always trying to spy on me. She drives away all my friends. She accused Mariah of breaking her stupid vase and now Mariah won't even speak to me.",
    "No, I did not!",
    "It was an accident! I just walked by and the thing fell off the table.",
    "No, I didn't.",
    "Of course I'm sure!",
    "What? No, I didn't. I don't even have access to the pests! My mum won't let me be a knight ever since my father died fighting the pests.",
    "Huh? Mariah? Heck, no, I wouldn't ever want to date Mariah. She's a snob! I only let her visit because Mikhal's my best friend. He's been really busy and I thought he'd want me to keep her out of his hair for a while.",
    "I'm so jealous. Ami and Diana are going with the landing party to the mainland. I wish I could become a Void Knight - I want adventures like they have.",
    "My mother won't let me.",
    "I heard about the landing party. All my friends...and the Commodore...",
    "Yes and no. I want to become one to honour their memory and keep the fight going, but to lose so many..."
  ],
  "Knight Ami": [
    "NO! No one's been acting suspiciously. Did my sister Diana send you to talk to me? I told her I'm FINE. If anyone is acting suspiciously, it's her!",
    "I don't know, she just is. She keeps pestering me and looking at me when she thinks I don't notice. And she's always talking about money. How she can afford this or that, or how she'll get me a present. I don't want her to buy things for me, I want to buy my own things!",
    "I don't know, I am fine. She says I've been avoiding her and that I've been snappish, but maybe I just don't want to hang out with her.",
    "No, nothing unusual at all! Diana claims some of her money went missing, but she has so much I don't see how she can be sure.",
    "NO! No one's been acting suspiciously. Did my sister Diana send you to talk to me? I told her I'm FINE. If anyone is acting suspiciously, it's her!",
    "What? I haven't ever been in Mrs Gord's house! I didn't even know she had a vase.",
    "Omygosh! You won't tell her, will you? I'm going to pay it back, I just got tired of her lording it over me!",
    "What? How could you accuse me of that? I spend my life here preventing pests from escaping this island. I would never risk the rest of the world with such carelessness!",
    "I talked to my sister about the money after you found me out. She forgave me and we had a long talk about everything. Thanks for calling me out on it. It's really made things better between us.",
    "Yes, I was selected! I haven't been to the mainland in a long time. I'm looking forward to it.",
    "My weight in memories is five."
  ],
  "Mrs Gord": [
    "No, I haven't. I've been too busy cleaning up. Someone broke my favourite vase and just left it here, shattered into a million pieces. My son said he thought he saw someone run out of the house, but does he know who? No, of course not. I leave my son alone for a few minutes and he lets some hooligan into the house who breaks my nice things. I bet it was Mikhal's girlfriend, Mariah. She's always stopping by to see my son...and tracking in mud, leaving trash all over the house... She's always acting cagey and suspicious. Must be the guilt.",
    "Well, she's always sneaking around! She looks embarrassed when I see her, like she's hiding something. I don't like my son hanging out with girls like that.",
    "My son? Never. I asked him outright if he broke the vase and he said no. My boy would never lie to me.",
    "Escaping? Heavens, no! I think I'd faint if one of them escaped - they're vile beasts.",
    "Access to them? Dear, they're not exactly something you access. But no, I've never seen one, let alone accessed one. My husband was a Void Knight and died; I want nothing to do with pests.",
    "No, I haven't. I've been too busy cleaning up. Someone broke my favourite vase and just left it here, shattered into a million pieces. My son said he thought he saw someone run out of the house, but does he know who? No, of course not. I leave my son alone for a few minutes and he lets some hooligan into the house who breaks my nice things. I bet it was Mikhal's girlfriend, Mariah. She's always stopping by to see my son...and tracking in mud, leaving trash all over the house... She's always acting cagey and suspicious. Must be the guilt.",
    "I most certainly have not! How dare you suggest such a thing.",
    "Who is Diana and why would I steal from her? What are you gibbering on about?",
    "What? You think I would disrespect the memory of my dead husband by letting one of those evil creatures off this island? Are you mad?",
    "I can't believe my son - oh, he makes me so mad! And to think I was blaming that poor girl and saying all those nasty things...",
    "Oh, what do you know?",
    "I can't believe a pest actually escaped. My husband must be turning in his grave.",
    "And lose all I have left? Not a chance!",
    "I heard about the landing party. All those young people...and the Commodore...",
    "Yes, but now he knows a pain that won't leave him for the rest of his life. Maybe I should reconsider, let him train...it might help take his mind off things."
  ],
  "Knight Bernard": [
    "Sure, I've got time.",
    "Well, my friend Sam always acts suspicious, but that's because he's paranoid...and more than a little bit obsessed with cake.",
    "He thinks no one knows, but everyone does. He hoards cake and lies about it. He doesn't want to share it with other people.",
    "Well, now that you mention it, that girl Jessika has been acting a little weird. She's normally very friendly and talkative but, lately, she just talks to herself and looks a little sad. I just figured she got some bad news from home or something. It's probably nothing.",
    "Well, she's researching pests, but she's been spending a lot more time in her basement than out in the field.",
    "No idea. I didn't ask, she didn't tell. I don't like to pry.",
    "Not to me. She's been talking to herself a lot, though. I've caught a few snatches of it, something about hoping her friend made it. Not sure what she meant.",
    "She's probably just doing some delicate experiments or something. I've never really understood her research. Pests should be destroyed, it's as simple as that.",
    "No, it'd be pretty difficult to do. As far as I know, they can't swim, so they'd have to get back on a ship. But who would want to? The pests want to destroy us; it'd be madness to release one.",
    "I'm a Void Knight. I don't have access to anything except hard work. I swore when I became a knight to kill pests on sight, and do everything in my power to stop the pests from spreading.",
    "Sure, I've got time.",
    "Well, my friend Sam always acts suspicious, but that's because he's paranoid...and more than a little bit obsessed with cake.",
    "He thinks no one knows, but everyone does. He hoards cake and lies about it. He doesn't want to share it with other people.",
    "Well, now that you mention it, that girl Jessika has been acting a little weird. She's normally very friendly and talkative but, lately, she just talks to herself and looks a little sad. I just figured she got some bad news from home or something. It's probably nothing.",
    "Nope, not me. I haven't done anything.",
    "Nope, not me. I haven't done anything.",
    "Nope, not me. I haven't done anything.",
    "You caused quite a stir with all your questions. I hope you know what you're getting yourself into.",
    "Sir, what about the Valluta? I've heard some of the older knights telling tales of it. They said it was able to destroy pests on sight, like squashing a bug with your toe. That'd be a handy weapon to have while hunting the pest.",
    "Yes, I am.",
    "I look forward to it.",
    "My weight in memories is two."
  ],
  "TERRY GORD": [
    "You again? I've been grounded for the rest of my life because of you! My mother found out about that dumb vase breaking."
  ],
  "Knight Mikhail": [
    "We're engaged! We talked about everything after you questioned us and she accepted my proposal!"
  ],
  "Commander Korasi": [
    "Of course! I'm thrilled the Commodore thinks I'm ready to join him on such a task. Besides, Tyr is much better at leading - I'm not ready for that yet.",
    "I don't remember. We set sail from the Outpost and then...I was on the docks and you where there.",
    "I don't know. I wasn't wet, so I guess I didn't swim, but I'm not very good at magic, so I couldn't have teleported myself. I just don't remember.",
    "I think so. Yes, here it is.",
    "Are you ready to go, Player?",
    "Great!",
    "Very well.",
    "Yes. I remember now... The Commodore... We must carry on. There is a greater threat here than we thought.",
    "Someone doesn't want the Void Knights to find that pest on the mainland.",
    "I don't know if I can face him just yet. Player, would you do this for me? Please?",
    "I'll be okay. Please speak to Tyr soon, Player. I don't want him to find out from another source what happened to Commodore Matthias."
  ],
  "Sir Tiffy": [
    "You there! Did you see what happened, lass?",
    "Something is afoot. We must get her out of the open and find out what has happened. Savant, come in Savant.",
    "Send in Lady Table. I need her to escort someone to HQ.",
    "Lady Table, please escort Commander Korasi to HQ, quickly.",
    "We need to determine what happened. She knows you, so she will be more open with you. Ask her questions, but don't push her too hard.",
    "It's no good, Player. Those memories are locked away, and questioning her won't get them out.",
    "Is that the potion you mentioned earlier, Player - the one that let you enter someone's head?",
    "Very well. It sound unorthodox, but we have no other options.",
    "What happened?",
    "We mustn't act rashly. Korasi must return to the Void Knight Outpost and inform Captain Tyr... I mean, Commodore Tyr, of what has happened.",
    "Very well. Korasi, you will stay here and recover. The Temple Knights will quietly begin the hunt for the pest. Right now, this mysterious puppet master thinks he has the upper hand. We must do nothing to suggest otherwise.",
    "She'll recover, but I think the guilt will weigh on her. Not that she is guilty of anything, but she feels like she failed Matthias. You should really go speak to Captain Tyr and inform him of what has occurred. I expect he will become the new Commodore."
  ],
  "Savant": [
    "I'm here, Sir Tiffy. What's going on?",
    "I'll send her now."
  ],
  "Lady Table": [
    "Yes, Sir Tiffy."
  ],
  "Knight Bernard/Knight Ami/Knight Diana": [
    "You must speak to the crossing guardian."
  ],
  "Ami": [
    "The Commodore was thinking about Jessika. He didn't see the shark or the seagull and he wasn't in the hold.",
    "I am Ami. I was standing nowhere, thinking about nothing. I saw nothing."
  ],
  "Bernard": [
    "Ami was thinking about her sister while she was working in the rigging. Her sister, Diana, wasn't in the hold or at the helm.",
    "I am Bernard. I was standing nowhere, thinking about nothing. I saw nothing."
  ],
  "Diana": [
    "The person thinking about lunch wasn't in the hold. The person in the hold saw the pest.",
    "I am Diana. I was standing nowhere, thinking about nothing. I saw nothing."
  ],
  "Commodore": [
    "The person on deck was thinking about fighting and she saw a seagull fly by. The person who saw clouds was at the helm.",
    "I am the Commodore. I was standing nowhere, thinking about nothing. I saw nothing."
  ],
  "Mysterious figure": [
    "Die! Die!",
    "Your turn, girl. Good night, little knight..."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Quiet_Before_the_Swarm?oldid=35818457’"
  ]
}