{
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "Missing several one-off options at the beginning of the quest. Marked with Transcript missing.You can discuss this issue on the talk page or edit this page to improve it."
  ],
  "Trufitus": [
    "My greatest respects Bwana. I have communed with my gods and the future looks good for my people. We are happy now that the gods are not angry with us. With some blessings we will be safe here. You should deliver the good news to Bwana Timfraku, Chief of Tai Bwo Wannai. He lives in a raised hut not far from here."
  ],
  "Timfraku": [
    "I am the Chief of Tai Bwo Wannai Village! Who dares set foot in my hut?",
    "Well then NoBody[sic], you would do better to go elsewhere.",
    "This place has been cursed. Our people have angered the gods and fled the village.",
    "You ask too many questions! Now begone!",
    "Trufitus Shakaya? What news does he send?",
    "Bwana, do you speak the truth?",
    "Then it must be true.",
    "I cannot thank you enough for what you have done so far.",
    "No, Bwana, you deserve much more.",
    "I now ask you to do one last thing for our village.",
    "I ask you to deliver the good news to my three sons Tamayu, Tinsay & Tiadeche, and then return them to the village.",
    "Very well. Return when you are ready.",
    "Thank you very much. I shall reward you greatly if you succeed.",
    "We shall see, Bwana.",
    "Welcome back, [Adventurer/Explorer/Wayfarer/Nobody].",
    "My first son is Tamayu. After him was born Tinsay. And after him was born Tiadeche.",
    "Tamayu was a natural born hunter. He killed his first monkey at the age of three!",
    "Tinsay was brought up to be a priest. Be careful with him – he has acted strange since the accident.",
    "It involved Jogres. We don't talk about it.",
    "Tiadeche always wanted to hunt fish. However, he has not had much success.",
    "He needs to improve his technique – but he does not heed my advice.",
    "On our island of Karamja. They will not have fled far.",
    "Patience, Bwana, patience.",
    "And good conversation skills.",
    "My sons have returned to the village!",
    "[Adventurer/Explorer/Wayfarer/Nobody], please accept my eternal gratitude!",
    "Very well. I would still have you accept my reward.",
    "Of course. That is in your nature.",
    "Of course. I sometimes wonder if they know they have issues. Anyway, please accept also my reward.",
    "Very good. The spirits of my family will watch over you. And now, I would that[sic] you also accept a small token of my appreciation.",
    "You should go and see my sons in their huts in the village. I think they have something for you."
  ],
  "Player": [
    "Who me? Oh I'm just a nobody.",
    "Why should I leave?",
    "Where have your people fled to?",
    "Trufitus sent me.",
    "Trufitus has communed with the gods. Your village was never cursed and your people are free to return.",
    "Yes, I helped Trufitus gather ingredients for a commune potion.",
    "Your gratitude is all I deserve.",
    "And what is that?",
    "No, I've had quite enough of the jungle already.",
    "Ok, I'll do it.",
    "If I succeed? How hard can it be?",
    "Well, some gold would be nice.",
    "Can you tell me more about your sons?",
    "Can you tell me more about Tamayu?",
    "Can you tell me more about Tinsay?",
    "What accident?",
    "Can you tell me more about Tiadeche?",
    "How come?",
    "Where can I find your sons?",
    "Is there anything I need?",
    "I'll be back later.",
    "Tamayu, first son of Timfraku!",
    "Tamayu, I bring good news. Trufitus has communed with the gods – your village is once again safe. Your father requests that you return to the village.",
    "You could slay it after we return to the village.",
    "Tell me more of the Shaikahan?",
    "How long have you been hunting the Shaikahan?",
    "When will you succeed?",
    "Lead the way.",
    "Take me on your next hunt for the Shaikahan.",
    "I could slay the Shaikahan for you.",
    "Tamayu, try using this weapon.",
    "Yes, you can keep it forever.",
    "No, I can't spare that.",
    "I've noticed you commenting on the Shaikahan's agility. Try using this.",
    "Tamayu, I have brought you more agility boosting nourishment.",
    "Worry not – I am your witness. Shall we return to the village now?",
    "Your brother Tiadeche has sent me. He asks you to study this vessel and produce crafting instructions.",
    "Tinsay, I bring good news. Trufitus has communed with the gods – your village is once again safe.",
    "Your father requests that you return to the village.",
    "Where is the tribal statue?",
    "But that's in the village!",
    "So what are you doing here?",
    "And I don't suppose you want me to fetch them for you?",
    "You mean you were just sitting here waiting for people to bring you things you need?",
    "And you don't see anything wrong with that?",
    "Right ... what do you need?",
    "I see. And you're going to use this to repair the statue?",
    "... I'll be back later.",
    "Yes.",
    "Well, I have this.",
    "Yes, I have it right here.",
    "What? I thought you needed that for tribal statue repair!",
    "Can we return to the village now?",
    "What is it?",
    "Is this really necessary?",
    "I'll be back later.",
    "No, I'm still looking.",
    "How do I find Karamjan rum?",
    "How do I find bananas?",
    "How do I convince you to return to the village?",
    "Just how insane are you?",
    "I've heard something about an accident.",
    "I'll be back later.",
    "Yes.",
    "Yes, I have it right here.",
    "Erm ... I think I lost it in the wash.",
    "Well, I have this.",
    "Yes, I have it right here.",
    "Can we go now?",
    "...",
    "...",
    "Say something!",
    "Does that mean you're not coming or not saying anything?",
    "Why?",
    "Jogre bones? Why do you keep-",
    "... burnt Jogre bones?? How am I-",
    "Marinated???",
    "...",
    "You're just going to eat it, aren't you?",
    "I'll be back ... eventually.",
    "No, I'm still looking.",
    "How do I find seaweed?",
    "How do I skin a monkey?",
    "I'm serious!",
    "How do I stuff a monkey with seaweed?",
    "I'll be back later.",
    "Yes, I have it right here.",
    "I assume you're now able to repair the statue...",
    "Will you return to the village now?",
    "I insist – and so does your father.",
    "Why?",
    "No, I'm still looking.",
    "How do I burn Jogre bones?",
    "How do I marinate something?",
    "How do I find Karambwanji?",
    "How do I end this silly quest?",
    "I'll be back later.",
    "Are you Tiadeche?",
    "Tiadeche, I bring good news. Trufitus has communed with the gods – your village is once again safe.",
    "Your father requests that you return to the village.",
    "What is a Karambwan?",
    "When will you be finished?",
    "We don't have forever.",
    "Is there anything I can do to help?",
    "What would you have me do?",
    "How are you fishing for the Karambwan?",
    "And ... ?",
    "I wasn't going anywhere...",
    "What's a whippersnapper?",
    "Who are you?",
    "What's a Karambwan?",
    "You did. I came back.",
    "Who are you?",
    "Who is Kedoaba?",
    "Who is Kedenda?",
    "Who is Ibeli?",
    "Do you have any children?",
    "You could tell me the secret...",
    "Where are you from?",
    "So you didn't have many friends then?",
    "And ... ?[sic]",
    "What do you do?",
    "I could help collect the bait.",
    "You sound like you could do with the help.",
    "Ok. Where can I find the bait? I don't even know what it is!",
    "I understand.",
    "Where is the Holy Lake?",
    "And what do I use to fish for the bait?",
    "You sound like you need help.",
    "I enjoy collecting meaningless items for people.",
    "You're right, I don't want to help.",
    "What is a Karambwan?",
    "What do you do with your Karambwan?",
    "Where is the Shrimp and Parrot?",
    "What do you use for bait?",
    "What does Karambwan taste like?",
    "What do you mean?",
    "I have come for your soul.",
    "I'm with the Fishing Guild Anti-Monopoly Department.",
    "We demand that you hand over the secret of the Karambwan.",
    "Oh, ok then. It was worth a try.",
    "Do you have any spare monkey skin lying around?",
    "Why's that? Do you have any?",
    "I've heard something about an accident.",
    "I'll be back later.",
    "Yes, I have some here.",
    "What is a Karambwan?",
    "What do you do with your Karambwan?",
    "That's a slight change in attitude...",
    "Yes!",
    "But what kind of equipment do you use?",
    "Yes, I understand.",
    "What do you use to catch Karambwan?",
    "No.",
    "Tiadeche, instead of using your net, try using this vessel.",
    "It has been specially constructed to catch Karambwan. Once they enter it, they cannot return..",
    "Also, it has been loaded with Karambwanji. The Karambwan will not be able to resist this bait.",
    "Your father would be proud.",
    "Speaking of your father, can we make way to the village? He awaits your return.",
    "...",
    "And that is?",
    "Can I have the vessel back then?",
    "I ... never mind.",
    "I have no need for it, Tiadeche. We must return to the village now.",
    "I'm fine thanks.",
    "I've been catching a whole load of Karambwan!",
    "Actually, I've lost my Karambwan vessel.",
    "Don't worry – nobody will find it...",
    "... a shark ate it!",
    "Thank you so much.",
    "... a Karambwan stole it!",
    "... it floated away!",
    "Awful!",
    "Everybody keeps asking me to run around and do their errands!",
    "Your brother Tiadeche has sent me. He asks you to study this vessel and produce crafting instructions.",
    "No, not yet.",
    "Yes, I have.",
    "Yes. He gave me this.",
    "Will you return to the village now?",
    "I am glad to hear this. Let us go.",
    "Oh it was nothing really.",
    "Of course.",
    "I'd rather have some gold please.",
    "You know your sons have serious issues...",
    "Eternal gratitude accepted.",
    "I no longer feel a stranger here.",
    "Thanks.",
    "Hello, Tamayu, first son of Timfraku.",
    "I'm just passing through.",
    "Yes.",
    "No.",
    "I'm glad to hear it.",
    "Such as?",
    "Thanks.",
    "Ok...",
    "Hello, Tinsay.",
    "Just passing through.",
    "So I see.",
    "Yes. It's how I, or rather Tamayu, killed the Shaikahan.",
    "Thanks.",
    "Hello, Tiadeche.",
    "Yes.",
    "No."
  ],
  "Tamayu": [
    "What do you want, stranger?",
    "Then know this, stranger.",
    "I vow upon the blood of my fallen kin that I shall not set foot in that godforsaken village till I have slain the Shaikahan.",
    "No! Your pitiful whining tires me. Now let me prepare.",
    "It stands a full man's length in height. Its fore claws are sharp enough to rip through metal. In its eyes glow the embers of death.",
    "A source of indescribable evil. A beast more foul than your dreams could imagine. It hunts the jungle for anything foolish enough to cross its path.",
    "Since before I was born, stranger. It is my destiny.",
    "When the gods bless me with success. You may join me on my next hunt, but you may not take part.",
    "I simply cannot match the Shaikahan's agility!",
    "I cannot do enough damage with this spear...",
    "...and it seems to be healing too quickly!",
    "Shaikhan[sic] is at present far too agile for me!",
    "I simply cannot match the Shaikahan's agility!",
    "I can do enough damage...",
    "... and it does seem extremely sick!",
    "I am beginning to match Shaikahan's agility!",
    "I can do enough damage...",
    "... and it does seem extremely sick!",
    "Very well, but you must not interfere.",
    "You offer to kill the beast for me? Stop this nonsense, lest I kill you first. It is I who must avenge the death of my kin.",
    "You would give me this spear forever as a gift, Bwana? I will gladly accept it, but I shall not return it to you afterwards.",
    "Thank you Bwana. Now I must prepare for my next hunt.",
    "Then do not tantalise me with that which you do not wish to offer!",
    "Thank you Bwana. Now I must prepare for my next hunt.",
    "Thank you Bwana. Now I must prepare for my next hunt.",
    "I feel much more agile, but I am not sure whether I can match the Shaikahan...",
    "I feel agile enough to finally match the Shaikahan!",
    "The end approaches, Shaikahan!",
    "Gods! Witness this triumph!",
    "I did it! I, Tamayu, first son of Timfraku, did slay the Shaikahan! The deaths of my kin have been avenged. You are my witness.",
    "Yes. Go on ahead without me. I have further matters to attend to here. I will meet you in the village once you have helped my brothers and spoken to my father.",
    "I'm not going to skin that! In the jungle, we help only those who help us.",
    "Let me guess – you want me to skin that monkey. Very well: I shall, since you have assisted me.",
    "Welcome back to Tai Bwo Wannai, stranger.",
    "And neither do we, thanks to you. My father has requested I give you something of value.",
    "I have not much of worth to give, apart from my fighting technique.",
    "There is one thing I can give. My family have honoured me with this spear. But the honour is truly yours.",
    "Take care, Bwana.",
    "Stranger, why you have returned?",
    "Using your new found poison I have been creating spears. Would you like to buy some?",
    "As you wish, stranger."
  ],
  "Tinsay": [
    "You first help me, then I'll help you.",
    "Braaar! Tinsay's the name!",
    "I will return only once I have repaired the tribal statue. Bones!!",
    "Just near my father's hut.",
    "I know.",
    "I'm ... er ... collecting materials to repair the statue with.",
    "Good idea! Yes!",
    "Yes...",
    "No...",
    "Hmm ... I think I need banana in Karamjan rum.",
    "But of course! Bwahaha!",
    "Have you found my banana in Karamjan rum yet?",
    "I can't use this – there is a banana blocking the bottle!",
    "Find some way of actually getting the banana inside the bottle.",
    "Yes ... that's it! Hits just the spot!",
    "I did!",
    "Not yet. I need one more thing...",
    "I'm thinking...",
    "Seaweed ... Yes – a seaweed sandwich will do the trick. Aha! A seaweed in monkey skin sandwich!",
    "Yes. Essential.",
    "It's available in any respectable drinking establishment.",
    "They grow everywhere!",
    "Oblige me by fetching my drink.",
    "On a scale of 1 to [loopy/mad/bonkers/kooky/crackers/nuts/loony/demented/crazy/dotty/daft/barmy/harebrained] ,[sic] I'm about [1-9].",
    "Maurhah!! Jooooogre bones! Ahem. Sorry. We don't usually talk about it.",
    "Have you found my seaweed in monkey skin sandwich yet?",
    "Well, hand it here then.",
    "I can't use this – there is far too much monkey flesh in it. Try to find some way of removing the monkey flesh.",
    "Yes ... perfect! You really do not understand how necessary that was.",
    "Erm...",
    "...",
    "...",
    "No!",
    "I'm not coming.",
    "I need one more thing... I need ... Jogre bones ...",
    "Yes ... burnt Jogre bones.",
    "Indeed. Burnt Jogre bones marinated in... Marinated in...",
    "Marinated in Karambwanji!",
    "Mmm ... Yes ... That will be good ...",
    "No! Burnt Jogre bones marinated in Karambwanji are in fact essential in the trade of tribal statue repair!",
    "Try weeding the sea!",
    "Look for the zip.",
    "Well find somebody who knows how, I certainly don't.",
    "You ask a monkey.",
    "Have you found my burnt Jogre bones marinated in Karambwanji yet?",
    "That was awful! The Jogre bones were not nearly burnt enough.",
    "And the Jogre bones were hardly even marinated!",
    "You'll have to make it again. Remember to burn the Jogre bones!",
    "That was awful! The Jogre bones were hardly even marinated!",
    "You need to make it again. Remember to marinate the Jogre bones!",
    "That was awful! The Jogre bones were hardly even marinated!",
    "You'll have to make it again. Remember to marinate the Jogre bones!",
    "Finally! A near lifetime of craving satisfied!",
    "Perfectly able, my friend, thanks to your ministrations!",
    "Must I ... ?",
    "He will not be pleased with me...",
    "It's complicated – we don't really talk about it.",
    "Very well. I will meet you in the village once you have helped my brothers and spoken to my father.",
    "You must either be very skilled or find a way to make them super hot.",
    "You cook it in a sauce, obviously.",
    "They're fish. Do I look like a fisherman?",
    "Patience, Bwana, patience.",
    "You first help me, then I'll help you.",
    "Very well – hand it over.",
    "I hope that's what he wanted.",
    "Braaar! Your meals are truly excellent, Bwana ...",
    "... but there are some areas which could use some ... improvement.",
    "Let me show you.",
    "Oh, and before you go: I finally got around to repairing that statue. You might want to take a look. ... Jogre bones!",
    "Why hello there! What are you doing back here?"
  ],
  "Tiadeche": [
    "I am.",
    "I will return only when I have caught a Karambwan.",
    "You don't know? The Karambwan is a species of octopus native to these waters.",
    "They have a monopoly on its sale in the pirate town of Brimhaven.",
    "At this rate, it could take forever.",
    "Sometimes, oblivion is all I crave...",
    "I just don't know. You can try.",
    "Something ... helpful?",
    "I'm trying to catch them with a net as they swim by.",
    "They keep fighting loose of the twining.",
    "What is it?",
    "As you say, Bwana.",
    "This vessel is useless! The Karambwan are not even interested in entering it!",
    "Bwana! I cannot believe my eyes! I, Tiadeche, who would never amount to anything, have managed to trap a Karambwan! Let me offer to you my first catch as a sign of gratitude.",
    "Hmph ... my father would not care.",
    "I cannot return just yet. We witness the change of a turning tide. The secrets of the Karambwan are to be unlocked!",
    "Before I return, I must ask you to do one thing.",
    "Take a Karambwan vessel to my brother Tinsay. He is the academic amongst us. Tell him I have asked him to study it so that we may craft more of its type.",
    "I need this to practice with. Why don't you craft another one?",
    "Have you taken the Karambwan vessel to Tinsay?",
    "Please hurry! Time is of the essence!",
    "Did you ask for crafting instructions as I said?",
    "Thank you so much. You cannot understand what all of this means to me and our people.",
    "Yes, I will do as I promised.",
    "Not yet. I will stay here a while to catch more Karambwan.",
    "I will meet you in the village once you have helped my brothers and spoken to my father.",
    "Hello, Bwana! We three have finally returned to the village!",
    "I wish to reward you in return for helping me.",
    "I have been attempting to cook the Karambwan. As we all know, they are poisonous if not cooked properly.",
    "Indeed. I have determined precisely how long to cook them for so that they are edible.",
    "Thanks to you, Lubufu's Karambwan monopoly is over. If you ever need some, then come to me and not the store in Brimhaven.",
    "Hello, Bwana! Would you like to buy some Karambwan?",
    "Very well. Let me know if you change your mind."
  ],
  "Lubufu": [
    "Watch where you're going, young whippersnapper!",
    "Well then go away from here!",
    "It's a whip. Which snaps. Like me. Now leave!",
    "I am Lubufu – the only fisherman who knows the secret of the Karambwan!",
    "What a foolish question! Now leave!",
    "You again! I thought I told you to go away!",
    "So I see. What would a fool like you want with me?",
    "I am Lubufu, son of Kedoaba, brother of Kedenda and second cousin twice removed of Ibeli!",
    "Kedoaba is my father, the father of Kedenda and second uncle twice removed of Ibeli!",
    "Kedenda is the son of my father, my brother and second cousin twice removed of Ibeli!",
    "Ibeli is the second nephew twice removed of my father, and the second cousin twice removed of myself and my brother!",
    "Alas, no. Focussed[sic] and determined in my trade as I was, I never found a suitable wife. It is a great shame that the secret of the Karambwan has to die with me.",
    "Hah! What a stupid thought! The secret is mine and mine alone!",
    "Our island of Karamja. Long ago, before you were even a thought in the back of a mind, I used to play on these beaches with the pebbles and stones.",
    "Silence! As I grew older the ways of the world became apparent to me, and my attention turned from the rocks of the land to the fish in the sea.",
    "Despite what you might hear, there are plenty of fish in the sea! Especially when they can only be caught by me!",
    "Nowadays I mostly fish for Karambwan and collect their bait. Collecting the bait has become increasingly tiresome, what with my age and health.",
    "An order of magnitude older than you! What an impudent question! Collecting bait has become hard enough at this age as it is without having to endure the chiding of you young people!",
    "Hmm ... nobody I can recall right now.",
    "And why would you help me?",
    "Well perhaps you're right. It's nigh time I could do with some help after all.",
    "I have a fair amount of bait left over since last time I collected some, but I will be needing more shortly.",
    "Patience. I have kept the nature of the Karambwan a closely guarded secret. There is nobody alive who knows more about them than I do. Furthermore, there is nobody alive who even knows how they feed.",
    "You must therefore understand that what I am about to tell you is given in complete trust, and that you are to tell nobody else.",
    "Very well. The Karambwan are a form of octopus native to our island of Karamja. They feed solely on Karambwanji, a brightly coloured fish which also inhabits the coastal waters surrounding the island.",
    "Karambwanji congregate in coastal shoals near the Holy Lake. You will find it easiest to fish for them there.",
    "Just to the south of Tai Bwo Wannai Village. I'm sure you've met the locals already.",
    "Any small net will do. Return here as soon as you have caught 20 Karambwanji.",
    "How dare you say such a thing! Be off with you!",
    "Meaningless? You know nothing of the Karambwan! Now leave!",
    "I didn't for one moment think you did.",
    "A species of octopus native to the island which I and I alone know how to catch.",
    "I eat what I need and sell the rest to the Shrimp and Parrot restaurant.",
    "You don't know anything do you? Just north of here. In Brimhaven!",
    "That is part of the secret! Why would I tell you?",
    "That depends entirely on how it is cooked...",
    "Novicely cooked Karambwan is often poisonous to large mammals such as humans. If you buy some and cook it, be careful.",
    "Well you've wasted your time. My soul is long gone, along with my compassion.",
    "And I'm from the island Karamja. What do you want?",
    "Erm ... no.",
    "Funny you should say that...",
    "Well, people have been asking me for monkey skins all day!",
    "But no, I'm out of monkey skin.",
    "You will want to ask one of the warriors wandering in the jungle. I don't usually talk about it.",
    "Don't hurry back!",
    "Have you retrieved the Karambwanji yet?",
    "Thank you! This should tide me over for the next month.",
    "A species of octopus native to the island which I and I alone know how to catch.",
    "You should really ought to know that by now.",
    "I eat what I need and sell the rest to the Shrimp and Parrot restaurant. Before you ask, the Shrimp and Parrot is just north of here, in Brimhaven.",
    "My, you're keen aren't you?",
    "How would you feel about becoming my apprentice?",
    "As much as I need to protect the secret, I should not carry it to the grave.",
    "You seem a trustworthy type of person. Do you want to train as my apprentice?",
    "I'm glad to hear it. I'm sure the secrets of the Karambwan will be safe with you.",
    "In our language, Karambwan literally means 'Friend of Karamja.' As a friend of mine I will now show you how to fish for them. There are two aspects to fishing for Karambwan. Firstly, you must have the correct bait. Secondly, you must have the correct equipment. You already know of the Karambwanji, which shoal in the Holy Lake to the south. As I have explained, the Karambwan feed only on the Karambwanji, which are therefore the perfect bait.",
    "It is futile to attempt to catch Karambwan with something as basic as a net. They are too strong and vicious to be caught in such a fashion. I have spent many years designing a specially shaped vessel, into which Karambwan may pass but from which they may not return. If this vessel is loaded with Karambwanji, and then repeatedly lowered into a Karambwan shoal, then you should shortly find a Karambwan octopus trapped inside. I will now give you a Karambwan fishing vessel with which you can practise. Make sure you do not lose it. Under no circumstance may you give or show this to anybody. Do you understand?",
    "Feel free to practise on my fishing spot.",
    "Well ... since you ask, a specially constructed octopus pot. But don't tell anybody – that's part of the secret!",
    "Ah ... you again. Have you changed your mind yet? Do you want to train as my apprentice?",
    "Well the offer remains open. You're the most trustworthy lass I have met in a long time. Let me know if you change your mind.",
    "How fares my apprentice?",
    "And I'm glad to hear it!",
    "Look at you – outgrowing your boots already!",
    "You did what!? I hope nobody else has seen it...",
    "Well you'd better hope for your sake that this shark is never caught!",
    "In the meantime, you can practice with this.",
    "Don't mention it. I mean that.",
    "Well you'd better hope for your sake that this Karambwan is never caught!",
    "Well you'd better hope for your sake that it never floats back!",
    "Why?",
    "Living the hard life of a fisherman now, eh."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Tai_Bwo_Wannai_Trio?oldid=36117522’"
  ]
}