{
  "Player": [
    "Hello, there.",
    "Woah, hold your unicorns! Help who?",
    "I can't say I do.",
    "Really?",
    "But wait, how is this related to who I have to help?",
    "You're starting to confuse me.",
    "Perhaps you should take a deep breath and start from the beginning.",
    "Conditions?",
    "So, the phoenix has returned to its roost and you came to watch it be reborn. I fail to see the problem.",
    "A tragic tale, but what can I do about it?",
    "If you know the ritual, why can't you venture forth and help the phoenix yourself?",
    "...",
    "No, I have other things to do.",
    "Yes, I will help.",
    "You can call me Player.",
    "Could you tell me about the phoenix?",
    "Thanks for the information. Now, back to my other questions.",
    "Could you tell me about the phoenix's rebirth ritual?",
    "Oh, I see. I need to search the four corners of the world for five trees. Well, I suppose I'd best get packing-",
    "How so?",
    "That's amazing. What a foresighted creature the phoenix is!",
    "Oh? What would those be then?",
    "Yes, please give me the tools I need.",
    "Thank you!",
    "Now, back to my other questions.",
    "No thank you, I will gather the tools myself.",
    "Now, back to my other questions.",
    "Could you tell me about the phoenix's lair?",
    "Thanks for the information. Now, back to my other questions.",
    "That's all the information I need for now.",
    "I'll try my best. I'll be back soon.",
    "I'm a little unsure on what I have to do next. Could I ask you some questions?",
    "H...hello?",
    "Oh, it was nothing, really.",
    "Well, actually, it was an arduous trek through a confusing and inhospitably hot cave, coupled with a rather difficult Crafting task. And I burned my fingers lighting the pyre.",
    "I can use them to make a Summoning pouch, in other words.",
    "Huh?",
    "Forgive me, but I fail to see the advantage this presents you. Why would you offer me this as a reward?",
    "I see; and in return for my friendship, I gain yours.",
    "I understand. The priest will want to know you're alright, anyway.",
    "There is a priest who has been studying you unseen for quite some time. If it was not for him, I would not have known the ritual and would have been powerless to help you.",
    "I'll do that for you. Rest well; I'm sure you'll be seeing me soon.",
    "Farewell!",
    "Ooh. I like the sound of a reward.",
    "Yes, I have!",
    "Yes, I'm glad you watched all my hard work from a comfortable vantage point outside of the lair.",
    "I suppose you're right.",
    "Oh, that reminds me – she also said to thank you for the shrine, and asks when you plan to return her trinkets."
  ],
  "Priest of Guthix": [
    "Please, adventurer, I beg you. You must help her!",
    "I...I'm sorry. My emotions have run away with me. Allow me to explain.",
    "This cave is a place of great significance. Do you know why?",
    "It is the roost of the legendary firebird, the phoenix!",
    "It is related because it is the phoenix that is in need of your assistance.",
    "Okay...*sigh*",
    "I have been studying the phoenix for some time now, out of curiosity and admiration.",
    "While not truly immortal, the phoenix has the capacity to live forever if certain...conditions...are met.",
    "The phoenix has a natural lifespan of 500 years. There is a set ritual it must go through when its life is ending, in order for it to be reborn and live for another five centuries.",
    "The end of the phoenix's current lifespan is nigh and it has returned to its roost to complete this ritual. I came here to witness this once in a lifetime event.",
    "The phoenix was gravely wounded on its way back to its roost. It barely managed to reach its lair.",
    "It now rests there, slowly slipping from this world and soon it will be gone forever, incapable of completing its rebirth ritual owing to its wounds.",
    "I know the ritual that must be completed. To save the phoenix, you must go into the cave and perform it.",
    "Completing the ritual before the phoenix takes its last breath will ensure its revival, and continue the potentially eternal life of this magnificent beast.",
    "Because I am an old man whose mind and fingers lack the necessary skill to complete the ritual...",
    "...and whose body lacks the necessary heat-resistance.",
    "The task I ask of you will not take long, and you will be well rewarded for your efforts. Will you please complete the phoenix's ritual?",
    "Well, I can't force you. If you change your mind, hurry back. The phoenix's life could fade at any moment.",
    "You'll help? Oh, praise be to Guthix! I knew I could trust you from the moment I saw you.",
    "What is your name, adventurer?",
    "Well, Player, it's nice to meet you. No doubt you have questions about the task at hand.",
    "What would you like to ask about?",
    "The phoenix is an ancient creature - older than either of us can comprehend.",
    "It is a large, powerful avian creature, surrounded by flames and covered in a fiery plumage. It also has strong magical abilities.",
    "Every five hundred years, as it reaches the limits of its lifespan, it returns to its roost to complete a ritual and be reborn.",
    "You see, while not truly immortal, the phoenix can be reborn any number of times, so long as it completes its rebirth ritual.",
    "But, thanks to its wounds, the phoenix could soon be gone from this world forever.",
    "The ritual is not that complicated, really; it just requires certain ingredients and a set of dexterous hands.",
    "In order to be reborn, the phoenix must be burnt alive on a funeral pyre woven from the wood of five particular trees.",
    "You must weave a basket from the fletched twigs of cinnamon, sassafras, ailanthus, cedar and mastic trees.",
    "This basket must be placed on the base of the pyre in the phoenix's roost, and then it must be lit.",
    "Usually, you would also need to best the phoenix in combat to weaken it, so that it can succumb to the flames.",
    "This time, however, the phoenix is already weak and dying.",
    "The phoenix will enter the pyre and be burnt to ashes. From these ashes, it will be reborn – young and strong again.",
    "While I understand your concern, that won't be a problem at all.",
    "As I have said, the phoenix is an ancient creature with some limited power over life and death.",
    "The trees you require are growing inside its very lair, and have been for millenia[sic]! The phoenix revives them from their own ashes each time they die.",
    "There are specimens of each tree growing inside the phoenix's lair, tended to by the phoenix's thralls in its absence and revived from the trees[sic] ashes whenever they die.",
    "Each tree is on a separate level of the lair. You must collect the twigs before moving on. It's pointless to continue on to a deeper level without having the twigs from all the levels before it.",
    "Only fresh twigs will suffice for the ritual. If you leave the lair at any time, you will have to go through and collect fresh twigs from every tree.",
    "There are some other items required for the ritual that you cannot get from inside the lair.",
    "Tools. Secateurs, to prune the trees and gather the twigs, a knife to fletch them and a tinderbox to light the pyre.",
    "Given the circumstances, I'd be happy to give you the necessary tools for free. I brought a set to complete the ritual myself, but...I'm too old.",
    "I see you already have some secateurs.",
    "I see you already have a knife.",
    "I see you already have a tinderbox.",
    "You should now have all the tools you need for the ritual.",
    "The phoenix's lair is a lava-filled cave, guarded by its thralls.",
    "You see, the phoenix has power over life and death that is not limited to itself. It has the ability to resurrect lesser creatures.",
    "These revived creatures now roam the phoenix's lair, guarding it from interlopers during the phoenix's long absences.",
    "They usually attack anyone who enters, weeding out the weaklings to ensure only the worthy reach the phoenix in its roost, deep inside the lair.",
    "I have had a peek inside, however, and the creatures seem unusually passive at the moment.",
    "Standing out here, I occasionally hear them cry out, as if in pain.",
    "Please, help the phoenix. Such a wondrous creature should not be taken from this world in this way.",
    "You've returned!",
    "Player! How is your quest to save the phoenix progressing?",
    "There you are, my friend! Come here so I can reward you for all your hard work.",
    "Player! I saw everything through a small vent in the roof of the phoenix's roost! You have succeeded!",
    "The phoenix is saved and you, Player, are a hero of nature! As an added bonus, I got to see it. My 50 years of waiting were not in vain after all!",
    "Come now, Player. It wasn't like that. I'm a frail old man! What possible good could I have done?",
    "Besides, the most important point is that the phoenix is saved!",
    "She...she knew about me?",
    "I should have known. Had I not been welcome in the lair, I would have ended up like the rest of them. I was a fool to think it was my skill that kept me alive.",
    "Anyway, Player, I wouldn't expect you to help for mere thanks. Here is your reward!"
  ],
  "Phoenix": [
    "(Hello, human. So, it is you whom I owe a great deal of thanks.)",
    "(Ah, such modesty. In that case, I shall withhold the reward I planned for you, and send you away with my thanks.)",
    "(Heh heh heh! Well, say what you mean in the future, not what makes you sound best, lest you really miss out on what you're due!)",
    "(In all seriousness, I would not have you walk out of here with merely my thanks.)",
    "(Those feathers are, as you plainly saw, a part of me.)",
    "(When combined with other ingredients and energies, they can be used to summon me to your location temporarily.)",
    "(Correct. So, you have learned the ways of the summoner already. How fortunate!)",
    "(Now, on to the second part of your reward. I grant you the right to challenge me.)",
    "(Once a day, you may enter my lair, brave your way through it and challenge me in combat, starting from now.)",
    "(If you defeat me, I will give you five more quills, plucked from me, by me.)",
    "(You, my friend, will be completing my rebirth ritual. Each time you defeat me, my life will extend further.)",
    "(My recent near-death has somewhat shaken me. I wish to stay in my lair for a while.)",
    "(I need to keep at least one friend close at all times to ensure my continued existence.)",
    "(You must be an accomplished Slayer before you can challenge me, though. Our arrangement is no good to either of us if you lose.)",
    "(An agreeable situation, is it not?)",
    "(Anyway, my friend, I fear I must ask you to leave me for a while. I am still quite fatigued from my ordeal, and would like some peace and quiet to rest.)",
    "(Priest? What priest?)",
    "(Oh, THAT priest. While I am aware he has been studying me, he has not done so unseen.)",
    "(Thank him for the shrine for me. Also, ask him when I can have my trinkets back. Heh heh heh!)",
    "(Farewell, Player.)"
  ],
  "Congratulations! You have completed": [
    "'In Pyre Need' - Complete this quest."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:In_Pyre_Need?oldid=36192279’"
  ]
}