{
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "Dialogue with Thorgel upon trading items for a death talismanYou can discuss this issue on the talk page or edit this page to improve it."
  ],
  "Arianwyn": [
    "How goes it [Player]?",
    "Dear Seren no. They rediscovered the Temple of Light?",
    "You must stop them, at all costs! If they harness the power secured in that temple, they will be able to start the end game before we can be ready.",
    "Whatever you can, we cannot allow that power to fall into their hands!",
    "How goes it Player?",
    "The Temple of Light was created thousands of years ago, It was built to protect an ancient altar.",
    "It is something that dates back to before we walked this land. It has certain powers over life.",
    "That would be an understatement. It is vitally important that the temple's safeguards remain intact, you must discover it and make sure the Mourners cannot get access to it.",
    "What is the latest news?",
    "So they are one step from finding it... I was hoping I would not need to ask you this, but I need your help again, we need to restore the safeguards on the Temple of Light.",
    "The Temple was created thousands of years ago, to protect an altar that dates back to a time before we walked this land. This altar has certain powers over life.",
    "You really can be quite perceptive at times. Normally it would not matter, but if the shadows are free to roam outside of the temple then the safeguards must have failed.",
    "Luckily our ways have stayed very much the same, somewhere in the temple you will find a huge crystal set in the ground, if I am right this crystal will be darkened somewhat. I need you to bring back a sample of that crystal.",
    "Yes! Just like that one... Where did you get it?",
    "Good, with this sample a good crystal chanter should be able to make a replacement. Just a second, I will summon Eluned.",
    "...",
    "Thank you for responding to my summons Eluned.",
    "Player here has an old crystal shard, we need you to make a replacement for it.",
    "Well done, hand it to Eluned and she shall take a look at it.",
    "Just a second, I will summon Eluned again. Thank you for responding to my summons again Eluned.",
    "It seems that Player here misplaced that crystal - could you make him another copy?",
    "You will need to first take the newly formed crystal to the end of the temple and place it on the old altar. This will imbue the crystal with the power it needs to safeguard the temple.",
    "It should be quite simple. Once you have powered-up the newly formed crystal, you will need to return to where you found the darkened crystal and place the new shard with the others. This should restore the safeguards.",
    "Yes that is all.",
    "This is good news indeed Player, that should stop anyone from using the altar for another thousand years.",
    "Some dwarves?!",
    "This is interesting news. We are still safe for the time being, I doubt very much if any of the death guard would ever venture into the underground pass.",
    "A great many of them died down there at one time, in a huge battle, now they fear to enter. I will send an envoy down to speak with them, and make sure the temple is secure.",
    "Well done Player, you have done well. All I can offer is this trinket, it should allow the bearer to pass the temple's front door."
  ],
  "Player": [
    "I think I got the information you're after, it seems they're searching for an ancient temple of some sort under the mountains.",
    "I don't think they've found this temple yet, but they know it's down there.",
    "What do you expect me to do about it?",
    "Right then, I'm on it. As soon as I can get a key to the excavation site.",
    "Do you have the key to the excavation site yet?",
    "That's useful I'm always losing keys.",
    "So... You mentioned a task you had for me, something to do with a temple.",
    "That's right. You said something about an altar that will give us access to some very powerful magic.",
    "So how do you want me to help?",
    "Sounds easy enough.",
    "It's never easy...",
    "Err... Nothing Sir... I'll get to it.",
    "Thanks... Err... I think.",
    "Not yet.",
    "I've lost the key to the excavation site.",
    "No, I have looked everywhere, but I can see no sign of them.",
    "Nothing other than the beasts you spoke of.",
    "I'll come to you as soon as I dig any thing up.",
    "Good, I have just been given access to the Mourners' excavation site, I can now start the search for this temple you spoke of, what can you tell me about it?",
    "What do you know about this altar?",
    "So I guess it would be bad news for the Mourners to find it?",
    "I'll do what I can",
    "I have found the entrance to the temple. I was asked to investigate when one of the dig crews went missing. I found them, massacred at the entrance to the temple, surrounded by strange shadows.",
    "Tell me about this temple.",
    "And you need me to fix it?",
    "Okay, I don't know about you but I have no idea how to fix ancient elven technology.",
    "Alright then, I'll see what I can do.",
    "Like this one?",
    "I found it on the top floor of the temple.",
    "How's that crystal coming on? Are you done with it yet?",
    "Thanks.",
    "I need another copy of that crystal for repairing the temple of light.",
    "I have the new crystal, now what am I meant to do with it?",
    "This is starting to sound hard.",
    "And that's it?",
    "Right then, I'll get to it.",
    "Funny, I was just going to ask you the same thing.",
    "Well I battled my way through hordes of shadows, whilst trying to solve a huge maze that I had to bounce a light beam around. Now your turn.",
    "You mean there's an easy way?",
    "Hang on this sounds familiar, is the name of one of your companions Klank?",
    "He's a friend of mine, he made me a great pair of gauntlets.",
    "That's right, How[sic] did you know that?",
    "Great... Wait, what for?",
    "Right I'd better get started, see you soon.",
    "I've got some of them with me.",
    "Yeah, sure.",
    "I'd rather you didn't.",
    "Do you have another copy of the list?",
    "What do you need all this stuff for?",
    "What about the Agility Arena ticket?",
    "Why didn't you ask for the prizes then?",
    "Why do you want Prifddinas' history?",
    "Current events? But it's... Oh never mind.",
    "How do you explain the dusty key?",
    "Right, why do I get the feeling I shouldn't?",
    "Blood talisman?",
    "Yeah, right, all of those are just 'supplies'.",
    "No, I'd better get looking for them.",
    "I have at last repaired the safeguards on the temple.",
    "Erm... Not quite, it seems some dwarves have broken in through the back of the temple.",
    "That's what I found when I entered the altar room, it seems that a group of dwarves have set-up an outpost in the underground pass and tunneled through to the back of the temple of light.",
    "Why's that?"
  ],
  "Head Mourner": [
    "The guard has finally returned, seems it took him so long because he had ten times as many cut as we needed.",
    "Well I have plenty now.",
    "That is right, we have been excavating for some time now, digging far under the mountains in search of an ancient temple as I said before.",
    "Indeed it will, once we find it.",
    "One of our dig teams has recently gone missing, I need you to find out what happened to them.",
    "You say that now but it seems our digging disturbed some of the beasts that dwell in the deep crevasses under the mountain. We've tried but we are unable to damage the creatures, it seems we need some sort of beast slayer to help kill them.",
    "Pardon... What was that?",
    "Here - you will need this.",
    "Good Luck![sic]",
    "Any news yet on our missing dig team?",
    "Have a new one then, if you lose it help yourself to one from my desk.",
    "Any news yet on our missing dig team?",
    "This is not good news, did you find anything else down there?",
    "I must ask you to return to the search and remember if you see anything elven-made down there you must let me know. After all that is what we are here for."
  ],
  "Eluned": [
    "Any time Arianwyn, How[sic] can I help?",
    "Alright, hand it here and I shall take a look.",
    "Hand the blackened crystal here then and I will take a look at it. I should be able to make a copy.",
    "Now, let me see... hmm, this may take a few seconds.",
    "Yes, it is ready now. Here...",
    "No problem, Arianwyn will tell you what you should do with I had better get going, see you around.",
    "Any time Arianwyn, how can I help this time?",
    "Sure...",
    "I had better get going, bye."
  ],
  "Thorgel": [
    "'Ere... How'd you get in 'ere?!",
    "Well I asked first.",
    "I came in through this hole in the back.",
    "Not easy as such. A few of the boys and me set-up an outpost at the other end of the tunnel, the outpost is in the bottom of a huge cavern deep underground and the way to get there is through caves riddled with traps.",
    "Yes, How[sic] did you know that?",
    "Wait... You must be Player.",
    "Klank told me about you, told me how you got rid of that Iban fellow. As it's you I'll make you an offer, I'll trade you a Death talisman.",
    "I just need a few things, here I'll make you a list.",
    "Hi again. How're you doing with those items we need?",
    "Great, can I take everything I need?",
    "Doesn't look like you do to me.",
    "Wait, you don't have anything. Quit wasting my time!",
    "You already have the list! Just bring them to me and I'll take them off your hands.",
    "Try not to lose it this time - we need everything on it! Just bring them to me and I'll take them off your hands.",
    "Oh, well, we don't get many deliveries down here, so it's supplies mostly...",
    "Well, you see...umm... We don't really get much chance to, er, go out or anything...and we'd like some of the prizes some day.",
    "Oh, no, that'd just be sad.",
    "Oh just some light reading, it's nice to catch up on current events occasionally.",
    "Ah... Um... I'm not sure how that got on the list... Can we have it anyway?",
    "Pretty please...with a blood talisman on top!",
    "Oops! I meant death talisman!"
  ],
  "Congratulations! You have completed": [
    "'Mourning's End Part II' - Complete this quest."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Mourning%27s_End_Part_II?oldid=36196500’"
  ]
}