{
  "Moia": [
    "So, our paths cross. As if by chance.",
    "You may not know my name but I know yours, player. I believe you are familiar with my master.",
    "You really do not know? I expected more of you. I serve the rightful god of Gielinor ...Zamorak. As his most trusted general I led his forces at the battle of Lumbridge. The defeat has been difficult to swallow, for all of us. Zamorak has found your actions most intriguing. We have need of your... unique skills.",
    "Ah yes, you pledged your allegiance to the Saradominist pigs. A most unwise choice.",
    "Indeed, those were dark days. Fortunately for you my lord is willing to overlook your misplaced loyalty, as we have need of your... unique skills.",
    "Likewise. Those were dark days, Player. Zamorak suffered a severe blow upon that wretched battlefield.",
    "We have been biding our time, carefully planning our next move. Now the time has come my friend, and we need your help.",
    "Before we go further I need to know I can trust you. I need your word. Will you help Zamorak recover from this – his darkest hour?",
    "Zamorak believes you will be instrumental in the coming days. If he believes it, so do I.",
    "That is exactly why we need you, player. Somehow your fate is bound to the events that are unfolding.",
    "Your loyalty is reassuring, player. Somehow your fate is bound to the events that are unfolding.",
    "Do not underestimate the value of your aid, Player. Somehow your fate is bound to the events that are unfolding.",
    "I came here on a reconnaissance mission in search of information - the last known whereabouts of that snake Sliske. As you might have guessed, we plan to obtain the Stone of Jas. But it is not my place to reveal the master's plans. I have something for you. A device.",
    "It will allow you to contact me remotely and can also transport you to our headquarters deep beneath Daemonheim. Use it when you are ready to speak with Zamorak. I will take my leave.",
    "Player? I'm listening.",
    "Use the teleport function on the device to come[sic] Zamorak's headquarters.",
    "You gave me purpose. I will strike where you wish as if I were the hand of your own arm.",
    "Who do you want to know about?",
    "Who do you want to know about?",
    "I believe you are familiar with the Hazeel Cult. Hazeel himself resides at their headquarters in Ardougne sewers. You can access the correct conduit through the cave to the south-west of Ardougne Zoo.",
    "I was conducting surveillance on Nomad very recently. He is something of an enigma. I tracked him to Misthalin, just north of Draynor Village, but there the trail went cold. My advice would be to search around the Draynor lodestone. I suspect we are not the only ones looking for him - he has unfinished business with Death...",
    "Khazard has travelled to the Ruins of Uzer in the Kharidian Desert in search of information about his father. The ruins are the site of a historic battle that was fought in the Third Age. I am told some legendary Zamorakians were lost that day.",
    "Lord Daquarius commands the Kinshra - or Black Knights, as they are known - from their base beneath Taverley. My scouts tell me there has been in-fighting among their forces. Your help may prove useful.",
    "Mahjarrat have the power of racial awareness, which allows them to sense others of their kind. Bilrach is particularly adept at this. He informed me that Enakhra has travelled to Zemouregal's fortress in the north. A suspicious move.",
    "Their loyalty to Zamorak has been wavering of late. Zemouregal arrogantly questions his power, but perhaps Enakhra will speak reason to him. Access to the fortress is limited; it is protected by Magical enchantments. I can, however, get you inside the basement beneath the fortress. Would you like me to teleport you?",
    "It is likely that Zemouregal's undead guards will be patrolling the area. Make sure you are prepared for combat.",
    "Player, can you hear me?",
    "You've accomplished your mission, almost everyone has made it to Daemonheim. Return when you are ready - Daquarius will follow.",
    "You've accomplished your mission, everyone has made it to Daemonheim. Return when you are ready.",
    "My lord, apologies for interrupting. Viggora has returned. I can sense him.",
    "If it would please you, my lord, I believe we should move now. Time is of the essence.",
    "Everyone head to Morytania, into the cave barely south of the Barrows. We will reconvene at the entrance to Sliske's lair within. Player, use the device to contact me if you need more information.",
    "Player.",
    "Zamorak gave me purpose. He presented to me a way of thinking that my father failed to live by. His theories resonated with me in a way I cannot quite describe. They taught me that fortitude is built in the face of adversity. That even when you are confronted with struggles on all sides, you can rise from them yet stronger than before.",
    "I serve Zamorak as his left hand. The general of his armies. The master of his spies. I have been working diligently to reassemble the Zamorakian forces after my failure at the Battle of Lumbridge. We may have fallen upon hard times, but we will rise again and strike back at the Saradominist pigs.",
    "Lucien... It pains me to hear the name. In life he made me believe I was a disappointment, but in death it is clear that the disappointment was him. He was so filled with hate. So fuelled by selfish desires. He was my father by blood alone. Zamorak is my mentor now. He has shown me the path I must walk.",
    "Player? I'm listening.",
    "Head to the Barrows in eastern Morytania. There is a cave barely south of them, nestled into the cliff face just before the fence line. Once inside, Viggora described a cave system that plays tricks on the mind. Navigate it to the entrance to Sliske's lair where we will meet.",
    "Good, we have all arrived. According to Viggora Sliske's lair lies beyond this passage.",
    "No, we stick to the plan. Zamorak has given us clear instructions.",
    "Zemouregal, we are a team. Zamorak has given us clear instructions.",
    "Stop, both of you! We are a team. Zamorak has given us clear instructions.",
    "They are more agile and experienced in thievery than everyone else here, making them our best choice.",
    "That was impressive, Player. You've cleared the path to the vault so the rest of us can move through. We should get moving. I have a feeling the vault door will not be easy to crack.",
    "Player? I'm listening.",
    "We need to focus on the heist. Getting the Stone of Jas is our only objective.",
    "If Jerrod can find the guards, then I will be able to see their memories of unlocking the door.",
    "I'm not sure we have a choice.",
    "I am not sure we have a choice.",
    "Hm, we need more information. Instruct Jerrod to find more guards so that I may read their minds.",
    "Hm, I failed to take hold of his mind. I must try again.",
    "Apparently there are magical orbs in the Shadow Realm that are connected to the door. They contain light and shadow energy which we must balance to prevent the alarm from triggering! Khazard and Hazeel can reveal the orbs. Nomad, use your spells to increase the power of one orb while Enakhra uses hers to drain the other! Player, keep an eye on the balance of light and shadow on the vault door. Inform Nomad and Enakhra when they need to switch in order to maintain the balance.",
    "Of course, Umbra!",
    "This one knew how to decrypt the rune lock on the right door! Daquarius, Umbra!",
    "Of course, Lux!",
    "This one knew the decryption for the left door! It is Lux, Daquarius!",
    "That did it! It would seem the defences shut down once the door has been unlocked. The Stone of Jas is within our grasp.",
    "We have unlocked the door. It is time to enter the vault.",
    "How could he possibly have known? We did everything right!",
    "That is quite enough of your performance, Sliske. Your time has run out.",
    "We have heard enough of your empty words. Disciples of chaos, ready yourselves!",
    "Our mission is over, Player. You may use the teleport function to return to Zamorak's Daemonheim headquarters if you wish.",
    "Player."
  ],
  "Player": [
    "Have we met?",
    "Who might that be?",
    "Unique skills? What exactly are you asking of me?",
    "I know you, you lead Zamorak's forces against us at the Battle of Lumbridge.",
    "You were crushed in open battle. How do the Zamorakians like the taste of defeat?",
    "Unique skills? What exactly are you asking of me?",
    "Moia, it was an honour to fight alongside you at the Battle of Lumbridge.",
    "How are the Zamorakian forces coping with the defeat?",
    "What would you ask of me?",
    "You have my word, Moia.",
    "So it would seem. What brought you here, anyway?",
    "A device? What does it do?",
    "My lord.",
    "Sliske.",
    "Have you been here the whole time?",
    "I mean did you hear my conversation with Moia?",
    "How did you pull me into the Shadow Realm?",
    "But you claim to be a god. I'm the World Guardian - your powers shouldn't have a direct effect on me.",
    "But they don't know where the Stone is. How will they find it?",
    "Wait... What?",
    "So you want them to find it?",
    "I guess so. You want me to play along with your games, then?",
    "I'm going to infiltrate the Zamorakians and sabotage their operation.",
    "He won't know what hit him.",
    "I'm going to go along with things and see what happens.",
    "All those years ago?",
    "I stand by the god of chaos.",
    "Zamorak is a real god, much more deserving of the Stone of Jas than a pretender like you.",
    "I'm certainly not telling you my plans!",
    "What do I need to do?",
    "It is an honour, my lord.",
    "Where are we?",
    "How do you plan to find it?",
    "What would you have me do?",
    "That's me and six others. Zamorak's Seven?",
    "Oh, okay.",
    "Where can I find Hazeel?",
    "Where can I find Nomad?",
    "Where can I find General Khazard?",
    "Where can I find Lord Daquarius?",
    "Where can I find Zemouregal and Enakhra?",
    "Don't you trust them?",
    "Why did you create it?",
    "What else is down here, through those doors?",
    "And that was?",
    "What does this have to do with your epiphany?",
    "Why did you kill him?",
    "What is Zamorak like as a leader?",
    "Oh, erm... No reason. Thought we might have met before.",
    "That's why you still have your skeletal appearance?",
    "I've been sent by Zamorak. He requests your presence at his Daemonheim headquarters.",
    "Oh, you know about the plan? He says he'll know soon enough.",
    "What do you need me to do?",
    "So you want me to go and free this dangerous werewolf?",
    "What's your name?",
    "Hazeel sent me here. He's a powerful Zamorakian who has taken an interest in you.",
    "He believes you're a werewolf. Says you'll be useful on our mission for Zamorak.",
    "Did you kill Handelmort's butler?",
    "Why did they lock you up in here?",
    "And do you?",
    "You must want to leave if you killed the butler for the key. I could grab it for you if you agree to ally with Hazeel?",
    "Yes. All you'd need to do is go and meet him in Ardougne sewers, that's where his cult is stationed.",
    "Don't underestimate me.",
    "Well, that's good news.",
    "What's going on here?",
    "What are you doing to him?",
    "I saved you from Sliske's clutches, Death. I believe you owe me a favour.",
    "Actually, I've come for Nomad.",
    "It's complicated, but it's part of a plan to take down Sliske.",
    "I came on direct orders from Zamorak himself. He requests your presence at his Daemonheim headquarters.",
    "I'm sorry for interrupting you. The plan to take down Sliske involves some shady characters, Nomad needs to be one of them.",
    "That's good to hear, I'll do my best to bring him back.",
    "I came for you.",
    "She told me you were searching for information about your father.",
    "I'm familiar with her. I read one of her memories.",
    "What leads you to believe that?",
    "So she's keeping an eye on you?",
    "Zamorak is requesting your presence at Daemonheim. Best not to keep him waiting.",
    "Can't you check there yourself?",
    "You were right, Palkeera did fight here. She didn't survive.",
    "The journal mentions your father.",
    "That was all I could find.",
    "Hello.",
    "I have been sent to summon you by Zamorak himself.",
    "I heard you may be having problems with some of your knights. Perhaps I could help?",
    "Why would they believe what Saradominists tell them?",
    "Where do I come in to all of this?",
    "What do I need to do?",
    "What are you talking about?",
    "What makes you want to do that?",
    "I've stood before Zamorak, he values Lord Daquarius. He'll smite you all for this mutiny. None of you will be spared!",
    "I've stood before Zamorak, he values Lord Daquarius. Now is the time for the Black Knights to band together and rise again!",
    "I think you've misunderstood Zamorak's philosophy. It's not a justification to inflict pain on innocent people.",
    "The things you're saying are exactly what the Saradominists want people to think about the Kinshra.",
    "You Black Knights need each other now more than ever. Use this struggle to become stronger - don't turn against one another!",
    "POW!",
    "I'm here on behalf of Zamorak. He's summoning you to his headquarters in Daemonheim.",
    "I have been sent by Zamorak to summon you both to his Daemonheim headquarters.",
    "I'm just curious.",
    "Zamorak intends to reclaim the Stone of Jas from Sliske. He wants you both to help.",
    "Not yet, but he seems to think he will soon.",
    "So you'll accept Zamorak's summons?",
    "Moia? Yes, I can hear you.",
    "What else can you tell us about the defences?",
    "I've dealt with Sliske before. I can deal with him again.",
    "I've dealt with Sliske before. Despite his demeanour, he is not to be taken lightly.",
    "We'll be in and out without raising the alarm. He won't even know we were there.",
    "Do you think Sliske is still Zarosian?",
    "Enakhra, are you in love with Zamorak?",
    "Why weren't the Mahjarrat present at the Battle of Lumbridge?",
    "How are the Kinshra doing now?",
    "Do you know Jerrod?",
    "Why did he do that?",
    "How does it feel to finally meet Zamorak?",
    "You don't seem particularly angry after I defeated you.",
    "Who was your master - the one you were gathering all those souls to defeat?",
    "Do you still have the power from all the souls you siphoned?",
    "Does that mean you've lost all your power now?",
    "What was going on between you and Death?",
    "He said you were neither living nor dead. What did he mean?",
    "What can you tell me about lycanthropy?",
    "Do you know what the Stone of Jas is?",
    "Are you from Morytania like the other werewolves?",
    "Why did you leave Morytania?",
    "You don't show much remorse.",
    "Why do you support Zamorak?",
    "How did the Carnilleans defeat you Hazeel?",
    "Do you intend to retake Ardougne?",
    "Will you take it by force?",
    "What's happened to your powers over the Shadow Realm?",
    "What about Sliske. Can you sense him?",
    "What do I need to do?",
    "Together we can progress undetected to assassinate the guards and disable any defences.",
    "We've discussed it enough. Let's go take out the guards, Jerrod.",
    "What should we do?",
    "That does make sense. Let's get to it!",
    "What do I need to do?",
    "We made it into Sliske's lair. Haven't found the Stone yet, though.",
    "Sliske...",
    "We've broken into the vault. The Stone is in the Shadow Realm!",
    "What are you doing Nomad?",
    "You don't have to do this, Nomad.",
    "You've gone madder than you already were, Nomad.",
    "I should have left you with Death. Your soul belongs in the Underworld.",
    "Look at what you're up against. Even an escape artist like you can't make it out of here with the Stone.",
    "What about me?",
    "I did only what you asked of me. The Stone of Jas remains with its rightful owner.",
    "I didn't do it for you. Zamorak had to be stopped, one way or another.",
    "But you're right here...",
    "Moia? Can you hear me?",
    "Why weren't the Mahjarrat at the Battle of Lumbridge?",
    "What happened when you assassinated Zaros?",
    "Why did you curse the chaos dwarves?",
    "Have you gained power from touching the Stone of Jas?",
    "What happened between you and Char?",
    "What are your plans for the future?",
    "Zaros has returned to Gielinor.",
    "He's alive. I was there when he returned.",
    "He chose me as one of the members of his heist team, yes.",
    "Sliske escaped with the Stone, but Zamorak was still able to draw power from it.",
    "What are you going to do now?"
  ],
  "Sliske": [
    "Ah, the 'World Guardian'. Fancy seeing you here!",
    "My lord... I like it. Lord Sliske! There is no need to kneel, though. Relomia has kept me well apprised of your allegiance.",
    "You recognised me! Yes, I suppose we're quite familiar by now. You might even say we're friends.",
    "Well, that would depend on what you mean by 'whole time'. Curious saying, wouldn't you agree?",
    "But of course! What a tantalising proposition. Such naivety to think she could come here unnoticed, though.",
    "Surely you are aware of my mastery of the Shadow Realm by now. Few know the mysteries of the shadows as well as I.",
    "Oh, how peculiar...",
    "I do not always need your permission, you know. I think we are past such courtesies.",
    "So, the cards are on the table. I know of Zamorak's plan to steal the Stone of Jas, and you know I know.",
    "Oh, don't you worry. It won't be long before they know where I've hidden the Stone, and I'll know they know... and you'll know I know they know.",
    "Hah! Did I lose you? It's only a matter of time until one of Zamorak's agents finds the Stone. When they do, I'll be waiting.",
    "My contest has slowed somewhat since Bandos's death. Sometimes a Mahjarrat must provide his own entertainment - it is time to spice things up. That's where you come in. You're a catalyst for chaos. Particularly apt in this case, don't you think?",
    "The way I see it, you have three choices... Option one: you infiltrate the group and sabotage their whole operation, lying in wait until the most deliciously dramatic moment to upstage Zamorak himself! Option two: you simply go along with the plan and see what happens. Your presence alone should have the desired effect. And then of course, there's option three. You could - I suppose - side with Zamorak, but who in their right mind would do such a thing? So what will you choose, 'World Guardian'?",
    "Haha! Most excellent, Player. Bide your time and when an opportuninty arises when Zamorak is so close he can taste victory... Make it crumble to bitter betrayal in his mouth.",
    "Marvellous. Now back to the light you go! I'll be watching. Waiting.",
    "Hm, rather boring if you ask me. You know, Zammy really is a lot of fun to deceive. Oh, now I used to play with him all those years ago...",
    "He was once a Mahjarrat, rather like me. Many millennia ago - on our home planet Freneskae - we may have called ourselves brethren. But I digress. Scurry along now, will you? I'll be watching. Waiting.",
    "Urgh. I really did have higher hopes for you. Such wasted potential. I will just have to keep an especially close eye on you from hence forth. Now, I grow tired of your presence. Get out of my shadow realm.",
    "Hahaha! How nice to finally have some visitors. Hope you like what I've done with the place. The statues are truly inspired artwork, I think. I recommend having a good look.",
    "Oh Moia, did you really think I would not notice you at the citadel? I have known every step of the way.",
    "Tut tut tut, Zemouregal. The girl was at least slightly harder to track than you were.",
    "Oh, but you hardly move from that fortress of yours. All alone up there in the mountains with no one but your gargoyles to keep you company. Poor old Zemouregal. Looks like you might have put on a few pounds too!",
    "Well I'm glad you asked! I want some new drapes, perhaps a portrait or two, a rematch between Zamorak and Saradomin-",
    "Yes I quite agree. Here is the deal: a fight to the death among yourselves, winner takes the Stone. Aaaand go!",
    "Ah-ah-ah! How rude of me, I almost forgot to introduce you.",
    "I think it's time for you to meet the other guests!",
    "Nomad, meet Nomad! Daquarius, meet Daquarius! Jerrod- well, you get the picture.",
    "If I didn't know better I'd say you were scared, Khazard.",
    "Oh but they are so much more. You will find them to be quite formidable opponents.",
    "You know art when you see it, Player. But just you wait, I still have an ace up my sleeve for you.",
    "Haha, such impatience! Just you wait, I still have an ace up my sleeve for you.",
    "Huh. Tough crowd. But do not fear! I still have an ace up my sleeve for you.",
    "Welcome to your nightmare, Player. It's time to face your inner demons!",
    "Ah, good old Zammy. It is nice to see you again too.",
    "Careful, I could disappear into the shadows with the Stone faster than you could say 'Saradomin'.",
    "Oh, come now, we have so much in common! There was a time when we stood side by side, many lifetimes ago.",
    "No? Surely you have not forgotten I was Praetorian Prefect, back in the good old days of the Zarosian Empire. Did we not work together then, Legatus?",
    "Praefectus Praetorio, technically. It was my title in Senntisten under Zaros's reign. My talents earned me the leadership of the secret police.",
    "Legatus Maximus, actually. The prestigious title assigned to none other than Zamorak himself. General of the Zarosian armies! A glorious position. Imagine Zaros's surprise when his Legatus Maximus stabbed him in the back.",
    "A fact of which I am well aware. Tell me, Zamorak - do you really think the Praetorian Prefect was not aware of your plot to overthrow Zaros?",
    "I have no reason to lie about this. The old society was oh so boring. Everyone being watched, afraid to put a foot out of line. Your development of this 'chaos' ideology was a breath of fresh air. Honourable intentions certainly, but it was the results that had me intrigued.",
    "Yes, I suppose that is where we differ. But ask yourself, do the motivations really matter when the goal is the same?",
    "Hahaha! Ally? Oh Zammy, I fear I have misled you. You know better than to think me so...unambitious. You may have reached the Stone, yes. It was truly marvellous watching your minions play my games. But to believe it is in your possession? Well...",
    "Ah yes, you can feel the energy coursing through your veins. You are addicted, just like Saradomin is, just like Lucien was. And now I am too.",
    "Can't you see? Everyone who has ever touched the Stone has sacrificed everything in order to keep it in their grasp. The energy withheld in the Stone is not from this world, and the feeling of absorbing it is incomparable. I am not so clouded by pride that I would deceive myself.",
    "Fool yourself all you like, Zamorak. I now know the truth.",
    "It would seem being the World Guardian is a double-edged sword. You may not be harmed by the gods, but you are also unable to absorb divine energy. Good old Guthix gave you a blessing - and a curse. You do seem to be quite handy at channeling the Stone's power temporarily though. Addiction may not be your downfall, no, but power so often corrupts the heart and mind.",
    "Player, I have afforded you the opportunity to influence history. Choose wisely.",
    "Hahaha! Bravo, Player. You really did leave it until the most dramatic moment to upstage poor old Zammy. Needed a little help from yours truly, of course, but impressive nonetheless.",
    "You are truly a worthy ally. I may have had my doubts but you have certainly proven yourself today.",
    "Willing or not, you have proven yourself a worthy ally today. Zamorak will certainly regret bringing you along!",
    "You have provided quite the entertaining show; a catalyst for chaos indeed. I believe you have earned yourself some rewards. (Quest end)",
    "Leave now, Player. I have much to prepare for."
  ],
  "Silske": [
    "Urgh. I really did have higher hopes of you. Such wasted potential.",
    "He was once a Mahjarrat like me, you know. Many millenia ago - on our home planet Freneskae - we may have called ourselves brethren. But I digress. I am tired of your presence. Get out of my Shadow Realm."
  ],
  "Zamorak": [
    "Welcome, Player.",
    "You may rise. I have been waiting for you.",
    "The device you possess brought you deep below Daemonheim. Few in living memory have had the honour of walking on such hallowed ground. So remote and inaccessible is this place - beneath floor after impassable floor of horrors - that we are safe to recover from recent struggles lost. We have Bilrach here to thank for its sanctuary. He has earned his place as my right hand.",
    "And I believe you have already made acquaintances with my left hand Moia. For quite some time now she has been reassembling my legions.",
    "I trust you are aware of our pursuit, Player?",
    "You would do well to choose your words more carefully. The Stone was stolen from me, and I intend to reclaim it.",
    "Very well. Many thousands of years ago the Stone of Jas belonged to me, but when Guthix banished the gods from Gielinor it was lost. As years became centuries the Stone exchanged hands many times. None were worthy of its power. It even crossed your path, when Lucien was eviscerated by the Dragonkin and you attempted to hide the Stone from all who would seek it. Despite your efforts possession of the Stone passed to another Mahjarrat. His name, as I'm sure you are aware, is Sliske. The Stone belongs to me, and I intend to reclaim it from him.",
    "Many who remain loyal to me are masters of subterfuge and deception. I have agents everywhere, even in the Shadow Realm. It will be found. That moment approaches, so we must ready ourselves. It is time we assemble the core of my legions.",
    "Your task will be to travel the breadth of Gielinor in search of my most powerful and cunning followers. A set of individuals with a devastating combination of skills... Four Mahjarrat - Zemouregal, Enakhra, Hazeel and Khazard - who have much to prove in their absence from the battle against Saradomin. Also Daquarius, who leads my Kinshra armies and upholds my true teachings of chaos. And Nomad, a powerful battlemage who has sought to overthrow traitors in my absence. They will all be tested, and some may have their loyalty called into question, but strength is found in the fires of adversity.",
    "Not quite. As my left hand, Moia will lead the party. That makes eight.",
    "So, will you accept this undertaking?",
    "You have chosen wisely, World Guardian. Speak with Moia to find out where your journey must take you.",
    "Hm. Very well. Return when you have changed your mind.",
    "Ah, our esteemed guest. Welcome back, Player.",
    "Our messenger returns.",
    "Player, what news do you bring?",
    "Good. Everyone is present. Welcome, my disciples of chaos. You have each been summoned to this conclave - and allowed within this place - because you possess skills we have need of. As I'm sure you are aware by now, you are going to reclaim the Stone of Jas for me. Each of you is being given an opportunity. A chance to prove you are worthy of a place by my side when we rebuild.",
    "Perfect timing. Khazard, I need you to open a window to the Shadow Realm so Viggora can be seen by all.",
    "I am reminded of that hallowed night on which we marched upon Zaros. It was beyond living memory that this many of us stood together. Rise, Viggora. What information do you bring?",
    "More. What more did you find?",
    "The Stone is there?",
    "You remain one of my most exalted followers, Viggora. If I could give you back your life, I would.",
    "Thank you, Viggora. That will be all.",
    "Bilrach is right. Sliske will be able to move the Stone through the Shadow Realm. He must not be alerted.",
    "SILENCE! You will do as I command.",
    "You will all go. Bilrach will stay, he is more use to me here. Player, you are the most valuable member of this operation. Your resistance to divine energy is imperative.",
    "You supported me at the Empyrean Citadel in the face of the other gods. Not only do you have my trust, but also my respect.",
    "You have a lot to make up for. You sided against me at the Empyrean Citadel and in the Battle of Lumbridge.",
    "I have not forgotten your misguided decision at the Empyrean Citadel though. You did not support me, and for that you must win back my trust.",
    "Jerrod, you possess both cunning and agility. You and Player will infiltrate the outer chambers and dispatch the guards. Daquarius, your learning and intellect will be useful when deciphering the rune locks on the vault door. Enakhra and Nomad, your mastery of magic is going to be of utmost importance when evading and overcoming Sliske's deceptions. Hazeel and Khazard, only that devious Zarosian is a better manipulator of the Shadow Realm than you. Combine your talents and overcome him. And Zemouregal, you are a necromancer even more capable than Sliske. If the time comes, show his undead hordes no mercy.",
    "Yes, precisely why you were chosen. Though if everything goes to plan the filthy Zarosion[sic] will not have time to react.",
    "Wise words, Player. You would all do well to listen to them.",
    "As is the plan, but we must be prepared for every eventuality. We cannot fail.",
    "Then it will be chaos, and you will be in your element. Embrace it and realise your true potential.",
    "Yes, the moment is here. My eye will be upon you as you embark on this quest. We have all strived for this. Do not fail me.",
    "Very well.",
    "Do not linger here, Player. The others have already begun the journey towards Morytania.",
    "Why are you back so soon? Do you bring news of the Stone of Jas?",
    "Then why are you here? Go back to Sliske's lair - time is of the essence!",
    "Why are you back so soon? Do you bring news of the Stone of Jas?",
    "WHAT? Get back there now - capture the Stone!",
    "Never! You betrayed me, Saradomin. You threw away our alliance the moment your knife could find my back!",
    "I have risen to power through my own strength and will, and now you fear me. Everywhere you spread your propaganda! Everywhere your followers whisper your lies! But more than that, you fear my words. You are wretched and weak - snivelling cravens who cower from the truth. Now chaos will be your end!",
    "Armadyl... Bandos... Hear me. Everything I have done I have done for Gielinor. I seek only to raise up the inhabitants of this world!",
    "You would only seek to rule over this world with its power, the same as Zaros before you. Stagnation and weakness is all that results.",
    "Conflict would be inevitable, of course, but the people of the world would be free. Free to fall and grow, to fail and rebuild-",
    "Surely you can see the value of my words, Bandos.",
    "Armadyl? Please...",
    "NO! You are all blind. None of you are deserving of this power. None of you! If I must meet my end, then each of you will meet yours!",
    "Wrong.",
    "Wrong.",
    "So, the serpent finally rears its ugly head.",
    "Release my followers and perhaps you will still leave here with your life.",
    "You stand before a god. Unlike you, I am no fraud. You would do well to remember it.",
    "You are nothing but a rogue. A vagabond. We are nothing alike.",
    "Do not waste my time with talk of petty titles and fussy hierarchies. They led us only to weakness and stagnation.",
    "You will not manipulate me with your lies, Sliske. I know you too well to be tricked by the deceptions you spin.",
    "Chaos is not a game where you can pull the strings. Only an imperious Zarosian would believe they could play puppet master.",
    "You are no ally of mine, spider. Crawl back to the shadows you came from, the Stone is no longer in your possession.",
    "I have already drawn power from it, regardless of your empty words. Even now my energy increases. It is about time you met your end.",
    "You speak only of your own addiction. The Stone is but a tool; a necessity if I am to liberate this world from the other gods.",
    "You have gone too far, Sliske. You are nothing but a plague that must be purged from this world.",
    "Player, the snake may have escaped, but already I feel some of my power returning. He will cower in the Shadow Realm and lick his wounds for some time. My loyal followers, you have been tested to your limits today. You have each risked your lives in my service. Those who would betray us have been weeded from our ranks. Those who would oppose us have tasted our fortitude. And as we emerge from the chaos, we grow stronger.",
    "Rise. You need not kneel before me. We still have much work to do.",
    "You have my gratitude and respect, Player. Sliske will be gravely wounded from our combined attack. You were a worthy ally to have on our side today. Here, you have more than earned these rewards. I will leave you with Moia's device so that you may visit me at Daemonheim should you wish.",
    "Player, the snake may have escaped, but already I feel some of my power returning. He will cower in the Shadow Realm and lick his wounds for some time. My loyal followers, you have been tested to your limits today. You have each risked your lives in my service. Those who would betray us have been weeded from our ranks. Those who would oppose us have tasted our fortitude. And as we emerge from the chaos, we grow stronger.",
    "Rise. You need not kneel before me. We still have much work to do.",
    "If you had channelled the Stone with me in a combined attack we may have had a chance to end Sliske's life, Player. Still, you have been a worthy ally to have on our side today. We may not have made it this far without you. Here, you have more than earned these rewards. I will leave you with Moia's device so that you may visit me at Daemonheim should you wish.",
    "What are you doing here? You should be in Sliske's lair with me!",
    "This is just a projection of my form. I am in the vault waiting for you.",
    "Ah, the traitor returns. You have a lot to answer for. Tell me, what was the reason from your betrayal?",
    "You would rather side with that conceited snake than be welcomed into my inner circle? It was certainly a mistake to have trusted you.",
    "So you are too misguided to see the growth that chaos can bring. A pity.",
    "It is a shame you cannot see the growth that chaos can bring. Nevertheless, I am glad to see you free from the influence of the other gods.",
    "Just as weak as the rest of your race. So consumed by your selfish desires for power and dominance.",
    "Did you learn nothing from your time here? Clearly you would create chaos as a force of evil.",
    "Let us get this conversation over with so that you may disappear from my sight.",
    "Ah, Player. Welcome back.",
    "They were each so engrossed in their own affairs that they failed to see the damage wrought to our faction. Some of them were busy searching for Sliske or elder artefacts. Others simply did not believe I needed their aid. Now they have redeemed themselves and proven their loyalty. We need not linger on those events.",
    "Hm. Few know the true account of what transpired that night. I alone can tell you. When I came upon Zaros, he invaded my mind. A cunning trick, but it ultimately led to his demise. In that moment I realised how to use the elder staff I was wielding. I overwhelmed the 'Empty Lord' and drove the staff through his torso. In a last fit of rage, he seized my arms and wrenched me towards him, impaling me on the staff along with him. As his life expired the staff acted as a conduit, channeling his divine energy into my body. The rush of energy healed my wounds and I rose the victor, forever changed by the battle.",
    "My military might needed bolstering. The dwarves presented an ideal opportunity to overcome this challenge. It was a difficult decision to make, of course, but in return for their unwavering devotion I gave them power beyond any they had known before. I admit things did not go entirely to plan; an unfortunate turn of events for which I am deeply remorseful.",
    "I was able to absorb a lot of power from the Stone within a short time, almost as if I was re-energising stores that already existed within me. As the World Guardian, you were only able to channel the Stone's energy temporarily, whereas I was able to fully absorb it in order to permanently increase my strength. I recall that the humans of the Second Age drafted a hierarchy containing seven tiers of godhood, from demigods to Elder Gods. In this crude quantification of power I believe I have risen a tier, regaining the power I lost to Saradomin.",
    "Char... The name tastes like ashes in my mouth. She was nothing but a Zarosian zealot, blinded by her adoration of him. She was problematic, to say the least. She could have been a fearsome ally, but she chose to remain a slave to Zaros. She attempted to trick me, believing that I could be seduced. How little she knew of the Mahjarrat... Char had to be made an example of. I left her close enough to death to make sure she could not interfere.",
    "Ha! You will know nothing of my plans, traitor.",
    "The Stone of Jas is still in Sliske's hands, so that will remain our focus. We will continue to rebuild, of course. With a solid nucleus at the heart of my armies I will be able to plot our next offensive. Vengeance is never far from my mind. Retribution will come to those that have made the mistake of crossing me.",
    "Impossible. I drove the staff through him with my own hands. Zaros is dead.",
    "This is grave news. If Zaros has truly survived he will no doubt seek out revenge. I must discover his plans.",
    "Farewell."
  ],
  "Bilrach": [
    "The certainty of your return fueled my digging for millenia[sic], my lord.",
    "What would you like to know?",
    "Daemonheim? That is what they call this place is it not? The humans that harry me, yes. This place has been my work - and my home - for thousands of years now. Many believed it to be my tomb.",
    "I excavated these dungeons because I knew. I sensed it. That in these depths the boundary between realms is at its thinnest. I tunneled towards this rift in the hope that it would allow me to bring Zamorak back to this world. Digging, building, digging... Never-ending tunnels deeper and deeper, leaving all manner of beasts and contraptions to deter my pursuers. The rift would not provide the answers alone, though. Disappointing.",
    "Soon, perhaps, you will learn more of these depths. It is quite the saga.",
    "Sanity is a fleeting concept in this underground world of stone and magic. Who is to say madness is not enlightenment? I must confess, the deeper I descended the more this place warped my mind. Rifts and portals and demons, all tearing at my thoughts.",
    "Yes, my lucidity has returned to me of late. I have regained control of my senses and... the voices have subsided. I believe it is Zamorak's presence here. His aura pervades the depths, turning them into our sanctuary.",
    "'Bonkers'? Hm, peculiar. My lucidity has actually returned to me of late. The voices have subsided... I believe it is Zamorak's presence here. His aura pervades the depths, turning them into our sanctuary.",
    "Ah, so it was felt on the surface? Perhaps that is why my brethren believed I had perished. No, no. I was not here for some time, but I lived. Moia and I joined hands and walked into the rift, together. We were torn from each other as we tumbled through the dimensions. She would eventually find Zamorak, but to my knowledge she was gone. I, on the other hand, arrived at my home planet Freneskae. There are no longer any of my kind there, but other tribes once existed. The Chelon-Mah and Mahserrat, born from the same energy as we Mahjarrat. It was then that I had an epiphany. Hmm.",
    "Ah, yes. The other tribes were also bound to rituals, needing the life force of those that perish to sustain themselves. The Mahserrat decided to forgo this process, resigning themselves to a fate without rejuvenation. But the Chelon-Mah... Hm. The Chelon-Mah did the opposite. They concluded that only the strongest should live, yes. One almighty being, commanding the power of the entire tribe. I remember it. The battle blazed across the horizon – a glorious sight to behold, indeed. For weeks they fought tirelessly, until only one remained with all their power. A brutal incarnation of the Chelon-Mah tribe; the physical embodiment of war. His might on the battlefield was unparalleled.",
    "Epiphany? Oh, yes. I knew that after thousands of years whilst the Mahjarrat have grown stronger, the Chelon-Mah would have diminished. With the Mahserrat all likely to have perished and no kin to sacrifice, he would never have been able to rejuvenate. I returned to Gielinor with the once-great Chelon-Mah captive. The strange power you speak of was triggered when I slew him upon my ritual stone.",
    "On Freneskae we were at war with the Chelon-Mah; with no kin left to test his strength he turned to the Mahjarrat. He killed many of my brethren. Taking his life was a justice long overdue. As the only Mahjarrat at the ritual stone when I slew him I was able to absorb all his power, hmm. I intended to use it to bring back Zamorak. Alas, I still did not find the answers I sought. It would seem it is exceptionally difficult for anyone but a god to open a portal between worlds.",
    "Zamorak is a revolutionary, yes. He proposed a radical way of thinking and was shunned for it. He has taught us that order leads to stagnation. Only through chaos can we change for the better. Those that seek to rule are averse to this concept. Saradomin, Zaros... Order is what allows them to dominate others. Zamorak believes in unity in the face of adversity. He is the god the people of Gielinor need - now more than ever.",
    "Predictable. No, we must plan. This opportunity cannot be squandered.",
    "Do not underestimate Sliske. I have sensed his power growing rapidly for some time now. He seems to flit in and out of my reach. Curious, yes. The Shadow Realm, perhaps.",
    "You should go to Morytania, I can sense the other Mahjarrat closing in on Sliske's lair.",
    "He leaps in and out of focus, in and out all the time. He knows I can sense him. Be careful. Last I could tell, he was also in Morytania.",
    "Get back to the lair, I can sense the other Mahjarrat there. They are in need of you.",
    "Player, pity to hear about your decision to help Sliske. Despite my advice, Zamorak saw something in you that I did not. Unfortunately, it would see he was wrong. So very wrong.",
    "Player, your allegiance was a deciding factor in the events that transpired on the heist. Despite my advice, Zamorak saw something in you that I did not, no. He is truly wise beyond measure."
  ],
  "Hazeel": [
    "Human, do you come to swear fealty to me?",
    "I have laid eyes upon thousands of years' worth of faces. Why should I recognize yours?",
    "Meet a lot of Mahjarrat, do you? I have been absent from this world too long. Soon it will tremble at my name once more.",
    "Zamorak awoke me upon his return. It was, of course, his highest priority. I am like a brother to him. Unfortunately I missed the most recent ritual of rejuvenation. It will be some time before I regain my full power.",
    "It is. Although I must agree with Khazard, it has a certain... blood-curdling quality.",
    "Ah, my reviver honours us with a visit.",
    "So the wheels have begun turning. Does he know the location of the Stone of Jas yet?",
    "Of course I know of his plan. I have always been his closest advisor, a few thousand years of absence would not change that. I have unfinished business before I leave for Daemonheim. You can prove highly useful.",
    "My men inform me there is a werewolf held captive nearby. Formidable and ruthless creatures, werewolves. Fiercely loyal to Zamorak, too. From what I hear, this one is particularly prone to violence. Just what we need.",
    "Precisely. Unfortunately I cannot risk being seen in Ardougne and compromising this hideout. The werewolf is being held captive by Lord Handelmort. A detestable individual. Sneak into the basement behind his large mansion north of Ardougne Zoo. Free the werewolf. Leave the revenge down to him.",
    "Speak to me once you have found Khazard, he will likely have something to say.",
    "It would seem as though a combination of out talents will be needed, Zamorak.",
    "You have questions, Player?",
    "Cowardice. They ambushed me while I slept, taking the lives of many innocent people to get to me.",
    "But you were not. The Carnillean cowards entered my home in the dead of night. They slew my guards, my followers...even my servants. Some of those servants were Saradominists I had taken as prisoners. The attackers did not discriminate. When I awoke from my slumber they knew they could not defeat me. Instead they put my mind into a state of torpor, using a foul magic I was not familiar with. I rested for an age before my awakening.",
    "Of course. I will reclaim that which was taken from me, just as Zamorak intends to reclaim the Stone of Jas.",
    "I expect that will be necessary. The humans will not relinquish it easily. I shall need to rebuild my armies first.",
    "It has been too long Khazard.",
    "Now he has created something else. I can sense it. His most vile manipulation of the Shadow Realm yet.",
    "If we resort to brute force we risk raising the alarm. Sliske could move the Stone through the Shadow Realm before we reach the vault.",
    "The Stone of Jas lies in the vault beyond this door, Player.",
    "The way to the vault is unlocked. Enter with caution, Player.",
    "Yes, Khazard, I sense it too. Be on your guard!",
    "So this is the result of your twisted experiments in the Shadow Realm."
  ],
  "Jerrod": [
    "Hm, fresh meat. Who are you?",
    "I don't need saving.",
    "Hazeel? Never heard of him.",
    "You're going to have to come up with a better lie than that.",
    "Jerrod. What's it to you?",
    "What does he want from me?",
    "A werewolf, huh? What gave it away?",
    "Have you seen my living quarters? Hygiene isn't a luxury I have.",
    "Smell is often a good indicator of taste.",
    "They can be a little hard to conceal.",
    "A moment of bloodlust. I wanted the key but he fell too far. Clumsy of me, really.",
    "They seized me at Port Sarim some time ago. Apparently they thought I'd make them a tidy profit in the Fight Arena.",
    "They take me down there in chains every week and get coin when I win. I don't lose. I could probably have escaped, but if I'm honest, I like the rush.",
    "Hm, I an open to the concept of a new endeavour. Let's just say there aren't too many opponents left for me in the arena. You say this Hazeel is powerful? And we'd be working directly for Zamorak?",
    "Huh, a cult. Sounds interesting. All right, let me out. Grab the key from the butler's corpse over there.",
    "You smell... delicious.",
    "Ha, don't worry. I make a point of not eating my associates.",
    "If you'll excuse us, I have some unfinished business with the butler. I assume we'll meet again soon.",
    "You want something?",
    "Lycanthropy, huh? You and your long words. I don't know what you've read, but we can transform at will. Hard to control sometimes, though. Some of us believe it's a gift. Others believe we've been cursed. I see it as a tool. I can inflict pain whenever I deem necessary, and to whom. Handelmort will learn that lesson soon.",
    "I've been listening - my ears are sharp. Far as I can tell, it's some kind of weapon people are willing to kill for. That's all the information I need.",
    "Mm, Canifis is my home. I know the swamps like the back of my own paw. Not many of my kind know how to cross the holy barrier at the River Salve, I'm an exception.",
    "Orders. My insolent nephew fled using the paths I taught him. I raised that mongrel, so I was sent to get him back. It's been quite a journey. Lot of blood on my hands.",
    "Why would I? I live for violence.",
    "Us werewolves are blooded when we come of age. That means we drink the blood of an innocent. It's a rite of passage. Doing so means we swear fealty to Zamorak. It binds us to him. Our duty is to serve. I've done so without question or hesitation. Chaos? That's a concept I can get behind.",
    "As if I needed any encouragement. Just.. One.. Mome- Arrrrghhh!",
    "Grrr...come on. Before I get impatient.",
    "Keep your voice down!",
    "Isn't it obvious? You deal with the wights when they are looking away from you. Try and keep away from those masks too. If you can find a way to open passages for me to sneak through I'll go round the back and take out any wights I can find. There must be something to open up these doors as well, so look out for a lever or switch. Once we've scouted out the way the others will be able to get through.",
    "Quietly.",
    "Moia, what information does this wight hide?",
    "Moia, plunder the foul creature's mind!",
    "Found one. Steal his thoughts Moia!",
    "The door is unlocked, Player. We should head through."
  ],
  "Death": [
    "Leave us, adventurer. This is between me and the scourge of souls.",
    "I am relieving him of his soul, as recompense for the hundreds upon hundreds he stole from me.",
    "Your arrogance sickens me. Those souls were bound for judgement in the Underworld, you have upset the balance between life and death!",
    "This rat is neither living nor dead. I do not know how, but he cheated on me. He is on borrowed time.",
    "Leave this place, Player. This may take some time, he is proving... resistant.",
    "True, you and Icthlarin released me from my prison - for which I am grateful - but the favour can wait.",
    "What? You mean to interrupt me as I exact justice and restore balance to this world?",
    "What is so important that you would save this worthless mage from the fate he deserves?",
    "Hm... I shall afford you this one courtesy as I am in your debt...but I expect the soul eater returned.",
    "Do not fool yourself that this is over. I hope you know what you're doing, Player.",
    "Nomad's soul belongs in the Underworld. I trust you will bring him back.",
    "Good. Nomad is a slippery character, I do not wish to find him myself again.",
    "You do not need to explain yourself to me, world guardian[sic]. I trust your judgement, and I owe you my life.",
    "Good. Nomad is a slippery character, I do not wish to find him myself again."
  ],
  "Nomad": [
    "Release me, reaper!",
    "What's a few souls to you? A drop in the ocean when compared to how many you've taken from this world.",
    "Foolish reaper. They served a higher purpose.",
    "Ha! You're just a glorified undertaker. You cannot begin to comprehend my powers.",
    "Give up this futile endeavour, bone construct!",
    "Haha! Oh, what a unlikely turn of events.",
    "What makes you think I'll comply with either of you?",
    "Well, why didn't you just say that? Finally he has recognised my deeds enough to summon me. Thanks for the hospitality, Death. It really has been a pleasure.",
    "Leave it to me. The guards will pose no threat. I'll be back with the Stone before sundown.",
    "What do you want?",
    "Hm, yes, I can see why you might think I would be angry. In truth, you did me a favour. You showed me my weakness. The fragility of the power I clung to, derived from the soul obelisk. We will face each other again some day, I am sure. You will not be the so lucky next time.",
    "I have had many masters, most of whom I have overthrown for their...ahh...disloyalty to Zamorak. The one you speak of had been fraternising with the White Knights. I paid him a visit once I'd regained my strength from our battle. He won't be fraternising with anyone any more.",
    "Regrettably, the power I gained from the soul obelisk was finite. The more it grew, the more I needed. I became attached to the obelisk, addicted you might say. Every time I felt my power shrinking I clung to the obelisk for more souls.",
    "Some of the soul power still lingers, but I have found new ways to maintain it. Safer ways. The return of the gods has proved highly useful to me. Divination is a marvellous source of energy.",
    "He was attempting to extract my soul. The fool knows full well he cannot take the souls of the living!",
    "Apparently I 'cheated death' when I survived your final blow. The reaper falsely believes my soul belongs to him. I would sooner burn in Infernus than go to the Underworld. If Death continues his pursuit, I may have to deal with him myself.",
    "Let me scout ahead. I can remove the threat of any guards if they spot me.",
    "I could get to the stone quicker than any-",
    "Tell Jerrod to sniff out the guards so Moia can steal their memories.",
    "That was a piece of cake. The Stone of Jas awaits us.",
    "Hmm..",
    "Indeed. A nice trick, but nothing more, conjurer.",
    "Hahahaha! Fools. You've cleared a path for me all the way to the Stone.",
    "For too long I have struggled to regain my power. Serving under masters who were unworthy of my devotion. Then divination lead me to discover a source of greatness more potent than any I had seen before. The energy of the gods themselves. Now I stand before a fountain of that very power, and all that is left is to reach out and drink from it.",
    "I do not have to, no, but I am a man of ambition. Imagine the things I could do with such power!",
    "Is it mad to want to test the boundaries of magic? I am a man of ambition. Imagine the things I could do with such power!",
    "Yes, already I have defied Death himself. With the power of the Stone of Jas immortality surely awaits me!",
    "Oh, but Saradomin is so unimaginative. What have the gods done with the Stone? Nothing! Envisage the power of the gods in the hands of someone who knows the science of magic. I alone possess the knowledge to realise its true potential.",
    "Hm, not the whole Stone, no. Regrettable indeed. But teleporting out with a small piece of the Stone? Well, that seems quite feasible.",
    "Watch me.",
    "Argh! Wretched 'World Guardian'. You are nothing but a mercenary - why would you choose to help Zamorak? He is weak, cowering in his hideout! Look at you. His loyal followers. When Sliske takes his vengeance, will Zamorak come to your aid? No, he hides in the depths of Daemonheim where he thinks he is beyond reach. No one will help you now.",
    "Finally, I can feel the power coursing through my veins. Even the mighty Zamorak will cower before my magic. Look at you. His loyal followers. When Sliske takes his vengeance, will Zamorak come to your aid? No, he hides in the depths of Daemonheim where he thinks he is beyond reach."
  ],
  "Khazard": [
    "What are you doing here?",
    "You can't have found me by chance. Which means... Moia sent you?",
    "That blasted half-breed! Can't a Mahjarrat do anything in privacy any more?",
    "You stand upon the site of a great battle that was fought in the Third Age, when our forces sieged the city of Uzer. One of Zamorak's most prominent generals - Thammaron - led the attack. He was gravely wounded and died just through the portal in these ruins. I believe my mother also fought here - she is the only Mahjarrat I am sure to have known my father. Her name was Palkeera.",
    "The battle occurred not long after my birth and there was not much time until the next ritual of rejuvenation[sic]. She would have wanted to prove she was still a fearsome warrior before the weakest of the Mahjarrat was chosen.",
    "Despite being vastly more powerful I have been ordered to report to Moia by Zamorak himself. I command a large garrison of Zamorakian forces. Moia requests constant updates, as we are such an indispensible asset.",
    "Hmph. That addled recluse Bilrach informed her of my movements, so I had to explain myself. Madness...",
    "Very well, but before I can leave I need your help checking the Shadow Realm. I have reason to believe my mother could manipulate it too. If she fought here then perhaps my father did too. A tenuous link, but it is the only lead I have. There could be information in the Shadow Realm.",
    "Sliske's experiments have affected not only certain methods of seeing in, but also my ability to enter. Though it would seem I can still manipulate the shadows enough to send you in.",
    "I will not leave until I am sure there is no information in the Shadow Realm.",
    "Are you ready to search the Shadow Realm for me?",
    "You mean- what did you find?",
    "Sh-she died protecting Thammaron. A worthy death, but... it was because of me. She was weak.",
    "It couldn't mean... Him? Argh why does it finish there? I need more information!",
    "Gah! Well, at least I know of my mother's fate. She died a warrior fighting for the glory of Zamorak. I will go to him now. He must be eager to see me.",
    "If I had been there history would have been written differently, Hazeel.",
    "There was a time when between us we controlled all of southern Kandarin. Our reign was glorious.",
    "With the combined might of our forces we will crush them like ants under foot.",
    "You taught me how to conquer. Now it is my turn to help you.",
    "Sliske has been experimenting, creating abominations for his army. He started by twisting the Barrows brothers, increasing their power...",
    "He has devised a way to prevent us entering the shadows. Warped the boundary in somehow. I do not know what but there is something that allows you to enter. Perhaps Sliske wills it. Regardless, you must be our shadow agent for now.",
    "Hazeel... Do you sense that?",
    "What have you done, Sliske? Playing god like this is dangerous - even for you!",
    "No! Surely they are nothing but apparitions - constructs of shadow...",
    "Player, I will send you unto the Shadow Realm to retrieve the Stone. We will buy you as much time as we can. Our fate is in your hands!"
  ],
  "Lord Daquarius": [
    "What want you, with the Lord of the Kinshra?",
    "Is that so? You'll have to earn my trust before I believe such a bold claim.",
    "Hmm. Very well, do some of my dirty work and I'll hear you out.",
    "Since Zamorak's return and our setback at the Battle of Lumbridge, there has been unrest among the soldiers. Many of us are dedicated to the theory of strength through chaos, but among us are those who have been miseducated by the slanderous Saradominist propaganda.",
    "Their false teachings have been prevalent for thousands of years, percolating so far that the common folk accept them as fact. Many - including some of the Kinshra - believe chaos to be synonymous with evil, but it is not so. Zamorak was a revolutionary.",
    "I need to regain control of my order. There is risk of an uprising from those that still fight for evil. It must be quelled. Mutiny is of highest priority. I have caught wind of a plot to assassinate me - 'to cut off the snake's head', so to speak. See if you can find evidence that will lead us to the culprit. While you're at it, put a stop to anyone preaching that Saradominist drivel.",
    "You still need to: Find evidence of the assassination plot. Settle an argument about chaos vs. evil. Stop the Black Knight preaching about evil.",
    "Poison bearing my initials? I recognise the chicken-scratch handwriting on the bottle. I'll have the insolent coward dealt with.",
    "Not completely disappointing, looks like I might be able to trust you after all. I'll hear you out.",
    "He has asked for me himself? I can scarcely believe you... I am honoured. Daemonheim is a long journey from here, I ought to leave soon if I am to be punctual. Leave me to my preparations.",
    "If I may speak, it would seem our best option is stealthy approach.",
    "Do you want something?",
    "There are still murmurs from those who cannot see the difference between chaos and evil. It is a problem that runs deep in the Black Knights. We have much work to do before the problem is solved, but we will emerge from this much stronger than before. From the chaos a new Kinshra will be born, more unified than the last. Just as Zamorak has taught us.",
    "Of course I know that cur! The filthy animal prevented the execution of Sulla, my predecessor. He even killed some of my men!",
    "He allied with Sulla. Claims an emissary of Zamorak wanted them to work together. If the circumstances were any different I would drive a sword through his chest.",
    "I stand unworthy of his awesome might. The god of chaos... If I did not see with my own eyes I would not believe. We must do whatever he requests of us, Player. Our lives are forfeit in servitude of a higher purpose.",
    "We must crack the rune locks, Player!",
    "We've cracked the door, Player. Let's see what awaits us in the vault."
  ],
  "Black Knight (1)": [
    "The rest of the guys are all talkin' about it too. Maybe they're right, eh?",
    "What's it to you? Ge-",
    "Well, us Black Knights are meant to be evil, right? I don't understand all this 'strength through chaos' rubbish.",
    "If you've met the god of chaos, then my name's Saradomin! That can't be true, can it?",
    "I- He would do that? I'm not a part of any uprisin', I swear! I was only askin' questions!",
    "If you've met the god of chaos then my name's Saradomin! That can't be true, can it?",
    "Well if Zamorak does value Lord Daquarius like you say, maybe he is the leader we need. We should stand together."
  ],
  "Black Knight (2)": [
    "You've read the books - you know Lord Daquarius is right.",
    "Wait, settle an argument for us, will you? These knuckleheads are thinking about joining the uprising.",
    "Well... What if it is? Don't know about you, but I don't want Zamorak smitin' me!",
    "I don't know if it's true, but that's the most sense I've heard spoken 'round here for a long time."
  ],
  "Black Knight": [
    "Strength through chaos, adventurer.",
    "Zamorak be praised.",
    "Glory to the god of chaos!"
  ],
  "Preaching Black Knight": [
    "Who do you think you're talkin' to, usin' all those long words? This ain't a debate - we were meant for evil!",
    "What d'you mean it's what they want? It's filthy rumours - they're scared of us, that's what!",
    "I guess I ain't looked at it that way before. I'll give it a rest for now - need to do some thinkin'."
  ],
  "Enakhra": [
    "What do we have here?",
    "Zamorak sent you himself?",
    "Still your tongue, Zemouregal. It is not wise to speak ill of our master.",
    "I felt betrayed at the Empyrean Citadel. My temper has since calmed.",
    "Zamorak refused to let us accompany him to Sliske's event. Even when we arrived, he made no effort to communicate with us.",
    "I can see now that it was a time for diplomacy. We did not hold a position of power.",
    "Your skull is too thick for your own good, Zemouregal. Remember who the real enemies are here.",
    "Stop evading the question.",
    "Now who's changed their tune?",
    "And that leader would be Zamorak. Don't let greed get the better of you, Zemouregal.",
    "Of course. We will not keep him waiting.",
    "Of course, my lord.",
    "I believe he was loyal to Zaros for a time. He did unspeakable things in his name. The rogue deserves a fate worse than death. Whether he still serves Zaros is irrelevant. The Stone of Jas belongs to Zamorak, and Sliske stands in our way.",
    "What? Because I am the only remaining female Mahjarrat I must be in love with whom I revere? Your incessant questions are becoming quite childish.",
    "I have witnessed Zamorak defy the gods, ascending to become one himself. Yes, I am in awe of him. But in love? No.",
    "We have explained ourselves enough. We were searching for elder artefacts to turn the tide of the battle.",
    "Quiet! Zamorak selected Player and Jerrod to enter. We must trust his judgement.",
    "Tell Jerrod to sniff out the guards so Moia can steal their memories.",
    "We did it, Player. Lead the way into the vault."
  ],
  "Zemouregal": [
    "Player. Tresspassing now, are you?",
    "Then speak your purpose before I lose my patience.",
    "It is quite time I replace those brittle old creatures any way.",
    "A likely story. Speak your purpose before I lose my patience.",
    "Unsurprising. Begging for help from anyone in his desperation.",
    "You've changed your tune somewhat.",
    "It should have been us in there dealing with Sliske. Perhaps then he would not still draw breath.",
    "He had threatened to denounce us! Your reaction at the time was more apt than this bootlicking.",
    "Why? Did Zamorak send you to summon us or ask questions?",
    "You over step your boundaries, Player. Do not call my loyalty into question.",
    "He intends to make an attempt on the Stone? Has he discovered its location?",
    "Finally he has made a wise choice and come to me. I need to be spear-heading this operation.",
    "We need an all-powerful leader once more. The Stone of Jas could return us to our former glory.",
    "Whatever you are insinuating I suggest you reconsider your words, Enakhra.",
    "So it is true. Viggora, I had heard you lost your mind, doomed to wander the Shadow Realm for all eternity.",
    "Let us strike now. We have the Stone's location - we must storm Sliske's lair by force!",
    "Hah! No one is more suitable to this quest than me. Zam-",
    "It would be my honour.",
    "What is it?",
    "That serpent-tongued magician serves his own needs. I doubt he was ever truly loyal to Zaros.",
    "Hah! He hides and presents us with obstacles. I would crush him if he stood before me.",
    "Hahaha! Yes Enakhra, do tell us!",
    "You must admit, your behaviour has made you seem a little...smitten.",
    "Hmph. This again?",
    "Zamorak is aware of this. We are here now, that is all that needs to be said.",
    "Finally! Let's get in there and take out that rat.",
    "The plan is what ever I say it is, Sliske's trickery can't hold me back.",
    "Speak to me like that one more time, Player. I dare you.",
    "Hah! If I must stay on the back lines you are staying with me, mage.",
    "Hm. I'll allow it, but I cannot see what makes you any more capable than me.",
    "These measly defences will not hold us back for long, Player.",
    "Sliske's necromancy is no match for my power!",
    "Yes, yes... More!",
    "Where are these undead weaklings coming from next, Player?",
    "Then let us get in there and claim what is ours!",
    "Hm, Sliske will have to do better than that to best us, Player.",
    "Useless half-breed! Lucien was right about you, weak-",
    "Had you been watching me I would have caught you and cut that forked tongue from your mouth.",
    "Whose side are you on, Player? I say we eliminate this vermin before he has the chance to scurry away!",
    "Enough of this prattle! I say we eliminate this vermin before he has made the chance to scurry away!",
    "Arrogant mage. You are nothing but a traitor, no more fit to wield the Stone than that hypocrite Saradomin!",
    "You would not dare."
  ],
  "Zemourgal": [
    "You too now? Zamorak was crushed by Saradomin and now he wants us to prove ourselves? First he can prove himself."
  ],
  "General Khazard": [
    "As you command.",
    "What if the plan goes wrong?",
    "We are almost there, Player. We must break through this door!",
    "Sliske's shadow trickery was no match for our combined power. We should head into the vault."
  ],
  "Viggora": [
    "General Zamorak.",
    "Zamorak's return broke the curse that was laid upon me. I may be confined to this realm but my mind is my own, at last.",
    "My search took me deep into the swamps of Morytania, to the Barrows where Sliske's undead servants rest. There I discovered his lair, my lord. A stones throw to the south, through a cave system that plays tricks on the mind.",
    "I passed deeper into the lair, past tricks and contraptions. It was at the heart that I found it.",
    "Yes, General Zamorak. In a cavernous vault behind a bolstered door. In the Shadow Realm he hides it.",
    "It is my duty. I am forever in your service.",
    "On your way to the vault you will find several rooms, presumably trapped and guarded. The door preventing entry to the vault will be particularly problematic: an intricate system of rune locks and trickery. Inside, I could only see the Stone of Jas. That is all I know.",
    "Good luck to you all. Victory is in your hands.",
    "Ah, you are one of Zamorak's allies, are you not?",
    "How goes the operation? Is the Stone of Jas within Lord Zamorak's grasp?",
    "Hm, a partial victory at least. We must begin planning the next offensive, I long to witness Lord Zamorak's prowess in combat once more.",
    "I should liaise with the rest of my faction. No doubt they will have need of my services."
  ],
  "Light": [
    "Hey Shadow, wake up! We've got guests!",
    "Don't be a spoilsport, they've come to play our game!",
    "Oh come on! We wouldn't have to tell Sliske.",
    "Oo Shadow, they found a guard. How exciting!",
    "Look, look! They're figuring it out!"
  ],
  "Shadow": [
    "Oh what is it now? Can't a mask get a little bit of peace and quiet around here?",
    "I'm not in the mood for games.",
    "Fine, let's get this over with quickly. Player, tell your dog there to sniff out the guards' tracks.",
    "Can you speed things up a bit please? I have sleeping to do. Player, tell the mind-reader girl to use her powers on the guard.",
    "Yes, yes, how very interesting."
  ],
  "Hazeel or Khazard": [
    "Not right now, Player. I must hold this window to the Shadow Realm!"
  ],
  "Alarm triggered": [
    "You did not maintain the balance between shadow and light.",
    "Zemouregal's portals were not in the correct locations."
  ],
  "Foreshadow": [
    "Come with me, little one.",
    "The shadows won't hide you now!"
  ],
  "Saradomin": [
    "You are defeated, Zamorak. Give up the Stone!",
    "You cannot reason with this mad dog, Armadyl. He and all his forces are devoted to evil above all else.",
    "Do you see now? This is what you truly stand for: the destruction of life. You are nothing but a villain.",
    "He is trying to manipulate you. We each allied to bring this wretched criminal to justice. The Stone is rightfully mine!",
    "And you believe chaos to be the answer? Would you have this planet ravaged by a never-ending war?",
    "MADNESS!",
    "The time has come for you to meet your end, usurper."
  ],
  "Armadyl": [
    "Please, Zamorak. Look at the Stone. Your desperation is causing it to become unstable!",
    "There is a peaceful way out of this for all of us, you barbarian. Zamorak, it does not have to come to this!",
    "Zamorak, I beg of you - the Stone! You know not what you do. You could annihilate Forinthry and all innocent life within!",
    "Saradomin, does he speak the truth?",
    "I am sorry, Zamorak. I cannot allow chaos to engulf this world."
  ],
  "Bandos": [
    "Close that beak of yours. We have you surrounded, Zamorak. Your armies lay in ruins on all sides!",
    "Hah! The mighty Zamorak, begging on his knees. Pathetic.",
    "Haha! Yours? Looks like fair game to me, old man.",
    "In another time we might have seen eye-to-eye, Zamorak. I might have even let you fight for me.",
    "They are just words. Empty promises and idle chatter. You are a blight that must be eradicated."
  ],
  "Heist member": [
    "What are you doing? Zamorak is here, you should speak to him."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Dishonour_among_Thieves?oldid=36233424’"
  ]
}