{
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "Missing dialogue with a crystal raven visible after the third resonating crystal is interacted if the Ravensworn title is unlocked.You can discuss this issue on the talk page or edit this page to improve it."
  ],
  "Moia": [
    "Watch yourself, World Guardian. More TzekHaar might come through that gate at any moment.",
    "I arrived here just in time to see a horde of them break through to the surface. I dealt with them, but I wonder what happened to your defenders.",
    "Looks like your allies need our help to finish this war.",
    "Of course I do.",
    "Zamorak may have decided that his strength is better used elsewhere but I do not agree.",
    "The fight below is one for the fate of Gielinor. I don't want to see your alliance lose, and I don't reckon much of your odds without us.",
    "So I left my armour behind and came here to see what I could do.",
    "Our new friend here had the same idea.",
    "A pity. Nevertheless, we need to clear the enemy out so we reach the cathedral.",
    "If you had any sense you wouldn't trust me. I certainly wouldn't, if I were wearing your shoes.",
    "But considering that the TzekHaar are breaching the surface, I'd say you have little choice.",
    "You need all the help you can get and we have a common enemy. Trust doesn't need to come into it.",
    "I intend to reach the cathedral, World Guardian. Help me, or get out of my way.",
    "Go into the city and kill any TzekHaar you find. I will hold the surface entrance and stop any escaping. We'll meet at the cathedral when you are done.",
    "It's all right, Princess, your daddy doesn't scare me.",
    "His pride was wounded, yes, and no wonder. He sacrificed his freedom and strength to help you, of all people, and look how you repaid him.",
    "Nothing but insults and suspicion. No wonder he grew tired of you. In the face of such disrespect, I would do the same.",
    "That being said, it was his pride - not mine - and I am not his mirror.",
    "This world still needs saving. He might think he can jolt you into stepping up to fix this mess, but I am not willing to leave it to chance.",
    "Gielinor is my home as much as it is yours. I'm here to make sure it survives - with you, or despite you.",
    "Very sensible of you.",
    "Disbelieve me all you want. It makes no difference to me.",
    "I'll do what I must to make sure Gielinor endures. We all have a better chance of survival if we work together.",
    "Consider it done.",
    "The nerve of those two. 'Stay back and defend the doors, witch.'",
    "As if they weren't fighting for their lives.",
    "Do you have a plan for when we find them, World Guardian?",
    "If she can't do it, then the eggs will need to be destroyed.",
    "I'm sure she can be persuaded.",
    "I didn't realise your World Guardian powers stretched that far.",
    "We need something more solid than that.",
    "About time. They've caused more trouble than they're worth.",
    "What if she's not? A god of her power could be anywhere, on any world.",
    "Keep it together. We have a chance but only if we don't lose our focus.",
    "We should split up. I can search Gielinor. Teleporting is easy for me - I can cover more ground that way.",
    "The fate of the universe is more important than any of our personal quarrels. I will not be foolish enough to stab your allies in the back, given the circumstances.",
    "That's the spirit, Princess.",
    "Without a strategy, you'll never find her in time. Do you have any way of narrowing your options?",
    "comm",
    "Drop something so I can give it to you.",
    "A way of contacting me if you need it. Activate it and I will answer.",
    "If we find Seren, we will let you know, and we'll keep her occupied until you join us.",
    "And you are Kerapac's son.",
    "I've heard a lot about him.",
    "Ah, World Guardian. Well?",
    "So where do we look first?",
    "I'm beginning to like you.",
    "Enough chatter. Is Seren here?",
    "I'm surprised to see you getting your hands dirty, Princess. Don't you have servants for that sort of thing?",
    "Hrm... I can respect that.",
    "Well, that was a bust. I really thought she'd have gone to Tarddiad for her precious elves. Where else could she be?",
    "Why would she go to the world your father helped to destroy?",
    "Your father really did a number on this place, Princess. No intelligent creature left alive, as far as the eye can see.",
    "But your father led them here. He has a habit of bringing war and destruction wherever he goes, yet he still calls Zamorak the villain.",
    "...",
    "Do you hate him? Kerapac?",
    "He's one of the most powerful beings in existence right now. A dragonkin armed with two elder artefacts: the Needle and the Siphon.",
    "Actually three, though he seems to ignore the Mirror for some reason. If you were on better terms you could leverage that power.",
    "A dog can always get free of its leash.",
    "Well that's romantic nonsense. He's dead, long dead, and he hasn't been on Naragun for aeons. She'd have had more memories of him on Gielinor than here.",
    "Maybe another time. Everyone RUN!",
    "That's two wrong. What now?",
    "Another dead end.",
    "No need. I can take us to the mountain above the Halls directly.",
    "This isn't the first time I've visited my father's homeworld. Come. Are you all ready?",
    "Onwards, then.",
    "They don't get deader than this.",
    "Something above.",
    "By the Abyss...",
    "That's not possible. The Shadow Breach is closed. It's in the Monolith, on Gielinor. Azzanadra closed it months ago.",
    "You said it knew we were here. Is it alive?",
    "You didn't give us much time, did you?",
    "You don't?",
    "Well. That's not something you see every day.",
    "Erebus didn't tear you apart. How are you feeling?",
    "You helped defeat an Elder God, World Guardian. That is...something.",
    "Quite staggeringly blasphemous to some eyes, I'm sure, but as Zamorak's agent, I commend your efforts.",
    "We should go back to halls[sic]. We can't let Seren get away again.",
    "We just saved all your skins.",
    "Don't be so humble, World Guardian. It's not every day that you vanquish an Elder God.",
    "Let us take some of the power, then. One final bloodletting.",
    "Don't be ridiculous.",
    "She's stalling.",
    "She means to hatch them here!",
    "Cut the self-pity. You can feel bad once we've fixed this.",
    "Who decided that? On whose command, exactly, do you lie down and die without a fight?",
    "Don't bother. You cannot save those who do not wish to be saved.",
    "If they won't help themselves, they're a lost cause.",
    "Feel free to stay behind and waste time trying to change their minds. See where it gets you.",
    "We shouldn't be helping them. If they want to live, they should get up and fight for it.",
    "The sooner we're off this rock, the better.",
    "And the eggs?",
    "Good luck.",
    "Zamorak will be delighted to hear of your death, World Guardian.",
    "Goodbye.",
    "There was nothing I could do, Adrasteia. I'm sorry. I had to leave them...",
    "...",
    "Careful, World Guardian.",
    "And then what?",
    "Not that it matters. You wormed your way out of it, as usual.",
    "Has your father told you what this World Guardian is for? Do you know what it means?",
    "If a god wants Gielinor, they must first get through its World Guardian.",
    "But there lies a conundrum, because a World Guardian can't be hurt by gods. Its creator made sure of that.",
    "The greatest prize in this universe, the one perfect world, protected by the only creature that immortal hands can't kill.",
    "What's a god to do?",
    "No. Oddly enough, the fate of the universe struck me as more important than the removal of this particular thorn in our side.",
    "But the opportunity was too good to waste.",
    "Ask your father. He would have done the exact same thing.",
    "You think you can take me?",
    "And perhaps one of you would survive.",
    "Don't be stupid, Adrasteia. I don't want to kill you.",
    "Someday soon, my lord will return, and he will take this world for himself.",
    "I want you to face that, Princess. You've spent so long in your shining towers above the clouds of Hallow. I wonder what you know of cruelty. Of war.",
    "I want to see what it does to you. I want to see what you become."
  ],
  "Player": [
    "Moia? What are you doing here?",
    "And what do you mean, more TzekHaar?",
    "You do know that Zamorak abandoned the cathedral alliance, right?",
    "Then what are you doing here?",
    "You're trying to reach the cathedral too?",
    "Hold on. How can I trust you?",
    "Fine. If the defences are failing then I need to go there anyway.",
    "I shouldn't open the door with the TzekHaar out here.",
    "That's all of them. I should go to the cathedral and find out what happened to the defenders.",
    "Now is not the time for that.",
    "I've faced worse.",
    "What's going on? Why are the doors shut?",
    "It seems I got here just in time.",
    "Daughter?",
    "Yes, she's on our side.",
    "She's only here to sabotage us.",
    "Why are the fronts so close? What happened?",
    "How are the eggs?",
    "Seren? How soon are they going to hatch?",
    "What's wrong?",
    "Where's Azzanadra? Can't he help?",
    "We need to get the fronts under control.",
    "I'll help him.",
    "You're Saradomin's daughter?",
    "What do you know about the battle?",
    "I'll see what I can do.",
    "Ugh. Thanks for getting me out.",
    "I'm going back in. I won't stop until we clear all of that mutated fungus.",
    "I'll see what I can do.",
    "You're alone out here? What happened to the mages?",
    "What do you need me to do?",
    "Is it still functioning?",
    "I'll give it a go. I'll destroy them much faster if I use it.",
    "Begone, foul beast!",
    "FIRE!",
    "Take that!",
    "You can't stop me!",
    "You're too late, Kerapac. I've already destroyed your siege engines.",
    "Your army has gone.",
    "What?",
    "If you think I'm going to stop destroying your engines, you're sorely mistaken.",
    "It's Zuk! He's coming for the eggs!",
    "Seren!",
    "Seren took the eggs and teleported away somewhere. We need to find her before the Elders do.",
    "Out here there's nothing stopping the Elders from touching the eggs and hatching them, and if that happens...",
    "We'll get Seren to keep the eggs dormant.",
    "We'll build something to keep the Elders at bay.",
    "I mean...we could work something out.",
    "We'll destroy the eggs.",
    "We have to find them first.",
    "She might still be on Gielinor.",
    "Are you sure that's a good idea?",
    "I will go to the World Gate and start looking on other worlds.",
    "Not really.",
    "That's right.",
    "What does Vicendithas know about anima?",
    "That sounds promising. We should talk to him before starting our search.",
    "You two start at the Elder Halls. Seren may have taken the eggs back there.",
    "What's this?",
    "All right. I'll go talk to Vicendithas.",
    "I shouldn't use this until I've finished speaking to Vicendithas.",
    "Hannibus told me that you're building an anima diviner.",
    "Seren has taken the Elder God eggs from Senntisten. We need to find her before the Elders reach them and destroy the universe.",
    "If you have any way to search for the eggs, it would help us.",
    "What exactly is it that you're working on?",
    "Like the Measure does?",
    "You've met Charos?",
    "Not any more, he's not.",
    "You mean his crown, right? The one that Zaros took when he left for Erebus?",
    "Does your device not do that?",
    "Would it help if I gave you the Measure?",
    "It was. I lost it.",
    "It is!",
    "Mr Mordaut, I lost the Measure!",
    "Hannibus said I left it here on Anachronia and your were keeping it safe for me?",
    "I have the Measure!",
    "Have you been helping Vicendithas with his research?",
    "What do you mean?",
    "The other gods stayed to contain the fighting. They are stopping it from spreading to the surface.",
    "Not permanently.",
    "Not yet.",
    "Have you two had a fight?",
    "Why are you helping the Ilujanka?",
    "Can you use it? Can you find the eggs?",
    "So she took them off-world.",
    "I appear to have lost the Communication Device.",
    "Moia? Are you there?",
    "We found Vicendithas. He's done some experiments and we found that the eggs aren't on Gielinor anymore. Seren's taken them somewhere else.",
    "Can you meet me at the World Gate? I'm heading there now.",
    "I should tell Hannibus and Vicendithas that we're going to the World Gate.",
    "I've already talked to Moia.",
    "I'm going to the World Gate.",
    "Can you remind me where the World Gate is?",
    "Thanks.",
    "I hope we're not too late.",
    "Seren and the eggs aren't on Gielinor. This is Vicendithas - he has a device that can pick up the eggs' anima signature.",
    "But they're not here.",
    "We should try Tarddiad first. There's lots of life there, and it's where Seren first met the elves.",
    "There's a personal connection - it would be the first place she thinks of. She might think to hide there to keep the eggs safe.",
    "Like the crystals in Prifddinas? They've absorbed some of Seren's essence?",
    "What does that mean?",
    "I've already investigated here. I should look somewhere else.",
    "We're looking for Seren. We thought she might have come here.",
    "But you'd been to Gielinor and seen her there?",
    "Kerapac! Everyone, get ready to fight!",
    "You'll die too!",
    "It's worth a look.",
    "We'll have to be ready to run if he does.",
    "She's not here. We should head back to the World Gate and try somewhere else.",
    "But if it was?",
    "Do you mean somewhere like Kethsi? Where the Stone of Jas was kept?",
    "Worth a shot. Let's try Kethsi.",
    "And if Kerapac finds us there...maybe I can try to get through to him.",
    "There must be something I can do to help him turn against Jas.",
    "That's all we need, Kerapac. Time.",
    "You don't want this. You want none of this. If you could, you would help us, wouldn't you? Help us stop Jas?",
    "Are you so easily humbled that you would choose to blindly obey Jas? Don't you have any strength of your own to fight against her?",
    "A moment is all we might need.",
    "You mentioned that Jas herself is coming. That she follows behind you, right?",
    "I'm not looking to fight her. We just need you to delay her until we can find out a way to stop this. You can be a part of stopping her, without having to actively defy her.",
    "To spite her? To be one step closer to stopping her? At the very least we need to find Seren before there's any reason to follow us. We don't have the eggs after all.",
    "But with just a little more time, we might be able to find a way out of all of this. Help us.",
    "Because you're not her slave? Isn't that enough? You hate me, I don't blame you, but don't you hate her more?",
    "Then work with us. Defy her. With just a little more time, we might be able to find a way out of all of this.",
    "Thank you.",
    "It's better than nothing.",
    "Freneskae? It has a personal connection to Seren as well, it was her home for thousands of years.",
    "Freneskae. A dead world. Why would Seren bring them here?",
    "Vicendithas, can you tell where she is?",
    "It's quite a climb, but the old Elder Halls aren't far from here. From there we can plan our search.",
    "You can?",
    "This is where the last generation of Elder Gods hatched. They bled the planet dry of anima, and then they moved on to the rest of the universe.",
    "This is what will happen to any world the eggs hatch on.",
    "Follow me and climb down this ledge. The Halls are this way, in the heart of the mountain.",
    "Follow me. The halls are this way.",
    "We're not going anywhere.",
    "What were you thinking? The gods were about to end this for good. Why did you run?",
    "What was that?",
    "In the cradle?",
    "Come on. Let's go see.",
    "It feels like-",
    "Shut up!",
    "Right. Sure.",
    "I saw a portal.",
    "What's this got to do with Zaros? What do you know?",
    "What is it?",
    "Horrors within?",
    "Erebus.",
    "Someone who might be able to help us. Stay here. We'll go talk to him.",
    "Adrasteia and Hannibus - you stay here. Make sure nothing happens to Seren. Moia, Vicendithas - brace yourselves. This could get a little painful.",
    "Below, in the Elder Halls. The eggs are with her.",
    "No.",
    "Uh...",
    "We will send her through the portal.",
    "We need to keep her trapped here in a time loop.",
    "We should attack her with the Needle.",
    "What just happened?",
    "We can't attack her, can we?",
    "In this universe?",
    "Oh.",
    "No. It's not.",
    "I don't know.",
    "But I think I'm the only one who can stop her.",
    "It's choking me. I can't breathe.",
    "Not yet. Something in there is slowing me down - I can barely move.",
    "I made some progress. There are rifts in there, and they can take me between islands.",
    "Some won't open for me, though.",
    "There are souls in there!",
    "You were right - I can use the souls. I found one that helped me move a boulder.",
    "I found a different type of soul.",
    "I activated a lodestone in there. I think this is a fragment of it.",
    "It's a memory, I think. Like a wisp.",
    "I could use the memory to explore more - it activated some sort of fissure.",
    "You pulled me out before I could use it, though.",
    "My legs feel lighter.",
    "Hear what?",
    "It feels like a huge weight has lifted.",
    "What is it?",
    "It's a structure of some kind. An idol, maybe?",
    "Something big is coming! Everyone get down!",
    "I should hang on to these.",
    "...",
    "Didn't you vanish with her?",
    "But you're lost too.",
    "I'm fine, I think.",
    "Thanks, I think.",
    "Jas came for the eggs. Kerapac and I used the Needle to banish her through the portal.",
    "Turns out there are things in Erebus strong enough to overpower her.",
    "It doesn't matter. We're safe now.",
    "He sacrificed himself and the Needle to make sure the plan worked. The shadow monster took him too.",
    "The Needle broke, though. I used it to survive in Erebus and it shattered.",
    "I did what was needed. Jas was here to kill us all and take the eggs. Now we have one less Elder to worry about.",
    "This has gone on long enough, Seren. We need to decide what to do with the eggs.",
    "We need them to hatch here. It's a dead world. It's the only place they won't kill anything - there's nothing for them to destroy.",
    "We've wasted enough time. The eggs need to be destroyed.",
    "We need to keep them unhatched. Seren - can you keep draining their anima?",
    "Where is she going? Get after her!",
    "Seren! What are you doing?",
    "That's not what this is!",
    "But -",
    "How do we get off-world?",
    "We need to start the evacuation. What do we need to do?",
    "You're not going to try to stop it?",
    "Will there be others who want to evacuate?",
    "So we evacuate those who want to go. Start here.",
    "Moia - get the world gate open back to Gielinor. Adrasteia, get the word out to anyone who wants to leave.",
    "I'll start helping anyone who needs to get through the gate.",
    "Do you need help evacuating?",
    "I'm afraid so.",
    "Can't you make more on Gielinor?",
    "I've not found any tools yet.",
    "I've got some tools here for you.",
    "Here you go.",
    "Are you going to leave?",
    "Do you need me to help carry anything?",
    "You should get to the Word Gate, then.",
    "What about your stories?",
    "Of course.",
    "Something wrong?",
    "I lost he seed bag.",
    "I've not found any seeds yet.",
    "I've found some seeds!",
    "Here are the seeds.",
    "So...will you leave?",
    "What do you need?",
    "Your fish? Are they important?",
    "I lost the bucket.",
    "I lost the net.",
    "I've not found any fish yet.",
    "I've found some fish!",
    "Here you go. One bucket of fish.",
    "I shouldn't take those yet.",
    "I need a seed bag to carry those seeds. Maybe the Plantkeeper has another one?",
    "I've filled the bag with seeds. I should give it back to the Plantkeeper.",
    "I've already taken the seeds from this plant.",
    "I've already filled the bag with seeds. I should give it back to the Plantkeeper.",
    "I've collected all the seeds I need here. I should see if anyone else needs help evacuating.",
    "I don't know whose that is - I should leave it alone.",
    "I don't have enough space to pick that up.",
    "I should leave those alone for now.",
    "I need a bucket to put those fish in. Maybe the Pondkeeper has another one.",
    "I need a special net to catch those fish. Maybe the Pondkeeper has another one.",
    "That looks like all the fish I neeed[sic]. I should give them to the Pondkeeper.",
    "I've got all the fish I need. I should give them to the Pondkeeper.",
    "Everyone who wanted to leave this village is gone.",
    "I should go to the World Gate see[sic] how the rest of the evacuation is going.",
    "Everyone who wanted to leave from this village has gone. We should get to the next one.",
    "It's Seren. I'll go see what she's doing.",
    "What are you doing?",
    "But we're not done evacuating! We need more time!",
    "Please, Seren. You could stop all of this.",
    "We're out of time. I should tell the others before it's too late.",
    "We're out of time. You need to get everyone out.",
    "Don't wait for me. I'll distract her while you finish the evacuation.",
    "I can't stop her. Nothing can, now. But I can delay her.",
    "I can distract her from her song. That should slow the Elders.",
    "What are these?",
    "If you won't delay this, I will.",
    "Never.",
    "As long as I live, I'll buy the others time for the evacuation.",
    "I'm on my way!",
    "What?",
    "No!",
    "It's not working!",
    "Why isn't it working?",
    "Seren? Where are we? Am I...dead?",
    "I...",
    "No. Do you?",
    "So it's not...Sliske?",
    "What about the rest of us? It's only a matter of time before they grow hungry. Then they'll start eating other planets.",
    "You've doomed us all...",
    "You will keep them here on Iaia?",
    "This is...acceptable. If you keep them safe here, then the rest of the universe will be spared.",
    "I can't trust you. How can I be sure you won't let them escape?",
    "You left me for dead.",
    "You lying piece of-!",
    "You saw me running for the portal! There was time!",
    "But you closed it and left me behind!",
    "You could have waited. Just a few more seconds and I would have made it.",
    "So you thought to kill me for him.",
    "It's gone. I'm so sorry.",
    "The eggs hatched. Seren and I survived.",
    "The power from Erebus protected me, and...I think they recognised Seren.",
    "She's chosen to stay with the hatchlings. She promised me that she would keep them safe - that she would never let them leave.",
    "The universe is set against them, she said, and they need to stay with her to keep safe. Forever.",
    "We should go back to the Cathedral and tell the others. Vicendithas, Hannibus...",
    "I was going to ask the same of you. Where is everyone?",
    "Kerapac is gone. He sacrificed himself to help us deal with Jas.",
    "The eggs hatched on Iaia.",
    "It was not for nothing.",
    "Wen, Bik, and Ful have hatched their eggs, yes. And Iaia is gone, yes.",
    "But Seren and I witnessed the destruction of Iaia and survived it, and she swore to me that she would remain with them.",
    "Jas and Kerapac followed us to Freneskae. Kerapac betrayed her and helped me banish her to Erebus.",
    "We tried to make Seren hatch the eggs on Freneskae, but she refused, and instead took them to Iaia.",
    "They won't. Seren is convinced the universe is too dangerous for them.",
    "There are too many gods who want them dead, too many forces who would do them harm. So she's going to keep them forever on Iaia, and raise them as her own.",
    "But I didn't save Iaia.",
    "She did, for a while.",
    "Then she betrayed us and left me for dead on Iaia when the Elders arrived. She left to rejoin Zamorak.",
    "Now what will you do?",
    "Fresh air?",
    "You played your part too. If it weren't for your plan to bring the eggs to Senntisten, and your battle with the Arch-Glacor, we would have been finished months ago.",
    "Alone? None of us were alone.",
    "Could it be because you've ascended?",
    "I don't think he's coming back.",
    "I went into Erebus. There's no way he could have survived.",
    "Something I didn't understand. None of it made sense. Reality just...didn't apply.",
    "The edge of a deadly shadow universe. I couldn't survive for long in there. The shadow anima was too overpowering.",
    "In there I found a shadow leviathan, strong enough to overpower Jas. I don't think it was the only one in there.",
    "No. No sign of him, living or dead.",
    "As long as you're happy, I suppose.",
    "I should go to Anachronia to see how Hannibus and Vicendithas are getting on.",
    "Working on another experiment?",
    "No. I lost it.",
    "Yes. Do you need it?",
    "What do you need it for?",
    "I wanted to see how you were doing.",
    "It wasn't your fault.",
    "Do you know what he's making?",
    "How are the Ilujanka settling in?",
    "I'm so sorry about Iaia.",
    "I'm sorry.",
    "What will it do?",
    "Iaia?",
    "How?"
  ],
  "You do not meet the requirements to start": [
    "'Extinction'."
  ],
  "Hebe": [
    "More or less. I heard about the fight and came to help.",
    "I don't believe we've met, World Guardian. Please, call me Hebe. I wish we could meet under better circumstances.",
    "Yes. I've no hope of getting past those TzekHaar, though. I'm no warrior.",
    "We'll stop any TzekHaar from reaching the surface.",
    "I couldn't stay away. I heard how bad it was on this world - I couldn't stand by. I can help and you know it!",
    "A promise made when the universe wasn't falling apart! 'Never stand by when there are those in need.' Isn't that what you taught me, father?"
  ],
  "Seren": [
    "I need you to understand, I had no choice.",
    "In Senntisten, we were making our final stand. The creators of the universe were coming.",
    "My aunts had sent their generals to capture the eggs. If they succeeded, Gielinor would die.",
    "Four gods united against the threat. We kept the eggs from hatching, while our forces faced the armies of the Elders.",
    "Many fought. Many died.",
    "Our defences were failing. Our enemy pushed closer, and closer.",
    "Still, I thought we could find a way avoid extinction.",
    "Keep your distance.",
    "...",
    "Please, do not disturb me.",
    "It's the children.",
    "They're so close - they can feel that something is wrong. I am trying to keep them calm.",
    "Please, do not disturb me.",
    "Don't let him near them.",
    "No! Don't you dare hurt them!",
    "If you so much as scratch them, it will be your death.",
    "...",
    "No.",
    "Begone from here.",
    "You are quite the persistent one, aren't you, World Guardian?",
    "You needn't worry, in any case. My recent exertions have been...draining, to me and to the children. We need to rest a while.",
    "We needed to go somewhere safe.",
    "The war had become too dangerous. I know what the other gods wanted to do to us.",
    "Extinction.",
    "None of them are on our side. They want us all dead.",
    "I was born here. My mother made me in the cradle above these halls. It was my home before I knew what a home was.",
    "I thought I could rest the eggs here a while, so we could all regain some strength.",
    "This was once the perfect world, the birthplace of our mothers. I thought that bringing them here would...make things right, somehow.",
    "A foolish hope.",
    "Even here, we are not safe.",
    "Did you see it?",
    "I thought we'd be safe. It's not meant to be here - it's meant to be far away, where it cannot ever reach us.",
    "Zaros, you fool! What did you do?",
    "It's looking for the eggs...",
    "It's the Shadow Breach.",
    "There are two. The one on Gielinor is contained in the Codex, yes. This one is wild.",
    "In my time on Freneskae, it was far, far away, far beyond my reach and that of my brother.",
    "Shadow flowed through it, and that gave Zaros power, but I never went near it, in the far Shadow Realm, for fear of the horrors that lay within.",
    "You know where the Breaches led to, don't you?",
    "This Breach should not be here. It should never reach us!",
    "How can it find us now? How did it know we are here?",
    "It has to be his doing. I see no other explanation.",
    "He was always exploring the shadows when we were young. Experimenting. Tampering with things he should never touch.",
    "He must have found it...disturbed it...saw what lay beyond.",
    "Whatever he saw, it made him turn back. He must have thought the Codex Breach was safer.",
    "Such a word means nothing to the forces of Erebus. It is a realm of entropy, not life, and it will do nothing but consume and destroy. It mindlessly seeks power, nothing more.",
    "It can feel the eggs - that must be why its mouth opened now, right above us all. There's something on the other side, searching for them.",
    "The Heart of Freneskae protects us from it for now, but I can hear it singing...",
    "Who? What was that?",
    "Leave me be.",
    "Leave me be.",
    "I took them to Freneskae. I thought we would be safe there.",
    "Jas found us. There was nothing we could to do[sic] stop her reclaiming the eggs.",
    "She could kill us all with merely a word.",
    "No power in this universe could stand in her way. I did not expect you to find it in another.",
    "The shadow leviathan struck without warning.",
    "I felt its presence tear into our reality.",
    "It was Kerapac that broke the balance.",
    "Heedless of the terrible pain his defiance earned him, he directed the full force of his artefacts towards their creator.",
    "Its power spent, the Needle broke.",
    "Distracted, Jas was overwhelmed.",
    "The monstrous intruder dragged its prey back into its own realm.",
    "Without the Needle, Kerapac was powerless to avoid the same fate.",
    "Its hunger satisfied, the breach snapped shut, leaving in its place a terrible silence.",
    "Jas was the greatest of us all. Irreplaceable.",
    "Her loss forced me to accept something.",
    "Your survival depends on our deaths.",
    "What have you done?",
    "I felt Jas's arrival. And then she...vanished. I felt it all.",
    "The Shadow Breach...the Broken Needle...",
    "World Guardian - what have you done?",
    "No. They would have no strength. They wouldn't survive hatching.",
    "How can you say such a thing? They are innocent!",
    "No. They are too close to hatching. The only reason they've not done so already is the absence of the Elders.",
    "I've been trying to reassure them all this time...if I were to harm them now, they would panic.",
    "None of you understand, do you? You refuse to understand.",
    "For as long as I've been alive, I've been looking for something. I didn't know what it was - I didn't even know I was searching.",
    "Zaros. Mah. Guthix. The Elves. None of them were enough. Nothing was, until I found these eggs.",
    "Before, I thought my path was the same as the other gods. I was destined to drain their power, or else destroy them. Now I'm not so sure.",
    "The hatchlings speak to me. They are alive. The most alive anything has ever been, and...they know me.",
    "They love me.",
    "You're asking me to kill them.",
    "What are you saying?",
    "Tell me more about Iaia. I've never seen it.",
    "And what about death?",
    "I see.",
    "...",
    "No.",
    "Come no closer.",
    "First I am forced to kill my mother.",
    "Then, my brother betrays me.",
    "Then I am forced to stand by as these eggs - my own innocent family - are bled half to death by petulant false gods.",
    "Do you know how much these children have suffered, World Guardian? How much harm I let come to them?",
    "And now I see your true plan. You intend to massacre us all! Jas, her sisters, their children - all of us!",
    "Be silent! I will make this right.",
    "They will live, and I will make sure of it.",
    "And who gave them this world? Who gave them this right?",
    "Everything in existence owes itself to the Elder Gods. You all owe a debt and someone must repay it!",
    "Life and death. They are the same - I see it now. One is meaningless without the other.",
    "Fair? Just moments ago you stood by while children where[sic] condemned to death. By all natural law, they should live.",
    "But I am not without mercy. I will call the Elders here. They cannot be stopped, but they have a universe to cross. You have that much time.",
    "Save whomever you can. Leave. I will not stop you.",
    "Make one move against the eggs, and I will obliterate you where you stand.",
    "You do not have time to argue. They are coming.",
    "Stay back.",
    "The Elders are close. I am calling them, so they know where we are.",
    "The children are on the brink of hatching - the Elders must be here at that moment, or their memories will be forever lost.",
    "Every moment you waste, they come closer.",
    "No. I cannot. This must happen.",
    "You've been so brave, World Guardian. I see what Guthix saw in you. Your spirit and your hope. Gielinor still needs you.",
    "Do not try to fight me. The Elders hear me sing, and the life of Iaia flows freely into the eggs. They cannot be stopped now.",
    "Stop trying to distract me...",
    "What are you doing?",
    "What have you done?",
    "The eggs...they are slowing...",
    "Stop it! The children can't wait!",
    "So this is how it's to be? Very well.",
    "I warned you. You didn't need to do this.",
    "Go quietly, World Guardian. Please.",
    "Then I promise your death will be swift.",
    "Beware. You face my aspects - united!",
    "You want proof that this is right?",
    "Do you see? Light and dark, fighting for the same cause.",
    "Your judgment is clouded.",
    "Do not throw away your life fighting the inevitable.",
    "Stop!",
    "You must understand, World Guardian. This is inevitable.",
    "You are simply a distraction. You cannot stop me!",
    "Your little trick may be slowing them but their arrival is inevitable.",
    "Then you leave me no choice.",
    "Face the wrath of the muspah...and of Mah!",
    "Is she not glorious?",
    "Look upon her...",
    "The Elders will endure.",
    "Agh! I must regain control...",
    "No... Not again...",
    "Mother! NO!",
    "No more games!",
    "You are nothing but a shadow before the stars.",
    "You flicker, you fade, and you die.",
    "ENOUGH! This ends - now!",
    "Forgive me, Guthix. And forgive me, World Guardian.",
    "I am the scion of the Elders - agent of their will!",
    "Our battle heralds their return!",
    "Their song - it echoes through the universe!",
    "Fire!",
    "They are here.",
    "There was no other outcome. For what it is worth... I am sorry.",
    "Run.",
    "So you see, I had no choice.",
    "For my family to survive, a world had to die.",
    "They reached down from the sky, the hands of creation itself, to birth their waiting children.",
    "As they touched the eggs, memories passed from one generation to the next. Aeons of identity, stretching back through time.",
    "The eggs burst open.",
    "As the lifeless bodies of the adults fell, the power of the newborn children drained all life from the planet. All life.",
    "The children. My family. At last, they live.",
    "They know me. They love me. They spared me.",
    "They have fulfilled their birthright. All other life on Iaia is gone.",
    "But you...survived.",
    "How?",
    "No. You survived.",
    "We are safe here, on the threshold of your mind. The real world beyond is a frozen moment in time. The children cannot harm you.",
    "You survived. How could you survive?",
    "Could it be...",
    "Ah.",
    "I see it now. Your shadowed soul.",
    "Is that what Guthix gave you? Is that what makes you immune? He couldn't have known...",
    "Perhaps he did. Perhaps he knew it was a possibility - that you would face the Great Revision. He knew it was coming. He knew you would need a shield.",
    "It is how you survived Erebus, after all. A mortal soul could never withstand walking on its shores as you did.",
    "But you withstood it, taking in its power...becoming stronger.",
    "So when the children tasted it, they recoiled. So you were spared, as they spared me.",
    "Your gift. Guthix's protection. Is it...gone?",
    "Who is that? Those...voices? I recognise them...",
    "How curious. Do you know what they are?",
    "Whatever Guthix did to you, those are the faces of it, it seems.",
    "No. Not him. They are something else. Something more.",
    "It's all right now. It's over.",
    "The children...they live. They live. And they love me, unafflicted by my aura. What wonders they are.",
    "Oh, these poor newborns. Forced into existence on the wrong world.",
    "Gielinor was destined to be their home. Born there, they would have had the strength to strike out into the universe.",
    "Here though...Iaia was enough for them to hatch, but beyond that...they are weak.",
    "And now I know what threats lie in the darkness of the universe. Shadow beasts, capable of destroying the strongest of my kind.",
    "If you call a leviathan through the Breach again, and come to find us...",
    "I ought to thank you. You've shown me how dangerous this universe can be.",
    "I can't let them leave this planet, not when the dangers of Erebus lie so close.",
    "No. I won't allow it. They have to stay here. It's the only way I can keep them safe.",
    "I must. This universe wants my children dead. I have to protect them.",
    "Is this acceptable to you, World Guardian? Or will you have them killed, like Jas?",
    "Escape? Why should they want to escape? I will raise them as my own. They are lost, and weak, and frightened. They need me, and always will.",
    "Leave us, World Guardian, and never return.",
    "Threaten my family again and I will end you. Stay away, and we shall have peace.",
    "Now begone.",
    "If fate is kind, we shall not meet again."
  ],
  "TzekHaar remaining": [
    "[number]"
  ],
  "Armadyl": [
    "World Guardian! Just who we need. The TzekHaar - you found a way through them?",
    "Good. I hope you kept your strength. You're going to need it.",
    "Indeed. Though I am surprised to see your companions. Moia? And...who is this?",
    "Thank you, Adrasteia.",
    "What say you, World Guardian? Can we trust her?",
    "She's right. We can't let ideological differences divide us now - not with the Elders so close to victory.",
    "Any Zamorakian willing to defy their master deserves a chance, in my eye.",
    "We've strengthened the wards as best we can and reinforced the doors. All our forces have been called back as far as possible.",
    "I'm not sure how long we can keep it up.",
    "We were hoping to buy enough time to formulate a new plan. Unfortunately, time is in short supply.",
    "Lady Seren?",
    "Moia - you are best placed on the western front. Zilyana and Nex could do with some extra firepower against the Nodon cannons.",
    "Good luck, all. Be strong. We can't afford to fall now.",
    "Keep going, we can't afford to fall now.",
    "What do we do?",
    "But we can't stop draining the eggs!",
    "What do you mean?",
    "Oh. The eggs.",
    "They won't suffer. It will be a quick end, I promise. Painless.",
    "World Guardian!",
    "Croesus has been properly incinerated. I made sure of it. That is a horror we will never have to face again.",
    "Did we win?",
    "So it was all for nothing. A world still died, and the new generation of Elders is coming for us.",
    "How long until the hatchlings outgrow their nursery?",
    "He must be planning something.",
    "You saved us all. I don't know what I can say.",
    "'Thank you' doesn't seem nearly enough, but it's a start.",
    "Each of us owes you the debt of our lives and I, for one, will never forget that for as long as I live.",
    "I need to return to Prifddinas. Seren may be gone, but I will honour the alliance we forged. Her elves will need my help.",
    "Farewell."
  ],
  "Saradomin": [
    "The four fronts are under heavy attack, and we have been attempting to coordinate a response.",
    "Someone who should know better.",
    "You made me a promise.",
    "...",
    "Allow me to present my daughter, Adrasteia.",
    "Yes. My daughter. Who should be safe - on Hallow.",
    "The front lines are no place for you. If anything were to happen to you-",
    "Hmph. I see some divine beings are worthy of your respect, then.",
    "We have more important matters to discuss.",
    "Moia, general of Zamorak. Why should we not kill you where you stand, traitor?",
    "Your master abandoned us to die for the sake of his own pride. His forces have scattered and now we face a dire threat without him. Do not try my patience.",
    "Why are you here?",
    "Our defence is weakened without Zamorak and his forces. After he cost us the Eye of Het, and without his necromancers, we have nothing to stem our losses.",
    "Unstable. With only three of us draining their anima, we can no longer prevent them from hatching. We're merely delaying it.",
    "He is holding back the Arch-Glacor. Without Zamorakian support, that front has nearly collapsed and requires his full strength.",
    "Indeed. Gorvek, on the Croesus Front, is in most need of support right now.",
    "Adrasteia - the wounded...",
    "I've opened the eastern gate. Go and help - they're being overwhelmed by that vile fungus.",
    "Go now - help the eastern front. They're being overrun by that vile fungus.",
    "Good job, Player.",
    "Azzanadra needs your help. The southern front is being overrun by glacytes.",
    "The glacytes are forming on top of the aqueduct at a terrifying rate.",
    "We need to stop them before we are overrun!",
    "You must be quick, Player.",
    "If the glacytes keep forming top of that aqueduct, Azzanadra will be overrun and they'll breach the Cathedral.",
    "The western side of the Cathedral is under heavy bombardment.",
    "Under such a ferocious onslaught, the Cathedral wont[sic] hold for long.",
    "The siege engines must be destroyed, and Nex and Decarte have enjoyed little success so far. Please, Player - help them.",
    "Get to the western front! Those siege engines must be destroyed before they bring down the roof!",
    "What is that?",
    "Hold. He is merely a demigod - we can defeat him.",
    "World Guardian! Delay him! Armadyl, we have no more time. We must act.",
    "We won't get another chance.",
    "Seren, turn away. You don't have to witness this.",
    "Stand aside.",
    "Don't hesitate! Find her! She's the only thing standing between the Elders and our destruction. You cannot let that happen!",
    "We will handle Zuk, and make sure the Elders' forces are confined to the city.",
    "GO!",
    "The fighting ceased here some time ago.",
    "Once Seren relieved us of the eggs, Armadyl and I were free to finally engage in the fight.",
    "With all the anima we've siphoned lately...it was over quickly.",
    "Zuk has returned to the Kiln. If he has any sense, he will stay there.",
    "And Kerapac... Well, he was nowhere to be found.",
    "He and the Needle were both gone by the time we reached the Colosseum. To chase you, I suspect, World Guardian.",
    "We tried to warn you but had no way of reaching you.",
    "World Guardian... We're all anxious to know what happened.",
    "Well, now.",
    "If only she'd come to that realisation before all this bloodshed.",
    "It seems you've earned your title, World Guardian. Whatever Guthix saw in you, whatever power he gave you...I believe he made the right choice.",
    "Hardly surprising.",
    "No doubt he is. He knows we are at a nadir. Our troops are exhausted and in dire need of peace.",
    "Nevertheless, his own forces were as weakened as ours. Whatever he is planning, we will have time to meet it.",
    "Come, Adrasteia. We should return to Falador and oversee the recovery efforts."
  ],
  "Adrasteia": [
    "If Gielinor falls, I won't be safe anywhere.",
    "Have a little more faith in me, please. I know the dangers. This isn't some wilful little adventure. I'm here to help in any way I can.",
    "Lord Armadyl. Lady Seren. It's such an honour to finally be in your presence.",
    "You will always have my respect, father.",
    "So these are the eggs of the Elder Gods. I read about them, but...",
    "I suppose they are unborn creator gods, are they not? No wonder you can feel their power.",
    "Oh. Of course.",
    "Father, please!",
    "I can vouch for her. She defended me from the TzekHaar, and she's telling the truth.",
    "I'll see to them.",
    "I am, yes.",
    "And you are Gielinor's World Guardian! It's wonderful to finally meet you. I've read so much about you.",
    "I missed seeing the developments first-hand. I promised my father that I would stay on Hallow - he said I would be safe there.",
    "I kept abreast of the war's developments as best I could from a distance. If you like, I can tell you what I know.",
    "After the eggs were brought here, the Elder God Jas sent her general, Kerapac, and an army of Nodon dragonkin to reclaim them.",
    "The Nodon were architects in their past lives, engineers and craftspeople, but now they are unwilling soldiers. Jas enslaved Kerapac for this purpose and he is controlling the Nodon. Such an awful fate.",
    "Their race has already survived one Elder God hatching - the one that caused the last revision of the universe. I hope we can find a way to stop it happening again.",
    "The glacors arrived after the Nodon. These are implacable ice creatures from the plane of Leng.",
    "The Elder God Wen brought them here, led by a massive Arch-Glacor, though I wonder if such a creature can truly lead. If it thinks, it doesn't think in any way we can recognise.",
    "How does one turn back something so alien? How could it be reasoned with?",
    "Azzanadra holds it at the aqueduct for now, but if he falters, then it will plunge Gielinor into an eternal winter.",
    "I've seen the night-winter of Hallow. A whole year without sun or warmth - I've seen what cruelties that can bring. And yet it pales in comparison to the Arch-Glacor's power.",
    "Oh, this one is a true horror. When I first heard of it I didn't believe the reports.",
    "A fungus creature, not alive, and therefore unkillable? It sounds like something from an Icyene fable - some parable decrying mortal hubris.",
    "And yet, I was wrong.",
    "It's a biological weapon. The Zarosian empire created it many ages ago, and were said to have destroyed it. The Elder God Bik revived it.",
    "When it awoke it wiped out every defender on the eastern front, growing stronger for every living body it ate. It cannot be killed in the normal sense. It can, however, be rendered dormant by those with the necessary skills.",
    "Our defence is led by the dragon Gorvek. His fire and the courage of adventurers brave enough to venture into the graveyard hold it back.",
    "The most recent incursion, sent by the Elder God Ful.",
    "Her soldiers were once TokHaar. They were made in the Elder Kiln to build planets, including this one.",
    "After the Battle of the Monolith, however - where they were defeated by my father's forces - she sent them back to the Kiln, where they were remade as the TzekHaar.",
    "They are led by a demigod, TzKal-Zuk. A human demigod, it must be said. One who can think, and is here because he wants to be.",
    "He's here for the conflict and nothing more, but there must be something we can do to make him change his mind. There has to be.",
    "Good luck in the fight.",
    "We made it out!",
    "How?",
    "They're her family, aren't they?",
    "Surely we can fix this without harming them. There must be a way.",
    "I'll go with you.",
    "We have a common enemy, World Guardian. We will work together on this.",
    "It's me. Everything all right?",
    "Of course. We'll be there soon.",
    "I am Adrasteia. I'm here on behalf of Saradomin. This is Moia.",
    "Perfect.",
    "It's beautiful.",
    "Here, World Guardian. Take a look at this crystal.",
    "If everyone did everything for me, how would I learn anything? It's nice to be able to get my hands dirty for a change.",
    "Back on Hallow, everyone was too worried to let me experience the mess of life. But I always like to. I love learning about agriculture, but how can I advise people on it if I don't till the soil and plant the seeds?",
    "How can I advise on labour disputes, unless I've rolled up my sleeves and done a good day's work? I want to help, and if that means getting a little messy I'm happy with that.",
    "Would she go somewhere important to her do you think? Somewhere with memories?",
    "If so, I wonder if Naragun would be an option.",
    "It was Guthix's world.",
    "I've read about Guthix and his relationship with Seren. The two of them were close, more than just friends. Naragun would be a place filled with reminders of him.",
    "He didn't destroy this world. It was Tuska and Skargaroth that did the damage.",
    "It's so quiet and still. A whole world reduced to nothing more than a tomb.",
    "Not by choice, no. My father came to this world once in search of an elder artefact. His crown allowed him to trace powerful sources of anima, which led him here.",
    "Once he was here, a terrible creature hunted him down from across the stars. A brutal thing. All rage, hunger and destruction.",
    "My father fought the beast. He hurled lightning and unleashed divine fury on the creature as his icyene warriors struck at it from all sides. But Tuska was huge and her skin harder than any metal.",
    "As valiant icyene fell to her claws, my father had no choice to save whom he could and to retreat from that world before too many brave icyene were lost.",
    "He had hoped that Tuska would follow him, but then the hunter Skargaroth arrived and it was all too late.",
    "Well, I forgive you, for what it's worth.",
    "Still nothing. I would have sworn she'd have come here. Find solace in the memories of the only person who ever really understood her.",
    "Maybe Seren took them somewhere that already resonated with Elder God energy. Somewhere that a previous egg was placed.",
    "Precisely!",
    "We can start by getting under cover before we all choke to death.",
    "I've never seen such a bleak world.",
    "What happened to it?",
    "I see.",
    "But why come here?",
    "What is that?",
    "You should go back to the cradle. The others need your help here.",
    "How? You were only gone for a few minutes.",
    "And Kerapac?",
    "Maybe that's for the best. Maybe we should let nature run its course here, and let it end.",
    "Let her. Don't rush this.",
    "This isn't fair!",
    "Hannibus?",
    "Don't be so cruel!",
    "Ready?",
    "We can help. If you all come together, we can get you through the World Gate. Nobody needs to be left behind.",
    "You don't need to die! Please - let us help you.",
    "How can you be so cold?",
    "Other villages?",
    "I can't believe some want to stay. Nothing I can say convinces them otherwise.",
    "Vindicta showed me the map. We can go there when we're ready.",
    "There aren't many settlements on Iaia, and they're in walking distance, but we should hurry anyway.",
    "What's that?",
    "How?",
    "Be strong, World Guardian.",
    "Player! We're done! Come on!",
    "Player! You're alive!",
    "Moia? Can you explain yourself?",
    "What are you talking about?",
    "Is that all this was? Some assassination attempt?",
    "How could you? After everything they did - they saved us all!",
    "He would never do such a thing! You will answer for this.",
    "Oh, I should have seen that coming. How could she? That - that -",
    "We saved as many as we could.",
    "What about Seren? If the eggs hatched... How long until they reach the next world?",
    "She's...not going to let them leave Iaia?",
    "And she gets her family, at last, and forever.",
    "We saved as many as we could. Some chose to stay behind, though.",
    "And we couldn't stop Seren...",
    "You defended the Cathedral for as long as you could. You saved us from Jas. You fought Seren until Iaia's evacuation was complete.",
    "None of us would be alive if not for you.",
    "Yes, father.",
    "Thank you, World Guardian. For everything. I hope to soon see you again."
  ],
  "Hannibus": [
    "World Guardian - you're here! We may yet survive this, after all.",
    "Patches of mutated fungus have formed in the graveyard. They're accelerating Croesus's growth to the point where we can't keep up. Poor Gorvek is exhausted.",
    "Now what do we do?",
    "We're all doomed.",
    "Could she do that, on her own? Didn't she need the help of three other gods to manage it in Senntisten?",
    "I'm not certain she would allow that.",
    "Even if we find a way to do that - and I doubt there is one - I fear you would have to get past Seren first.",
    "Indeed.",
    "And there are hundreds of worlds she could have gone to!",
    "I believe I may know something that can help. The eggs are anima sources, correct? Like the Stone of Jas?",
    "Before I left Anachronia to join the fight, I heard that Vicendithas was working on something to do with anima. A collaboration with Charos, I believe.",
    "He believes it might be the key in his quest to help my people, the Ilujanka, survive. He said he needed a diviner...something to measure the anima of a world. If he was successful, it might help us find the eggs.",
    "Forgive my ignorance, but the Locator is...?",
    "You left it behind on Anachronia, Player. Mr Mordaut has been safekeeping it for you.",
    "I have attempted to, yes. The matter of my people's survival is something dear to me.",
    "When I heard that Vicendithas was continuing his father's work trying to save us...I thought my experience would help.",
    "Instead, I found myself merely intruding.",
    "I knew Kerapac, if only briefly. I had some insight into his work. I, ah, misjudged my approach, though. There are depths of feeling at play I had not anticipated. I thought-",
    "My apologies.",
    "Kerapac is not acting of his own will. You cannot blame him for this.",
    "That is true, but-",
    "It's nothing. I offered my concern, and it was not welcomed. Quite understandable, really. Like he said - his family is not my business.",
    "Let's not speak of it here.",
    "You should contact Moia with that device and let her know what we've found.",
    "Don't worry, I picked it up.",
    "However, you don't appear to have space in your inventory.",
    "You should use it to contact the others.",
    "You should use Moia's communication device to contact the others.",
    "I'll help too. I will meet you there.",
    "We should go to the World Gate to meet the others.",
    "So this is the world of the elves? The colours remind me of my own home, Iaia. Vibrant and full of wonder.",
    "Must you be so cold?",
    "Regardless, this world is magnificent to behold.",
    "Have you tried speaking with him yet?",
    "He's your father! I only just recently learned that I have a child, a fully grown daughter. I've known her barely any time at all, yet she is already the most important thing in my world.",
    "Your father must feel the same, deep down.",
    "Kerapac, please! You can't want the Elder Gods to hatch and destroy us all.",
    "What about Kerapac? What if he finds us again?",
    "Is Moia right? Is this Saradomin's work?",
    "Tuska. I see.",
    "I've faced overwhelming battles and been forced to retreat. I've been forced to leave people behind - good soldiers. It never gets easier and no one ever forgives you.",
    "It's worth a lot. Thank you.",
    "Vicendithas...",
    "Kerapac. We were friends once, I think. You can't want this.",
    "*cough* *cough* This...air...",
    "I feel it. World Guardian, can't you?",
    "I didn't say anything.",
    "Peace, Lady Seren. Peace. We'll find a way to fix this. You mentioned Zaros?",
    "You should go back to the cradle. Kerapac and the others are waiting.",
    "Player? What happened? We heard a disturbance, and I thought to come up and help...",
    "Are you all right?",
    "Kerapac! What happened to you?",
    "Wait.",
    "I know it isn't my place, but I need to say something, one father to another. Don't you have something to say to Vicendithas?",
    "An apology, perhaps? You haven't been the best father to him. Now might be your only chance to make amends.",
    "Hatred, rage, and revenge. See what comes of it?",
    "Nothing but tragedy.",
    "We should go back to the halls. I left Adrasteia with Seren - we ought to see how they are.",
    "Peace, Moia. Family is sacred.",
    "Seren - I understand. You would do anything to keep them from harm, wouldn't you?",
    "I know that feeling. I know its power, and how it can lead us to make...poor choices.",
    "You've lived for so long, Seren. You've seen so much life, joy, beauty. So many families with as much right to life as your own.",
    "We can help you. We won't let them suffer.",
    "On Iaia, we believe a painless, merciful death is a gift, given out of love. Those who pass peacefully with their family by their side are blessed above all others. It's something to be embraced.",
    "Bring the eggs to Iaia. Not to hatch - but to pass, with you watching over them.",
    "This tomb of a world is no place for it. On Iaia, though, we can give them the proper rites. A gift from my people to yours.",
    "You can let them go peacefully, and save us all.",
    "It will be quick. They won't suffer, I can promise you that.",
    "Of course.",
    "It is a wondrous world. Although there aren't many of my people left - only a few villages - it is beautiful. There is no better place on which to live out our days.",
    "We have everything we need. Food from the land and water, the freshest rain you could ever feel, a kind sun, to be enjoyed from the shade of the trees. More than that, we have peace.",
    "I have seen so much war in my time. To know that my home is safe...that is a great comfort.",
    "It is the most natural part of life. Without it, life is meaningless.",
    "So will you let us help? We can end this now. You don't have to face it alone.",
    "What?",
    "No - that's not what I meant...",
    "No!",
    "Lady Seren - please - take anything you wish - my own life - anything - but spare my home.",
    "Everything we are and ever will be belongs here. Without it we are nothing.",
    "...",
    "This is all my fault. I tried to help her and this is where it led.",
    "I'll take you to the Elder.",
    "Elder Chahoua. Vindicta. I'm...sorry.",
    "There has been a war on another world and it has spread here. The goddess beyond wishes to hatch those eggs. If she does, Iaia will die.",
    "We tried to delay her, or thwart her path, but...fate is implacable.",
    "Oldest One, we need to go. There is no time for debate. We have to leave, now.",
    "I concur.",
    "The End comes about when there is no way out. That is what is written, is it not?",
    "It is something gradual. Gentle. Not this...annihilation at the hands of a god.",
    "Here, right now, we have allies who wish to help and a gate to a new home. We have a way out. This is not the end.",
    "Thank you for your help, Player. At least this way, some of us will live.",
    "We will go to the next village to continue the evacuation. Give us all the time you can.",
    "But the gate closed.",
    "The rune...cracked.",
    "Which means that Iaia...",
    "Player? Please - I have to know. What happened on Iaia?",
    "Gone...",
    "Leave me. Just...leave me.",
    "It all unraveled, as it was destined to, and all by my hand.",
    "Here. I managed to grab it before we left Iaia.",
    "Vicendithas wanted to talk to you, should you drop by.",
    "I am alive. I breathe and feel, though knowing what I did to Iaia...I wonder if I deserve even that.",
    "You are kind, Player. I will always be grateful for how you tried to save us.",
    "I was the one who put the idea in her head. I brought the End of Days to my home.",
    "...",
    "Leave me, please.",
    "I'm afraid not.",
    "As well as could be expected. Anachronia suits them. They have a future here, along with the other pioneers.",
    "I hoped to die there one day. I'm so old, Player. One day it will overcome me.",
    "I hoped I would take my last breaths under the red moon of Akash, and be buried by the tree my father planted when I hatched. I ought to have returned to the Olun'dai, but now not even that remains.",
    "The remains of my people mourn too. I am not alone in that. But they are looking to the future, my daughter among them, and I...can't.",
    "I counsel against hate and yet I hate that this world has kept turning. Survival is victory, is it not? Yet how dare I survive, when everything that matters is gone?",
    "You did everything you could. I do not blame you. This is all because of me.",
    "I don't expect you to understand.",
    "Very well.",
    "Vicendithas...what is this?",
    "It's not real, is it?",
    "Why did you do this?",
    "Wrong?",
    "No - Vicendithas - this is a wonder. We can rebuild here.",
    "Not much - but enough to maintain our traditions. To keep the Olun'dai flowing.",
    "I must tell the others. And you, Vicendithas, as an elder of my people I can offer you this in return.",
    "You will always have a place among us as our brother and our son, should you wish it.",
    "Whyever not? Your work has given us a future twice over.",
    "First you took Kerapac's efforts and saw them through to the end.",
    "Work that you finished, after he gave up.",
    "And now we have this, a place to keep our history alive...because of you!",
    "How can I not attempt to recognise that?",
    "Besides, even if you hadn't succeeded, even if we had nothing - you deserve a family as much as any of us.",
    "Come, both of you. We have much to rebuild.",
    "Some of my people are building within the dream. Please assist them if you can.",
    "Any resources you can spare from your Anachronia base camp will be welcome.",
    "In return, we can offer you knowledge in different skills, following our own traditions.",
    "You will always be welcome, World Guardian."
  ],
  "Gorvek": [
    "We are being pushed back. Croesus's slow creep forward is becoming...insurmountable.",
    "If you can get in there and remove them, we should be able to hold.",
    "You're back. You were succumbing to Croesus's fungus, so I pulled you out.",
    "Be careful, World Guardian.",
    "One down, three to go!",
    "That's another cleared. Croesus is getting weaker!",
    "Only one more to go, Player!",
    "Player, you've managed it. It looks like Croesus is dormant. The rest of its fungus is weakening!",
    "Thank you, World Guardian! Once again, you have saved us. No doubt the other fronts need your help now, though.",
    "Please - go and assist the others. Saradomin will tell you who needs the most help.",
    "World Guardian! You've done enough - the fungus has retreated.",
    "The Glacor Front is nearly overrun - speak with Saradomin! I will take over here."
  ],
  "Helwyr": [
    "Azzanadra needs your help! He's holding back the Arch-Glacor alone.",
    "Be careful. The glacytes have grown more numerous, and more keep coming.",
    "Find Azzanadra and see what he needs you to do.",
    "There's no point in you killing the glacytes, they'll just regenerate. Focus on finding a way onto the aqueduct.",
    "You don't need to kill anymore, Player. We can handle it from here.",
    "Thank you, World Guardian. Now get back to Saradomin to see where you're needed."
  ],
  "The Raptor": [
    "Get in there."
  ],
  "Azzanadra": [
    "I hoped I might see you, World Guardian.",
    "Enakhra, the coward, deserted us. Without her the defence collapsed. I ordered them to retreat before they lost their lives.",
    "The Arch-Glacor I can just about handle, even without the mages, but it takes my full attention. This outpouring of glacytes must be stopped.",
    "The glacytes are forming on top of the aqueduct. The portal to reach the aqueduct still functions, but the Arch-Glacor's proximity interferes with it.",
    "Light the braziers to weaken the Arch-Glacor's influence. When the portal activates, use it, and it will take you to the source of the glacytes.",
    "You may need to experiment with different combinations of braziers to reach all parts of the aqueduct.",
    "Find out what's creating the glacytes and kill it. Then, maybe we'll stand a chance.",
    "That looks to have done something. The portal has changed colour.",
    "That's it! If you can clear out the others we should stand a chance!",
    "They're slowing down more. Keep going!",
    "If you can stop that last one, we should be able to hold the front!",
    "Fantastic, the reproduction has nearly stopped entirely! Thank you, Player.",
    "You've done it! We can hold it from here. Thank you, World Guardian.",
    "The pressure is building at other fronts. Get back to the cathedral and speak with Saradomin.",
    "That will do. I have some space to breathe, at least. Should it strike again, I will be able to hold it.",
    "I hear cannons of the western front - their attacks grow ever more fierce.",
    "Go speak with Saradomin. The western defenders will likely need your assistance.",
    "What happened?",
    "The Arch-Glacor was banished back through its portal. It can live out its days on Leng.",
    "Deal with Jas?",
    "The dragon rider homeworld? Did any of the Ilujanka survive?",
    "What of Jas?",
    "...",
    "Where's Moia? Did she help?",
    "After so long in this cavern, I'm in sore need of some clean air.",
    "Will you join me at the surface, World Guardian?",
    "How I missed this.",
    "Peace.",
    "Such a small miracle. I feared I would never witness it, as a god. I ascended at the start of a war, and I wondered whether I would survive to see the end of it.",
    "Yet somehow, we all survived, thanks to you.",
    "I suppose you are correct. I find it quite remarkable that we forced our way through such strife alone.",
    "That's not quite what I meant.",
    "Throughout all those long weeks battling the Arch-Glacor, I had time to consider many things.",
    "Not least how my lord...how Zaros...left us.",
    "How he left me.",
    "'Do as you wish.' That was his last command.",
    "Well, I knew what I wished and I prayed for his return a thousand times or more, just as I did after his first banishment.",
    "Back then, I knew one day he would return. I could feel it. That knowledge sustained me through the war, my imprisonment, and everything since.",
    "This time...it feels different.",
    "I've been looking for that certainty ever since he left through the Monolith. But it's not there.",
    "Possibly. I have noticed other similar changes. My innate sense of my fellow Mahjarrat has dulled somewhat. Perhaps this is similar.",
    "You couldn't possibly know that. I will not give up my faith. I must stand strong for those who remain.",
    "You...entered Erebus? What did you see?",
    "Did you find Zaros in there?",
    "Then there is still hope.",
    "I have no answers, and no certainty. But - I will not despair. This is the greatest lesson he could choose to teach me.",
    "He chose to stand by so we might face this threat without him. It was by his design, and we grew stronger for it.",
    "He left me alone to face the Monolith's gift. And so, by his design, I learned to find humility in power, and for that I am grateful. It's a lesson the false gods of this world will never learn.",
    "Zaros, in his wisdom, has forsaken me.",
    "I am content with my place. I would never ask for anything more.",
    "Were these still the days of the Empire I would grant you a triumph, World Guardian. Your name would ring throughout Senntisten, and you and your kin would never want for anything for the rest of your lives.",
    "As it is...be content with the knowledge that you saved us all.",
    "I have a reward for you, but you do not have enough space to carry it. Clear four spaces in your backpack and I will give it to you.",
    "Be well. Enjoy the small miracles of this world, Guardian.",
    "They now survive because of you."
  ],
  "Kenton Decarte": [
    "Be cautious, adventurer. You must survive this."
  ],
  "Commander Zilyana": [
    "World Guardian - about time. The Nodon have arrayed their full force of siege engines!",
    "Under a barrage like this, the cathedral will not stand for long.",
    "Kenton Decarte ordered one of the siege engines to be moved up here to aid in our defence.",
    "It should be - but it needs someone to operate it. Nex and I are occupied with defending it.",
    "Be quick, Player. The roof won't hold for long.",
    "Quickly, Player! Destroy the siege engines!",
    "The roof won't hold for long.",
    "World Guardian! Zuk has arrived! Get to the cathedral. NOW!"
  ],
  "Nex": [
    "Player, we need your help to destroy the cannons.",
    "And we can't trust that Zamorakian traitor with such a powerful weapon.",
    "Ignore Kerapac! Get rid of the cannons again.",
    "He can't keep this up. Keep attacking!",
    "Clear them again! We can't give up.",
    "Ignore him! We need to destroy the remaining engines. They can still collapse the roof.",
    "Quickly, Player! Destroy the siege engines!",
    "The roof won't hold for long."
  ],
  "Nodon grunt": [
    "Die!",
    "Face our wrath!",
    "FIRE!",
    "On my command!",
    "SHOOT!",
    "Vor!",
    "Yield!",
    "You will fall!",
    "You will not win this battle.",
    "Your efforts are futile."
  ],
  "Kerapac, the bound": [
    "You haven't done anything.",
    "The siege will continue until the Cathedral falls.",
    "Lets[sic] see about that.",
    "Continue the siege!",
    "Enough!",
    "It's over. The cathedral is going to fall. Without the control of time, you can no longer stop it.",
    "Do as you will, Player. I have done what was required of me.",
    "A pity.",
    "A pointless gesture. You can no more harm me than you could avoid me.",
    "The World Guardian knows the futility of this battle. Should you defeat me, I rise again unharmed.",
    "In the unlikely event you defeat me, I rise again unharmed.",
    "So let us avoid this pointless grandstanding. I am here for the eggs. Jas has sent me for them. Return them to me and I will not kill everyone here.",
    "You cannot hide her from me for long.",
    "What I want does not matter. The World Guardian saw to that. I serve the Roakin now, whether I want to or not and believe me I do not.",
    "I have fought against the Roakin for millennia, my every waking moment has been to try and free my people from their tyranny. But because one world matters to you more than all others, I am once more in chains.",
    "If my plan had worked, World Guardian, then you would not be dealing with the Roakin now. You would not be watching the final days of your universe.",
    "You could have left one world and visited countless others. But now you will watch as one by one the stars go out and everything you know and love is destroyed.",
    "I won't pity you.",
    "Will I? Will she let me? Or am I more useful a tool alive? The difference between you and me, World Guardian, is that I do not fear death. I welcome it.",
    "But enough of this. You have been a thorn in my side for far too long World Guardian, it's time I removed you. I will find Seren, but before I do I shall enjoy killing you.",
    "Am I meant to be concerned?",
    "This is pointless.",
    "You cannot harm me.",
    "Did you really think those pathetic creatures could kill me?",
    "Oh be quiet, child. Your sniping serves no value other than to irritate. Much like the rest of your pathetic existence. Where is Seren? Where are the eggs?",
    "No. I have no love for the Elder Gods and no desire to see their plan come to fruition. But as Vicendithas so succinctly put, my will is not my own.",
    "Then I would crush the eggs beneath my feet. I would turn the full power of the Needle on Jas herself, even if it would see me destroyed.",
    "But there is no room in my life for fantasy. Her will must be done.",
    "You really thought you could just outrun me?",
    "No matter where you run. No matter how far you go. I will find you. I will be there. The Needle's power lets me rework time itself.",
    "Perhaps. But what good is that when all I have are moments of free will, before her will seizes me.",
    "You stand no chance against me, what chance do you think you stand against one of the creators of the universe? Even her voice would destroy you. One word and you would be killed instantly.",
    "Why would I delay her?",
    "There is enough hate in me for the both of you. But if I only had the opportunity to slay one of you, it would be her.",
    "You are crueler than I thought, Player, wounding me with hope. But I have nothing else.",
    "I cannot abandon my search, but I can drag my heels on this world for a time longer. It won't give you long to find a solution. But it's more time than you would have otherwise.",
    "Be sure, World Guardian, I don't do this for you. I do this for me. For a chance at vengeance, however small, however slight, against the Roakin. Know that I would die a thousand times over just to see her hurt.",
    "Go, make your plans. I will follow in time.",
    "As much as I was able. So... Seren came home. Where is she?",
    "Is this portal your doing, World Guardian?",
    "Curious. This is pure shadow anima.",
    "I've worked with shadow anima before, boy. I know all too well what it can do.",
    "Jas approaches. Quickly, now. Do you have a plan?",
    "She would never fall for such an obvious trap.",
    "Such a trap would not work indefinitely. The Needle is of the Elders' creation. It will not hold her forever.",
    "Ludicrous. The Needle is not a weapon.",
    "I should have known better than to leave this to you.",
    "She is coming.",
    "I...I defied her.",
    "She gave me no orders about what to do once she had found the eggs. So I used the Needle against her.",
    "We are now a few minutes prior to her arrival. The Needle suffers under such a strain. I cannot ask it to defy its creators indefinitely, but I have given you time, World Guardian.",
    "Jas will return, inevitably, but she is delayed. Don't waste a moment.",
    "No. There's nothing strong enough to harm her - in this universe, anyway.",
    "The portal. It goes to the source of all shadow anima - I can tell. I've never felt it in such intensity.",
    "It is poisonous to her, just as it is to us. Your companions are already suffering its effects, stoic as they are about it. It burns the edges of their souls, the most pure and perfect of all corruptions.",
    "But you, World Guardian - you don't feel a thing.",
    "What are you, World Guardian? What shadow-souled monstrosity could survive this onslaught?",
    "I am bound to the Needle. While it remains whole, I live, but you have no such power.",
    "You stand there on the brink of Erebus like it means nothing! Like it's not even touching you!",
    "What ARE you?",
    "She's almost here. I can turn back time again when she arrives to keep her at bay, but I don't know how many more times I can repeat such an act.",
    "World Guardian - whatever you are - move swiftly. We can't touch Jas. The forces of Erebus can.",
    "Go through the portal. Find something: a weapon, an ally, a beast... Anything that will poison her. Then bring it here, so we might end her tyranny for good.",
    "Hurry. Before she kills us all.",
    "You are using the extra time Erebus offers. Do you wish to stop?",
    "You're not using the extra time Erebus offers. Do you wish to?",
    "You came close to death inside. By rewinding time, I brought you back, but the Needle is breaking.",
    "Did you find anything that might help us?",
    "You enter the dread realm of Erebus, progenitor of shadow anima itself, and merely complain of not being able to run.",
    "What I wouldn't give for that power, World Guardian.",
    "Keep going. Navigating Erebus will become easier once you have attuned yourself to it.",
    "Now get back in there and find something that will drive Jas away.",
    "Good. Use them where you can.",
    "Then find a way to make them open.",
    "Such essences will have power. See if you can find a way to use them.",
    "Thus revealing new paths for traversal, I'm sure.",
    "There may be other kinds of souls in there. Their power may give different effects.",
    "So you have. See if you can discover what it does.",
    "I wonder, could those souls survive outside Erebus? Could you bring them into this world?",
    "It could work to our advantage if they could.",
    "What is that you're carrying?",
    "Hm. Interesting. It may prove useful. Keep a hold of it.",
    "You return with yet more curiosities.",
    "How strange that it should survive with its body destroyed.",
    "Diviners know the power of memories. Find a way to put it to use.",
    "Then be faster. Try again.",
    "You should try activating that fissure again. It must be the right path.",
    "Were you successful?"
  ],
  "Kerapac": [
    "Give up, World Guardian!",
    "You're wasting your time!",
    "You can't stop this!"
  ],
  "[Commander Zilyana/Nex]": [
    "Quickly - get into the Cathedral!"
  ],
  "Shadow voice": [
    "Ah, yes, threatening the first daughter of Mah. No way that could go wrong, hm?",
    "He would have warned them about her already. They'd be waiting, if she arrived.",
    "Oh, please. That frozen waste has no value to her.",
    "If only someone hadn't run off with it through a sinister portal.",
    "It's delicious.",
    "Stick your hand in, Player. Taste it. Al that deep, deep, shadow...",
    "And won't that feel just wonderful! Listen to it, World Guardian. Listen to that song...",
    "HA! How perfect. I see what we have to do.",
    "There's a furious Elder God on our tail. One that we need to get rid of.",
    "And if there's something in there looking for power to consume...we can give it the biggest meal of its life.",
    "Wow! It's so much more beautiful than I imagined.",
    "You might die a painful death, but Kerapac can always bring you back. Come on, let's explore!",
    "We're becoming more attuned to this place.",
    "You're starting to breathe it? This poisonous air.",
    "It's hatred. Pure hatred. And it knows we're here.",
    "Let's get its attention!",
    "It[sic] it hates us so much, imagine what it'll think of overgrown clockface Jas.",
    "Maybe it'll eat the eggs too. Too[sic] birds with one stone.",
    "You feel that, don't you?",
    "I don't know. I don't think so. But I like it.",
    "We need to get the leviathan's attention.",
    "It's an amplifier. Touch it!",
    "It'll attract the leviathan. Do it! Quickly!",
    "That did it! It's coming!",
    "Far more than fine!",
    "What power! I could stay in there all day!",
    "Killed you, maybe. I found all that shadow rather invigorating. We are...stronger.",
    "All that shadow! And now it's OURS, within us! Can't you feel it? The power of Erebus!",
    "Take out the eggs now. We could do it. Unleash the shadow. Let them rot.",
    "With all this power from Erebus, we could take Seren.",
    "Too late, it seems.",
    "Been a pleasure, World Guardian.",
    "Don't worry. We're still here.",
    "A shame. Imagine what we could do with that power...."
  ],
  "Light voice": [
    "Neither did we.",
    "Aw. Such sweet naivety.",
    "If they're not fighting before the day is out I will eat my hat.",
    "Now why would she take the eggs to one of the more dangerous lower planes?",
    "Saradomin's shining capital? Are we sure?",
    "And the last thing she wants right now is to be bothered by another god's forces.",
    "Unless she thought to pass the eggs into the Schism... Seems unlikely, don't you think?",
    "Something like that would be really useful right about now.",
    "Don't be disgusting.",
    "It'll rot our soul!",
    "We don't know what's in there. Seren said it was looking for the eggs.",
    "Maybe there's something here that can help.",
    "I don't like it. This is not a good place to get used to.",
    "Wait. Do you hear that?",
    "Something...something huge, out in the darkness. Looking for us.",
    "Then let's hurry - that thing is still out there!",
    "A...leviathan. A predator. It feels...hungry?",
    "Can we leave? That thing is going to find us.",
    "Are you insane?",
    "Is this...is this what we were made for?",
    "So what now?",
    "What is this?",
    "Why?",
    "Now to get out of here before we're eaten alive.",
    "It would have killed us eventually.",
    "Settle down.",
    "I wouldn't count on it.",
    "Oh dear.",
    "Our gift remains.",
    "All that extra power we picked up in Erebus is gone, though."
  ],
  "Shadow Voice": [
    "You don't have a hat.",
    "She could hold off the demons, no doubt. But there's no connection. Not the best place to check first."
  ],
  "Light Voice": [
    "Well. Someone's hat. I'm sure our World Guardian has a few."
  ],
  "Vicendithas": [
    "Player. I wasn't expecting you. Do you need something?",
    "What do you need it for? What's happened?",
    "I see.",
    "Hannibus isn't wrong. I have been working on a diviner, of sorts. And I see why you think it might help, assuming the eggs are anything like the Stone of Jas...",
    "A tool. I'm working with the Ilujanka to resolve the problem of their infertility, which appears related to the anima of their homeworld, Iaia.",
    "To help me investigate, I've been attempting to build a device for precisely measuring the ambient anima of a world.",
    "No, no, not like that.",
    "As I understand it, from the enchanter Charos, the Measure is too narrow in scale. It was made for small, finely tuned adjustments. I need something that acts on a planar scale.",
    "When he tried to break into my lab to steal Nodon technology, yes.",
    "I put a stop to that particular plan, but he did persuade me to strike a deal.",
    "He needed my hardware for his enchanting and I needed his anima knowledge for my Ilujanka experiments - the exchange proved mutually beneficial. He was the one who told me about the Measure, and about the Locator, too.",
    "Another Elder Artefact. It was claimed by Saradomin centuries ago. I believe he's in the habit of wearing it as signifier of his rank as a god.",
    "Oh?",
    "It's been stolen?",
    "Maddening. The Locator is closer to what I need - what we need, in fact. It has the ability to search for artefacts of power on a given plane.",
    "It can't search for the eggs themselves - the Elders shielded them from its effects - but it has the reach the Measure lacks, and its effect could be adapted to find other power sources.",
    "It will, when I have more time to perfect it. Right now, it's...rather blunt. And I've only tested it on Gielinor.",
    "If, however, I could make it portable, building off some existing source of power, and if I could use it on another world...it could be used to look for exceptional anima signatures elsewhere.",
    "Three Elder God eggs would certainly be exceptional. They would warp the runescape of any world they ended up on - change the anima of it far beyond normal fluctuations.",
    "That...would be ideal, considering what I need. Portable. A strong power source. Yes, that would help immensely. Is it in your possession?",
    "Go collect it from him and bring it here, then. Let us see what it can do.",
    "Bring it here, then. Let us see what it can do.",
    "You don't appear to be carrying the Measure with you still. Go fetch it.",
    "Good.",
    "Hmm. I believe I can make this work with my device. Excuse me for a moment.",
    "Keep it down, please. I'm trying to focus.",
    "If Seren is gone, what is the state of the battle?",
    "Have they found a way to kill my father yet?",
    "A pity.",
    "He is entirely to blame. If it weren't for his hubris...",
    "It doesn't matter. We're not having this argument again. My family affairs are still none of your business.",
    "But nothing. Be quiet or leave my lab.",
    "I'm almost done.",
    "They are infertile and have been dying out for centuries, for so long that many of them have given up hope of ever recovering.",
    "It's quite touching, actually, in a tragic way. I've visited Iaia and spoken to many of them over the course of my research. Most of their elders have accepted extinction as their fate.",
    "They call it The End of Days, and they're at peace with it. The younger ones haven't quite given up yet, though, and so I am working on a cure for them.",
    "...",
    "My father began this work, before he doomed us all. I plan to succeed where he abandoned it.",
    "There. One adapted Measure. Only lightly blasphemous, but I doubt the Roakin will care.",
    "It's stable. All working as expected. Good.",
    "Let me see...",
    "I'm not detecting anything unusual. Gielinor's runescape is normal. I don't think the eggs are still here.",
    "The evidence strongly suggests that, yes.",
    "Have you contacted your allies yet? Tell them that Seren has taken the eggs away from Gielinor.",
    "Allow me to leave my lab in an appropriate state and I will join you.",
    "A chance to use an elder artefact on different worlds...if the end of the universe wasn't on the horizon, this would be exciting.",
    "In the far west of Gielinor, south of the mountain called Eagles' Peak and west of the city of Ardougne.",
    "Allow me to leave my lab in an appropriate state and I will join you at the World Gate.",
    "We've not met.",
    "I am. What of it?",
    "Lead the way.",
    "We should go through the world gate to look for Seren.",
    "Beautiful, yes, but deadly. Watch yourselves. The elves that remained on this world have transformed into mindless beasts.",
    "They've infused themselves with the crystals of this world and have become unstable as a result. It seems to offer remarkable morphogenic properties, but the cost on their sanity is overwhelming.",
    "Would it be better to phrase it in a parable? Or perhaps a song? The truth is the truth, there's no reason to dress it up to make it prettier.",
    "The most venomous creatures have the brightest colours, but yes, this world has its charm.",
    "I can't tell from here. I'll need to take a few readings to see if the runescape of this world has been altered by the eggs' presence.",
    "We'll need to investigate the area. Fortunately this world is covered in crystal formations, so it should just be a case of checking them for irregularities in the runescape.",
    "We should head towards the old settlement and examine the crystals nearby. If Seren went anywhere it would likely be there.",
    "We need to calibrate the measuring device. This world's crystal formations are unique at retaining resonances. Try investigating nearby crystals, like this one here.",
    "Fascinating. The crystals really do resonate in a unique manner. It's as if they are harmonising their anima together.",
    "A crude analogy would say they're a choir singing the same song.",
    "Nothing quite so fanciful as absorbed essence. They have been altered to share similar properties perhaps. But these are unstable, imperfect. I believe the crystals in Prifddinas are more refined.",
    "For one, they'll hold the resonance much longer. These crystals have long since lost their effectiveness, which would explain the decline of the local population.",
    "This again? It's nothing to do with you.",
    "Then you and he are very different people, Hannibus. You knew him for mere days. I've had the misfortune of knowing him my whole life. I am nothing to him.",
    "I am but a tool to him, or perhaps an unwanted servant. Nothing more. He doesn't even care enough to hate me.",
    "I was useful to him for a time, and when that time ran its course, I was cast aside.",
    "Enough of that. These crystals are telling me nothing. We should try and find one of the locals and see if they know anything more.",
    "Nothing changes. You stride in here with the arrogance to believe that you are the smartest person on the planet and then as always you're completely wrong. She's not here.",
    "Wrong again. We're not hiding her from you at all. We're trying to find her.",
    "When you're quite done bickering, we should look around for signs of Seren. See if there are any strong anima traces remaining. It shouldn't be difficult on a dead world like this.",
    "Nothing here either. No sign of life. No trace of anima. This planet is utterly dead.",
    "Not terribly surprising considering. We should look elsewhere, just to be sure. But I suspect she's not here.",
    "What is this obsession with the relationship between me and my father? Hannibus keeps pestering me about it, now you?",
    "To what end? He has all the power, yes, but he lacks the will. Leveraging a relationship with him offers nothing.",
    "If I wanted to gain, I would need to forge a relationship with the one who holds his leash. Do you think Jas needs a friend?",
    "I suspect this leash is very well made.",
    "We wouldn't be so lucky. You're like a cockroach, I don't think anything will ever really kill you.",
    "My pathetic existence? Shall we stop for a moment to examine yours? The great and mighty Kerapac a slave to the very beings he fought against. Laid low by his own hubris. AGAIN!",
    "The people of Kethsi were heavy users of the stone. The world might have a strong enough residual energy signature to disguise the new eggs for a while. It's as good a guess as anywhere.",
    "We need nothing from him.",
    "What are you suggesting?",
    "But one that did give me an idea.",
    "Only one egg was ever in use on Kethsi. But what if instead we looked at a world where all the eggs had been?",
    "What if we looked for a world where the eggs had already hatched?",
    "Precisely! We should try there next.",
    "She's here.",
    "It's not that precise. She is close by, and that's all I can say.",
    "It could be Kerapac.",
    "Don't get too close. The readings I'm getting...",
    "We should go back to the Halls. This place is flooded with shadow anima - It's not safe. Seren needs to tell us what this means.",
    "One giving off enough shadow anima to kill any of us.",
    "He's here.",
    "We know. Don't get close.",
    "This isn't hurting you?",
    "They just...defeated Jas.",
    "The greatest of the Roakin. The ceaseless curse-bringer.",
    "She's...gone.",
    "And I need no apology from you either.",
    "An apology implies that your opinion of me matters. Once, that was true, but now I know better.",
    "I have succeeded where you have failed. I have brought hope to the Ilujanka where your research found only dead ends. When I thought I had to live up to your standards, to your...greatness...",
    "I would have done anything to know that you cared.",
    "But now, you should be looking up to me, trying to live up to my standards. An Ilujankan pastkeeper once told me 'be a better man than your father'.",
    "It's a nice mantra to live your life by, a good life lesson. But I realised something long ago.",
    "I always have been.",
    "So don't worry, Kerapac, I don't need an apology. Like you, it just wouldn't matter.",
    "...",
    "We should go back to the halls. There's nothing more for us here.",
    "Jas was pulled into the portal - I saw it with my own eyes. I saw a shadow monstrosity attack her.",
    "Something tells me we don't have to worry about her again.",
    "What do you propose?",
    "Perhaps for now, but think of what they'll do when they are grown.",
    "I've seen the evil the Roakin are capable of. I was pinned under the sharp end of it for much of my life. Preventing another generation from doing the same will do more good than harm.",
    "To some, perhaps.",
    "This ...",
    "This is Iaia.",
    "Oh, no...",
    "How dare you! Iaia is not yours! The Ilujanka have the right to a future!",
    "The World Gate. Hannibus, what's the quickest route to the other villages?",
    "With respect, Oldest One, there isn't time.",
    "Oldest One...you really wish to stay? There's a future for you on Gielinor if you wish. You don't need to do this to yourself.",
    "The elders here know me. I will see if I can change a few minds.",
    "I've convinced who I can to leave. With luck, I can change a few more minds before it's too late.",
    "I have an idea.",
    "You need one inventory space to take these.",
    "These might help.",
    "The shards of the Needle. I collected them on Freneskae. I thought I could use them in my research, somehow.",
    "This is more important, though.",
    "The Needle manipulated time and space. Its shards won't be as powerful as the real thing, of course, but if you place them around the eggs it should slow down their hatching.",
    "I can assist. My adapted Measure can find the optimal locations for the shards. I will highlight them for you.",
    "Be careful. Seren will do anything to protect the eggs now. If she attacks...be ready.",
    "What have you done with the Needle shards I gave you...",
    "Good job there were others. Make some space and I can give you them.",
    "Place the shards at my markers, quickly!",
    "We must delay her so the others can evacuate the nearby villages.",
    "Use the shards to slow the hatching eggs - and keep her distracted from calling in the Elders, no matter what she throws at you.",
    "Give the evacuation all the time you can.",
    "Don't waste a shard by placing it there. Place them at my markers.",
    "Quick, World Guardian. Place another shard whilst Seren is distracted.",
    "Seren is distracted. Quickly place another shard!",
    "Get to the point.",
    "It's four against one.",
    "I've been teleporting them to Anachronia. The pioneer Ilujanka took them in.",
    "I'll stay with him. This is no time for a celebration.",
    "It's not your fault. It was Seren's choice. Player - you go on. I'll take him to Anachronia when this is all over.",
    "I am, actually. I need your help for this one. Do you have the final shard of the Needle?",
    "Thank you.",
    "Might I borrow it? It's the final component I need.",
    "If it works, I'll tell you. If not...I suppose I'll tell you too. Let me try it first, though.",
    "Both of you come here. Time to see if this works. Here - put your hand on the shard.",
    "Please just trust me. You too, Hannibus. I want us all to be there.",
    "It worked!",
    "My gift to the Ilujanka. It's not much, but given the limited readings I took with the Measure, it's the best I can do.",
    "No. It's not real, not in the physical, literal sense, but it's as close as I can make it.",
    "The Measure took readings of the planet's runescape; the shard of the Needle contained an imprint of Iaia's final days.",
    "Together with my Nodon brethren's dreamscape technology, I am able to generate this recreation, this dream - a small part of what was lost.",
    "Though, if reality is what we can see, touch, smell and feel, then yes - perhaps this is real. Does reality need to be crafted from stone and metal?",
    "A dream is reality to the dreamer whilst they sleep, is it not?",
    "You have shown me such kindness. You tried to guide me from the path of hatred that destroyed my father, and...well, I was cruel in my response.",
    "I didn't deserve the chances you gave me and yet you gave them anyway. I had to do something to relieve your grief.",
    "If it's wrong...if it's an abomination...then I beg your forgiveness and I will never attempt such a thing again. But I had to try.",
    "You would let me join your people?",
    "Me?",
    "I don't know if I can accept...",
    "That was his work.",
    "Thank you.",
    "You may enter the Dream of Iaia whenever you wish by using the hibernation pod over by the entrance.",
    "I have the old Pastkeeper's amulet for you. Clear a space in your backpack so you can take it.",
    "You left this behind on Iaia. It's the old Pastkeeper's amulet.",
    "You should give it to Sharrigan. She's in the Dream of Iaia.",
    "You should give that pastkeeper amulet to Sharrigan. She's in the Dream of Iaia.",
    "I do, but you need space to hold it first.",
    "I do. I recovered this from Kerapac's lair in Daemonheim. Maybe you can find a use for it?"
  ],
  "Mr Mordaut": [
    "Hello there, Player.",
    "Yes, Player, you are correct.",
    "However, you appear to have no room in your inventory. Clear some space and come back.",
    "Here you go."
  ],
  "[Ally]": [
    "Vicendithas suggests that we investigate large crystals formations like these. You should investigate them.",
    "Go through the portal - we need to find Seren!"
  ],
  "Angof": [
    "Well met. What brings you here and with so many unusual companions?",
    "Seren has visited our world precisely once since she reformed. She came here seeking our forgiveness I think, though she professed concern for us instead.",
    "The moment she set foot on this world I could feel all my aches and pains, my worries and my doubts, just float away. I would have given her anything she asked.",
    "But it would have been a hollow forgiveness, taken by force and not given freely.",
    "I have fought hard for my free will. Overcome constant agony just to remember my own name and to fight myself free of those crystals.",
    "She undid all of that in the instant she arrived and when she left it was as though all my effort had been for nothing.",
    "True, but Gielinor is an alien place to me. The sounds, smells and even the taste of the runescape is unusual to me.",
    "So Seren's presence there did not hit me as hard. But here, it was all so familiar, as if falling back into the way things should be.",
    "She is not here. I would not welcome her if she was, but as always she has abandoned this world.",
    "If she were here, I would know, I would feel it. But instead I feel only the constant agony of her absence and I am glad for it.",
    "Not today! Dewch ymlaen, Teulu!",
    "Don't just stand there! Run! We can't hold him for long! Get to the World Gate!"
  ],
  "[Character]": [
    "Don't just stand there! We need to get through the World Gate!!",
    "If you want another one, you need a free backpack space.",
    "Here's another seed bag. Fill it up and give it back to me, and then we can leave.",
    "Have a look around the plants and take what you can find.",
    "Thank you, stranger. You're not quite done - make sure to fill up the bag."
  ],
  "Jas": [
    "BE NO MORE!"
  ],
  "Echo of Kerapac": [
    "It is done.",
    "For millennia my people have suffered in chains at Jas' whim. They were bound to her stone and forced to endure unending agony for every moment that someone other than her borrowed its power.",
    "Now, she is gone.",
    "At my hand.",
    "I am a scientist, a being of calm logic and reason. But I confess that vengeance has burned in my heart ever since she destroyed our cities and inflicted us with her vile curse.",
    "Some claim that revenge solves nothing and leaves you hollow and empty, but they are lying. I have never known a greater feeling of satisfaction.",
    "The real me, yes. I am just an echo in time. I will be gone in a few moments.",
    "I have no regrets.",
    "True. But I will see her suffer.",
    "Whatever horrors I endure, I shall delight in them for I shall know that she suffers them too. Do not pity me Player, I could not ask for a better fate.",
    "Goodbye, World Guardian. I am glad we met.",
    "Say? Why should I have something to say?",
    "Apologise? For what?",
    "I created Vicendithas and although he has proven a disappointment, I have allowed him to live his own life. He has had access to resources and research that far exceed his capabilities and yet I have not prevented his studies.",
    "I have nothing to feel sorry for.",
    "..."
  ],
  "Craftmaster": [
    "Hail, friend.",
    "Is there really so much of a hurry?",
    "A shame. Goodbyes should never be rushed, you know. You never know which one will be the last.",
    "Well, I cannot leave just yet. Not without my tools.",
    "Stranger, these tools were made by my father's father and one day they will go to my son. They must be preserved or the knowledge they hold will be lost.",
    "Please - help me find them while I pack. They will be around my workshop.",
    "They won't be far. My son left them around my workshop.",
    "There are a few remaining. They will be around my workshop.",
    "Marvellous.",
    "If we were all to remain, then I would stay. But my son is leaving. His skills are not yet that of a master.",
    "I will join him, I think, so he can learn our ways properly."
  ],
  "Pastkeeper": [
    "Hail, friend.",
    "So the day is finally upon us. I am honoured to be its witness.",
    "I am this village's Pastkeeper. Everything I carry is in my stories. There is nothing else to take away.",
    "The World Gate? No. I do no[sic] intend to leave. My place is here. We have been fated to die for centuries. If it is to happen now, then so be it.",
    "My apprentice, Sharrigan, holds them too. She left Iaia some time ago to begin her life on Gielinor. She will live and pass on the stories.",
    "I need you to give something to her. If you clear a backpack space, you can take it.",
    "I have one request of you, stranger. Take this amulet, and give it to Sharrigan, when you see her. Tell her she is ready.",
    "Go in peace. My mind is made up. I will remain."
  ],
  "Elder Chahoua": [
    "Welcome, stranger.",
    "Where are your manners? You see Hannibus, do you not?",
    "Please, strangers, forgive Vindicta's shortness. Recent events have made her nervous.",
    "Hannibus, Vicendithas, nameless friends, come down to the water. There we may talk over tea.",
    "Whyever not?",
    "Ahhh. I see.",
    "So it is the end of days. At last.",
    "Do not fear, Hannibus. We are ready.",
    "For many years now, our people have awaited the inevitable end. It is something that all worlds must face one day, and it has been coming for us for as long as I can remember.",
    "I will gather the others. It is best that we are together for the end.",
    "We cannot fight our fate, stranger. And neither should we try. This has be written in the olun'dai for centuries.",
    "It is not a matter of commanding, stranger. This is simply how things are meant to be. We gladly accept it.",
    "There's no need to worry, friend.",
    "As you wish, strangers. I will not stop you.",
    "I hope that you know there is little point in your efforts. The end is implacable, as it is written.",
    "Go in peace, stranger."
  ],
  "Plantkeeper": [
    "Greetings, stranger.",
    "I am. You should not reject our fate.",
    "Don't give me that. This is our destiny. It was written in the olun'dai long before we hatched.",
    "Kind of you to help, visitor.",
    "No. I cannot. My life is that of Iaia's natural world. I can never leave and I never will.",
    "Sister...you have no such bonds. Go in peace. Raise children on better ground. Don't ever let them forget our ways."
  ],
  "Plantkeeper's Sister": [
    "Greetings, stranger.",
    "You can't be serious!",
    "The world is about to end and my thick-skulled sister wants her knowledge to die with it.",
    "Help me, visitor.",
    "If you free you a space in your backpack, you can help us evacuate.",
    "My sister is the Plantkeeper. Here - as she won't do it, gather seeds from the plants around here. Something of this world needs to survive.",
    "I won't. I promise."
  ],
  "Pondkeeper": [
    "Stranger.",
    "Hey! You! Got a spare pair of hands?",
    "I am the Pondkeeper and my poor fish need a hand getting through the World Gate.",
    "Extremely. They flow in the water as we flow through the olun'dai. They are a reminder of how we must be.",
    "If you want to help me, you need two backpack spaces.",
    "Here. Fill this bucket up from the pond. I'll take them with me when I leave.",
    "If you want another one you need one free backpack space.",
    "Here's another bucket. Fill it with fish and give it back to me.",
    "If you want another one you need one free backpack space.",
    "Here's another net. Use it to fill the bucket and then give it back to me.",
    "They're in the pond over there.",
    "You're not quite done - make sure to fill up the bucket.",
    "Thank you, stranger. I got the rest, myself. See you on the other side. If there is one."
  ],
  "Vindicta": [
    "What are you doing here?",
    "Stay back. Why are you here?",
    "What's the meaning of this? Is that...Seren? Why is she here?",
    "None of us need to do this to ourselves. I say we leave.",
    "Really? You, of all people, say that too?",
    "Yes. Some in this village and in others.",
    "Only a few, and they're close by. It won't take long to reach them.",
    "I will join you, stranger Adrasteia. Some will never be convinced, but I know who will be.",
    "I'm not going to let them die."
  ],
  "Tools found": [
    "[number]/3",
    "[number]/3"
  ],
  "Seeds collected": [
    "[number]/4",
    "[number]/4",
    "[number]/4",
    "[number]/4"
  ],
  "Congratulations! You have completed": [
    "'Extinction' - Complete this quest."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Extinction?oldid=36234136’"
  ]
}