{
    "This transcript or section is incomplete and could do with improvement.Reason": [
        "Missing a few dialogue branches, as noted by \"Transcript missing\"You can discuss this issue on the talk page or edit this page to improve it."
    ],
    "Andrew Gower": [
        "Who are you?",
        "Anyway, welcome to the Gower Farm. I'm Andrew.",
        "Yes.",
        "Yes.",
        "Yes!",
        "Yes! We have successfully grown cabbages in the past you know.",
        "We've had word from other cabbage enthusiasts that it's been affecting their farming patches as well.",
        "Do you know how to speak cabbage?",
        "I think it would be more fun to let you figure it out. Quests are better that way!",
        "We're making a new world! A world of cabbages, where the magic of vegetables never ends!",
        "I use cabbagemancy to grant sentience and mobility to the cabbages.",
        "Well, it's a landscape filled with cabbages, so I named it... Cabbagemud!",
        "It's quite a muddy landscape.",
        "Hello again.",
        "Didn't I say it would be better to figure it out for yourself?",
        "Good. Quests are better that way. Besides, you have your quest journal.",
        "Party hats? What?",
        "But that makes no sense. Party hats are just worthless pieces of paper.",
        "It looks like you've lost those party hats. Talk to Ian and he can give you some more.",
        "Hello?",
        "Hello?",
        "Oh, is that all? I can give you one of those.",
        "It's a good thing I built a 'return to owner' function then. Here you go..."
    ],
    "Player": [
        "I'm Player. I was wondering if you had any quests for me?",
        "I'm not just any adventurer. I'm the world guardian!",
        "What do you mean it's stopped working?",
        "Did you rake the plot properly?",
        "Did you put compost down?",
        "Did you plant the seeds?",
        "Did you water them?",
        "Sorry, that's the extent of my farming knowledge.",
        "Do you have any suggestions?",
        "What is it?",
        "That sounds easy. What's the catch?",
        "No...",
        "What should I do?",
        "What's a cabbagemancer?",
        "But what do you do specifically?",
        "A new world? How are you doing that?",
        "What's this world called?",
        "Cabbagemud? Not... Cabbagescape?",
        "Yes.",
        "Oh, go on!",
        "Why?",
        "What happened to that?",
        "That sounds exciting. How did that go?",
        "...",
        "Do you ever not think about cabbages?",
        "What's the story about?",
        "Brassica Prime? Lord of all cabbages?",
        "But Brassica Prime is real!",
        "Oh...",
        "This all sounds very exciting!",
        "I made a cabbagespeak amulet!",
        "Not yet.",
        "Hello?",
        "Hello?",
        "Er...yes? I think so?",
        "I am an unusually precocious specimen.",
        "I wanted to know why the cabbage patches aren't working.",
        "Maybe...",
        "What are you rioting about? What do you want?",
        "I spoke to the cabbages. They're rioting because they want party hats.",
        "You know, paper crowns like the ones you get in crackers.",
        "Yes!",
        "Can cabbages see colour?",
        "Then pink will do!",
        "No, this is mine!",
        "But it's too big for you!",
        "I'd better try and find some smaller ones before I'm down a few bil.",
        "I should see if I can find some party hats for these cabbages.",
        "I have them here.",
        "Will you help me now?",
        "So, will you help me now?",
        "Yes, cabbages are a cultivar of the species brassica oleracea, a species which also includes vegetables such as...",
        "What, really?",
        "Other place? What other place?",
        "Under the cabbage patch? Can we dig down into it?",
        "That sounds like something Andrew Gower might have.",
        "The cabbages told me that to find out why the cabbage patches aren't working I need an item. I just can't remember what it was...",
        "The cabbages told me that to find out why the cabbage patches aren't working I need an item. I just can't remember what it was...",
        "The cabbages told me that to find out why the cabbage patches aren't working I need a Disk of Returning, whatever that is.",
        "The cabbages told me that to find out why the cabbage patches aren't working I need a Disk of Returning, whatever that is.",
        "The cabbages told me that to find out why the cabbage patches aren't working I need a Disk of Returning, whatever that is.",
        "How do you know we need to go there?",
        "Oh, clever.",
        "Well yes, I was just wondering if one of you could teleport me there.",
        "Well, so I don't get confused, and therefore frustrated, and give up partway through the quest...",
        "I, er, I lost my cabbage.",
        "Still working on it.",
        "I lost the disk of returning you gave me...",
        "Where is it?",
        "Here goes nothing...",
        "What do I do now?",
        "Welcome to where?",
        "I don't understand...",
        "I'm not any of those things. I'm an adventurer.",
        "-PLACEHOLDER- hilarious placeholder dialogue here",
        "Wait, what? Why did I say that?",
        "-PLACEHOLDER- the player still doesn't understand",
        "Yuck! That feels horrible!",
        "So... what is this place?",
        "I'm from Gielinor.",
        "I've never noticed this happening.",
        "No. What's Rat Pits?",
        "But what does that have to do with this place?",
        "So it's full of dead people?",
        "What is?",
        "What do you mean?",
        "Maybe you and that other guy whatsisname[sic] just look really similar? It's not like the humans in this game are that distinct from each other.",
        "I'm going to walk away now.",
        "Hey Bandos, where's your head at?",
        "...",
        "Sorry.",
        "Information.",
        "What do you have?",
        "I'm sorry?",
        "I'm not sure what conversation I've just got into here but I think I already regret it.",
        "Uh.",
        "...",
        "Sorry, what?",
        "You're waiting to be done? What will you be when you're done?",
        "Shoot for the moon, half-finished weird blue man thing.",
        "Didn't you mean to say, the DJ is a spider?",
        "How could I do such a thing?",
        "No, I mean, your Attack option isn't set, so I couldn't attack you even if I wanted to, or even by mistake when I meant to pickpocket you.",
        "You also don't have a Pick-pocket option, don't worry.",
        "Hello, Mod Raven. Can I get the Ravensworn title without searching the elf city?",
        "That's not what I...",
        "This is just getting silly now...",
        "Yeah, whatever. Bye.",
        "Yes, oh great lord Raven. To be in your presence is an honour beyond reproach.",
        "Hail Mod Raven.",
        "You're being very familiar.",
        "Oh, you're not?",
        "Who are you then?",
        "Oh, like a parallel world?",
        "What's the one crucial difference?",
        "Really?",
        "Can you give me an example?",
        "Vaguely yeah.",
        "Why are you here then?",
        "If your world is so perfect, what are you doing here?",
        "So you say.",
        "If you say so.",
        "What's that?",
        "I guess.",
        "You're saying you're bored?",
        "I'm glad we amuse you.",
        "Hello, do I know you?",
        "What, like... Araxxor?",
        "I honestly can't tell which are which, then.",
        "Well, keep up the good work!",
        "Sorry, have we met?",
        "That was you in that thing? Incredible!",
        "Well, keep up the good work!",
        "Jessika?",
        "Hang on, I remember you were there during that business with Nomad - aren't you only supposed to be here if you're dead?",
        "Well, yes, but you went to the Underworld, so you're sort of still around...?",
        "Wate wut.",
        "...okay...",
        "Jessika?",
        "I'm sorry I let you die.",
        "What?",
        "Korasi?",
        "Hang on, I remember you were there during that business with Nomad - aren't you only supposed to be here if you're dead?",
        "Well, yes, but you went to the Underworld, so you're sort of still around...?",
        "Wate wut.",
        "...okay...",
        "Korasi?",
        "I'm sorry I let you die.",
        "What?",
        "Are you pretending to be an Ent?",
        "You're not skinny enough for an Ent. Besides, Mod Osborne made us take out all the explicit references to that film about the one ring... you know?",
        "Yeah that one!",
        "To be honest I'm pretty confused by this place, but everyone seems friendly enough.",
        "Who are you talking about?",
        "Wait...but aren't you Zanik?",
        "I'm not mocking you, I just don't understand.",
        "I'll just leave you to it.",
        "So, what do we do now that we're here?",
        "I shouldn't go wandering through portals until I know what I'm hoping to find the other side.",
        "What?",
        "How could you know that?",
        "Oh, I must have you confused with someone else. Weird that I'd bring it up.",
        "Cabbage patch.",
        "You're Minstrel Web, you did that sweet set at Death's house a few years back!",
        "Yeah, but you were a bit terse with me, to be honest.",
        "So you're calling yourself Spiral Orb now? You seem to be talking a bit differently too.",
        "Cabbage patch.",
        "The life altar?",
        "The legendary life altar is in the basement?!",
        "Actually I never write anything down. My quest journal just seems to remember everything for me.",
        "I have no idea! I think it might be space magic.",
        "Who is Lucien?",
        "Let's pretend for sake of argument that I haven't looked up the backstory online. Could you describe him to me?",
        "I'm sure I'll recognise him.",
        "Oh yeah, Lucien. Big guy, skull face, big bendy stick?",
        "Steve?",
        "Oh no, the chaos elemental?",
        "Only by reputation. Isn't he that guy who talks total gibberish?",
        "Well I'll do my best.",
        "Thok?",
        "What's a viking?",
        "Could you describe him?",
        "Okay, thok you, I mean thank you.",
        "Funny, for some reason I was expecting four.",
        "You mean one fewer.",
        "One fewer, not one less. The pieces are discrete and countable.",
        "Oh, I must have you confused with someone else. Weird that I'd bring it up.",
        "You're Minstrel Web, you did that sweet set at Death's house a few years back!",
        "Yeah, but you were a bit terse with me, to be honest.",
        "So you're calling yourself Spiral Orb now? You seem to be talking a bit differently too.",
        "No, sorry.",
        "Oh, no way, that was you two?",
        "Were you... this tall at the time?",
        "So what do you do here?",
        "What?",
        "What is an environment lead? Is that some sort of petrol pollution thing?",
        "Oh sorry, it can be difficult to tell without voice acting. What does an environment lead do?",
        "Cool!",
        "So you're a bit like construction foremen?",
        "WAZZZZZZZZUP!",
        "No, I'll figure it out for myself.",
        "Guthix, it's so good to see you again.",
        "What do you mean?",
        "But-",
        "Er, not really.",
        "Thanks.",
        "Gotten used to what?",
        "Oh yeah, didn't they remove you from the game because you were too blatant a reference?",
        "Why do you think there are so many references in the game?",
        "Oh, like homages?",
        "What's the bad reason?",
        "Hm?",
        "You must hate this quest then!",
        "You've put a lot of thought into this.",
        "Oh, well, thanks for nothing then.",
        "Oh, thanks.",
        "Oh, who are you?",
        "What is that?",
        "Ah, that sounds useful for a spy!",
        "Have we met? Who are you?",
        "Is the beard relevant?",
        "Well... thanks.",
        "Well, according to my backstory, you're like some kind of ultimate villain or something, but uh, I don't really remember any of that.",
        "Sixth Age?",
        "I think so.",
        "Oh yeah?",
        "Alright, thanks for the recommendation.",
        "Know each other? You killed my friends!",
        "When you stole the Stone of Jas and tried to use it to become a god!",
        "And While Guthix Sleeps, you monster!",
        "Of course I do! Your arrogance brought down the wrath of the dragonkin!",
        "Good times? My friends are dead!",
        "What do you mean?",
        "Yes.",
        "Yes...",
        "Hazelmere's alive?",
        "I see.",
        "The Sixth Age?",
        "I guess.",
        "That's right! That's just the sort of thing I do.",
        "You lost it?",
        "Someone stole it from you?",
        "The bank?",
        "Oh yes, I have one of those. Mine is full of junk to be honest. I really ought to clean it out.",
        "I will! Good idea.",
        "So I need to find the bank pin?",
        "Whose bank is it? Who stole it from you?",
        "The Wise Old Man? The notorious bank robber?",
        "How ironic.",
        "Where's the bank?",
        "Thanks!",
        "You said the life altar fragment's in the Wise Old Man's bank, right?",
        "So on it.",
        "But I haven't given you my name yet!",
        "But I am authorised personnel.",
        "What kind of name is Steve?",
        "I'm Player.",
        "I didn't mean to insult you, I just meant... Steve sounds quite a mundane name for a chaos elemental.",
        "Yes, that's more what I was expecting!",
        "So what do you do, Steve?",
        "What?",
        "Oh, like a fortune teller?",
        "I think I might have read some of your stuff on the website.",
        "Yes, but I can't understand a word of it. I was surprised you were so comprehensible in person.",
        "Oh, why is that?",
        "Oh, you're into fashionscape?",
        "Great! Where is it?",
        "The Grand Exchange?",
        "Oh yeah, that Grand Exchange.",
        "Thanks.",
        "Thanks.",
        "But Thok... this is where removed content goes to drink. You haven't been removed, have you?!",
        "Then what are you doing here?",
        "Thok, when we're on the surface world I know I won't have the courage to say this. But Thok... did you ever know that you're my hero? You're everything I wish I could be.",
        "No Thok, listen. You're the meaning in my life. You're the inspiration.",
        "You know it's true, everything I do, I do it for you.",
        "Good. I just wanted to let you know.",
        "The life altar, Thok. I need to fix it.",
        "It's like... a big rock... with a picture on it. It exploded.",
        "Do you know where any of the pieces of it went?",
        "Where is that?",
        "Okay, I'll go find and talk to Max.",
        "Skål!",
        "Bye Thok!",
        "Break into a bank.",
        "Quest says I have to.",
        "Nope.",
        "I need to blow open a vault door.",
        "Why am I not surprised? What is it this time? You want me to fetch you some shoes? You want me to polish all your belt buckles? You want me to dance for you like a ballerina?",
        "That does sound hard.",
        "Let me guess. You want me to take a cup of tea to each of the five environment artists hanging around the bar?",
        "I assume I can buy tea from the bartenders?",
        "Is there some reason the environment artists can't get their own free tea from the bartenders they're standing right next to?",
        "And you can't do it because...?",
        "Right. I'll get on with it...",
        "I need to break into a bank. Can you help?",
        "Well, there's a guard that needs distracting.",
        "I'm stealing back something that was stolen, which I need to save the world... sort of.",
        "What do you want?",
        "Oh, you want a job?",
        "Thanks anyway.",
        "Rob a bank.",
        "It's super important.",
        "I need someone to distract the female receptionist.",
        "Of course there is. What is it?",
        "Can't you do it yourself?",
        "Should they be lovers, not fighters?",
        "Anything else?",
        "Those are quite specific criteria.",
        "Good thing the God Wars bosses are standing at a table over there.",
        "I need someone with a very particular set of skills...",
        "Yes, actually!",
        "Don't you want to know what the job is?",
        "Don't you want me to do something for you in return?",
        "Of course there is.",
        "I don't see why not. You're the least awkward person I've met so far on this quest.",
        "I wonder who that was?",
        "Well, I need X cups of tea to give people...",
        "Hey, thanks!",
        "Is something the matter?",
        "You can't find an actor to play the role of Guthix?",
        "It's funny you should say that. I think I may have the perfect person for you.",
        "I represent a distinguished actor who not only has decades of experience on stage and screen, he has literally spent his lifetime perfecting the role of Guthix.",
        "I'll let him know.",
        "Not yet.",
        "Yes, the cabbages are performing what promises to be an absolutely unique interpretation of that classic 'Put Those Edicts Back Where They Came From... Or So Help Me'. Based on my recommendation, they want to offer you the leading role. This could be huge. It could go international!",
        "Oh, I thought you were sleeping somewhere near Ardougne.",
        "I still need your help with the bank job.",
        "Could I trouble you for some romantic advice? It's for a friend of course.",
        "Could I trouble you for some romantic advice.[sic] It's for a friend of course.",
        "Could I trouble you for some romantic advice? It's for a friend of course.",
        "Could I trouble you for some romantic advice? It's for a friend of course.",
        "Could I trouble you for some romantic advice? It's for a friend of course.",
        "Ok so, apparently-",
        "...",
        "Of course! It comes from ideal sources.",
        "Yes!",
        "I need you to distract that receptionist so I can break into the bank without her watching.",
        "I need that guard to abandon his post. Think you can handle it?",
        "Hi.",
        "Have you met my friend?",
        "The complex gender roles at work in that scene make my head spin!",
        "I didn't expect that to work.",
        "Wait, who are you?",
        "Oh, that's convenient. I need someone to help me crack a safe.",
        "Wait, who are you?",
        "Did I?",
        "Oh, okay.",
        "Er, I guess, Mr Mystery Penguin.",
        "Like this?",
        "Seriously? That was it?",
        "Wait, who are you?",
        "...hey, the safe's open! That's handy.",
        "I got a fragment from the bank.",
        "Yep.",
        "I got the fragment out of the GE.",
        "I got the one from the GE installed.",
        "Where is he again?",
        "Okay, I'll go find him.",
        "Skål!",
        "Bye Thok!",
        "I think I ought to talk to Max about all this first...",
        "Oh, hey Max, it's me, the world guardian!",
        "What?",
        "So what are you doing here, Max?",
        "Is that why it looks all broken and unfinished?",
        "But that's cheating!",
        "Then why do you do it?",
        "Thok told me there was a fragment of the life altar in here. Have you seen it? I need it.",
        "Great! Will you give it to me?",
        "What if I promise I would?",
        "Max all of them? But that will take forever!",
        "Okay, what skills do I need to do?",
        "Go on, give me a clue.",
        "Like what?",
        "What? What are they?",
        "What are the skills? Tell me?",
        "JUST TELL ME!",
        "YES!",
        "Bankstanding?",
        "I... was not expecting that. What else?",
        "Yes!",
        "No! Tell me!",
        "Wow!",
        "Double wow!!!",
        "I will!",
        "What's that?",
        "Wow!",
        "Did you... use it?",
        "Thanks Max.",
        "The line is actually 'That's great kid, don't get cocky.'",
        "It's from a popular sci-fi movie series that we're hesitant to explicitly name for legal reasons.",
        "You've never seen it?",
        "No, I suppose not.",
        "No, true.",
        "We miss out on a lot of great movies.",
        "Yeah.",
        "Yeah.",
        "What was that?",
        "Looks like someone forgot to turn the ocean off.",
        "There's something written on the other side...",
        "Weird.",
        "I suspect it would be madness to open that door.",
        "Something about the contents of this room brings the word 'squidgy' to mind. Also 'polyp'.",
        "Shame development on this one seems to have frozen, I know some people who could do with chilling out.",
        "There's a torn note on this door.",
        "It's got some stains on it.",
        "Oooh, maybe they're working on the Spontaneous Combustion skill after all!",
        "Shame I can't get in here, it's firmly Bard.",
        "Arghh, my eyes! What is this, the Blinding You With Science skill?",
        "I can look right through this door!",
        "No. Nope. No. Uh uh.",
        "Nooooooo.",
        "Bankstanding...?",
        "But that's against the Terms of Service!",
        "Then why are you doing it?",
        "That sounds like hard work.",
        "OMG Riding!? I thought Riding wasn't possible in RuneScape's engine!",
        "Riding? Isn't that just a rocking unicorn?",
        "OMG Sailing!?",
        "This room is a bit small and... un-oceanic.",
        "I've done it! I've got 99 in all three skills!",
        "Really?",
        "Thanks Max. At first I was annoyed that you didn't just give me the fragment, but now that I've worked hard for it, I really feel like I earned it.",
        "Well I'll be going.",
        "Max made me max a whole lot of skills. I did it though.",
        "Skål!",
        "Bye Thok!",
        "Max's piece of the life altar is back in place.",
        "Skål!",
        "Bye Thok!",
        "I have all the pieces!",
        "Where is the life altar?",
        "No!",
        "Oh no!",
        "Nope.",
        "Oh.",
        "I heard you.",
        "Oh, sorry. Can we go again?",
        "GASP!",
        "Please tell me, I'm really interested.",
        "Really.",
        "Who?",
        "I thought you were the Black Knight Titan?",
        "I get it.",
        "Is that so bad?",
        "What happened to the cabbagemancer?",
        "You monster!",
        "Well, maybe. Presumably you didn't kill her just for that though?",
        "No... You lured me?",
        "Not really. This whole quest has been so linear.",
        "That was surprisingly easy...",
        "Gasp!",
        "The problem is, the Black Knight Titan is trying to kill me and he won't stay dead!",
        "He's using life runes to respawn? But there's hundreds of them.",
        "She's dead. The Titan killed her.",
        "Aren't the Gower brothers cabbagemancers?",
        "This is exhausting.",
        "Can't we just... take a breather?",
        "Then can we mix it up a bit?",
        "No, that didn't really help. Your lance is very nice but a melee attack is still just a melee attack.",
        "You got anything else?",
        "Better than nothing but kind of cliché.",
        "No good. Not enough graphics budget.",
        "Finally!",
        "The graphically reworked Black Knight Titan.",
        "He wanted my disk of returning so he could escape to RuneScape.",
        "That wasn't exactly how I expected that to end.",
        "The life altar, the place where all life runes were created.",
        "Oh yeah, we're Behind the Scenes. You'll keep saying weird, fourth wall-breaking stuff. You get used to it. I think I may have a quest for you three now. The Titan killed the old cabbagemancer to lure me here and that let the life altar get out of control. What do you think about staying here as caretakers? Saviours of the universe, and you'd have an infinite supply of cabbages for your game.",
        "Not me. I was sure Sliske was going to show up or something.",
        "Thanks.",
        "I lost the disk of returning you gave me...",
        "Oh, that's a shame. I was assuming it would unlock as a quest reward.",
        "No.",
        "Awwwwwww...",
        "Yay!",
        "It's not that, it's just, you know, I like XP, so I was wondering...",
        "All skills at 30? No problemo. Already done.",
        "You've been graphically replaced."
    ],
    "Paul Gower": [
        "Oh, it's an adventurer, like in our game! A real one though.",
        "I'm sorry, but I don't know what that is. It must be after our time.",
        "I'm Paul, and this is our younger brother Ian.",
        "Well you see the problem we're having is: we're cabbagemancers, right? But our cabbage patch has stopped working!",
        "Well, no matter what we do, no cabbages are coming out of it.",
        "Well that's your quest! Find out why the cabbage patch isn't working!",
        "I have one.",
        "The cabbages! They must know all about where cabbages come from, if you ask them maybe they can help?",
        "That sounds like your first challenge then.",
        "I could explain to you at length the tasks you need to perform, and have you report back to me after each stage so that I can give you the next one... Or we could just let you figure it out for yourself.",
        "This is exciting! A real quest! Off you go!",
        "Oh. Come back if you change your mind.",
        "Like how necromancy is the magic of necks and pyromancy is the magic of pies.",
        "I use storytelling to weave an imaginary world for the cabbages to live in.",
        "Hi there, haha.",
        "Well I could, but I think it would be better if you figured it out yourself, haha. I've run this sort of thing with lots of cabbages, and what I've found is that the more information I give them up front the less interested they are. The ideal balance is a limited area with a specific objective and the freedom to experiment. So enjoy!",
        "I'm making up this game so the cabbages don't get bored! They pretend to be heroes and then I tell them a story about a situation they're in, and then they tell me what they do, and I tell them whether it worked. I call it 'rollplaying' because the cabbages have to roll themselves in order to determine the outcome.",
        "Well the god of balance, Brassica Prime, banished the lesser gods from the world of Cabbanor long ago.",
        "Yes, he's a character I made up.",
        "How fascinating! You seem unable to distinguish between fantasy and reality. Perhaps there is a king of cabbages, that makes sense, but no god.",
        "Anyway, while Brassica Prime slept, the immortal, alien Rutabagarat came to Cabbanor from another world! Their devious schemes still threaten to undermine all of cabbagedom. My latest quest is called 'Ritual of the Rutabagarat'. The heroes have revived Neepanadra from his long slumber, but will Luswedien use the power of the Stone of Yams to become a god? And what part have the mysterious Carrotkin to play?",
        "It is, but I'll be honest, some of the cabbages don't really care about the story. They just want to roll around and get experience points. But for me the story is where the REAL magic is. It transforms this simple farm into an incredible world where anything can happen. The cabbages can be heroes. They can be anything. Sometimes I think it's a better world. Better than this one.",
        "Excellent! Have you tried talking to the cabbages in the field?",
        "That does seem like the next logical step!",
        "How are you getting on?",
        "Good question! Not very well, I think.",
        "It looks like you've lost those party hats. Talk to Ian and he can give you some more.",
        "I think Andrew might have one of those, you should ask him."
    ],
    "Ian Gower": [
        "Hi!",
        "Don't wander too far though. Everything you need should be on the farm.",
        "Come and talk to us if you want to know more about what we do!",
        "We're cabbagemancers extraordinaire!",
        "A cabbagemancer is a wizard who specialises in the magic of cabbages.",
        "And I create props and scenery to bring those stories to life!",
        "I could, but it would spoil Paul's quest. He's very keen on people figuring things out for themselves.",
        "No, I can't. Sorry.",
        "I create props and scenery to bring Paul's stories to life.",
        "To make their world more immersive. I've always enjoyed helping my brothers with their experiments. Before we created Cabbagemud, Andrew and I built a castle for the cabbages to live in.",
        "It worked quite well, but we've had a lot more success with the free range cabbages. We even tried sending some of the cabbages into space.",
        "It never really took off.",
        "I also have a special version of Cabbagemud I play with some of the older cabbages. They aren't happy with some of the recent changes and prefer it the way it used to be.",
        "Yes. Sometimes. Okay, maybe not. Nobody really quits Cabbagemud.",
        "Oh, you need party hats?",
        "You're in luck, I have some right here. What colour?",
        "Oh, I only have pink ones left. Will that do?",
        "Here you go!",
        "I think Andrew might have one of those, you should ask him."
    ],
    "Ian": [
        "Hi.",
        "Let's do this!",
        "Let's do this!",
        "We'll make cabbages!",
        "I'll be honest, I never did like living on a farm.",
        "I do love a happy ending!",
        "Behind the Scenes is such a strange place!",
        "They're great aren't they? Which one is your favourite?",
        "Cool! Glad you like them.",
        "You should talk to Andrew about that. I think he knows a teleport spell."
    ],
    "Crispy the Cabbage": [
        "Ahdo ba de?",
        "Eddo ba de gum?",
        "Ahdo ba de?",
        "Eddo ba de gum?",
        "What is of want?",
        "When be of want?",
        "*gasp* You is of speak?",
        "Is extraordinaries. Human is of speak!",
        "What be of helping you?",
        "Kah! Cabbagemancers be of send you, no?",
        "Me tell you! We into riot! We into riot until we is of want!",
        "What is of want?",
        "That into rightness! We is of want hats of party! We leaf we chief!",
        "What is of want?",
        "When be of want?",
        "What is of want?",
        "That's right! We is of want hats of party! We leaf we chief!",
        "You is into hat of party? You is of givings!",
        "Wantings hat of party!",
        "Be getting ones of small!",
        "You bringings of party hats? We leaf we chief!",
        "Yes! Is of partyhats now! Is makings much bank!",
        "Wait! First we must be of changing! Some privacy please, you not be see of leafy bits.",
        "Oh yes. I of helping! You probably thinking of cabbage be of vegetable, yes?",
        "Haha! Me of think so! That into COMPLETELY wrongness! Cabbages be of pure magicalful, like hippogryph or platypus.",
        "Yes! Cabbage come for here from other place.",
        "Behind sceneries. Place find under cabbage patch. If cabbage not grow, problem in behind sceneries. You go there.",
        "No! That not into working even for human of speak. Only one way for into behind sceneries. Old trick. Be of needful disk of returning.",
        "Be of picking me up! We go much into together.",
        "Be of picking me up! It into time of adventuring!",
        "Okay good of jobs! Now we need to go to mine of dwarves - go go!",
        "Journal of quests keep into backpack. Be of reading it.",
        "Not of time for farm! Is of time for dwarven mine go!",
        "Ba mel pir ga toora!",
        "We needs to be heading to the mines of dwarves, then finding of behind sceneries begin.",
        "Good of jobs one more time! Now you got to find of hole on floor.",
        "You just walks around and use of disk of returning. It smell into hole and say when be of close to it.",
        "Here can smell of hole! Be of jumping in!",
        "This of black hole experience! Very close to behind sceneries.",
        "Looks around maybe? I not of know. This not of cabbage path. If you want to return into surface, you use back of returning disk. I of sleep now. You figure out rest.",
        "You needs to be of finding way out! Be looking around.",
        "Yay! You is of finding altar of life.",
        "Is life runes. Life runes is into spawnings.",
        "Needs of cabbagemancer!",
        "Is of need new cabbagemancers!",
        "Yes! I fetch! You is of toss. Toss me up ceiling! Keep of fighting until I into return!",
        "Player is in trouble! No time into explaining!",
        "Jumps into cabbage patch! Cast of life-rune-to-cabbage!"
    ],
    "Cabbage": [
        "PEDEE HAY!",
        "RE NO!",
        "PEDEE HAY!",
        "RE NO!",
        "PARTY HATS!",
        "RIGHT OF NOW!",
        "PARTY HATS!",
        "PARTY HATS!",
        "Tera sei ma les vor kay parten grellet rond.",
        "This be of important cabbage troupe into acting. Rehearsal busy do!",
        "This is not into working!",
        "It of disastrous!!! Into new play, 'Put Those Edicts Back Where They Came From... Or So Help Me', but cannot of actor for play Guthix!",
        "Cannot into look of right! Guthix face of many characterful.",
        "You into Guthix find of actor?",
        "Him of sound perfect! Say into more not! We be of hiring at time of now! You into telling."
    ],
    "Cabbage recruits": [
        "WE LEAF WE CHIEF!",
        "WE LEAF WE CHIEF!",
        "YAY! IS OF PARTY HATS!"
    ],
    "Bouncing cabbages": ["Partyhats!", "Right of now!"],
    "[Andrew Gower/Ian Gower/Paul Gower]": [
        "Go on, take those party hats back to the cabbages. I can't wait to see what happens next in this quest!",
        "Hello again.",
        "Well, I could, but why?",
        "That isn't very heroic at all. Aren't you an adventurer? With the lodestones you can even teleport right near the entrance!",
        "Hello again.",
        "Well, go over to the field and get a new one!",
        "How goes your quest?"
    ],
    "Crispy the cabbage": [
        "It is the time of getting a disk of returning.",
        "You must returning into behind sceneries!",
        "Behind sceneries comfy place!",
        "If I am of knowing, be much of tellings you. Maybe is into talking to anybody who is looking of important?",
        "Altar of livings is into much troubles. Please hurry talking to Thok, Lucien and Steve the elemental of chaoses and finding out what is of saving.",
        "Altar of livings is better now, but Titan is much of need killings."
    ],
    "Lloigh-enn": [
        "RuneScape is loading - please wait...",
        "Welcome to RuneScape[sic]"
    ],
    "Thordur": [
        "Hm... hello? I wasn't expecting anyone today? Welcome to Behind the Scenes.",
        "Behind the Scenes [laddie/lass]! RuneScape's home away from home.",
        "Ah, your first time here is it? Don't worry, we'll soon get you sorted out. So which is it? Graphical rework? Dead content? Were you killed off in a quest? Or are you unreleased content?",
        "Oh, right, well look, I have to put something in the box. It's for record-keeping, see, so just pick one.",
        "I see, I see. Very good. Well, if you'll step on through you can meet the others.",
        "It's Behind the Scenes!",
        "It's the editing. There's no one checking the dialogue, so you just spew any old rubbish.",
        "Don't worry, you've probably gotten it out of your system now. You may still find yourself saying some pretty weird things though!",
        "I'll break it down for you. You're from RuneScape, right?",
        "Sure, big rebranding exercise, world building, but same thing. Sometimes in RuneScape things change. People change how they look. New stuff appears. Old stuff disappears.",
        "You're part of the system, see, you don't see it happening. Take Rat Pits, you remember Rat Pits?",
        "It was a minigame, and it was broken, and no one played it, so it got removed. Now for you it's like it never existed.",
        "Well when something gets removed from the world, or before it gets added, this is where it goes. We call it Behind the Scenes. Look, just think of it as like the afterlife. Afterlife-slash-theme-bar.",
        "Close enough. You go on in. You'll either figure it out or go mad from the trying.",
        "Well go on then. You don't want to wait around here, do you? It's just a mostly featureless room."
    ],
    "Apropos": [
        "This is absurd!",
        "I'm the wrong colour!",
        "This is clearly just Hannibus's character model! They didn't even bother to recolour it!",
        "Wrong! It's obvious from canon that Ilujanka have widely varied patterns and colours on their skin, and the chances of Hannibus and Apropos looking identical are so remote as to be practically non-existent! Besides, Apropos is female and most races in the world are highly sexually dimorphic. And why am I carrying a lance? I'm in a drinking establishment! This is an unacceptable lorefail."
    ],
    "Bartender": [
        "What can I get you?",
        "Well, aren't you hard-boiled. Can't help you, sorry - try the spider DJ over on the podium.",
        "'ello mate! What can I get you?",
        "Tea.",
        "'ello mate! What can I get you?"
    ],
    "Captain Haskell": [
        "Bu' wash the poin[sic] then?",
        "Yeah, I'd thik[sic] sho too. Ish your fault, you'n those those those adVENturererers.",
        "I was the firsht! The firsht challenge master of *burp* Thorpe. I increashed daily engagement with a dozshen of the leasht-popular skills by over twenty per, pershentages. An' then they jusht up an' put me ashide for that, that...",
        "That little imposher! What she got I havn't, huh? Iss the expees the adventurererers care 'bout, I gave them that. I even came back with a betterer deal for them! But no, thas not good enough! Jusht 'cos I'm not a cute lil gnome with those pretty eyesh an' chirpy voice an' smile that lightsh up the world...",
        "Why won't she love meeeeee?"
    ],
    "Chaos Elemental": [
        "You should speak to Spiral Orb. She's on the stage in the middle of the bar.",
        "Hello, I'm Steve.",
        "As I said, I'm Steve.",
        "It's a perfectly reasonable name. What's your name?",
        "See, now THAT is a stupid sounding name.",
        "Oh? Oh? Is it? Should I have a name like Xmkptly Kzcymtlk?",
        "You know what that is? That's elementalist!",
        "It is too!",
        "Thank you.",
        "I'm a journalist, a truth-bringer, a weaver of words.",
        "I tell people about stuff that's going to happen in the future.",
        "Yes, sort of.",
        "Oh! You're familiar with my work? How marvellous!",
        "Ah, it's all a pretense, you see, to keep people interested. If you tell people things straight, even if it's information they need to know, they don't want to hear it. But if you mix it up, make a game of it, that's when people get really interested! I'm mostly retired now though.",
        "They started doing those BTS videos instead. Now I spend my time using player inspect to spy on what people are wearing.",
        "Yes! I mean obviously I don't wear clothes myself, but I love to see other people expressing their individuality. What do you think of fashionscape? Tell me what you really think.",
        "I am glad you like it too!",
        "The life altar? Yes. I saw a piece of it fly off when it exploded.",
        "Would you like me to impart that knowledge in the form of a cryptic riddle?",
        "Oh, I was expecting you to say no. I can't just ad-lib those. I'll just tell you.",
        "It's just as well. It takes me forever to come up with those.",
        "The piece I saw got blown into the Grand Exchange.",
        "Yes, you know, the Grand Exchange. The GE. The chamber of commerce. The mansion of merching. You know the place.",
        "See the Grand Exchange is just a series of pipes. The piece blew in there and got stuck inside. Just head on in through that portal with all the pipes and see if you can get it loose. You'll probably have to fiddle with the pipes to get it all working again.",
        "Oh no, I'm a law-abiding citizen. You know who isn't though? That penguin by the bar. He looks pretty shifty to me.",
        "Hello, I'm Steve.",
        "Hello, I'm Steve.",
        "As I said, I think there's a piece stuck in the GE. Just head on in through that portal with all the pipes and see if you can get it loose.",
        "Hello, I'm Steve.",
        "Good for you! Find the life altar portal and you can put it back where it belongs.",
        "Hello, I'm Steve.",
        "Everything okay with that life altar piece?",
        "Good for you!",
        "Hello, I'm Steve."
    ],
    "Creature": ["not done[sic]", "waiting to be done[sic]", "awesome[sic]"],
    "[Crunchy/Tim]": ["You want to talk to the spider first."],
    "Environment artist": [
        "All I can think about is normals.",
        "Nothing like kicking back after a hard day's work!",
        "I hate map editor so much.",
        "It's been a long day. I could use a drink.",
        "Never underestimate the power of a five minute break.",
        "All I can think about is normals.",
        "That's very kind of you!",
        "Nothing like kicking back after a hard day's work!",
        "That's very kind of you!",
        "I hate map editor so much.",
        "That's very kind of you!",
        "It's been a long day. I could use a drink.",
        "That's very kind of you!",
        "Never underestimate the power of a five minute break.",
        "That's very kind of you!",
        "Aaah, nothing like a nice cuppa tea!"
    ],
    "Commander Zilyana": [
        "There's a free spot at the table if you want to join us.",
        "Come on, gentlemen, stop this fighting and act like boss monsters.",
        "There's a free spot at the table if you want to join us.",
        "Of course! I am the *master* of chat up lines! Are you ready? Just say to them: 'You must have come fresh off the spinning wheel, baby, because you can string my bow any day.'"
    ],
    "K'ril Tsutsaroth": [
        "What's it look like, old [chap/girl]? We're having a nice drink while we wait to go back out on the field!",
        "Oh I say, it's the World Guardian. How do you do?",
        "Oh I say, it's the World Guardian. How do you do?",
        "It's all about how you dress, isn't it? Get some of those rare item tokens and trade them in for some nifty sunglasses. They'll come flocking. Failing that you could try wearing two eyepatches at the same time. Pretty much as good."
    ],
    "Kree'arra": [
        "Thirsty work, being beaten up over and over again for stuff to disassemble for Invention gainz.",
        "According to the Analytics team you get killed fifteen thousand times more than me every day!",
        "Nah, it's alright, I overreacted. Cheers.",
        "Good to see you!",
        "Good to see you!",
        "Romance isn't hard, buddy. Just remember this one little thing. No one buys flowers anymore because hot and cold got banned. Instead you should get them a Jadinko pet so they can front/back with it!"
    ],
    "General Graardor": [
        "Hey, it's what we do. You should know. You're proper good at it.",
        "You're right, Zil. Sorry Kree, I was only teasing.",
        "Cheers!",
        "Ho there, chap!",
        "Ho there, chap!",
        "I don't see why not. Has your 'friend' tried just talking to the lady or gentleman they are courting? Don't go for smarmy chat-up lines. Just get to know them a bit, find out what they like, what they have in common. I like to think of romance as a journey undertaken together rather than a conquest."
    ],
    "Nex": [
        "I fancy some pork scratchings. Anyone want anything?",
        "It is nice to get out of the cold for a bit!",
        "It is nice to get out of the cold for a bit!",
        "Of course! I'm always glad to help. When I'm picking up chicks, I always impress them with my skills. Tell them about your Divination level. That ought to do it. Don't fill their soul with smoke or their lungs with blood though! That hasn't worked out so well for me."
    ],
    "Guthix": [
        "In my work as an actor, I often study the spider. Their sublime grace. Their appendigious poise.",
        "Can I help you?",
        "Oh lord, it's a [fanboy/fangirl].",
        "You do realise Guthix is JUST a character?",
        "I am an actor. Guthix is just a character that I play.",
        "This is why I just hate doing genre work. The fanbase takes their fictional worlds much too personally and seriously. I never should have taken the role in the first place. I am a classically trained thespian! I believe I was only cast as Guthix due to my appearance. I fear I have become typecast; it is quite impossible to find work elsewhere in Gielinor now.",
        "Is it a problem which can be solved with superb acting sensibilities and gift for evoking pathos?",
        "Perhaps another can help you with your task. The chaos elemental, perhaps? I believe his name is Steve.",
        "Can I help you?",
        "I'm sorry, could you repeat that?",
        "What skills could a washed-up old actor possibly possess that would be of use to such an endeavour?",
        "I see, I see... and what's your assessment of the morality of this action?",
        "Well, I may be able to put my skills to use in your service, but it seems only fair that you should perform some act of relief in recompense.",
        "I have always striven to maintain a healthy work/life balance. Sadly being out of work has skewed said scales squarely towards the side of life. This has left me quite without direction and purpose and as such though it is a life filled with ample time, it is one bereft wholly of meaning.",
        "Yes! I wish to act again! I want to strut and fret my hour upon the stage once more. I have heard tell of a company of actors, cabbages they say, who live in this place. Alas I cannot approach them myself, for what manner of distinguished player acts on his own behalf? No, you must be my agent in this matter. Secure a part for me and I will aid you with your trifle.",
        "Have you spoken with the company of cabbages on my behalf?",
        "Have you spoken with the company of cabbages on my behalf?",
        "Oh, thank you! I only hope the part is one I will find challenging after such a long time in the wilderness.",
        "I don't have time for your meta-humour! I must start preparing for my new role.",
        "Yes of course, of course. Well, let's get it over with as quickly as possible. I will see you in the bank.",
        "I will be ready when I need to be. That is consummate professionalism.",
        "So what exactly is it that you need me to do here?",
        "Of course! Just go and introduce me!",
        "Guard! What sort of state do you call this?",
        "Your uniform is a disgrace! Is this how you present yourself to the president of the bank? Your helmet is unpolished. Your boots look like they came out of a well. As for your trousers... I'm not even going to discuss them. You are a disgusting worm!",
        "I should have you thrown out of the bank guard's guild!",
        "If you want to keep your job then I suggest you go and clean yourself up right this second!",
        "Can I help you?"
    ],
    "Lucien": [
        "The spider here is a DJ! How cool is that?",
        "That too, man!",
        "Oh hey man, what's up?",
        "Do we know each other?",
        "Do we know each other?",
        "Oh hey, Sixth Age blues, man? I feel you.",
        "Sixth Age, man. It's like a philosophy. It means the past is the past. Live for the now. Hakuna matata. Carpe diem. YOLO. Forgive and forget. You know what I mean?",
        "That said, you really should complete Ritual of the Mahjarrat.",
        "Yeah! I mean a lot of players still consider it RuneScape's best quest. The sheer scope of it as a storyline is just unprecedented, man. It defined a generation. The requirements are a beast but hey, it stars yours truly in his finest hour, so I'd say it's seriously worth the grind.",
        "No problem. But hey, enough about me.",
        "When was that, man?",
        "Oh, you mean in Ritual of the Mahjarrat?",
        "You remember what happened at the end of ROTM?",
        "Haha, yeah! That scaly dude was all in my face, and I was all like 'Oh no, get it off, urgh, I'm dead!' Good times!",
        "Nah, you're looking at it all wrong! It ain't like that down here.",
        "Well I'm dead, right?",
        "But here we are talking!",
        "Up there, it's all a game, man. Nothing but a game. A fretful hour and all that Shakespeare and all that. Down here, death don't mean nothing. I wish I could introduce you to Hazelmere, he'd tell you.",
        "Yeah, well, no. I mean it's complicated. He was here for a while, and we were buds, man. I mean we were tight. We used to hit up TDs together and all that. Shoot some pool. Clean torstol. Good times. Then he got a part in Nomad's Elegy, so now he's technically dead, except, you know, he's back in RuneScape so maybe he's, you know, kind of alive in a way? I dunno man, I just miss him, you know? Now I have to clean torstol by myself. Me, I don't think I'm going back. Mahjarrat got no afterlife, see, on account of being divine, so if I'm dead, I'm dead. No takesies backsies.",
        "Besides, it's the Sixth Age now, right?",
        "Sixth Age, man. It's like a philosophy. It means the past is the past. Live for the now. Hakuna matata. Carpe diem. YOLO. Forgive and forget. You know what I mean?",
        "Hey good for you, man. But enough about all that old stuff.",
        "You're trying to put the life altar back together?",
        "Well you're not going to believe this, man. I had one of the pieces right in my hands, but then I lost it.",
        "Well, I say lost, but it was more like stolen. Well, exactly like stolen.",
        "Yeah man, and then he didn't even do anything with it, he just stashed it in his bank and went off to do something else.",
        "Yeah you know, the bank. That place where dudes keep all their climbing boots and hand cannons.",
        "Hey man, frugality is for losers. I have a better idea, man. You should demand more bank space.",
        "But hey, I mean, getting back to the subject at hand and all that, getting that altar piece isn't gonna be a cakewalk. It's in someone else's bank, man, and you can't just open up someone else's bank. It wouldn't be right, for one thing, plus you don't know the bank pin.",
        "Oh no, it won't be that easy. You're gonna have to break in.",
        "You won't believe this, man. It was only the Wise Old Man.",
        "The very same.",
        "If you want that piece, you're gonna have to break in, and if you're gonna break in, you're gonna need a crack team of specialists or something. Why don't you head on into the bank, case the joint and that.[sic]",
        "Through this portal right next to me. Look for obstacles and barriers and stuff. Then take a look around the bar and see if you can find anyone to help out.",
        "That's right, man. Head on in through the portal next to me and case the joint. Look for obstacles and barriers and stuff. Then take a look around the bar and see if you can find anyone to help out.",
        "Oh hey man, what's up?",
        "Sorry man, my nerves are shot these days. Good luck though.",
        "Oh hey man, what's up?",
        "Yo man, you got your team together and that?",
        "Great! You should head on in to the bank then.",
        "Oh hey man, what's up?",
        "Good job, man. If you head on through the life altar portal you can fix it right up.",
        "Oh hey man, what's up?",
        "You got that piece installed in the life altar?",
        "Amazing job, man!",
        "Oh hey man, what's up?"
    ],
    "Man": [
        "Please don't kill me.",
        "You adventurers are capable of far worse.",
        "Don't pick my pocket either!"
    ],
    "Mod Raven": [
        "Too much effort? Well I suppose I could spread my ravens around a bit.",
        "There shall be one thousand ravens! Each appearing one thousand days after the other!",
        "It will take you centuries to find them all! AHAHAHAHAHAA[sic]",
        "HAIL ME!",
        "Ah, a true acolyte. Here to bask in the glory that is Mod Raven?",
        "Yes, sycophant, it is. Be gone now. I bore and there are beverages to consume.",
        "Yes yes, hail me."
    ],
    "Romeo": [
        "I heard female spiders kill their mates or something. That sounds better than loneliness.",
        "'A lovestruck Romeo sings a street suss serenade...'",
        "I've been down here since 2010 and I still haven't gotten used to it.",
        "All the references. Up in RuneScape there are loads of references all the time, but no one ever talks about it.",
        "Yes! Down here though it's all pop culture all the time.",
        "There's two good reasons and one bad one, I reckon. Good reason one is to show respect for a source of inspiration. All art is imitative, and a well-placed reference acknowledges that fact without disrupting the flow of the work.",
        "Yes, exactly. Good reason two is to create a sense of camaraderie with the audience. Including a reference signals to the audience that the author shares their life experiences and loves all the same things.",
        "When it's used as a substitute for actual content. Using a lazy reference because you couldn't think of a line yourself is as bad as using a cliche. One other important thing is, the perfect reference is visible to those who get it, but invisible to those who don't.",
        "If it's obvious that it's a reference but you don't know what it's referencing, that makes you feel excluded from an in-joke.",
        "Yeah...",
        "Surprising, isn't it? I'll be honest though, on any other subject I'm still the same randy old dog as always.",
        "Oh no, I couldn't possibly.",
        "Have you met Lucien? With the face? He might know something.",
        "'A lovestruck Romeo sings a street suss serenade...'",
        "Do a what?",
        "Why would I want to do that?",
        "Oh, then of course I'll help. What do you need?",
        "Ah, I've had my eye on her for some time! I am indeed the perfect choice. I must caution you though, that such takes on gender roles are fast becoming trite in the modern age. There is one small problem.",
        "If I am to woo this lady, I will need to be at the top of my game! Sadly I fear my talents have atrophied. Find me some up to date advice on matters of the heart! Five pieces of advice, please.",
        "Oh, no. I don't want to look desperate.",
        "Well, they'd need to be people who've been around for a while. You know, seen a few things. Been around the block a few times. Ideally they'd meet a lot of different people in their day to day lives. And uh... make sure you ask people who inspire loyalty and trust - leaaderly figures, you know.",
        "Oh no, definitely fighters too.",
        "I always think the best advice comes from people who are diametrically opposed, philosophically, culturally and politically.",
        "Yes.",
        "Have you managed to find any love advice for me?",
        "Have you managed to find any love advice for me?",
        "Ah good! What did you learn?",
        "Not so loud! Suavity is like ninjitsu; the more people that possess it, the weaker it becomes for everyone.",
        "Really? Are you sure your information is correct?",
        "Very well. I'll be waiting for you in the bank, practicing my techniques!",
        "We can't get started on that receptionist until you do!",
        "Is it time yet?",
        "A doddle! With my new techniques she will melt like butter. You go and break the ice. Play the wingman. I'll arrive at the appropriate moment.",
        "Hello my love! We meet again!",
        "I have come to seduce you, my little chickadee.",
        "You must have come fresh off the spinning wheel, baby, because you can string my bow any day.",
        "My Divination level is 34.",
        "Ah, playing hard to get? Two can play at that game my dear! Catch me if you can!",
        "'A lovestruck Romeo sings a street suss serenade...'"
    ],
    "Sphenishchev": [
        "Go talk with spider.",
        "Hello again, tovarisch[sic]",
        "This is not first time we have had this conversation and it will not be last.",
        "I will tell you once again, only because I have nothing better to do with time. My name is Sphenischev.[sic] I am, or was, agent of KGP. Its finest agent. Not only for considerable skill at infiltration and safecraking, but because I possess very unique capability.",
        "I have rare condition called oblituritis. It means no one can remember interaction with me.",
        "It was, until fateful day.",
        "It was 28th January, 2009. I was peacefully doing job of spying, when suddenly adventurers pour from every crevice of landscape! Unable to remember interacting with me, they spot me over and over and over again! So humiliating! The worst abusers were banned, of course, but it was too late for me. I was exiled here because I was 'glitchy'. My very greatest strength had become my greatest weakness. That is my story, friend. Take what you will from it.",
        "*sigh*",
        "I know of this thing of which you speak, but I am afraid I cannot help you. Have you tried speaking to Thok? He has beard.",
        "I do not know. I am penguin. Beards are mystery to me.",
        "Hello again, tovarisch[sic]",
        "Bank, you say?",
        "You want safe cracked?",
        "I am in.",
        "No.",
        "Not really. I love to crack safe. There is small, tiny, teensy, little problem.",
        "You see, I do not have... dexterity of human hand. Opposable digits, you see. If you able to do work, I will guide you through process. Is deal?",
        "Good. I will see you in bank.",
        "I will be here when you need me, tovarisch.",
        "Hello.",
        "I am here to help.",
        "Da, that is why I am here. You get started.",
        "Are you ready?",
        "Chert! I am Sphenischev[sic]. You bring me to crack safe.",
        "Da! I do not have time to explain again. Your player remembers even if you do not.",
        "Are you ready?",
        "Okay I tell you what to do. First you flip little switch on side.",
        "Yes is correct. Now grab handle, and slowly twist and pull towards you.",
        "And that is that.",
        "Yes. Job well done. You take what you want from safe now.",
        "I hate working with other people...",
        "Hello again, tovarisch[sic]"
    ],
    "Sueros": [
        "Yo, well met and stuff.",
        "You think I'm Zaros, don't you?",
        "No.",
        "My name is Sueros! I come from like, an alternate Gielinor.",
        "Yeah exactly! A world just like yours, dude, except for one crucial difference.",
        "On my world, I'm like *unbelievably* awesome.",
        "Totes.",
        "Well, you know how like, in your world everything fell apart when that nasty old Zamorak betrayed and murdered Zaros?",
        "Well in my world, when Zamorak confronted me, I just like, pulled out my guitar and totally shredded this sweet solo which made the very earth bleed simultaneous tears of joy and sorrow. Then me and Zim-Zam hugged it out, and me, him and Azzy have been best bros ever since. Consequently, my totally sweet empire never fell, and as a consequence the people of my world live in like, complete peace and harmony and stuff.",
        "Say what?",
        "Well you see, I'm perfect, right?",
        "Right, and being perfect is like, awesome and stuff, and totally sweet.",
        "Right. But like, there's one problem with being perfect.",
        "Well like, the heart of drama is conflict, right? Anticipation, tension, confrontation, resolution, right?",
        "And like, being like totally perfect and a genius and everything, there just isn't really any conflict in my world, and hence, no drama.",
        "Well like, I'm like a great writer and stuff, so I can like, keep people entertained with my amazing plays and novels and albums and stuff, you know, so there's that. Sometimes though, you've just got to keep it real, you know? Like in my world, no one ever dies or suffers or like, is even slightly uncomfortable in any way. Here though, it's like a total disaster like, *all* the time. It's very entertaining!",
        "You're welcome!"
    ],
    "Thingummywut": [
        "Hello there mate, alright?",
        "Well, we've not been introduced, but you've probably seen me at work - I'm a puppeteer for big creatures on the surface.",
        "No, the ones that are big animatronic rigs that need an operator, not the real ones.",
        "Ta very much! I always say CGI's only a tool to help things along - for real impact, real reactions, you need a real actor.",
        "Hey, Player, good to see you - what are you doing down here?",
        "Yeh,[sic] though I look a bit different out of the rig, I suppose. I'm the puppeteer that works the Thingummywut - you remember, from Love Story?",
        "Ta very much! I always say CGI's only a tool to help things along - for real impact, real reactions, you need a real actor."
    ],
    "Thok": [
        "When Thok think of spiders, Thok want to smash.",
        "Helloooo fellow traveller!",
        "Thok drinking!",
        "No!",
        "Thok like it here. Good beer.",
        "Thok know that.",
        "Thok know.",
        "It okay. Thok know. Everyone feel this way about Thok.",
        "Help with what?",
        "What is that?",
        "Ah yes! Thok know of this!",
        "Yes! Thok see piece go into Room of Beating. Thok's friend Max in there. He tell you.",
        "Through big glowing circle next to unfinished looking blue boxes.",
        "First have drink with Thok!",
        "Skål!",
        "Okay bye now!",
        "No, Thok cannot help with this[sic]",
        "Helloooo fellow traveller!",
        "Helloooo fellow traveller!",
        "You find Max, friend of Thok yet?",
        "In Room of Beating through big glowing circle next to unfinished looking blue boxes.",
        "First have drink with Thok!",
        "Skål!",
        "Okay bye now!",
        "Helloooo fellow traveller!",
        "Good! You take small rock to big rock and smash together! Problem solved. First have drink with Thok!",
        "Skål!",
        "Okay bye now!",
        "Helloooo fellow traveller!",
        "Not all finished?",
        "Good! First have drink with Thok!",
        "Skål!",
        "Okay bye now!",
        "Helloooo fellow traveller!"
    ],
    "Jessika": [
        "'sup.",
        "Yep, canonically dead and gone.",
        "I'm not the Underworld Jessika, I'm the alive Jessika who isn't alive.",
        "When you make a choice, it changes places and people, yeah? So the world's got to know which of us to show you when it's showing one of us alive. And in the Underworld it's got to know which of us to show when it's showing one of us dead.",
        "I'm Alive Jessika, not Dead Jessika. So she's in the Underworld, I'm here drinking navy rum on the rocks. S'cool.",
        "'sup.",
        "We choose what we choose. No hard feelings. Anyway, you've not done all the quests, might be you see me again.",
        "Spoilers..."
    ],
    "Korasi": [
        "Ey, if it isn't Player! It's well wicked to see you again!",
        "I am dead, mate! You saved the other one, remember! I'd save the fit nerdy bit of totty and all, so I get you.",
        "Nah, the one in the Underworld is the Korasi who is either Korasi or Jessika - I'm the Korasi who's either Jessika or Korasi, innit.",
        "When you make a choice, it changes places and people, yeah? So the world's got to know which of us to show you when it's showing one of us alive. And in the Underworld it's got to know which of us to show when it's showing one of us dead.",
        "So I'm the Korasi who you don't see when it's showing one of us alive because I'm the dead one, not the Korasi you see when it's showing one of us is dead. She's in the Underworld, I'm here drinking daiquiris.",
        "Ey, if it isn't Player! It's well wicked to see you again!",
        "Hey, I'd save the fit nerdy bit of totty and all, so I get you.",
        "Besides, I'm sure you'll see me again some time, maybe in some quest you've not done yet or something.",
        "Sorry, no spoilers mate!"
    ],
    "Vorago": [
        "Hoooom.",
        "I... talk... very... slowly...",
        "The one about the lord and the giant well of lava and throwing it in?",
        "Oh, okay, fine. How are you, Player?",
        "It's nice to get a bit of a break from all the violence for a while. Enjoy yourself!"
    ],
    "Zanik [#1]": [
        "Can you believe her?",
        "I mean, can you believe her?",
        "What's she got that we haven't got?",
        "I just can't believe her.",
        "Oh that's nice of you to say.",
        "Very nice indeed.",
        "I think they're mocking us!",
        "We're talking about her.",
        "The 'graphical rework'.",
        "I was angry when you replaced me, but they hated you!",
        "I'm so sorry they hurt you!"
    ],
    "Zanik [#2]": [
        "I can't believe her.",
        "I can't. I can't believe her.",
        "Nothing. She's got nothing.",
        "Very nice.",
        "Are you mocking us?",
        "The new one. The new Zanik.",
        "She thinks she's so great. Ooh, look at me, I'm Zanik. I'm so pretty. She'll find out.",
        "They hated me! They hated me so much some of them...some of them even killed me!"
    ],
    "Zanik [#1] & Zanik [#2]": ["Zanik!"],
    "Spiral Orb": [
        "Oi, you with the action bar - over here!",
        "Hey you!",
        "I know why you're here. You've noticed the cabbage patches aren't working, and you've traced the problem to here.",
        "I watched a walkthrough video. Anyway, hi, I'm Spiral Orb, welcome to the Behind the Scenes pub!",
        "I don't think so.",
        "Oh snap, no way! Did you see me there?",
        "Oh I am so sorry. I was in such a mood that year, nothing to do with you.",
        "Oh, yeah, that. I was a bit tragic back then, wasn't I? So anyway, what were we saying?",
        "Oh yeah, that thing with the thing. I'll tell you what I know. Something is wrong with the life altar.",
        "Yes, the life altar in the basement.",
        "Yes, in the basement. Problem is, it's broken. It exploded or something. The pieces flew everywhere. I've heard a few people talk about seeing the pieces around.",
        "Okay, you'd better write this down.",
        "That's handy! How does that work?",
        "There's Lucien. I think he knows something.",
        "This is a Sixth Age quest, technically Lucien is a major part of your backstory.",
        "Tall. Skull face. Big bendy stick.",
        "According to your quest variables, you've completed Temple of Ikov. You already know who Lucien is. Besides, this is a Sixth Age quest, so technically you've completed Temple of Ikov anyway.",
        "That's him.",
        "I think Steve said something about seeing a piece.",
        "Yeah, Steve. The chaos elemental.",
        "You know him?",
        "That's mean! I know he has a funny accent, but I've never had any trouble understanding him!",
        "Let me think... let me think. Oh, there's Thok.",
        "Yeah, Thok. Big viking guy.",
        "Sorry, uhh, expy viking... Fremen... Fremenuh... Fremethingy.",
        "Oh yeah. Bare chest, beard all tied up. Kind of a dish to be honest, gets all my legs tingling.",
        "There is no fourth piece. Three pieces, three people. Find them all and you should be able to fix it.",
        "Ah yes, it was going to be four, but we ran out of development time. The good news is, that's one less you have to find!",
        "What?",
        "Oh whatever, Poindexter.",
        "Good luck!",
        "Okay, have fun!",
        "Hello again!",
        "You need to find and return all three missing fragments of the life altar.",
        "I don't think so.",
        "Oh snap, no way! Did you see me there?",
        "Oh I am so sorry. I was in such a mood that year, nothing to do with you.",
        "Oh, yeah, that. I was a bit tragic back then, wasn't I?",
        "Hello again!",
        "You need to find and return all three missing fragments of the life altar.",
        "Oh nice! Better get on down to the life altar and fix it up then!",
        "You know the big portals? It's one of those, it has all grass and plants around it.",
        "Hello again!",
        "Good job! That's give me inspiration for a new song. I call it 'Broken Rocks, Broken Heart'. What do you think?",
        "I thought so too.",
        "Your face is lame."
    ],
    "Spider Orb": ["So anyway, what were we saying?"],
    "Tim": [
        "Hello!",
        "The name's Tim.",
        "We're Crunchy and Tim. Maybe you've heard of us?",
        "We're the guys, you know, from the old website. The skeleton guy and the knight guy. You know?",
        "Yeah!",
        "No, there was a bit of a mixup. When they did the competition for the quest rewards, one of the finalists was us as bobbleheads.",
        "They drew up some concept art of it so that people would see how amazing we would be.",
        "When it came to our models being made, the bobblehead concept art got used by accident. So that's the story of how we ended up two feet tall.",
        "We're environment leads!",
        "Not L-E-D lead! L-E-E-D lead! Lead, as in, leader!",
        "Environment artists are a kind of videogame modeller who build the world. See this place? Environment artists built it. They built all of RuneScape, in fact.",
        "Our job is to tell the environment artists what to do.",
        "That's exactly right.",
        "Because humour is subjective, Crunchy!",
        "Did you know Gardevoir was a dude?",
        "Totally.",
        "Did you see Deadpool, Crunchy?",
        "Yeah, me too. Plus Deathstroke is much cooler.",
        "Hey Crunchy, WAZZZZZZUP!",
        "WAZZZZZZZUP!",
        "When you do it it doesn't seem funny anymore.",
        "How are we doing with the translation budget?",
        "Time to add more jokes!",
        "It's three days to RC and this dialogue still isn't finished.",
        "True that.",
        "New is an adjective that means it didn't exist until very recently.",
        "Hey thanks Crunch, you're a pal.",
        "Who's your favourite late night presenter, Crunchy?",
        "Oh, of course.",
        "Whoever wrote this dialogue is genius.",
        "Yeah they're the real heroes here. Hi translators!",
        "Why are you such a great guy, Crunchy?",
        "Oh that's right!",
        "Life altar, eh? You need us to fix it? That sounds like a job for my crew of expert environment artists.",
        "You're not wrong, Crunchy. Expensive, and difficult. Could take weeks. You want us to take a look?",
        "Hello!",
        "You want to do what?",
        "Why do you want to do a thing like that?",
        "No other options?",
        "And what needs doing?",
        "Oh that's easy work for environment leads like us. What do you make of it, Crunch?",
        "Well alright, but you have to do something for us first.",
        "Nothing like that. Building this place was really hard work for the lads.",
        "It's not just hard work, it's thirsty work.",
        "That's uncannily accurate.",
        "It might even be free.",
        "Did I mention that it's *really* tiring work?",
        "Tiny, tiny hands.",
        "An army marches on its stomach! Let's get everyone a nice brew!",
        "How's that brew run going?",
        "Good work! I guess me and Crunch here can come help you with that job of yours. We'll even do it for no charge, because assuming that the player has any coins would break the flow of the quest!",
        "Get that fellow out from in front of the door and we'll take it out for you.",
        "Go up and click on that door and we'll get started.",
        "Right, let me just delete this chunk of door off its map square...",
        "There we go, that'll be gone when the server refreshes. See you later!",
        "Hello!"
    ],
    "Crunchy": [
        "'Hey.'",
        "'And I'm Crunchy.'",
        "'Can you imagine? Us as tiny little people! Crazy!'",
        "'But we still didn't win!'",
        "'It sure is a sad story.'",
        "'He said 'we're environment leads'.'",
        "'Out of sweat and tears.'",
        "'It means we're real good at building stuff and breaking it down again.'",
        "'Why aren't any of your jokes funny, Tim?'",
        "'Whaaaaat, really? No way!'",
        "'I didn't like all the fourth wall breaking and meta-humour to be honest.'",
        "'WAZZZZZZZUP!'",
        "'We're way, way over it, buddy.'",
        "'Should probably get a move on then.'",
        "'You're a funny guy, Tim.'",
        "'It's obviously Craig Ferguson, isn't it.'",
        "'Don't forget the translators!'",
        "'Because I'm just a ventriloquist's dummy, Tim.'",
        "'Sounds expensive.'",
        "'Hey.'",
        "'I think we should help, Tim.'",
        "'You realise it goes on forever in both directions? You know how much work it is to build something infinitely large?'",
        "'I think you have great management potential!'",
        "'We'll be waiting for you in the bank.'",
        "'Hey.'"
    ],
    "Claire Hick": [
        "I'm sorry, your name isn't on the admittance list.",
        "I know.",
        "Oh, you again. You shouldn't be in here.",
        "Not you again!",
        "What do you want now?",
        "Oh, no. Romeo? What are you doing here?",
        "Please leave.",
        "Get out of here before something nasty happens to you!",
        "Right! That's it! Come here so I can punch you!"
    ],
    "Ernie": [
        "No admittance except to authorised personnel!",
        "Oh, well then I'm very sorry. Let me just...[sic] ...kindly suggest you walk away!",
        "No admittance except to authorised personnel!",
        "What?",
        "Sir sorry sir!",
        "Sir please don't sir! I need this job to pay for my twelve starving children sir!",
        "Sir yes sir!",
        "Then move along! You have no business here!"
    ],
    "Max": [
        "Hi there!",
        "Oh hey, world guardian #X!",
        "[X-1] other players have come through here since the quest was launched.",
        "Oh well, you know, I maxed every skill in RuneScape, so I've come here looking for new skills to max. This is the beta room, where new skills get developed.",
        "That's right! I sneak in here to do the new skills in advance.",
        "It's not cheating. When the skill goes live, all my beta progress gets wiped.",
        "I learn all the tricks and training methods. How do you think I maxed Invention so quickly? I knew all those rates in advance, baby.",
        "What do you want, anyway?",
        "Oh that, yeah. I have it, but I'm not giving it to you because you were mean to me. If you want the fragment you'll have to make it up to me - I want you to max all the prototype skills in here!",
        "Oh, yes, that - I have it.",
        "Just like that? No, I don't think so. You wouldn't value a thing that comes too easily.",
        "No, I think it would be better if you maxed all the skills in this room in return for it.",
        "Go on, give it a go! The balance isn't final anyway.",
        "There's three prototype skills, one in each room. Get all of them to 99 and I'll give you the altar piece.",
        "It's a surprise!",
        "Well... we've got some real classics down here.",
        "I mean these are real top-line, down-and-dirty, old school skills we're talking about here.",
        "We're not talking Divination or other random made up stuff.",
        "These ain't no minigames pretending to be skills.",
        "Are you sure you're ready for this?",
        "Okay, well first up we've got Bankstanding.",
        "Bankstanding. Fan favourite.",
        "Well, we got... Are you sure you're ready?",
        "You don't want to sit down?",
        "It's only... Riding!",
        "And Sailing!",
        "You'd better get on with it!",
        "You're doing great, kid. Don't get cocky!",
        "There's three prototype skills, one in each room. Get them all to 99 and I'll give you the altar piece.",
        "You know, I met a man - a JMod, actually - down here, who had a rotten potato.",
        "It's a kind of cheat tool that JMods can use to hack their characters. You can max your skills, complete quests, teleport anywhere in the world, even spawn Jad. All with just a click!",
        "I know, right? Imagine the power!",
        "No, of course not! I mean I'm not saying I wasn't tempted, but... The thing you have to understand about skilling is that it's not the destination that matters, but the journey. If I could just skip to the end, what would be the point? It's not like having 99 Firemaking is actually doing anything for me! People look up to me, and legendary players like Zezima and Suomi, because of the accomplishment, not the levels. It's not what we have that matters, it's what we've done.",
        "You do?",
        "Sure.",
        "Oh, really?",
        "No. But then technically neither have you.",
        "No cinema in RuneScape.",
        "It's a real shame.",
        "Yeah.",
        "So... you should probably get back to it.",
        "*cough* Nerd.",
        "Nothing.",
        "You're doing great, kid. Don't get cocky!",
        "Bankstanding!",
        "Bankstanding! One of my favourites, to be honest. Just stand in the bank area to get started. Make sure you're ready to feel the burn, though. Not everyone can handle the pressure!",
        "You're done here, let's pick another room!",
        "I have multiple clients running.",
        "No it isn't. My accounts aren't interacting in any way.",
        "I like to max on multiple accounts at the same time. You haven't lived until you've hit a hundred and eight 99s at the same time.",
        "I love it!",
        "You're doing great, kid. Don't get cocky!",
        "Riding!",
        "Well... I don't want to lower your expectations, but... that's pretty much true. Anyway, just go stand on one of those squares and follow the instructions!",
        "You're done here, let's pick another room!",
        "You're doing great, kid. Don't get cocky!",
        "Sailing!",
        "I know right!",
        "Well, yeah... It's in a sorry state, to be honest. They didn't have time to make the sea, or boats, or islands... But hey, head to the boarding point, and experience something which is almost, but not quite, entirely unlike Sailing.",
        "You're done here, let's pick another room!",
        "Oh hey, good job!",
        "Yeah, good job. I mean that sincerely.",
        "Well thanks Max.",
        "No worries. Here's your fragment.",
        "See you!",
        "Good job getting 99 in all those skills!"
    ],
    "This door has 'Warning": [
        "All The Bees' written on it in shaky handwriting."
    ],
    "Riding tutor": [
        "Hello there, I'm the Riding tutor!",
        "Ah...well...yes, but we haven't quite got the skill finished yet so this is what we have to work with. It's basically the same, you just have to imagine you're moving. Climb aboard one of the rocking unicorns and copy me to gain XP!",
        "Rock!",
        "Trot!",
        "Gallop!",
        "Turn!"
    ],
    "Black Knight Titan": [
        "Hahahahahaha! You fool. You have fallen into my trap!",
        "Yes!",
        "Oh yes!",
        "Don't you recognise me?",
        "I am... the Black Knight Titan!",
        "I don't think you heard me. I said THE BLACK KNIGHT TITAN!",
        "I don't think you can have, because if you had, you would have reacted with more genuine emotion.",
        "I AM THE BLACK KNIGHT TITAN!",
        "Better!",
        "My tale is a tragic one.",
        "Really?",
        "You won't spacebar through it?",
        "I am not the first Black Knight Titan. Somewhere up there, an ancient fossil runs around with impunity.",
        "The original Black Knight Titan!",
        "I'm the graphical rework. My predecessor is the ugliest model in Runescape[sic].",
        "I am his replacement, and I am *so* beautiful! I was made using industry standard modelling tools, not cooked up in some sort of bespoke contraption! My poly count is higher than your IQ! My textures are UV unwrapped! I'm so unwrapped I make my predecessor look like a burrito. A burrito that's been wrapped up as the prize in pass the parcel! A burrito that -",
        "But the team were too busy working on high priority ninja fixes to put me in game. I just languished here.",
        "You don't understand. The old NPCs here don't want to associate with me. I'm everything they hate! I'm beautiful and they're so ugly! They call me vain! Vain! Me? How can I be vain when I'm so beautiful? So I was forced to live... alone... I tried haunting the ruins of Old Falador but Guthix kept wandering around singing 'I Dreamed A Dream' to taunt me. That's not even from Phantom of the Opera! It's from Les Mis! I don't belong down here. I belong up there, up where they walk, up where they run, up where people can appreciate me.",
        "Indeed you have surmised that the altar is the key to my plan. Life runes are what the people of this place use to respawn. But the altar is too powerful! Without needing essence, it generates life runes constantly. The cabbagemancer regulated it, transforming the excess life runes into cabbages and sending them to the surface. Cabbages are so tasty that people are eager to consume them and thus maintain the balance.",
        "I killed her!",
        "It's okay. She was a botter *and* an account sharer. So who's the real monster?",
        "Indeed not! Without the cabbagemancer, there was no one to control the flow of life runes! They got out of control! The altar exploded. With the supply of delicious cabbages cut off, I knew someone would investigate, leading them, inevitably, here. And whoever arrived would bring with them my ultimate goal... A disk of returning!",
        "Yes! I bet you feel stupid now.",
        "That may be, but breaking the fourth wall will not save you now.",
        "Indeed! Let's you and me fight! I shall slay you, loot the disk of returning from your gravestone, and use it to ascend to the surface! Prepare to taste the wrath of my high-res broken looking sword thing!",
        "DIE!",
        "Guess again!",
        "Respawn!",
        "Defend yourself!",
        "No!",
        "Yup! Let me introduce you to this broken lance thing I have!",
        "Yeah, I suppose.",
        "I could make lines of fire that you have to avoid standing in?",
        "I could make a black hole that sucks you in?",
        "I've got it! I'll use both weapons at the SAME TIME!",
        "Why can't I respawn?",
        "It hurts. Is this... what *dying*... feels like?",
        "I can just have it?",
        "So many evil plans, so much loneliness. I should have just asked nicely. Thank you so much!",
        "I will. Here I go!",
        "I don't know what happened! I was just standing out in the world one minute, and then stuck here the next!",
        "Oh. That makes me sad. Is there anything you can do to help?",
        "Oh no, I'm back! What did I do wrong this time?",
        "I wasn't made for this place, my friend. I need to be up there, where the beautiful people are! Can you help me out?",
        "What? What happened? Why am I back here? Nooooo!"
    ],
    "Andrew": [
        "Player in trouble?",
        "We're here to help!",
        "Finished!",
        "Is that all? I have loads of them. Here, you can have this one.",
        "Of course, why not?",
        "You're welcome. Make sure you pay it forward!",
        "So what is this place?",
        "That's a great idea!",
        "It's settled then. We fix up the life altar and move in here.",
        "Here's your cabbagespeak amulet!",
        "It's a good thing I built in a 'return to owner' function then. Here you go...",
        "All's well that ends well.",
        "No, I'm afraid not. It's very dangerous.",
        "You don't know any spells that need life runes, do you?",
        "No need to worry then!",
        "Of course. I can send you back to our old farm if you like."
    ],
    "Paul": [
        "We need to help!",
        "Er, do what?",
        "You hold him off!",
        "Who is this?",
        "Why were you fighting him?",
        "The life altar! I always wanted to see that go into the game. Hm... what did I just say?",
        "Plus, it's like a secret lair, which is super cool!",
        "What a happy ending to my quest! Who would have thought when we started out that it would take such an unexpected turn?",
        "That was my favourite quest I've ever been in.",
        "No, sorry. Only players can be pmods, and only cabbages can be players.",
        "Tell you what, you can be an honorary pmod! How about that?",
        "Oh. Didn't you enjoy the quest?",
        "Oh I see. Well, okay. Since you did help us out and everything. Level all your free to play skills to 30 and I'll find a lamp for you.",
        "Oh, well done! Here's your lamp as promised then.",
        "Try talking to Andrew about that. That's his kind of thing."
    ],
    "Gower brothers": ["Huzzah!"]
}
