{
  "This page contains dialogue related to Recipe for Disaster": [
    "Freeing Skrach Uglogwee.The content below is copied verbatim from RuneScape and thus copyrighted by Jagex."
  ],
  "Player": [
    "How can I help Skrach?",
    "And once again, but in English this time?",
    "Yes, I'm sure I can get some Jubbly Chompy.",
    "Ok then, what's involved... how do I get this Jubbly chompy?",
    "Oh come on... it can't be that difficult.",
    "Ahh right... I see.",
    "No way am I going to talk to Rantz.",
    "Oh Ok then, I guess I'll talk to Rantz.",
    "Nah, leave that Ogre in the frozen dimension!",
    "What should I do now to help Skrach?",
    "Just remind me again how I managed to unfreeze Skrach?",
    "And how do I get one of those?",
    "Oh yeah... I remember now...",
    "I'm trying to free Skrach, can you help?",
    "Ok, so can you help me get some Jubbly Chompy?",
    "A nice thought, but unlikely...",
    "What's involved?",
    "What do I get in return?",
    "Ok, I'll do it.",
    "Ok, will do!",
    "No way am I doing that!",
    "I'm trying to free Skrach, can you help?",
    "I guess this is the 'watery place'. What now?",
    "Oh, so you want to go to Karamja... hmmmm, it's a bit of a long walk. You'd probably be better off with a boat!",
    "Ohhhh... sorry! Ok, for a boat you'll need something that floats in order to make a hull.",
    "Close!... But perhaps a tree would be better?",
    "...very good...",
    "What are these 'hatsies'?",
    "Ok, show me your 'hatsies'.",
    "No thanks.",
    "Can you tell me how to get Jubbly now?",
    "You can't use that as a boat! The roots are still hanging off it.",
    "Well, yes, you've got no space to put anything in there... it needs to be hollowed out a bit.",
    "What are these 'hatsies'?",
    "Ok, show me your 'hatsies'.",
    "No thanks.",
    "Ok, the boat's ready, now tell me how to get a Jubbly.",
    "Bestest groundy? New land?",
    "???",
    "Can you tell me how to get Jubbly now?",
    "Ok, what do you need me to do now?",
    "Huh?",
    "Yes please, I'll get a lift back with you.",
    "No thanks.",
    "Okay, now tell me how to get Jubbly!",
    "I've helped with your scheme to get over to Karamja, now help me by telling me how to get Jubbly!",
    "Just tell me!",
    "I saw some large static ogre spits near Jiggig and Rantz. Perhaps I can cook this jubbly meat there?"
  ],
  "Fortuneteller": [
    "Skrach! He'd be un-frozen in a jiffy if he just had some Jubbly.",
    "Sorry... Skrach, being an ogre likes Chompies, and a real delicacy is Jubbly Chompy bird. Do you think you could get some?",
    "That's the spirit!",
    "Ah, well, that's where it breaks down a bit you see. The only thing alive which might help you get the Jubbly Chompy is the most confusing beast that RuneScape has ever known.",
    "The situation is lost I am afraid and I understand totally if you decide not to help Skrach.",
    "I'm afraid it is. You see... you need to go and speak to an Ogre called Rantz over in the Feldip hills.",
    "How do you feel about getting Jubbly Chompy now and freeing Skrach?",
    "I quite understand... I really do... There's no excuse for him really...",
    "Well, I do pity you, and wish you the best of luck!",
    "Alas, I can certainly relate to what you say. However, he deserves to be set free, the same as everyone else.",
    "Skrach needs Jubbly chompy in order to be unfrozen, you'll need to talk to Rantz about how to get that. Perhaps the cook can be more helpful.",
    "Good work adventurer, I've teleported them away to safety! You only have [number] council members left to protect!"
  ],
  "Cook": [
    "Certainly. Everyone knows that Skrach loves Jubbly Chompy, preferably roasted on a spit! The bird's carcass is so big, it can't be cooked any other way.",
    "I wouldn't know much about that, but I believe you talked to Rantz quite a bit over in the Feldip hills. Apparently, he got you to do him quite a few favours before you actually got the Jubbly.",
    "Did you want a reminder on any other of your brave exploits?"
  ],
  "Rantz": [
    "Skrach... he big boss? Skrach like da Jubbly chompy... is bestest yums like chompy.",
    "Rantz tell creature hows to stick da Jubbly... just like da Chompy...",
    "Soon, creature be da ogre too like Rantz! Harr, har, har!",
    "But creature do Rantz stuffsies first... yous creature gets Rantz to other lands over 'der so Rantz gets da stuffsies for da glugs-glugs.",
    "Yous do dis creature for da Jubbly?",
    "You's creature gets Rantz to other lands over 'der so Rantz gets da stuffsies for da glug-glugs.",
    "Me's shows da creatures how to sneaky, sneaky stick da Jubbly!",
    "Dat's da good fing, you's creature goes down by da watery place, over near da cabbage! Me's says more der'.",
    "You's creatures says dis before! Skrach big boss? Skrach like da Jubbly chompy...is bestest yums like chompy.",
    "So is creature here to talk 'bout free hatsies or Skrach?",
    "You's creatures says what Rantz need for da going over da big water to da overder place.",
    "Is what me's says... you's creature no helpsies... just says Rantz saysies back!",
    "Uh rocksie?",
    "Me finks me has found one...",
    "So is creature here to talk 'bout free hatsies or Skrach?",
    "You's creatures not done for Rantz fingies yet! Da boatsie is-da guddun... will carry rantz[sic] to da over place?",
    "Ok, you's creature makes it better!",
    "Creatures not done yet! Da boatsie not good for da stuffsies! Da stuffsies for da glug-glugs goes in da watery stuffs.",
    "Ok, you's creature makes it better!",
    "Yous do other stuffsies for Rantz first. We's needs da bestest groundy for da walking on new land.",
    "Rantz use stabbie chucker and stick da dirt for da over der' place. You's creature make da chompy by da stabber so Fycie and Bugs sniffs da bestest yumms and splosh over wiv da boatsie!",
    "Ok you's person... goes find da stabber!",
    "Creatures not done Rantz stuffsies yet!",
    "Rantz done used da stabbie chucker and stock da dirt for da over der' place. You's creature make da chompy by da stabber so Fycie and Bugs sniffs da bestest yumms and splosh over wiv da boatsie!",
    "You's creature... goes to da over der' place and cook da chompy by da stabber!",
    "What's creature's say?",
    "Ohhh, get's Jubbly... dat's da easy fing... you's creature is a bit stooped for not know dat!",
    "Okays creature's keeps hairsies on...",
    "Ok then you's creature... you's use da big blowers on da fatsie toady. Creature makes da fatsie toady and den needs da rocksie an da wooly fing to stick it down da ground."
  ],
  "Bugs": [
    "Hey there... we's could smell da Chompy from ages back... it smells lish!",
    "Dad says you can get a lift back with us if you want?",
    "Dad says you can get a free lift back with us if you want?"
  ],
  "v • d • eRS3 Recipe for Disaster": [
    "Freeing Skrach UglogweeA subquest of Recipe for DisasterNPCs"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Recipe_for_Disaster:_Freeing_Skrach_Uglogwee?oldid=33962349’"
  ]
}