{
  "Arianwyn": [
    "Player, just the person we need.",
    "Do you remember Thorgel?",
    "Yes, him. Following your quest to enable the temple's defences, he stayed there to guard the Death Altar.",
    "Yes, he has decided to join our cause and looks to help remove threats from our lands, so that he and his men can return safely to Keldagrim. Who knows what the mourners would do to them...or the Underground Pass, for that matter.",
    "Because he has just sent word via messenger that something is going on down in the temple.",
    "No, no. This is something different entirely. It appears there may be more to this temple than meets the eye. Are you ready to help us again?",
    "Hurry back when you have a moment. This investigation is too important to ignore.",
    "As I was saying, Thorgel has reported that something has happened at the point where the light merges in the temple. It is of vital importance that we investigate.",
    "Yes, this discovery could be linked to the elder elves' whereabouts - they disappeared after building the temple. It is too important for me to ignore, so I'm coming with you.",
    "You forget the great resource we have gained recently: you. You can walk freely through their outpost and into the tunnels to the temple. With the temple's defences in place, it should be safe to use elven magic in there.",
    "The plan isn't quite complete yet. We'll need a few things to make this work... First, you've got to get me a disguise - whatever you wear to get into their outpost.",
    "Don't forget you'll still need an outfit yourself.",
    "That should give us options if, Seren forbid, we get spotted by the Death Guard. Second, we'll need a distraction. We could teleport in without one, but I foresee capture if we try. Elven magic will not be subtle and the Death Guard are always on alert.",
    "You know the area better than I, so this one is down to you. If we have an ally in the outpost, then use them.",
    "The last thing is a method of getting to the Temple of Light. You'll have to bind a teleport crystal to the location we'll be teleporting to.",
    "I know you've not tried crystal chanting before, but I've already prepared this one, so most of the work is done. The most skilled of us can chant pitches beyond what human ears can hear, and thus shape seeds into forms of our choosing. As shape and form doesn't matter here, you'll only need a basic chant. Sing into the seed when you're in the area we need to teleport into - the harmonic feedback in the area will be enough for it to bind to that location. If you accomplish this I can strengthen it to carry us both close to the doors of the Temple of Light.",
    "May Seren's song guide you. I'll finalise things here to make sure Lletya is secure in my absence.",
    "Ah, the return of Player! Have you thought about helping us yet?",
    "Well, as you can see, I'm not disguised. You might want to sort that out.",
    "Thanks, is it okay if I take it off your hands now?",
    "I think I look quite the part now.",
    "Okay, but we can't leave until you've given me a complete mourner outfit.",
    "I've not had the enchanted teleport crystal from you yet. Did you chant it?",
    "Wow, not bad for your first chant. It seems to have been bound to the area enough for me to strengthen it.",
    "[sic]",
    "I doubt you heard that, did you? You've shown promise, though. Perhaps I could have Eluned teach you more in the future.",
    "It's not easy to do. I don't want to chant upon my own horn, but there are few that can match me.",
    "Definitely. Nice job.",
    "You've not mentioned a distraction to me. Did you find an ally who can help us on the inside?",
    "A gnome? Can he be trusted? What did it take to get his help?",
    "Well, okay, I'll trust your decision. Are you actually going to help the gnome out, though?",
    "Fair enough. I can't imagine he'll wait forever for the trust to be returned, though, so do it before we are finished, if you are intending to.",
    "You didn't waste any time doing that, did you? Let's hope your good deed pays off for us.",
    "Try to get the tasks done as soon as possible - time is wasting.",
    "Great news! That's all the tasks complete! I guess thanks are in order.",
    "Well, we've got everything we need. I'm ready to go, are you?",
    "Wait, where's your disguise? You'll need to be dressed as a mourner too, else you'll give us away if anyone were to see!",
    "I'll be here when you're ready.",
    "Okay, the enchanted teleport crystal should link the two of us temporarily. You go first and quickly feedback if the coast is clear. If it is, I'll be able to use the remaining power to teleport in after you.",
    "Okay, I'm with you.",
    "You are the one who has got us this far and you're saying you've forgotten?",
    "Fine, then. What would you like your memory refreshing about?",
    "Well, where to start? For one thing, they are, in fact, one and the same. The Death Guard are a group of dark elves obsessed with bringing the Dark Lord back to our lands. They used King Lathas's greed against him - Lathas wants to conquer Camelot and saw helping the Death Guard as a way of doing so.",
    "That's right, but Lathas himself seems to have been used. While it was he who had Tyras killed...and who staged the plague to stop the threat of Iban on Ardougne, it turns out the Death Guard are just using him.",
    "And in doing so, they set up the outpost beneath West Ardougne and, over time, that's granted them access to the caverns below, where they hope to find the Temple of",
    "No problem, Player. Anything else?",
    "As we both know, the temple is, in fact, a massive safeguard to protect the Death Altar.",
    "In my opinion, no. The temple is a testament to elven craftsmanship. Although it protects the altar, there has to be more to it. Our great ancestors - the elder elves who founded Prifddinas - are the ones who built it.",
    "You only need to look at the temple to see their skill was on a different level to our own. With all the threats of the Dark Lord, the dark elves and the dangers beyond Arandar, the elders disappeared, along with the city of Prifddinas.",
    "A good question, Player. Our great capital no longer exists - it just disappeared from the map along with the elders. I fear it lost forever.",
    "I don't have that answer for you; good or evil may be behind its disappearance. I hope only to find it once more, if it even still exists.",
    "I've studied their movements extensively, Player. Are you sure they really came out of that gate? Anything else?",
    "Please be more careful with this one. Do you need anything else?",
    "Player, we've got to stay focused here. I suggest you lead me the correct way to Thorgel, else I'll have to leave for Lletya.",
    "Let's talk properly when we are going the right way. Lead me to the Temple of Light, else I'll have to head back to Lletya.",
    "Sorry, Player, we've been wandering too far in the wrong direction. I'm going back to Lletya - meet me there when you want to attempt this journey again.",
    "Player, we've got to stay focused here. I suggest you lead me the correct way to Thorngel, else I'll have to leave for Lletya.",
    "Sorry, Player, we've been wandering too far in the wrong direction. I'm going back to Lletya - meet me there when you want to attempt this journey again.",
    "I'll handle this one!",
    "Leave this place!",
    "Allow me!",
    "Shadow begone!",
    "Wow, I can't believe I'm actually here. This is elven history!",
    "It's amazing, and complicated to say the least. Where do we go next?",
    "Okay, following you.",
    "Okay, lead the way.",
    "Okay, following you.",
    "Okay, lead the way.",
    "Fine, but this will need investigating further. Come get me again in Lletya when you're ready to finish up.",
    "I'm going to speak with Thorgel and let him update me on the situation down here.",
    "Yes, if you wouldn't mind taking a quick look at the pillar itself. The energy from it didn't seem dangerous to you, so I imagine you can touch it. Let us know your findings, if any.",
    "What's wrong, Player? What's strange?",
    "What are you saying?",
    "Okay, but be careful. Although the energy appears not to cause you harm, who knows what it's really capable of.",
    "Just as well I have another...here.",
    "Okay, but be careful. Although the energy appears not to cause you harm, who knows what it's really capable of.",
    "I have another, here.",
    "Keep a more careful eye on it next time.",
    "Sorry, I was deep in conversation with Thorgel here and missed it - what happened?",
    "Well, it seems you may have some link to this energy. I would say the plan of action is clear.",
    "If the trinket is too small try something bigger...like yourself!",
    "No, it's clear you have some link with this energy. Besides, I need to be on hand in case something bad does happen.",
    "Ten out of ten for observation, now let's get on with this.",
    "I meant only IF something bad happens. Shall we get on with this?",
    "Okay, while this may sound dangerous, I'm sure it's straightforward. Just repeat the process of how you made the trinket.",
    "It's no different, then. Hop onto the Death Altar and then get to the power crystal.",
    "Thorgel? Care to help Player up?",
    "What are you doing out here? Get to the Death Altar.",
    "There you go. It's my only one, so be careful - no replacements!",
    "What? You lost it? You'd better find another way in, then; that was my only one.",
    "Wow, look at all that energy! You'd better get moving before it fades.",
    "Player! I apologise for leaving the temple; I had to return and ensure Lletya was safe while you continued the investigation.",
    "Tease no further, what have you discovered?",
    "And inside the door?",
    "An elf? How can it be that an elf has found this place before us?",
    "Any clues to who he was?",
    "I can't believe it! Prifddinas has been reverted to crystal form? They must have reverted everything behind the city walls!",
    "Amazing news; great working with you, Player. I'll send word to Thorgel right away and see if he can get some of his men energised like you were, now we know it's safe. As you've opened the doors, they can get in there and begin clearing the rubble.",
    "I will do, thanks again!"
  ],
  "Player": [
    "What's wrong, Arianwyn?",
    "Of course, he's the dwarf who tunneled into the back of the Temple of Light.",
    "Thorgel is working with us now?",
    "That's great news for everyone, but why did you ask if I remembered him?",
    "The Death Guard have made it through the defences?",
    "I'm sorry, Arianwyn, I can't deal with this right now.",
    "Okay, I'll help. What exactly am I helping with?",
    "WE investigate?",
    "Great, except you seem to be forgetting something. You said none of your elves have managed to get past the Death Guard.",
    "Elven magic? Sounds like you're forming a plan here without me - fill me in!",
    "Okay, it should be easy enough to get another set of mourner gear at Arandar or in the Death Guard outpost.",
    "So a full set of mourner gear for both of us. What's next?",
    "So what do you suggest?",
    "Hmm, okay. I'll have a think on that. What is the last thing we need?",
    "I'll get to sorting out our departure.",
    "About those tasks I need to do...",
    "Oh, yes, I'd better get to Arandar and grab a set of mourner gear for you.",
    "And sort it out, I have! I've got a complete mourner outfit here all ready for you.",
    "Sure, take it now.",
    "No, I'm going to keep it.",
    "I knew I forgot something. No worries, I'll get down there as soon as I can to enchant the blank teleport crystal.",
    "I tried my best. It seemed to get some feedback from the area - I hope it is enough?",
    "Wait, how did you chant with that gasmask on?",
    "Show off, I thought my chanting was pretty good.",
    "So the crystal will carry us both now?",
    "No, I'm still working on that. I'll let you know as soon as it's sorted.",
    "Yes. The Death Guard has a captive gnome inventor who's agreed to create a distraction. I've had his help before.",
    "I'll trust him because he trusted me to put in a good word with the head mourner to set him free.",
    "I might get around to doing it...",
    "Yes, in fact, I've already had a word with the head mourner and he's considering it.",
    "I'd say so. Are we ready to go?",
    "I'm ready, let's go.",
    "Good point. I suppose I'd better sort out a disguise for myself.",
    "Got it - send me first to get eaten by dark beasts.",
    "Okay, Arianwyn, it looks clear!",
    "You made it! Welcome to the Temple of Light! Follow me, I'll take you through to Thorgel.",
    "Let me do a few things first.",
    "Remind me about what has happened so far.",
    "Of course not, it's just that so much has happened....",
    "The Death Guard and mourners.",
    "Ah, yes, I'm remembering now...and you opened the sealed message I was carrying, which exposed Lathas as a traitor to me.",
    "Yes, I recall them saying they overstated the threat so as to scare him into faking the plague and handing over West Ardougne for them to run.",
    "Great, thanks for that reminder, Arianwyn.",
    "The Temple of Light.",
    "And that's it?",
    "The elder elves?",
    "What do you mean? How can a city disappear?",
    "I'm still confused! How can a city just disappear?",
    "But what of the mourners heading over Arandar - I've seen them come from out of Prifddinas's east gate!",
    "That's all, thanks.",
    "Actually, don't worry.",
    "Calm down. I just need to talk to you about something.",
    "Maybe...",
    "Well, no, I didn't. Sorry.",
    "Listen! Will you let me finish?",
    "Not yet, let me finish.",
    "Getting straight to the point, I need a favour...and you've been helpful in the past.",
    "Let's just say I need to get my 'friend' down here and he hasn't got the clearance. I'm going to try teleporting directly into the caves, bypassing all the security.",
    "Not yet, let me finish.",
    "Alright, I'm not with these guys really. What I'm trying to do could stop some seriously bad things happening. Are you going to help the side of good?",
    "How dare you assume such things! Do I need to get my torture feather out again? My friend just needs to get in so he can further the Death Guard's plan a little faster.",
    "Let's have it. No, wait, let me guess: toad crunchies?",
    "Okay, how about this... You just cause as much trouble as you can here, doing whatever you want to distract these guys while I sneak in. In return, I'll have a word with the head mourner about releasing you.",
    "No, not yet, but I might get around to it sometime.",
    "Nothing major, I hope. I was just thinking about the gnome inventor we've been holding captive.",
    "I think what I have to say is important, sir? It's just about the gnome, and having him so close to operations here. What if someone were to sneak in and see him?",
    "Imagine if a curious child or thief managed to get down here and spotted him. He's the only evidence that our operations here aren't quite legitimate, if you see what I mean.",
    "It is entirely theoretical, but all loose ends must be removed to ensure success, don't you agree. Plus the gnomes have magicks of their own.",
    "We should release him.",
    "Maybe so, but we can't risk him being found imprisoned against his will, surely?",
    "Okay, I'll leave you to it.",
    "Just make sure he's watched.",
    "No, I have looked everywhere, but I can see no sign of them.",
    "Nothing other than the beasts you spoke of.",
    "I'll come to you as soon as I dig anything up.",
    "Yes, already done, my short friend. I put in a good word and suggested we release you after your help.",
    "He's considering it. Stay positive!",
    "No, not yet, but I might get around to it sometime.",
    "I think it might be dangerous to chant here; this destination would be too close to the Death Guard's base.",
    "This area seems suitable. I just need to find an area closer to the temple, but not so close that the shadows will attack.",
    "I'm not going to be able to sing well wearing this gas mask - I'd better take it off.",
    "This would make for a great teleport spot! I guess I'll try singing at this crystal now.",
    "That seemed to work - I must have an enchanting singing voice.",
    "Sorry to bother you, Arianwyn, but I've lost that teleport crystal you gave me.",
    "Hey, Arianwyn, are you ready to teleport to the Temple of Light?",
    "So, what do you think of the temple?",
    "The temple is to the west. Follow me and we'll go inside.",
    "The crystal here is familiar, I remember going up the stairs near it - let's go.",
    "Ah, I remember this area...I went south. There is a small staircase that we need to climb up.",
    "Next we go north - the stairs there lead down towards where Thorgel is.",
    "Thorgel's on the bottom floor of the temple in the room on the west side. Let's head there.",
    "Can you leave me alone?",
    "I'm not sure it's wise to do that until I've brought Arianwyn to Thorgel.",
    "We made it! And both still in one piece too.",
    "Thanks. I guess I should leave you to fill him in on the news.",
    "No problem. Do you need me to do anything?",
    "I'll get right on it.",
    "Well, that was weird.",
    "It's hard to describe, but it reminded me of the crystal trinket...as if they are linked somehow.",
    "It's strange, Arianwyn, very strange.",
    "It's hard to describe, but all that time I spent down here, getting that crystal trinket powered up...I guess I got used to the energy of this place.",
    "I'm saying that the energy of that pillar really reminds me of the crystal trinket and the copy you gave me, as if they are somehow linked.",
    "Luckily, I've got that trinket on me. I guess the next thing to do is to try using it on the pillar.",
    "I lost that crystal trinket you gave me.",
    "Thanks! I guess the next thing to do is to try using on the pillar.",
    "I lost that crystal trinket you gave me.",
    "Thanks a lot, Arianwyn.",
    "Wow! That was different. I'd better let Arianwyn know what happened.",
    "Did you see that, Thorgel?",
    "I think the trinket worked, but it was too small to deal with whatever the pillar was trying to do.",
    "Well, things just went from strange to...something else!",
    "It looks like my hunch was right. The pillar's energy is similar to the trinket's, as they sparked a sort of reaction with each other. It felt as if the trinket was too small to contain the energy, though.",
    "I'm not going to like this, am I?",
    "Or we could try you?",
    "But you're a similiar size to me!",
    "...",
    "What do you mean if something bad happens?",
    "I'm not even going to argue.",
    "Well, I took the trinket to the Death Altar, where it charged, then I placed it with the power crystal on the third floor of the temple.",
    "What do you mean 'hop onto the Death altar'?",
    "Sure thing... I don't suppose you have a death talisman I could have?",
    "I think I need to get up on the altar, Thorgel...",
    "I think I can climb up on my own, thanks.",
    "Okay, let's do this.",
    "Not right now.",
    "I'll need to energise myself like Arianwyn said if I hope to get a reaction out of this.",
    "Well, that door's got to be the way forward. I just need a way to open it.",
    "There are four light switches on the wall near the door. They must have something to do with it.",
    "Another light beam? It must be involved somehow.",
    "Well, that's a good start, but I still need to carve out a hole in this one to make it like the others.",
    "That was quite the read. I'd better get back to Arianwyn and show him this discovery.",
    "I'd say we're one step closer to finding the elven city. It turns out it is underground in crystal seed form! No wonder I've never seen it on a map - it has to be grown!",
    "Yes, already done, my short friend. I put in a good word and suggested we release you after your help.",
    "He's considering it. Stay positive!",
    "There's a delivery of toad crunchies for you for good behaviour?",
    "Such a shame.",
    "I know, thanks again!",
    "Will it help if I say I'm sorry?",
    "Not a problem, Arianwyn, and you won't believe what I've found out.",
    "I managed to figure out how to open some more light- locks, which revealed a ladder. I climbed far above the room to trigger a final switch, opening the door below.",
    "A dead elf, beneath a rockslide.",
    "Because I don't think he entered from the temple side. He was clearly heading from where the corridor leads to and must have perished in the rockslide.",
    "Oh, yes, you might want to take a look at this.",
    "You said this might lead to the discovery of what happened to the elders and Prifddinas. It looks like it has!",
    "Sounds like a plan. Let me know if you need my help again.",
    "Hello.",
    "Not bad, thank you.",
    "Well, he had to strengthen it, but it was a good start apparently.",
    "Oh, I don't have one.",
    "I've got one right here.",
    "Okay, sure.",
    "[sic]",
    "[sic]",
    "[sic]",
    "Thanks for your help Eluned.",
    "Hello, you look new here. Welcome to the Death Guard!",
    "You're not...you know?",
    "You're not an elf under that gas mask?",
    "Would you believe me if I said there was? What if you could take that gasmask off and be completely safe?",
    "You think I'd try to kill you just to become the new janitor?",
    "Yet you live to tell the tale?",
    "You look new here, have I seen you before?",
    "Global problems? What's that meant to mean?",
    "Hmm, I guess you have a point.",
    "Good to hear it's working out for you.",
    "Hey, Thorgel, what's new?",
    "Aw, I missed you guys helping each other scramble up the Death Altar and running about this temple like crazy?",
    "I think I need to get up on the altar, Thorgel...",
    "I think I can climb up on my own, thanks.",
    "Okay, let's do this.",
    "Not right now.",
    "I've got some of them with me.",
    "I'd rather you didn't.",
    "Do you have another copy of the list?",
    "What do you need all this stuff for?",
    "What about the archery ticket?",
    "Why didn't you ask for the prizes then?",
    "Why do you want the battered book?",
    "Current events? But it's... Oh never mind.",
    "How do you explain the dusty key?",
    "Right, why do I get the feeling I shouldn't?",
    "Blood talisman?",
    "Yeah, right, all of those are just 'supplies'.",
    "No, I'd better get looking for them."
  ],
  "Gnome": [
    "What are you after now?",
    "You brought toad crunchies?",
    "Oh, come on. This nail-and-prune stew gets old after a while, you know.",
    "Can I have those toad crunchies yet?",
    "Fine, fine, get on with it.",
    "What favour?",
    "Can I have those toad crunchies yet?",
    "Why do I get the feeling you're not really one of these guys?",
    "Fine, but on one condition.",
    "No, freedom. My freedom.",
    "I suppose we have a deal. I can't see if you speak to him really - you could just walk out - so I've no choice but to trust you'll keep your word.",
    "I was just thinking about starting to make trouble here. Did you speak with the head mourner about my release?",
    "Sometime? I'm trusting you here!",
    "I was just thinking about starting to make trouble here. Did you speak with the head mourner about my release?",
    "And?",
    "Sometime? I'm trusting you here!",
    "Well, I caused a distraction and I didn't see you get caught, so I assume my side of our deal worked. Did you speak to the head mourner about my release?",
    "And?",
    "Just the person! Guess what I overheard from the guards outside.",
    "No! I heard that the head mourner was discussing getting rid of me...and not in a good way!",
    "I helped you! I helped you smuggle your friend in!",
    "I helped you! I trusted you and you didn't even do something as simple as talk to the guy about releasing me.",
    "It's too late now. I'll remember this, you mark my words."
  ],
  "Head Mourner": [
    "What are you doing here human?!?",
    "Guards!",
    "What do you want?",
    "Since when is your place to think?",
    "Sneak in?",
    "Well, I can see that it wouldn't look good, but are you silly enough to think out security measures can be breached?",
    "Hmm, that's true. We do have to be careful. What do you think we should do with the prisoner?",
    "Release? That may be a bit drastic, don't you think?",
    "Okay, you make a good point. I will consider it.",
    "He is being watched! Enough of this. Okay, I'll leave you to it.",
    "Any news yet on our missing dig crews?",
    "This is not good news, did you find anything else down there?",
    "I must ask you to return to the search and remember if you see anything elven-made down there you must let me know. After all that is what we are here for.",
    "I've got no time for you, I'm sorry. I need to focus on my missing dig crews. Yes, I'm still considering your proposal to release the gnome."
  ],
  "Mourner": [
    "Die human scum!"
  ],
  "Mourner (#1)": [
    "Can you hear that?",
    "Argh, make it stop!"
  ],
  "Mourner (#2)": [
    "My ears! It hurts!"
  ],
  "Thorgel": [
    "Wow, I can't believe you got Arianwyn here safely. I never thought I'd see the day.",
    "Much appreciated, Player, he will probably have something for you to do while we catch up, so I'll let you speak with him first.",
    "I saw: you touched the pillar. What did it feel like?",
    "Crystal trinket? Sounds like this is something to speak with Arianwyn about in case he can offer further guidance.",
    "Yes! You seemed to spark a serious reaction out of that pillar. It seems like the trinket was linked after all.",
    "I'd definitely speak with Arianwyn about this - he'll know what to do.",
    "Sure, I'll meet you at the altar, Player.",
    "Indeed, are you ready for me to help you up?",
    "I have no doubt that is true, but I have to help. We can't risk you damaging the altar as you climb up.",
    "Okay, here we go!",
    "Wow! I can't imagine that charge will last forever. You'd better get to the power crystal in the Temple of Light before it wears off.",
    "Okay, well, I'll be here when you're ready.",
    "You're already energised, so don't waste time speaking to me - you'd best get moving before the charge runs out!",
    "Hey, Player, Arianwyn said to let you know he couldn't wait any longer. He's gone back to Lletya to make sure it remains safe.",
    "How did the investigation go in the temple?",
    "I thought these temples were quite the defences, but reverting a whole city to crystal? That's something else. Don't let me keep you any longer; I think Arianwyn will definitely want to hear of this discovery.",
    "Ah, Player, well met. Following your discovery, I've had a few of the guys take their pickaxes into the light and they are working to dig out the rubble.",
    "Such a shame, but I'm sure you'll get over it.",
    "Indeed, are you ready for me to help you up?",
    "I have no doubt that is true, but I have to help. We can't risk you damaging the altar as you climb up. Okay, here we go!",
    "Okay, here we go!",
    "Wow! I can't imagine that charge will last forever. You'd better get to the power crystal in the Temple of Light before it wears off.",
    "Okay, well, I'll be here when you're ready.",
    "Hi again, how're you doing with those items we need?",
    "Great, Can I take everything I need?",
    "Doesn't look like you do to me.",
    "Wait, you don't have anything. Quit wasting my time!",
    "Oh, well, we don't get many deliveries down here, so it's supplies mostly...",
    "Well, you see...umm... We don't really get much chance to, er, go out or anything...and we'd like some of the prizes some day.",
    "Oh, no, that'd just be sad.",
    "Oh just some light reading, it's nice to catch up on current events occasionally.",
    "Ah...Um... I'm not sure how that got on the list... Can we have it anyway?",
    "Pretty please... with a blood talisman on top!",
    "Oops! I meant a death talisman!"
  ],
  "Congratulations! You have completed": [
    "'Within the Light' - Complete this Master quest.",
    "'As Clear as a Crystal Seed' - Unlock the Temple of Light teleport after 'Within the Light'."
  ],
  "Eluned": [
    "Hello again, how is it going?",
    "I understand you agreed to help us! This is good news indeed.",
    "You don't have any crystals that I can re-enchant.",
    "Arianwyn says you tried your first chant - and it showed promise?",
    "Excellent. Well if you have the teleport crystal, we can try and chant it to go to two locations if you'd like?",
    "I'll be here when you find one.",
    "Excellent, let's see what you've got - try chanting it for me.",
    "Not bad, but try this...",
    "[sic]",
    "Nearly! Just a bit more.",
    "[sic]",
    "Excellent, that'll ensure any more seeds will follow suit, try seeing where it can go now."
  ],
  "Scotty": [
    "Death Guard? Nah, mate, I'm just a hired hand - a cleaner, ya know?",
    "...",
    "Elf? Nah, mate: human. You're talking like there's some sort of mass conspiracy going on.",
    "Nice try! 'Hello, you look new here' - that ol' routine, eh? 'Take yer mask off,' you say. 'It's perfectly safe,' you say. Then, 'BOOM', Scotty gets the plague...and you'll steal my business!",
    "Of course! Everyone's trying to move in on us! You shoulda seen the fiasco when we were working some waiting rooms for a guy called Mandrith. Every other guy was coming at us with a dragon dagger!",
    "What can I say? This old broom's as lethal on people as it is on trash."
  ],
  "Sanchez": [
    "What's up, mate?",
    "Maybe, me and my bruv work all over the world - global cleaning business, global problems.",
    "Oh, come on, mate, you must have travelled a bit? Surely you've seen the amount of stuff people just drop on the floor.",
    "Yup, so me and my bruv' Scotty formed S&S cleaners. Got picked up right away by a guy called Mandrith - payed us 76k and hour, if you'd believe that? Turns out he relocated, though, so we ended up here.",
    "Oh, yeah, totally. I'd better get back to it, in fact."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Within_the_Light?oldid=35968067’"
  ]
}