{
  "Player": [
    "Hello?",
    "Do you want to go right now?",
    "What do you mean, strange stuff near Paterdomus?",
    "Yes? I need more than that if I'm going to traipse all the way around there to check it out.",
    "Hmm, that does sound a bit strange. I can't imagine why a Saradominist would want to go in the temple with all those Zamorakian monks in there. Perhaps I will check it out.",
    "Okay, that sounds like a good plan.",
    "If it's so important, why not check yourself?",
    "Sure, you'll be safe with me guiding you down to Burgh de Rott.",
    "Okay, thanks.",
    "Hey, Drezel. I was just talking to an adventurer waiting for a guide down to Burgh de Rott; he said he saw some suspicious people near the entrance of Paterdomus. Do you know anything about it?",
    "Restoration work? How is that exciting?",
    "Strange?",
    "A columbarium, what's that?",
    "Wow, that sounds really weird. I should go and check it out.",
    "Can you explain a bit about the columbarium?",
    "Sounds a bit creepy.",
    "Hmm, I think I have some ideas.",
    "Who do you think these suspicious people are?",
    "Well, I only know what the mercenary adventurer told me. Apparently, there were some Zamorakian and Saradominist figures seen going into the temple. Based on what the adventurer told me, they were all making an effort to hide their appearance. I'm not sure what it's all about.",
    "How are things here?",
    "And how is Ivan getting along?",
    "Okay, thanks.",
    "Hey, Drezel, what should I do again?",
    "Blimey! A blood talisman!",
    "Eh, strangers? That's suspicious! I'd better get out of sight!",
    "Looks nasty - better get ready for trouble!",
    "Oh no! They're teleporting away! This isn't over! I'm going to rid the world of you for good!",
    "Okay, I'd better have a look for some clues so I can convince Drazel of what I saw. I can scarcely belive it myself!",
    "Hey, Drezel, what should I do again?",
    "I've defeated some Zamorakian spies in Paterdomus!",
    "Well, they were talking about Guthixian Edicts and acting very suspicious.",
    "All of the spies teleported away except two bodyguards who attacked me. I defeated them, but they teleported away before I could finish them off.",
    "What should I do now?",
    "Okay, thanks.",
    "Well met, Drezel. I'm back from the temple and have something to report.",
    "I investigated the temple and found that there were some Saradominist and Zamorakian conspirators in there, who seemed to be working together. Unfortunately, they spotted me and most of them teleported away, but I managed to defeat two of the Zamorakian bodyguards and I found some clues.",
    "I found this Saradominist glove and this map, which seems to come from a Zamorakian map book. I know it's circumstantial, but I really think there may be some sympathisers in both camps who are working together. I remember that they were discussing Guthixian Edicts as well.",
    "What do you think this means?",
    "Do you think this has anything to do with the Guthixian Edicts?",
    "Well, it just seems a bit strange that although Saradominist and Zamorakian agents were working together, not one of the group seemed to represent Guthix. If the group were trying to find a way to live together, trying to ease old aggressions, surely some sort of Guthixian mediation would have been helpful.",
    "So, perhaps the reason Guthixians weren't involved is because they might have interfered with their plans...or maybe the conspirators were planning some joint venture against the Guthixians?",
    "This is all getting a little bit scary!",
    "What should I do now?",
    "Well, I suppose he did give me some useful information, so guess I owe him that much.",
    "Oh, yes, I'll stop in and see Veliaf as well. I'll bet the Myreque are still holed up in that dirty old inn basement. It was a filthy job having to clean that place up, I remember.",
    "I've forgotten where Veliaf is!",
    "Well, stop being all smug and tell me!",
    "Ah, yes. The inn basement. Thanks, Drezel.",
    "Okay, thanks.",
    "Hi, Drezel, what was I doing?",
    "Ah, yes, that's right. Those agents in the temple were talking about Guthixian Edicts and it seemed that they were Saradominist and Zamorakian sympathisers.",
    "Well met, Drazel. I'm back from the temple and have something to report.",
    "I investigated the temple and found that there were some Saradominist and Zamorakian conspirators in there, who seems to be working together. Unfortunately, they spotted me and most of them teleported away, but I managed to defeat two of the Zamorakian bodyguards and I found some clues.",
    "I found a Saradominist glove and a page from a Zamorakian map book, but unfortunately I don't have them with me.",
    "Okay, I think I'll go back to the temple to see if I can find them again. I'm sure they'll still be there.",
    "Yes, I checked out Paterdomus.",
    "It's strange, actually: it looked like Saradominist and Zamorakian agents were working together. I don't know how I should react. They were talking about Guthixian Edicts. Strange.",
    "You still want to go to Burgh de Rott?",
    "Sorry, chum, no can do at the moment!",
    "Okay, thanks.",
    "Where are we?",
    "I see. Anything else?",
    "How are you doing?",
    "Don't worry about it.",
    "What? Ivan! You tricked me!",
    "You're gonna get me into a lot of trouble one of these days! If not already!",
    "I'm not sure how much longer he's got...he's already ancient!",
    "Well met, Veliaf, it's good to see you again.",
    "I'm sorry to say that Ivan tricked me into bringing him down to Burgh de Rott...",
    "There's no need to take it out on me! Anyway, he's not so young. It's dangerous for all of us, and he's a part of this group. He accepts the dangers like everyone else in the Myreque. Why are you so concerned, anyway?",
    "Well, ten out of ten for secrecy. You should talk to Drezel about keeping things under your hat. You'd get on like a house on fire. Anyway, let's not argue, there's plenty of other, more useful things for me to be doing, I'm sure.",
    "Saradominist and Zamorakian forces may be working together.",
    "It's not certain, but I really feel that something strange is going on.",
    "Well, actually, it was Ivan who gave me the tip-off. He saw some suspicious sorts going into Paterdomus, so I checked it out. I went up to the top floor and there were six guys in there, plotting away. Two Zamorakian bodyguards had a go, and they were tough: switching prayers, changing attack styles...",
    "Yeah, I reckon three Zamorakians and three Saradominists.",
    "I saw it with my own eyes.",
    "Well, I guess we won't properly know through speculation, best to keep our eyes peeled and our ears to the ground.",
    "Do you have a job for me?",
    "Is that it? I'm a delivery [boy/girl]?",
    "Okay, then...let's have the crate of provisions.",
    "Hey, I know that route like the back of my hand. Take the boat around to the Sanguinesti region, then follow the sickle signs to the base. How hard can it be? Anyway, if I get stuck, I can still talk to Old Man Ral, he'll set me straight.",
    "What should I do now?",
    "Is that it?",
    "Okay, then, I'd better get on with the job.",
    "What's been going on down here?",
    "Sounds good.",
    "Okay, thanks.",
    "What's been going on down here?",
    "Sounds good.",
    "Okay, thanks.",
    "Well met, Veliaf, it's good to see you again.",
    "Well met, Veliaf, it's good to see you again.",
    "What should I do now?",
    "Can you explain a bit about what's going on in Morytania?",
    "Wow, that actually sounds like a lot.",
    "Hmm, it sounds like there's still a lot to do.",
    "What should I do now?",
    "Okay, thanks, Drezel.",
    "Okay, thanks.",
    "What do you do here?",
    "Oh, I'm trying to help out around here.",
    "Oh I am, believe me!",
    "Well met, Safalaan!",
    "Oh, sorry if I interrupted.",
    "Hey there...I've brought you some provisions from the Burgh de Rott base.",
    "What things were in the crate?",
    "How are things going here?",
    "Wow, that sounds pretty complicated, do you have a lot of knowledge in that area?",
    "Well, I don't think you need to worry about that, that's something I seem to have a knack for!",
    "How's the research going?",
    "How so? Did you find something out from the book on haemalchemy?",
    "Oh? What sort of thing?",
    "Yes, we know this already.",
    "How does this affect us?",
    "Well, that's terrible! We'll never have a chance against them in hand-to-hand combat if this is true!",
    "Can I help in some way?",
    "How could I find out about that weapon?",
    "What should I do now?",
    "But surely an unpredictable weapon on its own isn't going to be sufficient to damage the Vyrewatch - we'd know about it already.",
    "Ah yes, silvthril, that makes sense. Okay, I'll see if I can find a suitably unpredictable weapon for you!",
    "Scientific evidence? That sounds complicated...",
    "Okay, thanks.",
    "Hey there, Flaygian, well met!",
    "What things were in the crate?",
    "What do you do here?",
    "Oh, I'm trying to help out around here.",
    "Hi there, I was wondering if I could ask some questions?",
    "Well, you look like a fighter type, perhaps you have some experience with weapons? I need to learn about them.",
    "Flaygian is looking for a weapon we can use to fight against the Vyrewatch.",
    "...the weapon has to be quite difficult to master, and a little bit unpredictable...",
    "Flail?",
    "You're sure it's a flail? Has anyone used a flail against the Vyrewatch and damaged them?",
    "Right, okay...that was simple enough.",
    "Okay, thanks.",
    "Can't you just make a flail and try it?",
    "Hey there, I've found a book which backs up what a fighter said, both reckon that flails are the most unpredictable weapon. I think this is what you should try to make.",
    "Oh, okay, the page number is:-",
    "Oh, so there's something else you'd like me to do?",
    "He flatters me. I just hope I've proven useful to the Myreque cause.",
    "Okay, well there's one in Burgh de Rott, but it's a bit of a trek. Perhaps we should consider building one here in Meiyerditch?",
    "Okay, interesting story. But if you heard this through folklore, surely the furnace won't be functional anymore even if I do manage to find it!",
    "Thanks for the help earlier with the weapons info.",
    "Yeah, well, I guess we all have our strengths and weaknesses.",
    "Hey, Flaygian, well met!",
    "What did we discuss last time?",
    "I've found the furnace!",
    "Well, it's not working, if that's what you want to know.",
    "I'm not sure, but I'll see if I can give it a go.",
    "What should I do now?",
    "Any other distinguishing features of the house?",
    "Okay, thanks.",
    "Well met, Flaygian, I've returned!",
    "I did, but sad news, my friend: it was damaged and in very poor condition.",
    "But I fixed it! It's working!",
    "Okay, Flaygian, do you have anything else for me to do? I think I'm on a roll here! What else do we need to do in order to get this Vyrewatch weapon into production?",
    "Okay, so you need a length of silvthril chain? I guess I'll need some raw materials to make that.",
    "And you also want me to have a think about a flail-head to go on the end of the chain to complete the flail. Okay, I think I may have some ideas.",
    "Sorry, Flaygian, what did you need me to do again?",
    "Okay, so you need a length of silvthril chain? I guess I'll need some raw materials to make that.",
    "And you also want me to have a think about a flail-head to go on the end of the chain to complete the flail. Okay, I think I may have some ideas.",
    "Hey, good news: I've made some silvthril chain.",
    "What about some of these things in my inventory?",
    "What about this? Do you think this will work as a weight for the Ivandis Flail?",
    "Do you think my blessed silver sickle needs sharpening?",
    "How about using this as the head for the flail?",
    "Okay, consider it this way: it's the very symbol of Myreque resistance against these vampyres.",
    "Yes, I'm sure you're right, most fighters should get used to using it with time!",
    "Sorry, didn't mean to do that.",
    "What should I do now?",
    "Flaygian says to report that the development of the Ivandis Flail is well underway. It should be smooth sailing!",
    "Well met, both of you!",
    "What do you hope to do in the room?",
    "Okay, I'm going to think about it.",
    "What should I do now?",
    "Will I need to bring anything?",
    "Okay.",
    "Hmm, something doesn't seem quite right... it's a bit dark down here, and it's too quiet! Hello? Is anyone there? Oh, no! Safalaan and the Myreque fighters!",
    "[Andiess/Kael/Safalaan]! Are you okay?",
    "That wasn't funny!",
    "Well, guess I did a bit!",
    "What are we doing down here?",
    "What are our options?",
    "Is there anything I can do?",
    "Okay, well, I can see that the door is very solidly built, and it also looks as if the ceiling above the door is quite weak, so we can't go trying to force it. What we need is a more sophisticated solution.",
    "Okay, thanks.",
    "How's it going?",
    "Hey there!",
    "Blimey! No need to shout!",
    "So you should be, soldier, so you should be. Carry on!",
    "I've sawn through the door and kicked out a hole, we should be able to get through now.",
    "These tunnels are long!",
    "Yeah! Strange! Anyway, what's this room about?",
    "Okay, fair enough.",
    "What does this thing remind me of? Somehow familiar? Hmm, I should probably report back to Safalaan.",
    "Hi, Safalaan, I've checked out those stones, they do seem magical, I'm sure I've experienced something similar to this before...but I can't quite place it.",
    "Oh, my! What's happening to Safalaan?",
    "Safalaan! Are you okay?",
    "What happened? Are you okay?",
    "Hi, Safalaan, how are you?",
    "Err, okay, if that's what you want...But I am very curious.",
    "Sure, I can look into it!",
    "Blimey!",
    "Hi, Safalaan, what should I do now?",
    "Why can't Flaygian do this?",
    "Well, he may be frustrated and angry, but he should still have persevered, like you and I do. Seems like a bit of an easy way out to me.",
    "Remind me what things you gave me?",
    "What should I do now?",
    "But I'm not sure how to do that!",
    "Okay, I'll go and check.",
    "Okay, thanks.",
    "Hmm, it looks like the researcher has had enough of this particular problem. I wonder if I can work it out for myself and give the poor guy a break.",
    "Hi, Safalaan, I've made the Ivandis Flail!",
    "Do you really think that this can damage Vyrewatch?",
    "Mission? What do you mean?",
    "Okay, then! Here I go! One dead Vyrewatch coming right up!",
    "Hi, Safalaan, what should I do now?",
    "Field work?",
    "Okay, then!",
    "Good news, Safalaan: the Ivandis Flail is a Vyrewatch killer!",
    "Oh, that's a bit annoying! I came all the way back...",
    "Yes, sir!",
    "Yes, sir!",
    "Sorry, sir, what was it I should be doing again?",
    "No, sir! Sorry, sir!",
    "Yes, sir!",
    "Yes, sir!",
    "Well met, Veliaf, it's good to see you again.",
    "Hey, Veliaf, well met. Great news: we've created an artefact that actually harms the Vyrewatch!",
    "The Flail of Ivandis kills Vyrewatch! The researcher at the Sanguinesti Myreque base had some ideas about improving the Rod of Ivandis. I did some research with the local fighters within the Myreque base, they were great.",
    "Yes, it's a fascinating subject. Essentially, the researcher discovered that the vampyres have a limited mind-reading ability allowing them to comprehend which combat move we're likely to make next, so they can defend against it and reduce damage. Well, we worked out that the flail is the least predictable weapon to fight with, so even if the vampyres did understand our intention, we may not have the experience to pull that attack off and land a rather unexpected hit which the vampyres couldn't defend against.",
    "The flail itself is constructed from a Rod of Ivandis with 10 charges, a length of silvthril chain and a blessed silver sickle, which has had an emerald placed into it which is then enchanted.",
    "What should I do now?",
    "Okay, that seems like a good plan.",
    "Okay, thanks.",
    "Something strange happened with Safalaan!",
    "Safalaan, myself and two other Myreque fighters had gone into the tunnels under the Meiyerditch ghetto. We ran into a couple of Vyrewatch who killed one of the Myreque fighters immediately, the other simply ran away utterly petrified. Safalaan and myself tried to keep them at bay, looking for an opportunity to get away, but it seemed impossible. Safalaan was getting beaten up pretty badly. Suddenly, he got knocked unconscious...",
    "I thought we were done for, I really did. Then, slowly, but also very naturally, his unconscious body lifted up from ground...",
    "It happened...it levitated there, and a sense of power, a shimmering blue light, came from his battered and unconscious body until suddenly... Pow!",
    "No! Of course not! A burst of supernatural power exploded from his body, knocking the stuffing out of the Vyrewatch - they flapped away weakly, barely able to stay aloft. When their wits returned they beat a hasty - and cowardly - retreat!",
    "It's true, I tell you! Not a word of a lie!",
    "I killed a Vyrewatch!",
    "Yes! Safalaan says we should study its corpse to see if it reveals any details about better ways to kill them. The corpse has become hard like iron, but is as light as wood. Safalaan reckons that Drezel might have some ideas about what it means.",
    "So, you think I should show the corpse to Drezel?",
    "Okay, thanks.",
    "Well met, Drezel, I have much news for you. I've been on a mission in the Sanguinesti region and, with the help of some researchers in Meiyerditch, we've been able to create a magical flail that actually harms the Vyrewatch!",
    "I managed to destroy a Vyrewatch and I was meant to bring the corpse for you to research it, to see if there was a way to learn more about the Vyrewatch.",
    "Unfortunately, I don't seem to have it on me.",
    "Okay, will do.",
    "I managed to destroy one and I have brought you the remains to investigate.",
    "What is it, Drezel? What's wrong?",
    "It's strange you should say that, it sounds very similar to something I've heard before somewhere. Where was it? I'm sure it was in Morytania somewhere, near a temple...in a small village.",
    "How is your research of the columbarium going?",
    "Remind me again, what did the writing on the coffins say?",
    "Veliaf asked me to bring this Vyrewatch corpse to you.",
    "What should I do now?",
    "Okay, thanks.",
    "Hi, Drezel, good news: I've managed to cremate those Vyrewatch remains, I saw the spirit of the creature released, I think it's probably in a better place now.",
    "Well, I found an interesting key down there. Look, here it is.",
    "Good idea, I'll go and check it out.",
    "Drezel! You made me jump! This talisman looks great though!",
    "What? Oh! Ok.",
    "Well met, Drezel, I managed to lay that poor Vyrewatch corpse to rest.",
    "Why did I get a columbarium key when I cremated the Vyrewatch?",
    "Okay, go on.",
    "I think I told you all that, didn't I?",
    "Oh, I see! That makes sense; it must have been a very special ceremony.",
    "What should I do now?",
    "Oh, I hope not, I'm bushed!",
    "Okay, thanks.",
    "Well met, Veliaf, it's good to see you again.",
    "I visited Drezel like you asked, Veliaf, and had great success. I was able to find a way to bring peace at last to the spirit inside the dead Vyrewatch.",
    "Well, I was able to place the Vyrewatch on a pyre in the Paterdomus Columbarium with some pyre logs. I then set fire to it. The remains burned and the spirit was released, leaving a special key on a nearby pedestal.",
    "The key opened a special receptacle in one of the walls of the columbarium and I found an unbelieveable treasure.",
    "I found a blood talisman!",
    "I know, I nearly fainted! I believe there is plenty more treasure locked up in that columbarium ready for anyone who can release the spirits of the terrible Vyrewatch that patrol Meiyerditch.",
    "Well, I'm not primarily motivated by the treasure, though it certainly does help to fund my adventuring and, of course, lending a hand to worthy causes. But think about it, Veliaf: it should motivate the mercenaries like never before!",
    "I've completed your orders, sir!",
    "Oh? What did you hear?",
    "You don't need to worry about that, sir! In fact, it may be time to start warning the Vyrewatch about us!",
    "Sir, have you recovered from your earlier ordeal?",
    "Well, Sir, you started floating in the air and an effervescent blue glow appeared around you. It slowly increased in intensity and finally a surge of power coursed through your unconscious body and the attacking Vyrewatch were instantly weakened and fled. It was quite a display and probably saved both of our lives.",
    "Has it ever happened before?",
    "You can still remember this time, though, right? Maybe you just bumped your head the other times.",
    "Do you know why it happened?",
    "Cheer up, Safalaain! That doesn't sound so odd to me – then again, I've heard some very strange stuff in my time...",
    "Do you think we can use this 'power' against the vampyres?",
    "I'm sure it'll come back to you in time.",
    "That's a very interesting suggestion, it certainly would help the Myreque movement.",
    "Okay, thanks.",
    "Okay, thanks.",
    "Hey, Drezel, how are things?",
    "Yes, it's quite disturbing, but with the Ivandis Flail, we're soon going to teach them the error of their ways. At last, Drezel, the Myreque are fighting back!",
    "Hi, Safalaan.",
    "Is there anything I can help with here?",
    "You too, Ivan. How are things going?",
    "Glad to hear it!",
    "Then we must keep up the fight against them!",
    "I'm sure we'll pull through, Polmafi. Don't lose hope!",
    "What's wrong?",
    "Calm down, Veliaf. What's going on?",
    "Is there anything I can do to help?",
    "The Vyrewatch have been in Burgh de Rott?",
    "Why do you think they are taking them?",
    "What happened to the supply lines?",
    "Sorry Veliaf, I have to go.",
    "I'm just passing through for now."
  ],
  "Mercenary Adventurer": [
    "Yes, and greetings to you. I need to get down to Burgh de Rott, will you take me? Please?",
    "Well, before we set off, I have to say I saw something a bit strange at the entrance to Paterdomus. I just wondered if you think we should warn Drezel? I'm just a bit worried, that's all.",
    "Well, I saw some people going in there who I don't think would normally go in.",
    "Well, at least six people went in the building, three of whom you'd expect: Zamorakian agents, no doubt! But the other three looked a bit different, and one in particular was trying hard to conceal his attire, which had a distinctly 'Saradominist' appearance.",
    "I would check with Drezel first, make sure he's okay and let him know what you're planning on doing.",
    "Well, I have business to attend to in Burgh de Rott and some friends I want to catch up with. It's been a while since I attempted the route and the word is that you're the person to see about getting down there. So, when you're ready, we can get out into those swamps.",
    "Hey again, did you check out Paterdomus like I suggested? Are you ready to take me to Burgh de Rott now?",
    "And what did you find?",
    "Yes, it is a bit odd, isn't it...I wouldn't worry about it too much just now, especially since I really ought to be travelling down to Burgh de Rott.",
    "Yes, and the sooner the better - are you ready to go?",
    "Hello friend. How can I be of assistance?",
    "This is the swamp. We'll probably find many places like this here; it's like a maze. the easiest route, North will be of moderately difficult and East will be the hardest.",
    "Umm...can we go? I'm not familiar enough with the area to help more here.",
    "I've not got as many supplies as I'd like, I guess I'll just have to trust you.",
    "Ok, I'll just follow you and hope for the best."
  ],
  "Drezel": [
    "Greetings again adventurer. How go your travels in Morytania? Is it as evil as I have heard?",
    "I'm very sorry, Player, I've been busy with some of the restoration work that has been going on in the underground section of the temple. I really wouldn't have noticed anything else going on because it's all so exciting!",
    "There's no need for that tone, Player, please try to have some respect for my work here. I was shoring up some supports for the north-most wall in the well antechamber, when I realised that there was something strange about one section of wall.",
    "I did some investigation of the wall facade and found some stairs. I just had to go down and, in so doing, discovered the most amazing thing. It looks like some sort of secret columbarium is down there.",
    "It's a specialised form of burial chamber, where the remains of those that have passed away are stored in coffins which are placed in the walls. It's unique.",
    "I think that's a good idea, Player, but now I'm a bit worried about those suspicious people the adventurer saw going into the main temple. Can you also check that out and report back to me what you discover? I'd really appreciate it.",
    "Sure! The columbarium is a specialised form of burial chamber. Usually, the remains of those that have passed away are stored in coffins which are placed in recepticles in the walls. It's unique. There is something strange, though: a few of the coffins have broken open, and the only things inside are some personal effects, not the bones or ashes you would expect to see.",
    "It is a bit odd, to be sure. There is also some writing on the coffins which is written in the old tongue. My translation isn't spot on, but essentially goes, '...these worldy gains do I leave to whomever saves me from the dread service of Drakan, the fate worse than death'. What does that mean, 'the dread service of Drakan'? And what about 'the fate worse than death'?",
    "I'm sorry, remind me what you said about them again?",
    "Well, it certainly sounds a bit strange - almost like they're working together, which is a bizarre notion. Perhaps it's a good idea for you to check it out. Be careful when going into the temple, but make sure you search all the floors and try to find out what's going on. It could just be an effort by the local authorities to take the temple back from the Zamorakians, though.",
    "Well, I'm very excited about the research I'm doing on the columbarium. There are some strange slab-like structures, which I believe are funeral pyres. There is a sombre but dignified aura within the room. It's a little sad, but a sense of calm pervades the place.",
    "Well, he's seemed quite distant recently and keeps himself to himself. I'm afraid that there is very little that I can teach him now. To be honest, I fear that he disagrees with some of the teachings of Saradomin, or at least the interpretation of his teachings. I haven't seen him for a while now, but no doubt he's around here somewhere.",
    "Well, I think you initially wanted to check out the columbarium. But I was also anxious for you to report back to me on the suspicious people that were seen entering the main temple.",
    "Greetings again adventurer. How go your travels in Morytania? Is it as evil as I have heard?",
    "Well, I think you initially wanted to check out the columbarium. But I was also anxious for you to report back to me on the suspicious people that were seen entering the main temple.",
    "Spies you say! How do you know they were spies?",
    "Is there anyone else left in there to question or get some information out of?",
    "Hmm, I wonder why they left two bodyguards behind. Maybe they were afraid they left something behind that could identify them?",
    "I think you should go back to the room where you encountered the spies and give it a proper search. You may find something that could help us identify those suspicious people you saw.",
    "Go ahead, Player, I'm listening.",
    "Oh? What did you find?",
    "Well, it all sounds a bit strange. In the meantime, I'm going to take that evidence off your hands for safekeeping. We never know when it may come in useful to uncover the true identities of our enemies. Now, Player, I think you owe a certain adventurer a guided trip down to Burgh de Rott - he was certainly helpful in spotting this incident.",
    "This is quite troubling, Player. Bless Saradomin's beard that you discovered this and survived your ordeal. This information may help us to figure out the larger struggle - if we're given sufficient time, of course.",
    "Hmm, what makes you ask that, Player? I know you well enough now, you usually have some ideas before asking your questions.",
    "A good point. Guthixian druids have usually been at the forefront of easing tensions between warring factions, especially between the Zamorakian and Saradominist camps.",
    "Saradominists and Zamorakians working together against the followers of Guthix? Sounds a little strange, don't you think? But, then again...it certainly seems, in some strange way, to make some sense...",
    "Good question, Player, and I have the perfect answer! Take that mercenary adventurer down to Burgh de Rott! He's very keen to get down there, and he did you a favour by tipping you off about those people going into Paterdomus.",
    "Indeed, Player, he certainly was observant to have noticed such slight details. I'll bet that Veliaf and the Myreque movement in Burgh de Rott and Meiyerditch will be pleased to have your continued assistance, too.",
    "Oh, come now, Player, I'm sure you must remember. I certainly do because you told me all about it.",
    "Oh, very well, but your manners are deteriorating all the time. You explained that, when you got to Burgh de Rott, you cleaned up the basement of an inn for the Myreque to have a base.",
    "Tut, tut; forgetful! Well, to begin with, I asked you to take that mercenary adventurer down to Burgh de Rott. He keeps asking when you're going to guide him down there! You should also visit Veliaf when you get there. You also told me about a secret meeting you spied upon, on the top floor of Paterdomus. You managed to find some clues and I have them in safekeeping.",
    "Go ahead, Player, I'm listening.",
    "Oh? What did you find?",
    "Well, I think I'd really need to see them before I can take all this in. Some proof would go a long way, you know.",
    "You were on a mission for Veliaf in the Sanguinesti region of Morytania, weren't you? I'm afraid I've been a bit too busy with my research on the columbarium to really keep abreast of your travels, my friend. It was remiss of me, but it's not every day you get the chance to research such a fascinating find.",
    "Hmrr., that's a big subject, but since you came, the Myreque have managed to get a foothold in the small village of Burgh de Rott in the south of Morytania. Also, you started helping the local refugees in Burgh de Rott get out of Morytania. You also persuaded King Roald to enact a Mercenary Protocol so that soldiers of fortune can reap rewards by fighting the vampyres.",
    "You also found an area of Morytania called the Sanguinesti region, which has a city called Meiyerditch. It's a huge ghetto city where people are farmed like cattle by the Vyrewatch who claim a blood tithe from them on a regular basis. So far, there has been limited success in finding ways of fighting back against the vampyres, and the people in the city consider death a pleasant release compared to their daily lives of near constant tithing.",
    "It certainly does, Player, it certainly does.",
    "I think you were on a mission for Veliaf, or perhaps you were working with the Meiyerditch Myreque. Either way, I think you made some notes in your Quest Journal regarding what you should do next. If you're really stuck, I would go and talk to Veliaf in Burgh de Rott. You could also make your way to the Sanguinesti region and talk to your contacts in Meiyerditch.",
    "Hmm, well, that sounds like good news. Let me see the corpse and I'll see what I can learn.",
    "Well, I can't very well research it if you don't have it on you. Bring it to me and I will certainly do my best.",
    "Hmm, this is good news, Player. It's very odd how the corpse has adopted a strange quality to the touch, rather like heavy but well-weathered wood. Oh, my!",
    "I sense a terrible turmoil within: a soul lost in oblivion, wracked with guilt and tortured by the lure of evil demonic pleasures. Oh, we must find some way to release this poor soul!",
    "I hope you remember soon, Player. Every second this poor being is tortured seems to age me by a month. I pray to Saradomin that you remember and set this poor soul to rest.",
    "It's going very well, thanks. I'm quite convinced that the funeral pyres are in some way connected with the columbarium recesses. There are trappings within that some sort of intense religious ceremony took place prior to the coffins being placed into the recesses. And this was followed by the writing that appears on the coffins.",
    "Well, the translation isn't perfect, you understand, but my general understanding of the translation is, '..these worldy[sic] gains do I leave to whomever saves me from the dread service of Drakan, the fate worse than death'.",
    "Well, I've already told you we should try to find someway to sanctify its remains and lay the poor creature's tortured soul to rest.",
    "Well, if your mission for Veliaf is over, I would focus on finding a way to lay the remains of that Vyrewatch to rest. Go visit the columbarium, perhaps some peace in that sepulchral atmosphere will allow you to see a way to do that.",
    "That is really great news, Player. Saradomin praise you! I had a sense that something else happened down there as well?",
    "Hmm, that looks really ornate, a little like some of the detailing on the recesses down in the columbarium. You should see if you can use it down there.",
    "Oh, well done... you seem to have cracked the puzzle of the columbarium! Perhaps there are more riches to be had with more cremations!",
    "Ah yes, but you'll need protection before you can use it. Prepare for the blessings of Saradomin!",
    "Ashustru, blessidium, adverturasi, fidum!",
    "I know, Player, it was a really great insight to work out what to do. The columbarium seems filled with a sense of peace, tranquillity and the blessings of a gratefully departed soul.",
    "Yes, it seemed a little odd to me as well. My research has shed some light on this, and I think I know what happened. But, it's a long story...",
    "Anyway, my research indicates that the land of Morytania was known as Hallowvale before Drakan and his vampyric kin took over. Apparently, not everyone who lived in Hallowvale was able to escape to Misthalin before Drakan's forces had taken over the realm.",
    "It seems to me that those people who couldn't escape to Misthalin engaged in a special religious ceremony. Petrified of losing their eternal souls to Drakan, they knew they couldn't avoid being taken over by him, so they made a special sort of deal with Saradomin. If someone was to come and save them from Drakan, 'the fate worse than death', and their eternal soul is sent to Saradomin, the saviour will gain the key to their worldy possessions.",
    "Indeed, Player, and thus you see the power and might that is Saradomin.",
    "I recommend reporting what you've discovered to Veliaf. He may be able to use the information somehow.",
    "Everything seems to be going okay, [Player], but I hear from the Burgh de Rott refugees that incidents of Vyrewatch activities are increasing on the Temple Trek and Burgh de Rott Ramble routes."
  ],
  "Mysterious person [1]": [
    "...so these Guthixian Edicts will soon be removed...",
    "...silence, dog! I didn't give you leave to speak...",
    "Guards! Kill this intruder then clean the room! Leave nothing behind!"
  ],
  "Mysterious person [2]": [
    "...and not before time...",
    "Intruder! Everyone teleport now!"
  ],
  "Fistandantilus": [
    "Kill! Kill!",
    "Maim...death!"
  ],
  "Zaromark Sliver": [
    "Prepare to die!",
    "Kill!"
  ],
  "[Fistandantilus/Zaromark Sliver]": [
    "Grr, get the demonikin away from that, you scum!"
  ],
  "Ivan Strom": [
    "Hey, thanks for getting me to Burgh de Rott, Player. Now I can go and see my friends.",
    "Don't be angry, Player, I didn't mean to trick you. But I have to visit my friends the Myreque and continue the fight against Drakan!",
    "Hey, thanks for helping get back down to Burgh de Rott. I'm pleased to be back with my brothers of the Myreque!",
    "Ah, don't worry, Veliaf will mellow with age!",
    "Player! Good to see you again.",
    "Well, the vampyres are certainly increasing the pressure, but I'm confident that we will be victorious. I'm being allowed to help out more and more, now I'm getting older."
  ],
  "Veliaf Hurtz": [
    "Likewise, Player, what news is there from your many travels?",
    "I'm really quite angry about that! I know it's not really your fault, but he just doesn't realise the dangers down here and I'd have expected you to check a bit more before setting off with someone so young.",
    "It's complicated. Ivan is our special charge. I don't want to go into details, but we need to ensure his safety and this isn't really a safe place.",
    "You're right, Player, and I do have a job for you when you've finished being impertinent to your direct superior! But maybe you've got some news for me as well? Remember, you're our connection to the outside world. What have you got to tell me?",
    "What?",
    "Okay, start from the top...what happened?",
    "They sound like experienced fighters...but you defeated them - good job. I've come to rely on you, it would have been a shame to lose you. Six guys, you say?",
    "Working together? No, it couldn't be...",
    "Hmm, I never would have considered that. Very strange. The only thing I can think of is that they're part of some splinter group.",
    "I do indeed. The letter you brought back from Safalaan mentioned that they needed some basic provisions. I've got them all stored in a crate, I just need you to deliver it for me.",
    "Well, I have an inkling that Safalaan will have some task for you. Word has reached us that a researcher is working on a new weapon to try to defeat the Vyrewatch. My guess is that they could probably get a bit further if you're on hand. You certainly came up with the goods when discovering the Rod of Ivandis.",
    "Of course, I'm assuming you remember the way!",
    "I need you to take that provisions crate I gave you to the Sanguinesti Myreque base.",
    "Well, I have an inkling that Safalaan will have some task for you. Word has reached us that he has a researcher there who's working on a new weapon to try to defeat the Vyrewatch. My guess is that they could probably get a bit further if you're on hand. You certainly came up with the goods when discovering the Rod of Ivandis.",
    "The influx of mercenaries is certainly helping, although we've not been able to make any impact on the Vyrewatch yet. We are managing to reduce the impact of the juvinates, though. Blood tithes in outlying settlements seem to have been reduced.",
    "It's a start, but there's much more we need to do. I don't need to tell you how people are suffering in Meiyerditch - the stories I hear coming out of that place chill my blood. I wish we could just find some way to take them down, then we'd have a real chance of bloodying Drakan's nose.",
    "The influx of mercenaries is certainly helping, although we've not been able to make any impact on the Vyrewatch yet. We are managing to reduce the impact of the juvinates, though. Blood tithes in outlying settlements seem to have been reduced.",
    "It's a start, but there's so much more we need to do. I don't need to tell you how people are suffering in Meiyerditch. The stories I hear coming out of that place chill my blood. I wish we could just find some way to take those Vyrewatch down, then we'd have a real chance of bloodying Drakan's nose.",
    "Likewise, Player, what news is there from your many travels?",
    "Likewise, Player, what news is there from your many travels?",
    "Likewise, Player, what news is there from your many travels?",
    "May Saradomin be praised! Tell me all about it.",
    "Hmm, the struggle against the vampyres requires everyone's efforts, from the most experienced fighter to the most wizened old maid. But tell me of its construction, that's what I am most interested to hear about.",
    "Bless Saradomin's beard!",
    "Great story, Player.",
    "My best suggestion is to take a Vyrewatch corpse to Drezel and see what he makes of it. Report back to me when you get some answers.",
    "I'm not sure I want to hear this...",
    "Oh, no!",
    "No!",
    "What? He exploded?",
    "Bravo! What an excellent story! Of course, it must be utter fiction. But your imagination seems as lively as a playful kitten in a warehouse full of balls of wool.",
    "Of course, Player, of course...whatever you say.",
    "With the Flail of Ivandis?",
    "Well, as a priest, Drezel is quite well versed in the burial rites that have been observed for many years. His knowledge and intuition should serve you well in this matter.",
    "That's what I'd do, friend. At the worst, he'll probably tell you who can help with the corpse.",
    "Likewise, Player, what news is there from your many travels?",
    "Tell me all about it, Player.",
    "A key, you say? What does it do?",
    "What was it? I have to know!",
    "Saradomin's beard!",
    "As if you'd need treasure to motivate you to kill those terrible beasts!",
    "Oh, yes, I hadn't thought of that. Good thinking! Anyway, Player, I think you've completed a very worthwhile mission. Congratulations! I'd like to give you something as a token of appreciation! And, once again, congratulations on a job well done.",
    "[Player], you're back. Thank Saradomin!",
    "We need your help. It's Vanstrom, and the Vyrewatch. Every day they become stronger, and we become weaker. What are we to do, [Player]?",
    "I apologise. It's just...things have become so grave. Our town of Burgh de Rott is at risk of attack at any moment. Our old enemy, Vanstrom Klause, has been given the solo responsibility of destroying the entirety of the Myreque. He has been seen around our borders, even on our very own land. The Vyrewatch have been picking off our citizens, snatching them from the village itself, and our supply lines to Meyerditch have been cut. I can barely keep the Myreque's morale up, let alone the citizens'.",
    "Unfortunately, you are not experienced enough to aid us again yet. Please, do come back when you are ready.",
    "I'm afraid so. I suppose we were stupid to think we would be unnoticed forever. So far, they have taken five. Just last week, they took poor Marius from his bed, and his wife sleeping beside him. What they left behind... It was unbearable.",
    "Ah, [Player], you know as well as I do. We stood up to the vampyres, and of course they must stamp us down. They will return more viciously until we, or they, are destroyed.",
    "We used to run supplies to the Myreque in Meyerditch, so they could keep themselves and the community going. It wasn't much, but at least it was something. However, our last runners never returned. Word from Safalaan says they never reached there either. We cannot risk sending more now. It would be a waste of the precious few lives we have here.",
    "Okay, [Player]. Please, come back when you have time.",
    "Please come back when you can spare some time."
  ],
  "Andiess Juip/Kael Forshaw": [
    "I'm helpin' ta protect the base camp. How about you, what are you doing here?",
    "Good, we can always use extra help – just make sure you don't go getting into any trouble or you'll have me to deal with!"
  ],
  "Vertida Sefalatis": [
    "Congratulations on your promotion! You should be very proud!"
  ],
  "Safalaan": [
    "Well met, friend! I'm very sorry, but you've caught me at a bit of a busy time. Could you discuss any issues with Flaygian, our researcher, I'm sure he'll have plenty of things for you to do.",
    "It's nice to see you again, Player, and that's great news. Hopefully, Flaygian will come up with a solution to the Vyrewatch problem. But onto other matters. I have a proposition for you, Player, please allow me to introduce you to Andiess Juip.",
    "...and Kael Forshaw.",
    "The three of us are thinking about exploring the laboratory.",
    "Well, we really want to see if the room leads anywhere. There's a very solid door in the laboratory, but we can't seem to get it open.",
    "Fair enough, if you decide to come along, meet us there!",
    "Kael, what sort of things do you think we'll need?",
    "Okay, well, I think we'll head off in a bit - see you there, Player.",
    "I've already told you once! We're heading off to the laboratory soon to find out where the door leads. Meet us there, okay?",
    "Well, Kael and Andiess were just discussing that.",
    "Well, I think we're gonna make a decision and then just head off - we'll meet you there, okay?",
    "Arrrgh! Ha ha ha!",
    "He he he! We scared you, didn't we!",
    "Oh, come on, you jumped out of your skin!",
    "I knew it! Have to keep the spirits up, you know! Nothing like a bit of a fright to make you feel human again!",
    "Well, we came to check this door out, the one in the south corner. It's really very solid, and we're just not sure what to do.",
    "Not many, I'm afraid. Both Andiess and Kael say that the door is very well constructed. It's very solid and apparently that's just as well, because the cavern roof above the door is quite weak. None of us have any experience with things like this. We just build makeshift shelters and clear out old ruined basements to make somewhere to live.",
    "We really hope that we can find a way to get through this big door. It's frustrating not being able to properly explore the tunnel on the other side of the door.",
    "Oh, that sounds good...if you come up with something, please go ahead and try it.",
    "How goes it, Player?",
    "Okay, you get through the hole and we'll follow behind.",
    "Okay, good work getting us through that door! We're going to go on ahead, catch up with us later.",
    "Hey there, Player, I'm glad you caught up with us!",
    "Indeed, and did you see those odd rooms filled with strange creatures back there?",
    "I'm not sure, but I sense a strange magical aura about it: can you sense it? You can search that selection of rocks in the north of the room; Andiess, Kael and myself are going to search the rest of the room.",
    "Okay, Player, good work. We ought to get out of here pretty soon. I sense our expedition might be in some danger.",
    "Player, I'm very weak, help me back to base!",
    "Please, let's just get back to the base, we'll talk then.",
    "Oh, I'm okay, you know me! Listen, about what happened back in the tunnels: I want you to keep that quiet, okay? At some point we'll talk about it, but not now - we have other things to do.",
    "I understand, but there's just no time for this. I don't really understand it myself. Anyway, it looks like my researcher Flaygian has had enough of trying to make this 'Flail of Ivandis'. He left a bunch of stuff on my desk. Do you think you could sort it all out for me?",
    "He's left quite a bit of stuff here. You'll need four empty inventory slots for me to give you all this stuff. Come back when you have four empty slots.",
    "Great, here...take this stuff off me.",
    "Hi, Player. I gave you some items that my researcher, Flaygian, left on my desk. I asked if you could sort them out. I think Flaygian was trying to make something useful to us - the 'Flail of Ivandis' - when he left.",
    "I think he's already tried as hard as he can. I have the feeling he's very angry and frustrated at not being able to finish it himself, so he's probably popped outside for some fresh air. To be honest, I think he's more of a theoretical researcher, not as hands-on as you seem to be. Hopefully, he'll calm down and come back soon.",
    "Well, I think some people have greater reserves of patience than others. Flaygian is certainly very clever and I doubt we would have discovered much from the book on haemalchemy if it wasn't for him. We all have our strengths and weaknesses, Player.",
    "Oh, let me think now...yes, I think it was a ten-charge 'Rod of Ivandis', a length of silvthril chain and a blessed silver sickle.",
    "I'd really appreciate it if you could look into the work that Flaygian was doing with the Flail of Ivandis and complete that.",
    "Hmm, maybe he left some information lying around that would help him? Just check and see if there are any notes you can use.",
    "Incredible! There seems to be no end to your talents, Player!",
    "We really hope so, Player, the survival of the Myreque may actually rest on this weapon! In fact, I think this should be your next mission!",
    "I know it sounds dangerous, but go and test that flail on a Vyrewatch in hand-to-hand combat. If you're able to destroy the thing, all well and good! But don't risk anything! If there are any remains, bring them here so we can research them!",
    "Well, you were telling me about that Flail of Ivandis you made. I was hoping you could do some field work with it.",
    "Exactly. See if the Flail of Ivandis has the ability to harm the Vyrewatch. If you manage to kill one, bring any remains here so we can do some research on them.",
    "What great news, [Player]! Okay, well, as Flaygian still hasn't returned, it seems as if we can't really do any research on the remains.",
    "[Player]! You're a private in the Myreque, we each have to bear some hardships! Now, report to Veliaf and brief him on what happened here.",
    "Then take some Vyrewatch remains to Drezel to see what his thoughts are: see if he can get any useful information on more effective ways of killing these beasts. Report any findings to Veliaf!",
    "Well, those are your orders, private: move out!",
    "Player! You're a private in the Myreque, you should not be forgetting your orders!",
    "Report to Veliaf and brief him on what has happened here regarding our expedition of the tunnels, the development of the Flail of Ivandis, and the killing of a Vyrewatch!",
    "Then take some Vyrewatch remains to Drezel to see what his thoughts are: see if he can get any useful information on more effective ways of killing these beasts! Report any findings to Veliaf!",
    "Well, those are your orders, private: move out!",
    "Good, at ease, private! Now, see if you can't help the Myreque by taking down some of those Vyrewatch. I've heard they're now plaguing the swamps!",
    "We've heard that some mercenaries from Paterdomus were attacked on the way down and that some Burgh de Rott refugees were attacked on the trip to Paterdomus. You need to take care when you do those treks from now on, friend!",
    "You might be right, [Player], you just might be right!",
    "Ah, [Player], you mean with the Vyrewatch in that cavern? Remind me of it again would you? But quietly, we don't want everyone to hear.",
    "Oh dear, that certainly sounds quite odd, and I'm still not entirely sure what happened myself.",
    "I'm told it has, at least some of my men have told me about it, but I can't really be sure. It's very strange, you know. I have these blank spots in my memory, and I can only assume that something like this must have happened at those times.",
    "Well, that is possible, but even now I can feel my memory of it fading. I am sure that vampyres were involved the other times, though. Of course, they rather enjoy bumping our heads into things – usually their spears.",
    "Not at all, [Player]. It did feel very strange – as if I was drawing power from somewhere outside myself. Listen to me, I sound like an old fool in love with fantasy.",
    "Well, I suppose it's possible, [Player]. Unfortunately, I don't know how or why it happened. IF only I could remember the whole event...",
    "Well, I hope so. It would definitely be useful if I could call upon it at will. If I could learn how to use it – imagine! We could take back Meiyerditch and keep the vampyres out forever...",
    "Hm? Oh, [Player]. Good to see you again.",
    "Always, [Player]! I hear word from Veliaf that he may need you in Burgh de Rott, however. You should speak with him."
  ],
  "Andiess Juip": [
    "Anyway, boss, we reckon that door in the laboratory...",
    "I'm helpin' ta protect the base camp. How about you, what are you doing here?",
    "Good, we can always use extra help - just make sure you don't go getting into any trouble or you'll have me to deal with!",
    "It depends, what sort of questions?",
    "Well, I'll try. What do you want to know?",
    "Oh yes, okay...",
    "Flail!",
    "Aye, a flail. That'll do ya, although I doubt anyone I know would use such a weapon. It's the bane of any fighter: difficult to use, hard to predict - you can end up hitting yourself if you're not careful!",
    "Well, a mercenary came down with Verac's flail, and that didn't do anything. I expect that's because it's not made of silver or some such reason. Aye, if I'm not very much mistaken, a flail is what you need for an unpredictable fight. If you don't believe me, you can probably find a book around here which'll tell you exactly the same thing. I think some new recruit was using it for a bit of late-night reading.",
    "Raaarrrghhhh!",
    "Sorry, sir, I'm a bit busy with orders from Safalaan at the moment.",
    "[Player], attack the Vyres! We'll get Safalaan out!"
  ],
  "Flaygian Screwte": [
    "Fantastic, these things'll help out a lot.",
    "Oh, just some handy items which we'll need for our research. Some food and potions for the local fighters and sick folk.",
    "It's still a terrible existence living every day living in fear, but there's a sense of hope since you turned up on the scene. Personally, I've been researching the book on haemalchemy. It's been a tricky task requiring a lot of pattern-matching and extensive research into old lore and languages.",
    "I am rather experienced, but I don't like to blow my own trumpet. In fact, it's a terrible thing to admit, but the majority of my knowledge is purely theoretical, I'm afraid I'm all thumbs when it comes to doing something practical.",
    "Well, it sounds like we might make a pretty good team, then.",
    "Quite interesting, in fact. I'm trying to deduce what weapon we should use to fight the Vyrewatch.",
    "As a matter of fact we did, young Player. Of course, we have to interpret quite a bit, but my research indicates something quite startling.",
    "It's always been difficult to damage vampyres, right? They seem to have an excellent defence against our weapons. It seems they have protection against normal metallic weapons.",
    "But they also seem to defend well against the silvthril weapons - the Vyrewatch aren't even damaged by it. From the haemalchemy book, I believe I've found some evidence to support the idea that vampyres, especially Vyrewatch, have a limited mind-reading ability, sort of like an 'imminent danger' sensory perception.",
    "Well, they can sort of 'predict' the next attack manoeuvre, so they can then defend against it or simply move out of its way in time to take no damage at all. It seems to come naturally to them.",
    "Well, I wouldn't be so sure of that, there's more than one way to skin a cat. I've been thinking about it, and the world of hand-to-hand combat isn't always as predictable as you'd think. I hear from many warriors that the tide of a battle has switched over some small, seemingly random detail.",
    "Certainly, that would be great. My research indicates that a weapon which is difficult to master would be a great design for taking down the Vyrewatch. Something raw recruits fear to use and experienced warriors tend to shy away from.",
    "Well, you could start with some of the local fighters in the Myreque, they possibly have some insight into such matters.",
    "Talk to local fighters, work out which weapon is least predictable, the hardest to handle.",
    "Of course not. I believe it's a combination of unpredictability and the special properties of silvthril which will make this weapon succeed where others have failed.",
    "Now, before you go, I don't want to have to do all the research myself, so look for a way to back up your argument. It's no use unless you can find some secondary source as part of your claim. Let's follow some proper scientific evidence-gathering methods here.",
    "Well, it is somewhat tricky, but I feel certain that with years of practice, like me, you'll prove very useful in the theoretical application of your studies.",
    "Well met, Player, thanks for the provisions!",
    "Oh, just some handy items which we'll need for our research. Some food and potions for the local fighters and sick folk.",
    "Got any other wild ideas about a weapon which is less predictable?",
    "Not really, no! We just don't ahve the resources! I need some authoritive[sic] text which asserts quite plainly that the flail has this level of unpredictability.",
    "Interesting, so far so good...but did you do your own research? Which page do I need to read from, I'm a busy man, remember, and I don't want to have to read the entire book!",
    "That's not the right page! I'm not sure you're really helping me here, just getting in my way!",
    "Excellent research, my budding young understudy. Your diligent and observant efforts may be rewarded with another opportunity to prove yourself!",
    "Indeed, young Player, and this will require a bit of 'field' work, which Safalaan tells me you're quite accomplished at.",
    "As we all do. Anyway, in order to develop this new weapon we'll need to use the Rod of Ivandis as a base and design a way to make it more powerful. Within the development stage we'll certainly need to use a furnace.",
    "I'm hoping that won't be necessary. I've learnt through Meiyerditch folklore that there is a building in the north which used to house a furnace. The story goes that the locals complained about its smoke going into their shops and houses, so the owner was forced to move it upstairs to let the smoke blow over the roof tops.",
    "I think it's worth checking out. I'd like you to head north through the ghetto of Meiyerditch, past the laboratory you found previously. I believe the furnace is near to the northern brick wall. You may need to use a nearby building to help you enter the house with the furnace. Take the nails I gave you: you may be able to make a crude ladder as some of us do when traversing the ghetto. If you find the furnace, see if it's serviceable, otherwise just report back. Good luck.",
    "We discussed the making of a new weapon to defeat the Vyrewatch. In order to develop this new weapon we'll need to use the Rod of Ivandis as a base and design a way to make it more powerful. Within the development stage we'll certainly need to use a furnace.",
    "Great, what sort of condition is it in?",
    "Do you think we can get it to work?",
    "That would be most appreciated, [Player].",
    "I'd like you to head north through the ghetto of Meiyerditch, past the laboratory you found earlier. From the stories, I believe the house with the furnace is near to the northern brick wall. You may need to use a nearby building to help you enter the house and the furnace should be on the top level. Take the nails I gave you, you may be able to make a crude ladder from a post.",
    "From the local rumours, the house is two buildings north of the laboratory building. It possibly also has a mass of debris in the ground floor. If you find the furnace, see if it's serviceable, otherwise just report back. Good luck and be careful!",
    "Did you manage to find the furnace at all?",
    "Oh, as I feared...",
    "Oh, oh, wonderful, wonderful, Player! This really is great news!",
    "Okay, in order to make a flail from the Rod of Ivandis, we'll need to get a length of silvthril chain. There's a mould for creating the silvthril chain in a crate near the ladders. I'll also need something we can use as the flail-head to attach to the chain, so have a think about that while you're on your journey.",
    "If you need some resources, you may find some around here, help yourself, but within reason, okay.",
    "In order to make a flail from the Rod of Ivandis, we'll need to get a length of silvthril chain. There's a mould for creating the silvthril chain in a crate near the ladders. I'll also need something which we can use as the flail-head, so have a think about that while you're on your journey.",
    "If you need some resources, you may find some around here, help yourself, but within reason, okay. As for the flail-head, it might be best to restrict your search to items that we know can damage these filthy vampyres.",
    "That's really great! You seem to have a knack for this stuff! Oh...but...flaming demonikins! I've still got to have something to use as the flail-head! I just can't think of one! If you can find me something, please show it to me and be sure to have the silvthril chain to hand. I'll take both at the same time!",
    "I don't have time to go through all the junk you happen to be carrying around! From my studies, I believe that Vyrewatch, much like vampyre juvinates and juveniles, can only be affected by mithril and silver. If you think you've got an item that would be useful, please show it to me. But make sure you have the silvthril chain on you as well!",
    "Hmm, sorry, that just doesn't seem to be in any way suitable...have a re-think and pop back when you think you have the answer. Good effort, though, keep trying, I'm sure we'll get there soon. From my studies, I believe that Vyrewatch, much like vampyre juvinates and juveniles, can only be affected by mithril and silver.",
    "Sorry, friend, I have no time for such considerations.",
    "Hmm, I'm not sure... Hmmmmm.",
    "You know what, you're right! It's the absolutely perfect thing. With its strange shape it'll be even more unpredictable in combat. Not only will the flail be difficult to wield and use, but the strange shape of the sickle will also add to its unpredictable behaviour.",
    "That's the great and most noble thing about us mortals: with effort and determination, we can adapt to our environment and take on the most difficult of challenges. Great idea, Player, I'm going to work on this right away! I reckon I can get 30 stun charges out of the 'Flail of Ivandis' if I add an emerald into the sickle. I just need to find a way to do this. Oh, well, a researcher's work is never done. Now, I think you should go and let Safalaan know the good news about this, I'm sure he'll be more than pleased.",
    "Go and chat with Safalaan! Let him know that development of the Ivandis Flail should be smooth sailing from now on. I'm sure he'll be pleased."
  ],
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "missing originalYou can discuss this issue on the talk page or edit this page to improve it."
  ],
  "[Andiess Juip/Kael Forshaw/Mekritus A'hara]": [
    "No problems, hope it helped out. I reckon that Flaygian would be lost without you. He's alright with the mental stuff, just not so good with practicalities!",
    "Yes, of course...I mean, we'd be lost without him, I don't know anyone else who could've deciphered what he did out of that haemalchemy book."
  ],
  "Andiess": [
    "Well met, nice to meet you.",
    "It would be great to have someone with your skill and experience, just in case we run into trouble.",
    "I say we just get there, do a good recon, then come back for anything else we need.",
    "That's a good point: it's a very solid and well-made door, good quality construction.",
    "Yeah, the door is very well constructed, I'm not sure how we'll get through it."
  ],
  "Kael": [
    "Well met, friend.",
    "The cavern in that part of the room is quite weak. We reckon it will fall down if we try to force the doors, so we're going to see if there's another way through.",
    "Safalaan, do you think we should take anything with us? You know, to try to get through the door?",
    "Hmm, good question, the door has a really solid construction.",
    "That's a good point: it's a very solid and well-made door, good quality construction - especially considering the roof is almost entirely supported by the door.",
    "He he he! Did you see [him/her] jump?"
  ],
  "Kael Forshaw": [
    "Raaarrrghhhh!",
    "Sir! Yes, sir! What orders would sir like me to carry out, sir?",
    "Oh, sorry, sir!",
    "LET'S GO!"
  ],
  "Vyrewatch [1]": [
    "Slurp! Meat sacks!"
  ],
  "Vyrewatch [2]": [
    "No! Spear practice!"
  ],
  "Congratulations! You have completed": [
    "'Legacy of Seergaze' - Complete this Experienced quest."
  ],
  "Radigad Ponfit": [
    "Hi, Player. I am glad to see you here again. The vampyres seem to become fiercer by the day.",
    "Of course, we must. It is just disheartening that we can do so little against such a terrible enemy. But we must fight on. Myreque prevail!"
  ],
  "Polmafi Ferdygris": [
    "You chose a good time to return, Player. I fear we are struggling in these dark days."
  ],
  "Conspiracy": [
    "Part 1",
    "Part 2"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Legacy_of_Seergaze?oldid=35768356’"
  ]
}