{
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "Some Miazrqa dialogue is missing for if Player talks to Rupert and Miazrqa before going to GrimgnashYou can discuss this issue on the talk page or edit this page to improve it."
  ],
  "Player": [
    "Hello!",
    "Uh…okay, goodbye.",
    "Hello there. My name’s Player.",
    "Why, what do you mean?",
    "Really? What is it?",
    "Why would I want beans exactly? I mean, beans are good, of course, but I’m pretty sure I can get them anywhere.",
    "Ok then. So what do they do exactly?",
    "O…kay. So, are you going to tell me what they do?",
    "So, can I have the beans then?",
    "So, how much gold do you want for the beans, if I decide to buy them?",
    "Oh, I see. Ok then.",
    "Ok, so if I get these items, you will trade them for the beans. Is that right?",
    "What items do you need me to find then – assuming I still want those beans of course. Not that do, but I might.",
    "What’s so special about it?",
    "Ok, thanks for the advice.",
    "What do you need the feather for?",
    "Thereof?",
    "I guess. If you say so.",
    "How do I find Grimgnash again?",
    "Excuse me…say what now? He chews people’s bones? I thought you said this was an easy task?",
    "You know, I’m not sure that was even a compliment.",
    "What’s the other item I need to find?",
    "Ok. Where can I find him?",
    "Ok, that seems simple enough. I’ll get the helmet for you as well.",
    "Do you have any weird items in your collection?",
    "Ummm…I see. Well, can you tell me about any of them?",
    "A two-eyed cyclops? Uh…wouldn’t that be a normal giant perhaps?",
    "Umm…no, I guess not. Well, what else do you have?",
    "Really? That’s amazing! A Unicorn without a horn?",
    "I expect so. Well, on to other things for now then, I guess.",
    "I should be off, I think.",
    "Uh…hello?",
    "No, wait! I didn’t come to be eaten!",
    "Uh…uh…",
    "I have come for your magic feather!",
    "Do you have any quests for me?",
    "Argh!",
    "I heard you were a great and mighty Griffin!",
    "Perhaps I can help you get to sleep in some way. Is there anything I can do?",
    "So you want me to tell you a bed-time story, is that right?",
    "Right, well I’m sure that shouldn’t be too hard. I know lots of stories!",
    "Death and fire?...ok then. Let me see...",
    "Ok!",
    "There once was a king named Roland.",
    "There once was a princess named Esmerelda.",
    "There once was a little bunny called Flumper.",
    "There once was a graveyard filled with undead.",
    "Uh..yes..yes I suppose they could be.",
    "There lived a skeleton named Grimgnash.",
    "Oh, wait! Sorry! I got that bit wrong there. I was thinking of your name. My mistake! What I meant was..",
    "There lived a skeleton named Boney.",
    "No wait…I…",
    "There lived a skeleton named Harry.",
    "Uh, I’ve not recently…",
    "There lived a skeleton named Skullrot.",
    "I…er..I’m sure nobody would disagree with you.",
    "Thank you.",
    "Skullrot was happy!",
    "Skullrot was sad!",
    "Skullrot was angry!",
    "Uh…he was angry because…er…he had a headache?",
    "Oww!",
    "Skullrot was insane!",
    "That’s…lovely. Uh…shall I continue?",
    "Ok, then. So Skullrot was completely insane. He was off his rocket. One noodle short of a bowl of spaghetti. Not quite all there. Anyway, he was out haunting his graveyard one day when he came across a small gnome.",
    "Uh, I’m sorry to hear that. Anyway, this poor gnome had somehow got his foot stuck under a fallen gravestone.",
    "Skullrot lifted he gravestone off.",
    "Skullrot laughed at the gnome.",
    "In fact, he laughed so hard that he fell backwards into an empty grave and was never seen again. The end.",
    "Eh? Oh, well without Skullrot there he was able to get himself free again and ran away, vowing never to return to the graveyard ever again.",
    "Skullrot left the gnome there to die. So the gnome, thinking this was his chance, found a log to lever the stone off his foot and he scarpered away quickly.",
    "No, wait, I got it wrong! Wait…!",
    "Skullrot hungrily grabbed the gnome’s hair. Skullrot wretched the gnome out with one hand, pulling hard on his hair. The poor gnome’s foor snapped out of the gravestone and went crack as his foot dislocated.",
    "Well, the poor gnome – Nobby was his name – was in terrible pain and fear as to what would happen to him next.",
    "Oh, ok. Anyway, the gnome was in awful pain, so Skullrot took him back to his home in his grave where he…",
    "Locked him in an iron cage.",
    "Put him into a pot for dinner.",
    "Locked the gnome in the attic to die.",
    "Started to strangle the poor gnome. The gnome struggled with the cold boney fingers that were trying to end his life until he managed to pry himself free!",
    "Ok, it was all the little gnome could do to crawl painfully across the floor away from Skullrot, who was busy getting a pot to put the gnome in. Then, when all seemed lost for the little gnome, he suddently saw something that might save his little life!",
    "Ok, ok! Don’t worry, we’re almost done.",
    "So, then. The gnome looked up and he saw what might be his best chance to get out alive!",
    "He saw a hole he could just fit through.",
    "He saw a small sandwich on the floor.",
    "He saw a big axe leaning on the wall. He crawled painfully, oh so painfully over to the axe. He could use it to kill Skullrot. As he grasped the axe he realised it was a lot heavier than it looked! In fact much heavier indeed! He couldn’t hold it or stop it falling off the wall! SCHNUNK!",
    "As the axe fell, the poor gnome could not get out of the way in time and the razor sharp blade fell CRACK! And it killed him instantly. And so Skullrot was pleased to find that he had a nice dinner for that night and sat down for a big supper! The end. What did you think, Grimgnash?",
    "He saw some bones lying in the corner. He quickly remembered that if he buried them he could get his prayer up and so might be able to cast a heal spell on his legs! He dragged his painful body over to the bones and buried them all – these was quite a large pile – in the floor. All of a sudden, he remembered a good spell to heal himself from his injuries. He started to recite the prayer quickly. Just then, a huge zombie appeared out of nowhere and mumbled about his bones being disturbed! The zombie crunched his fist down on the gnome’s head. The gnome cried out in terror and realized that all was lost! He could not get away now! And so, Skullrot decided to invite the zombie to dinner as he never usually had guests. Then the two of them laughed and joked merrily throughout the night with their stomachs full of a hearty dinner! The end. So what did you think, Grimgnash?",
    "No, wait! I was wondering if perhaps I could help you at all. You said you couldn't sleep. Is there anything I can do?",
    "Ok. What can I do?",
    "Hi, Sylas. I have Grimgnash’s feather for you.",
    "Ok, I’ll get that next. I have a question or two I would like to ask you.",
    "Hello there!",
    "Uh, hello there! Can you hear me?",
    "No, no. I’m not either of them.",
    "Ha ha! No, I’m speaking to you through the pipe here! I’m at the bottom of your tower.",
    "Who are you?",
    "Really? Which king?",
    "Hey, you’re not related to Sir Tiffy by any chance are you?",
    "I see. Well is there anything I can do to help you up there?",
    "Sure. What can I do?",
    "Why? I don’t understand what’s going on!",
    "Right! Let me have a think, then!",
    "I think I might have an idea!",
    "You could try and climb down.",
    "It’s really not that far.",
    "So you won’t try it then?",
    "Right…",
    "I could try speaking to the princess.",
    "Well, I could try and get her to listen to reason, I suppose.",
    "I could kill the princess for you!",
    "Sure, she doesn’t look so tough!",
    "But she kidnapped you. Surely that makes her evil?",
    "Ok… But it would have been fun though, wouldn’t it? Haha!",
    "She would never have seen it coming! Blam!",
    "Right!",
    "I could try and climb up.",
    "I could try and climb the walls.",
    "I’m glad you’re able to admire the architecture, but you’re still stuck up there!",
    "I can fly!",
    "Well…er, no, sorry. I made that last bit up!",
    "Umm, no I guess not. Sorry about that.",
    "There must be something down here that might help.",
    "I’m telling you, it’s really not that high.",
    "Not really, no.",
    "I could ask the princess!",
    "You know, on second thought maybe that’s not such a good idea after all.",
    "Well, I could try and ask her to let you out, perhaps? You know, get her to listen to reason.",
    "Is there anything up there that can help?",
    "Wait! That’s it!",
    "I can’t believe I’m going to say this, but…Rupert, Rupert, let down your beard!",
    "No, Mean hang you beard down over the tower and I’ll climb up it, ok?",
    "Hello? Rupert?",
    "Climb up how?",
    "Yes, it was quite a climb, but you have a very strong beard.",
    "So, what can I help you with?",
    "A witch? Let me guess, would this witch be her evil stepmother?",
    "I see. Go on.",
    "Really? What happened to him?",
    "Ok, so how can I help?",
    "And then what happened?",
    "Goodness me! How rude!",
    "Ok, let me go and talk to her for you, then.",
    "Oh, no I haven’t had a chance yet. I’ll be back when I have.",
    "Hello there.",
    "Who are you?",
    "Uh, ok. Never mind then!",
    "Excuse me?",
    "Noise? What noise? I didn't hear any noise.",
    "You're not very nice, are you?",
    "I thought princesses were usually kind and loving and graceful?",
    "I see. Well I think I had better go then.",
    "Pardon me…?",
    "Oh, really? Who are you waiting for? Maybe I’ve met them?",
    "Oh, okay. Can I ask you something?",
    "I notice you have a dwarf in the tower here. I was wondering why he is locked in there?",
    "Oh, who’s that then?",
    "But he seems like a very nice person to me. A bit odd perhaps, but couldn’t you let him go?",
    "Oh go on. Please?",
    "Really?",
    "Pardon me, your ladyship.",
    "Pleased to meet you Princess Miarz…er…Mizaz…Miquipzi…Marzipan?",
    "Oh. Ok, I see. That’s an unusual name. Where is it from?",
    "I happen to notice that there is a slightly embarrassing looking dwarf in the tower there.",
    "Your first-cousin, once removed?",
    "You second-cousin, once removed?",
    "Your first-cousin, twice removed?",
    "Your second-cousin, twice removed?",
    "What’s so special about it? I’ve seen pianos all over the place.",
    "I see. Thank you for that…er…useful knowledge.",
    "Yes, that’s actually why I came to speak with you. I was wondering if you couldn’t let Rupert go? He’s a nice fellow and I can’t think he’d have done anything wrong.",
    "Surely there must be something that will change your mind? Is there anything you want?",
    "Ok, what’s that?",
    "Ok, go on.",
    "So you would like me to find it for you?",
    "Very well, I will find it for you.",
    "Where is your second-cousin’s house?",
    "Hey! I know that house! I rescued some little kid’s ball from there!",
    "Oh dear.",
    "What does your pendant look like?",
    "Is it particularly valuable?",
    "Where are you the princess of exactly?",
    "How far, exactly?",
    "Oh. What’s the place called?",
    "Asgarnia? Aren’t we in Asgarnia?",
    "Uh…I see.",
    "How impressive!",
    "I need a key for the house.",
    "Thanks very much.",
    "I should be off, I think.",
    "Please can you repeat that last bit? A flock of noisy birds flew overhead there and I couldn't hear you.",
    "Hi Rupert.",
    "Sort of. She’s asked me to do something for her first.",
    "I have to find a gold pendant of hers that she lost in that witch’s house south of Taverley.",
    "Don’t worry, I’ll be careful. I’ve been in there once before, so I know what’s there.",
    "No, I don’t think so. I would have remembered. I was looking for a ball for a boy who had lost it in the witch’s garden.",
    "Yes, quite. I’ll see what I can find out though.",
    "Why are you in that cage?",
    "That’s awful! Why did she do that?",
    "Your ogleroots? I don’t think I understand. What secret is that?",
    "That’s amazing! But how do you move the ogleroot around if it’s so big?",
    "That’s amazing! So how does the witch fit to all this?",
    "So she hasn’t found out the spell yet?",
    "I see. Can I get you out of these somehow?",
    "So, will you be alright?",
    "I found your pendant, Princess Miazrqa!",
    "Umm, your second-cousin has some very strange…creature she keeps.",
    "Uh…Really?",
    "With his ear?",
    "I think I feel a little ill…",
    "Will you agree to let Rupert go free?",
    "Ok, here you are.",
    "I’m just happy I could help…hey! What happened to your long beard? Where did it go?",
    "Oh yes! I can see it now. That’s pretty clever!",
    "Please could I have the helmet?",
    "So what will you be doing now, Rupert?",
    "I’m glad I could help.",
    "Princess Miazrqa, I found out what your cousin is up to.",
    "So you didn’t know that she kidnaps poor defenceless gnomes?",
    "I thought so too.",
    "Yes. There is a gnome in her basement right now!",
    "You know, Rupert – the dwarf here – is trying to put a stop to what’s going on, I am sure he could use your help.",
    "Great! Thanks.",
    "Rupert, I told Miazrqa about what the witch was doing and she was horrified by it.",
    "Yes. Miazrqa has said she would like to help you with your investigations and that you can use this tower as your base of operations if you want.",
    "Well, I had better be going for now. Good luck.",
    "I managed to get Rupert’s helmet for you.",
    "Difficult? You have no idea! There were huge creatures trying to eat me, other creatures trying to tear me apart, witches, gnomes in distress, princesses, and I had to deal with them all!",
    "What?",
    "Yes, that’s what all this was about wasn’t it? Some beans! They must be worth a lot for this much trouble!",
    "Worthless? So why did I go to all this trouble for you? I’m not particularly happy about that.",
    "Ok, so then what do I do?",
    "Our prize? What exactly is this prize?",
    "A golden goblin?",
    "They mutinied?",
    "That’s horrible! Was he killed?",
    "But surely that’s what anyone would have done? Why is that a bad thing?",
    "Oh, I see. So Gubblebak became hard as a rock?",
    "So let me see if I have this straight. I need to plant the beans in the earth mound, water them, let them grow into some big plant and then climb the plant to get to a cloudy area, find a golden goblin and bring it back to you?",
    "The…giant?",
    "No. I’m pretty sure you didn’t mention any giants! What giant? Now would be a good time to mention it if you were going to!",
    "So how exactly do I get the goblin then?",
    "Ok then, to recap. I need to plant the beans over there, water them, let them grow into some big plant, climb the plant to get to a cloudy area, kill a giant, find a golden goblin and bring it back to you?",
    "Thanks…I think I’m going to need it.",
    "I’ve grown the beans into a huge stalk, as you asked. What am I supposed to do now?",
    "No.",
    "Where can I find it?",
    "Right, I’m on my way.",
    "Sylas! I found the golden goblin!",
    "Ok, so what should we do?",
    "Right!",
    "Can you remind me what I am doing now?",
    "No, I just can’t remember what I’m supposed to do.",
    "Right!",
    "Yes, it’s done.",
    "I’m glad I could help.",
    "It did indeed seem like an odd item to look for.",
    "Not more potions? I’ve had enough of potions for now.",
    "Oh! Well, that would explain Rupert’s beard then.",
    "Hello Sylas.",
    "How is the collection going now?",
    "I’m just happy that I could help. Goodbye!"
  ],
  "Sylas": [
    "Can’t talk! Things to collect, magic beans to plant!",
    "Ahhh, good day young adventurer. A good day indeed! Sylas is the name. It is lucky for you that you met me.",
    "Well it just so happens, Player that I have something you simply must have!",
    "Beans, my friend! Beans!",
    "Ahhh, but not beans like this, young Player. No, not at all! There ‘magic’ beans.",
    "Ah excellent question! Excellent question indeed! What do they do? What do they do? Yes, yes! A most excellent question!",
    "You must plant them in the ground. Water them well. Then the magic will work, it’s…er…magic…yes! Plant them, Player.",
    "All in good time, my excitable young friend. All in good time. Few things in this world are free, you know, and beans – magical or otherwise – are no exception!",
    "Ah, well you see now I am a collector of rare and unusual trinkets and objects. Not much in value, but very important to me.",
    "Right, well I think that for the magic beans, I will need something magical back and I know just the right items that would help my collection.",
    "Yes! Excellent! You do catch on quick! I can see that we will become great business partners indeed. Oh, yes. Yes indeed! Hmm-ha! Yes.",
    "Well, there are two. The first item should be nice and simple for you to get for me. I want a griffin feather. Now, this is not just any feather, this one is special.",
    "There is a griffin names Grimgnash who lives in a nest on one of the peaks of White Wolf Mountain. It is one of his feathers that I want. But although this task should be easy, you must be careful Player. Grimgnash has very bad temper and even sharper claws!",
    "I told you, player. It is for my collection of magical items and trinkets, weird and wonderful thereof.",
    "Yes, I was quite happy with that word. I think it went rather well in that last sentence, don’t you?",
    "Yes, Excellent! Now…er…was there anything else?",
    "When he’s not chewing on some poor soul’s bones or raining terror on an unsuspecting village, he can be found in his nest, atop White Wolf Mountain.",
    "Oh, I daresay he has to eat sometimes. But I don’t think he’d take too much fancy for you. Not much meat on you at all. Oh dear me, no!",
    "I’m sure it was meant to be! Don’t worry, Player, you’ll be fine. Now was there anything else?",
    "Right, well, the second item is this. I know of a dwarf named Rupert the Beard who has a very fine dwarven helmet. I’d like you to see if you can obtain it for me.",
    "Travel north-east from here and between the Goblin Village and Ice Mountain you will find Rupert in a tower there.",
    "Excellent! Yes, yes. Now was there anything else?",
    "Haha! Weird items? Oh yes. Yes indeed! Yes. Many items. Many items. Yes.",
    "Hmm. Well let’s see now. I have the second eye of a mutant two-eyed cyclops. That was a rare find indeed! And at a tidy price too!",
    "Whatever do you mean? How many mutant two-eyed cyclops do you think are out there? Not many, I’d wager!",
    "Ah, well I’m glad you asked. My most prized possession to date: Through my connections, I managed to acquire a horn-less Unicorn!",
    "Yes. Yes indeed! Indeed yes! And I’m very proud of it, too! It was an exceptionally lucky find, I must say!",
    "Of course. Was there anything else you wanted?",
    "Excellent, excellent! Best of luck then, my friend. I’ll be right here waiting for you to return.",
    "Ah! Good work. Let me take that from you then. I still need you to find Rupert the Beard’s Helmet for me.",
    "Of course. Go ahead.",
    "Excellent, Player! I’ll take that as well. I hope all this work wasn’t too difficult.",
    "Goodness me! I’m glad I sent you instead of going myself.",
    "Er…I mean I knew sending you was the right thing to do. I was sure you could handle anything that came up. Now then, the beans…",
    "Actually, the beans are almost worthless.",
    "Calm down, my young hot-headed friend. There was a good reason for getting these beans. Now that you have proven yourself worthy of being a competent and trustworthy treasure collector, I can tell you the real use for the beans. As I said before, these beans are magical. There is a specially prepared mound of earth right next to us here. Plant the beans there and then be sure to water well. You will need to have some knowledge of farming for this.",
    "Well the beans are planted and watered, they will grow into an enormous plant of some sort. I’m not sure what exactly. At the top of this plant is our prize.",
    "The ultimate collectible item, my dear friend. It is rumoured that in a land of clouds, where none dare to tread lest they plummet to the earth, lies a goblin made of gold…",
    "Yes. Yes, indeed! A golden goblin. Legend tells of a time when goblins discovered gold in an abandoned dwarf mine and began to mine and smelt it. What for, nobody knows. Something evil, I’d wager. The goblins produced great smelting works, overseen by a particularly smart goblin with a head for business. Gubblebak was his name. He was shrewd, cunning and he loved gold… He worked his fellow goblins day and night to produce more and more gold, until finally they could stand his hard labour no more and they mutinied.",
    "That’s right. They turned on him. No-one is sure about the exact events, but somehow Gubblebak fell into one of the smelting pots of liquid gold.",
    "Well now, goblins are tough little creatures and he managed to somehow crawl out of the pot covered in hot, molten gold. He was smart indeed, but even smart people do foolish things. He threw himself into a nearby water trough.",
    "Ahh, well you see…when you take hot liquid metal and cool it instantly, it becomes rock hard straight away. That’s how blacksmiths make their weapons and armour.",
    "That’s right. And that’s the way he stayed ever afterwards. So the legend says, at least. And the cloud area will be waiting for you when you have planted the beans to find this golden goblin.",
    "Exactly right! You’ve got it! Now did I mention about the giant?",
    "Yes, that’s right. The giant.",
    "Oh right, sorry. Mist have slipped my mind. There's a bit of a large-ish giant up there. Uh…shouldn’t be anything to worry about. But…uh…I think he might have the goblin, you see.",
    "Well, you’re probably going to have to kill him for it. But…but a big strong adventurer like yourself shouldn’t have any trouble whatsoever with that, I’m sure! Here are the beans as promised.",
    "Oh, well done! You do pay attention! Good luck!",
    "Hmm, have you climbed up the stalk yet?",
    "Right, then you will need to climb the stalk and find the golden goblin for me.",
    "I think a big giant has it at the top of the stalk. You will need to get it from him.",
    "Excellent work, Player! Now, that giant will likely have friends. It is too dangerous to leave that stalk up there like that.",
    "First, let me take that goblin from you. Next we need to cut down that beanstalk as soon as possible. I hope you’re a good woodcutter. Find a hatchet. Any hatchet should do. Then cut down that stalk as soon as you can before another giant finds out what you have done and comes for us!",
    "You’ve forgotten already? Did you get hit on the head by that giant? Do you have amnesia?",
    "I see. Find a hatchet. Any hatchet should do. Then cut down that stalk as soon as you can before another giant finds out what you have done and comes for us!",
    "Have you cut down the stalk?",
    "Good work, Player! At last we can relax. We’ve completed our task and you have done me a great service!",
    "Now, let me award you. You may have wondered what possible use I could have had for Rupert’s helmet.",
    "Ah, yes! However, tucked inside the helmet is a tiny bottle with a very special potion. It was made by a witch, south of Taverley, but Rupert must have found it. Not knowing what the potion was, he simply tucked it away in his helmet.",
    "Relax, my friend. This potion is almost harmless. It is actually a particularly strong hair-tonic.",
    "Yes, indeed! I also imagine poor Rupert never understood why his beard grew so alarmingly fast. Poor lad. Anyway, I have removed the potion now and you may keep the helmet along with your rewards. Don’t worry, it’s quite harmless and the helmet should help you in your adventures.",
    "Ah, Player! Good to see you again.",
    "Thank you for finding the golden goblin for me. I am the envy of the collector’s group. I can’t thank you enough.",
    "Goodbye."
  ],
  "Grimgnash": [
    "Human? Human come to Grimgnash? Grimgnash pleased! Grimgnash hungry!",
    "What human come for then? Grimgnash tired and hungry. Be quick, human. Answer Grimgnash before Grimgnash eats your legs!",
    "Grimgnash’s feather? Human come to steal feather? How dare human! Puny, scrawny little morsel! Grimgnash should eat human, where human stands!",
    "Quests? Quests? Human morsel wants a quest from Grimgnash? Human think Grimgnash is drunken dwarf or lazy ork? Grimgnash not gives quests! Grimgnash tired and hungry and will eat little bite-size human!",
    "Hah! Human hears right about Grimgnash! Grimgnash great and mighty griffin! Now what human want? Grimgnash tired and can’t sleep. Wolves make awful howling racket. Keep Grimgnash up all night.",
    "Hmm. When Grimgnash little grifflet, Grimgnash’s mother-griff used to tell bedtime story to Grimgnash. That always help Grimgnash sleep.",
    "Yes! Grimgnash like stories!",
    "Good. Grimgnash like stories. Lots of death and fire and destruction! Grimgnash ready!",
    "And make story good. Otherwise, if no sleep, Grimgnash more hungry!",
    "Graveyard is good place for story, is undeads all horrible and ugly?",
    "Grimgnash like this story. Go on. Go on.",
    "Grimgnash? That Grimgnash’s name! Not stupid skeleton’s name! How skeleton have Grimgnash’s name?",
    "Boney? That stupid name for skeleton. Of course he boney. Human think Grimgnash stupid? Human make fun of Grimgnash? Grimgnash think human look better in Grimgnash’s belly!",
    "What kind of name Harry for skeleton? That stupid name. How many skeletons called Harry you meet?",
    "Grimgnash think Grimgnash just eat you instead of story!",
    "Oh yes! Skullrot. That great name! Grimgnash like that name. Maybe Grimgnash call himself Grimgnash skullrotter? What human think?",
    "Yes. Grimgnash Skullrotter. Grimgnash like that very much. What happen next? This good story…for human.",
    "What Skullrot angry about?",
    "A headache? That daft idea. Skeletons have nothing in head to ache. Grimgnash think human is making story up. Not real story like mother-griff used to tell. Grimgnash just eat human instead!",
    "Yes, insane! Grimgnash like that word! Grimgnash mother always say Grimgnash’s daddy insane. Grimgnash’s daddy eat own claws. Grimgnash laughed.",
    "Yes! Grimgnash liking this story now! Go on!",
    "Grimgnash not like gnomes. They stringy and chewy and they not have much meat for Grimgnash’s belly.",
    "Graah! That good stor... wait. What happen to gnome?",
    "What?! Little bite-size gnome runs away? That not good ending! Gnome should be mashed by something like... something like Grimgnash! Stupid human get eaten now!",
    "What?! Gnome snack gets away? That stupid. That not good story! Grimgnash only feel more hungry now!",
    "Raahahaha! Stupid gnome! Serves gnome right for being stringy and chewy! What happen next?",
    "Grimgnash not care what gnome’s name is. Grimgnash not give food names. Does human call a carrot Jasper or something? Tell rest of story!",
    "Ohhh! This getting good! Grimgnash like this. (Yawn!) Grimgnash feels sleepy.",
    "Grargh! What? What? What little gnome see? He must not escape! Grimgnash hungry to think of it!",
    "Grmmm. Good. Grimgnash getting sleepy…(yawn).",
    "What happened? Human tell Grimgnash!",
    "Zzzzzz.....zzzz…..zzz…",
    "Human toothpick dares to approach Grimgnash again after what human just say? Why human disturb Grimgnash? Human have death wish?",
    "Human help Grimgnash sleep? This good. Grimgnash let human help.",
    "Hmm. When Grimgnash little grifflet, Grimgnash's mother-griff used to tell bedtime story to Grimgnash. (Dialogue continues as above.)"
  ],
  "Chatbox": [
    "Grimgnash lashes out at you and recoil backwards in pain. You must be more careful what you say. Grimgnash could eat you any moment!",
    "Grimgnash lashes out at you and recoil backwards in pain. You must be more careful what you say. Grimgnash could eat you any moment!",
    "Grimgnash lashes out at you and recoil backwards in pain. You must be more careful what you say. Grimgnash could eat you any moment!",
    "Grimgnash lashes out at you and recoil backwards in pain. You must be more careful what you say. Grimgnash could eat you any moment!"
  ],
  "Drain Pipe": [
    "I say! Where on Gielinor did that voice come from?",
    "Why yes. Yes I can. My word. Is that…is that one of the gods? Guthix perhaps? Saradomin?",
    "Egad! You’re not…Zamorak…are you? I mean, uh…begging your pardon of course, my Lord. No offence intended!",
    "Oh. Oh I see! Oh, yes. How clever! Remarkable idea! However did you think of that? Good show, old bean!",
    "Rupert the Beard. At your service, old fruit. What am I doing? Well, I guess I’m stuck in a matter of speaking. Dear me, yes! I’m stuck. And I speak in the King’s speech, I’ll have you know.",
    "Which K…? Why, THE King old spud! THE King! Only one worth mentioning in my opinion.",
    "What? That namby pamby rincompoop? Not on your nelly! More fluff in the ears than sense, that man!",
    "By Guthix, I know how you can help me!",
    "Ye gods! We can’t talk like this anymore. You need to find a way up to speak to me privately, old boot!",
    "What woman is a princess. She’s holding me prisoner. If she sees you I will be in even more trouble and who knows what she’ll do to you!",
    "Jolly good show, old bean! What do you suggest?",
    "Climb down? What what what? It’s miles! People are like little ants from up here…oh wait…no, that’s just a line ants on the wall.",
    "Tish, posh and nonsense! You and your gangly long legs might be fine, but we dwarves are of shorter, stockier breed, old toothbrush!",
    "Indeed, definitely and most indubitably not! Think of something else!",
    "Well, I suppose it wouldn’t hurt to try, old socks! What would you say?",
    "Reason, eh? Hmmm. Well, you could give that a try.",
    "What? Kill the princess?",
    "What ever has gotten into your head, old war wound? Kill the princess. No, no, no. We don’t do that sort of thing round here.",
    "Well, yes of course. In a manner of speaking, yes. But…but that still doesn’t give us the right to go around lopping people’s heads off because they’re not very nice! No, there must be another way! Keep thinking!",
    "Hmmm.",
    "Yes, I get the idea. Now be a good sport and think of a better idea!",
    "Hmm, a worthy endeavour I would say. Possibly with its merits. Yes, indeed. Now how will you get up here?",
    "I don’t know if that would work, old trousers. These walls are made from very smooth and flat stone. Excellent workmanship. Simply excellent.",
    "Right you are, old pockets! Keep thinking! These are excellent ideas you’re having!",
    "By Guthix and Saradomin, that’s astounding! You are an absolute marvel! Can you really fly?",
    "I see. Not very sporting in the circumstances, was it?",
    "I’m afraid I have no idea! It’s a long way down as I said, so I can’t see much from way up here!",
    "Lies! Lies! Now can you see anything down there that might help, old chicken?",
    "Hang on, old underpants!...you’re going to ask the princess to help you climb up this wall to see her prisoner.",
    "No, indeed. Indeed no.",
    "Reason, eh? Hmmm. Well you could give that a try.",
    "Not really, old spoon. There’s not much up here except for me and my beard. Ha ha!",
    "What’s it, old banana?",
    "Eh? Let down my beard? Have you lost it down there, old chum? Going a bit loopy?",
    "Ah ha ha! Excellent idea, old tomato! Here it comes then!",
    "Eh? What? Oh! You don’t have to use that anymore, old spoon! Climb up to speak to me!",
    "Up my beard of course! It was your idea after all, old spinach."
  ],
  "Miazrqa": [
    "Hey, what’s that noise over there? Is someone there?",
    "Oh, hello.",
    "Who am I? Why, how impertinent! I am a princess and I will be spoken to like one. Now be off with you. I have no time for scruffy adventurers like yourself!",
    "You there! Young scrub! Was that you making all that noise back there? Well? Speak up now.",
    "Well I distinctly heard voices at least! In any case, keep away from my tower.",
    "I am a princess. I don't have to be nice.",
    "Ha! This isn't a fairytale, you know. This is a rea...well, it's real life!",
    "Yes, and stay away from my dwar...uh...tower!",
    "Yes? Please make it quick, I am waiting for someone.",
    "You think so? Ha! Although you’d most likely remember if you had met this person. If you must know, I am waiting for a relative of mine to arrive.",
    "I suppose so.",
    "You are a nosy young person! Well, if you must know, he’s in there because I have caught him for someone.",
    "I am not at liberty to say. In any case, this dwarf was caught spying and snooping and that sort of thing is not taken lightly.",
    "No, I don’t think so. I will be nicely rewarded for catching him.",
    "Hmm, well as you asked nicely. Ok then.",
    "No! Now please leave. You're annoying me!",
    "Ah! What nice manners. It’s so hard to find decently mannered young people these days. My name is Princess Miazrqa.",
    "Miazrqa. With a silent Q.",
    "My birth certificate. Now how can I be of help?",
    "Yes, that’s right. I’m waiting for him to be collected by someone.",
    "Why yes! That was a very clever guess indeed! She’s actually a very powerful witch. Now allow me to reward you in some way as I am feeling generous. My second-cousin is always telling me that knowledge is power, so here is a bit of knowledge for you…",
    "As I said, my cousin is a witch but she is also a lover of music. She has a lovely gramophone and keeps a piano in her basement – why? I have no idea – but you may find it interesting to examine.",
    "I don’t really know. I know my cousin goes on about that piano a lot, but I’ve played on it many times and I can’t figure out why she likes it so much.",
    "Now as I was saying, my second-cousin, twice-removed is coming to collect the dwarf. She will find out why he’s been snooping around. She has most…persuasive methods.",
    "Ha! That won’t matter to my cousin. She values her privacy above all else, you see.",
    "Hmmm…well I suppose there is something you can do for me that will change my mind.",
    "I was at my second-cousin’s house just the other day when I suddenly dropped a very valuable pendant that I was wearing. The chain must have broken, you see.",
    "Well, no sooner had it touched the ground when all of a sudden a mouse ran out from a hole in the wall. It took my pendant in its teeth and disappeared back inside its hole. As I’m sure you will believe, I was most upset as the pendant was a gift from my mother. I simply must get it back somehow.",
    "Oh, yes please! It means so much to me. If you are able to find the pendant for me, I will let your dwarf friend go.",
    "It’s not far to the west of here, south of Taverely village. It has a beautiful long garden – you can’t miss it!",
    "That was you? Oh, my cousin was absolutely furious when she found out about that! She went on about it for ages and even made her hair turn a quite ghastly green colour!",
    "Well I suggest you be extra careful when you look for my pendant then.",
    "It’s a lovely gold pendant.",
    "Only to me really, it’s not worth much and isn’t magical, but it has a lot of sentimental value. IT was my mother’s pendant. She gave it to me on my tenth birthday.",
    "I am the daughter of a great and powerful king. In a land far, far away.",
    "Far, far.",
    "Asgarnia.",
    "Well…yes, I suppose, but that doesn’t mean it’s not far, far away from somewhere else.",
    "I am the great niece of King Vallance himself.",
    "Yes, it is, isn’t it? Now was there anything else?",
    "Of course. You may have one of my spare keys.",
    "Very well. Good luck with finding my pendant.",
    "I see. How ghastly. Let me continue.",
    "Oh, how wonderful! I’m so grateful.",
    "Oh yes. Those are her little darlings. I shudder to think what she might do if something were to happen to any of them.",
    "Oh yes. Why, only last month one of them got out for a wander and some horrid farmer attacked it with his ear!",
    "Indeed! Tried to choke the poor thing with it. Anyway, my cousin went into a frightful rage and turned that wretched farmer into one of his own chickens. We had a lovely roast meal that day. Happy memories…",
    "Oh dear, I hope you’re not coming down with something. Now, can I have the pendant please?",
    "Of course. The pendant means more to me than anything.",
    "Thank you brave adventurer. I will release the dwarf now.",
    "Really? You know, I have always wondered. She’s ever so secretive and never tells me anything. I was hoping she might tell me when I saw her next.",
    "What?! Never! That’s absolutely awful! How could she? Oh, that’s just so…so…mean!",
    "It’s quite hard to believe. Do you have any proof?",
    "How horrid! Well, when I see her I will tell her exactly what I think. Thank you for telling me all this, Player.",
    "Really? You may tell him that I will help in any way that I can."
  ],
  "Rupert the Beard": [
    "Aha! You made it. Well done, old sausage!",
    "Indeed I do. Indeed I do.",
    "Ah! Straight to the point, eh, what? Good show old carrot, good show. Now let me explain. I’m in a bit of a fix right now. You see, the princess down there has this horrible relative who happens to be a witch.",
    "Stepmother? Ho! Good lord, no. No king in his right mind would marry a hag like that! No, this is her evil second-cousin, twice-removed.",
    "Right, well a young gnome friend of mine by the name of Winkin recently disappeared whilst delivering ogleroots to the market in Draynor.",
    "I don’t know exactly, but someone told me he was last seen talking to a witch before he disappeared.",
    "My investigations brought me to our friend the princess down there, old piñata. She’s related to this witch, as I mentioned. I was…you know…showing a bit of interest in her to get her to give me information.",
    "She invited me back to her ‘tower’, saying she would tell me all I wanted to know, and then as I walked in the door she slammed it shut behind me.",
    "Yes, indeed! Rude indeed! Then, as I was hammering on the door I heard a hissing sound and smelt something strange. The next thing I remember is waking up to find my armour gone! That wench must have taken it!",
    "Excellent! Good show, old spice! Off you go then.",
    "Ahh, you’re back. Have you spoken to the princess yet, old mushroom?",
    "Right you are then, old chestnut.",
    "Ah! Welcome back, old curtains! How did it go with the old princess down there? Did she agree to let me out?",
    "Oh, right. What was that then, old parrot?",
    "By all the gods! You have to go in there? You must be careful, Player. She’s a willy one that witch, from what I’ve heard. No doubt there’s all sorts of weird magics over there!",
    "You’ve been in there? Goodness me! What did you see? Did you see a gnome in there anywhere?",
    "Hmm, he was probably lucky that was all he lost with all that weird magic going on, eh?",
    "Ah! Good show, old kebab! I’ll wait here for you. But don’t be long. Who knows what the princess will do to me next!",
    "By Saradomin! My armour was on the stairs up there!",
    "That’s better!",
    "Aha! Sweet freedom! It’s good to be alive, old sweet shop! Thank you for freeing me, Player.",
    "Thank you, Player. You’ve done a great service for me and the dwarves and gnomes.",
    "Hah! Don’t fret, old penny whistle! It’s still here. The front of my armour was specially crafted to allow my beard to fold up inside. Do you see?",
    "Indeed it is, old cheese! Now allow me to reward you in some way. All I have is my armour, but you are welcome to take any piece of it that you wish.",
    "Of course, of course. Here you go, old pumpkin.",
    "Thanks to you I can carry on my investigations. Good show, old brussels sprout!",
    "I’m not surprised, old kiwi. It’s a pretty ghastly business with all this kidnapping gnomes and dwarves.",
    "Really? That’s just fantastic! You are certainly full of surprises, Player. Good show!",
    "And to you, my friend. And to you."
  ],
  "Winkin": [
    "That evil witch put me in here! She kidnapped me!",
    "She wanted the secret of my ogleroots, so she did!",
    "Well now, I have perfected a spell that would grow an ogleroot to an enormous size.",
    "You know, I had the very same problem so I came up with a simple solution. I used a spell learned from a chap named Larry to shrink ‘em down really small so that I could carry whole bags filled with ‘em to the market place. Then when I got there, I would use the growing spell once more to make ‘em huge and sell ‘em for a tidy sum.",
    "Well that old witch – she’s a sly one, I tell you. She found out about my spell and kidnapped me along with my bags of ogleroots. She wants the secret of the spell but I ain’t talking! No sir! So she’s been feeding my mini-ogleroots to those ugly…things over there.",
    "not yet, no. And I still ain’t telling her. But from what I gather, she’s started to use them ogleroots in some of her potions or something. I don’t know what, though.",
    "No, it’s ok. I want to keep an eye on what the witch is up to down here with these odd creatures.",
    "Yes, I’ll be fine for now. Good luck with your tasks!"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Grim_Tales?oldid=36178962’"
  ]
}