{
  "Player": [
    "Hello.",
    "The Black Guard, what's that?",
    "Sure, I'd be honoured to join.",
    "Sure, sounds easy enough...",
    "Yes Sir, Captain!",
    "Great, I'll be getting on then.",
    "Okay, I'll see what I can find out.",
    "Hello.",
    "I have some terrible news for you Captain, the goblins over ran the tower, your guards fought well but were overwhelmed.",
    "No, there was only one body there. I searched pretty well.",
    "Okay, I'll see if I can find their hideout.",
    "Are you okay?",
    "That's right, you get going. I'll catch up.",
    "Hello, has Lolk returned yet?",
    "Always a pleasure to help.",
    "Okay, I'll see what I can do.",
    "Hello again.",
    "Well, I think I've done it, take a look...",
    "Not bad for an adventurer eh?",
    "What now?",
    "Okay then, just for you!",
    "Okay, I'll see what I can do.",
    "Hello there.",
    "Captain Lawgof sent me. He's having trouble with his cannon.",
    "It fires a mould?",
    "That's great, thanks.",
    "Hi.",
    "Yes, I have spoken to him. He gave me an ammo mould and some notes to give to you...",
    "You could give me a cannon...",
    "Hmmm... sounds interesting. I might take you up on that."
  ],
  "Captain Lawgof": [
    "Guthix be praised, the cavalry has arrived! Hero, how would you like to be made an honorary member of the Black Guard?",
    "Hawhaw! 'What's that' [he/she] asks, what a sense of humour! The Black Guard is the finest regiment in the dwarven army. Only the best of the best are allowed to join it and then they receive months of rigorous training. However, we are currently in need of a hero, so for a limited time only I'm offering you, a human, a chance to join this prestigious regiment. What do you say?",
    "That's the spirit! Now trooper, we have no time to waste - the goblins are attacking from the forests to the South. There are so many of them, they are overwhelming my men and breaking through our perimeter defences; could you please try to fix the stockade by replacing the broken rails with these new ones?",
    "Report back to me once you've fixed the railings.",
    "Well done, trooper! The goblins seems to have stopped getting in, I think you've done the job!",
    "What? I'll have you jailed for desertion! Besides, I have another commission for you. Just before the goblins over-ran us we lost contact with our watch tower to the South, that's why the goblins managed to catch us unawares. I'd like you to perform a covert operation into enemy territory, to check up on the guards we have stationed there. They should have reported in by now ...",
    "Excellent! I have two men there, the dwarf-in-charge is called Gilob, find him and tell him that I'll send him a relief guard just as soon as we mop up these remaining goblins.",
    "Have you been to the watch tower yet?",
    "I can't believe it, Gilob was the finest lieutenant I had! We'll give him a fitting funeral, but what of his command? His son, Lollk, was with him. Did you find his body too?",
    "The goblins must have taken him. Please traveler, seek out the goblins' hideout and return the lad to us. They always attack from the South-east, so they must be based down there.",
    "He has, and I thank you from the bottom of my heart - without you he'd be a goblin barbeque!",
    "In that case could I ask one more favour of you... When the goblins attacked us some of them managed to slip past my guards and sabotage our cannon. I don't have anybody who understands how it works, could you have a look at it and see if you could get it working for us, please?",
    "Thank you, take this toolbelt, you'll need it... Report back to me if you manage to fix it.",
    "Hello there trooper, how's things?",
    "That's fantastic, well done!",
    "Well I don't believe it, it seems to be working perfectly! I seem to have underestimated you, trooper!",
    "Not bad at all, your effort is appreciated, my friend. Now, if I could figure what the thing uses as ammo... The Black Guard forgot to send instructions. I know I said that was the last favour, but...",
    "I can't leave this post, could you go to the Black Guard base and find out what this thing actually shoots?",
    "That's great, we were lucky you came along when you did. The base is located just South of the Ice Mountain. You'll need to speak to Nulodion, the Dwarf Cannon engineer. He's the Weapon Development Chief for the Black Guard, so if anyone knows how to fire this thing, it'll be him.",
    "Hello trooper, any word from the Cannon Engineer?",
    "Aah, of course, we make the ammo! This is great, now we will be able to defend ourselves. I don't know how to thank you...",
    "Hah! You'd be lucky, those things are worth a fortune. I'll tell you what though, I'll write to the Cannon Engineer requesting him to sell you one. He controls production of the cannons. He won't be able to give you one, but for the right price, I'm sure he'll sell one to you."
  ],
  "Lollk": [
    "Thank the heavens, you saved me! I thought I'd be goblin lunch for sure!",
    "I think so, I'd better run off home.",
    "Thanks again, brave adventurer."
  ],
  "Nulodion": [
    "Can I help you?",
    "Of course, we forgot to send the ammo mould!",
    "Don't be silly - the ammo's made by using a mould. Here, take these to him. The instructions explain everything.",
    "Thank you, adventurer. The Dwarf Black Guard will remember this."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Dwarf_Cannon?oldid=36228467’"
  ]
}