{
  "Player": [
    "Wait, was this portal always here?",
    "I'm not sure I want to mess with this just yet...",
    "Here goes nothing... No, wait, here COMES something!",
    "A...sword? A floating sword? Well, hello!",
    "Are you an animated sword? Can I help you with something?",
    "Wait, we can be fri-",
    "This portal of white light opened up near Draynor.",
    "When I went to investigate, a sword came out and killed me!",
    "It was made of black metal, with glowing, green runes carved into the blade.",
    "I couldn't read them.",
    "What? Who?",
    "Go with you? Go where?",
    "I'm always on time!",
    "What are you talking about?",
    "Why is everyone looking at me?",
    "I didn't sign up for that!",
    "Who was that?",
    "The first ever?",
    "Why have I never heard of him?",
    "That's what he said I was!",
    "But he said I should try to defeat him.",
    "Me, learn necromancy? But isn't that evil?",
    "I won't accept that. I won't stoop to his methods.",
    "Necromancy is magic using the souls of the dead, right?",
    "Enslaving those souls to do your bidding?",
    "Couldn't we just ask them nicely instead?",
    "Sounds like a plan to me.",
    "Are you from the city? Are you the only ones left?",
    "Can we do the same thing? Steal them back?",
    "How does that help?",
    "Don't worry, I'm going to be the good kind. I'll ask first.",
    "Yes, exactly!",
    "Then you don't have to, that's the whole point.",
    "Hi!",
    "Whoah, whoah. Remember we're doing this nicely. Do we have anything we can offer him in return?",
    "What about the city then. You're a necromancer, there must be something to learn in the Underworld.",
    "But no enslaving of souls!",
    "I'm going to ask the souls for permission.",
    "I need to do something called a 'communion ritual'. Do you know what that is?",
    "What do I do first?",
    "What? Why?",
    "I don't need to mess with this right now.",
    "I should be clearing the dust off this ritual site's component spots.",
    "I shouldn't mess with this right now.",
    "What's a focus?",
    "What?",
    "That's right.",
    "Candles it is!",
    "So I just need to put a focus object on the pedestal, light some candles and draw some glyphs?",
    "Why are you carrying bones?",
    "I should place some bones on the pedestal.",
    "I need to place the light sources needed for this ritual.",
    "I don't need to mess with this light source right now.",
    "That's convenient!",
    "Draw the glyphs. Got it.",
    "I should be drawing the glyphs needed for this ritual.",
    "I don't need to mess with this glyph right now.",
    "Wait, that's not the broken glyph Malignius Mortifer instructed me to interact with.",
    "Is that all of it?",
    "Time to find out if it works.",
    "I shouldn't mess with this right now.",
    "Hux-Ya",
    "Pok-La",
    "Zeb-Wa",
    "Qix-Ra",
    "You're inside that thing? How are you right here then?",
    "Yes. It was my communion ritual.",
    "I'm going to stop Rasial - the green guy. Are you in?",
    "Thanks, Ted. Can I call you Ted?",
    "Ted it is.",
    "I'm done messing with that for now.",
    "Just the ability to call forth the undead to fight alongside me.",
    "Thanks!",
    "How about we just stick to 'spirits'?",
    "What?",
    "Hellooooo!",
    "Do I want to conjure my skeleton that often?",
    "Sounds like I'd better stay stocked up on ectoplasm then.",
    "I thought you said you didn't sell ectoplasm?",
    "What's the difference?",
    "Right.",
    "I thought you hated necromancers?",
    "Don't worry, I can handle Rasial.",
    "Great.",
    "What if Rasial attacks?",
    "You seemed to know him. Is there something else I need to know? It could be important.",
    "I'll find you when I have more experience."
  ],
  "Rasial, the First Necromancer": [
    "Yes, that one...",
    "Good, my invitation has been accepted.",
    "My guest arrives in the Underworld.",
    "Up the River of Souls...",
    "...across the Lake of Memories...",
    "...to the City of Um.",
    "The Well of Souls is a beacon,",
    "a guiding light to all the vagrant dead.",
    "I will give them purpose, direction.",
    "They will spread my influence to the world above.",
    "You will be the key to my victory.",
    "I will teach you.",
    "You will be my last apprentice.",
    "I am the First Necromancer!",
    "Good, I hoped you would be prompt.",
    "The ritual site is yours now, apprentice. I am done with it.",
    "The Underworld is no longer enough for me, my old friend.",
    "The souls of this city languished in self-indulgence, slowly fading into nothingness.",
    "I have given them purpose. I will forge them into an army, and wage war upon the mortal world.",
    "Those who perish will also serve me, until the dead outnumber the living.",
    "When I am done, there will be no more need for death.",
    "I will set them free of their fear and doubt.",
    "Only a trained necromancer can stop me.",
    "Which is of course the matter at hand...",
    "...my new apprentice.",
    "I have chosen you. Death will prepare you. He has no choice.",
    "You may find me in the citadel above. I must prepare for my invasion.",
    "Come to me when you are stronger. Defeat me if you can.",
    "But the sands of this world's hourglass are running low, apprentice. Do not tarry."
  ],
  "Death": [
    "The manner of mortal deaths are normally plain to me - but this one was not expected.",
    "A portal...",
    "The sword. Tell me what it looked like.",
    "...",
    "They say 'Anguish.'",
    "He has returned.",
    "If he has chosen you, then we must hurry. I will explain everything when we get there.",
    "To the Underworld, where life goes on beyond death.",
    "Rasial! What have you done?",
    "Where have the spirits gone? What have you done to my city?",
    "You would trap everyone in eternal torment, eternal servitude!",
    "We will stop you!",
    "I know...",
    "His name is Rasial. He was the first necromancer.",
    "On Gielinor at least. I have known him for a very long time.",
    "He only rarely leaves the Underworld. This plan of his to attack the living is new.",
    "Whenever he returns, he acts through others - those he calls his 'apprentices'.",
    "Yes. He has chosen you. When Angurvadal struck you down, you were marked.",
    "It is his twisted method of instruction. He has left you no choice but to learn necromancy.",
    "...",
    "Of all my responsibilities, this is the only one I truly loathe. To enslave the dead is...despicable.",
    "But Rasial cannot be allowed to triumph. It is the lesser of the two evils.",
    "What do you mean?",
    "Yes.",
    "Yes.",
    "Wha-",
    "You can't-",
    "I don't think anyone's ever tried that.",
    "Rasial is gone. Come, join us.",
    "A communion ritual. He must have created his own vessel, and moved them to it.",
    "Not from Rasial. We would need to assault his citadel, and you are not yet strong enough.",
    "But this is the City of Um. It exists to house lost souls. You could use a similar ritual to bring them here.",
    "As you said, a necromancer is empowered by the dead. The more souls you guide here, the more power you can wield.",
    "With enough power, you can defeat Rasial, rescue the stolen souls, and put an end to his plans.",
    "I know the Underworld like no other, but I am no necromancer. We will need a tutor.",
    "Malignius Mortifer...",
    "It is not your time. Sadly.",
    "You will instruct Player in the ways of necromancy.",
    "Have a care how you-",
    "I will not grant immortality to such a creature.",
    "You may remain here for as long as you act as a tutor. The sands of your hourglass will not flow while you do.",
    "They're waiting for you.",
    "Excellent. Things are progressing well. All of you, a word please...",
    "Before we talk, you should free up some room in your backpack.",
    "I cannot delay here any longer. This matter is crucial, but I have many other duties to attend to.",
    "In time, perhaps you can, but Rasial is immensely powerful.",
    "Perform more communion rituals to fill the Well of Souls.",
    "Do not neglect the practice of real combat - you will need that experience to unlock its true power.",
    "You can use the portal outside Draynor to return here.",
    "His patience is, if not infinite, extremely high. He has already made his move, and now he waits for yours.",
    "I will tell you more, but not until your powers have grown. You still have much to learn.",
    "Until next we meet, Player."
  ],
  "Lupe": [
    "I-is he gone? Is it s-safe to come out now? I haven't felt this s-scared since I d-died!",
    "Oh! Wait... You're him, aren't you? Death! Thank goodness. My name is Lupe! And this here is...",
    "It's okay, Sos. That's not a necromancer, that's Death. We can trust him.",
    "Only a handful of us. Rasial took everyone else!",
    "Some sort of dark ritual. He just sucked them all up into his lantern!",
    "You mean like...convince us to help you? Woo us?",
    "Well then, for what it's worth, I'm in.",
    "You know what would really set the mood?",
    "Candles! A few candles would really add a little 'I don't know what', as they say in Ardougne.",
    "Maybe if you just want any old spirit showing up so you can control it. I thought we were planning to befriend them.",
    "Then we should use candles! Look, I have some right here.",
    "Yay, it'll be nec-romantic!",
    "Talk to me again when you have free space for these ritual supplies.",
    "Oh, I have ink! I sell it in my boutique, next to the candles.",
    "Sounds like I'd better start stocking up!",
    "Talk to me again when you have free space for these ritual supplies.",
    "Talk to me again when you have free space for these ritual supplies.",
    "The candles look lovely!",
    "It was drawn into the Well of Souls. The big dish thing over there. It's where we all reside.",
    "I don't really understand it myself. It's something called a vessel. We're safe inside, but we can still manifest in the city.",
    "Is that you, Ted? I thought you got stolen away!",
    "It was the candles, right? See, I told you. Hey Ted, guess what this mortal is trying to do?",
    "Become a powerful necromancer without enslaving any souls.",
    "Sorry, no. Just ink and candles.",
    "Minions? That's offensive!",
    "Yeah, spirits.",
    "We don't sell ectoplasm, but my shop, Soul Supplies, sells ritual supplies like candles and necroplasm.",
    "Not ectoplasm, necroplasm! It's completely different. Well, I guess it's pretty similar actually when you get down to it.",
    "Ectoplasm is for conjures. Necroplasm is for rituals.",
    "Come by the shop and I'll see if I have any free stuff for you."
  ],
  "Sostratus": [
    "Sostratus! Centurion! Third Legion! That's all you'll get out of me, necromancer scum!",
    "Oh, right. At your command, Sir, Death, Sir!",
    "He drained the Well of Souls almost completely.",
    "What's this? Necromancy!",
    "What if I don't want to serve?",
    "I'm wary, but if that's good enough for Lupe, then it's good enough for me.",
    "The villain who abducted all our friends!",
    "That ritual you performed was impressive.",
    "I do. Take this. Use it with great caution.",
    "Here.",
    "Same with me. I have basic necromancy equipment I can give you.",
    "I do. That's why I have so much of their gear."
  ],
  "Malignius Mortifer": [
    "What is the meaning of this? Where am I?",
    "...",
    "No!",
    "I'm far too young! It isn't my time! I have so much to do! I promise to be a better person!",
    "This can't be how it ends! I won't let the mushrooms win!",
    "I see. Just one question though. Why should I do that?",
    "Is this...the fabled City of Um? The spirits told me of it, but I've never seen it.",
    "So much lost knowledge...the endless secrets!",
    "What are you talking about? How are you going to do necromancy?",
    "That's the stupidest thing I've ever heard. But if you want to do it the hard way, that's on you.",
    "Fine, you have a deal. What's first?",
    "Conjure a soul? Guide it to this city? Yes. Let's get started.",
    "We're going to need a suitable location, and this spot looks conveniently perfect. Has a necromancer been here recently?",
    "Er, right.",
    "Ritual sites vary in size and shape. More powerful necromancers can conduct larger rituals.",
    "So we'd better just try a makeshift communion ritual for now.",
    "You need to sweep away all the dust before we can start.",
    "Allergies. Just do the inner area for now.",
    "*achoo* That's better. Now, listen carefully.",
    "First, you place a focus on the pedestal to determine the ritual.",
    "A focus is an item placed on the central pedestal. Which item depends on the ritual - communion rituals require bones, for example.",
    "Then, the surrounding tiles will be perfect for drawing the required glyphs. Different rituals require different glyphs.",
    "We have no need for candles. Only the glyphs are required.",
    "Fine, we'll use the pentagon shaped tiles for the candles.",
    "...",
    "There's also some chanting, but let's just take it one step at a time.",
    "For a communion ritual, you'll need bones as your focus. You can use these.",
    "I'm a necromancer. Wouldn't it be stranger if I wasn't?",
    "Talk to me again when you have free space for these ritual supplies.",
    "Place the bones onto the pedestal.",
    "I suppose you'd better place the...candles next.",
    "Now, the glyphs. To draw them we'll need ink, and I don't know where we'll find some...",
    "As I was saying, we now need to draw the required glyphs.",
    "The specific spot doesn't matter, as long as you draw the correct number and type of glyphs required for your chosen ritual.",
    "Glyphs and candles will degrade with each ritual. If they deplete, you'll need to repair or replace them.",
    "I see a depleted glyph there already. It must have been left from the last ritual.",
    "You can repair it with the same supplies you need to draw it in the first place.",
    "Everything *looks* to be in order.",
    "Now everything's prepared, go and stand on the skull platform over there.",
    "I can't believe you managed to get it right on your first attempt.",
    "Where did the soul go, though?",
    "A vessel! With this you could grow truly powerful. We should perform more rituals!",
    "The communion ritual will guide souls into this vessel. The more souls that reside within, the more power you can tap into.",
    "If you want to channel and direct that power, though, you'll need to practice your skills in real combat.",
    "If you want to fight, you'll need what we in the trade call a 'siphon'. You don't have one do you, skeleton?",
    "Talk to me again when you have free space for this equipment.",
    "A death guard! Excellent.",
    "Weapons like these channel necrotic power into powerful attacks, while protecting you from any backlash.",
    "We must test your newfound power.",
    "Equip that death guard and attack them!",
    "And that's how it's done!",
    "If you want to conjure a spirit, you'll need a 'conduit' - something that can connect you to this vessel wherever you are.",
    "You there, ghost person. Do you...?",
    "Talk to me again when you have free space for this equipment.",
    "Conduits like this lantern allow you to communicate with your minions.",
    "Err...friends?",
    "It's not. The connection is magical. It's not a trumpet.",
    "Conjuring spirits, like your skeleton warrior, requires a material known as ectoplasm.",
    "It's not hard to find - you'll accumulate some as a side effect of every ritual you perform.",
    "Every necromancer needs minions, and without your skeleton you'll do far less damage.",
    "I will be here when you are ready to learn more."
  ],
  "A bar that reads \"No ritual selected\" appears at the top of the screen. Below the bar, the text \"Soul attraction": [
    "100%\", and below the text, five ghostly faces with the first one lit up and the other four darkened. Another interface appears, with the title also being \"No ritual selected\", and with blank fields titled Durability, Light sources, Glyphs and Output, and an unchecked checkmark titled 'Fixed camera view'."
  ],
  "Elemental I (depleted) durability": [
    "0/6",
    "0/6"
  ],
  "Repairing all components will consume the following materials": [
    "- Elemental I (depleted): 3 x Basic ghostly inkRepair all options can be configured in the gameplay settings menu."
  ],
  "You need the following materials to repair Elemental I (depleted)": [
    "3 x Basic ghostly ink"
  ],
  "Light sources": [
    "0 / 4"
  ],
  "Glyphs": [
    "1 / 1 Elemental I      0 / 2 Commune I"
  ],
  "Output": [
    "100 Necromancy XP     1 soul added to the Well of Souls     3 Ectoplasm"
  ],
  "Basic ritual candle durability": [
    "6/6",
    "6/6",
    "5/6",
    "5/6"
  ],
  "Commune I durability": [
    "6/6",
    "6/6",
    "5/6",
    "5/6"
  ],
  "Repairing the component will consume the following materials": [
    "- 3 x Basic ghostly ink"
  ],
  "Elemental I durability": [
    "6/6",
    "6/6",
    "5/6",
    "5/6"
  ],
  "Ted": [
    "Oh, hey there, buds!",
    "Nah, I got knocked down into the lake below. Been freezing my bones off.",
    "Felt something calling me back up. Was that you?",
    "Well, thanks bud!",
    "If you don't mind me saying, that ritual you did felt[sic] different.",
    "The green guy - that felt like I was being pulled away, sucked in. Yours was more like a gentle, guiding hand.",
    "What's that then?",
    "That's new.",
    "Can't say I care for him. I'll help, and I'm sure other spirits will too.",
    "Well it used to be Theodora, back in my living days, but now that's just my long dead mother. Ted does me just fine now, if you please.",
    "Here, lemme show you how the Well of Souls works. Take a closer look.",
    "Take a closer look at the Well of Souls.",
    "Hmm, the vessel has filled up enough to offer you more power, but you'll need to earn a talent point to prove you are worthy of it.",
    "How about those ghost trolls? They love a good scrap!",
    "Great job!",
    "Take a look at the Well of Souls again and see if you can learn something new.",
    "Did ya learn anything?",
    "That's awesome!",
    "Try talking into it.",
    "Go on!",
    "I think it's broken.",
    "Yeah, and I'll hang around the vessel here, welcome any spirits who turn up, and recruit 'em for the cause!"
  ],
  "In the target information panel you can see your hit chance against the enemy. This value will determine how much your damage potential can be dealt against them.Example": [
    "Your Basic Attack ability can deal a maximum of 100 damage and you have a 50% hit chance against the target. Your ability will only be able to deal 50% if it's[sic] damage potential resulting in a maximum of 50 damage."
  ],
  "Cost": [
    "1 Talent Point"
  ],
  "You unlock the talent": [
    "Conjure Skeleton Warrior"
  ],
  "Congratulations! You have completed": [
    "'Necromancy!' - Complete this quest."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Necromancy!?oldid=36230101’"
  ]
}