{
  "Sir Tiffy": [
    "Good day, Proselyte. Is there anything I can do for you?",
    "Ah, perfect timing, what? I was hoping you'd stop by. One of our operatives has been asking for some assistance. He's on Mos Le'Harmless, gathering information about a possible attack on human settlements. Go to The Other Inn on Mos Le'Harmless and speak to Sir Tendeth. He's undercover, so will probably be dressed as a pirate.",
    "Jolly good.",
    "I don't know. Some of Sir Tendeth's reports talk of an ancient evil. The old chap can be a bit vague, dont-cha-know, but he's always had great instincts when it comes to rooting out the bad guys. If you go talk to him in The Other Inn you'll find out more.",
    "The other inn? That's Joe's House of 'Rum'.",
    "What? No! Sir Tendeth will be in 'The Other Inn' - it's the name of a pub. There are two pubs on Mos Le'Harmless; you want the larger of the two. It's confusing, I know, but it amuses the pirates.",
    "Have you figured out what is happening on Mos Le'Harmless yet?",
    "This comes as a shock. He was one tough cookie, not the sort to be easily defeated. Did you see who committed such a dastardly deed?",
    "Do you know who they were?",
    "Some kind of dragon? Anything unusual about them?",
    "Hmm, that does sound familiar. Let's go to our archive room and do some research.",
    "Vultures? They don't sound all that dangerous.",
    "As crazy as that sounds, it does ring my bell, what? Let's go to our archive room and do some research.",
    "Dragonkin? Are you sure, old bean? Legends of the Fourth Age talk of such creatures. They've not been seen in our lifetime, though, and I've been around for a good old while, what?",
    "Hmm, that certainly fits with the legends. Let's go to our archive room and do some research.",
    "A bit out of the ordinary, then? What did they look like?",
    "Sounds like we might need to do some research. Let's go to our archive room.",
    "Lady Table, Mos Le'Harmless has been attacked by what Player here thinks might have been dragonkin.",
    "Lady Table, Mos Le'Harmless has been attacked by what Player here thinks might have been dragonkin.",
    "Do we have a dossier on the dragonkin?",
    "Wouldn't worry about it, old bean. We're pretty certain that one's a myth.",
    "Pray tell, old boy/girl, because it's got me stumped.",
    "So, we need to get Bob the Cat's collar, but who is this stonetoucher?",
    "Are you, by any chance, randomly guessing, old bean?",
    "Are you, by any chance, randomly guessing, old bean?",
    "Yes, Akrisae told me about your encounter with the Stone of Jas. While others, namely Lucien, have also touched the stone, I can't see how Robert's note would be referring to them. I'm not sure how Robert could have known about you, though.",
    "Have a think and tell us if you come up with anything.",
    "Have you uncovered anything new about the dragonkin yet?",
    "This is a tad troubling, what? It suggests the dragonkin's power is related to use of the Stone of Jas, and they can become powerful enough to wipe out an entire world.",
    "You should probably bring this information to Akrisae, Thaerisk and Idria in Falador Castle.",
    "I say, old bean!",
    "We came as soon as we could. Did you manage to get everything in place?",
    "There's no time to lose, old [boy/girl]! We're heading to the ritual marker now. Whatever these fiends are up to, we'll soon put a stop to it!",
    "Troops! Fall in!",
    "Quick march!",
    "What is this devilry?",
    "What are you talking about? Who's Wahisietel?",
    "What are you doing here, old bean? We should be up at the ritual site.",
    "Then there's no time to waste, let's go!",
    "Where did you get off to, old bean? Try to concentrate this time, what?",
    "Tiffy to base, Tiffy to base.",
    "I know, don't pani- Idria! Perfect! Get a fix on my location and get here with whatever troops you can.",
    "Well said, old bean. This has gone on long enough!",
    "We'll do our bit if you can hold off Lucien again, old chap!",
    "We'll hold off Khazard. Get rid of those zombies, what?",
    "I say! Could these be dragonkin?",
    "Calm yourself, Akrisae. We all feel the loss for one of our own. We need to focus now, chaps, it's not over yet.",
    "Now, hold on there, sneak. Player's one of us, dont-cha-know?",
    "You'll pay for that!",
    "You speak like he stole our gold, not one of us!",
    "Of course, you are right, old [boy/girl]. Let's get this Stone hidden away.",
    "Well, it looks like it's down to us two, Player.",
    "Not a clue, but we need to do something with it. Its power is too much for any single person to control.",
    "Nice try, old [boy/girl]!",
    "I think the answer lies with a comrade. Let me call him to us.",
    "Thaerisk, old chap. Many things have happened and there is much to discuss, good and bad. We can fill you in later, but right now we need you up here.",
    "Blimey, now that sounds like a plan! I may be old, but I can still count just fine!",
    "Ready when you are!",
    "It is done.",
    "No, something is wrong.",
    "It's okay. Only a flesh wound. I'll live.",
    "I don't know what you're talking about, old bean.",
    "Calm down, old [boy/girl], we came straight back here.",
    "Anyway, that's Lucien dealt with - a significant danger to the world has been removed. A jolly good show."
  ],
  "Player": [
    "Is there anything you need my help with at the moment? Any missions for me?",
    "Yes, I'd be happy to help.",
    "I'll get right on it.",
    "Are the pirates planning to invade?",
    "What is the other inn on Mos Le'Harmless?",
    "And that's where Sir Tendeth will be?",
    "Sir Tiffy sent me here to find out about a possible attack. Are you worried pirates are planning to attack Falador?",
    "What's that noise? Why am I filled with an intense feeling of dread?",
    "Actually I need to do something else right now.",
    "What just happened?",
    "Did you see what attacked this town?",
    "What just happened?",
    "Well, I know that much.",
    "What just happened?",
    "Why would that happen?",
    "What just happened?",
    "Dragons did this?",
    "Did you see what attacked this town?",
    "What, like a wyvern?",
    "Where did they go?",
    "What just happened?",
    "Did you see who did it?",
    "What just happened?",
    "Bats? Are you sure?",
    "Hmm, I'd best go and check things out.",
    "What just happened?",
    "I'd have been surprised if it was, but what did happen?",
    "What just happened?",
    "I can tell that! What by?",
    "What just happened?",
    "And then they left?",
    "Aye, lad/lass, over the gate and into the jungle.",
    "Hmm, I'd best go and check things out.",
    "What just happened?",
    "Something dreadful? What did they look like?",
    "Hmm, I'd best go and check things out.",
    "What just happened?",
    "What did they look like?",
    "Hmm, I'd best go and check things out.",
    "What just happened?",
    "Oh, that's terrible.",
    "What just happened?",
    "Haven't you noticed that the town's been attacked?",
    "What just happened?",
    "Tell me more.",
    "I've questioned some pirates. Whatever attacked the town headed off into the jungle.",
    "No! I'd best get into cover, quick.",
    "Phew! That was close. That attack came from the east, I must find out who's behind all this. If I run from cover to cover while I make my way east, I should be okay.",
    "Attacking a larger population? This is bad. I should report back to Tiffy.",
    "Mos Le'Harmless was attacked and Sir Tendeth has been killed!",
    "After a trek through the jungle, I caught up with the attackers and spied on them. They talked about attacking larger cities!",
    "Some kind of dragons.",
    "They seemed to be some kind of dragon.",
    "Yes, they were kind of weird, boney and humanoid.",
    "Some kind of giant vultures.",
    "They seemed to be some kind of giant vultures.",
    "They weren't just any vultures, though. They were large, could talk and threw some incredibly powerful fireballs at me.",
    "I think they were dragonkin.",
    "I think they were dragonkin.",
    "Well, they were some kind of boney dragon people, wearing robes. They fired nasty, long-range fire attacks.",
    "I have no idea.",
    "I don't know what they were. I've not seen anything like them.",
    "I'm not sure. Some sort of grey things with wings, wearing robes.",
    "Hello, we're here to research some strange creatures.",
    "They were boney dragon people, wearing robes. They fired some nasty, long-ranged fire attacks at me.",
    "What's the Reprehensible Snow-",
    "I think I understand the reincarnation bit.",
    "Robert the Strong has been reincarnated as a priest. Some priests wear things called dog collars, so that must be it.",
    "Robert the Strong has been reincarnated as Bob the Cat.",
    "I know it's surprising, but it's true. I've done a thorough investigation into the background of this cat on one of my adventures. What I find strange about this note is that it looks like Robert knew he would be reincarnated.",
    "Robert the Strong has been reincarnated as the Wise Old Man. The Old Man's said before that he spent time as an adventurer, so it makes sense that he was Robert the Strong.",
    "Yes.",
    "Well, he's a troll, so he's made of stone, and I'm sure he touches things...mostly by hitting them.",
    "Yes.",
    "I think maybe I'm the stonetoucher.",
    "Bob, this is going to seem like a strange request, but... could I borrow your collar?",
    "I don't want to wear it! It could be the key to finding information about an attack on Gielinor, and more about your history.",
    "Do you have any idea what the markings on your collar mean? Apparently, it has the code to the plane of Kethsi on it.",
    "Yes. I've travelled to Kethsi, it seems it was devastated by the dragonkin at some point a long time ago. Here, look at this journal I found.",
    "And we know that Lucien is actively using the Stone.",
    "I'll get right on that.",
    "Everyone, I bring news. The world is in severe danger if Lucien continues to use the Stone of Jas.",
    "Well, there's a new downside, and the danger is more immediate than we'd feared. The power of a race called the dragonkin is tied to the Stone and how much it is used. In fact, if Lucien continues to use the Stone, the power is strong enough to wipe out all life on this plane.",
    "Akrisae, wait! Everyone, this is Ali the Wise. He's an acquaintance of mine who happens to know a lot about the Mahjarrat. I'm surprised to see you here, though. You're a long way from Nardah.",
    "Ah yes, the big Mahjarrat battle, where the Mahjarrat sacrafice one of their own to rejuvenate themselves. Lucien is very likely to make extensive use of the Stone then, which makes things even more urgent.",
    "I've encounterd Mahjarrat before. They're not all evil like Lucien is.",
    "What about those that follow Zaros? At least they're not followers of Zamorak.",
    "I've met an honourable Mahjarrat.",
    "So, instead, you'd risk all our lives, just so you don't have to associate with someone?",
    "I can't think of another way, and, since Lucien got hold of the Stone, can you?",
    "They're not that dangerous.",
    "Yes, we'll have to be careful. Hopefully, they'll be more worried about each other than us.",
    "Why, are you chicken?",
    "They're not all bad.",
    "I will risk my own life to negotiate.",
    "I'll make sure they behave.",
    "They have powerful magic we could use.",
    "Don't be so closed-minded.",
    "That does raise a problem. We don't even know where the ritual site is, let alone a way of getting to it.",
    "Could that be the fortress to the north-west of the Wilderness? I've been there, but I didn't find a tunnel. I could go back and explore.",
    "I found a secluded beach and cave to the north-west of the plateau. That could be your way in, if we're going in quietly. I will try to lower a rope to there.",
    "Perhaps I should hide it somewhere near the ritual site. We can lure Arrav into the right spot, when the time is right.",
    "I guess that adds another thing to my 'to do list'; snoop around Zemouregal's fortress and see if I can find any information about Zemouregal's control over Arrav.",
    "Azzanadra, I gather you may soon be attending the Mahjarrat ritual...",
    "I've pieced a lot of it together myself, in various dealings with other Mahjarrat.",
    "But our mutual friend, Ali, pinpointed when it was.",
    "A very good reason. Not too long ago, Lucien discovered and stole an ancient artefact called the Stone of Jas. He's using it to gain immense power, and, in doing so, he puts the whole of Gielinor in danger.",
    "From what I can gather, it had more to do with Zamorak's ascension than the Staff of Armadyl! It's an extraordinarily powerful artefact. Simply touching it grants great power and knowledge.",
    "There was one time...",
    "If I may make a suggestion, I have a number of allies, all of whom want to stop Lucien using the Stone. Ali proposed we form an alliance with you, so we can devise a coordinated attack on Lucien when he emerges for the ritual. In fact, I am on my way to the ritual site to prepare.",
    "What do you need?",
    "I'll see what I can do with these when I get to the plateau.",
    "So, you're still working for Lucien?",
    "But you are interested in using it.",
    "What are you doing up here?",
    "Then we're both after the same thing. If we work togeth-",
    "Well, no, but whose fault was that?",
    "I'll keep an eye out for hidden stuff.",
    "Where's your pal, Darve?",
    "I'll leave you to it.",
    "Could you be any more of a clichéd villain?",
    "I have nothing to say to you.",
    "*gulp*",
    "Phew, I thought he'd heard me for a minute there.",
    "Any luck finding the Stone yet?",
    "I'll keep an eye out for hidden stuff.",
    "I don't exactly know!",
    "What are you all doing here?",
    "I think so.",
    "Ali?",
    "I wasn't sure until now, but I suspected Ali was a Mahjarrat. Besides, you gave me leave to ally ourselves with them.",
    "I had no idea. But he has been my ally in the past, and I stand beside him now.",
    "Ah, yes, I was just heading there.",
    "Aren't you coming?",
    "Give in! You are defeated!",
    "After all that, he just teleports off?",
    "So, where next?",
    "He's not here. No one's here! I thought you said there was a battle going on! Now what?",
    "Lucien, you murderer!",
    "We'll see about feeble, Lucien. You'll answer for the deaths you've caused.",
    "Just give it up! Hand over the Stone.",
    "Gah! Where did he come from?",
    "Wahisietel...",
    "That's right, Arrav. Become the hero of Varrock once more.",
    "Tiffy is right, we need to do something about this Stone. It's clear the dragonkin are linked to its use and that Lucien's lust for power is what brought them here.",
    "Excuse me?",
    "There has been more than enough pain and torment for one day. Let's just get this finished.",
    "What now? I don't know how to move a relic of infinite power that unleashes guardians capable of defeating Mahjarrat. Do you?",
    "I've been building a nice house. There's plenty of space in the garden; it might make for a nice water feature...",
    "Yes, Thaerisk. We need to hide it where it can never be found. Do you know of anything in your teachings that can help?",
    "Any trained mage can teleport. Is that all you've got?",
    "I'm ready!",
    "Yes, let's get out of here.",
    "This isn't Falador...",
    "Tiffy! Did that get you?",
    "*cough*",
    "Tiffy!",
    "*cough*",
    "What was up with that nightmarish scene in Draynor?",
    "But we teleported there from the ritual site - me, you and Thaerisk. Idria was there, and Akrisae...the heroes. Everyone was dead!",
    "But...I could have sworn I saw...",
    "I guess you didn't...never mind.",
    "I found a message from you to yourself.",
    "No, but then, it was a letter from you to yourself when you were Robert the Strong.",
    "Would you like your collar back?",
    "Your collar isn't just a collar.",
    "What? No, nothing like that. It turned out that DIRAKS printed on the inside was a code to travel to another plane called Kethsi! When I got there, it also turned out to be a key which unlocked a stash of items you'd left there. Well, you when you were Robert the Strong.",
    "I found a message from you to me.",
    "You wrote it when you were Robert the Strong, but it seems like it was addressed to me now.",
    "I found a necklace - a gift to you from your sweetheart...",
    "It's not from Neite, it's from Ilsinor-",
    "Wait, no, it's not a cat! Ilsinor was Robert the Strong's sweetheart, long before he became your Bob.",
    "A note that came with the necklace said it was important."
  ],
  "Sir Tendeth": [
    "Pirates? No, no. If anything, pirates attack ships, not fortified cities. I'm following intel on a much bigger threat. One that's a danger to fortified cities, ships, pirates, sheep farmers, old men wearing party hats... everyone!",
    "What's going on out there?",
    "Well come back to me when you're ready.",
    "That sounded very, very bad. Could you ask around and see if anyone outside saw anything? I just... I need to settle my nerves a bit.",
    "Well, in that case, could you just have a look outside the gate to see if anything's lurking nearby?",
    "Hold up! I'll come along too."
  ],
  "Mama": [
    "No dearie, I was in here with you."
  ],
  "Stanky Morgan": [
    "There was a lot of noise and fire.",
    "Then I think we know about the same."
  ],
  "Bard Roberts": [
    "It looked like sky itself opened up and fire and Wrath rained upon us.",
    "Maybe someone around here annoyed the gods."
  ],
  "Pirate": [
    "Arr. Dragons, I tell ye.",
    "Arr. Dragons!",
    "I were walking along, minding me own business, when some scurvy dog chucked a ruddy-great fireball at me!",
    "No, I were too busy writhing in pain.",
    "It was some sort of magical giant bats, I tells ye.",
    "As sure as the corns on me feet. They've flown east out over the island.",
    "Wasn't me, lad/lass.",
    "Big, scary, firebreathing albatross. Now it's flown off into the jungle.",
    "We were attacked.",
    "How should I know? It's not every day that the sky rains fire.",
    "There were a terrible shaking, then dragons garbed in robes appeared and blasted all round.",
    "well, there be nasty things in the jungle, but nothing as dreadful as what we've seen t'day.",
    "They were like some kind of enormous vulture. They disappeared into the jungle beyond.",
    "There were an attack! Some fearsome beasties rained fire down on us and then headed into the jungle.",
    "Not sure. I was too busy cowering, to be honest.",
    "Ow, my bones! Arr, I'll likely be needing a peg-leg now.",
    "It ain't so bad - they be quite teh fashion with us pirates.",
    "Well, I jusht finished off me portion of 'rum'.",
    "Nope, lad/lass, but as I shay, I've jusht finished off me 'rum'.",
    "Fiery doom! Come to destroy us all.",
    "Doom! Doom! A pox is apon us."
  ],
  "Patchy": [
    "Aye, they be bony dragons.",
    "No, these stood tall like men. Taller. And I swear one of them said something.",
    "I don't know. I just hope it be a long way from here."
  ],
  "Sithaph": [
    "Grah! The rage subsides for now. Destruction always eases the pain.",
    "Yes! But we must also continue our search - we must find the False User.",
    "You are no god, False User, just another fool who believes they can manipulate the power of the Stone, like other fools before!",
    "The False User does not know that he called us?",
    "He still uses the Stone. I feel my rage growing.",
    "I am in agreement.",
    "Yes. Those before us should know that ALL will suffer now we are unleashed!",
    "Your destruction is at hand.",
    "We dare.",
    "Agreed. The pain subsides a little.",
    "Know this, watchers: we answer only to the Stone. All will pay the price for its misuse."
  ],
  "Strisath": [
    "Yet the rage continues to build. Someone must still be using it.",
    "No, he is oblivious.",
    "It grows in me too. I feel the need to destroy the False User.",
    "The little creature addresses us. It angers me. Her too?",
    "Beware, False User. Your power is taken from the Stone. Our power IS the Stone.",
    "False User is defeated.",
    "The dragonkin are awakened! This world will suffer as we do.",
    "No, you won't.",
    "Give in to the power of the dragonkin, stonetoucher!",
    "This was just a vision of what is to come, stonetoucher - It will begin in Edgeville. Return to reality and await your fate!"
  ],
  "Sakirth": [
    "Then we should attack an area of greater population. Mass destruction will ease the pain."
  ],
  "Lady Table": [
    "This isn't exactly a lending library, you know.",
    "Dragonkin? That would be surprising. What did they look like?",
    "Well, that does sound like dragonkin.",
    "Yes, we do. Let's see. It hasn't been accessed in years and mostly seems to contain a list of 'sightings' over the years. Same sort of things that we get on the Reprehensible Snowgre.",
    "Wait, there's a strange note here. Looks very old. Doesn't mean a lot to me, though. I'll read it to you. 'To learn the secrets of the dragonkin, the stonetoucher must first take the collar from my reincarnation. On it is the code to the plane of Kethsi and the key to the puzzle once he gets there.' - Robert the Strong. Hmm, how strange.",
    "Well, I suppose that sort of adds up. There's lots of priests in the world, though. We'll need something a bit more concrete.",
    "That doesn't sound likely!",
    "I am acquainted with him of whom you speak. It would surprise me if he was previously Robert the Strong.",
    "Go on then, tell us.",
    "I suppose it could be. There are a lot of dwarves in the world. The note seems to be referring to an individual, though, not a race.",
    "Why?",
    "I suppose it's worth a shot. Go find this Bob the Cat and see if there's anything special about his collar."
  ],
  "Bob": [
    "Um, I'm not sure it will suit you.",
    "Okay, I guess. Here you go.",
    "No, I've had this collar for as long as I can remember. I was wearing it when I was taken in by Gertrude as a kitten - that's how she knew my name was Bob. I have no idea what DIRAKS means. I'm just glad that Gertrude didn't assume that was my name!",
    "Well, I don't remember writing any messages... I'm a cat; the only messages I leave are when I'm marking my territory. Do you have it with you?",
    "Oh, well it must be pretty old. Can't be of much use now, right? I wouldn't mind seeing it, though.",
    "Well, that makes no sense to me. Are you sure it's for me? It seems more like it's for the old me, before I became a cat. Not that that makes sense either. Either way, it sounds like you shouldn't go waving this in public.",
    "That would be good. I feel a little naked without it.",
    "Why, what else is it? A bomb? A weapon? An ancient artefact full of godly power?",
    "Really? That's incredible! Why would my collar do that? It makes me wonder even more where my collar...where I came from.",
    "I don't remember writing you a message. Being a cat, I'm not even sure I could.",
    "How can that be? Maybe you should show it to me...",
    "That's interesting. I clearly don't remember writing this, so it must be from Robert the Strong...but how would he know so much about you? And he knew he'd be reincarnated as me! Well, as a cat, at least.",
    "Oh, Neite, you shouldn't have.",
    "I don't know who Player's talking about, Neite. I've never even heard that name. You know you're my queen.",
    "So, why tell me about it?",
    "Well, I'm sure it meant something to Robert, but it means nothing to me. Sorry."
  ],
  "Idria": [
    "How is this news? We already knew that a power-hungry Mahjarrat gaining divine powers from an ancient artefact - and the Staff of Armadyl - had a few downsides.",
    "Let's not jump to conclusions here. I did not think too highly of Player when first we met, but was happy to be proven wrong.",
    "If Lucien is using the Stone, he may have it hidden somewhere near the plateau. It may also be a good idea to have a look for it, before the ritual starts.",
    "Let's do this!",
    "It must be.",
    "Whatever they are, it sounds like they're here for the same reason we are. We may be on the same side...",
    "Excuse me, guardians of the Stone...",
    "I beg your pardon, but we're here to stop him too. We could join forces.."
  ],
  "Akrisae": [
    "Saradomin help us! We've struggled to make progress against the Lucien problem, and now this.",
    "Who are you? How did you get in here? Guards!",
    "Lucien...the dragonkin...and now some Mahjarrat ritual? What more could go wrong?",
    "Are you mad? If you think the Temple Knights will work with one evil Mahjarrat to get rid of another, you can think again!",
    "Everything I've heard of the Mahjarrat claims that they are of the darkest evil! I will not be tainted by association!",
    "What? How dare you speak that name to me! His followers are as much my enemy as Zamorak's are!",
    "They are manipulative, deceitful creatures. I wouldn't trust any of them.",
    "Well, no, but...",
    "Surely there must be a better way than this?",
    "It seems a risk. What's to stop them turning on us?",
    "I'm not sure how you can say that with the amount of havoc their kind have caused over the years.",
    "Well, I'm certainly not going to negotiate an alliance with such beings.",
    "I am no chicken, nor any other farmyard animal, but to not be wary of the Mahjarrat is folly.",
    "From what I know of these creatures, I could never agree with that statement.",
    "Okay, fine. Persuade them to not get in our way when we turn up at this ritual.",
    "You cannot control the Mahjarrat. Even the gods could not control the Mahjarrat.",
    "They have powerful magic that they'll do Saradomin-knows-what with. I'm not going anywhere near their foul sorcery.",
    "I will not open my mind to the evils of this world.",
    "If you find a way onto the plateau, maybe you could let a rope down so that we can sneak our troops on.",
    "If you do manage to find it, we might even be able to teleport it out. Our teleorbs may come in handy there. You'll need several orbs for something so large, though.",
    "Arrav's heart? What?",
    "What? You just happen to be carrying around the heart of Varrock's greatest hero?",
    "Player! How did you get here?",
    "Well, at any rate, I'm glad we've found you.",
    "The rope you left was handy. There are now several patrols of White Knights, some druids and Guardians of Armadyl on the plateau too.",
    "What in Saradomin's name is this?",
    "What foul abomination have you brought upon us, Player?",
    "But I...Saradomin...",
    "But I... Saradomin...",
    "Something isn't quite right.",
    "Well said! Where is the Stone?",
    "Hurry, Tiffy, we need more help now!",
    "Tiffy...",
    "Is that truly Arrav?",
    "But he looks so... He's nothing like how I pictured him.",
    "These vile Mahjarrat have turned him into a monster!",
    "The Stone of Jas!",
    "All is lost. Lucien is dead, but we were too late. An even more powerful enemy is revealed! And Idria...",
    "No!"
  ],
  "Ali the Wise": [
    "Perhaps I might offer a suggestion.",
    "Indeed, and I apologise for the intrusion, but I had to find you and tell you, Player. I've been consulting my research and looking at the stars, and I believe the Mahjarrat ritual is sooner than we thought. I've not quite pinned it down exactly, but it will likely happen any time now.",
    "I think you're looking at this the wrong way...Akrisae, isn't it? We could use the Mahjarrat ritual to our advantage. I'm sure there will be Mahjarrat there who will also want to defeat Lucien. Who better to defeat Lucien than his own kind? If you combine your forces with theirs, it might be enough to beat him, even if he is using this Stone you talk of.",
    "Ancient texts speak of a passage to the site from a place called Ghorrock Fortress.",
    "I suspect that Zemouregal may bring Arrav to help him in the ritual, so we may be able to make use of Arrav's heart...",
    "Shhh, keep it down. Player helped me to steal Arrav's heart from Zemouregal. Since it came into my possession, I've been studying Menaphite organ magic, and there is a spell that could wrench away Zemouregal's control. To cast the appropriate magic, we'll need to draw Arrav close to his heart, without Zemouregal noticing.",
    "Okay, take the heart with you to the plateau.",
    "I'm not entirely sure of the nature of the spell that Zemouregal has cast on Arrav. He might have ways of strengthening his control, which may mean I can't free him.",
    "Okay, I can't think of anything else you need to do on the plateau. I'd suggest you next talk with our mutual Mahjarrat friend, Azzanadra. He's the most likely to be our ally in all of this.",
    "The planets have aligned. The ritual begins now.",
    "Just as well, as it seems the Mahjarrat have brought their own forces. There are fights breaking out all over the plateau.",
    "You never were our brightest star, Khazard. 'Vermin slaughtered like lambs'? What does that even mean?",
    "Ah, Player. I'll see you up at the ritual site."
  ],
  "Thaerisk Cemphier": [
    "Personally, I think it might add a bit of balance to our alliance. There's a little too much piety around here for my liking.",
    "How can I-",
    "The Stone of Jas!",
    "Hmm, I know just the thing. We can channel a teleportation spell.",
    "You misunderstand. We can all hold numbers in our minds. I'll focus on depth, to ensure the Stone ends up deep underground and not in Varrock Palace gardens or something.",
    "Tiffy, you focus on any number, as big as you want. That can channel into the coordinates of the Stone.",
    "And you, Player, you focus on a simple number, used as a cypher for Tiffy's number. The spell will then go through each of our minds, encoding Tiffy's coordinate with your number, and my depth. Individually, none of us will know where it will end up.",
    "Good to hear. Let's get into position and then channel the spell.",
    "You okay over there, Tiffy?",
    "Player?",
    "Thank Guthix. I'm not used to being in the field like this. Back to Falador?",
    "Idria! This can't be!"
  ],
  "Thaerisk": [
    "Someone should scout the area where this ritual will take place, to get the lay of the land up there.",
    "Then focus your minds and this can happen in...",
    "...3...",
    "...2...",
    "...1...",
    "...NOW!"
  ],
  "Azzanadra": [
    "...",
    "You're well-informed. How did you come by this knowledge?",
    "Did he now? He must have had good reason to tell you.",
    "My spies informed me that he was in possession of the Staff of Armadyl. That's already concerning enough, but nothing I could not counter. I'll admit, though, that I've not heard of this artefact of which you speak. It seems much has transpired during my imprisonment that I am yet to discover. Tell me of this Stone of Jas.",
    "You speak of this as if you have first-hand knowledge.",
    "Do not dwell on it. You have proven your loyalty yet again. Thank you for bringing this to my attention. I will have to reconsider my strategies.",
    "And Ali once more proves his wisdom. Yes, an alliance would be of mutual benefit. If you're heading to the ritual site now, then I have one more small task for you.",
    "Within the walls of this chamber, I can receive the power of My Lord, but it doesn't go much further than that. I have, however, been storing up his divine power in these special beacon jars, in preparation for the ritual. Hide these beacons at each cardinal point of the ritual site, making sure the north and south beacons are opposite each other, and the same for east and west. Put them high up and they will be better able to project.",
    "Player, know that I would not entrust this task to anyone else. I will see you at the ritual.",
    "Don't you have things to do at the ritual site?",
    "Pathetic. I should have known you'd try to snub the power that will eventually destroy you.",
    "Indeed, you have not felt Zaros's true strength for too long. Allow me to give you a remin-",
    "Player, this is it! But I sense the southern beacon is broken. See if you can fix and reposition it. When you are done, I will call upon the full might of Zaros and end this!",
    "As do I. Now to end you, Lucien. Behold the might of Zaros!",
    "Until the next ritual."
  ],
  "Movario": [
    "[Mister/Miss] Player, we meet again.",
    "Ha! As if. Ever since I found the Stone of Jas, he's shut me out...after all the research I did for him! It's quite the insult. He thinks I'm only interested in using the Stone for myself.",
    "Well, yes...but that's not the point! He wants it for its power; I wish to study it.",
    "What else would I be doing? I'm trying to find where Lucien has moved the Stone.",
    "Right, because our last partnership turned out so well.",
    "My device tells me the Stone is nearby, which makes sense, as Lucien's base is close. I'm also detecting some shadow magic somewhere in this vicinity. I can't quite pinpoint it, but there may be a hidden entrance.",
    "If I find anything relevant... I might let you know. I've not decided yet.",
    "General Khazard has called back his reserves for some reason, which includes Darve...not that I care. He had his uses, but subtlety wasn't one of them, and that's what I need right now.",
    "Cliché? I don't know what you mean. I was merely surprised to run into you again and thus commented on the fact. It's not like I'm some moustache-twirling villain revealing my master plan.",
    "My device tells me the Stone is nearby, which makes sense, as Lucien's base is close. I'm also detecting some shadow magic somewhere in this vicinity. I can't quite pinpoint it, but there may be a hidden entrance."
  ],
  "Zemouregal": [
    "Who goes there? I can sense your presence.",
    "No, that's no good. Too clichéd. ... I know you're there! Face me!",
    "What? Nobody! I'm, er, practising for the ritual. Get back to work!",
    "Perhaps, but she's right to want rid of a Zarosian. You know this to be true, Lucien.",
    "Lucien, ignore this petty squabbling. Heed my wisdom - it must be one of the Zarosian scum. Pick one of these four in front of you.",
    "Ah, a fair choice indeed - it may as well be the most useless of us!",
    "Still the puppetmaster I see, Sliske. Let's see what your wights can do!",
    "Not your first failure; you are truly useless. Bring in Arrav!",
    "Arrav, your will is mine to command. Destroy the wights!",
    "Lucien, you would betray me and let me be the one to die? You are not worthy to decide. Wahisietel was right - all on Lucien!",
    "So, Lucien is dead. Good riddance, I say."
  ],
  "Sharathteerk": [
    "Who are you talking to, master?",
    "I come at your call, my lord.",
    "My lord, the zombies... They were defeated far quicker than I anticipated. I did not plan for the Barrows wights to be here!",
    "It will be done, my lord."
  ],
  "Commander Zilyana": [
    "Lord Saradomin, is that you? I feel so cold.",
    "What just happened? What is this place?",
    "I...I am deeply honoured, my Lord. Do any others know of this?",
    "But how can he know of your secret?",
    "And it never shall again, my Lord. I serve you now and always."
  ],
  "Saradomin": [
    "Be healed, my loyal commander.",
    "Zilyana, behold the Eye of Saradomin, an artefact that has supplemented my powers immensely.",
    "I have kept it hidden, but it was the only way to save your life. Now you know my greatest secret.",
    "Zamorak knows. He wants it for himself. This is the real reason he's returned from his banishment and started this horrific war.",
    "Because it's what he used to attain his godhood. After his banishment, I confiscated the artefact and hid it here. Such power cannot lay within the hands of chaos."
  ],
  "White Knights": [
    "Sir! Yes, sir!"
  ],
  "General Khazard": [
    "So, all the vermin together in a pack, ready to be slaughtered like lambs!",
    "Wahisietel, is that you? Hanging out with Saradominists now, are we?",
    "He is!",
    "And worried you should be! I think you'll make the perfect sacrifice for the ritual, Wahisietel, just as soon as we've dealt with these maggots!",
    "Bouncer, destroy this fool!",
    "Ha! You think I'll end up being the one sacrificed today? Not likely!",
    "Never!",
    "Yes, any of those fools will suffice! Why not Wahisietel?",
    "Jhallan is not worth it. Wahisietel is more trouble; I say we choose him instead.",
    "I too have, um, matters to attend to."
  ],
  "Wahisietel": [
    "Of course. 'Ali' was a useful disguise, while it lasted.",
    "Calm yourself, priest. My disguise was necessary in human lands, but I'm still on your side. Do not waver now, save your holy crusade for later. We have Khazard and his lackeys here to worry about first.",
    "Your dog can't help you now!",
    "It's over, Khazard! Yield or be destroyed!",
    "Fear not, Player. Khazard may be a cowardly child, but even he is not stupid enough to leave the area at such an important time.",
    "The time grows nearer. He'll be headed to the ritual stone.",
    "Oh, he's here. I can sense Mahjarrat...and fear.",
    "ENOUGH, KHAZARD! REVEAL YOURSELF!",
    "Lucien!",
    "You're no god, Lucien; just a petty thief.",
    "Keep a cool head. Lucien is too strong for you to handle directly. I'll hold him back while you deal with his minions.",
    "This is the power of a god, Lucien? It's over, and so quickly too. I expected more from you!",
    "Oh dear, this won't be easy.",
    "I'll do what I can, but I fear this will require more power than I own.",
    "Praise Zaros! Sliske! Always in the right place at the right time.",
    "Unfortunately, he may be right. Be ready, everyone. This fight is ours alone.",
    "Ha! You two are lucky to have lived this long. We endure because we are strong. The four of us together could destroy you in the blink of an eye.",
    "No. There is more at stake here then you realise. It MUST be Lucien!",
    "The wights won't be able to defeat Arrav, Player. Attract his attention and lure him towards his heart!",
    "Regain control. Know your former self. Revenge yourself upon he who enslaved you for a century!",
    "Ignore Lucien's new creature! Fix the beacon so we can finish this!",
    "How does that feel, Lucien?",
    "Yes, but the Stone is still here. Perhaps we must hide it away, prevent its further use...or misuse.",
    "Still here, Sliske? I thought you'd have left with the rest of them.",
    "Sliske! I should have known he'd stay for some profit.",
    "I am sorry. He is a powerful ally, but his actions are his own. If nothing else, you can at least trust that you can't trust Sliske.",
    "My use here has ended. I owe you enough to not betray you by watching what happens to the Stone. I return to Nardah. Farewell."
  ],
  "Silif": [
    "Akrisae, Idria and Thaerisk are all up on the plateau. I think you're expected up there too.",
    "No some people are needed back here still."
  ],
  "Lucien": [
    "Khazard's not here...",
    "Will I do, Wahisietel?",
    "Yes, me. The fear you sense is your own.",
    "Ha ha ha, and what's this? You've bought[sic] some feeble excuse for backup with you too - a faltering priest, a bumbling adventurer and an old man.",
    "How dare you address a god in such an insolent tone!",
    "Like I'd tell you. The Stone is mine and mine alone. Allow me to demonstrate some of the power it has given me!",
    "Fight for me, minions!",
    "Over? I'm just getting warmed up!",
    "I've told you before not to address a god in such a tone, but still you persist! It is time you learn a harsher lesson.",
    "Ah, Sliske. I wondered when you might slink in...but you should have stayed hidden in your shadows this time. What can you hope to do against the power of Lucien?",
    "DESTROY THEM ALL!",
    "I grow tired of your pathetic attempts to stop me. You must realise by now that you can do nothing. Besides, there are more pressing matters: the ritual is upon us, and I must choose the sacrifice.",
    "Fool! That's exactly what it means! My power gives me the right to do as I please. No one can stop me! Dare you toil like these cretins have?",
    "Oh, and whom might you suggest?",
    "SILENCE! I DECIDE!",
    "You flit around like pathetic insects, clinging onto existence. Only one of us shall die today, to replenish us all...and it will be a Zarosian.",
    "But the answer lies not before me...",
    "...it lies beneath!",
    "I control what happens here! Dare not question my command again!",
    "You think Player, a mere human, will be my undoing? Let [him/her] try to fix your precious 'beacon', Azzanadra, but don't expect him/her to survive this!",
    "Enough fighting! The time is upon us. Jhallan will face the void, so that we may be rejuvenated!",
    "That's more like it!",
    "I actually felt that one...but it's still not enough.",
    "I did not want to waste any more precious Mahjarrat blood today, but you have forced my hand.",
    "No! It is mine! Aligned to me! Useful to no other while I still live! None can stand against me! I AM A GOD!",
    "An interesting display of power, but it does not compare to my own.",
    "You DARE mock the power of Lucien?"
  ],
  "Sliske": [
    "Then perhaps it is time for us to fight alongside each other once more.",
    "No. Not alone.",
    "Perhaps it IS time for one of these to meet their end...",
    "I never thought I'd agree with Zamorakian filth, but he may be right on this one. We would allow this.",
    "Time for some more backup!",
    "We are reborn. I feel a power reawakened in me!",
    "Good luck with that, my brother.",
    "I had a reason to stay...",
    "Player, I have been following your progress for some time now, watching from the shadows. You have grown most powerful,",
    "and now I am rejuvenated, I have an opportunity to expand my collection.",
    "And now [he/she] is one of mine. Come with me to the Barrows, Player.",
    "Ha ha ha! Well, you will do just as well, for now!",
    "Not today."
  ],
  "Enakhra": [
    "No, Lucien. You may well be the most powerful, but you do not decide who faces oblivion.",
    "No...of course not! I...I wasn't questioning your power...merely suggesting we think this through. Who dies here affects us all.",
    "I want it to be Akthanakos!",
    "No! I demand it be Akthanakos!",
    "We are rejuvenated. I have no wish to stay here and share Lucien's fate."
  ],
  "Akthanakos": [
    "Like we need to ask. She cannot defeat me herself, so seeks others to do it for her.",
    "Then it's a shame no one listens to you.",
    "Yes, we stand together."
  ],
  "Hazeel": [
    "Indeed.",
    "Hmph."
  ],
  "Arrav": [
    "My...",
    "My heart?",
    "ZEMOUREGAL!"
  ],
  "Akrisae the Doomed": [
    "I serve you, master."
  ],
  "Neite": [
    "Ilsinor? Who's this she-cat after my Bob? She can keep her paws to herself. Explain yourself, Bob!",
    "Hmph, well, I guess that's alright. I forgive you, Bob. I almost had my claws out there."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Ritual_of_the_Mahjarrat?oldid=36140702’"
  ]
}