{
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "Missing miscellanous dialogue optionsYou can discuss this issue on the talk page or edit this page to improve it."
  ],
  "Player": [
    "Hello!",
    "I said hello!",
    "Who are you?",
    "Why are you firing a cannon at a wall?",
    "What's the difference?",
    "I still don't quite follow...",
    "Have you tried taking a pickaxe to it?",
    "We? I don't see anyone else.",
    "Isn't there?",
    "Okay... so why were you trying to get through the rock again?",
    "Hey, I'm not so young!",
    "No, it just feels like I've been mining for that long.",
    "Oh, you're not so old!",
    "So why don't you?",
    "Haha! So you found a hard place huh?",
    "Bit noisy here, isn't it?",
    "No! I said it's noisy!",
    "Goodbye!",
    "Sure, sounds interesting!",
    "Any idea on what's inside the rock?",
    "How so?",
    "Now where would I do that?",
    "And what are you going to do while I go running across half of RuneScape, I'll wager?",
    "Want to trade places?",
    "But I still don't know where!",
    "What did you need me to do?",
    "I'll be back later.",
    "What do you know about impenetrable rocks?",
    "The big one in the mines south of the city. Dondakan's big rock.",
    "Where can I find him exactly?",
    "Thanks!",
    "Do you know anything about this rock in the mines?",
    "The big rock in the mines to the south, with an old dwarf standing beside it...?",
    "Er, yes, I think so. Do you know what it's made of?",
    "So where can I find this Rolad?",
    "Great, thanks a lot!",
    "Excuse me... would you happen to be Rolad the scholar?",
    "Player, and I've come to ask you about a rock.",
    "It's this rock that Dondakan is trying to break open. You know Dondakan, right?",
    "Yeah, that's the one. What can you tell me about it?",
    "What's wrong?",
    "What? No! I need that book!",
    "Where should I start looking?",
    "What, in the mining guild?",
    "Okay, thanks, I'll go and look for the pages then.",
    "I haven't found a single one yet, I have no idea where I should be looking.",
    "Well, I found the first page, but I still have two to go.",
    "I found two of the pages! But I haven't found the last one yet.",
    "Look, I found all of your missing pages!",
    "Yes, the missing pages of that book we were talking about earlier?",
    "Of course, I'd be happy to!",
    "Of course... when I've finished with it I'll give it back to you, sure...",
    "That was quite an interesting book you gave me.",
    "Yes, but I'd like to hang on to it a little longer, if I may.",
    "No, not yet, but I will.",
    "Ahem... errr... I lost that book you gave me.",
    "No, I hadn't had the chance yet.",
    "Wait, if you had a copy of it, why did I have to look for your missing pages?",
    "Rolad gave me a book that was quite interesting to read! I think I know what's inside it!",
    "Ehm, well... a demonic spirit for one...",
    "A demonic spirit! And apparently the inside of the rock is lined with gold!",
    "Yes... and a de-",
    "I'm not sure... It mentions something about a yellow material. But it doesn't seem to be particularly concerned with actually breaking open the rock. You see, the demon spirit is being kept inside it.",
    "What have you tried so far?",
    "Any effect?",
    "Oh, really?",
    "Wow! That must have made quite an impact!",
    "What else did you try?",
    "Yeah, great!",
    "Nice boots... but what about them?",
    "I er... didn't see anything.",
    "And now I have to come up with a material that will affect it somehow?",
    "Some kind of new material that no one has ever found before but which I am supposed to accidentally stumble upon, perhaps?",
    "I'm tired of these stories.",
    "So the book mentioned a yellow material...",
    "Well it strikes me that we need to find something yellow to fire.",
    "Hmmm... bananas? Buttercups? Lemons?",
    "I was thinking out loud!",
    "Maybe we should set up another cannon?",
    "How do you mean, that I can find? What are you doing then?",
    "I'll be back later.",
    "Well... the book does say that there's gold inside the rock, and it did say that a yellow item would work. So I thought perhaps gold can damage it as well.",
    "I have that golden cannonball you asked me to make.",
    "Yes, I'm sure this will crack open the rock.",
    "No, on second thought, I'd rather sell it for a huge profit.",
    "The cannonball went right through it!",
    "But... the rock didn't actually break, did it?",
    "So how does this help us?",
    "Shoot me... through it? Errr... what exactly do you mean?",
    "But... what if I bump into that demon, the one from the book?",
    "So you want to... fire me into the rock?",
    "Are you sure that it's safe?",
    "Find some else for your bizarre experiment, I'm not going to crawl into that cannon of yours! Or have you shoot me at a solid rock!",
    "Forget it.",
    "I can't argue with that, shoot me in!",
    "Okay, I'll just wait right here until you've made them.",
    "Okay, so you want me to look for the schematics for you, is that it?",
    "Won't a gold-plated helmet do?",
    "No no, I'll get you a helmet made out of solid gold.",
    "Although that will be a horrendously heavy thing to actually wear.",
    "That's what I thought you'd say.",
    "My head's spinning, I have to go for a bit.",
    "What did you want me to find again?",
    "Sound simple enough,  any idea on where I can find those schematics?",
    "Again...",
    "I lost that schematic you gave me, actually.",
    "Do you have any schematics related to the dwarven multicannon?",
    "Ah, so you do! Dondakan needs schematics to modify his multicannon, to fire a human you see.",
    "Ehm, yes, I suppose so...",
    "Thanks... I suppose.",
    "Do you have any schematics related to the dwarven multicannon?",
    "Oh yes.",
    "I'm looking for schematics to modify the dwarven multicannon to fire a human. Can you help?",
    "Well, can you give them to me? I'd be willing to try the experiment.",
    "Who did you give them to?",
    "Okay, okay, can I have that one schematic then?",
    "No, I've had enough of buying drinks for people!",
    "It's always like this... Sure, I'll help you Player, just as soon as you get me a drink!",
    "And more often than not they actually want a very special drink that can only be gotten in the next town, or beyond.",
    "And what is wrong with all you people anyway? Sometimes it seems as if half the population of Gielinor is an alcoholic!",
    "So, no, I won't do it anymore, you can get your own drink for once, and I'm just going to stay right here until you've done so!",
    "Oh, alright, what do you want to drink?",
    "Oh, I have a glass of that right here, have it!",
    "Here, I've got your dwarven stout.",
    "Thanks for that schematic.",
    "No, fortunately not.",
    "You've been so helpful with that book, I was wondering, can you help me with something else as well?",
    "Dondakan wants to modify his multicannon, you see, to fire a human.",
    "But can you help me with the schematics? Dondakan needs to know what he needs to modify.",
    "Oh those will be tremendous help already, can I borrow those off of you as well?",
    "You are rather a forgetful person, aren't you?",
    "Oh, alright, I'll go and have a look.",
    "I'd better look for them as well then?",
    "Err, no, we can't have that.",
    "I can't seem to find your schematics... Did you lose them down in the mines again?",
    "No idea at all?",
    "I found your schematics! You wrote them down on one of the pages of that book you gave me!",
    "Say, you wouldn't happen to have another copy of that book, would you?",
    "Er, yes, I lost your book....",
    "Great, thanks a lot!",
    "What did you want me to find again?",
    "I think I have all different parts of the schematics...",
    "I have that golden helmet you said I'd need, what else did you need again?",
    "Sound simple enough,  any idea on where I can find those schematics?",
    "Again...",
    "I've got your schematics... what else was I supposed to do?",
    "I would prefer that, yes.",
    "I've got your schematics all assembled, and I have that golden helmet as well!",
    "I've got your schematics all assembled, and I have that golden helmet as well!",
    "You may fire when ready!",
    "Ready as I'll ever be...",
    "Err... maybe another time, I have some important business to attend to.",
    "Er, not really, no...",
    "I'm starting to get second thoughts about this!",
    "I'm thinking of that demon...",
    "That's what I'm afraid of.",
    "Where... where am I?",
    "What is this place?",
    "Dondakan said there was supposed to be a river behind the rock... but I don't see a river here.",
    "I think... I think... I think I may be...",
    "inside the rock!",
    "What? What was that? Ow, my poor head... this helmet seems heavier than ever!",
    "I need to think fast. If I remember correctly, that book Rolad gave me mentioned that the demonic spirit had an aversion to gold. Perhaps I should mine some before I continue.",
    "Yes... gold, yes...",
    "I ehm, also ran into this spirit thing. You remember, from the book?",
    "The rock... seems to be a lot larger than it appears on the outside. I was actually able to walk around in there. But it was like... walking around in a dream.",
    "I'm not quite sure, it all seems so distant now.",
    "Right. Kill it. Simple. Okay.",
    "Ready as I'll ever be...",
    "Err, maybe another time, I have some important business to attend to.",
    "I em... let me just collect my thoughts. It all seems like a sort of distant dream now.",
    "I... believe I killed that... what was it? That Arzinian being. That demon.",
    "Well, I killed its avatar. I'm not sure what happened to the demon itself.",
    "For us.",
    "Great, thanks a lot!",
    "How are you doing, Dondakan?",
    "Can you shoot me into the rock again?",
    "Are you selling those boots of yours?",
    "Yes, I'd be happy to pay quite some money for them!",
    "Oh please...",
    "Pretty please?",
    "Oh come on!!!",
    "Yes?",
    "Bah, thanks a lot.",
    "Never mind, I don't want them anymore.",
    "Okay.",
    "That's great, but I have to go now.",
    "What do you know about impenetrable rocks?",
    "The big one in the mines south of the city. Dondakan's big rock.",
    "Yes, what exactly does that mean anyway?",
    "Does that mean I will have to deal with this demon again some time?"
  ],
  "Dondakan the Dwarf": [
    "What?",
    "Hello!",
    "Why, I'm Dondakan, of course!",
    "Cozy? No, not really, it's damp and cold!",
    "Then stop shouting!",
    "Oh, just fine, just fine! This gold is certainly creating a steady flow of income for me! After the company takes some of the cut, of cause.",
    "Of course, just a second, let me adjust my cannon again.",
    "You need to wear that golden helmet... unless you want to crack open your skull on the rock.",
    "What, you mean these granite boots?",
    "Haha, I bet you would, I bet you would!",
    "But I no longer need the money, this rock is generating plenty! Besides, I'm rather fond of them now... best boots I ever had!",
    "No, I won't sell them.",
    "No!",
    "Well...",
    "How much gold would you be willing to pay for it? Not that I'm selling my boots, mind, I'm just curious.",
    "What, are you trying to scam old Dondakan? You want me to sell these boots for a measly amount coins?",
    "I'm not selling them anyway.",
    "If I were selling my granite boots, which I'm clearly not, I would certainly not accept a mere amount coins for them.",
    "Haha, nice try Player!",
    "Pity I'm not selling my boots, not for any price or any item. I just want to see how high you would go!",
    "Hey, that's quite a bit of money. Which you don't have on you. Oh well, I wasn't selling my boots anyway.",
    "Great, because I don't want to sell them.",
    "Right.",
    "Come back any time!"
  ],
  "Dondakan": [
    "It's not a wall! It's a rock!",
    "It's a very special rock!",
    "Oh, for Guthix's sake, it's perfectly simple! See, that rock over there, it's impenetrable!",
    "Of course I have. I'm holding this adamant pickaxe, aren't I? We've been trying to mine through it for years!",
    "Well, I'm the only one left... all the others gave up. Said it wasn't worth their while anymore. Wouldn't have a good return profit on their time investment.",
    "At first we thought there might be a huge treasure behind the rock, you see.",
    "Until we had a look further down the stream, around the rock... no there's no treasure there, just a dead end.",
    "Because obviously there are vast deposits of minerals inside the rock! And if not, I want to harness the extreme hardness of the rock itself!",
    "The only problem is that I have run out of ideas on how to do it.",
    "Perhaps a young adventurer like you is willing to help out an old dwarf like me? Want to find out what's inside the rock?",
    "Have you spent the better part of a century mining in dark and damp caverns then?",
    "Then don't speak nonsense, you young rascal!",
    "Oh, but I am. I dearly wish to return home again, where it's nice and comfortable and an old dwarf like me has nothing to worry about.",
    "Because I want to become obscenely rich before I do! Leave a legacy of sorts. So how about it? Will you help me?",
    "That's not funny, human! Leave me alone now!",
    "Welcome aboard then!",
    "No, but that's where you come in!",
    "I want you to find out some more information on the rock.",
    "I don't know! Wish I knew! But we have to get some better understanding of what this thing actually is. Maybe then we can find a way to break it open.",
    "I'll guard my cannon and fire more cannonballs at it, of course! Wish I had your job, mine's a tough one!",
    "My legs are too old and worn to do much running around anymore, I'm afraid. Well, off you go now! Start running, start talking!",
    "Oh, why so difficult? Look, try the city, further down the stream here. There's bound to be someone there who knows something. If you still can't find anyone, go to the librarian, he knows a lot.",
    "I want you to find out some more information on the rock.",
    "I see, I see. But I don't know much about that rock, I'm afraid. It's baffled us for many generations. There's a dwarf in the mechanics shop, though, who I believe has some connections with a certain scholar.",
    "Go south to the palace, the shop there is called Wermund's Wrench Warehouse. He should be working there somewhere.",
    "What? What? Tell me!",
    "A what?",
    "Gold? Did you say gold?",
    "Gold! I knew it! I struck gold! I'm set for life!",
    "What's left of it anyway...",
    "Now, tell me, how do I break open the rock?",
    "Yes, yes, I heard you the first time.",
    "Well, we're not very much closer to a solution then, are we?",
    "Well, let's see... At one time, we had a hundred dwarves in here, all picking away at the rock. Didn't do a thing. Then there was the time when we set fire to this whole section of the cave. What a smell that made!",
    "Apart from coating the rock with soot? Not really, no. I was able to borrow a cannon from the Black Guard, my son was able to pull some strings you know. Of course, steel cannonballs didn't make a dent. But then ol' Donnie had a clever idea.",
    "I made this adamantite cannonball, you see! Cost me quite a pile of coins too!",
    "Well, yes, it did... when it bounced back onto the ground it did.",
    "Well, then I had an even more clever idea! I put an even bigger pile of coins together to get some rune cannonballs! Good idea, right?",
    "No, it wasn't. Didn't do anything! Nothing at all! Latest thing I've tried are these boots.",
    "They're made out of granite! I don't have enough money to make granite cannonballs though. But see!",
    "Did you see? Did you?",
    "That's because there wasn't anything to see! Even granite doesn't do anything to it!",
    "You got it!",
    "Don't be silly, I'm sure there must be some known material that will affect it.",
    "Go on then... leave an old dwarf to his work.",
    "And?",
    "Like what?",
    "Don't be ridiculous.",
    "Well in future please don't.",
    "Another cannon? How will that help? No, no, what we need is a different material of cannonballs. The heaviest, hardest-hitting, toughest you can find.",
    "I'm guarding the cannon. Won't do us much good if it were stolen, would it?",
    "Haha, you want me to make a golden cannonball?",
    "Hmm, I suppose you have a point there. Tell you what, if you make a golden cannonball and give it to me, I'll fire it at the rock.",
    "Yes, you already showed me that. But I'm not going to waste my own gold on it, make a cannonball and bring it to me.",
    "Tried that, didn't work.",
    "Perfect gold? That's much too valuable to be used to make cannonballs!",
    "That... that... that's an amazing looking cannonball! Are you sure you want me to fire it at the rock? It's going to make a nasty dent in it. In the cannonball that is.",
    "It breaks my heart to ruin such a fine piece of crafting, but it's your gold... Alright, let's load it up then.",
    "Nice idea, Player, but no one will buy a golden cannonball! It looks nice, but it's not much use as a projectile.",
    "Did... did... did you see that?",
    "I don't believe it! All this time, I've been spending all my gold on opening the rock... I could've just thrown it at it!",
    "No, it seemed more like it... gave way for a second... That's interesting...",
    "Why, I'll just shoot you through it so you can have a look, won't I?",
    "Very simple. I'll have to make a few modifications to my cannon so that it can fire a human, and you'll need a golden helmet of course.",
    "Then I'll fire you at the rock so you can do a little reconnaissance. Don't worry, you should land safely on the other side of the rock.",
    "Might want to pick up that cannonball again while you're at it!",
    "Don't be silly now. It's just a rock... just a rock with lots of gold in it!",
    "Yes, just to see what's inside... to see if all that gold is really embedded inside it.",
    "No, but then we'll never know until we've tried it, right?",
    "But we're so close to all that gold!",
    "Well, it's not so simple... like I said, I need to make some modifications to my cannon. They're not really designed to fire humans, you know.",
    "I don't really know how, actually. Never been much of an engineer. If I had the right schematics for it, I could probably work with that. But I don't.",
    "That's it, yes! Here, I have one part of the schematics, sent to me by some prankster dwarf, I don't even remember his name. You'll have to find the rest on your own.",
    "Oh, and you'll also need a golden helmet of course. Would hurt quite a bit otherwise.",
    "No, it has to be a helmet made out of solid gold. Gold plated helmets contain so little actual gold, it'd be a bit dangerous.",
    "Unless you want to die when I shoot you at the rock?",
    "Yes yes, well, get going now, why don't you? I'll guard the cannon while you're away.",
    "Schematics to modify my cannon, and a golden helmet for you to wear.",
    "Not a clue! I don't even know how many parts there are. Its probably best to ask any dwarven engineers that yuou might know. And it could be that someone in the mines or the city here knows where this part came from. Didn't you talk to someone in Keldagrim already? Just ask around!",
    "No complaining now, run along!",
    "Oh, be more careful! Here, have a copy, but don't lose it again!",
    "Schematics to modify my cannon, and a golden helmet for you to wear.",
    "Let me have a look at that! This doesn't make any sense, it's all jumbled up! Sort it out, will you, don't torment an old dwarf with nonsensical drawings!",
    "I still need those schematics to modify my cannon. It doesn't normally fire humans, you know.",
    "Not a clue! I don't even know how many parts there are. It's probably best to ask any dwarven engineers that you might know. And it could be that someone in the mines or the city here knows where this part came from. Didn't you talk to someone in Keldagrim already? Just ask around!",
    "No complaining now, run along!",
    "You'll need a golden helmet as well, if you want to survive the blast.",
    "Well, go ahead and wear your helmet! Won't do you much good while you're holding it in your hands!",
    "Wonderful! These schematics look simple enough... are you ready for your quick trip through the rock then?",
    "Ah, such enthusiasm! Okay, here we go, let me have a look at those schematics and we'll get started.",
    "Okay, here we go, let me have a look at those schematics and we'll get started.",
    "Right, sitting comfortably?",
    "Excellent, excellent, I'll get the cannon ready to fire then!",
    "Just think of all that gold!",
    "Don't worry, it'll all be over in a moment.",
    "So, tell me! What did you see inside! Is there any gold in there?",
    "Haha, wonderful!",
    "Ran into him? How do you mean?",
    "And the spirit you speak of? Was it guarding the gold?",
    "Well, if it is, that must mean you must kill it! Simple!",
    "So are you ready to have another go in the rock?",
    "Okay, here we go, hold on to your helmet!",
    "The whole cave was shaking! What happened in there?",
    "What, you actually killed him?",
    "Probably banished it to some hellish realm or other.",
    "He'll be back, but not for a few thousand years, I'm sure.",
    "But in the mean time, there's plenty of gold for me!",
    "Of course, of course! Whenever you want to back in there, let me know... just don't forget to bring your helmet!",
    "And here, have this upgraded adamant pickaxe as well.",
    "No no, thank you! After all these years, the riddle of the rock has finally been cracked!"
  ],
  "Librarian": [
    "Welcome to the Keldagrim library, human traveller!",
    "You're confusing me, what rock exactly are you talking about?",
    "You're confusing me, what rock exactly are you talking about?",
    "I see, I see.",
    "I heard there was a demon inside there that you banished.",
    "There are some demons that we cannot see properly as mortals. They also cannot be fought with normal weapons.",
    "But sometimes these creatures manifest themselves in a solid form in our world. Their avatar.",
    "When you defeat an avatar, you defeat the actual demon behind it. But they don't die, they are banished to where they came from originally.",
    "Doubtful. He will grow stronger and stronger over time, but that's a process that will take a thousand years at least.",
    "Even dwarves don't live so long.",
    "No, we won't see him again and the mines are safe to dig for gold now. Of course, that might lead to other problems eventually..."
  ],
  "Dwarven Engineer": [
    "Now what rock would that be, exactly?",
    "Ah, Don's rock, right?",
    "No, no one knows. No one here, anyway. The only one I can think of is Rolad, a renowned scholar. He was part of Dondakan's team once, many years ago.",
    "He left to explore the world. Learning by experience, or so he said. Me, I prefer a cold stout at home, but it takes all sorts. I think he's currently with the Black Guard at Ice Mountain.",
    "Why, what do you need them for?",
    "And you'd be the test subject? I mean, the cannonball?",
    "Haha, that I would like to see! Here, take this. Khorvak sent it to me from White Wolf Mountain, kind of as a joke. It's incomplete, of course, doesn't mean anything without other parts. Haha, he's always a laugh, that Khorvak. Shooting humans out of cannons!",
    "Yes, and I already gave a part to you, remember?"
  ],
  "Rolad": [
    "Why, yes, I think so... who's asking?",
    "You're awfully tall for a dwarf, you know, Player. And a rock you say? I suppose I know a fair bit about rocks, yes.",
    "Oh, old Dondakan, sure I know him. And I know his rock too. It's that unbreakable one, isn't it?",
    "Well, as a matter of fact, I picked up an interesting book on one of my travels, from a quite out of the way dwarven outpost. I'm not entirely sure, but it seems to describe this very rock, and how it came to be placed in that cavern. I tore out the most interesting pages for more detailed perusal. Let me get them for you.",
    "Oh dear...",
    "I seem to have misplaced the pages... a pity, I had wanted to study them some more. Oh well...",
    "Oh, well, if it's that important to you, perhaps you can go and look for the pages? There should be three of them.",
    "I probably lost them in the mines below. I don't have them up here in any case.",
    "No, no, I never go there, I'm not a member you know. But I sometimes go down the regular mines to study the conditions of the working dwarf.",
    "How are you getting on with finding those missing pages?",
    "Down in the mines below, that'd be my best bet. I don't know where though, they could be anywhere down there.",
    "How are you getting on with finding those missing pages?",
    "That's splendid, keep going and you'll find them all, I'm sure!",
    "How are you getting on with finding those missing pages?",
    "Marvelous! I'm sure it's only a matter of time before you find the final page!",
    "Missing pages...?",
    "Oh yes, quite right... let me see them, please, and I'll put the book back together for you.",
    "There you go... You will give it back when you've finished with it, won't you? I'd really like to study it in more detail some time.",
    "Splendid, now, there's a good dwarf!",
    "Splendid, now, there's a good dwarf!",
    "Oh yes, Have you read it yet?",
    "Why, naturally, that's no problem for someone with such a keen interest in expanding [his/her] knowledge!",
    "That's terrible! Have you even read it yet?",
    "Well, here, I happen to have a copy of it. Try not to lose it this time!",
    "I suppose I just forgot that I had one.",
    "Of cause, anything to help a fellow dwarf, especially such a big, strong one such as yourself!",
    "A human, you say? Are we using humans as cannon fodder now? Well, good for him, never did like humans anyway.",
    "Oh, I see, I see. No, I have no schematics to... what did you say? Modify the cannon to shoot humans? Such a preposterous idea. No, all I have are the base schematics of the cannon. I was on the multicannon project once, you know? You see, back when-",
    "Well, of cause, I have the schematics written down on a piece of paper somewhere. Let me just look for it.",
    "Oh dear, I seem to have lost the schematics.",
    "I hardly ever lose anything, I'll have you know! Now, you wouldn't be able to go and look for the schematics, would you?",
    "If you could, I'd appreciate it ever so much. It might turn into a bit of an embarrassment for me otherwise. Who knows, what if some human finds them, who knows what will happen then?",
    "Oh, let's see... well... maybe. I'm not altogether sure where I left them.",
    "Sorry, no... I do not even remember what I drew them on.",
    "Oh, of cause, why didn't I think of that!",
    "Don't tell me you lost that book!",
    "Lucky that I have another copy, isn't it? Please don't lose it again."
  ],
  "The following text is transcluded from Transcript": [
    "Dwarven lore."
  ],
  "Khorvak": [
    "Haha, yesh, I have jusht the shing! I've been working on thish deshign for quite a while now! Never got to test it, love to shee it shoot a real human!",
    "Oooh, shure, shure... I've only got one part left, though. I have all the other parts away.",
    "How should I know? I'm only a shimple dwarf.",
    "Of courshe! Just give me a drink and I'll gladly help you.",
    "Pffft, I only wanted a dwarven shtout from that table over there.",
    "Here, have the shtupid schematic, I've gone right off my drink now.",
    "Oooh, jusht a glash of dwarven shtout over there...",
    "That'sh wonderful! You're a good human, you are. Here, have thish schematic and have fun with it!",
    "That'sh wonderful! You're a good human, you are. Here, have thish schematic and have fun with it!",
    "Sho have you been shot out of a cannon yet?"
  ],
  "Arzinian Being of Bordanzan": [
    "You are in my domain now! Begone lest you wish to be destroyed!",
    "Stop what you're doing or taste my wrath!",
    "Do not touch what is not yours!",
    "You are bringing doom down on yourself!",
    "I would not do that again if I were you!",
    "You did not heed my messages to stay away! You have brought doom down on to yourself!",
    "There are many aspects to my being and there are many skills I possess.",
    "Your magical abilities are impressive, but my powers of archery will foil them!",
    "You are an able ranger, yet that is useless against my might!",
    "You, I can see, are a skilled warrior. Yet your might is no match for my magic!",
    "Behold, as my avatar descends to your level to extinguish the flame of your puny existence!",
    "And while your power is great, mortal, I will still resist you!"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Between_a_Rock...?oldid=36233803’"
  ]
}