{
  "Player": [
    "Hello there.",
    "With what?",
    "Maybe he just went on holiday or something? Must be pretty boring living in a lighthouse.",
    "But how can I help?",
    "Okay, I'll help!",
    "Where is your cousin?",
    "How can I fix the bridge?",
    "I'll see what I can do.",
    "Sorry, just passing through.",
    "Hello again.",
    "Hi, are you called Gunnjorn?",
    "Yeah, that's great. Anyway, I understand you have a cousin named Larrissa who gave you a key...?",
    "Well, something has happened at the lighthouse, and she has been locked out. I need you to give me her key.",
    "Hello again, Gunnjorn. I'm afraid I've lost that key you gave me.",
    "I've got your key for you!",
    "I've fixed the bridge for you!",
    "I've got your key for you!",
    "Okay, I will see what I can do.",
    "What am I supposed to be doing again?",
    "Do you have any idea how I could do that?",
    "I have managed to fix the light!",
    "I don't think I'll get that back if I put it in there.",
    "I guess you're Jossik then... What creatures are you talking about?",
    "Don't worry, I'm here now. Larrissa was worried about you and asked for my help. I'll go back upstairs and let her know that I've found you and that you're still alive, and then we can work out some way of getting you out of here, okay?",
    "Okay, now that the creature's dead we can get you out of here.",
    "I found Jossik! He's in a cavern underground...",
    "Um... well, there's a big monster down there with him stopping him leaving.",
    "Okay, okay, sheesh, keep your hair on...",
    "Okay, it's dead! Let's get out of here!",
    "I see you managed to escape from those monsters intact!",
    "I have it here. You said you might be able to tell me something about it?",
    "I think it says... [Saradomin/Zamorak/Guthix].",
    "Nope, it definitely says [Saradomin/Zamorak/Guthix].",
    "Don't worry about it, I was glad to help out."
  ],
  "Larrissa": [
    "Oh, thank Armadyl! I am in such a worry... please help me!",
    "Oh... it is terrible... horrible... My boyfriend lives here in this lighthouse, but I haven't seen him the last few days! I think something terrible has happened! Look, you can see for yourself that the light has gone out, and the front door is locked up tight! He would NEVER do that! With the light off this coastline is terribly dangerous to ships! And to lock the front door so that nobody can turn the light back on?",
    "That is terribly irresponsible! He is far too thoughtful for that! He would never leave it unattended! He would also never leave without telling me! Please, I know something terrible has happened to him... I can sense it! Please... please help me adventurer!",
    "Well, we have to do something to get the lighthouse working again! Also, as you may have noticed, the storm that knocked the bridge out has trapped me on this causeway! You seem to have got here okay somehow, so if you could go and visit my cousin and get the spare key I left him, as well as fix the bridge enough so that I can go and speak to my family in Rellekka and tell them whats[sic] happened, I will be eternally grateful!",
    "OH! THANK YOU SO MUCH! I know my darling would never have left with the lighthouse lights off and without even telling me where he's gone!",
    "My cousin was always interested in agility. He left our home in Rellekka many moons ago, so that he could pursue this interest. I don't exactly know where he has gone, but I am sure he went somewhere to practise his agility. If you see him, his name is Gunnjorn. Mention my name, he will recognise it.",
    "Well, I am not just some helpless girl! I have pretty good agility, so you will only need to use two planks to make a ledge that I can balance along. Just use a plank on each side of the bridge. You will need a hammer, and thirty steel nails for each plank you use as well. I believe there are some planks near here...",
    "Thank you so much!",
    "Oh... my poor darling Jossik... I just know something terrible has happened...",
    "Oh, please find my darling! I just know something horrible has happened!",
    "Thank you adventurer, but I need you to fix the bridge for me. The key to the lighthouse is of little comfort while I am trapped here on this causeway!",
    "Oh, thank you so much! Please find the key to the lighthouse for me though! I cannot bear to think that something bad may have happened to my darling Jossik...",
    "Oh, thank you so much! Quickly, we must go inside and find out what has happened to my beloved Jossik!",
    "Quickly, we must go inside and find out what has happened to my beloved Jossik!",
    "This is terrible... What could have happened here? Please, you must fix the light, we cannot let my darling Jossik take the blame for any shipwrecks!",
    "You MUST find a way to fix the lighthouse! The ships are in terrible danger as long as the light is not working properly!",
    "I'm sorry adventurer, I do not know anything about lighthouses. I'm sure there must be some kind of user's guide around here somewhere though. My darling Jossik knew nothing about Lighthouses when he first came here, so the council must have left him some kind of manual or something.",
    "Please adventurer, do not let curiosity get the better of you! We have to fix the lighthouse before any accidents happen!",
    "Excellent work, adventurer! Now you can devote all of your energies to finding out what has happened to my darling Jossik!",
    "That is wonderful news! But why does he not come up out of there?",
    "What?!?! You MUST save him! I beseech you, please! Do something!",
    "Oh! Thank you so much for all of your help in rescuing my darling Jossik! I do not know what would have happened to him had you not chanced along this path!"
  ],
  "Gunnjorn": [
    "Haha welcome to my obstacle course. Have fun, but remember this isn't a child's playground. People have died here.",
    "Why, indeed I am. I own this agility course, it can be very dangerous!",
    "Yes, she did! How do you know of this? She said she probably wouldn't need it, but gave it to me for safe keeping just in case.",
    "Sure. Here you go.",
    "No problem. Here you go."
  ],
  "Jossik": [
    "*cough* Please... please help me... I think my leg is broken, and those creatures will be back any minute now!",
    "I... I do not know. I have never seen their like before! I was searching for information about my uncle Silas, who vanished mysteriously from this lighthouse many months ago. I found the secret of that strange wall, and discovered that I could use it as a door, but when I came down here I was attacked by... Well, I do not know what they are, but they are very strong! They hurt me badly enough to trap me here, and I have been fearing for my life ever since!",
    "NO! No, you can't leave me now! Look! They're coming again! Do something!",
    "No... you do not understand... That was not the creature that attacked me... That was one of its babies...",
    "Yes, quickly, the mother might be dead, but its children are not! Follow me upstairs, I might be able to help you with that casket you found. Bring it to my library, it looks familiar somehow...",
    "It seems I was not as injured as I thought I was! I must thank you again for all of your help. Now, about that casket you found on that monster's corpse...",
    "I can indeed! Here, let me have a closer look. Yes! There is something written on it! It is very faint, however. Can you read it?",
    "Are you sure? I mean, are you REALLY sure? Maybe you better look again.",
    "I think you're right! Hand it here, and let's see what's inside."
  ],
  "Congratulations! You have completed": [
    "'Horror from the Deep' - Complete this Experienced quest."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Horror_from_the_Deep?oldid=35332360’"
  ]
}