{
  "Player": [
    "Now I am a knight of the round table, do you have any more quests for me?",
    "Tell me of this quest.",
    "I'd enjoy trying that.",
    "I have made progress, but I have not recovered the Grail yet.",
    "I'd like some advice on finding the Grail.",
    "Um... Hello. I am seeking the Grail.",
    "I seek the Grail of legend!",
    "Thanks. I'll try and find someone who does.",
    "That's right. Any hints?",
    "I seek the Grail in the name of Camelot!",
    "Galahad? Who is he?",
    "Why would he quit being a Knight?",
    "Any suggestions on finding the Grail?",
    "Really? Know where I can find him?",
    "Absolutely.",
    "I am questing for the Holy Grail.",
    "Why do you say that?",
    "We'll see about that.",
    "Hello. King Arthur has sent me on a quest for the Holy Grail. He thought you could offer some assistance.",
    "Any suggestions?",
    "Where can I find Sir Galahad?",
    "Hello. I am in search of the Holy Grail.",
    "I would, but I don't know where I am going!",
    "’The point of realm crossing?'",
    "I'm looking for Sir Galahad.",
    "Do you get lonely out here on your own?",
    "I'm on a quest to find the Holy Grail!",
    "What are you talking about?",
    "So how can I find it?",
    "Why did you leave?",
    "Why didn't you bring the Grail with you?",
    "I'd better get on with the quest.",
    "I seek an item from the realm of the Fisher King.",
    "I don't suppose I could borrow that? It could come in useful on my quest.",
    "I'd better get on with the quest.",
    "Ok, have at ye oh evil knight!",
    "Actually I think I'll run away!",
    "I now need to defeat a black knight titan. He seems invulnerable!",
    "How can I kill it?",
    "Thank you, I shall continue with my quest.",
    "What, again? Oh, alright, let’s fight.",
    "Actually I think I'll run away!",
    "How's the fishing?",
    "Any idea how to get into the castle?",
    "...I didn't see any bells.",
    "Yes, well, this place is a dump!",
    "How did you know what I have been doing?",
    "Do you mind if I have a look around?",
    "I seek the Holy Grail.",
    "Any ideas how I can restore the land?",
    "You don't look too well.",
    "Who is your son?",
    "I shall go and see if I can find him.",
    "I managed to defeat the black knight titan that was blocking my way, but I haven’t got the Grail yet.",
    "Thank you, I shall continue with my quest.",
    "Hello, do you have a knight named Sir Percival?",
    "Any idea which way that would be?",
    "How did you end up in a sack?",
    "Come with me, I shall make you a king.",
    "Your father is apparently someone called the Fisher King. He is dying and wishes you to be his heir.",
    "Your father wishes to speak to you.",
    "He is dying and wishes you to be his heir.",
    "Well, I do have the means to get us there – a magic whistle! I will just go and get you one.",
    "Well, I do have the means to get us there – a magic whistle!",
    "I have retrieved the Grail!",
    "Thanks!",
    "I returned the Holy Grail to Camelot!"
  ],
  "King Arthur": [
    "Aha! I'm glad you are here! I am sending out various knights on an important quest. I was wondering if you too would like to take up this quest?",
    "Well, we recently found out that the Holy Grail has passed into the Runescape world. This is most fortuitous! None of my knights ever did return with it last time. Now we have the opportunity to give it another go, maybe this time we will have more luck!",
    "Go speak to Merlin. He may be able to give a better clue as to where it is now you have freed him from that crystal. He has set up his workshop in the room next to the library.",
    "How goes thy quest?",
    "Well, the Grail IS very elusive, it may take some perseverance. As I said before, speak to Merlin in the workshop by the library.",
    "Ah yes. I remember young Percival. He rode off on a quest a couple of months ago. We are getting a bit worried, he's not back yet... he was going to try and recover the golden boots of Arkaneeses.",
    "Not exactly. We discovered some magic golden feathers that are said to point the way to the boots... They certainly point somewhere. Just blowing on them gently will supposedly show the way to go.",
    "How goes thy quest?",
    "Wow! Incredible! You truly are a splendid knight!",
    "Thank you for retrieving the Grail! You shall long be remembered as one of the greatest heroes amongst the Knights of the Round Table!"
  ],
  "Sir Palomedes": [
    "Hello there adventurer, what do you want of me?",
    "Sorry, I cannot help you with that."
  ],
  "Sir Tristram": [
    "Hail Arthur, King of the Britons!",
    "Good luck with that!"
  ],
  "Sir Lucan": [
    "Hello there adventurer.",
    "I'm afraid I don't have any suggestions."
  ],
  "Sir Kay": [
    "Good day sir/madam! I hear you are questing for the Holy Grail?",
    "Unfortunately not, Sirrah."
  ],
  "Sir Gawain": [
    "Good day to you sir/madam!",
    "The Grail? That is truly a noble quest indeed. None but Galahad have come close.",
    "He used to be one of the Knights of the Round Table, but he mysteriously disappeared many years ago.",
    "That is a good question. I'm afraid I don't have the answer."
  ],
  "Sir Pelleas": [
    "Greetings to the court of King Arthur!",
    "My best guess would be some sort of spell. Merlin is our magic expert. Ask him? Although having said that, I believe Galahad found its location once.",
    "I'm afraid not. He left here many moons ago and I know not where he went."
  ],
  "Sir Bedivere": [
    "May I help you? You are looking for the Grail now adventurer?",
    "The best of luck to you! Make the name of Camelot proud, and bring it back to us."
  ],
  "Sir Lancelot": [
    "Greetings! I am Sir Lancelot, the greatest Knight in the land! What do you want?",
    "The Grail? Ha! Frankly, little man, you're not in that league.",
    "You got lucky with freeing Merlin but there's no way a puny wannabe like you is going to find the Holy Grail where so many others have failed."
  ],
  "Merlin": [
    "Ah yes... the Holy Grail... That is a powerful artefact indeed. Returning it here would help Camelot a lot. Due to its nature the Holy Grail is likely to reside in a holy place.",
    "I believe there is a holy island somewhere not far away... I'm not entirely sure... I spent too long inside that crystal! Anyways, go and talk to someone over there. I suppose you could also try speaking to Sir Galahad? He returned from the quest many years after everyone else. He seems to know something about it, but he can only speak about those experiences cryptically.",
    "Galahad now lives a life of religious contemplation. He lives somewhere west of McGrubor's Wood I think.",
    "My magic powers tell me that you have discovered the Grail! Take it to Arthur immediately!",
    "Congratulations, brave knight, on aiding Camelot in so many ways! If we ever require help again, I will make sure to call upon you!"
  ],
  "High Priest": [
    "Many greetings. Welcome to our fair island.",
    "The object of which you speak did once pass through holy Entrana. I know not where it is now, however. Nor do I really care."
  ],
  "Crone": [
    "Wait!",
    "Did you say the Grail? You are a Grail knight, yes? Well you'd better hurry. A Fisher King is in pain.",
    "Go to where the six heads face, blow the whistle and away you go!",
    "The six stone heads have appeared just recently in the world. They all face the point of the realm crossing. Find where two of the heads face, and you should be able to pinpoint where it is.",
    "The realm of the Fisher King is not quite of this reality. It is of a reality very close to ours, though. Where it is easiest to cross. THAT is a point of realm crossing. Find where two of the heads face, and you should be able to pinpoint where it is.",
    "The Fisher King is the owner and slave of the Grail.",
    "You don't know about the whistles yet? The whistles are easy. You will need one to get to and from the Fisher King's realm. They reside in a haunted manor house in Misthalin, though you may not perceive them unless you carry something from the realm of the Fisher King...",
    "Good luck with that."
  ],
  "Galahad": [
    "Welcome to my home. It's rare for me to have guests! Would you like a cup of tea? I'll just put the kettle on.",
    "I AM Sir Galahad. Although I've retired as a Knight, and now live as a solitary monk. Also, I prefer to be known as Brother rather than Sir now.",
    "Sometimes I do, yes. Still not many people to share my solidarity with, as most of the religious men around here are worshippers of Saradomin.",
    "Ah... the Grail... yes... that did fill me with wonder! Oh, that I could have stayed forever! The spear, the food, the people...",
    "The Grail castle... It's... hard to describe with words. It mostly felt like a dream!",
    "I did not find it through looking – though admittedly I looked long and hard – eventually, it found me.",
    "Apparently the time is getting close when the world will need Arthur and his knights of the round table again. And that includes me. Leaving was tough for me, so I took a small cloth from the table as a keepsake.",
    "...I'm not sure. Because... it seemed to be... NEEDED in the Grail castle?",
    "If you do come across any particularly difficult obstacles on your quest, do not hesitate to ask my advice. I know more about the realm of the Grail than many, and I have a feeling you may need to come back and speak to me anyway...",
    "Funny you should mention that, but when I left there I took a small cloth from the table as a keepsake.",
    "Half a moment, your cup of tea is ready.",
    "If you do come across any particularly difficult obstacles on your quest, do not hesitate to ask my advice. I know more about the realm of the Grail than many, and I have a feeling you may need to come back and speak to me anyway...",
    "How is your quest? I'm sure you could do with a cup of tea while you're here!",
    "A black knight titan hmm? Haven't seen one of them about in a while...",
    "Well, I'm sure you've got Excalibur stored somewhere. Try wielding it when you fight the titan.",
    "Half a moment, your cup of tea is ready.",
    "How is your quest? I'm sure you could do with a cup of tea while you're here!",
    "You cannot claim the Holy Grail, it must claim you.",
    "Half a moment, your cup of tea is ready.",
    "Welcome back! Would you like a cup of tea? I'll just put the kettle on.",
    "I'm impressed! That's something I was never able to do. Half a moment, your cup of tea is ready."
  ],
  "Black Knight Titan": [
    "I am the Black Knight Titan! You must pass through me before you can continue in this realm!",
    "Puny mortal... You cannot defeat me... I... Am... INVINCIBLE!!!",
    "I am the Black Knight Titan! You must pass through me before you can continue in this realm!"
  ],
  "Peasant": [
    "Woe is me! Our crops are all failing... how shall I feed myself this winter?",
    "Oh happy day! Suddenly our crops are growing again! It'll be a bumper harvest this year!"
  ],
  "Fisherman": [
    "Hi! I don't get many visitors here!",
    "Not amazing. Not many fish can survive in this gungey stuff. I remember when this was a pleasant river teeming with every sort of fish...",
    "Why, that's easy! Just ring one of the bells outside.",
    "You must be blind then. There's ALWAYS bells there when I go to the castle.",
    "This place used to be very beautiful, however, as out king grows old and weak, the land seems to be dying too."
  ],
  "Grail Maiden": [
    "Welcome to the Grail castle. You should come inside, it's cold out here.",
    "Welcome to the Grail castle."
  ],
  "The Fisher King": [
    "Ah! You got inside at last! You spent all that time fumbling around outside. I thought you'd never make it here.",
    "Oh, I can see what is happening in my realm. I have sent clues to help you get here, such as the fisherman, and the crone.",
    "No, not at all. Please, be my guest.",
    "Ah excellent. A knight come to seek the Holy Grail. Maybe our land can be restored to its former glory. At the moment the Grail cannot be removed from the castle. Legend has it a questing knight will one day work out how to restore our land; then he will claim the Grail as his prize.",
    "None at all.",
    "Nope, I don't feel so good either. I fear my life is running short... Alas, my son and heir is not here. I am waiting for my son to return to this castle. If you could find my son, that would be a great weight off my shoulders.",
    "He is known as Percival. I believe he is a knight of the round table."
  ],
  "Sir Percival": [
    "Wow, thank you! I could hardly breathe in there!",
    "It's a little embarrassing really. After going on a long and challenging quest to retrieve the boots of Arkaneeses, defeating many powerful enemies on the way, I fell into a goblin trap! I've been kept as a slave here for the last 3 months! A day or so ago, they decided it was a fun game to put me in this sack; then they forgot about me! I'm now very hungry, and my bones feel very stiff.",
    "What are you talking about? The king of where?",
    "My father? You have spoken to him recently?",
    "I have been told that before. I have not been able to find that castle again though.",
    "Ok, I will see you there then!",
    "I said I will see you there then!"
  ],
  "King Percival": [
    "You missed all the excitement! I got here and agreed to take over duties as king here, then before my eyes the most miraculous changes occurred here... grass and trees were growing outside before our very eyes! Thank you very much for showing me the way home."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Holy_Grail?oldid=36025867’"
  ]
}