{
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "Dialogue with General Hining after getting the letter, misc dialogue optionsYou can discuss this issue on the talk page or edit this page to improve it."
  ],
  "Player": [
    "Hello there.",
    "So, can you keep your mind on the job now?",
    "The General wants to throw you out? Why?",
    "Isn't there some way to repair the catapult?",
    "I guess you're going to get fired, then.",
    "...",
    "It can't be much worse than standing around out here all the time.",
    "I guess you're going to get fired, then.",
    "Well, good luck in your future career.",
    "...",
    "What do you suggest?",
    "Alright, I'll go and speak to General Hining.",
    "Sorry, I don't really have time for this.",
    "It's a shame about the broken catapult, and you losing your job and all.",
    "Hello again.",
    "Not yet, no.",
    "What will you do if you lose your job?",
    "It can't be much worse than standing around out here all the time.",
    "I'll do what I can to help.",
    "See you later.",
    "Hello, General.",
    "Is one of your problems catapult-shaped?",
    "So, the Tyras Camp catapult is broken?",
    "I'm just wondering how I can help, there's no need to get annoyed.",
    "Perhaps I can help to repair it?",
    "What makes you say that?",
    "Well, good luck fixing the catapult.",
    "Sure. Well, good luck with that.",
    "General, I believe I can be of service to you.",
    "I can handle it. What should I do first?",
    "Okay, I'll go and find him.",
    "Alright, I'll take him the letter.",
    "Are you going to fire the catapult guard?",
    "I guess that's fair.",
    "Goodbye.",
    "Hello, I'm meant to take a letter to the catapult engineer, aren't I?",
    "Why did you send the catapult guard outside the camp?",
    "He isn't the sharpest scimitar in the smithy, is he?",
    "What exactly is the problem with the catapult engineer?",
    "Surely, catapults are the same wherever you build them?",
    "I'd better carry on trying to fix the catapult.",
    "Hello, are you the catapult engineer?",
    "I've brought you a letter which was delivered to the Tyras Camp.",
    "What are you doing out here?",
    "See you later.",
    "Why do you need replacement orders?",
    "...and?",
    "General Hining asked me to find you.",
    "I think he just wants a working catapult.",
    "I've heard that catapults are complicated. That's why General Hining asked me to help you out.",
    "How can you work without a toolbox?",
    "I'm quite an experienced carpenter.",
    "Still, you've had some bad luck, it would be a shame if you were judged on that.",
    "Great! Thank you.",
    "Don't worry, he won't hear about this from me.",
    "Never mind, it sounds too difficult.",
    "Can I read the letter?",
    "Can I read the letter?",
    "Where can I find Rolad the dwarf?",
    "That's quite some distance to travel.",
    "I see.",
    "I'm looking for some metal catapult parts that were meant to be sent to the Tyras Camp.",
    "I see. So, are you an engineer?",
    "Catapults do seem pretty complicated.",
    "Can I have the metal parts for the Tyras Camp catapult, please?",
    "But the pieces haven't arrived.",
    "In that case, I'll go and have a look for him at Port Sarim.",
    "Where did you say he would be?",
    "In that case, I'll go and have a look for him.",
    "Hi there, are you a delivery dwarf?",
    "I'm looking for some metal parts to be delivered to the Tyras Camp.",
    "That's wonderful. Can I have the parts, please?",
    "I am a sailor, honest.",
    "I don't think I'm getting through to this guy.",
    "You're right, I'm not a sailor.",
    "I don't think I'm getting through to this guy.",
    "Hi there, are you a delivery dwarf?",
    "I'm looking for some metal parts to be delivered to the Tyras Camp.",
    "(I'd better convince the dwarf that I'm a sailor if I want to get those catapult parts...) Yarr! I be seaman Player, an' I come for the special delivery.",
    "Uh... yes, sorry about that, it took a while to find you.",
    "Oh...I mean, Yarr! I hads to weigh anchor...And splice the mainbrace... and...uh...shiver the timbers?",
    "Great! I mean, Yarr!",
    "Oh, yes, silly me. I'll come back later.",
    "Don't worry, I'll have these catapult parts delivered in no time at all.",
    "Hello again.",
    "Yes, I've collected everything I need to repair it.",
    "Yes, I'll have another go.",
    "Not right now, I'm a bit busy.",
    "Useless? Give me a break, I just fixed it!",
    "Shouldn't the catapult engineer be doing that?",
    "Okay, so, if we test the catapult the General will be happy again?",
    "Yes, I'll have a go.",
    "Not right now, I'm a bit busy.",
    "No problem.",
    "Hello.",
    "What do you mean?"
  ],
  "Tyras guard (catapult)": [
    "Oh, 'ello again. Thanks for that roast rabbit, filled me up a treat, that did.",
    "Well, that's just it, mate. I don't think I'll have a job for much longer if General Hining has his way.",
    "He asked me to treat the catapult wood. Stops it going rotten, see? Only trouble is, I forgot, and now the catapult frame is damp and rotted away. Yup, I'm in for it this time, the General's already cut me pay in half.",
    "I dunno, it looks a bit complicated to me. General Hining has had a catapult engineer sent to us, but, between you and me, it doesn't look like he knows what he's doing.",
    "I reckon.",
    "...",
    "I dunno, lassie, being a guard is all I know. I ain't got no trade, no home, no money. I can't make armour, or chop wood, or fish... Perhaps I can be a tin miner, I tried that once before. It's hard work, though, and the pay is lousy.",
    "I've gotten used to this way of life, see? Standing around doing nothing for hours just seems to suit me.",
    "...",
    "Look, are ya sure there's nothing ya can do to help?",
    "If ya can repair the catapult, that'd get the General off my back. The way I figure it, I can't fix the catapult, I ain't got the skills. The engineer can't fix it, he ain't got the brains. So that only leaves you. If ya speak to General Hining, I'm sure he'd let ya work on the catapult.",
    "Cheers, mate! He's inside the camp, towards the back.",
    "Oh. Well, it was nice knowing you, mate. Come back if ya have a change of heart.",
    "Are ya ready to fix the catapult yet?",
    "General Hining should have a plan to fix it. Please hurry, I feel a bit silly guarding a load of rotten wood.",
    "I dunno, mate, being a guard is all I know. I ain't got no trade, no home, no money. I can't make armour, or chop wood, or fish... Perhaps I can be a tin miner, I tried that once before. It's hard work, though, and the pay is lousy.",
    "I've gotten used to this way of life, see? Standing around doing nothing for hours just seems to suit me.",
    "Thanks, mate, yer a star, that's for sure!",
    "Are ya ready to fix the catapult yet?",
    "Great! Now, there's two sides for ya to repair, remember that, so yer gonna need to use all of the parts ya have. Well, go ahead...",
    "Please hurry, I feel a bit silly guarding a load of rotten wood.",
    "Wow, you've made a good job of the catapult. It looks good as new! Better than new, actually. It's pretty useless, of course, but it looks nice.",
    "Take it easy, mate! I mean, we need to check the aim is on target. When yer launching boulders through the air, ya want to be sure where they're gonna land.",
    "That'd be difficult, General Hining sent him away. The General says there's enough idiots out in the forest without one more wandering round. I'm not sure what he meant by that, though.",
    "Yeah, you aim the catapult and fire it, and I'll load and wind it. Are ya ready to test the catapult?",
    "Cheers, this will stop the General complaining. Okay, yer aiming for the three boulders, the ones with a large red cross on. Ya can aim the catapult left and right, and use the counterweight to change how far the shot goes. Remember, yer trying to destroy the three boulders.",
    "Let me know as soon as yer ready, then I can get the General off my back.",
    "Are ya ready to test the catapult yet?",
    "That's right on target, mate. Come and have a word when yer not busy.",
    "Wow, ya done a splendid job, there. The General will be happy when he hears the catapult is working again. Ya done me a real favour.",
    "I don't have much to give as a reward, but here's some stuff I found around the camp.",
    "Oh, ya don't have enough space in your inventory. Come and see me when ya have 2 more free spaces.",
    "Thanks for yer help with the catapult. Ya got me out of some hot water there, I can tell you!"
  ],
  "General Hining": [
    "I'm too busy to talk now. Vile forces are afoot and I have many problems to resolve before the coming darkness.",
    "That blabbermouth guard! Even left outside the camp he causes botheration.",
    "It is, but I don't see how that is any concern of yours.",
    "My apologies...that catapult is an essential part of our defences. Our future was uncertain even when it was working, but now, without the catapult, we are certainly doomed.",
    "I doubt it: catapults can only be worked on by an experienced carpenter. You would need good Construction and Fletching skills to make the repair parts, as they must be strong as well as accurate. I've drafted in a catapult engineer to come and take a look, but he seems rather lacking in the brains department.",
    "He arrived without tools or materials. Even now, he's fumbling his way around the forest looking for suitable timber. I doubt he'll find any wood strong enough in this region, though.",
    "It will take much more than luck to fend off the depraved foes that are to come.",
    "Well, if you think you are up to the task, you may assist in repairing the Tyras Camp catapult.",
    "Start by finding that idiotic catapult engineer. He'll have the schematics and information needed to make repair parts for the catapult.",
    "Not so fast! A letter has arrived for the engineer. My guess is it's from his commanding officer, I can only assume it's a dressing-down. A good tongue-lashing will hopefully have some impact on that scatterbrain.",
    "You don't have room for the letter now, come and get it from me again when you're ready.",
    "And be sure to move with urgency, our ballistic weapon is essential to our line of defence.",
    "We have few enough resources as it is, I won't waste my rations on men who cannot be relied upon. One more mistake and that guard is out on his ear.",
    "Fair has nothing to do with it! We're talking about survival. The battlefield is no place for sympathy. As seasoned soldiers say, 'Do or die'.",
    "Yes, you'll find him somewhere in the forest.",
    "Here's the letter you need to deliver.",
    "Catapult guard? Pah! He's not fit to guard a dog's dinner. Such a clumsy, lazy man!",
    "He's downright dangerous to the other men. I sent him out to guard the catapult just to keep him out of trouble. I should just have sent him on his way.",
    "The man is well-meaning, but incompetent. I'm sure he passed his engineer's training with flying colours but there are some things you can only learn by being out in the field.",
    "Yes, but the resources available are different everywhere you go. Our young engineer hasn't grasped that. No doubt that's why he arrived so ill-equipped.",
    "Ah, adventurer, good job repairing the catapult.  You've done the Tyras Camp a great service. You'll probably find you're more skilled at using them as a result, eh? However... This is not a good place to be, go and prepare for the coming darkness.",
    "There is no great hero left to fight back the forces that face us now... Go, leave, prepare for the darkness. While you still have time!"
  ],
  "Catapult engineer": [
    "Oh, yes, I am.",
    "Thank you, it's probably from the chief catapult engineer. Hopefully it contains my replacement orders. I'll read it in a moment.",
    "I need to find good, strong timber to repair the Tyras Camp catapult. It's proving difficult, though - this forest doesn't have a very good selection of wood. It's really most inconvenient.",
    "Bye, mate.",
    "Oh...well...it's a little embarrassing... I left the orders in my pocket...",
    "I forgot they were there and washed my clothes. I wrote to the chief engineer to ask for another set of orders.",
    "Oh dear, I imagine the General isn't very happy with me.",
    "It all looked so straight-forward during training, but this job is harder than it seems. I've had some rotten luck, too. I managed to leave my toolbox on the ship that brought me to the Tyras Camp.",
    "Oh dear, I don't think that would work. It takes lots of training before you are skilled enough to work on a catapult.",
    "I'm not sure. The tools are basic, and usually easy to get hold of: a saw, a hammer and a knife. But, out here, I'm not sure where I can get replacements. I went back to the ship to get my tools, but it had already set sail.",
    "I don't know...I should really be able to repair it on my own.",
    "I suppose it would. And two heads are better than one. Alright, you've convinced me.",
    "Oh...and...you won't tell the chief engineer, will you? I'll be in deep trouble if he finds out I had help.",
    "Here's a copy of the catapult schematics. I hope you have better luck than me.",
    "I read the letter you delivered: it's a telling-off from the chief engineer.",
    "Sorry, no. Some of the information enclosed is secret: only catapult engineers are allowed to know.",
    "I read the letter you delivered: it's a telling-off from the chief engineer.",
    "It isn't very flattering about me, but you can read it if you think it will help.",
    "If I remember my training correctly, Rolad's workshop is on Ice Mountain.",
    "Yes, but well worth it. The dwarves make the finest metal parts, you know.",
    "You need another copy of the schematics, yes? Here's a copy of the catapult schematics. I hope you have better luck than me."
  ],
  "Rolad": [
    "Oh, hello...can I help you?",
    "Ah, yes, I remember that order; oversaw the production myself.",
    "Why, no, I'm a scholar. catapults are quite advanced devices, so I often get orders for siege weapons. stronger parts because I dedicate time to researching new designs.",
    "I imagine they do, but compared to, say, a cannon, catapults are quite simple, really.",
    "They've already been dispatched I'm afraid. a delivery dwarf, down to Port Sarim with them to put them on a ship heading to the Tyras dock.",
    "Thaki hasn't returned yet, perhaps something is holding him up.",
    "Oh, hello... did you find Thaki the delivery dwarf?",
    "He was sent to Port Sarim to put the metal catapult parts on a ship."
  ],
  "Thaki the delivery dwarf": [
    "Wassat? Yer, that's me alright, Thaki the delivery dwarf. What yer want?",
    "Ah, yer, the special delivery, I gots to keep it safe, Rolad said. Make sure yer puts it on a ship, he said.",
    "You ain't no sailor! Comin' in here trying to trick me!",
    "Tha's a laugh, you ain't even got the right hat on!",
    "'S what I thought, yer can't fool me!",
    "Wassat? Yer, that's me alright, Thaki the delivery dwarf. What yer want?",
    "Ah, yer, the special delivery, I gots to keep it safe, Rolad said. Make sure yer puts it on a ship, he said.",
    "Took yer time, didn't yer?",
    "Eh...? That don't sound like sailor talk to me.",
    "Well, yer has a sailor hat, and that's good enough for me.",
    "Ha ha! You haven't even got any space to carry the parts, come back when you have a free inventory slot.",
    "Here's the special delivery, take good care of it, Rolad says."
  ],
  "Tyras Guard": [
    "You ready to have another go at fixing the catapult, mate?"
  ],
  "Congratulations! You have completed": [
    "'Catapult Construction' - Complete this quest."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Catapult_Construction?oldid=36196466’"
  ]
}