{
  "Gossip": [
    "Oh, I remember you. You're the one that discovered Lord Sinclair's murderer. Well, I can tell you, strange things are afoot once again.",
    "Well, you didn't hear it from me, but I've heard the Sinclair family have vamoosed! Just up and left the mansion.",
    "Of course not! Anna's safely locked in the Seers' Village jail. She'll be going to trial soon, so I've heard.",
    "Yes, the guards received evidence from one of the family members that conclusively proved Anna did it. All other evidence was thrown out, it was that good. So they arrested her and soon the case will go to court.",
    "Well, it wouldn't be suspicious at all, but King Arthur has also disappeared. No one has seen him or the knights in quite a while. Quite a coincidence, don't you think?",
    "You didn't hear it from me, but I believe that guard in the garden is also investigating it. He might be able to tell you more.",
    "Ah, too bad. I'll have to get news from my other sources.",
    "Their history? Oh what a lurid tale that is! Why, I could go on for hours.",
    "Hmph, well, I suppose. What do you want to know?",
    "I've heard plenty about each of them... but I'll try to keep it as short as I can.",
    "Old Lord Sinclair was a well respected man this side of White Wolf. He was great friends with King Ulthas and did many good works for the kingdom. His children on the other hand were spoiled and horrid. They cared for no one but themselves and gave themselves such aires. Each had their own vice, but I didn't expect any of them would be driven to murder!",
    "They've been living very quietly, a nice change from the norm. But almost too quietly. I always thought they'd get into more trouble. No good will come from them, let me tell you!",
    "The mansion? The mansion is quite new. Originally, the Sinclair family lived in Camelot, although it went under a different name then. But when King Arthur and his knights appeared, old Lord Sinclair agreed with King Ulthas that the knights had greater need for the castle than the Sinclair family. So, Lord Sinclair had the mansion built, packed his family up and vacated. His children were furious with him for doing it. They felt themselves far better than the knights and felt insulted at having to live in a stuffy mansion.",
    "Well, you should know best... Anna killed her father. Poor man.",
    "Anna? The guards are keeping her in the jail in the courthouse in Seers' Village. I heard she's been acting like a royal pain.",
    "Reasoned with? She killed her own father! I hear she's being so unreasonable that no lawyer in RuneScape will represent her. She's going to get a guilty verdict for sure. Still, I go and visit her at the Seers' Village courthouse sometimes to try and keep her spirits up.",
    "At the Seers' Village courthouse.",
    "I hear you're the defence lawyer for Anna, now.",
    "I'm the town gossip, I'm supposed to know this stuff. Are you preparing for the trial?",
    "Well, my father was in the guards and he attended many trails. As a defence lawyer you need to disprove any evidence presented by the prosecution. Disproving it gives reasonable doubt as to whether or not your client actually committed the crime.",
    "Some of it will be the evidence you found: the dagger, the poison and the thread. There was also an eyewitness saying they saw Anna tamper with Lord Sinclair's dinner. Start asking questions about those things and see where you get."
  ],
  "Player": [
    "Really? What's happened?",
    "You mean they let the murderer get away?",
    "Anna? Is that who they arrested? I thought...hmm, never mind.",
    "So, why is it a big deal that the Sinclairs have left, then? Maybe they wanted to get away from the memory of their father's death.",
    "How curious. Maybe I should investigate it.",
    "Very odd coincidence, but I don't really have time to look into that now.",
    "So I have heard. The town gossip informed me that something was amiss. I've come to offer my assistance.",
    "How so?",
    "They haven't returned to their other realm have they?",
    "How goes the investigation, then? What evidence have you gathered so far?",
    "Which is why you're happy to see me, right? A rough party could break into the mansion and investigate further, without the fear of losing their job. Am I right?",
    "I have proof that the Sinclairs have left.",
    "Don't you see? The Sinclairs have left for good. They premeditated their departure from the mansion.",
    "I have proof that links the Sinclairs to Camelot.",
    "No... It's not a camel, like the animal. The note isn't whole, they were writing the word Camelot. They were meeting at Camelot, this is our evidence to connect the Sinclairs to King Arthur.",
    "I have proof of foul play.",
    "Exactly. And we know Morgan Le Faye has a history of harassing Merlin and King Arthur. Since there is no sign of a struggle inside the Sinclair Mansion, we can only assume the knights were there by request.",
    "When do you expect to go to Camelot? Perhaps I can assist you?",
    "WHAT? A month or more? King Arthur could be in grave danger. Morgan Le Faye is involved and she is not one to be trifled with. One of the Sinclairs has already committed murder, who's to say another won't? And you're going to wait a MONTH?",
    "Aye, what then?",
    "That's all the advice you can give?",
    "Well, often the best historians are the town gossips, I'd start there. Good luck, brave adventurer!",
    "Hello again. Can you tell me about the Sinclair family history?",
    "Well, I don't really have hours. Can you condense it?",
    "Tell me about the family.",
    "What have they been up to since the arrest of their sibling?",
    "Tell me about the mansion.",
    "What happened next?",
    "Tell me about Anna Sinclair.",
    "But what is she like? Can she be reasoned with?",
    "Tell me where Anna Sinclair is being held?",
    "Hello. Do you remember me?",
    "So he's 'daddy' now is he? If he was so dear to you why did you kill him?",
    "But there's hard evidence against you.",
    "I didn't come here to just chit-chat. I need to know where your family has disappeared to. I have suspicions they've reclaimed Camelot.",
    "Well, I'll be off then. Have fun spending the rest of your life in jail.",
    "Name your price.",
    "Maybe it's because you ARE guilty. your sibling offered hard proof you did it!",
    "Why should I believe you? As far as I know you did kill your father.",
    "So, if I agree to get you a 'not guilty' verdict at trial, you promise me to tell me how to get into this secret passage that will lead me straight into Camelot?",
    "Okay, I guess I don't have much of a choice. I'll go start gathering evidence.",
    "Of what, your guilt?",
    "No, thank you.",
    "How can you possibly know that already?",
    "Well, I'm going to talk to the servants and see if I can learn anything new from them... but other than that, I don't really know what I'm doing.",
    "But how do I know what evidence will be presented?",
    "I'm representing Anna Sinclair as a defence lawyer.",
    "Err, I'm not joking. I have to prove she is innocent.",
    "One of her siblings claims to have seen that, but who can say if they're saying the truth? Beside, it's for King Arthur. Anna is the only lead I have on how to find the King and his knights.",
    "I'm representing Anna Sinclair as her defence lawyer. I need to ask you some questions about what happened the night of Lord Sinclair's murder.",
    "Err, well, circumstances have changed. Anyway, I need to ask you some questions.",
    "What can you tell me about the night of the murder?",
    "Where did you last see Anna Sinclair on that fateful night?",
    "Did you ever see Anna in possession of the dagger that was found embedded in Lord Sinclair's body?",
    "No one else ever touched it?",
    "That's wonderful? Why didn't you mention it before? It means it could have been planted to make it seem like Anna did it.",
    "Can you tell me which Sinclair family member this thread belongs to?",
    "So, you can't identify the owner of the thread for certain?",
    "What can you tell me about the poison?",
    "Do you remember who bought poison?",
    "I'm representing Anna Sinclair as her defence lawyer. I need to ask you some questions about what happened the night of Lord Sinclair's murder.",
    "I'm sorry to trouble you, but I really need some answers.",
    "What can you tell me about the night of the murder?",
    "So, you didn't see Mary deliver the food to Lord Sinclair?",
    "Then someone could have tampered with the meal while she was on the way?",
    "Hmm, right. That doesn't bode well.",
    "Where did you last see Anna Sinclair on that fateful night?",
    "What did she do then?",
    "Well, that's not very conclusive.",
    "Did you ever see Anna in possession of the dagger that was found embedded in Lord Sinclair's body?",
    "Did you see someone else in possession of it?",
    "Can you tell me which Sinclair family member this thread belongs to?",
    "So, you can't identify the owner of the thread, for certain?",
    "What can you tell me about the poison?",
    "Who else bought poison?",
    "I'm representing Anna Sinclair as her defence lawyer. I need to ask you some questions about what happened the night of Lord Sinclair's murder.",
    "I'm sorry to put you through it again, but I really need to get some answers.",
    "What can you tell me about the night of the murder?",
    "There, there. I don't need you to tell me any more of that. What about on the way to the study, did you see Anna?",
    "Really? So, you can't place Anna at the murder scene, but there was a man there? David, Bob or Frank?",
    "That's great news!",
    "Where did you last see Anna Sinclair on that fateful night?",
    "What was she doing?",
    "So she wasn't acting suspicious?",
    "Did you see her anywhere near the scene of the murder?",
    "Very interesting. That's very helpful.",
    "Did you ever see Anna in possession of the dagger that was found embedded in Lord Sinclair's body?",
    "Are you sure?",
    "Can you tell me which Sinclair family member this thread belongs to?",
    "So you can't identify the owner for certain?",
    "What can you tell me about the poison?",
    "Do you know who did?",
    "I'm representing Anna Sinclair as her defence lawyer. I need to ask you some questions about what happened the night of Lord Sinclair's murder.",
    "Well, I have my doubts.",
    "What can you tell me about the night of the murder?",
    "So you didn't see or hear anything unusual?",
    "Where did you last see Anna Sinclair on that fateful night?",
    "Are you certain?",
    "Did you ever see Anna in possession of the dagger that was found embedded in Lord Sinclair's body?",
    "Really? That's not good. Not good at all.",
    "Can you tell me which Sinclair family member this thread belongs to?",
    "So you can't identify the owner for certain?",
    "What can you tell me about the poison?",
    "You're certain you don't remember anything?",
    "I'm representing Anna Sinclair as her defence lawyer. I need to ask you some questions about what happened the night of Lord Sinclair's murder.",
    "Uh, anyways, I need to ask you some questions.",
    "Tell me about the night of murder.",
    "Where did you last see Anna Sinclair on that fateful night?",
    "Did you ever see Anna in possession of the dagger that was found embedded in Lord Sinclair's body?",
    "So, any of the family or servants would have had access to it.",
    "Can you tell me which Sinclair family member this thread belongs to?",
    "So, you can't identify the owner of the thread for certain?",
    "What can you tell me about the poison?",
    "Can you tell me exactly who bought poison from him?",
    "So, you're completely certain all of the Sinclair children bought poison? And it would only have needed a small portion to kill Lord Sinclair.",
    "That means someone could have used the small amount to frame Anna and still have done their chores. That's great news.",
    "I'm representing Anna Sinclair as her defence lawyer. I need to ask you some questions about what happened the night of Lord Sinclair's murder.",
    "I know, I know, but circumstances... well, I just need to ask you some questions, alright?",
    "What can you tell me about the night of the murder?",
    "Where did you last see Anna Sinclair on that fateful night?",
    "Didn't you hear the glass breaking when the window was smashed by the murderer?",
    "Was the dog barking that night?",
    "Did you ever see Anna in possession of the dagger that was found embedded in Lord Sinclair's body?",
    "Did you notice anyone else handle the dagger?",
    "Can you tell me which Sinclair family member this thread belongs to?",
    "So, you can't identify the owner of the thread for certain?",
    "What can you tell me about the poison?",
    "Did you buy any?",
    "Did Anna Sinclair buy any poison?",
    "Oh dear, that's not good.",
    "The defence is ready, Your Honour.",
    "The defence calls the Sinclair's handyman.",
    "What's your name and occupation?",
    "Did you ever see Anna in possession of the dagger that was found embedded in Lord Sinclair's body?",
    "Could you tell us who this thread belongs to?",
    "So, you can't say for certain who this thread belongs to.",
    "Then this thread could have come from either of Anna or David's clothes, and they had many of this colour. A fact that would be known to anyone of the household.",
    "Then the thread could have been planted by someone else to throw suspicion on my client. I think we can all see this thread is very questionable evidence.",
    "What can you tell me about the poison?",
    "You're certain you don't remember anything?",
    "Where did you last see Anna on the night of the murder?",
    "Are you certain?",
    "The defence calls the Sinclair's dog handler.",
    "What's your name and occupation?",
    "Did you ever see Anna in possession of the dagger that was found embedded in Lord Sinclair's body?",
    "So, any of the family or servants would have had access to it.",
    "Could you tell us who this thread belongs to?",
    "So you can't say for certain who this thread belongs to.",
    "Not only can you not identify exactly who this thread came from, but you also state with certainty that Anna and David always wore this colour. Anyone else in the household would have known that as well.",
    "Then the thread could have been planted by someone else to throw suspicion on my client. I think we can all see this thread is very questionable evidence.",
    "What can you tell me about the poison?",
    "Can you tell me exactly who bought poison from him?",
    "So, only a small amount of poison would be enough to kill a man, I suppose?",
    "Therefore, any one of the Sinclairs who bought poison could have done their chore and poisoned Lord Sinclair as well. Just because my client was too lazy to do her chore doesn't mean she poisoned Lord Sinclair.",
    "Where did you last see Anna on that fateful night?",
    "The defence calls the Sinclair's butler.",
    "What's your name and occupation?",
    "Did you ever see Anna in possession of the dagger that was found embedded in Lord Sinclair's body?",
    "No one else ever touched it?",
    "You say you saw someone other than Anna handle the dagger?",
    "Not only has a person other than my client been identified handling the weapon, but the dagger was within easy access to anyone in the household. My client's fingerprints could have been planted on it by another party.",
    "Could you tell us who this thread belongs to?",
    "So, you can't say for certain who this thread belongs to.",
    "Not only can you not identify exactly who this thread came from, but you also state with certainty that Anna and David always wore this colour. Anyone else in the household would have known that as well.",
    "Then the thread could have been planted by someone else to throw suspicion on my client. I think we can all see this thread is very questionable evidence.",
    "What can you tell me about the poison?",
    "Even the servants?",
    "Where did you last see Anna on that fateful night?",
    "The defence calls the Sinclair's cook.",
    "What's your name and occupation?",
    "Did you ever see Anna in possession of the dagger that was found embedded in Lord Sinclair's body?",
    "Did you see anyone else in possession of it?",
    "Could you tell us who this thread belongs to?",
    "So, you can't say for certain who this thread belongs to.",
    "In other words, you are stating that there are two people this thread could have belonged to. Anyone else in the household would have known that as well.",
    "Then the thread could have been planted by someone else to throw suspicion on my client. I think we can all see this thread is very questionable evidence.",
    "What can you tell me about the poison?",
    "Who else bought poison?",
    "Do you know what was done with all the poison?",
    "Could you tell me about the night of the murder?",
    "So, you didn't see Mary deliver the food to Lord Sinclair?",
    "Then someone could have tampered with the meal while she was on the way? Some unknown party?",
    "Err, that will be all. Thank you.",
    "The defence calls the Sinclair's maid.",
    "What's your name and occupation?",
    "Did you ever see Anna in possession of the dagger that was found embedded in Lord Sinclair's body?",
    "You are completely certain of that?",
    "Could you tell us who this thread belongs to?",
    "So, you can't say for certain who this thread belongs to.",
    "Not only can you not identify exactly who this thread came from but you also state that almost all their clothes were this colour. Anyone else in the household would have known that as well.",
    "Then the thread could have been planted by someone else to throw suspicion on my client. I think we can all see this thread is very questionable evidence.",
    "Can you tell the court anything about the poison used to kill Lord Sinclair?",
    "Do you know who did?",
    "Where did you last see Anna on that fateful night?",
    "What about on the way to the study? Did you see Anna?",
    "Really? So, you can't place Anna at the murder scene but there was a man there? David, Bob or Frank?",
    "Indeed. Well, if my client can't be placed at the murder scene, and there is evidence that a man was there, I think it casts a great deal of doubt on the case.",
    "The defence calls the Sinclair's gardener.",
    "What's your name and occupation?",
    "Tell me about the dagger.",
    "Did you ever see Anna in possession of the dagger that was found embedded in Lord Sinclair's body?",
    "Did you see anyone else handle the dagger?",
    "Could you tell us who this thread belongs to?",
    "So, you can't say for certain who this thread belongs to.",
    "Not only are you not sure who this thread belongs to, but you re certain it was their favourite color. Anyone else in the household would have known this as well?",
    "Then the thread could have been planted by someone else to throw suspicion on my client. I think we can all see this thread is very questionable evidence.",
    "What can you tell me about the poison?",
    "Did you buy any?",
    "Did Anna buy any poison?",
    "Right, you needn't go any further.",
    "Where did you last see Anna on the night of the murder?",
    "So, you didn't see any of the Sinclair family outside?",
    "Yes, but what about our deal?",
    "You need to hold up your end of the bargain. Tell me how to get into Camelot or I go back to the judge and tell him I have doubts about your innocence.",
    "What are you going to be doing? Aren't you coming with me?",
    "Riiight.",
    "You! You planned this from the start! Where is King Arthur and his knights? I demand answers!",
    "Why I oughta...",
    "I knew it. I knew Morgan Le Faye had to be involved. Where is King Arthur and his knights? What have you done with them?",
    "I'll foil your plans Morgan, just like I always do. I won't let you win. Good alwa-",
    "Err, no. It was all part of my brilliant plan. I allowed her to capture me so I could find out where she was keeping all of you.",
    "Hey, why do I have to do all the thinking here? You're the brilliant wizard.",
    "Where is King Arthur now? He's not in the jail cell with us.",
    "What is the connection between Morgan Le Faye and the Sinclairs?",
    "So what's the plan of escape? Are you going to teleport us all away? Turn us into fish and swim to sea?",
    "Well, I'm sure if we put our heads together we will think of something. Let's talk about a plan of escape.",
    "How will we go about reclaiming Camelot?",
    "How do you plan to do that? You couldn't even defend it from them.",
    "So to reclaim Camelot, I need to break you out of jail quietly.",
    "How do I retrieve the Holy Grail? Do you know where it is?",
    "The last time I was in Keep Le Faye, it was pretty well guarded. I don't think I'll be able to sneak in quietly.",
    "So, I need to break eight knights out of jail? That could be troublesome.",
    "But it’s locked.",
    "Assuming I can escape from this jail, how can I save King Arthur?",
    "And how do I go about doing that?",
    "WHAT?",
    "Any thoughts on how we could break out of this cell?",
    "Any thoughts on how we could get out of this cell?",
    "Thank you, I will let you know.",
    "Any ideas…",
    "If we break out of this cell, do you reckon you can take on the Black Knights in the keep?",
    "Have you had any brilliant ideas on how to get out of here?",
    "Any thoughts on how we could escape?",
    "Any ideas on how to get out of this cell?",
    "We don’t have a ladder… but we do have a lot of knights.",
    "Hey guys! I’ve got an idea…",
    "I’m not sure yet. Have you got any useful objects in your pockets?",
    "Pie? How very useful to our cause.",
    "I’m working on it. Have you got any useful objects in your pockets?",
    "I’m not sure yet. Have you got any useful objects in your pockets?",
    "Gee, thanks. You’ve contributed so much to my plan.",
    "I’m not sure yet. Have you got any useful objects in your pockets?",
    "I’m looking for inspiration. Have you got any useful objects in your pockets?",
    "Thanks… I think.",
    "The quickest way is through the cell door, but I don’t have anything to pick the lock with. Have you got any useful objects in your pockets?",
    "Err, thanks.",
    "I’m not sure yet. Have you got any useful objects in your pockets?",
    "Thanks.",
    "We need to get through the cell door, but I haven’t got anything to open it. Have you got any useful objects in your pockets?",
    "Great, these will be a huge help.",
    "Need a hand?",
    "WHOO! Get ‘em! Show no mercy.",
    "Give me an R. Give me an O. Give me a U…",
    "You guys deal with the guards. I’ll get the Holy Grail.",
    "Give him a right hook!",
    "How’s it going, Sir Lancelot?",
    "Show them what for!",
    "Now I just need to get out of here and see Wizard Cromperty.",
    "Wizard Cromperty! Merlin sent me. King Arthur has been kidnapped and turned into a granite statue.",
    "He didn’t WANT to be a statue. Morgan Le Faye turned him into one.",
    "Merlin said you might know how to free King Arthur.",
    "Yes, Wizard Cromperty, I remember, I was there.",
    "Why is that?",
    "How do I do that?",
    "That’s not so difficult. I already have the Holy Grail, King Arthur’s most prized possession, and I know he was turned into a granite statue.",
    "So what do I do with this spell?",
    "Merlin suspects King Arthur had been taken to the Black Knights’ Fortress.",
    "Thanks, Wizard Cromperty!",
    "It's no trouble. But we need to get you out of here quickly before any of the Black Knights suspect something.",
    "There's no time to explain; here, take this disguise.",
    "I shouldn't free him without having a disguise to give him, so he can leave safely. Maybe if I dressed him as one of the guards?",
    "I see you made it back safely.",
    "I guess we won't be hearing a peep out of them for awhile.",
    "Good day.",
    "Know you of any quests sir knight?[sic]",
    "I think you should stick to being a knight.",
    "Aww, shucks. It was nothing.",
    "Makes you wonder how they kidnapped you in the first place.",
    "Um... Hello.",
    "Thank you.",
    "You're welcome.",
    "Gee, it was nothing saving you all from the clutches of Morgan Le Faye and freeing your King.",
    "So how did you remove the Sinclairs from Camelot?",
    "How did you get your magic powers back?",
    "You had an exciting day!",
    "Oh, it is, except for that broken window... Very convenient. Where has the Sinclair family gone?",
    "I think you need to look for a new job. Your employers are a bit scary.",
    "I'm looking for clues as to where the Sinclair family has gone. Why can't anyone enter or leave?",
    "How peculiar.",
    "Yes, that was me. Now I'm trying to find out where the Sincalir family has gone.",
    "Right.",
    "Well, I'd not be doing a very good job of it, if I was, considering you're not asleep.",
    "Uh, no. I'm just browsing.",
    "Hi. I was wondering, do you know why the mansion is all locked up?",
    "That's a bit harsh. Thanks anyway.",
    "I'm trying to get into the mansion. Do you know why it's all locked up?",
    "But you're willing to speak to me?",
    "Buck up, man. We'll escape from here and set everything right.",
    "Then why are you in this jail?",
    "Huh, oh no I wouldn't laugh at the greatest knight in the land.",
    "How are things hanging, Palomedes?",
    "How did you let a bunch of Black Knights get the better of you? I thought you guys were the toughest knights around.",
    "Can I speak to her?",
    "May I speak to the prisoner?",
    "What's with the balloons?",
    "Well, being an attorney was an interesting experience.",
    "I know, but I needed to get a 'not guilty' verdict.",
    "What's with the balloons?",
    "Can I speak to my client?",
    "Really? Where is King Arthur now?"
  ],
  "Guard": [
    "Good day, [Player]. I'm afraid we meet under strange circumstances again.",
    "Finally, that man serves a purpose. I'm glad to have your help. I'm baffled again and my hands are tied.",
    "The Sinclairs have disappeared, though I'm not sorry to see them go, but what worries me is the disappearance of King Arthur and his knights around the same time.",
    "No, there's no evidence to suggest that. It never sat well with the Sinclair children when their old man gave the castle to king Arthur and moved the family to this mansion. I suspect the murder of old Sinclair was just the the first step in a deeper plot to retake their 'birthright'.",
    "That's the problem. The Seers' Village council has forbidden the guards from breaking into Camelot or the Sinclair Mansion for further investigation. They claim it's a breach of privacy or something like that. My suspicions mean nothing without proof to back them up, but I can't get proof without losing my job.",
    "Exactly! I'm sure you'll manage to find a way into the house.",
    "Any luck getting into the mansion? Did you get some evidence?",
    "A form? What does this prove?",
    "Ah! Of course. Unfortunately, they filled in all of the form except where their new address is.",
    "Really? Where?",
    "Aha! They've gone to the desert. They're meeting up with a camel.",
    "Oh, right. Well, it connects them to King Arthur, but it doesn't prove that they had any bad intent towards him. For all we know they were going to a party.",
    "Hmm, this armour resembles Black Knight armour. The only Black Knights on this side of White Wolf Mountain are those that work for Morgan Le Faye.",
    "Oh, right! With this evidence and the note you brought me, we know they had intentions to do harm to King Arthur.",
    "Thank you, [Player]. We have all the proof we need to present to the Seers' Village council that something suspicious is going on. They'll review the evidence and hopefully give me permission to take a team to Camelot. It shouldn't be too difficult to get to the bottom of this.",
    "Oh the Seers' Village council convenes in a month or so, I'll present it then. No doubt they'll want a few days to review the evidence. We'll do something after that... if none of the other guards are on holiday. There are only four of us, ya know.",
    "I have to follow procedure, my hands are tied. However, were a rouge adventurer to take the matter in to their own hands...",
    "Well, if I were him/her, I would learn as much as I can about the Sinclair family history.",
    "Ha, ha, ha. That's a good one. Whoo, I needed a laugh.",
    "WHAT? But the proof against her is conclusive. Someone saw her tamper with Sinclair's dinner!",
    "This is a sad, sad day. I can't stop you from doing it, but I wish with all my heart you wouldn't. You'll be aiding a murderer.",
    "Mother said to join the guards, see the world! What do I end up doing? Guarding some stuck-up brat in a backwater village full of hippies.",
    "I don't see why not."
  ],
  "Anna": [
    "Hmmm... yes, you were that nosy person asking all those questions about daddy's murder.",
    "I didn't! No one will believe me. It was my brother. He set me up.",
    "It's forged! I swear, I never touched that dagger or poisoned my father!",
    "How should I know? I've been locked up here since you stuck your nose into our family's business.",
    "Wait! I... might know how to find them... but I need a favour from you in return.",
    "I need a defence lawyer. None of the ones around here will represent me, they all think I'm guilty.",
    "No he didn't ! He just said he saw me in the room. Why does everyone believe him? Can't you see he framed me? I was the scapegoat so they could all inherit their fortunes and live the good life.",
    "I don't care if you don't believe me. I know I'm innocent... but I'm also the only one that can show you how to get into Camelot. There's a secret passage that I discovered as a child when we lived there.",
    "Yes! Exactly. So, what do you say?",
    "Try speaking to the servants at the Mansion. They'll probably be able to give you useful testimony. Wait, take this.",
    "You can use it as evidence.",
    "No, show it to the servants. You'll find one of my siblings wears similar colours.",
    "I can't believe you did it. I'm free!",
    "Shhh. Don't talk about that here! The guards are going to take me back to my cell for paperwork. Meet me there and I'll explain how to get to Camelot.",
    "I can't believe such an incompetent fool as you managed to prove me innocent.",
    "You are demanding for a peasant, aren't you. Walk around the edge of Camelot towards the back of the castle. From the hedges, you should be able to see the garden temple. There's a statue back there, if you pull the arm a secret entrance will appear. Go inside and it will take you straight into Camelot.",
    "I have to sign some paper work before I can leave here. Beside, the last thing I want to do is go hang out with my family. I'm sure a clever boy/girl like you can manage this on your own.",
    "You see, I told you that adventurer would turn up. She believed my every word.",
    "Why thank you. What are we going to do with her now?",
    "Enough! I'm sick of having to listen to your drivel!",
    "Do you think 'she' would want to see her?",
    "Yes, my lady. The meddling adventurer who helped King Arthur in the past."
  ],
  "Hobbes": [
    "Didn't you already ask me questions about this? You were investigating the case and got all the evidence. Besides, Anna was proven guilty - by one of her own siblings.",
    "I was tidying the bedrooms most of the afternoon and then assisted Louisa in the kitchen, preparing dinner. I gave Lord Sinclair's dinner to Mary, and shortly there after heard her screaming.",
    "I'm afraid I didn't see her. I didn't meet anyone when I walked from the bedrooms to the kitchen.",
    "No, I only saw Lord Sinclair handle it.",
    "Well, now that you have me thinking about it, I believe I saw David handle it once. I'm not really sure what he was doing with it, but I do remember him looking at it.",
    "I only thought of it now.",
    "I'm not sure; it could be Anna's or David's.",
    "I'm afraid I can't.",
    "There were various chores around the house that required poison.",
    "I personally did not; I do not know about the others.",
    "Hobbes; I am the butler.",
    "No, I only saw Lord Sinclair handle it. It was on display in the library.",
    "Well, now that you have me thinking about it, I believe I saw Frank handle it once. I'm not really sure hat he was doing with it, but I do remember him looking at it.",
    "Yes, I am.",
    "That thread could be from some of Anna's or David's clothes.",
    "Well no, not precisely.",
    "Yes, they would if they paid attention.",
    "There were various chores around the house that required poison. I believe everyone in the household bought some.",
    "I personally did not, I do not know about the others.",
    "I'm afraid I didn't see her. I didn't meet anyone when I walked from the bedrooms to the kitchen.",
    "What are you doing here? I thought the house was locked up tight.",
    "I'm under strict orders not to speak to anyone not of the Sinclair family. I was told if I left the house I would be killed!"
  ],
  "Louisa": [
    "About the murder? Well, there's not so much to tell, honestly.",
    "I was with Hobbes the butler and Mary the maid in the kitchen. We were preparing dinner. I gave Mary Lord Sinclair's meal and sent her on her way.",
    "Of course not. I was here cooking, she was taking the meal to him. That's when she found the body.",
    "I can't imagine how. Mary carries the meal right in front of her the entire way! But now that you mention it, I do remember seeing Anna Sinclair about the kitchen earlier that day. She looked a bit shifty.",
    "I was in the kitchen almost all day, but I did see her just before I began cooking the evening meal. She was wandering aimlessly. So, I snapped at her to get out of the way.",
    "Stuck her tongue out at me and wandered away. Useless girl.",
    "Not that I can remember. None of the children seemed to pay any attention to it, as it was just a replica and not worth anything.",
    "I suppose Mary dusted it now and then, but I think it just sat on one of the bookshelves.",
    "It could be Anna's or David's.",
    "I'm afraid not.",
    "I told Carol to buy some for the drains. I haven't a clue if she actually did or not, she rarely paid me any heed.",
    "I don't know. The Sinclairs were so stingy about money that I'm surprised any of them bought some.",
    "Louisa; I'm the cook.",
    "Not that I can remember. None of the children seemed to pay any attention to it, as it was just a replica and not worth anything.",
    "I suppose Mary dusted it now and then, but I think it just sat on one of the bookshelves.",
    "That thread could be Anna's or David's. They were always wearing something of that colour.",
    "No, I'm afraid I can't.",
    "Yes, they would have.",
    "I told Carol to buy some for the drains. I haven't a clue if she actually did or not, she rarely paid me any heed.",
    "I don't know. The Sinclairs were so stingy about money that I'm surprised any of them bought some.",
    "No, I didn't keep track of it. Obviously some of it was used for murder.",
    "I was with Hobbes the butler and May the maid in the kitchen. We were preparing dinner. I gave Lord Sinclair's meal to Mary and sent her on her way.",
    "Of course not. I was cooking, she was taking the meal to him. That's when she found the body.",
    "I can't imagine how. Mary carries the meal right in front her the entire way! But now that you mention it, I do remember seeing Anna Sinclair hanging about the kitchen earlier that day. She looked a bit shifty.",
    "What are you doing here? I didn't think anyone could enter or leave this place.",
    "We were told a curse had been placed on us. If we left he mansion we'd be stuck down in an instant.",
    "I don't know. They got really secretive after Lord Sinclair was killed and then suddenly left. That's all I know."
  ],
  "Mary": [
    "I don't like talking about that night. I still have nightmares about it.",
    "What an awful night. It started out normally, I was in the kitchen with Hobbes and Louisa, helping with dinner. They gave me Lord Sinclair's meal. I went to deliver it and I found him...",
    "No, I didn't pass Anna, I'm sure of that. I think I passed one of the young Sinclairs though. A man.",
    "I can't remember. I just remember it being a man.",
    "I was cleaning the library. I saw her come into the room.",
    "Nothing really, just wandering.",
    "No, nothing like that.",
    "No, I never did. And I walked from the kitchen to Lord Sinclair's room, so I would have.",
    "Not that I can think of.",
    "Not really. I can't remember who handled it, if anyone.",
    "Hmm, it could be Anna's or David's.",
    "I can't.",
    "Nothing, really. I didn't buy any.",
    "No, I was upstairs cleaning when the salesman came by, so I didn't know until after he left that he'd been there.",
    "Mary; I'm the maid.",
    "Not that I can think of.",
    "Not really. I can't remember who handled it, if anyone.",
    "This thread could be Anna's or David's. Almost all their clothes were of that colour. It made doing laundry a nightmare.",
    "No, not for certain.",
    "Yes, I suppose they would have.",
    "No, not really. I didn't buy any.",
    "No, I was upstairs cleaning when the salesman came by, so I didn't know until after he'd left that he'd come by.",
    "I was in the kitchen with Hobbes and Louisa, helping with dinner. They gave me Lord Sinclair's meal. I went to deliver it and I found him...",
    "No, I didn't pass Anna. I'm sure of that. I think I passed one of the other young Sinclairs, though. A man.",
    "I can't remember. I just remember it being a man.",
    "Who...? Oh, I remember you! You were asking all those questions about Lord Sinclair's murder. You had all sorts of evid-whats-its."
  ],
  "Donovan The Family Handyman": [
    "But she was proven guilty! There was even evidence.",
    "I went to bed early as I'd been up very early fixing some garden equipment.",
    "No, I'm a very heavy sleeper. I didn't even hear the maid scream when she found the body. Louisa, the cook, had to come to wake me.",
    "Let's see. I'd finish up early for the day and was heading to bed. I can't remember seeing any one on my way there.",
    "Pretty certain. I usually tried to avoid being near any of the Sinclairs.",
    "Hmm, I seem to remember her looking at it a few days before the murder.",
    "I'm not sure, it could be Anna's or David's.",
    "I can't.",
    "Nothing much. I didn't buy any and I don't remember who did.",
    "Yup, I don't pay heed to salesman, they're a dodgy lot.",
    "You aren't here to murder us in our sleep are you?",
    "So, you are here to kill us!"
  ],
  "Pierre": [
    "Dang, that's too bad for you. Isn't it a bit of conflict of interest, considering you were part of the investigation that proved she was guilty?",
    "I fed the dog and went to the inn in town. When I got back the guards were all over the place.",
    "Didn't see any of the family. I was outdoors most of the evening, tending to things, then went to the town.",
    "That dagger? I think Lord Sinclair kept it in the library. It was only decorative, so I never paid much attention to it.",
    "Yes, I suppose they would.",
    "I'm not sure; it could be Anna's or David's.",
    "I can't.",
    "The poison salesman came around the mansion and practically everyone bought some.",
    "Each of the Sinclair kids did. They all had chores they were meant to do. I had a chat with that salesman. Whoo, you any idea how strong that stuff was? Just a small amount would be enough to kill a cow.",
    "Yup, that's what the poison salesman said. I had a chat with him at the pub.",
    "Pierre; I'm the dog handler.",
    "I think Lord Sinclair kept it in the library. It was only decorative, so I never paid much attention to it.",
    "Yes, I suppose they would.",
    "That thread could be Anna's or David's. They were always wearing something of that colour.",
    "No, I can't.",
    "Well, yes, any of them with eyes.",
    "The poison salesman came around the mansion practically everyone bought some.",
    "Each of the Sinclair kids did; they all had chores they were meant to do. I had a chat with that salesman. Whoo-boy, you any idea how strong that stuff was? Just a small amount would be enough to kill a cow.",
    "Yeah, I s'pose it would.",
    "Didn't see any of the family. I was outdoors most of the evening, tending to things, then went to town.",
    "Good day.",
    "I'm not meant to talk to anyone outside the family. On pain of death."
  ],
  "Stanford": [
    "Why in RuneScape would you want to do that? That's a lost cause if I ever heard one.",
    "Not all that much. I worked out here 'til late. I was getting ready to come in for dinner when all the commotion started.",
    "She must have been in the house, since I didn't see her out here.",
    "No, I was on this side of the garden and you can't hear much but the dog from here.",
    "No.",
    "Hmm, not that I can remember. It was kept on display as some sort of replica of a great weapon. I'm not much good at history so I can't remember any details.",
    "I think the maid may have dusted it, but I don't really know, I work outside.",
    "I'm not sure; it could be Anna's or David's.",
    "No, I can't.",
    "This salesman came around selling this poison that could fix anything. I think most everyone bought some to use for chores around the mansion.",
    "No, but I requested one of the Sinclairs to buy some to use on the compost. I can't remember if they did or not.",
    "Yes, she did. I definitely remember seeing her buy some, I'm pretty sure she didn't use it for her chore either.",
    "Stanford; I'm the gardener.",
    "It was kept on display as some sort of replica of a great weapon. I'm not much good at history so I can't remember any details.",
    "Hmm, not that I can remember.",
    "I think the maid may have dusted it, but I don't really know; I work outside.",
    "That could be Anna's or David's; green was their favourite colour.",
    "'Fraid not.",
    "I s'pose so.",
    "This salesman came around selling this poison that could fix anything. I think most everyone bought some to use for chores around the mansion.",
    "No, but I requested one of the Sinclairs to buy some to use on the compost. I can't remember if they did or not.",
    "Yes, she did. I definitely remember seeing her buying some. I'm pretty sure she didn't use it for her chore either.",
    "Not all that much. I worked in the garden 'til late, and I was going inside for dinner when all the commotion started.",
    "Nope.",
    "'Allo, what can I do for you?",
    "'I wasn't privy for the reason, but the whole family upped and left not long ago. Since then, I haven't heard a peep from anyone. I was told not to enter the mansion or to speak about their departure.",
    "Didn't say I was going to obey them, did I?"
  ],
  "The Judge": [
    "This court is now in session.",
    "This trial is to determine the guilt or innocence of Anna Sinclair for the murder of Lord Sinclair.",
    "Is the prosecution ready?",
    "Is the defence ready?",
    "Very well. The prosecution may present its case.",
    "Thank you, prosecutor.",
    "Defence, as this is your first time in court, I'm going to explain how we do things around here. You may call for a recess at any time by leaving through the gate behind you. You'll have to start the trial over when you return. You may call witnesses by speaking to me. When you are finished with a witness simply speak to me and call the next one. Your job is to disprove the evidence presented by the prosecution by having your witnesses testify. If you need to hear the prosecution's case again, just speak to him. Let's begin.",
    "Who would you like to call as a witness?",
    "Order! ORDER!",
    "Order! ORDER!",
    "Order! ORDER!",
    "Order! ORDER!",
    "Order! ORDER!",
    "Order! ORDER!",
    "Order! ORDER!",
    "Order! ORDER!",
    "Order! ORDER!",
    "Order! ORDER!",
    "Order! ORDER!",
    "Order! ORDER!",
    "I believe we've heard enough. Would the jury please pronounce their verdict?",
    "Very well. Anna Sinclair, you are hereby declared 'not guilty' by a jury of your peers. You are free to go.",
    "Ah, the courthouse was built over the old Party Room... Balloons we can handle, it's when those dancing knights show up that it gets troublesome.",
    "That was a well presented case. Court is now over, so you may leave when you like.",
    "Of course. You can speak to them here or back at the jail cell. They'll be released later today after some paperwork gets filled out."
  ],
  "Prosecutor": [
    "The prosecution is ready, Your Honour.",
    "Members of the jury, I am going to present you with evidence that decisively proves Anna Sinclair is a murderer.",
    "First, the dagger. The dagger was found stabbed into Lord Sinclair's body; it has the fingerprints of Anna Sinclair all over it.",
    "Second, the thread. This thread was found at the scene of the crime; it matches Anna Sinclair's clothes.",
    "Last, but certainly not least, the poison that actually killed Lord Sinclair; it was found at the scene of the crime and had been bought by the defendant. Members of the jury, this woman is guilty.",
    "Ah, the courthouse was built over the old Party Room... Balloons we can handle, it's when those dancing knights show up that it gets troublesome.",
    "Those were some dirty tricks you played. Your so-called 'proof' doesn't hold up under any scrutiny.",
    "You've let a cold-blooded murderer go free. I hope the guilt eats away at you."
  ],
  "Donovan": [
    "Donovan; I'm the handyman.",
    "I seem to remember her looking at it a few days before the murder.",
    "That thread could be Anna's or David's; they always seemed to be wearing the same colour.",
    "No, sorry, I can't.",
    "Sure, anybody would have seen that.",
    "Nothing much. I didn't buy any and I don't remember who did.",
    "Yup, I don't pay heed to salesmen, they're a dodgy lot.",
    "I'd finished my work for the day early and headed to bed. I didn't see anyone.",
    "Pretty certain. I was really tired and tried to avoid getting assigned another job to do by one of the"
  ],
  "The jury": [
    "The defence isn't very skilled.",
    "You know, I think that's true.",
    "You know, I think that's true.",
    "By jove, of course!",
    "That's a very good arguement.",
    "You know, I think that's true.",
    "You know, I think that's true.",
    "Hmm... that's very condeming.",
    "You know, I think that's true.",
    "*whispers* That seems very likely.",
    "You know, I think that's true.",
    "Hmm... that's very condeming."
  ],
  "David": [
    "Well done, sibling. I knew you'd manage to get a 'not guilty' verdict, but to lure this cretin here as well... What can I say, I'm impressed.",
    "Feisty one, isn't she. Easily duped as well. You didn't actually believe my sibling would help you, did you?",
    "Most definitely. Have someone go and fetch her."
  ],
  "Morgan Le Faye": [
    "I hear you have something of interest for me.",
    "Oh, they are quite safe. You'll be seeing them soon, although not Arthur. He's a bit... busy at the moment.",
    "I'm tired of this."
  ],
  "Merlin": [
    "Oh dear, did Morgan capture you too?",
    "Eh, is that so? Very clever. Now that you've found us, what is your plan, oh brilliant leader?",
    "Well, all great plans start with knowledge. Let me bring you up to speed with the situation. What do you want to know?",
    "As the final blow to our morale, Morgan turned Arthur into a granite block before our very eyes. He was taken aay by the Black Knights, for what purposes I know not.",
    "Morgan Le Faye has been itching to get revenge upon Arthur and myself for some time. When she heard of the murder of old Sinclair, she learned she was not the only one with a vendetta against Camelot. The Sinclairs have wanted to get their slimy hands on Camelot since their father's death. With Morgan cunning and their riches, they make a formidable team. They bought the services of the Black Knights from Lord Daquarius and overran Camelot. We were outnumbered and taken by surprise. The Sinclairs stole our home, but Morgan struck the greater blow by stealing the Holy Grail, Arthur's most prized possession.",
    "During the battle at Camelot, Morgan cast a spell against me which appears to have stripped me from my powers. I must admit, the loss of my magic has left me befuddled, making it difficult to create a plan.",
    "Escape is only a short-term plan. We should discuss the long-term goals as well.",
    "I think we could reclaim Camelot from the Sinclairs on my own.",
    "They don't know I've lost my magic. Besides, I got a few tricks up my sleeves. For all their snobberies, they're still just spoiled brats. It shouldn't be difficult, but time is of the essence. I need you to break me out of here quickly and quietly, so Morgan cannot alert them.",
    "Precisely.",
    "Morgan always keeps things of power near her. So, the Grail will be somewhere in Keep Le Faye. However, it will most likely be disguised and booby-trapped. Morgan has a thing about transmorgrifying.",
    "No, that won't work. Better to break out of the jail with all of the Round Table Knights. Let them deal with the guards while you retrieve the Grail.",
    "Often the most complicated things have the simplest answers. Try leaving through the door.",
    "When has that ever stopped an intrepid adventurer such as yourself?",
    "I believe he’s been taken to the headquarters of the Black Knights. I’m afraid I’m not well travelled on that side of the world, so I don’t know its exact location. However, it’s trickier than just finding Arthur. You’ll need to free him of the spell that turned him into a granite statue.",
    "I have no idea.",
    "Let me finish. I may have no idea, but a wizard friend of mine should. His name is Wizard Cromperty, and he’s very experienced in freeing people from stone since he keeps teleporting them into it. Speak to him in East Ardougne, he’ll help you.",
    "Welcome, brave knight.",
    "Well, after I climbed out the vent, I snuck aboard a passing trade ship that dropped me at Catherby. From there, I returned to Camelot and used the Sinclairs [sic] own entrance against them. I used some of my own inventions to create a great deal of chaos and drove them from the house. Then I made sure they returned to their mansion and told them if they ever stepped foot from it again, I'd turn them all into rabbits.",
    "Ah, Morgan's spell was not hard to break once I had access to my workshop. It's rather technical, so I won't bore you with the details."
  ],
  "Sir Gawain": [
    "Well, I would have thought picking the lock was really the best way, but I don’t have the knowledge or tools to do it.",
    "How are you going to get all of us out of here?",
    "No, my revenge will be my own. You must retrieve the Holy Grail!",
    "Good day to you [sir/madam]!",
    "I think you’ve done the main quest we were on right now…",
    "Isn't it terrible what happened to King Arthur? He was turned to stone before my eyes! I have failed him, I am not worthy of being his knight. To allow such lowlifes to take Camelot right from under our noses... It's unforgivable."
  ],
  "Sir Kay": [
    "I saw a grate high up on the wall of the cell. I think someone could slip through that, but I’m not sure how they would reach it.",
    "How are you going to get all of us out of here?",
    "The knight empties his pockets and hands you everything that might be useful.",
    "They shall pay for what they have done.",
    "Good morrow [sirrah/madam]!",
    "We owe you a great debt for freeing us from that dungeon.",
    "I will wreak havoc upon those worthless Sinclairs. Betraying their father's wishes like that, it's despicable."
  ],
  "Sir Tristram": [
    "I have great faith that you will lead us to victory. But first we must win the battle, then worry about the war. If you require my assistance in escaping from this wretched cell, please tell me.",
    "How are you going to get all of us out of here?",
    "What for what?",
    "Hail Arthur, King of the Britons!",
    "You are indeed a mighty knight. I hope your adventuring goes well.",
    "It is good to see you again, brave man/lady, but under such sad circumstances. To first have our great King turned to stone and to then have our most prized treasure, the Holy Grail, stolen from us, is indeed the worst of days."
  ],
  "Sir Lucan": [
    "Please, no questions. I am in mourning for our King.",
    "How are you going to get all of us out of here?",
    "I’m afraid not. I didn’t have anything with me when we were captured.",
    "How would I do that when I’m holding a sword? Leave me to the fighting, you find the Holy Grail!",
    "Hello there adventurer. That was a grand adventure. I can see why you make it your profession.",
    "Please don't ask me any questions. I am still too upset from our defeat at the hands of those treacherous Sinclairs."
  ],
  "Sir Bedivere": [
    "You just let me at them. We’ll see how they like surprise attacks.",
    "How are you going to get all of us out of here?",
    "In the amount of time it will take you to spell out Round Table Knights, you could have found the Grail.",
    "May I help you?",
    "Thank you for your assistance in our time of need.",
    "We are true knights who fight for honour. Those Black Knights didn't fight fair, so we were unprepared. Most unchivalrous of them."
  ],
  "Sir Palomedes": [
    "You usually leave rooms through doors, but this one is locked.",
    "How are you going to get all of us out of here?",
    "I’m sorry. I don’t have any pockets.",
    "Hello there adventurer, what do you want of me?",
    "I was glad to get my revenge on those knights in the keep. They were no match for us.",
    "Hanging? I'm not hanging. But I am very angry at being captured by those Black 'Knights', as they call themselves."
  ],
  "Sir Lancelot": [
    "No, but when we do, I’m going to make those Black Knights black and blue all over.",
    "How are you going to get all of us out of here?",
    "How dare you attempt to imprison the greatest knight in the land? Have at thee!",
    "Greetings! I am Sir Lancelot, the greatest Knight in the land! What do you want?",
    "Humph. You are indeed a better knight than I first suspected.",
    "I could have taken all of them on! Those black knights wouldn't stand a chance against me, the greatest knight in the land.",
    "They attacked while I was in the bath. What was I to do? Hey, are you laughing at me, the greatest knight in the land?"
  ],
  "Sir Pelleas": [
    "Sir Kay and I noticed a grate high up on the wall that leads to the small docks at the back of the keep, but it’s too high up to reach and we couldn’t figure out a way to boost our height.",
    "How are you going to get all of out of here?",
    "Consider it done.",
    "DIE SCUM!",
    "Greetings to the court of King Arthur!",
    "I am proud to have you as a member of the Round Table.",
    "Greetings, brave knight. I believe you should speak to Merlin, he probably has need of your assistance."
  ],
  "Renegade Knight": [
    "Please! Stop the hurting!"
  ],
  "Wizard Cromperty": [
    "Why would he want to be a statue?",
    "Oh yes, I see now. Why are you telling me all this?",
    "Oh, well, I don’t know anything about rocks. I’m a teleportation expert, myself. But there was this one time I teleported a girl right into a rock. What a mess that was.",
    "Oh were you? Of course you were. Well, I suppose being turned into a statue is very similar to being teleported into a rock… Let me see what we’ll need.",
    "If my calculations are correct, this spell will need a bit more ‘oomph’ than last time around.",
    "Well, before you were simply reanimating the person within the rock. This time you need to unravel Morgan Le Faye’s spell first.",
    "You’ll need King Arthur’s most prized possession. That will unravel Morgan’s spell. Then you’ll need a piece of granite, the same rock Arthur was turned into.",
    "Let me just get that spell scroll for you…",
    "Ah, you still have the Animate Rock spell I gave you from our last adventure in your bank.",
    "Take the scroll, the Holy Grail and a piece of granite, an amount will do, to the statue of King Arthur. Once in front of him, read the scroll and the magic should do the rest.",
    "Where is Arthur being kept, anyway?",
    "Then you’ll need a disguise. You could try asking the fortress guards about their armour, or you could wear black armour if you have any to hand.",
    "Hmmm…I wonder… if you used a magical object that turned you into stone on the statue, would it turn him back to being human? I must research that…",
    "Oh, are you still here? Go on then, you’ve got a king to save!"
  ],
  "King Arthur": [
    "Thank you! I was afraid that would be the end of me.",
    "The Black Knights? I thought Morgan did this to me.",
    "Very well.",
    "You leave first and I'll sneak out in a few minutes. Meet me back at Camelot and I shall reward you generously for your aid.",
    "Indeed, thanks to the disguise you gave me. I arrived back just as Merlin had kicked out the Sinclair children. He scared them off with a few puffs of smoke and frogs. He told them if any of them left their house again, he'd turn them all into rabbits.",
    "Indeed. We of the Round Table are greatly indebted to you for all of your help. I wish to reward you for all the help you have given us...",
    "Welcome, brave knight. I am always happy to see you back at my court. Please feel free to roam the castle and make use of the training grounds."
  ],
  "Clerk": [
    "That Sinclair woman is such a pain! She keeps demanding gourmet meals and ridiculous things like silk sheets.",
    "Go ahead. It means she won't be demanding things from me."
  ],
  "Fortress Guard": [
    "I heard something happened to King Arthur and that Lord Daquarius was behind it.",
    "I've no idea, but it's a great victory for Lord Daquarius. To take such a mighty support of the White Knights down... Truly brilliant."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:King%27s_Ransom?oldid=36196761’"
  ]
}