{
  "(On old accounts": [
    ")[source needed]"
  ],
  "Commander Denulth": [
    "Glad you could make it. I've been expecting you. I've heard you've been doing well repelling the trolls so far, but now we need you for something a little harder.",
    "Hello citizen, how can I help?",
    "We do have a quest, if you believe that you are ready for it.",
    "The trolls have taken up a position on Death Plateau, and we can't move them. As you know, the trolls have been pushing us hard, and we have to do something before they get too dug in and begin sending forces down the pass. They have stone throwers lining the only path up there that we know about, and the only entrance is narrow and easy to hold. If I didn't know they were pretty much mindless animals I would almost admire the position they have taken.",
    "Well, no. Sending you alone would be suicidal. What we need is to find another way up there. If we can find another route, then we can try and ambush them, or just spy on their movements. There is a cave beyond the defensive wall to the north west, at the foot of the plateau, where you will find a dwarf called Sabbot. He's a surly old geezer, but a good ally. He and his wife were surveying the mountain before the trolls arrived. To get there, go north-west from here, then west past the tower and the ruined wall. Then turn north and you can't miss it. If you go and speak to him, I'm sure that at the very least he'll be able to tell you another route up to the plateau. We really need you to help us, with some urgency. It will be dangerous, and you may have to face some combat. Can you do it?",
    "Hmm...well, I suppose we will try and hold off the endless waves of trolls until someone who can help us arrives. It takes a special kind of hero to complete this task. Come and see me if you feel you're up to the job. In the meantime, can I help you with anything else?",
    "That's great news. May the gods grant you speed.",
    "Welcome to the Principality of Burthorpe! We are the Imperial Guard for his Royal Highness Prince Anlaf of Burthorpe. Can I assist you with anything else?",
    "Very well.",
    "Hello citizen, is there anything you'd like to know?",
    "Of course, what is it you need to know?",
    "I would start by speaking with Sabbot, the dwarf that lives in the cave not far from here. If you go north west of here, past the defensive wall, then his cave is to the north. It leads under the plateau. You can't really miss it. He and his wife were scouting the mountains for a suitable location for a trading post when the trolls arrived. To get there, go north-west from here, then west past the tower and the ruined wall. Then turn north and you can't miss it. It's very likely that he may have a good idea where to find a route up to the plateau.",
    "You are right, citizen. The White Knights have taken advantage of the old and weak king. They control most of Asgarnia, including Falador, but they do not control Burthorpe! We are the prince's elite troops! We keep Burthorpe secure! The White Knights have overlooked us, until now! They are pouring money into their war against the Black Knights, so they are looking for an excuse to stop our funding and I'm afraid they may have found it! If we can not destroy the troll camp on Death Plateau then the Imperial Guard will be disbanded and Burthorpe will come under control of the White Knights. We cannot let this happen! Is there anything else you would like to know?",
    "Good speed citizen.",
    "Hello citizen, is there anything you'd like to know?",
    "Of course, what is it you need to know?",
    "No, she maintains a small cottage in the mountains to the west.",
    "Dangerous for the trolls maybe! She may barely come up to a troll's stomach, but she is very handy with an axe. Freda sometimes goes and scouts the area, reporting on the troll's movements and numbers. In exchange we send her shipments of food and deliver mail to Keldagrim for her. To be honest, I think she's starting to like this sort of life, instead of being a simple trader.",
    "Hello citizen, is there anything you'd like to know?",
    "Of course, what is it you need to know?",
    "Dunstan? The smith? What do you need to see him for?",
    "An interesting lead... But remember, the more you delay the more likely it is the trolls will attack. Dunstan is up in the north east of the town.",
    "Hello citizen, is there anything you'd like to know?",
    "Of course, what is it you need to know?",
    "Boots...?",
    "Hello citizen, is there anything you'd like to know?",
    "Of course, what is it you need to know?",
    "Hmm....I don't think so.",
    "Good luck.",
    "Hello citizen, is there anything you'd like to know?",
    "Of course, what is it you need to know?",
    "Why would I have a pickaxe?",
    "Why do you need a pickaxe, anyway?",
    "That is interesting. Well, I'll let you get on with it. Remember, time is of the essence.",
    "Hello citizen, is there anything you'd like to know?",
    "Of course, what is it you need to know?",
    "Gladdened as I am by the news there is a tunnel, we can't spare anyone.",
    "We've had reports that trolls are slipping past the lines singly and in pairs, looking to mass in caves and crannies in Taverly for a strike behind our lines.",
    "We have everyone able to carry a sword keeping watch and turning over every rock they can find.",
    "That it is. It just makes it even more important that you find a way up to the plateau as soon as possible.",
    "As soon as we can begin launching assaults, the trolls will be on their back foot and we'll be able to cut the scouts off.",
    "Can we use it to get onto the plateau itself?",
    "Ambush their reinforcements as they come through the choke point... I love it! We'll thin their numbers and give our troops on the front lines some respite. Come, let's plan a little surprise for the trolls. You've done great work today.",
    "Welcome back friend!",
    "Here you are. Take good care of them, as they're a powerful tool.",
    "Saradomin be with you, friend!"
  ],
  "Player": [
    "Hello!",
    "I was born ready. What do you need me to do?",
    "And you want me to go up there and kill them?",
    "No thanks.",
    "This sounds like a pretty important job, I'll do it.",
    "Hello!",
    "Where should I start looking for the way up to the plateau?",
    "That looks dangerous. I'll need a good reason before I venture that way.",
    "Hello!",
    "What about your husband?",
    "How? Aren't trolls really fierce in combat?",
    "So why don't you live with your husband then?",
    "Death Plateau. I have been asked by the commander of the guard to try and scout a new route up to attack the trolls.",
    "Thanks. I guess I'll keep looking.",
    "Thanks, I'll go check that out.",
    "Hello there.",
    "I wanted to ask you something.",
    "Well I'm not moving until you help me!",
    "Fine!",
    "Fine!",
    "Fine!",
    "No!",
    "So you know a way up to Death Plateau?",
    "Well, uh, what's the other way?",
    "So, what, you want me to dig a tunnel?",
    "Well, where are these caverns, and can you be sure it'll come out where I need to go?",
    "Uh...right, I'll go and ask her about the survey, then.",
    "Well...you have to admit it's a little...unpolished.",
    "Probably you, in a high-pitched, insane cackle.",
    "Uh, I need to ask something else.",
    "But I could get you a pickaxe, or a hammer.",
    "What about some food, or some tea?",
    "Uh...okay.",
    "Hello again.",
    "I wanted to ask you something.",
    "But haven't you lived here a long time? Don't you know?",
    "But I could get you a pickaxe, or a hammer.",
    "What about some food, or some tea?",
    "Uh...okay.",
    "Hello!",
    "I spoke to Sabbot, and he told me to speak to his wife Freda. Does she live in town?",
    "Isn't that dangerous with trolls running around?",
    "Hello there.",
    "Can I see the survey you and your husband did on the cave under Death Plateau?",
    "Well, I am looking for another way to get onto Death Plateau so the Guard can ambush the trolls. Your husband told me that there could be caves under it that I could use.",
    "You mean there aren't any?",
    "He did seem a little...upset about the idea of rock climbing.",
    "Is there any chance you could do this and then go into town?",
    "What if I went and got the boots fixed for you? Would you make a start on the survey then?",
    "Where does he live?",
    "Thanks for the tip!",
    "Is the report ready?",
    "Awww...",
    "I'm sorry. I lost those boots you gave me.",
    "All right.",
    "I thought you might need this.",
    "Hello!",
    "Where can I find Dunstan?",
    "Freda asked me to run an errand while she makes a copy of a geological survey. Both she and Sabbot think there may be an entrance to underground tunnels that could be used to bypass the plateau.",
    "Hi!",
    "I...don't...know!",
    "She gave them to me to get re-spiked. Can you do it, please?",
    "Hi!",
    "Could I get some more spiked boots please? I may have misplaced the ones you gave me.",
    "Thanks! I'll take these straight over to Freda!",
    "Hello!",
    "Well, it is not much of a question. I just thought I would let you know that Dunstan gave me Freda's boots back. By the time I deliver these, Freda will be finished with her transcription, and I'll be able to look for that secret tunnel.",
    "Oh, yes, Freda asked me to run an errand for her while she transcribed a survey of the caves under Death Plateau. With any luck I might be able to find a route up there without the trolls seeing me.",
    "Is the report ready?",
    "No. Maybe if I go and get them you'll be ready.",
    "Is the report ready?",
    "That's great! I have your boots too, by the way.",
    "Thanks; I'll take this back to Sabbot's cave. Is there anything you want me to take to him?",
    "Hello, Freda.",
    "Well, I still need to take it along to Sabbot's cave and investigate the walls for tunnels.",
    "Freda, do you have another copy of that survey?",
    "That's terrifyingly specific.",
    "Hello!",
    "Can you use this geological survey to get up to the plateau?",
    "Oh well, I will take it to Sabbot's cave and see what I can do with it.",
    "I see...I think I know where to dig now!",
    "Hello, Freda.",
    "Well I took a look at it, and it seemed very simple. Was it really that complicated? I mean, now I know where to dig just by looking at the diagram you drew.",
    "That does sound quite complicated.",
    "Hello!",
    "Do you have a pickaxe I can borrow?",
    "You know, now I come to ask you I do think it would be odd if you had one.",
    "I have found a crack in the wall of Sabbot's cave that may lead to an underground tunnel.",
    "Now that I think about it, I have a pickaxe on my tool belt. That should be sufficient to mine through the crack.",
    "I will.",
    "Can you help me with this survey?",
    "Yes, but I'd sill like a little help, if that's alright.",
    "Hey Sabbot, can you give me a hand clearing the tunnel?",
    "But isn't most of your gear made of rocks?",
    "Well it is pretty messy work.",
    "Hey Sabbot, can you give me a hand exploring this tunnel?",
    "Doing what?",
    "Hello!",
    "Do you think you could spare some men to help me scout the tunnel I have found?",
    "I have found a tunnel, and I need to make sure it leads up to the plateau. But if I had some men to help then it would go quicker.",
    "That's pretty serious.",
    "Hello, Freda.",
    "The survey was very useful! I found a secret tunnel, and it might well take me to Death Plateau!",
    "Thanks! Where did you get them?",
    "Will you look at that... Death Plateau!",
    "I'm sure we'll be able to ambush the trolls from up here.",
    "And best of all, those dirty, stupid trolls don't know a thing about it.",
    "Uh...",
    "Err...hello?",
    "The map?",
    "You have a map to Burthorpe? Who made it?",
    "You...ate the map?",
    "You ate everyone.",
    "Well, if you were starving and they were dead...",
    "Uh...",
    "I think that takes care of him. I'll just take that tunnel or teleport back and speak to Denulth.",
    "I've found a hidden overlook point over the route that leads up to Death Plateau!",
    "Not really... but it is a great place to attack the trolls from where they don't expect it.",
    "Hello!",
    "Can I have those reward lamps that you owe me?",
    "Thanks, I will."
  ],
  "Freda": [
    "Well hello there! My, you're a cheerful one! How can I help you?",
    "I'm Freda, welcome to my humble home! My husband, Sabbot, and I came here to start a trading post. You know, selling dwarven arms to the Guard. Then the trolls came and took over the plateau before we could get established, so I came to live here.",
    "That stubborn old mule won't leave the cave we were in! He'd rather die than let the trolls win. I send him soup and letters now and then, and those nice men in town make sure he's okay. Is there anything else you want?",
    "Not at all. There used to be a few around here, but I soon dealt with them.",
    "Yes, but I'm fiercer! I'll have you know I've not been a trader all my life. I do know which end of an axe will do the most damage to a troll. Besides, some of those nice young men from town give me a hand if the trolls come in numbers. But after the last time the trolls seem to have got the hint. It's astonishing what waving an axe at groin height will do to break the will of even the biggest troll!",
    "Well, I can take on the occasional wandering troll, but a whole horde of them is something else entirely. This place may not be that safe, but at least it's not the middle of a warzone. Anything else I can help you with?",
    "I might do. Where are ya trying to get to?",
    "Hmm...Death Plateau eh? I can't say I know another way up there. I do know a few secret goat paths and climbing spots out there, you know? But nothing that'd be useful for the guard. I can get away with scrambling about on my own over the paths with my climbing boots. But you'd never get away with moving lots of men around. The trolls would see you coming from miles away.",
    "You should go ask my husband, Sabbot. He's been living a lot closer to the plateau, and might have an idea.",
    "Is there anything else before ya go?",
    "Oh? Well you take care on your way back.",
    "Hello. How can I help you?",
    "What do you want that for?",
    "Oh, he would go telling you that, the old duffer!",
    "There are some, but he doesn't understand that humans like you prefer running about and climbing over things instead of digging around.",
    "Yes, that sounds about right! He's always hated it ever since I managed to get from Rimmington to Taverley overground faster than he went underground! He tried going overground himself next time, slipped on some snow and ended up bashing his shoulder on a rock, bless him. Anyway, this survey. I can make a start on it after I get back from town. So you'll have to wait for me to be done with it.",
    "The survey we made is written in some very technical terms, and I'll need to dig out all the information for ya.",
    "Well I could, but I really need to get my climbing boots re-spiked. If I don't have that done I might run into trouble if the weather turns.",
    "That sounds like a pretty good idea! You're on. I'll make a start while you go take care of this little job for me. Just go and see Dunstan. He knows how I like them. Good smith, that man - for a human, obviously.",
    "In one of the houses to the east of Burthorpe castle. His is the one in the middle. In fact, it would probably be quicker if you used the home teleport spell. It saves you running all the way there and then all the way back.",
    "You're pretty eager! No, I've barely started on it.",
    "It'll be ready in its own time. Now, is there anything else you need?",
    "Oh? Well you take care on your way back.",
    "Aww, don't mope like that. They were old and ragged, that's why I wanted them repaired, remember?",
    "Here, go and take these ones into town instead. Just try and keep a better hold on them all right?",
    "What's that then?",
    "Not really.",
    "Not just yet. I need to polish it up a little. Have you got my boots?",
    "Aye, that sounds grand. I'll see you shortly.",
    "Aye, I just finished it about a minute before you walked in. You've got a good sense of timing.",
    "That's grand, I'll take them off your hands. Here's the report.",
    "Nah, you're alright. He'd not accept it anyway the stubborn goat that he is!",
    "Hello. Is that survey coming in handy?",
    "Aye? Well you have fun with that. Is there anything else you need?",
    "Did you lose it, after all that effort I went to?",
    "It's a good job I made a few extra copies, just in case you got hit by a troll or crushed in a landslide.",
    "Well, you can't be too careful.",
    "Hello there. Is that survey coming in handy?",
    "Lucky you! I wish I had a decent bit of mining to help me unwind. You have fun with that now! As for the survey, that was drawn by translating a stack of about two hundred pages of geological tests and observations. Och, you think we used a picture of the cave? Bless you! We spent a week tracing every strata in that place!",
    "Don't you worry about it. I know you human types do like your nice, simple solutions. But we dwarves do things thoroughly! Is there anything else you need?",
    "Hello there. Is that survey coming in handy?",
    "Oh, I'm so glad it turned out to be handy. You watch out for trolls!",
    "Is there anything else you need?"
  ],
  "Sabbot": [
    "Hello. What are you after?",
    "Ambush the trolls, eh? That's an idea. First good one I've heard the Guard have in a long while. But it's not my problem, so I suggest you take your fancy talk elsewhere!",
    "Well try not to get in me way, because I'm not going to help ya!",
    "Fine!",
    "Fine!",
    "You're really not goin' to move, are ya?",
    "All right. I'll help. If nothin' else I don't want ya standing there watching us while I sleep!",
    "Well if ya want up there you've got two choices. The first one is you can try the airy-fairy, lacklustre, shoddy way, clambering over the rocks like some cross-eyed goat! Faffing around like a fool, scramblin' about, hand o'er hand, foot o'er foot. Nobody's meant to get around like that, man! It's demeaning!",
    "Ah, the proper way. UNDER the rocks.",
    "Haddaway, man. The trolls might be thick, but they'll spot you carting rubble out by the ton. No, what you need is to break into one of the natural caves under here. That'll sort you out. Then you can enjoy the wonderful sport of cavin' and pot holin'. Ahh, the great feel of scrambling hand o'er foot through dark, dank passages...bliss!",
    "Well I didn't get much time to do anything but make some notes before the trolls came. I bet Freda had time to put them all together. She's a bit soft in the head from all her living on the surface, but still a canny lass when it comes to geology. You can't miss her place. It's a little house to the west of here. You just need to follow the only path in that direction and you'll get there. I don't know why she keeps to that place when we have a nice comfy cave right here we can turn into a proper home. It's you lot that I blame! All your gallivanting around on the surface has turned her head!",
    "Aye, see you later then. Watch your head on the way out, mind.",
    "Cave? CAVE? This is no cave, ya idiot! This is clearly the entrance hall to the trading post I'm gonna set up with me wife, once the trolls are gone. We're going to have some shelves over there, and put the store room over there...",
    "Aye? Well blame the missus for that! The second the trolls came along she packed all the tools up and moved into her fancy-dan little cottage. But not me. I'm not shifting for some stupid trolls. It's them or me, and I'm winning so far. One day they'll all be dead. Then I'll work this place into a proper little home and shop. Then who'll be laughing, eh?",
    "I heard that!",
    "No!",
    "No!",
    "NO! I don't need you, or yer fancy tools. I'm a dwarf! If I can't do it on me own then I might as well not bother! Do ye think I'd be stuck in this hole, fighting trolls with me bare hands and teeth, eating moss, and chipping the walls with a stone if I didn't think I could do it? These trolls aren't gonna beat me! I'm gonna outlast them, and when me wife comes to her senses she'll come back and we can set up together! Aye, we'll set up this little shop, just like we planned. And no trolls are gonna stop us.",
    "Oh, is it now? Well get yourself off then. Watch your head on the way out, mind.",
    "It's you again, eh? What ye after now?",
    "You can't miss her place. It's a little house to the west of here. You just need to follow the only path in that direction and you'll get there.",
    "Don't be daft, man. Do I look like I can just magic up a tunnel for ya?",
    "Well, I've been tryin' to work the place a little, you're right. But all I've got to work with is rocks. If I had some ores I'd be laughing mind, but there's none!",
    "No!",
    "No!",
    "NO! I don't need you, or yer fancy tools. I'm a dwarf! If I can't do it on me own then I might as well not bother! Do ye think I'd be stuck in this hole, fighting trolls with me bare hands and teeth, eating moss, and chipping the walls with a stone if I didn't think I could do it? These trolls aren't gonna beat me! I'm gonna outlast them, and when me wife comes to her senses she'll come back and we can set up together! Aye, we'll set up this little shop, just like we planned. And no trolls are gonna stop us.",
    "Oh, is it now? Well get yourself off then. Watch your head on the way out, mind.",
    "Oh? What's this? Looks like the wife's done a nice, simple version for you to follow.",
    "You humans...give it here! Uh...huh...I see... That's it. All ya need to do is dig over there. Looks like there is a weak point behind the rock that'll let you into the caverns.",
    "You want to get into that tunnel, you can make yer own hole. Just try not to get any rocks on me gear.",
    "Uh...just try not to make a mess!",
    "Hey! Watch it! You humans don't know how to mine cleanly at all, do ya?",
    "Excuses, excuses...",
    "Nope, I'm too busy.",
    "Well, now I've got this nice, new tunnel to work with, I've got to get me tools in order. That and I need to write to me wife, to tell her we can move in there and make a start on our little shop... Besides, that cave's nowt[sic] special. These caves are all the You'll need to clamber, jump and swing around until someone puts in stairs and the like. Potholing and caving is always pretty demanding work.",
    "Hey. Take these.",
    "Freda keeps sending us them. She knows I hate tomato! Those caves'll likely be dangerous, and even if ya make it to the other side you'll face some trolls. So, either I leave 'em to start stinkin' up the cave or you eat 'em. Either way is good with me!"
  ],
  "Dunstan": [
    "Hi! Did you want something?",
    "Really?  What boots?",
    "Maybe you should check with Freda if you don't know where you left them.",
    "Hey, these are Freda's boots. Where did you get them?",
    "Oh, I suppose so. There you go then, here are your boots.",
    "Hi! What can I do for you?",
    "Oh that's a laugh! Freda would tan your hide and use you as troll-bait if she found out!",
    "Here, have these ones. They are an old pair Freda left here a while back. I'm sure she won't notice.",
    "For you, no problem. You do realise you can only use the climbing boots right now? The spiked boots can only be used in the Icelands but no-one's been able to get there for years!",
    "Sorry, I'll need an iron bar to make the spikes. Anything else before I get on with my work?",
    "Anything else before I get on with my work?"
  ],
  "The Map": [
    "'ullo.",
    "'ullo.",
    "I's The Map.",
    "Yus. I's got the map, so me and me mates can hav a look around fer ways t' get down t' hooman town for the fightin'.",
    "Big boss made it. But den I ate it.",
    "Yus. Den the uvver trolls say mean fings. 'Lookit dis stoopid troll. He so stoopid he eats the map. Den dey all called me The Map from den on.",
    "Den, we's lost on dis slope. We's got no food. We's got no map. So...I ate everyone.",
    "Well dey was dead when I did it. So dat's okay.",
    "Yus. Some of dem try and pretend to be alive still, but I is smart troll. Dey no fool me.",
    "Hey, is you dead? Just checkin'.",
    "I's lost! Me and da lads, we was lookin' for a way down to hooman town. The boss, he say 'You, you carry dis map I's made and go down to fight'. Den, I eat the map. And all de uvvers get angry. And now I is lost...",
    "I eat you up!",
    "No! You is food! I eat you!",
    "I eat you up!"
  ],
  "Denulth": [
    "That went very well.",
    "When you're ready, those archers will need some crates delivering to them.",
    "We have a number of reward lamps for you if you want them."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Death_Plateau?oldid=35521095’"
  ]
}