{
  "This article or section requires a cleanup.Reason": [
    "Some style inconsistenciesIt does not meet the RuneScape Wiki's quality standards; you can edit this page to improve it."
  ],
  "Sir Tiffy Cashien": [
    "What ho, [sirrah/milady]. Jolly good show on the old training grounds thingy, what?",
    "Well, old [boy/gal], looking at the old dossier we have on you here there seems to be a tiny problem, what?",
    "Well, of course we have a dossier on you. We have a dossier on everyone! It's our job, dontchaknow!",
    "Well, now, it seems we made a tiny blunder when we first contacted you to join the Temple Knights, what? Entirely our own fault - could have been avoided and all that - but a bit of a show-stopper, what?",
    "Well, [lad/lass], here's the thing: Only members of the White Knights may join the Temple Knights. By ancient decree, dontchaknow.",
    "Calm yourself down, [lad/lass]. We have no intention of 'getting rid of you', we are very keen on seeing you join us.",
    "Well, it's like this: Although you have performed a mission on behalf of the White Knights, you were never actually working for them. As I say, when our order was founded, we were expected to take the best of the best, and it was assumed that anyone worth having on the team would have been a White Knight already, what?",
    "Well, it's like this: When our order was founded, we were expected to take the best of the best, and it was assumed that anyone worth having on the team would have been a White Knight already, what?",
    "Sadly, this is not the case anymore, and the fact that you have to serve as a squire to a White Knight for a minimum period of five years before you can actually become one tends to put off those adventurers with a short attention span, what?",
    "Haw, haw, haw! No, no, goodness me, no! Five years is a very long period of time, nowadays - anything could happen in that time, and we need capable [men/women] like yourself as soon as possible. No, I had a bit of a chat with Sir Vey and we came up with... a different solution to the problem. Assuming you're still interested, of course.",
    "Well, sorry to hear you say that old [boy/gal], but I can't hold it against you. You will of course still be entitled to all that we can provide you with at an initiate level, but sadly you will never advance beyond that in our order. Was there anything you wanted?",
    "Haw Haw Haw! I quite understand, what? No, don't worry, we were doing a little research into the White Knight Charter, and found an interesting loophole, what?",
    "Well, you don't need to worry about the details, you just do as I tell you and it will all work out for us both, what?",
    "Well now, it's really very simple. I want you to go to Sir Amik, tell him that you have decided to not join the Temple Knights, and that you have decided to become a White Knight instead. He will then offer you to join as a squire; You will then decline his offer, and ask if you can be deputised instead.",
    "If you run into any problems with that, come and see me.",
    "Many centuries ago, the founders of the White Knights realized that in times of crisis, a long waiting period for new Knights could be disastrous for the kingdom, so they added a clause to the founding charter that would allow any citizen who has performed an act in the name of the White Knight to become deputised on a purely temporary basis to a full-fledged White Knight.",
    "Ah, your curiosity does you credit old [boy/gal]! Let me tell you a little history lesson. Many centuries ago, the founders of the White Knights realised that in times of crisis, a long waiting period for new Knights could be disastrous for the kingdom, so they added a clause to the founding charter that would allow any noteworthy citizen to become deputised on a purely temporary basis to a full-fledged White Knight.",
    "Well now, your actions in the Black Knights' Fortress on behalf of the White Knights make you eligible to be deputised.",
    "Well now, any one of the various acts of heroism you've performed in service to the kingdom makes you eligible to be deputised.",
    "Besides, you passed the trials to become a Temple Knight, what? If you're good enough to join the elite, then we'd not hesitate to deputise you into the White Knights.",
    "Ah, well this is where the beauty of the plan lies, dontchaknow? Once you have been deputised, for the time that you are still working for their order, you are subject to all of the same rules and regulations that normal White Knights are, which means you are also eligible for battlefield promotions.",
    "Let me put it like this; As a deputy you will be considered the lowest possible rank of White Knight, and may be removed entirely from their order at a whim. However, should you achieve some great feat while serving as a White Knight that you would be eligible for a promotion from, then by their own rules you would then have to be raised to a higher level within their order, and it would therefore become impossible to remove your rank, or make you no longer a deputy.",
    "Indeed. We Temple Knights have our reputation for a reason, dontchaknow?",
    "Ah, do not concern yourself with THAT old [boy/gal]; Crisis is such a subjective term, and as you will find out when you join us fully in the Temple Knights, there is always some potential crisis or other brewing. If we weren't as good at our jobs as we were, almost every day would be a day of crisis! All we really need to do is allow the old White Knights to handle a problem that we would normally deal with, and that should be a sufficient crisis to allow you to be deputised, dontchaknow.",
    "Haw Haw Haw! No, not at all, this is merely a ruse; Sir Amik knows full well that his authority over our organisation is limited, so he will not deputise you unless he thinks that you are entirely unaffiliated with us. You are simply going to tell him that you have decided not to join us so that he will in turn deputise you to join the White Knights! We of course still want you to join us, it is just a little... misdirection.",
    "You are to go to Sir Amik Varze, leader of the White Knights of Falador, and are to tell him that you have decided not to join the Temple Knights. We will send him a messenger confirming this. He will offer you the opportunity to become his squire, you are to decline, and ask if you can be deputised instead. If you run into any problems with that, you are then to come and see me for further advice. Understood?",
    "...What? I told you to decline!",
    "*sigh* This is a less than illustrious start to your career with us Player. Never mind, all is not lost, I have sent word to Amik that a dangerous criminal we once thought exiled is on the loose again, and that he should send all available White Knights to confront him. This should give him enough of a scare to deputise you immediately. Go and speak to Amik again, and then immediately come back here, we will need to prepare you for your mission.",
    "Haw Haw Haw, fitting right in with the Temple Knight way of thinking, what? Well as a matter of fact, I will not have to organise anything, there is a particularly vicious and dangerous criminal currently at loose! I have already notified Sir Amik through the usual channels, so just go and speak to him quickly, then pop back here and we'll get you equipped for the hunt, what?",
    "Ah, yes, well most awfully sorry about all the running around you've been doing old bean, but when it comes to our line of work, sometimes the indirect route is the best, what?",
    "Awfully sorry dear heart, it's just a term of affection, what? Anyway... The criminal is a very dangerous fellow, and has some very dangerous friends. If he has no reason to suspect you to be working for us, then he will be a little sloppier than he otherwise might be, because he will assume you to be one of those stupid white knights. We want this man caught, for the good of the country, and if we need to fool a few people into thinking you're nothing to do with us, and you have to do a little extra walking, then that's what is going to happen, what?",
    "Go and report to Sir Amik for 'orders'. You will be unsurprised to find out he will now be prepared to deputise you. After you have spoken to him return here immediately, your life will be at risk without our assistance, and we don't want you dying on your first mission for us, what?",
    "His name is Solus Dellagar, and honestly, he is one of the most dangerous men on the planet. Not only is he extremely adept at magic, he is also quite prepared to use that magic at a moments notice, because he is quite, quite mad.",
    "No, no, no. Listen to me boy; You are under NO CIRCUMSTANCES to engage him directly in combat! You are to act as our agent and track him down, when you have managed to corner him somewhere then we will send in a field recovery team directly to take him away without incident. I cannot stress this enough; You are to observe and locate, you are NOT to enter a combat situation!",
    "Well old boy, we will need to equip you for the task, but you'll need to get something for me first, what?",
    "Well, we teach our operatives the value of their equipment by making them pay for it, what? You have two choices here, you can either give me cash directly, and I will hand it over, or you can bring me the raw materials and I will make you one.",
    "Well we in the Temple Knights have some specific equipment for situations such as this dontchaknow, but you'll need to free up some inventory space first!",
    "It's 10,000 coins for the Temple Knight Communication Orb. You have that kind of money with you?",
    "Then you wish to purchase a Temple Knight Communication Orb?",
    "As you wish, what?",
    "It's 10,000 coins for the Temple Knight Communication Orb. You have that kind of money with you?",
    "Perhaps you would like to just bring me the components of it then, what?",
    "Bring me one law rune, one slayer gem and one piece of molten glass and I will make you a Communication Orb.",
    "Heavens, boy! I am not a pawn shop, to be holding bits and pieces for you while you go off and do something else!",
    "No, no you bring me all three components at the same time, what?",
    "It's 10,000 coins for the Temple Knight Communication You have that kind of money with you?",
    "Perhaps you would like to just bring me the components of it then, what?",
    "Bring me one Law Rune, one Slayer Gem and one piece of Molten Glass and I will make you a Communication Orb.",
    "Heavens, boy! I am not a pawn shop, to be holding bits and pieces for you while you go off and do something else! No, no you bring me all three components at the same time, what?",
    "Excellent! You wish me to make you one now then, what?",
    "Here, take this Communications Orb, or 'CommOrb' for short. It is a precise magical mechanism that we can use to track him, by sending data of the surrounding area back to one of our information operatives at the Temple Knight headquarters. Your information operative is known as Savant, I suggest you contact them using your CommOrb at your earliest convenience. They will be able to send you any useful data about Solus directly through it for your perusal, dontchaknow.",
    "As you wish, what?",
    "Bringing me either cash or items so that I can equip you for your mission correctly.",
    "You are hunting for Solus Dellagar, the evil criminal mastermind. I suggest you contact Savant through your CommOrb and see if she can send you any relevant information about your assignment.",
    "Liase with Savant about the best way to track Solus, what? And... good luck.",
    "Had a little help doing it though, didn't you, what?",
    "Haw Haw Haw! That you did Initiate, that you did. Now take that hat of Solus over to Sir Amik, and we can begin to process your application form as a Temple Knight again, what?"
  ],
  "Player": [
    "Do you have any quests for a hard-working adventurer?",
    "Problem? What problem? Er... and you have a dossier on me?",
    "Um, okay... So what's the problem?",
    "What is?",
    "What? But I am a member of the White Knights! I went and did that stuff with the cabbage and the potion! And I've already done your stupid little mind test thing! You can't get rid of me that easily!",
    "What? But I've already done your stupid little mind test thing! You can't get rid of me that easily!",
    "Then what's the problem?",
    "You want me to be a squire for five years?",
    "No, to be honest I'm getting sick of all these excuses and procrastination. Plus being an inititiate was nowhere near as fun as I thought it would be. I'd rather just go off by myself and kill stuff for cash.",
    "I'm still up for joining the Temple Knights, I just don't really feel like spending five years running around shining peoples boots for them.",
    "Loophole? What kind of loophole?",
    "I guess... I don't really like blindly following orders though...",
    "So what exactly do you want me to do?",
    "Okaaaay....",
    "I don't exactly understand how that will help me become a White Knight...",
    "So how does that affect me?",
    "But if deputisation's only temporary, and I have to be a 'proper' White Knight to then become a Temple Knight, doesn't that mean that I am still going to have to squire for Amik for five years?",
    "I... don't understand...",
    "So I get to be a White Knight without having to do five years of pointless busywork?",
    "Okay, I guess that makes sense... But we're not in a time of crisis, so doesn't that mean I won't actually get deputised?",
    "Do I really need to quit the Temple Knights? You seem pretty cool, and I really like the armour...",
    "What am I supposed to be doing again?",
    "Um, yeah, I think so...",
    "Got any jobs for me to do today?",
    "Aaaaawwwww...",
    "Can I just stop you right there? I am no longer a member of the Temple Knights, I have entirely renounced my application because after many hours of soul searching I have come to the conclusion that I desperately want to become a White Knight instead!",
    "That is correct, yes.",
    "So? Did you hear me bad mouth their armour? The armour is cool, I keep the armour!",
    "Absolutely! And this is definitely not some kind of elaborate hoax to get my application processed faster.",
    "No... Not if you didn't hear it...",
    "So what exactly does being a squire consist of, then?",
    "So... No killing stuff for you, or anything fun like that...?",
    "Well, erm...",
    "Yes please! I would LOVE to be your squire! Wait... Didn't Sir Tiffy tell me to decline...? Nah, Squire me up, Amik!",
    "Um... As tempting an offer as that sounds Sir Amik, I am really not a fan of waiting around... Now I heard from some completely random stranger that was definitely not Sir Tiffy Cashien as part of an elaborate ruse to fast track my application into the White Knights, that I could be deputised directly as a White Knight, and entirely bypass that while boring waiting for five year thing...",
    "Right. Well, Can I do that instead?",
    "All is well huh? I'll be right back, I just have to go ask... nobody in particular if they can organise...nothing at all to happen.",
    "So do you have any squiring for me today Amik?",
    "Okay boss.",
    "Gotcha, boss.",
    "Hi boss.",
    "Sure thing, boss. I brought you a beer.",
    "Anything else you want boss?",
    "Sure thing boss!",
    "I did it Tiffy! I became Sir Amik's squire! That means in just five short years I can be a White Knight!",
    "Yeeeesssssss.... But I thought it would be more fun to do this?",
    "Hello again Tiffy. I've just spoken to Amik, and he says he's fine for me to be deputised as a White Knight, there just needs to be a crisis first. I assume you can arrange a small crisis for me?",
    "You know...Is all this back and forth strictly necessary? I don't mean to sound ungrateful for the help you're giving me here, but you could have just got this sorted out before sending me off there in the first place!",
    "I don't understand...? And stop calling me bean! I am not a vegetable, I am a human bean, er, being!",
    "I guess... But this spy stuff is a lot more boring than it sounded at first...",
    "Hi Tiffy. What am I supposed to be doing again?",
    "Solus Dellagar? Who - or what - is that?",
    "Exiled? Why didn't you just kill him? Or, you know, imprison him or whatever?",
    "So if you can't imprison him, and exile obviously didn't work, you want me to kill him?",
    "Oh yes. You've made yourself very clear.",
    "So what will I get if I help you out against this, er, solus doolalala guy then?",
    "Yes, yes I see. So... No monetary compensation or other actual reward then?",
    "So I don't actually get anything out of this then?",
    "But you can't buy things with a warm glow...",
    "Hey, there's nothing I like more than fighting! Deputise me up, and I'll go get this guy for you!",
    "So where should I start looking for this Solus guy anyway?",
    "A scary mage huh? Sounds like I could get KILLED! Forget that, and forget you! No way am I risking my neck unless there's a big fat reward on the table for it! And sometimes not even then...",
    "Tiffy, it worked exactly to plan! Sir Amik deputised me to take care of this Solus Doolally dude, so let's go get him!",
    "So... Dragonhide armour and an elemental shield and I'm laughing?",
    "Riiiiight... So I'm just going to scout him out for you then. Any tips on how to find him?",
    "What kind of stuff?",
    "Oh yeah, I got your money.",
    "Yes",
    "No",
    "Actually, no thanks.",
    "I don't have that kind of money with me...",
    "Can I give you the components I have with me now?",
    "Okay Tiffy.",
    "I don't have that kind of money with me...",
    "Can I give you the components I have with me now?",
    "Okay Tiffy.",
    "I have all three components for you to make me a Communication Orb out of now Tiffy.",
    "Okay, thanks Tiffy!",
    "Actually, no thanks.",
    "Hi Tiffy. What am I supposed to be doing again?",
    "Hi Tiffy. What am I supposed to be doing again?",
    "Hi Tiffy. What am I supposed to be doing again?",
    "Hello...?",
    "Yeah, it must be very useful.",
    "Hi Savant! I was wondering if you could give me details on my current assignment?",
    "Oh yeah! So any information you can give me?",
    "So, how would you suggest I go about finding him?",
    "So I have to just wander around the place looking for him?",
    "Who are these people then?",
    "So where would I find this Lord Daquarius?",
    "And what is Record 2 about?",
    "Thanks Savant!",
    "So... Savant... That's an unusual name...",
    "So what exactly do you do for the Temple Knights?",
    "S.M.R? What's that?",
    "Your opponents?",
    "So how did you end up working for the Temple Knights? I would have thought someone like you would have ended up researching at the Wizards' Tower or something instead...",
    "Ok, thanks Savant, that was very interesting.",
    "Hi Savant. I was just wondering if you could give me a little information about the Temple Knights? I've just realised that I really don't know very much about them...",
    "Well, that's better than nothing right?",
    "Okay, thanks Savant.",
    "Nothing thanks Savant, I was just checking this thing still worked!",
    "Okay Savant, will do.",
    "Hi Savant! Any ideas on how I should track down Solus?",
    "Okay, thanks Savant.",
    "Hello.",
    "I am here on behalf of the White Knights...",
    "Now wait a minute, this concerns a friend of yours...",
    "Bingo.",
    "So you will help me find him?",
    "You know... I'm sure I could MAKE you tell me where he is...",
    "Understood. Player out.",
    "Hello.",
    "I still want to know the whereabouts of Solus Dellagar!",
    "Hello.",
    "Okay Daquarius, you tell me the whereabouts of Solus Dellagar right now, or I will put every Black Knight here to their death in front of you!",
    "What kind of fur? Dog? Bear? Wolf?",
    "That's it? That's your help? You'd better not be lying Daquarius, or...",
    "How do you know?",
    "So this CommOrb thing can work as a lie-detector? That's pretty useful!",
    "You mean that Zamorakian mage in Varrock?",
    "Hello.",
    "Okay Daquarius, tell me all that you know of Solus, or I will kill some more Black Knights!",
    "I am looking for information about a very dangerous man... I believe he visited you quite recently.",
    "Yes, him. I need to find him and make sure he doesn't come back to these lands.",
    "Sorry, I cannot trade you my Communications Orb...",
    "Then perhaps you will be willing to trade something else for your information...?",
    "You mean Solus robbed you of all of your money?",
    "You want me to pay you for information?",
    "Okay, I'll see what I can do.",
    "So you have information about the whereabouts of Solus Dellagar?",
    "Okay, I'll go get those for you then.",
    "I have some essences with me, if you would take those...?",
    "Okay, I'll go get those for you then.",
    "I have your essences right here, take them.",
    "Okay, now you have your essence, give me my information.",
    "Get on with it, I haven't got all day to waste.",
    "He went East. That's it? That's your 'information'?",
    "Hmmm. Wolf fur... and the East... I know where he is.",
    "He will be in Canifis. He must be.",
    "Any signs?",
    "What's wrong?",
    "Well, that Zamorakian mage mentioned that he had a strong magical aura, perhaps that is it?",
    "Savant...?",
    "How is teleporting really slowly particularly useful?",
    "I'm... not sure I follow...",
    "But you abandoned this research? Why?",
    "Er... That doesn't sound good...",
    "But this signature you are finding is the same as this 'slow-teleport' experiment created?",
    "Well, I can see how that might be a cause for concern, but right now our priority is Solus, right?",
    "Because he is invisible and in three separate places simultaneously?",
    "Well, we have nothing else to try, right? What will I have to do?",
    "So I should try a scan here in Canifis?",
    "So what can we do now?",
    "What does that mean?",
    "Well what are you waiting for? Try and get it!",
    "I doubt he's getting drunk in hiding...",
    "So he is improving his dress sense you think?",
    "Why on gielinor would he be wearing those?",
    "Goblin armour? Why would he wear that?",
    "What the...? You think he is in disguise somewhere?",
    "Fur? How does that help us find him?",
    "Do you think he might be injured?",
    "How does a hat help us?",
    "I am sure I have seen tickets like that somewhere before...",
    "Very stylish, but it doesn't seem to be his colour.",
    "What a weird thing to be carrying...",
    "The frog those came from must be huge!",
    "The symbol of Zamorak? That tells us nothing.",
    "Maybe he's doing a little fishing?",
    "Okay I'll head off immediately. Let's hope we're not too late.",
    "Solus! I am here by authority of the White Knights of Falador!",
    "That doesn't matter right now Savant, did you get a reading of where his teleport was coming from?",
    "Well?",
    "More than you might think Savant. This type of cape used to be called the Cape of Champions...",
    "*cough* Savant? *cough* I can't... *cough*",
    "He threw some kind of smoke at me or something...",
    "I doubt he's getting drunk in hiding...",
    "So he is improving his dress sense you think?",
    "Why on gielinor would he be wearing those?",
    "Goblin armour? Why would he wear that?",
    "What the...? You think he is in disguise somewhere?",
    "Fur? How does that help us find him?",
    "Do you think he might be injured?",
    "How does a hat help us?",
    "I am sure I have seen tickets like that somewhere before...",
    "Very stylish, but it doesn't seem to be his colour.",
    "What a weird thing to be carrying...",
    "The frog those came from must be huge!",
    "The symbol of Zamorak? That tells us nothing.",
    "Maybe he's doing a little fishing?",
    "Okay, I'm on my way. This Solus guy is really beginning to get on my nerves!",
    "You can't threaten me old man...",
    "Dead or alive, you're coming with me.",
    "Ow! What happened?",
    "I don't understand though Savant, you said he could only be in a few places simultaneously...",
    "But he keeps getting away! And he keeps moving around!",
    "So he isn't going to shoot me like that again?",
    "You're right about that, there's no way I'm letting him get away with treating me like that!",
    "So did we get any clues to his real location from that last scan?",
    "I recognise that...",
    "It's the type of spear used by the Dorgeshuun goblins.",
    "Okay Savant, I'll heal up, then go looking for him amongst the Dorgeshuun.",
    "W-what? Who are you?",
    "Oooohhhh...",
    "Did anyone get the number of that wagon?",
    "Please tell me you have a reading on his actual location by now, this chasing him around the houses is becoming irritating...",
    "Uh... Out of interest, what am I going to do with an insane super-powerful murderous mage when he's cornered?",
    "Well okay then, where should I head now?",
    "I doubt he's getting drunk in hiding...",
    "So he is improving his dress sense you think?",
    "Why on gielinor would he be wearing those?",
    "Goblin armour? Why would he wear that?",
    "What the...? You think he is in disguise somewhere?",
    "Fur? How does that help us find him?",
    "Do you think he might be injured?",
    "How does a hat help us?",
    "I am sure I have seen tickets like that somewhere before...",
    "Very stylish, but it doesn't seem to be his colour.",
    "What a weird thing to be carrying...",
    "The frog those came from must be huge!",
    "The symbol of Zamorak? That tells us nothing.",
    "Maybe he's doing a little fishing?",
    "Okay, I'm on my way – and Solus had better watch out, I am up to here with his annoying tricks!",
    "I am here to take you in Solus. You can forget your little tricks.",
    "Yeah it is, which means I know where he is, and how to get there!",
    "It's a mine for Rune Essence, but there are only supposed to be a few people who know how to get there...",
    "Agreed.",
    "In the name of the White Knights of Falador, and of the Temple Knights of Saradomin, I am placing you under arrest!",
    "Hi Savant. Where am I supposed to be looking for Solus again?",
    "But I lost his hat...",
    "I did it Tiffy! I brought Solus in for capture!",
    "Yes... But I did all the legwork...",
    "Okay Tiffy, I'll be back in a jiffy!",
    "But... I've already done that!",
    "Well of course I do! I mean I did...Look, I lost it okay? Stop hassling me!",
    "Oh man...I think I've messed up...Maybe Savant can help me out somehow? I'd better speak to her.",
    "Well of course I do! I just happened to think it would be a good idea to leave it in the bank for safe keeping.",
    "Well of course I do! I have it right here!",
    "Okay Amik, thanks for explaining!"
  ],
  "Sir Amik Varze": [
    "Well, I did have something you may have been interested in, but I've been given orders not to approach you for trivial matters now that you are a member of the Temple Knights.",
    "Well, I did have something you may have been interested in, but I've been given orders not to-",
    "You don't want to be a Temple Knight anymore?",
    "But you are wearing their armour!",
    "I'm not sure I understand... You wish to desert the Temple Knights in favour of my own humble White Knights?",
    "I'm sorry, did you say something just then?",
    "...Well anyway, for the fine work you achieved at that incident in the Black Knights Fortress, I would be honoured to accept you as my squire.",
    "... Well anyway, I would be honoured to accept you as my Squire.",
    "What do you say?",
    "You will spend the next five years of your life running various errands for me. If I consider you to have done a more than adequate job of this, then I will begin to consider possibly moving your name forwards to becoming a full-fledged member of the Order of the White Knights.",
    "Not as such, no. Unless you consider killing time by running errands fun...?",
    "So what say you Player? Spend five long years of your life doing pointless busywork without pay for me, on the off chance that at some point in the future I may put your name forward as a novice White Knight?",
    "As you wish, from this day forth you are my Squire!",
    "That is entirely correct Player, but I have no idea where you might have heard that for it is a secret guarded only to members of our order!",
    "Well, a fine adventurer would be a perfect candidate as a deputy in my eyes, but fortunately this can only be done in a time of crisis, and all is currently well.",
    "You are a strange one Player...",
    "Yes, yes in fact I do. I would like you to bring me an Asgarnian Ale. No matured Ale, no other brand, simply an Asgarnian Ale.",
    "That is 'Sir Amik' or 'My Liege' - not 'Boss'.",
    "Call me Sir Amik, or liege.",
    "Well, another Asgarnian Ale would be greatly appreciated. And stop calling me Boss.",
    "Thank Saradomin you have come back here! We have received word from one of our scouts that the evil Solus Dellagar has returned to Asgarnia! What is worse, it seems he is in possession of dangerous new magics that we are powerless against! Please, I implore you in the name of all that is holy, assist us in banishing him from our kingdom once more! I cannot bear to think of the troubles he may bring us...",
    "You have not heard of the infamous murder-mage? He terrorised these lands many years past, thinking himself above the law with his powerful enchantments, but the White Knights finally managed to bring him to justice and he was permanently exiled.",
    "Kill an unarmed foe? That is not the way of Saradomin, nor of the White Knights. As for imprisonment... Solus is a highly dangerous man not just because of his mastery of the magical arts, but for his uncanny resourcefulness. To tell you the truth, I fear that I would be unable to guarantee his captivity in any holding cell belonging to us...",
    "I did not say that. I did not say that at all. That is against all of our codes of honour. However, should you find yourself in combat with him, and there is no other way, then perhaps for him to die would be best for us all. You understand me, Player?",
    "So will you aid us in this fight?",
    "Why, you will help keep Asgarnia free of malicious influence, and perform a good deed in the name of King Vallance and of the White Knights!",
    "As Saradomin has told us, 'a good deed is its own reward'.",
    "Nothing tangible, no, but you will be deputised to act as a White Knight, and you will feel a warm glow inside of having done the right thing.",
    "So what say you Player? Fight with honour in the name of the White Knights against the terrible Solus?",
    "Very well then; In the name of King Vallance, and for the honour of Saradomin, I now pronounce you a fully deputised White Knight. May honour and glory follow you in every action.",
    "I haven't the faintest idea. Good luck!",
    "It is a tragedy to hear you speak so, but we must trust in our valour and the wisdom of Saradomin to protect us from this evil man if we cannot enlist help against him.",
    "You are supposed to be looking for Solus Dellagar! The insane magician who is loose once more upon these lands? Remember?",
    "You have??? Then you must have some proof of your encounter! A weapon perhaps, or an item of clothing?",
    "Look, I am very sorry Player, but if you have no proof of your encounter, I can hardly promote you to be a full White Knight, now can I?",
    "Well bring it here so that I can authenticate your claim and make you a White Knight!",
    "Well hand it over then, and let's see it!",
    "Now that you are a White Knight I should perhaps explain a little about how our system works. Sadly we are not as rich as we once were, and there are many White Knights who foolishly lose their combat equipment. We do not think it fair to make a profit from our brethren, so we will sell you equipment at cost, and rebuy it at the same cost, but we will only sell equipment to those we consider responsible enough to wield it correctly. By killing Black Knights, you will increase your reputation with us, by killing White Knights we will obviously think less of you. You can check your White Knight reputation level by looking at your quest journal for the Wanted! Quest, or Sir Vyvin will let you know what level you are at when you go to purchase equipment. Sir Vyvin can be found in Falador Castle, and he will sell you any equipment appropriate to your reputation level. Have fun, and go kill some Black Knights for me!"
  ],
  "Savant": [
    "Well, hello! You must be Player? Sir Tiffy told me to expect you to call in on this frequency! So what do you think? Pretty nifty little piece of kit this crystal, huh?",
    "Oh, trust me you'll find out exactly how useful! Now, was there something you wanted?",
    "Okaaaaay... Bringing up your current assignment details... Oh! You're chasing Solus Dellagar?",
    "Listen Player. Solus is an incredibly dangerous criminal, and I don't think his grasp on reality is too tight, if you understand what I'm saying. You really need to take care with this one. I'm amazed you got an assignment as tough as this one as a first assignment to be honest!",
    "Well, this CommOrb can use the scan function to find him, but its range is very limited.",
    "No, that would take far too long... Listen, I am going to transfer all information on Solus that we currently have to your CommOrb. You should be able to find a hint of where to find him by examining it. The Library tells me that we have two visual recordings from SpyOrbs available to you, as well as a standard dossier. I would suggest the people that the SpyOrbs were observing, when they picked up records of Solus, would be a good place to start your investigation.",
    "Okay, just checking now... Record one is from a routine monitoring of Lord Daquarius. In case you haven't heard of him, he is the leader of the Kinshra, also known as the Black Knights. As a major enemy of the White Knights we have had him under observation for some time now, so it was pretty lucky that Solus decided to visit him.",
    "He has a secret Black Knight training ground deep in the heart of Taverley dungeon, along with holding facilities for prisoners who they wish to interrogate later. He is almost certain to be found thereabouts.",
    "Just checking... Ah yes. This shady fellow is a member of the Zamorakian Magical Institute. We suspect them to be the group responsible for destroying the Wizards Tower all of those years ago, as well as other more recent acts of sabotage. We also suspect that they have been responsible for a number of thefts of a mysterious rock that the Wizards Tower has started producing, but don't have much intelligence about that. We set up an observation SpyOrb in a known Zamorakian shrine in south-east Varrock, but he moves between there and the wilderness just north of Edgeville quite frequently. He doesn't seem much of a threat, but we placed him under observation anyway, which seems to have paid off by getting some more information about Solus. From the look of the record, he would be worth talking to as well.",
    "Any time, Player. Over and out.",
    "Well, obviously it's not my real name! My real name is Elyssa Van Lendes, but for operational purposes I am called Savant.",
    "I am the S.M.R and Chief Librarian for the Temple Knights.",
    "It stands for Senior Mystical Researcher. The Temple Knights have a world class research team investigating new types of magic constantly. As senior researcher, and field liaison, I can pass on information to the rest of the Temple Knights. Many of the devices used by the Temple Knights such as our CommOrbs and SpyOrbs were first designed by my team as experimental devices, and have since become standard field equipment! I have always had a gift for magic, and have spent most of my life trying to find applications for it that would serve our order and give us an edge over our opponents.",
    "Oh yes, don't think for a second that we are the only secret organisation in Gielinor! There are many factions in these lands, some almost as magically advanced and organised as ourselves! It is a constant struggle to keep our operatives with advanced magical equipment that our opponents don't have - this is why we have the self-destruct safeguards, to prevent our equipment ever falling into unfriendly hands.",
    "Oh yes... The Wizards' Tower... Let me tell you something, the mages who work there are idiots! They told me that magical research wasn't suitable for 'just a girl' and that I would be 'too scared' to research for them effectively! Luckily the Temple Knights are far more open minded about things, and I really feel like my work is making a difference to them!",
    "Hey, we're all Temple Knights here, right? Glad I could help, Player Savant over and out.[sic]",
    "Well, you are not yet officially a full fledged Temple Knight now, are you Initiate Player? I am afraid that means for security reasons I can only give you a brief overview of the organisation...",
    "That is usually the case, yes, I agree. Well, let's see if I remember how this goes... 'Legends tell us that Lord Saradomin once walked these lands amongst us, and delivered his wisdom unto us personally, so that we could grow wise in his honour. But then came the war, that shattered our lands, and the interloper banished our land from us! But the wisdom of Saradomin knew that such events might occur, and he laid plans in secret amongst his most devout followers! Those warriors whose hearts were as pure as their minds were sharp were called to him, and were made into his Temple Knights, for they were the Knights that guarded his very first Temple. All who dwelled in his lands knew that the Temple Knights were the honoured, the blessed, the personally chosen warriors of Saradomin, and thus were they given great freedom and authority in all of our Lords lands. But with Saradomin no longer with us, the Temple Knights were no longer honoured and respected by all! Rather, they were made targets by Saradomins[sic] enemies, and driven from the lands unjustly! Thus it was that they became a secret force, hidden from the eyes of Saradomins[sic] enemies, that could strike against evil in his name swiftly and quietly whenever they may be needed.' Something like that I think, it's been a long time since I heard it last...",
    "You shouldn't really waste my time like this, Player... Still no harm done, I guess! Call me if you need me!",
    "Savant out.",
    "Hello there Player. What can I help you with?",
    "Yes, you should investigate the two people in the observation records I sent you! Record 1 shows Lord Daquarius in his lair in Taverley Dungeon and Record 2 is some Zamorakian mage that runs a rune-smuggling business between the wilderness north of Edgeville and Varrock. They are the last known people to have seen Solus, so they must have some information about where he is hiding out!",
    "Our observation records are classified, you can't go viewing them in unsecure areas. I recommend you secure youself within the White Knights' Castle if you want to watch it.",
    "Player? I've been monitoring you. He's telling the truth, so don't try to bluff him by starting a fight. All of our records show that the only thing he will make a stand for is the protection of his men, and he has little regard for his own safety in comparison. You're going to have to find some other way to intimidate him into giving you the information we need.",
    "Calm yourself Player, he is telling the truth.",
    "I am monitoring your conversation through the CommOrb, his physiology shows none of the changes we usually get when someone lies to us.",
    "Yes, it is, but back to the task at hand. I suggest you head to the next subject of our observations, he might be more help in locating Solus.",
    "Yes, he would seem a likely bet. Savant out.",
    "Player, I've been monitoring your conversation; You can't let him have Temple Knight equipment, he is a Zamorakian! Even if we wanted to let the ZMI have access to our research, the built in security magics would destroy it before trading anyway!",
    "Hi Player, it sounds like a pretty good deal for this kind of information to me, but it's your call. We REALLY need to find Solus as soon as possible though, who knows what kind of damage he might cause now he is at large again!",
    "Okay, so Daquarius told us he was probably somewhere with furry animals of some kind, and this mage has told us that he is East of here... Any ideas? Frankly, I'm stumped. I just don't have enough information to work out where he might be...",
    "You do?",
    "Wow, that's some good thinking Player! Okay, let's head there and get him!",
    "Okay Player, I'm going to begin a low level scan for Solus now...",
    "Hmmm... These readings are very strange... There's... SOMETHING here... You know, I'm sure I've seen readings like this somewhere before...",
    "Just give me a minute to cross reference the records in the Library, I KNOW that I've seen readings like this before... GAH! This is infuriating! It's on the tip of my tongue...",
    "No... no, it is something... Oh my! I know what it is!",
    "Many years ago the Temple Knights were studying teleportation techniques, and found a strange dimension that was accessed when teleporting.. We stopped the research as it was too dangerous to be practically useful, but our initial studies showed that we could use the entire dimension as a kind of scrying glass to see a precise point where we wished to teleport to, then teleport extremely slowly between two points.",
    "Well, basically, you are stretched so thinly between dimensions that you effectively become invisible! From your perspective you can see three places simultaneously, and can choose to move between all three at will!",
    "Let me give you an example: If you were in Falador castle, and you wished to teleport to Varrock, then you could use this 'slow-teleport' technique to be in both places simultaneously, but invisible to anyone in either. You could also move freely between the two invisibly and then choose which place you wished to end up, simply by concentrating on the location you wanted to appear in. Needless to say, in our line of work this could come in very handy for sneaking around unobserved...",
    "It is far too dangerous. In my example I only used two places, but in practice there is a third place involved. It is a strange, empty dimension that teleports seem to pass through. Frankly, the human mind isn't equipped to cope with processing so much information simultaneously, and the test subjects started to display... behavioural problems...",
    "No, it wasn't: Aggressiveness was highly increased, and there were numerous perceptual faults, hallucinations and the like. We ceased experimentation immediately, there are enough things in this world to haunt a Temple Knight, we did not see the need to create anymore.",
    "No... it is not exactly the same... But it is close enough to be a cause of concern. Either someone else has found this strange dimension and begun their own research, and reached the same conclusions that we did... Or... We have had a security leak within the Temple Knights and abandoned research has been sold to our enemies!",
    "Yes Player, you're right. But if he is using this 'slow-teleport' technique, then that means it is going to be a lot harder to catch him!",
    "Exactly. Listen, I might be able to block his teleportation magics using your CommOrb, but I will need you to get close to him, and if we're unlucky then he will end up teleporting to the point away from you instead of appearing in front of you.",
    "Use the 'Scan' function of your CommOrb, if he is in the vicinity it should knock him out of his 'in-between' state, and make him appear.",
    "That would seem best... Savant over and out.",
    "There doesn't seem to be anything unusual about these readings Player... Looks like your hunch was wrong. Savant out.",
    "Negative result, Player. Looks like you're barking up the wrong tree. Savant out.",
    "Scan results are negative, Player. Savant out.",
    "Background magical levels all seem within normal tolerable limits Player... I don't think this can be the right place... Savant out.",
    "Checking incoming data... Nope, all clear here. Savant out.",
    "Nope... I'm not picking up anything unusual near here... Savant out.",
    "Analysis is negative I'm afraid, Player. Savant out.",
    "The background magical levels are slightly above average here, but not enough to signify anything. I think you're in the wrong place. Savant out.",
    "I think you're in the wrong place. Savant out.",
    "Not picking up any unusual readings here, Player... Savant out.",
    "Results are all-clear Player. Savant out.",
    "Argh! He got away...",
    "Wait a second...",
    "There was another item in the teleport with him...",
    "Well, I might be able to retrieve it from the slow-teleport!",
    "It might give us a clue as to the second location Solus is in!",
    "It's a beer?",
    "That type of beer is only sold in one place that I know of",
    "It's...a wizard hat?",
    "I think it's more likely he happens to be in an area where there are many wizards around.",
    "It's... ear muffs?",
    "Well, they are standard equipment for any slayer looking to kill Banshees...",
    "It's... goblin armour?",
    "Well, it must be a place here there is a lot of it around for it to have been caught in his teleport...",
    "It's...a fake beard?",
    "I've seen this design of beard before... But I cannot remember where...",
    "It's... fur?",
    "Well, this is not fur directly from an animal, look it has been prepared for sale...",
    "It's... an eye patch?",
    "No, I think he must be somewhere where there are a lot of people who wear eye patches...",
    "It's... a hat?",
    "I'm sorry, I don't know. Maybe somewhere where hats like this are common?",
    "It's... a ticket?",
    "Well, wherever it is that you have seen them, I would guess he is nearby!",
    "It's... a cloak?",
    "I don't think he would have been wearing it... But he might be nearby somewhere that sells this type of cloak.",
    "It's... a toy horse?",
    "Well Player, bear in mind that it might just be an object that as in the vicinity rather than something he was carrying...",
    "It's... some big frogs legs?",
    "I have heard rumours of giant frogs in a subterranean area...",
    "It's... an unholy symbol!",
    "Yes, sadly there are many Zamorakians in these lands...But it must be somewhere of special significance...",
    "It's... a worm?",
    "No, this is a very specific worm, that is only found in one place.",
    "Player, I want you to search for him, and use your CommOrb to scan for him if you think he is nearby!",
    "Okay, I am attempting to block his teleport...",
    "Argh!",
    "I should have known he would try something like that!",
    "I'm sorry Player, I should have stopped him using that spell...",
    "The spell is still running, wait a moment... There!",
    "It's a cape...",
    "I'm not sure how much help in tracking him that is.",
    "Well I still don't know what help that is, but if you have an idea where he might be you should head there immediately.",
    "Don't worry about It Player, he may have escaped AGAIN, but I still have him on my tracking spell...",
    "Okay, the smoke's cleared, and you don't seem to have been damaged by it!",
    "You're lucky I think, reading show it was highly poisonous!",
    "Let's see if I grabbed anything useful from him while he was teleporting...",
    "It's a beer?",
    "That type of beer is only sold in one place that I know of",
    "It's...a wizard hat?",
    "I think it's more likely he happens to be in an area where there are many wizards around.",
    "It's... ear muffs?",
    "Well, they are standard equipment for any slayer looking to kill Banshees...",
    "It's... goblin armour?",
    "Well, it must be a place here there is a lot of it around for it to have been caught in his teleport...",
    "It's...a fake beard?",
    "I've seen this design of beard before... But I cannot remember where...",
    "It's... fur?",
    "Well, this is not fur directly from an animal, look it has been prepared for sale...",
    "It's... an eye patch?",
    "No, I think he must be somewhere where there are a lot of people who wear eye patches...",
    "It's... a hat?",
    "I'm sorry, I don't know. Maybe somewhere where hats like this are common?",
    "It's... a ticket?",
    "Well, wherever it is that you have seen them, I would guess he is nearby!",
    "It's... a cloak?",
    "I don't think he would have been wearing it... But he might be nearby somewhere that sells this type of cloak.",
    "It's... a toy horse?",
    "Well Player, bear in mind that it might just be an object that as in the vicinity rather than something he was carrying...",
    "It's... some big frogs legs?",
    "I have heard rumours of giant frogs in a subterranean area...",
    "It's... an unholy symbol!",
    "Yes, sadly there are many Zamorakians in these lands...But it must be somewhere of special significance...",
    "It's... a worm?",
    "No, this is a very specific worm, that is only found in one place.",
    "Player I am reading a huge power surge from Solus, be very careful...",
    "Player!!!",
    "I managed to shield you from most of his attack and bring you back to Falador Castle, but you are lucky I was monitoring. That could have killed you!",
    "You're right player, I don't know how he is doing it...",
    "But he can't run forever, and every time he tries something against you, I can update your CommOrb to prevent it.",
    "No, Player. I am sorry that I let him hurt you like that...",
    "But keep chasing him, together we are going to bring him to justice!",
    "That's the spirit Player! Just awaiting the data to come through...",
    "It's... a very strange weapon?",
    "The who? I've never heard of them before...",
    "Well, if you know who or what they are, you should go and see them, Solus must be nearby!",
    "You should probably take a minute to restock on supplies and heal up though Player.",
    "I know we can find him and bring him to justice, but we don't want you dying while doing so!",
    "Player, I am getting some strange readings from this 'maiden'...",
    "Sorry Player, I should have spotted his little trick earlier.",
    "Are you okay? That looked like a nasty sucker punch...",
    "Don't worry Player, I am reconfiguring your CommOrb to compensate for any camouflage magics.",
    "No, but every time he escapes you I am shutting down his teleport to a specific area.",
    "I think we are on the final stretch now Player!",
    "I will be able to shut his teleports down permanently in 2, perhaps 3, more scans...",
    "Keep up the chase Player! We nearly have him cornered!",
    "Leave that to me and the Temple Knights Player.",
    "Just follow your orders and continue the chase, and his days are numbered.",
    "Examining readings now...",
    "Let's see what we managed to snag in the scan this time!",
    "It's a beer?",
    "That type of beer is only sold in one place that I know of",
    "It's...a wizard hat?",
    "I think it's more likely he happens to be in an area where there are many wizards around.",
    "It's... ear muffs?",
    "Well, they are standard equipment for any slayer looking to kill Banshees...",
    "It's... goblin armour?",
    "Well, it must be a place here there is a lot of it around for it to have been caught in his teleport...",
    "It's...a fake beard?",
    "I've seen this design of beard before... But I cannot remember where...",
    "It's... fur?",
    "Well, this is not fur directly from an animal, look it has been prepared for sale...",
    "It's... an eye patch?",
    "No, I think he must be somewhere where there are a lot of people who wear eye patches...",
    "It's... a hat?",
    "I'm sorry, I don't know. Maybe somewhere where hats like this are common?",
    "It's... a ticket?",
    "Well, wherever it is that you have seen them, I would guess he is nearby!",
    "It's... a cloak?",
    "I don't think he would have been wearing it... But he might be nearby somewhere that sells this type of cloak.",
    "It's... a toy horse?",
    "Well Player, bear in mind that it might just be an object that as in the vicinity rather than something he was carrying...",
    "It's... some big frogs legs?",
    "I have heard rumours of giant frogs in a subterranean area...",
    "It's... an unholy symbol!",
    "Yes, sadly there are many Zamorakians in these lands...But it must be somewhere of special significance...",
    "It's... a worm?",
    "No, this is a very specific worm, that is only found in one place.",
    "Okay, we have our scan results...",
    "It's some kind of highly magically susceptible rock...",
    "Isn't that the same rock that you gave that Zamorakian mage in Varrock?",
    "Let's worry about that later; Go get Solus!",
    "There he is!",
    "Okay, I've blocked all exits from this place except for Temple Knight teleports...",
    "I think we finally have him!",
    "This one, Solus!",
    "Player, Solus is very weakened, and we don't have any more fighters to spare!",
    "Take him out now! This might be your only chance! Solus: YOU DIE NOW! (You siege his hat as a trophy!)",
    "Now that Solus is defeated you should take his hat to Sir Amik to prove that you were responsible.",
    "Now let's head back...",
    "...and may I say:",
    "VERY well done, player. Very well done indeed.",
    "Hello there Player. What can I help you with?",
    "You're not looking for Solus Player, you are supposed to be taking his hat to Sir Amik of the White Knights as proof that you have defeated him.",
    "I have sent you a duplicate, try not to lose it. Go and take it to Sir Amik so that he can make you a full- fledged White Knight!"
  ],
  "(Opens Solus Dellagar's dossier interface. See Transcript": [
    "Commorb v2#Solus Dellagar)"
  ],
  "(Opens Lord Daquarius's dossier interface. See Transcript": [
    "Commorb v2#Lord Daquarius)"
  ],
  "(Opens the Zamorakian Research Mage's dossier interface. See Transcript": [
    "Commorb v2#Zamorakian Research Mage)"
  ],
  "Solus Dellagar": [
    "Lord Daquarius! Still festering in your pathetic little dungeon, I see.",
    "Ha! Wishful thinking, perhaps?",
    "Now is that any way to talk to a fellow Zamorakian?",
    "Ah... Such mistrust of your forgotten ally! Why did I ever leave these lands?",
    "Oh... nothing much. I just thought you would like to know that I have returned as your new master.",
    "And that is your final answer Daquarius?",
    "You would threaten Solus Dellagar? Have you forgotten just who I am? Perhaps you need reminding!",
    "Still alive Daquarius? Good! I won't have to remind you of my power again next time! Make sure you are more prepared to follow orders next time I come to your little Taverley hideout!",
    "Well, what have we here? A shrine to Zamorak in the middle of Varrock?",
    "I assume my reputation precedes me!",
    "Kill you? HAH HAH HAH! My dear fellow, if I wanted you dead, you ALREADY WOULD BE!",
    "Well I am particularly interested in your brains at the moment! But you wouldn't want me taking those and leaving, now would you?",
    "I am interested in your research!",
    "Ah! But he is not here, is he?",
    "Ah-ah-ah!",
    "You are going nowhere just yet sir.",
    "With your most interesting research! No, I will be content with simply taking your money sir!",
    "Well a most productive trip on all accounts! I will see you again...Very soon!"
  ],
  "Lord Daquarius": [
    "Solus. I thought you dead many moons past...",
    "Cut the banter, Solus. What do you want? You know you are not welcome here.",
    "You are not a Zamorakian! You worship nothing but your own selfish greed.",
    "You left because your own stupidity brought the wrath of the Temple Knights upon you. Now I ask you a final time before I draw my blade: WHAT do you WANT?",
    "The Kinshra are not your personal soldiers Solus! I will not waste any of my warriors in your foolish schemes!",
    "Leave. Now. Or there will be blood shed between us.",
    "I swear... in the name of *cough* Zamorak... I will see you rot for this Solus...",
    "What want you, with the Lord of the Kinshra? Speak!",
    "Pah! Begone, fool, or prepare to taste my blade!",
    "A friend of mine? What friend of mine would the Temple Knights show any intere- Oh. This... This is about Solus, isn't it?",
    "Then let me assure you, that monster is no 'friend' of mine - if indeed such a creature even has 'friends'! No, that man is certainly no friend of mine nor of the Kinshra.",
    "No fool... You and your White Knight cronies are no friend of the Kinshra either. I will help neither of you, and I wish you all a slow and painful death.",
    "Is that a threat, whelp? Do your worst. I care not for my own life, I stand only for the protection of the Kinshra!",
    "What want you, with the Lord of the Kinshra? Speak!",
    "Well you will not hear that from me, White Knight dog! And you can threaten me all you want, I care for nothing in this world save the welfare of my Kinshra brothers!",
    "Stop! I will tell you what you want! Please... leave my men be...",
    "What want you, with the Lord of the Kinshra? Speak!",
    "*sigh* I should have known the White Knights would be my ruin once again... I do not know his exact whereabouts, and when last we met we did not leave... on the best of terms. All I know is that he left behind some fur when he left, I would expect him to be in an area with furred creatures of some sort.",
    "I do not know, I am a warrior, not a zookeeper. It was not bear fur, I know that much.",
    "What want you, with the Lord of the Kinshra? Speak!",
    "I have already told you, I know nothing except that he left some fur behind. Now leave me and my men be, or it will be the worse for you!"
  ],
  "Mage of Zamorak": [
    "What? Who dares... Oh no. Oh no, no, no.",
    "S-S-Solus???",
    "Please. Please don't kill me. I have no riches, I am but a magical researcher...",
    "I... I don't know w-what you want Solus...but whatever it is, please, just t-take it and leave, please.",
    "My b-brains? I... I don't understand...",
    "My... r-research? I c-cannot let you have my research it is being done in order to assist my lord Zamorak.",
    "No...I...",
    "P-please I meant no disrespect Solus, please do not kill me...",
    "Take it, take it all!",
    "Ah, you mean that accursed Solus!",
    "You are working for the Temple Knights, correct? No, don't deny it, I recognise the magical signature of your Communication Orb, a very nice piece of equipment indeed. I will tell you what I know in exchange for it, I believe such a device could be very useful to my research...",
    "Ah well, it was worth a try, but I did not seriously expect you to part with it.",
    "I have little information, and would give it freely to make sure Solus is... disposed of... but unfortunately I am somewhat... financially distraught at the moment due to a recent... incident.",
    "...Yes. He took a large degree of my research into various things as well, but my research is inside my mind and easily replaceable, the money I possessed was essential for my experimentation, and as I have no real skills to speak of, is not so easily replacable...[sic]",
    "No... not as such. You know of the substance known as 'rune essence' yes? A small number of those will allow me to create runes from them, which I may then sell and get myself back on my feet. Twenty parts of rune essence is my price for my information. You may take it or leave it...",
    "I do indeed. My price for this information is 20 pieces of rune essence.",
    "I will not haggle with you on my price. 20 Rune essences, and not a single essence less.",
    "Certainly. As I say, I have little information, but the cost was not too dear, was it?",
    "As you wish. As a powerful magician, I could sense his aura once I had encountered him, and it definitely moved East of here when he left me.",
    "I am sorry I cannot be more specific, but that is all of the information I have to offer..."
  ],
  "Solus": [
    "What the...?",
    "Well well well! I was wondering when the White Knights would come looking for me!",
    "Well you'll have to be quicker than that, my friend!",
    "You again???",
    "I warn you, if you interfere with my plans I will see you suffer!",
    "Ha! Like I care!",
    "Oh, we have a little magical skill do we?",
    "Then let's see how you deal with this!",
    "Well now, I am beginning to get sick of your constant interference!",
    "Or at least I would be if you weren't so laughably easy to escape from. (Screen goes black)",
    "This is getting very tiresome!",
    "Little White Knight, I command powers beyond your imagination!",
    "If you do not cease pursuing me, I will be forced to use them upon you!",
    "This charade bores me!",
    "Muhahaha! Sucker!",
    "Well you ARE a persistent [fellow/madam] aren't you?",
    "Little tricks, you say? Well how about this one!",
    "Say hello to my little friend! And goodbye to me!",
    "Argh! I am so sick of your interference!",
    "I think it is time we end this once and for all!",
    "Oh yes?",
    "You and what army?",
    "Ha!",
    "You'll never take me alive! (Solus casts Ice Barrage killing the Temple Knight reinforcements)",
    "You... You meddlesome... You meddlesome freak!"
  ],
  "Woman": [
    "Oh thank you, you have freed me!",
    "Oh, I am but a poor maiden kidnapped by the evil Solus!",
    "But you chased him so hard, that now I am free..."
  ],
  "Black Knight": [
    "Solus commands you to die now!"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Wanted!?oldid=36053662’"
  ]
}