{
  "Player": [
    "Hi, are you busy?",
    "I was wondering what you do here.",
    "What do you mean, 'usually'?",
    "Just looking around, thanks.",
    "Can I have a look through that telescope?",
    "And that's because?",
    "Hi, I was...",
    "Wow, nice intro.",
    "I'm totally lost.",
    "I'm sure I'll find the way. Thanks for all your help.",
    "An Observatory?",
    "What? It doesn't work?",
    "So, it's broken. How come?",
    "Up on the hill? Yes, I've seen them.",
    "What, me?",
    "Oh, sorry, I don't have time for that.",
    "Sounds interesting, what can I do for you?",
    "Okay, I'll be right back.",
    "I'm just passing through.",
    "Hello there.",
    "Might I have a word?",
    "Can I speak with you?",
    "Where can I find planks of wood? I need some for the telescope's base.",
    "I've got a plank.",
    "You know, for the telescope's base.",
    "I've got some planks for the telescope's base.",
    "Hi again!",
    "Sorry, not yet. Three planks was it?",
    "Yes, I've got them. Here they are.",
    "Hello there.",
    "Might I have a word?",
    "Can I speak with you?",
    "Can you help me? How do I go about getting a bronze bar?",
    "Right you are.",
    "The bronze bar is ready, and waiting for the professor.",
    "Hi.",
    "Still working hard?",
    "Not yet.",
    "I certainly do. Here you go.",
    "What? I'm not lazy.",
    "Hello there.",
    "Might I have a word?",
    "Can I speak with you?",
    "What's the best way for me to get molten glass?",
    "Thank you!",
    "I managed to get hold of some molten glass.",
    "Still working on it.",
    "Here it is.",
    "I'll have a look - where should I start?",
    "Hello there.",
    "Might I have a word?",
    "Can I speak with you?",
    "Where can I find this lens mould you mentioned?",
    "What makes you say that?",
    "Oh dear.",
    "Thanks for the advice.",
    "I have the lens mould.",
    "Will do.",
    "I had better be quick, there may be more guards about.",
    "Euuuw, that smells awful!",
    "Still looking for it.",
    "I certainly have. You'll never guess what they were doing with it.",
    "Wow, good guess. Well, here you go.",
    "Explosion?",
    "I suppose it's better I don't ask.",
    "Hello there.",
    "Might I have a word?",
    "Can I speak with you?",
    "How should I make this lens?",
    "Thanks!",
    "Do you like this lens? Good, huh?",
    "Oh, erm, that's a feature. Yes, that's it! Indubitably, it facilitates the triangulation of photonic illumination to the correct...",
    "How do I make it again?",
    "Huh. Simple.",
    "Yes, here it is. You may as well take this mould too.",
    "Sounds interesting. Count me in.",
    "Okay. See you there.",
    "Hello again.",
    "How can I get to the Observatory?",
    "Hi, professor!",
    "Okay, don't let me interrupt!",
    "Right-oh.",
    "Hi, this really is impressive.",
    "I've had a look through the telescope.",
    "It was...",
    "<constellation>!",
    "Yes! Woo hoo!",
    "And I suppose I'll just jump down?"
  ],
  "Observatory assistant": [
    "Me? I'm always busy. See that man there? That's the professor. If he had his way, I think he'd never let me sleep! Anyway, how might I help you?",
    "Glad you ask. This is the Observatory reception. Up on the cliff is the Observatory dome, from which you can view the heavens. Usually...",
    "I'd speak with the professor. He'll explain.",
    "Okay, just don't break anything. If you need any help, let me know.",
    "You can. You won't see much though.",
    "Just talk to the professor. He'll fill you in.",
    "Well, it would be if it worked.",
    "Nope, dead serious. Hasn't been working for a long time.",
    "Strikes me that this visitor could help us.",
    "As if I don't have enough to do. Seems I don't have a choice.",
    "Yes?",
    "Sure, how can I help you?",
    "Why, of course. What is it?",
    "I understand planks can be found at Port Khazard, to the east of here. There are  some at the Barbarian Outpost, too. Failing that, you could always ask the Sawmill Operator. He's to the north-east of Varrock, by the Lumber Yard.",
    "That's nice.",
    "Well done. Remember that you'll need three in total.",
    "Good work! The professor has been eagerly waiting them.",
    "Okay, okay, ask me if you need any help, Player.",
    "Yes?",
    "Sure, how can I help you?",
    "Why, of course. What is it?",
    "You'll need to use tin and copper ore on a furnace to produce this metal.",
    "He'll surely be pleased. Go ahead and give it to him.",
    "Some of us are.",
    "Calm down old man, I heard. Player, I'm here if you need any help.",
    "Yes?",
    "Sure, how can I help you?",
    "Why, of course. What is it?",
    "There are many ways, but I'd suggest making it yourself. Get yourself a bucket of sand and some soda ash, which you can get from using seaweed with a furnace. Use the soda ash and sand together in a furnace and bang - molten glass is all yours. There's a book about it on the table if you want to know more.",
    "It'll need to be made to an exact shape and size.",
    "Not any more. One of those goblins took it.",
    "What have I done to deserve this?",
    "Yes?",
    "Sure, how can I help you?",
    "Why, of course. What is it?",
    "I'm sure I heard one of those goblins talking about it. I bet they've hidden it somewhere. Probably using it for some strange purpose, I'm sure.",
    "I had a nice new star chart, until recently. I went out to do an errand for the professor the other day, only to see a goblin using it... ...as some kind of makeshift hankey to blow his nose!",
    "You may want to look through the dungeon they have under their little village.",
    "Well done on finding that! I am honestly quite impressed. Make sure you take it straight to the professor.",
    "Please don't give that to him. Last time he tried any Crafting, I had to spend a week cleaning up after the explosion.",
    "Yes?",
    "Sure, how can I help you?",
    "Why, of course. What is it?",
    "Just use the molten glass with the mould. Simple.",
    "Nice. What's that scratch?",
    "Stop! You can't confuse me with big words. Just pray the professor doesn't notice.",
    "Ah, it's the telescope repairman! The professor is waiting for you in the Observatory.",
    "Well, since the bridge was ruined, you will have to travel through the dungeon under the goblins' settlement."
  ],
  "Observatory professor": [
    "*Ahem*. Back to work, please.",
    "What would you like to talk about?",
    "Welcome to the magnificent wonder of the Observatory, where wonder is all around you, where the stars can be clutched from the heavens!",
    "Why, thanks! How might I help you?",
    "Lost? It must have been those pesky goblins that led you astray. Head north-east to find the city of Ardougne.",
    "No problem at all. Come and visit again!",
    "Of course. We have a superb telescope up in the Observatory, on the hill. A truly marvellous invention, the likes of which you'll never behold again.",
    "Don't interrupt!",
    "Oh, no, no, no. Don't listen to him, he's joking. Aren't you, my FAITHFUL assistant?",
    "Arghhh! Get back to work and stop sticking your nose in!",
    "Oh, I suppose there's no use keeping it secret. Did you see those houses outside?",
    "It's a horde of goblins. Since they moved here they have caused nothing but trouble. Last week, my telescope was tampered with. Now, parts need replacing before it can be used again. They've even been messing around in the dungeons under this area. Something needs to be done.",
    "Stop being so rude. ... Although, he has a point. What do you say?",
    "Oh, thanks so much. I shall need some materials for the telescope, so it can be used again. Let's start with three planks of wood for the telescope base. My assistant will help with obtaining these, won't you?",
    "Go talk to him if you need some advice.",
    "Fair enough. Not everyone is interested in this place, I suppose.",
    "What would you like to talk about?",
    "It's my helping hand, back again. Do you have the planks yet?",
    "It was indeed.",
    "Well done. This will make a big difference. Now, the bronze for the tube. Oh, assistant!",
    "What would you like to talk about?",
    "The traveller returns!",
    "What did I tell you about speaking when spoken to? So, Player, you have the bronze bar?",
    "Please bring me one, then.",
    "Great. Now all I need is the lens made. Please get me some molten glass. Oi! Lazy bones!",
    "Not you! I'm talking to my assistant.",
    "Thank you. Wait a minute, who are you calling 'old'?",
    "What would you like to talk about?",
    "How are you getting on finding me some molten glass?",
    "I really need it. Please hurry.",
    "Excellent work, let's make the lens.",
    "Well, obviously, hence why we have a lens mould.",
    "Great, just what I need. Player, I don't suppose you could find it?",
    "No idea. You could ask my USELESS assistant if you want.",
    "What would you like to talk about?",
    "Did you bring me the mould?",
    "Well, from the smell I'd guess cooking some vile concoction.",
    "Erm, yes. I think in this instance you had probably better do it.",
    "You can use the mould with molten glass to make a new lens.",
    "What would you like to talk about?",
    "Is the lens finished?",
    "Use the molten glass with the mould.",
    "Wonderful, at last I can fix the telescope. Would you accompany me to the Observatory? You simply must see the telescope in operation.",
    "Superb. You'll have to go via the dungeon under the goblin settlement, seeing as the bridge is broken. You'll find stairs up to the Observatory from there.",
    "Oh, hi there! I'm just adding the finishing touches.",
    "Thank you. Right, let's get this finished.",
    "Hmmmm...",
    "Bit of a tap here...",
    "Player, I'm just going upstairs to finish off.",
    "In goes the lens.",
    "Looking good.",
    "And one final adjustment.",
    "And all our work pays off.",
    "What would you like to talk about?",
    "Hello, friend.",
    "Certainly is. Please, take a look through the telescope and tell me what you see.",
    "What would you like to talk about?",
    "Hello, friend.",
    "What did you see? If you're not sure, you can find out by looking at the star charts dotted around the walls downstairs.",
    "I'm afraid not. Have another look. Remember, you can check the star charts on the walls for reference.",
    "That's exactly it!",
    "That's Aquarius, the water-bearer. It seems suitable, then, to award you with water runes!",
    "That's Aries, the ram. A fierce fighter. I'm sure he'll look down on you and improve your Attack for such insight.",
    "That's Cancer, the crab. An armoured creature - I think I shall reward you with an amulet of protection.",
    "That's Capricorn, the goat. Capricorn will surely reward your insight with an increase to your Strength.",
    "That's Gemini, the twins. With the double nature of Gemini, I can't offer you anything more suitable than a two-handed weapon.",
    "That's Leo, the lion. I think the majestic power of the lion will improve your Constitution.",
    "That's Libra, the scales. Hmmm, balance, law, order - I shall award you with law runes!",
    "That's Pisces, the fish. What's more suitable as a reward than some tuna?",
    "That's Sagittarius, the centaur. As you've spotted the archer, I shall reward you with a maple longbow.",
    "That's Scorpio, the scorpion. I think weapon poison would make a suitable reward.",
    "That's Taurus, the bull. This Strength potion should be a suitable reward.",
    "That's Virgo, the virtuous. Virgo will surely provide you with an increase to Defense.",
    "By Saradomin's earlobes! You must be a friend of the gods indeed. Look in your backpack for your reward, in payment for your work. I'll unlock the doors to make it easier for you to get back.",
    "Oh right! I'll just have my assistant tie a rope off or something... Perhaps in the future you can help me fix the bridge, but there's too much preparation I'll have to do before then."
  ],
  "Observatory Professor": [
    "Oh dear. I really do need some help. If you see anyone who can help then please send them my way.",
    "I suggest you have a word with the professor, in that case.",
    "Please try and find it; my assistant may be able to help."
  ],
  "Goblin guard": [
    "Oi, how dare you wake me up!"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Observatory_Quest?oldid=36143682’"
  ]
}