{
  "Emir Ali Mirza": [
    "Welcome! It is good to see you again. How can I be of service, friend of Al Kharid?",
    "There has been a new development with Menaphos, and I humbly request your services once more. Will you accept?",
    "That is unfortunate, but I understand. If ever you should change your mind, we would be most grateful for your support.",
    "We have received a communication from the Pharaoh of Menaphos.",
    "No. Quite the opposite, in fact. In the interests of maintaining the peace, they wish to reopen trade between our cities. To that end, they have invited me to send an envoy to negotiate a deal.",
    "Nor can we ignore the opportunity for lasting peace. Indeed, I have already tasked Hassan with this responsibility.",
    "That is precisely why. You have proven yourself capable and trustworthy. I can think of no better person to act as mediator. In point of fact, the Pharaoh named you specifically for this task – he has heard of your efforts in rescuing me, and disposing of rogue elements within his army.",
    "You were not there, Osman. My captors spoke not of the Pharaoh other than when mocking him. It is clear to me that the plan was Amascut's alone.",
    "No. The Pharaoh has extended a hand of cooperation and friendship and we must do the same. If we betray his goodwill, then the peace shall most definitely end.",
    "However, I am not naive. Hassan can play the role of diplomat, but we must still be cautious. Player, I am counting on you to ensure Hassan's safety. Though should you see anything worth reporting to Osman, do so, just do not act as his spy. Will you accept?",
    "Then we shall start making preparations for the trip immediately.",
    "Very good!",
    "That is unfortunate, but I cannot force you. Should you change your mind, you need only say. Menaphos is a true sight to behold, and I am certain it is full of opportunities and riches for one such as you.",
    "Though I met Ozan only briefly, I could tell that he has a good heart.  He has a sharp tongue too...but he is not lacking in responsibility or honour. But I find upon my return that he took the Kharid-ib against my father's wishes, and to rescind my father's last order would be to dishonour him. So, as things stand, Al Kharid must view Ozan as an traitor to be arrested upon sight. Personally, I hope it does not come to that. In fact, if he were ever to return the Kharid-ib, I would welcome him home as a brother.",
    "My father did not tell me all of the Kharid-ib's secrets, but he did tell me enough to know its true value to Al Kharid. It may seem harsh to you that he would value it above even his own son's life, but I understand his reasons. Of greater concern to me is that the Menaphites, and Amascut not only have the diamond, but also know something of it. We cannot rely on Ozan alone to return it. Osman is also doing what he can and, when the time comes, I hope we can rely upon you again too.",
    "As a prisoner, I was privy to much that my kidnappers spoke of. I am convinced this is all part of some wider Menaphite plot. And I now believe that, even during the war, their primary goal has always been to obtain the Kharid-ib. Now that they have it, the gods only know what their next step will be. I shall attempt to maintain the peace as long as possible...but I have assigned Osman to look into this matter further. We will have answers.",
    "Yes, it is the most troubling aspect of all this. That the Devourer herself would directly intervene in such a way terrifies me. Since the end of the God Wars, the history of the desert is rife with reports of her destructive tendencies. And now she is behind my kidnap and the theft of the Kharid-ib. I only hope that whatever she is up to can be stopped in time, because whatever it is, it won't be good.",
    "Welcome! It is good to see you again. How can I be of service, friend of Al Kharid?",
    "Osman is waiting upstairs to brief you on the current political climate of Menaphos. After which, Hassan awaits you on the roof, ready for your journey.",
    "Welcome! It is good to see you again. How can I be of service, friend of Al Kharid?",
    "You should know everything you need to regarding the Jack."
  ],
  "Player": [
    "What's the development, and how can I help?",
    "Do they want something? Have they declared war again?",
    "So, where do I come into it? I can't well represent Al Kharid.",
    "That's all.",
    "No, not yet. Where is he again?",
    "So, you're going to ask me to spy for you, aren't you? Even though the Emir just asked me not to.",
    "But Maisa got out of Menaphos, remember?",
    "Oh, alright. I wasn't expecting that.",
    "I'll keep an eye out.",
    "No, I'll go talk to Osman.",
    "I'm sure the real dangers will be found inside Menaphos.",
    "It sounds like the gates are being opened.",
    "I'm sorry, do I know you?",
    "Well, that's good. I'm hunting for someone known as the Jack of Spades. He stole something from Grand Vizier Ehsan. Do you know who or where he is?",
    "Can you give me any hint of where I might find this Jack of Spades character?",
    "Does everyone here know who I am?",
    "Oh, of course. In fact, your guards have been sort of helping me to track down the Jack of Spades - can you help?",
    "That seems a little unfair. I'm only trying to help. He's already stolen things from the Grand Vizier Ehsan and Admiral Wadud. He was last seen headed this way.",
    "Perhaps an outsider can succeed where your guards have failed...ahem, Commander. I mean, with your blessing, of course.",
    "Is there anything you can tell me about this Jack of Spades to help track him down?",
    "Excuse me, but, are you Batal?",
    "How do you know I'm an outsider? Does EVERYONE in this city know who I am?",
    "If you think that then you really don't know me! Look, I think we got off on the wrong foot. I'm chasing after the Jack of Spades - have you seen him?",
    "Oh, so he's not all bad, then?",
    "I'm just trying to help.",
    "Wow, okay, so maybe he IS all bad.",
    "There you are, Jack! I've got you cornered. Are you coming peacefully?",
    "Okay, so violence it is. I gave you a chance.",
    "You're no friend of mine. You've been stealing from almost everyone I've met in Menaphos so far. You're nothing but a common thief.",
    "Ozan!",
    "What are you doing here? How did you get into the city? Why did you steal from all those people?",
    "But I've only been able to get in by invitation; those walls and gates seem otherwise impenetrable.",
    "Oh, I didn't know you were musical.",
    "Amascut is here, in the city?",
    "What's down here?",
    "He's the Emir now.",
    "She seems pleasant enough. Hassan's the one who'll mostly be dealing with her.",
    "He used to run with the Skulls? Khnum's gang?",
    "Okay, but surely that worker isn't a villain?",
    "Okay, so now what? I can't well turn you in. Unless, can I?",
    "Why would I want to gain favour with them?",
    "You should know I'm under orders from Emir Ali and Osman not to act as a spy here.",
    "I think I've tracked down the Jack of Spades.",
    "Admiral Wadud, I've recovered the stolen artefact - here. The Jack of Spades got away, though.",
    "I should go and see Hassan now!",
    "Batal, I've recovered your stolen purse. The Jack of Spades got away, though.",
    "I should go and see Hassan now!",
    "Commander Akhomet - here is your dagger the Jack of Spades stole. Unfortunately, he's still at large.",
    "I should go and see Hassan now!",
    "Here you go, Grand Vizier, I've been able to recover your tax book. Unfortunately, I was unable to apprehend the Jack of Spades.",
    "I should go and see Hassan now!",
    "I've returned all the things you stole, and I think I'm in with these influential people.",
    "I've returned all the items the Jack of Spades stole.",
    "Don't forget why we're here, though.",
    "How so? Why did they pick you?",
    "So, about these tombs beneath the city?",
    "I was more thinking about helping people and returning stolen property...",
    "Well, I mean, I'm sure that will come in handy as well.",
    "Will it affect me?"
  ],
  "Osman": [
    "Clearly, this is just another ruse. We cannot trust them at their word.",
    "Rogue elements? He's probably the one who sent them in the first place!",
    "Still, this is the perfect opportunity to gather intelligence from within the city.",
    "And I should bring Player up to speed with the current state of affairs in Menaphos.",
    "Player, meet me upstairs on the south east section of the roof.",
    "If you wish to discuss your trip to Menaphos, meet me upstairs on the palace;s south-east balcony. Unless, did you wish to discuss something more trivial? Well done. A great rescue. I will remember you if I have anything dangerous to do.",
    "Meet me on the roof for a briefing before your journey with Hassan.",
    "I admit, having an agent in Menaphos, free to come and go as they please, would be valuable. But, no – the Emir said you are not to spy, so you are not to spy. Besides, I already have agents in place there.",
    "And you think she was my only asset in Menaphos?",
    "That being said, be aware of your surroundings and situation. You never know when you might see or hear something noteworthy that is worth reporting back to me. Just don't take any risks. Peace between Al Kharid and Menaphos is paramount. To that end, do you have any questions?",
    "Menaphos is the largest settlement in the Kharidian Desert. Historically, it was the site Tumeken and Elidinis chose to rule from. However, the city itself has only existed since after Tumeken's sacrifice, starting out as a refugee camp. More and more people flocked there to get as far away from the front lines of a long-ago war. Over time, people made it their home. Originally, Sophanem and Menaphos were one city, but at some point in history it was decided to separate the two. Sophanem came into being as the city of the dead, where the religious folk resided. Death is something of an industry there. Menaphos, in contrast, became a vibrant city full of life. It's[sic] wealth grew off the back of trade, particularly with the Wushanko Islands to the east. Over the years, many pharaohs used this connection to import exotic flora and fauna, cheap labour to build ever more opulent buildings, and larger and larger pyramids.",
    "He is a charlatan. His mother was Pharaoh before him. She was a militant and petty ruler. They are both of a bloodline that ursurped Osmumten, the last of the Chosen of Tumeken, the rightful rulers of Menaphos. In contrast, her son, the current Pharaoh, started out as a just and kind ruler, righting many of the sins of his mother. It has only been within the last decade or so that this has seemingly changed. He withdrew support for the other desert settlements, cut off trade agreements with Al Kharid and closed the city's gates. Not soon after, he declared war on us. With recent events - Emir Shah's death, the prince's kidnapping - it appears to me that his intent was to claim ownership of the Kharid-ib, but Emir Ali fully suspects Amascut in that regard. That just suggests to me that they are working together, though I have no proof of such. If you ever should meet with the Pharaoh in person, be very wary. There is no telling what he might be capable of doing.",
    "No. The less you know, the better. That way, if you get tortured, you have no information to give up. Next question.",
    "Menaphos is a militaristic city. Its walls are well defended, as is the Grand Palace. Be careful not to get on the wrong side of any guards while you are there. No doubt they will be watching you like hawks from the moment you arrive. Every action you take will be under their scrutiny. Do not dare to undertake any of our more covert activities within the walls of Menaphos - doing so could put everything at jeopardy. The people of Menaphos revere Tumeken and Elidinis above all other desert gods. That being said, you will still find some who follow the teachings of the lesser gods among its citizens. The Pharaoh, however, has become increasingly secular over the years, if my reports are to be believed. Also, should you get the opportunity to visit the Grand Library, there is something I would like you to look for. It's nothing that should get you into trouble - just any books you find tracing the succession of the city's pharaohs.",
    "Good. Then go and talk to Hassan on the roof, and prepare for your trip to Menaphos.",
    "To that end, do you have any questions?"
  ],
  "Hassan": [
    "I am honoured to serve, Emir.",
    "I shall send our reply to the Pharaoh to expect us shortly.",
    "Then, after Osman has briefed you, I shall await you on the roof!",
    "Lead on, Player. Menaphos is directly south, but I wouldn't mind a little sightseeing on the way, should you wish!",
    "If you'd rather not waste time, I can lead us directly on to Menaphos?",
    "These camps are more typical of earlier settlements in the desert. I wonder who lives in them.",
    "Let's not fly over here. This place is notorious; best not to crash or land around here.",
    "Ah, the mysterious Jaldraocht pyramid - it's said to be a dark and dangerous place.",
    "Ah, Pollnivneach. It's rife with crime, but houses plenty of opportunities, so I've heard.",
    "Oh, look - an old granite quarry!",
    "This doesn't look like anything to me."
  ],
  "Grand Vizier Hassan": [
    "Oh, I wasn't expecting you so quickly. Has Osman already finished your briefing?",
    "Didn't he say to meet him in the palace's south-east balcony.[sic] I think I can see him from here.",
    "Have you finished your briefing with Osman? You should learn as much as possible about Menaphos before we venture there.",
    "Excellent! Well, I have sent off the messenger parrot. The Pharaoh should know we are on our way. All that's left is for me to run you through the magic carpet flight safety protocols...",
    "So, are you ready to set off, Player? We shall be travelling in style, as befits a royal envoy.",
    "You'll need both hands free for balance.",
    "Ah, but you will need to dismiss your follower first. No room, no room.",
    "Well, that was an, ah, interesting journey, but we've arrived safe and sound!",
    "Don't be such an pessimist. I'm sure the Pharaoh's intentions are good - you'll see!",
    "Ah, Ambassador Jabari! It is good to see you again. Will the, er, Pharaoh be gracing us with his presence?",
    "Very good, ambassador. You said safe?",
    "Ah, such a lovely day.",
    "Are we lost?",
    "Are we there yet?",
    "Can we not go any faster?",
    "I can see my house from here!",
    "I can't hold it in much longer...",
    "I feel sick...",
    "I spy, with my little eye, something beginning with...'B'!",
    "I spy, with my little eye, something beginning with...'C'!",
    "I spy, with my little eye, something beginning with...'E'!",
    "I spy, with my little eye, something beginning with...'G'!",
    "I spy, with my little eye, something beginning with...'N'!",
    "I spy, with my little eye, something beginning with...'O'!",
    "I spy, with my little eye, something beginning with...'T'!",
    "And us, you. We thank you for your hospitality.",
    "Well, this is unfortunate. Perhaps Player can lend assistance, my lady?",
    "If you are able to assist Grand Vizier Ehsan in tracking down this Jack of Spades character, please do so. It cannot hurt to show that we can work well together.",
    "Then, by all means, confront the scoundrel. Apprehend him if you can, but above all if you are able to return the items he stole, that would be most agreeable.",
    "Ehsan has been nothing but hospitable to me since I got here, why would I be suspicious?",
    "I'll keep that it[sic] mind.",
    "Ah, that is wonderful news, Player. You're already making a name for yourself here in Menaphos. You should continue to help them out as much as possible.",
    "Not to worry, Player - this is my forte. Ehsan and I shall start negotiations on the new trade deal. I'll let you know if ever I need your assistance.",
    "Fantastic job with capturing the Jack of Spades, Player. Entering the city and immediately making a good impression is more useful than you realise!"
  ],
  "Jabari": [
    "We have received their reply, Pharaoh. The delegation from Al Kharid shall be arriving shortly.",
    "Of course. It is vital that the next step of my lady's plan runs smoothly.",
    "Worry not, pharaoh. There is no end of trinkets buried beneath our fair city.",
    "That being said, my benefactor's goal still eludes her. It is why we have stipulated that you invite Player within our gates. Player has something of a reputation for 'getting the job done', as it were.",
    "I am confident that you can subdue just two more citizens, Pharaoh, and you are being well compensated.",
    "Of course, Pharaoh. Then I shall leave you to your rule, and prepare to greet our new guests..."
  ],
  "Pharaoh": [
    "Prepare to accept them. Ensure they are treated well.",
    "Has your benefactor made any progress? If the treasures do not keep arriving, then I may have to rethink this little arrangement of ours.",
    "Good - they shall all be mine; they are of no use to the dead.",
    "I am taking a big risk inviting outsiders into Menaphos. This had better be worth it. The city is rife with problems - the civil unrest, that accursed Jack of Spades...usurpers everywhere. I shall not have it!",
    "Nevertheless, I shall have them both watched from the moment they set foot through the gate. If they stir up any more unrest, I will have to take measures, our deal be damned. No one shall defy my rule! No one!"
  ],
  "Ambassador Jabari": [
    "Grand Vizier Hassan, Player - I humbly welcome you both to the fair city of Menaphos!",
    "Not today, I'm afraid; he is busy tending to matters of state. He has tasked me with making sure our new guests have a safe, comfortable and pleasant stay.",
    "There has been some civil unrest among the workers of late - nothing to be concerned about. Also, a scoundrel known as the Jack of Spades has been terrorising the city this past week. However, our guards have been informed of your visit and shall ensure you, ah, come to no harm. We have also arranged a residence for you both within the Merchant district, nearby your counterpart. In fact, we should make our way there now and introduce you to Grand Vizier Ehsan. Please, follow me.",
    "Allow me to introduce you to Grand Vizier Ehsan of Menaphos. She has graciously agreed to grant you use of these living quarters for the duration of your stay.",
    "Ehsan shall keep me apprised of all developments, which I shall relay to the Pharaoh. Do feel free to send your own communications back to Emir Ali. The guards have also been informed to allow you free passage in and out of the city...albeit not via Sophanem; their plaque requires they be isolated from us. Now I shall take my leave. The Pharaoh awaits today's report on the Jack of Spa-",
    "By all means, go ahead and search for the Jack of Spades. Check with the guards to see where he was last spotted. I, however, must attend the Pharaoh.",
    "By all means, go ahead and search for the Jack of Spades. Check with the guards to see where he was last spotted. I, however, must attend the Pharaoh."
  ],
  "'Admiral' Wadud (Ports)": [
    "I can't be seen talking to you yet. Go deal with Jabari first!",
    "I wondered when you might pay me a visit, Player.",
    "Not yet, but I know you. My captains informed me of your arrival, and what an eventful time you're already having here. I am Admiral Wadud; commander of the largest fleet of ships sailing out of Menaphos. There's very little that happens in Menaphos which I am not aware of.",
    "The true identity of Jack - that much I don't know, but I know a thing or two else. What's this information worth to you?",
    "Stop him! He's stealing my prized trinket. It's one of kind!",
    "That trinket! I must have it back! If you can return it to me, I will, um, er...I'll just owe you one, okay?",
    "Look, the guards barely lift a finger without order from the Pharaoh, but that doesn't mean they don't SEE things. Go ask one of them. All I do know about the Jack of Spades is that he's rarely spotted in the Ports district. If he were hiding out here, I'd know it!",
    "If you can safely return my prized trinket, I will be grudgingly in your debt. Ask the guards if they're[sic] seen the Jack.",
    "Thanks, I guess. Don't worry about the Jack; I'll hunt him down myself.",
    "Thanks for returning the stolen property.",
    "Many moons ago I was naught but a boy with wonder in his heart and silver in his knapsack. I was hungry to hop from coast to coast and explore the ocean as free as a gull; but, alas, nothing in this life is really free. Abandoned by the crew that had so graciously taken me to their helm, and cheated out of every penny I had, I found a stern suitable for the swindled and suspect: the Skulls. The Skulls nestled me to their teat, and nurtured me, and I got my sea legs for real. Though, because I knew that nothing was free, I knew that included the loyalty of the men around me. It was all too easy for me to skim the top off every trade, and rise to the top of the warband. It was only when I caught wind of machinations gusted forth by my underlings that I decided to set sail.  Me and my crew of what passed for loyal buccaneers fled into the embrace of the ocean, and the sea smiled on us that night and held us tight. Within hours of our exodus, we found a fleet of familiar fruit, all too plump not to pick: my old crew, the ones that had left me to waste away all those years prior. They had grown ripe and juicy with decadence and we were lean and ravenous. It was no contest, but I would be lying if I didn't enjoy every slice. It took that moment to make me realise how far I'd really travelled. I'd tread dangerous waters that would make many men balk just to get by. With a heavy cargo, and a heavier heart, we set sail for shores that would be genuinely welcoming to those hoping to eke out an equable existence. After being repulsed from any town we set foot in and running low on supplies, we stumbled across Menaphos, and what a sight to behold it was! Menaphos needed someone resourceful, with an in-depth knowledge of crews that they clashed with on a daily basis. I could provide them with a modicum of security, and in return they did, and still do, dole out 'discretion'. A relationship like that is beneficial to both parties, and you can probably guess how I became so powerful. And rich.",
    "In the same way that our Pharaoh rarely joins the battlefield with the rank-and-file, a true Sultan of the Sea should not be expected to set sail with buccaneers and stowaways. I am more useful to everyone in a position where I can see the bigger picture, rather than straddling the waves themselves. At least from here, I still get to see the currents rise with pride like mountainous peaks in the seabed. It fills me with hope for the future."
  ],
  "Batal (Worker)": [
    "Leave me alone, outsider!",
    "What of it, outsider?",
    "Why, are you famous? Or maybe just egotistical? Of course I don't know who you are, but you dress and smell like an outsider. You certainly haven't done a day's work in your life - REAL work, that is, like we're made to do.",
    "He'll be in this district somewhere. Thinks he's a man of 'the people', always dishing out his loot to us workers.",
    "Oh, sure, he's great. It's not like that gives the guards even more excuse to oppress us, raid our district and take even more of what little we don't have. And they certainly don't drag us off to interrogate us about where he's holed up. If I knew, I'd tell Akhomet, and then good riddance to him. I've no interest in talking to some outsider, though.",
    "And how does stealing from me help, you vulture?",
    "Oh, fine, go on then - track him down, bring my meagre fortune back. It's not like I can lend much of a hand! If I had to guess, the Jack has an underground hideout - you should search below the city. Each of the districts has an entrance to the tombs below. The one in this district is just over there.",
    "So, are you here to return my purse of coins or am I going hungry tonight? Search the tombs beneath the city already!",
    "I guess I do get to eat tonight, after all.",
    "I guess I do get to eat tonight, after all.",
    "It's less about me being a leader, and more about my brothers and sisters needing someone to follow.",
    "Maybe at one point they thought I could accomplish something, and believe me I wanted to, but the truth is that we are bound together by shackles we simply cannot open through our own efforts. To the workers, I am someone who wants change, who can empathise with their suffering and who has danced to the beat of the same drum they are made to march to. To the Pharaoh and the imperials, I represent exactly what they want from their vassals; resignation, impotence and obedience. We are dependant on them for our basic ability to function as Menaphites. To answer your question, I am a leader because my life is compromise. The only reason I still breathe is to keep my people together, because the only person who understands what it's like to be a worker is a worker. At the end of the day, understanding is all we can hope for.",
    "The fire of my youth used to burn like a furnace, but a flame that fierce is unsustainable. I wanted change, and I wasn't afraid to shout into any ear that we deserved it. I even ended up telling one of the Pharaoh's guard. One thing led to another and, well, I got what I deserved..."
  ],
  "Commenader Akhomet (Imperial)": [
    "You shouldn't be here! Speak with Jabari at the north gate! I shall be reprimanding my guards for letting you wander freely before you were settled."
  ],
  "Grand Vizier Ehsan (Merchant)": [
    "It is very good to finally meet you both. I look forward to working towards a mutually beneficial agreement.",
    "Gah! G-g-guards! The Jack is here! Quick, he's stealing from me!",
    "Yes, please, of course. Chase down that menace!",
    "Please, hunt down that Jack of Spades menace and return my stolen property. The guards might have seen where he went.",
    "Oh, are you talking about Ehsan, here? Don't you worry, my little dove, it pays to be suspicious in these testing times, but I'm as clean as they come.",
    "Oh, thank you - so kind!",
    "Thank you for returning my tax ledger!",
    "Don't you worry, my little bird, I'll take good care of your Hassan here.",
    "Go, explore our wonderful city! Make yourself at home!",
    "I started with a grain of straw. I traded that grain of straw for a red piece of papyrus; that red piece of papyrus for an ornately carved pen. Before you know it, I was sitting on confidential government secrets and most of the Menaphos treasury under my control. I know this and that about buying and selling, and a thing or two about keeping secrets, but currency goes a long way in all three! I made one last trade: my money for power. Let's just say it was the trade of my career...",
    "Darling, how have you not heard about old Ehsan, here? Have you had a nice chance to look around? Well, you can guarantee that I control absolutely every iota of all that you've seen. If Menaphos had a heartbeat it would the jingle-jangle of coins being pressed into a purse, punctated by the slaps of hands after a successful trade! Trade that I manipulate, coins that I control and hands that I grease to make sure this kingdom keeps running! If I don't trade in it myself, then I can find you someone who will. So, you ask what I do? A better question would be what don't I do?"
  ],
  "Jack of Spades": [
    "Speak of the Devourer...",
    "Probably as much as THIS is worth to you, 'Admiral'!",
    "As are you, my dear Akhomet!",
    "As am I, Batal!",
    "Haha! You won't be turning me in.",
    "Is that any way to speak to a friend?",
    "Well, now you're just hurting my feelings. There's nothing 'common' about me at all... I am one of a kind!"
  ],
  "Menaphite guard": [
    "The Jack of Spades was last seen heading into the Ports district to the south. Admiral Wadud might have some information on him; you'll probably find him in The Golden Scarab Inn.",
    "You'll find the Ports district on the south side of town. Look for the ships and prime your nose for the stench of alcohol; you can't miss it.",
    "You'll find the Merchant district on the north-east side of town. Look for the market stalls or follow the trail of coins; you can't miss it.",
    "You'll find the Worker district on the north-west side of town. Look for the open bonfire and the no-good, dirty reprobates; you can't miss it.",
    "You'll find the Imperial district on the west side of town. It's on raised ground, so you have to approach it from the west gate. Look for the gigantic golden pyramid; you can't miss it.",
    "Move along.",
    "The Jack of Spades was last seen heading into the Imperial district. You should talk to Commander Akhomet outside the Grand Pyramid. Head west up the stairs from the lodestone.",
    "Move along.",
    "The Jack of Spades was last seen heading into the Worker district. Batal is our eyes and ears there, no doubt huddled by the bonfire to the north-west.",
    "Move along.",
    "The Jack of Spades hasn't been seen outside the Worker district recently. Perhaps he's in hiding there somewhere?",
    "Move along."
  ],
  "Banker": [
    "I require Ehsan's blessing to allow you to use the bank here."
  ],
  "Grand Exchange clerk": [
    "Sorry, I require Ehsan's blessing to allow you to use the Grand Exchange here."
  ],
  "Commander Akhomet (Imperial)": [
    "You would be Player, I presume? Yes?",
    "Well, I AM the leader of the Menaphite Guard - Commander Akhomet. I was informed about your arrival and ordered to have my guards keep an eye on you. For your own safety, of course.",
    "You certainly don't waste time meddling, do you? My report on you is no exaggeration. Catching that troublemaker is MY job, not yours.",
    "Well, we haven't seen him recently, so you're out of luck.",
    "Guards! He's here! Arrest him!",
    "You incompetent idiots! I will NOT be made a fool of like this.",
    "Fine. That dagger means a lot to me. If you can return it, perhaps there are other duties you could aid me in.",
    "Only that the Imperial district is crawling with guards and is regularly searched. His hideout won't be here. All reports so far suggest he has a base of operations in the Worker district, but we've so far been unable to discover it. You should talk to Batal - he's lived there longer than anyone. Just don't expect a warm welcome.",
    "Is the Jack in custody yet? Do you have my knife? Go and talk to Batal in the Worker district. Prove your value to me and I might have more use for you.",
    "Very good! The Jack's time will come soon enough.",
    "I could use someone like you. Come back later.",
    "My father was a blacksmith and my mother was a general in the Pharaoh's army. I admired my mother greatly, although she was by no means an easy woman to love. She lived in a time where uprisings were common and public opinion was almost impossible to quell. It seemed almost reflexive for me to follow in her footsteps, and she made sure I was never even slightly pandered to. I think if left down to my mother, I would be as harsh and commanding as her, but my father taught me compassion and empathy. Soft skills are essential in this line of work, and I believe they are what gave me the edge. I will always get the job done, but never at the expense of my peers.",
    "Me and my men keep the peace. There is so much that the citizens have to be annoyed about, but that annoyance festers into anger, and anger is misplaced easily. We make sure that public opinion is kept in line in any way we can, lest they find themselves misplaced. Whether that be through taking the law into our own hands or ensuring the safety of our monarch, it's the very least we can do for the men and women of Menaphos."
  ],
  "Ozan": [
    "Hey, buddy. Had you going for a while there, huh?",
    "Whoa, one question at a time!",
    "Come on...Who do you think you're talking to here? I have my ways.",
    "Well, not for me! Hey, look, it's a long story involving bribery, a wig and pink skirt, and a snake charmer's flute.",
    "Sure, let's pretend I played it and not something else far more embarrassing.",
    "I've felt bad ever since our run-in with Amascut. I've been on the trail of the Kharid-ib ever since, and I've tracked it as far as Menaphos. Apep and Heru weren't just thugs for hire, unlike Khnum's Skulls, they were Menaphites, and high ranking ones at that! And, well, since arriving here, I've been gathering all the information I can about it. I think Amascut is here, somewhere...",
    "Not exactly. There's been a lot of activity below it since well before I arrived. Groups of workers and guards disappearing beneath the Grand Pyramid and not being seen again. I've set up this little hideout just out of the way, but I've been down there. They're digging up old tombs, searching for...I don't know what. But it's definitely her behind it. Most of the people I've seen are enthralled. She's controlling them.",
    "I'll leave you to find that out for yourself. Maybe we can discover whatever it is Amascut is looking for before she does! Or perhaps there'll be an opportunity for one of us to steal back the Kharid-ib, return it to Prince Ali.",
    "Oh, right, of course. I forgot.",
    "That was for your benefit. I knew it would get your attention and lead you here so we could chat in private. It was also to introduce you to the worst that Menaphos has to offer. There's a deep corruption at work here, and an unnatural one at that. Grand Vizier Ehsan - she seems friendly on the surface, but she trades in rumours and gossip. That 'tax book' of hers is really a ledger of everyone she has dirt on. She blackmails the merchants of Menaphos and has extorted her way into a position of power.",
    "You should warn him to be careful around her, lest the deal between Menaphos and Al Kharid ends up one-sided. Next up is the so-called 'Admiral' Wadud - he's nothing but a greedy thug. Any openly criminal activity in the city - aside from my own, of course - is down to him. He started out as a Skulls pirate, but he was too greedy even for them. When he 'left', he stole a small fleet of ships and crew from them, and set up here in Menaphos.",
    "About that... You should know I've been visiting Khnum; he's repentant, and has been providing me with information of late. Perhaps he could help us with Wadud. Then there's Commander Akhomet. By all accounts, she used to be a great leader of the guard, but when the war started she became nothing but a 'yes woman'. She's become weak-willed, hiding behind the Pharaoh's ever unreasonable orders, bullying her soldiers.",
    "Batal? He's the one that makes me saddest. He used to be a hero among the workers here - fighting for worker's rights, helping the sick and infirm. A couple of years ago, he led a protest against workers being sent to work here beneath the Grand Pyramid. In response, the Pharoah had his hands taken as an example to the others. Ever since, he's been a broken man - more of a collaborator than a friend to his fellow workers. If only he could be built up again...",
    "I'd rather you didn't, friend. My work here is far from done. We need to work together again! Here, take the items I stole and return them. If I'm right, it should go some way to gaining favour with these people.",
    "You're an outsider, and worse than that you're considered an ally of Al Kharid. The people I stole from wield great influence and power in Menaphos. If you can get them on your side, even a little, it can only help our cause. The Pharaoh has become a cruel and oppressive leader. The people don't want him around anymore, but none of them are willing to do anything about it.",
    "Really? Even Osman said that? Wow. Look, I'm not saying you should spy, just do what comes naturally to you. Help them out, gain their friendship and trust. Just keep your moral compass, and don't do anything I wouldn't do. Actually, scratch that, don't do the things I WOULD do either!",
    "Here's everything I took that you have yet to return. Once you're done returning these, talk to Hassan, then come back and visit me here.",
    "Here's everything I took that you have yet to return. Once you're done returning these, talk to Hassan, then come back and visit me here.",
    "Perfect! Now, report back to Hassan. Please, don't tell him I'm here - just the Jack. But come back here once you're done.",
    "You should totally check them out - they are full of treasures!",
    "Yeah, right! You want to know about the mad stacks of loot down there, and experience aplenty! In fact, if experience is your thing, you should check out these four statues and braziers before heading in, pick what you want to learn about.",
    "You can't hang about down there, though. There's some magic protecting these old tombs. They shift around all the time to disorient tomb robbers, and to protect the treasures and secrets of the pharaohs of old. And whatever Amascut is doing down there is creating this icky, green corruption stuff. I swear, I can't stay down there for more than five minutes before having to come up for fresh air. I dread to think what would happen to me if I stayed any longer. Any questions about these shifting tombs?",
    "In one word: opportunity! There is a wealth of knowledge and, more importantly, valuable trinkets in the tombs of long-dead pharaohs below us. These tombs are magically warded to deter grave robbers, though, so you'll find that they are ever-changing. There do seem to be a few constants, though - the most notable of which are sealed chests - each requires a certain skill to unlock, sometimes one which you might not have...but if someone else unlocks it first, you can search it for your share of loot. Also, there is a crystallised form of the corruption to mine through, and lots of urns that you should smash. It may seem odd, but if you smash enough urns, you become empowered, and can mine through a lot of corrupt crystals very quickly! Then there are sarcophagi, each sealed with a combination - inspect each sarcophagus carefully, then look for nearby panels to open it. Finally, you'll need to find the exit. If you don't escape within the time limit, you'll lose out on some of what you found, as it gets lost to the corruption. Oh, here's actually one last thing! You won't have time to do everything alone...so take others with you. Together, you should be able to find everything, and everyone can share in the bounty. There is no downside for other people helping you!",
    "That's where you decide what sort of an experience you'll gain in the tombs. Each of the four statues you activate will gain the favour of a lesser god, and you'll learn different things from them.",
    "It's the same deal with the braziers in front of each statue, though to a lesser degree. Those are for different skills that you'll gain less experience in, when within the tombs below.",
    "Don't just take my word for it, though. You should inspect each of the statues and braziers, and activate those of interest to you.",
    "Yeah, whatever Amascut is doing down there, it's having some sort of corrupting effect. If we spend too long down there at one time, I fear it might affect us. I wouldn't spend more than five minutes down there before coming back up for some fresh air. More importantly, you need to find and use the exit BEFORE your time runs out, else you'll lose out on some of what you've found down there.",
    "Hey, I'm sure you'll be fine - just don't risk it and put it to the test. Once your time is up, you can always just head straight back in. Simply coming back up to this area seems to be enough to clear any corruption that's attached itself to me.",
    "Hey, how are things going down there? I haven't been able to find Amascut yet, nor the Kharid-ib unfortunately. I hope you're having better luck...or at least having fun! Any questions about these shifting tombs?"
  ],
  "Khoochak": [
    "*braaak* Hello, friend. *raaawwwwk*",
    "*braaak* Forgot an adventure? Ask the parrot. *raaawwwwk*",
    "*braaak*",
    "Flew to Menaphos! On a carpet!",
    "Met some nasty people.",
    "Jack of Spades! Jack of Spades!",
    "Ozan's worse than the lot of 'em.",
    "*raaawwwwk*",
    "*braaak* Get lost, bucko. *raawwwwk*"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:The_Jack_of_Spades?oldid=35489669’"
  ]
}