{
  "Ariane": [
    "Valina, the tower is in danger. I need to speak to Archmage Sedridor.",
    "I can't explain. Listen, if the archmage can't see me, perhaps I could speak to Wizard Ellaron.",
    "No, wait, I remember you. You're the adventurer Xenia mentioned. Will you help me again?",
    "I'm the Wizard Ariane...",
    "I'm sorry. Just Ariane. I'm a former tower wizard. I'm an adventurer now, based out of the Champions' Guild.",
    "Could you take a message to Archmage Sedridor for me? Depending on how he reacts, I may need your help with other things.",
    "I told you, it wasn't like that. I knew what I was doing.",
    "Thank you, just go to Archmage Sedridor and... Wait - no - too late. there's something happening.",
    "Come on! My message can wait. Let's see what's happening.",
    "Cast Air Strike at the vortex! Draw it into the power beam! Grab Borann's mindspike, if you need one - he's dropped it next to him.",
    "Wield Wizard Borann's mindspike, select Air Strike from your spellbook, and then attack the vortex.",
    "I'll try to explain later. Right now you need to deal with the vortex!",
    "I'll be fine - it's a disabling ward - but it stops me using magic so you'll have to deal with the vortex.",
    "Thanks, adventurer. Talk to me outside the tower of you still want to help.",
    "I can't believe Sedridor would set up a ward to keep me out. I didn't realise he saw me as that dangerous.",
    "That's what I want to find out! I know the tower is in danger but I don't know the details.",
    "I'm a seer. I have...premonitions, sometimes. Flashes of information, emotional impressions: nothing precise. Lately I've been having visions of the tower in flames. But I don't know any details and I can't prove anything. I came here to investigate and now I find I can't get into the building.",
    "People talk about wizards having a 'gift' for magic, but the first thing you're told when you join the Wizards' Tower is that it's not true. Magic isn't handed down by gods or random chance. Anyone can learn it if they put in the effort. But being a seer runs in families - it's not something I worked for. When I told the other wizards about it they resented me. I tried to use my magic to understand and control my ability. My goal was to integrate it into magical theory so I could teach it to other wizards - but I ended up being expelled from the Tower.",
    "There are schools of magic besides the tower's standard spellbook. I used a forbidden source of information when I was trying to understand my premonitions.",
    "I need you to go into the tower for me. Talk to the wizards and find out what's happening in there. Archmage Sedridor is the head of the tower, so you should talk to him. I think Wizard Ellaron might help as well - he was my mentor while I was there. You should talk to the other wizards, as well; ask if they've seen anything unusual lately. One of them must have seen something that'll help us.",
    "Have you learned anything from the wizards in the tower?",
    "So what did you learn?",
    "What he means is he's going to flood the tower with magic without knowing what he's dealing with. It might work, but I want to be sure. We should find out more.",
    "I spoke to the demon. Spoke to it! But there's no middle ground with Sedridor. step outside the line and you're a Red Wizard.",
    "He's the only tower wizard who was sympathetic. He convinced me to work on them rather than suppress them. But that doesn't help us with the problem. We need to find out what these vortices are.",
    "through the library floor? But that means...it was something from the old tower.",
    "This tower is built on the ruins of an older one, which was burned down a hundred years ago. The story is that Zamorakian wizards betrayed the other orders, but the details of what happened are a mystery. I do know it happened just after the wizards discovered the inner secret of Rune Mysteries - the rune essence teleport spell. Perhaps that discovery led to a conflict. The surface part of the old tower was destroyed by the fire, and the new tower was built on the same place - but the underground levels of the old tower are still there.",
    "Good idea! It's not going to be easy, though: Archmage Perien sealed the lower levels when he built the second tower. there's a rumour that the door can be opened using the Water Surge spell, but many wizards have tried casting that spell on the door and failed. It's more likely that there's a key hidden somewhere in the tower. Could you go back into the tower and find the key? I think Wizard Ellaron will help us if you tell him what we're doing. You should start by talking to him.",
    "Have you made any progress with getting the key to the old tower?",
    "'To whom did you ask me to talk?' Wizard Ellaron, my old mentor. His room is on the second floor of the tower.",
    "Did I? I'm sorry, it's a bad habit I've picked up somewhere.",
    "He wouldn't have mentioned it if it wouldn't help us. You should be able to find it on ene of the bookshelves on the ground floor of the tower.",
    ": This is interesting. Have you seen the diagram in the back? Archmage Perien assigned a rune to each note of the chromatic scale. Hey - what if the key to the ruins is in the Water Surge spell after all? What if you're not meant to cast the spell, but instead you're meant to 'play' its runes as a sequence of notes.[sic]",
    "Have you made any progress with getting the key to the old tower?",
    "The key to the old tower! Who knows what's down there? There could be knowledge that's been lost for a hundred years!",
    "I know, but...while we're down there, we can at least look around. The entrance is on the east side of the island. Come on!",
    "I just hope it's well preserved. It would be terrible for knowledge to be lost forever. The entrance is on the east side of the island. Come on!",
    "Come on! Open the door and lets see what's in the ruins.",
    "This is amazing. We may be the first people to come down here for a hundred years. This must be the Chamber of Shrines. The senior wizards used it as a meeting room, and wizards joining the tower would pledge allegiance to one of the four orders here. I've read about it but I never though I'd see it! The greatest magical innovators or Gielinor once walked this room.",
    "I wish we could spend more time exploring the ruins. If I can I'll stay down here after we've done what we came for.",
    "Yes, I know, but...surely you feel something?",
    "Is that all you think about? You have no soul, do you realise that? No soul.",
    "I wish we had more time to explore these ruins properly.",
    "The old tower was made up of wizards from all over the world, with wildly different philosophies of magic. They arranged themselves into four orders, dedicated to different gods: Blue, Green, Red and Grey.",
    "The Blue Wizards worshipped Saradomin, god of goodness and order. He's the most widely worshipped god in human lands. The Blue Wizards believed magic should be used to help people, and focused on non-combat spells. They invented most of the enchantment spells in the standard spellbook we use today. After the first tower was destroyed, it was the surviving Blue Wizards who rebuilt it. The new tower is still a Saradominist institution, although these days a lot of wizards only pay lip service to the religion.",
    "The Green Wizards worshipped Guthix, god of nature and balance. According to the druids, Guthix created the world then entered a deep sleep. before the rise of our current civilisation, the other gods went to war for control of the world. After millennia of fighting, Guthix awoke and banished them, so they could no longer intervene directly. It was a follower of Guthix who discovered rune essence, and the Green Wizards were the old tower's experts on runecrafting. their statue depicts their founder transmuting a lump of rune essence into a stack of runes.",
    "The Red Wizards worshipped Zamorak. Most people today see Zamorak as a god of evil, but for the Red wizards he was a god of chaos, personal strength and creativity. Legend has it Zamorak was once mortal, but he stole the staff of a god called Armadyl and used it to ascend to godhood. Their statue holds a staff in memory of that. The Red Wizards focused on destructive spells, especially ones involving fire. They invented most of the battle spells that made their way into today's standard spellbook.",
    "There are other gods besides Saradomin, Guthix and Zamorak. The Grey Wizards were those who worshipped lesser-known gods, such as Armadyl or the Menaphite pantheon, or were non-religious. The Grey Wizards didn't invent many spells, but they made some of the greatest contributions to pure magical theory. Their statue's sword symbolises a sharp mind cutting into the heart of a matter.",
    "We need to get deeper into the ruins, to the source of the power beam. It looks like that rune guardian is blocking the door.",
    "It thinks we're new wizards joining the tower! Originally you wouldn't be able to get to this room without passing the entry tests.",
    "It's a rune guardian. The secret of making them was lost when the old tower was destroyed. It must have been standing at that door for a hundred years.",
    "I guess we'll need to find a way across here.",
    "Maybe you could, but I'm not risking it. We need to find a safe way for us both to get across.",
    "It's not as simple as that. Each teleport spell goes to one specific location. Creating a new one can take years of research. It took the wizards of the old tower decades to crack the teleportation problem. It wasn't solved until shortly before the old tower's destruction.",
    "The thing that attacked Wizard Borann came up the power beam from the ruins. I don't want to risk touching it until we've investigated.",
    "Hey! What are you doing?",
    "You're what? That's a statue of Eritona the Green, who negotiated the treaties with local rulers that let the wizards transport runes from the essence mine. You can't just push her statue down.",
    "Well no, but...be careful, okay? Try not to damage the statue.",
    "That's ridiculous. Who would leave valuables lying around behind a statue? Besides, the tower's true riches were in the form of knowledge. Nothing a treasure hunter would be interested in. Well, can you see anything?",
    "That's a statue of Eritona the Green, who negotiated the treaties with local rulers that let the wizards transport runes from the essence mine. You can't just push her statue down!",
    "I can't believe you had to knock down a statue to get us across that gap. Well, it's done now so we might as well use it. Just be careful not to damage the statue further - maybe it can be repaired one day.",
    "This is it! The heart of the old tower - the central spellcasting chamber where the old wizards performed their most powerful rituals. It's amazing - I never imagined I'd see it in person.",
    "So do I. Most of the spells we use today were invented in this room. wizards of all four order cooperated for the sake of magical research.",
    "I'm not getting overexcited, I'm just - Yes,[sic] okay, you're right. Let's do what we came here for.",
    "These vortices look like the one that attacked Wizard Borann. I want to find out what they are. I'll need you to attract a vortex into this circle and keep it there while I examine it.",
    "These vortices look like the one that attacked Wizard Borann. I want to find out what they are. I'll need you to attract a vortex into this circle and keep it there while I examine it.",
    "Okay, keep it there while I examine it.",
    "This is interesting...",
    "I'm about half done - keep it there.",
    "I'm nearly done...",
    "That's it!",
    "They're NOT ghosts. At first I thought they might be ghosts but they're...they're soul fragments. I've heard about putting part of yourself into your work, but he old wizards literally put part of their souls into the power beam.",
    "They must have wanted to create a very powerful magical effect. I don't know what they were trying to do, but whatever it was, it went wrong. Do you know what this is? I think this is what destroyed the first tower! I think there was an enchantment keeping the vortices here, but someone has removed it. Now they're able to go up the beam to the new tower, and you saw the trouble they can cause.",
    "I can't tell, but it happened recently - within the last few days. It looks like we weren't the first people to come down here after all. I can replace the enchantment that was keeping the vortices here, but it'll take some time. While I do it you need to go back to the new tower and delay Sedridor's casting of his Icyenic Purge.",
    "The Icyenic Purge flood the tower with energy, but these vortices are attracted to magic. all it'll do is draw them up into the tower and make it impossible to get rid of them. I can restore the enchantment that kept the vortices in the ruins, but I need to do it while they're still here.",
    "I don't know, but I'm sure you can think of something. If he's casting an Icyenic Purge he'll probably be in the library on the ground floor.",
    "I think there was an enchantment keeping the vortices here, but someone has removed it. Now they're able to go up the beam to the new tower, and you saw the trouble they can cause.",
    "I can replace the enchantment that was keeping the vortices here, but it'll take some time. While I do it you need to go back to the new tower and delay Sedridor's casting of his Icyenic Purge.",
    "Sedridor will be preparing to cast his Icyenic Purge. I need you to go back to the new tower and delay him until I've further restored the enchantment.",
    "The things floating around this room are soul fragments. It looks like the wizards of the first tower put fragments of their souls into the power beam.",
    "It was close, but I managed to restore the enchantment. The vortices are trapped in the ruins again. Thanks for this adventurer. I couldn't have done this without you.",
    "That's what I'd like to find out. They were a powerful wizard and they knew what they were doing. This was a calculated attempt to damage the Wizards' Tower. There are Zamorakian magical orders who resent the tower's monopoly on the Rune Mysteries: the Zamorakian Magical Institute, the Dagon'hai, maybe more we don't even know about. they've attacked the tower before, but it's always been more direct. This is the first time they've come close to doing real damage.",
    "The last major discovery the old Tower made was the inner secret of the Rune Mysteries - the teleport spell to the rune essence. I don't know for sure, but I'd guess that somehow led to the tower being burned down. Maybe one of hte orders wanted to keep the Rune Mysteries to themselves.",
    "Well, thanks again.",
    "Oh, yes, sorry.",
    "I found some things in the ruins you might be interested in - they're yours if you want them.",
    "I'm going to head back down to the ruins to study the vortices. I want to find out what happened to the old tower, and who released the vortices from the ruins. Meet me down there if you want to help."
  ],
  "Wizard Valina": [
    "I'm sorry, Ariane. The archmage was clear. Maybe if you told me why, I could pass on a message.",
    "I'm sorry Ariane. You are barred from entering the tower for any reason.",
    "This is none of your business, outsider.",
    "*ahem*",
    "You can come in. It's only a few people who have been specifically forbidden. Practitioners of dark magic.",
    "Don't just stand there, adventurer! Do something!",
    "Welcome to the Wizards' Tower, adventurer.",
    "Just the usual stream of visitors - adventurers, students, traders - no one unusual. Why do you...? Oh, this is about Ariane's warning, isn't it? No, I haven't seen anything unusual. The archmage is dealing with the problem, but if you want to go inside and pester every wizard in the tower then I can't stop you."
  ],
  "Wizard Borann": [
    "By Saradomin the Holy Archmage, begone, spirit of the Abyss!",
    "Help! Do something! Get that thing away from me!",
    "Help! Do something! Get that thing away from me!",
    "Thank you for saving me from that thing! Please, keep my mindspike as a reward.",
    "Quiet in the library, please.",
    "It was horrible! It felt like it radiated evil power! And you saw what colour it was. Red! The colour of Zamorak! It was Red Wizards who burned down the tower a hundred years ago. This could be another Zamorakian plot to destroy us! You've got to do something!",
    "Oh, all right. If you must play the organ, at least keep to the top manual - it's the quietest. Not even Archmage Sedridor could concentrate with the racket from the loud manuals.",
    "It's been here since the tower was rebuilt. I think the first archmage was a little eccentric in his architectural preferences."
  ],
  "Professor Onglewip": [
    "Greetings, human!",
    "Everything about this tower is unusual from my point of view! The human approach to magic is endlessly fascinating. If you're referring to that thing that attacked the librarian, however, I've never seen anything like it before. There's an old human called Traiborn in this tower who's always talking about strange creatures. Maybe you should be asking him."
  ],
  "Wizard Isidor": [
    "Oh, hello there! Can I do anything for you?",
    "I'm sure there's been something strange happening with the power beam lately. The beam acts as an anchor for all our teleportation spells, so as a teleportation specialist I'm sensitive to any fluctuations. Archmage Sedridor is aware of the problem. Perhaps you should ask him what he's doing about it."
  ],
  "Wizard Jalarast": [
    "Hello, can I help you?",
    "I heard that commotion in the library earlier. I assumed it was Wizard Borann jumping at shadows again. I'm not sure he's cut out for the stressful life of an academic librarian."
  ],
  "Wizard Mizgog": [
    "My beads! Where are my beads?",
    "I think Wizard Grayzag's imps have been moving my notes around. I can't find the section I was working on yesterday. Why don't you ask Wizard Traiborn? He loves telling people about things he's seen.",
    "What can I do for you, adventurer?"
  ],
  "Wizard Ilona": [
    "Adventurer! It's good to see you again!",
    "No...I did hear the commotion in the library earlier, though. I'm glad you're here! If there is something wrong, I'm sure you and the senior wizards will be able to get to the bottom of it."
  ],
  "Wizard Grayzag": [
    "Not now, I'm trying to concentrate on a very difficult spell!",
    "Only Wizard Mizgog's beads turning up all over the floor! I should send my imps to hide them before someone trips over them. Why don't you go and bother Wizard Traiborn instead? That old duffer is always seeing things.",
    "So you got the old fool his beads. Think you're clever, do you?"
  ],
  "Wizard Traiborn": [
    "Ello young thingummywut.",
    "I've seen them in the power beam, you know. Thingummywuts.",
    "What? No, not thingummywuts. Don't be ridiculous. They wouldn't fit. It was a sort of swirly, sparkly thing.",
    "I like to look at the power beam sometimes. There are so many things we see every day but never look at, aren't there? Or look at every day but never see. I see things in there...thingummywuts. No one else sees them. They think I'm mad.",
    "Didn't you know? This Tower was built on the ruins of an old tower. That's where it came from. The swirly thing. I saw it come up through the floor of the library."
  ],
  "Wizard Ellaron": [
    "What can I do for you on this glorious day, adventurer?",
    "What can I do for you on this glorious day, adventurer?",
    "Alas, even senior Tower wizards aren't allowed into the ruins. I certainly couldn't tell the secret to a disgraced ex-Wizard and an outsider, however much I might privately want to help you.",
    "Ariane is a brilliant mage, but she has never mastered the subtleties of human interaction. the oath I swore to the tower prevents me from helping you.",
    "One wonders what it is that generations or Archmages have wanted to keep locked away down there. Forbidding a source of knowledge goes against the principles upon which the first Tower was founded.",
    "No one except Archmage Sedridor is allowed to know the secret of entry to the ruins. Naturally I've heard the rumours.",
    "Many young wizards have wasted runes casting Water Surge on the door to no effect. A few, however, have speculated that the key might lie not in casting that spell, but in understanding it.",
    "It was the Archmage Perien, first archmage of the new tower, who sealed the lower levels. He had an idiosyncratic understanding of magic and its relationship to other arts. Perien had the pipe organ installed in the library, and he wrote a treatise on the relationship between magic and music.",
    "I don't recall saying anything of the sort. If you did want to read that book, though - for its historical interest, perhaps - you could find it on one of the bookshelves on the ground floor.",
    "That's a good idea. I hope you find something interesting."
  ],
  "Wizard ellaron": [
    "Are her premonitions still troubling her? I feared as much. Please let her know that I take her seriously, even if no one else does. I will do everything I can to convince Archmage Sedridor to take action.",
    "When I took Ariane on as my apprentice she asked me to help her suppress her premonitions. She didn't want to stand out because of a natural gift; she wanted to stand out, if at all, by the work she put in. I told her that that was admirable, but it would be wrong to turn down an advantage the gods had given her. I helped her to harness her gift, to refine it, and to Zamorak with what the other wizards thought. With hindsight, it shouldn't have surprised me when Sedridor expelled her just for using every source of knowledge at her disposal."
  ],
  "Archmage Sedridor": [
    "Welcome, adventurer, to the world-renowned Wizards' Tower. How can I help you?",
    "Yes, I'm aware of that. Wizard Valina told me she was here. You can tell Ariane that her concerns have been noted. I'm preparing to deal with the anomalies in the power beam so there's no cause for concern.",
    "I concede that there is some evidence that she has premonitions, but unless she can give me more specific information there's really nothing I can do.",
    "You know what she did, don't you?",
    "Wizard Ariane was our most promising student. She could have been archmage someday. I overlooked her gallivanting off as an adventurer - everyone's reckless in their youth... But I can't allow a demon-worshipper in the tower. The tower has had strict rules against Zamorakian wizards for the last hundred years, and I have to apply that, even to",
    "I'm preparing an Icyenic Purge. It'll send a surge of energy through the power beam, which should overpower whatever creatures have managed to enter it.",
    "Please be quiet, adventurer. My assistants and I are casting an Icyenic Purge and we must have complete silence in order to concentrate.",
    "Please don't do that adventurer. The Icyenic Purge is in a critical stage and it is essential that all participants be able to concentrate.",
    "Adventurer, I must insist that you step away from that organ.",
    "Break my concentration once more and you will feel the wrath of the grand archmage of the reborn tower!",
    "Quickly, wizards! We must finish the spell at once!",
    "The purge is complete. Thank you, fellow wizards: whatever these entities were, they could not have survived such a powerful wave of magic. Adventurer, I suggest you leave the library and find your friend Ariane. Tell her not to worry; we have dealt with the problem without any help."
  ],
  "Wizard Finix": [
    "I hope they let me into the Runecrafting Guild soon. It's cold up here on the roof!",
    "I heard that a strange magical force had entered the tower and attacked the librarian, but that's all I know. Here on the roof I'm a little cut off from what's happening in the tower, and I still haven't been allowed inside the Runecrafting Guild."
  ],
  "Rune guardian": [
    "Wizard, you have proved yourself worthy. All that remains is to determine the order to which you will belong. Are you ready to be tested?",
    "I will ask you a series of questions. Your answers will reveal the order to which you are best suited. If you disagree with your allocation, you may take the test again.",
    "The first question: You are behind in your studies due to illness, and a test is coming up. Your place at the tower is safe, but if you fail you will lose some respect. Another apprentice offers you an opportunity to cheat.",
    "The second question: An elderly wizard - the last practitioner of a unique branch of magic - dies. Her diary might contain details about her unique magic, but her will states that the diary should be destroyed on her death.",
    "The third question: A rival wizard is spreading lies about you and has made you the laughing stock of a nearby village. They believe you are of low intelligence and poor moral character, and throw vegetables at you when you visit. What do you do?",
    "The fourth question: You have become a senior wizard and are asked to take on an apprentice. The boy is talented but undisciplined and does not apply himself outside his areas of interest. What is your approach?",
    "The fifth question: A senior wizard asks you to take part in a ritual that will greatly benefit the tower. Before the ritual starts, you discover that he learned part of it from a demon. The ritual appears safe, but demons are expert liars.",
    "You are balanced between two orders. A final question: which of these do you value most?",
    "Welcome, Blue Wizard.",
    "Welcome, Green Wizard.",
    "Welcome, Red Wizard.",
    "Welcome, Grey Wizard.",
    "Welcome, Blue Wizard.",
    "Very well.",
    "Welcome, Green Wizard.",
    "Welcome, Red Wizard.",
    "Welcome, Grey Wizard."
  ],
  "Stop the ritual": [
    "it may be corrupt in a way I can't detect."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Rune_Mysteries?oldid=36181313’"
  ]
}