{
  "Lakki the delivery dwarf": [
    "Oh dear, oh dear.",
    "I'm going to lose my job! One crate is missing. I have to get them all to Drorkar's power station. He'll kill me!",
    "I won't have a job at all, at this rate.",
    "Could you? Thank you! I've just come up the western road. It must be along the road somewhere. When you find it, please take it to Drorkar in the power station by the mine. I can't wait any longer. I'll deliver these crates and tell him you're coming.",
    "Drorkar's my boss. He needs these...crates...for his power station. It's powering Nurmof's pickaxe machine.",
    "Oh, just...parts. Replacement parts for Drorkar's power station."
  ],
  "Player": [
    "What's the matter?",
    "Maybe you should get a less stressful job.",
    "I could help you find the crate.",
    "Drorkar? Power station?",
    "What's in the crates?",
    "I don't have the time to talk to you.",
    "I don't have the time to talk to you.",
    "Yes.",
    "I'm not your errand [boy/girl].",
    "Okay.",
    "What are you doing to those poor hatchling dragons?",
    "No.",
    "What is this place?",
    "How does it work?",
    "Really?",
    "There's no need to be sarcastic.",
    "Forget it. I don't care, anyway.",
    "What is it powering?",
    "Do you have a quest for me?",
    "What is the delivery?",
    "What is the delivery?",
    "What resources?",
    "Will the delivery guy lose his job?",
    "It wasn't his fault.",
    "That's horrible.",
    "Fair enough.",
    "What are you doing to those poor hatchling dragons?",
    "Fair enough.",
    "But it's cruel!",
    "Goodbye.",
    "Fair enough.",
    "I have a letter for you.",
    "What's the matter?",
    "So, you've taken a vow of silence, then?",
    "How's that working out for you?",
    "Well, I suppose I'll leave you to it, then.",
    "[Say nothing]",
    "[sic]",
    "Why are they dying?",
    "Yes, it does feel a bit hotter.",
    "Can I help?",
    "I don't care about your red roses!",
    "Can I help?",
    "I'll go and get some compost.",
    "Why are they dying?",
    "I don't care about your red roses!",
    "I have some compost here.",
    "There we go!",
    "Very nice rosebushes you have here.",
    "What?",
    "What are you doing?",
    "Why?",
    "Why are you trying to catch icefiends?",
    "Why is it so hot?",
    "But why do you want to save the icefiends?",
    "But why does it matter if they go extinct?",
    "Can I help?",
    "Leave me alone, you crazy gnome!",
    "Can I help?",
    "I could help you catch icefiends.",
    "Okay.",
    "Leave me alone, you crazy gnome!",
    "Leave me alone, you crazy gnome!",
    "I've caught 4 baby icefiends!",
    "The avalanche seemed to be centred on the northern end of the mountain. Maybe I should see if it has done any damage there.",
    "What happened to your tent?",
    "I could fix your tent for you.",
    "Never mind.",
    "There, that's your tent fixed.",
    "What's the matter?",
    "What? It's right here!",
    "What other ice mountains?",
    "The sea gets hotter?",
    "The firebird? What are you talking about?",
    "Um...no?",
    "No...I think I would have noticed.",
    "But how?",
    "It must be Drorkar's power station!",
    "Maybe it can't be stopped.",
    "It's a natural process. How can we change it?",
    "Shut up, you crazy woman!",
    "I'm going to go and do something!",
    "You've got to shut down this power station!",
    "Bordiss said it shouldn't have been built.",
    "What alternative power station?",
    "It's making the monks' flowers die.",
    "Well, the monks do.",
    "It's making the icefiends extinct. It's so much hotter than before, so they're melting.",
    "But cows have always done that and there aren't any more volcanoes than before. Why is it getting hotter now?",
    "The Oracle predicted it would cause the end of civilisation!",
    "Yes! She talked about icebergs melting, Entrana being flooded and Varrock turning into a desert!",
    "How does that work? She didn't even ask for any money!",
    "I'll go and talk to Nurmof, then.",
    "Never mind.",
    "I gave your letter to Brother Bordiss.",
    "He says he didn't say the power station couldn't be built; he said it shouldn't be built.",
    "Really?",
    "Will the delivery guy lose his job?",
    "What are you doing to those poor hatchling dragons?",
    "Nothing.",
    "You've got to shut down the power station!",
    "It's making Ice Mountain heat up! First the monks' flowers died, then the icefiends started melting and then an avalanche ruined the Oracle's tent.",
    "He did?",
    "What was this other power source?",
    "Why did he leave?",
    "You've still got to shut down the power station!",
    "But Tati's pickaxes are the same as yours.",
    "Nurmof says you made plans for an alternative power station.",
    "I ask because an alternative power station would be kind of useful right now.",
    "Can't you tell me about it?",
    "So, what happened to these plans?",
    "We have to find the plans! The dragon power station will destroy the world, but Nurmof won't consider changing it without the plans.",
    "Is this your key?",
    "It was in Drorkar's pocket.",
    "You've got to shut down the power station!",
    "I have the plans to the alternative power station here."
  ],
  "Drorkar": [
    "Are you here with the last part of the delivery?",
    "About time. Now I can finally bring the station up to full capacity.",
    "Now, since you're here, I've got another job for you. Take this letter to Brother Bordiss in the Monastery, to the north-east of here.",
    "Oh, honestly. It's a quest, then. Deliver it and you'll get a Quest Point and a bunch of 'Letter-delivering' XP, or something. Now get going!",
    "If you see the delivery guy, tell him he'd better get here or he's out of a job. Now, what do you want?",
    "This, human, is the future. This generator provides power for the mine's machinery, all day, every day! It will dramatically increase industrial productivity and enhance the dwarven economy.",
    "It uses a turbine driven by the hot air from people asking stupid questions.",
    "Of course not, you idiot! But I'm hardly going to give industrial secrets to anyone who turns up. Now, leave me alone.",
    "Then don't ask stupid questions! This is cutting-edge dwarven technology and I'm not going to give away its secrets to anyone who turns up.",
    "At the moment, Nurmof's pickaxe machine. He was having trouble meeting demand, so he automated the construction process. His machine needed a power source and that's where we came in. That's just the start! As there are more pickaxes, there will be more metal being mined. This metal will need to be turned into products. So, there will be more machines and more power stations like this one to power them, and so on, towards a prosperous future!",
    "Oh, yes, a quest for a brave adventurer. I want you to fetch me the Helmet of the Dwarf Lords from the Mountains of Gold. Then I will reward you with a magic pickaxe. No, I don't have a quest! Do I look like some layabout who needs passing adventurers to do his work for him? Now, I've got work to do, so let me get to it.",
    "New resources for the power station.",
    "Oh, yes, like I'm going to give industrial details to anyone who walks in.",
    "I'm not sure yet. It depends what mood I'm in when I get back to Keldagrim and speak to his manager.",
    "Of course it was his fault! He should have been more careful.",
    "It's a privilege of being rich and powerful.",
    "Oh, honestly. Another bleeding-heart human 'hero' thinks [s]he can tell me what I can or can't do. Listen, dragons' stomachs are some of the most efficient heat production systems in the world. Normally, only adult dragons breathe fire, but if the young are force-fed coal then they can burn it more efficiently than any furnace.",
    "I don't have to justify myself to you! These dragons are the property of the Keldagrim Mining Consortium and we can do what we like with them. Concern over animal welfare cannot be allowed to hold back the glorious march of industrial progress!",
    "You again? What is it now?",
    "Really? Why is that, then?",
    "Bordiss? Pah! Bordiss is a failure. He's not fit to call himself a dwarf. He was too drunk and disorganised to finish his plans for an alternative power station. Now, he sits around all day with his little holier-than-thou club and thinks he can lecture ME?",
    "Oh, it was a crazy idea. It was clear it would never have worked. Forget I even mentioned it.",
    "Monks' flowers? Who cares about some stupid monks' flowers?",
    "Monks? Flowers? Pah! Things like natural beauty and spiritual fulfillment cannot be allowed to get in the way of industry! Ahem. I mean, naturally the death of the flowers is a bad thing but there is no conclusive evidence linking it to this power station.",
    "That's nothing to do with us. It's all due to cows breaking wind. Oh, and volcanoes.",
    "What I mean is, things that we dwarves or humans do can't possibly have an effect on the environment. The atmosphere and the ocean are endless reservoirs that can be dumped into without any repercussions! Now, leave me alone. I'm trying to increase the station's output.",
    "The Oracle?",
    "Oh, honestly. The idea that emissions from a station like this could affect the world's temperature are plain unfounded. These so-called 'oracles' are just out to make a quick gold piece out of your gullibility.",
    "-whereas, I'm paid by the people who designed this power station, so you know I'm impartial. I say that this power station can't possibly be the problem. Anyway, it's not my decision. If you want to shut us down so badly then talk to Nurmof. I'm sure he'll be delighted that you want to shut down the power source for his new pickaxe machine.",
    "You do that. You'll find him down inside the Dwarven Mine, right underneath this power station.",
    "Good! About time.",
    "Oh dear, oh dear! I suppose we'd better pull it down now because Brother Bordiss thinks we might be doing a bad thing.",
    "Don't be stupid!",
    "The wind power station will never work! Windmills are only good for grinding flour! Wind could never generate the power required.",
    "You fools! Don't you see that, um, my power station was staving off a new ice age? Yes! You have doomed yourselves!"
  ],
  "Brother Bordiss": [
    "Zamorak's fiery hooves!",
    "It's Drorkar! First he builds his great Zamorakian smoke-machine, and now he's sent me this letter taunting me about it! That filthy little-",
    "Look what he's written! 'My coal-dragon power station is now running at full capacity. You said this could never be done, but I have proved to be the better dwarf.' Lies! I didn't say it couldn't be done, I said it shouldn't be done! This power station will be a disaster for dwarves and everyone else.",
    "I...I am sorry, Brother Althric. I will renew my vow of silence.",
    "[sic]",
    "[sic]",
    "[sic]",
    "[sic]",
    "[sic]",
    "Holy, flaming-",
    "[sic]",
    "[sic]",
    "[sic]",
    "Gah! I can't keep quiet any more!",
    "Yes, I made plans for a different power station. One that wouldn't need replacement dragons and wouldn't create that infernal smoke like Drorkar's Zamorakian-",
    "The night before I was meant to present the plans, Drorkar and I had some drinks together, but I drank too much. When I woke up the next morning, I had a terrible headache and I couldn't remember what happened the night before. I couldn't find the key to my chest anywhere! I was sure I had the key on me when I met Drorkar but, afterwards, it was gone. I asked Drorkar if he'd seen it but he just kind of smiled and said 'no'. My plans were in the chest and, without the key, I couldn't get at them. I was a failure as a dwarf. So, I came to the Monastery to atone. I vowed to never drink or speak again. Now, I've failed at that, as well.",
    "They're still within my chest in the Dwarven Mine, near Drogo's shop. But the chest is warded with magic - there's just no way to open it without the key.",
    "Saradomin be praised! That's the key! Where did you find it?",
    "Drorkar! Why, that-",
    "I ought to go over there and-",
    "I'm sorry, brother, but this changes everything. I'm not a failure. I didn't lose that key: Drorkar stole it! You've got to get those plans and give them to Nurmof. I'll pack my things - I'm going back to the Dwarven Mine!"
  ],
  "Brother Althric": [
    "I'm afraid Brother Bordiss has taken a vow of silence.",
    "Brother Bordiss! Your vow of silence!",
    "Bordiss! Language!",
    "Brother, you are letting Zamorak's anger overtake you. You have been such a pious servant of Saradomin; do not stray from the path now.",
    "I am sorry for my brother's outburst. The path of the Saradominist monk is a demanding one and Brother Bordiss is one of our newest acolytes, so I am sure you will forgive him. Once my brother has achieved true peace and serenity he will never make similar- Great Saradomin!",
    "My roses! Look! They're dying!",
    "Will you two keep it down? I'm trying to concentrate.",
    "My poor red roses! Look at them. They're dying!",
    "These red roses were imported from a cold northern island. It was already warmer than they're used to and now it's getting so hot that it's too much for them! The other roses look like they're safe, for now, but if it keeps on getting hotter I think they might die too.",
    "I don't understand it. The wind from Ice Mountain has always given us a nice cool climate. Recently, it seems to have been getting hotter, for some reason. Actually, it started getting hotter when Brother Bordiss joined us. Obviously, I don't think he's to blame!",
    "Could you? Thank you so much! If you applied some compost and then watered the roses, they would recover, at least for now.",
    "*sniff* May the peace of Saradomin...sniff...go with you brother.",
    "My poor red roses! Have you fetched the compost for them yet?",
    "Oh! Thank you! Could you apply it to the red roses, please?",
    "What's that?",
    "Bordiss! Language!",
    "Um, hello? Welcome to the Monastery of Saradomin.",
    "Just go out of the main doors to the south and then head west-",
    "What an odd little man. Perhaps you should see what he wants.",
    "Yes, they are. Thank you so much for helping me to save them.",
    "Brother Bordiss! Your vow!",
    "Language, brother!",
    "Language, brother!",
    "Brother! Your vows."
  ],
  "Professor Arblenap": [
    "Where am I? Where's the mountain? How do I get to the mountain?",
    "The mountain! How do I get to it?",
    "Thank you! Got to go!",
    "Hold still!",
    "Oh! Not you - them!",
    "Trying to catch baby icefiends.",
    "What?",
    "Oh! Too hot. Dying. Spirit tree told me. Icefiends are already at the limits of their, um, tolerance. For temperature. Now it's getting hotter, for some reason. They'll die. So, I'm collecting some. Baby ones that is. I'm going to take them to a cold island. Otherwise they go extinct.",
    "What? I don't know! It's not balanced. Not Guthix. At least I don't think so; I don't see how it is. It's not natural. We don't have time to worry about why. We've got to save the icefiends!",
    "Because - because otherwise they'll go extinct!",
    "The extinction of a species is a loss to the whole world! Nature is a delicate balance. If one thing changes, it could have an effect on something else. The icefiends need to keep cool, but they also help keep the world cool. If they're gone, it'll get even hotter. Everywhere!",
    "I don't know. Can you help?",
    "Oh! Could you? Thank you! I can't seem to catch them on my own. Take this net. Catch four baby icefiends and give them to me.",
    "I still can't catch the icefiends. Have you had any luck?",
    "Thank you!",
    "What was that? Ground shaking. Not good! I, well, um, I think I've got enough icefiends anyway. Got to go!"
  ],
  "Oracle": [
    "A terrible event! Oracle's tent is gone. An Oracle without a tent is like a...me without...my tent!",
    "Ground shakes! Ice moves! Oracle's tent is at the bottom of the mountain.",
    "In future language, [Player] is a word meaning kindness.",
    "You have a noble soul! Oh! Oh no.",
    "The snow! Where has the snow gone?",
    "No, it's...gone...in the future. There is no ice on Ice Mountain...or the other ice mountains.",
    "I'm mountains of ice. In...in the water. The sea. I'm mostly underwater. But I melt...I split, and...and then the sea gets hotter, because the ice is gone.",
    "Ice reflects? I am a sunbeam. White ice makes me turn around, but dark water lets me in and it rises and rises and the firebird-",
    "My feathers! Extinguished! Island gone beneath the waves. Monks and priests must find another home. Is Varrock a desert?",
    "Desert stretches from Varrock to Lumbridge. Crops die. People fight over last food...all dead. Has...has this happened already?",
    "Then you must stop it!",
    "I...I can't remember. Wait, I see YOU stopped it. Somehow!",
    "Our hunger will exhaust the earth and our waste will exhaust the sky.",
    "Future is not certain. I see future but future is confused, so I am confused.",
    "From here I could take one step and fall all the way down the mountain.",
    "Frogs!",
    "Future can still be decided."
  ],
  "Nurmof": [
    "Greetings and welcome to my pickaxe shop. Do you want to buy my premium quality pickaxes?",
    "What? What are you talking about?",
    "Oh dear. Bordiss thought this might happen.",
    "Yes. He said he had an idea for a different kind of power source, one that wouldn't cause problems. He never presented it to me, though. I set a date for Bordiss and Drorkar to present their ideas, but Bordiss didn't turn up. On the day of the presentation he suddenly up and left.",
    "I still don't know. Bordiss was very secretive about his plans; he seemed to think that Drorkar or someone else would steal them. I do know that it wouldn't use fuel and wouldn't require any replacement parts from Keldagrim. That's sounding good to me now. The Consortium have doubled the price of dragon eggs, but I have to keep buying them.",
    "He didn't say. On the morning before the presentation he just left without a word. I eventually found he'd joined the Monastery, but when I went there he wouldn't talk to me. The monks said he'd taken a vow of silence. He seemed very upset, though.",
    "I can't shut it down! My business would be destroyed. Without this machine, I can't produce enough pickaxes to meet demand. Then the miners would start going to Keldagrim to buy the inferior pickaxes from Tati.",
    "It takes a dwarf to appreciate the difference. I create my pickaxes to a very exacting standard and the only way to maintain that standard is with my machine.",
    "Greetings and welcome to my pickaxe shop. Do you want to buy my premium quality pickaxes?",
    "I know, but what can I do? I need to keep this pickaxe machine running and coal-dragon power is the only way. If only Bordiss hadn't left before he presented his alternative power source.",
    "You do? Let me see them!",
    "You know...I think this would actually work. In fact, I'm sure it would! This is brilliant!",
    "Thank you, Bordiss.",
    "Shut up, Drorkar! Go back to Keldagrim and tell your masters not to interfere with us any more.",
    "Thank you, [Player]. I cannot reward you financially, but I think I have a better reward. Let me show you the workings of my pickaxe machine. You will learn a secret technique rarely taught to non-dwarves: how to make pickaxes."
  ],
  "Bordiss": [
    "Nurmof, the wind power station is attached to your pickaxe machine and both are running smoothly."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Perils_of_Ice_Mountain?oldid=36066690’"
  ]
}