{
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "missing dialogue for ravenous locust remote view activationYou can discuss this issue on the talk page or edit this page to improve it."
  ],
  "Ali the Wise": [
    "Ah, Player, there you are. I've been doing some research since we last spoke, and one of my contacts has found something very interesting. Would you like to go on a mission that would aid me in my work researching these mysterious Mahjarrat creatures?",
    "Excellent. Now, one of my other contacts has been doing some exploring - he found an entrance to some tunnels. They seem to head directly under that plateau where Jhallan said the Ritual will happen.",
    "Not entirely, but it seems quite likely. It doesn't look like these are naturally occurring caves - someone's deliberately tunnelled under that plateau.",
    "No, there appears to have been a number of cave-ins. He didn't have the mining expertise to get through.",
    "It's at the top of an area called Trollweiss Mountain. You'll have to pass through some ice troll tunnels north-west of Trollheim.",
    "Really? It hadn't struck me as a tourist area. A bit too troll-ridden. You won't need a toboggan this time, anyway. The cave is right at the top.",
    "Good luck, adventurer. I look forward to hearing what you find.",
    "Have you managed to explore those tunnels yet?",
    "Have you found the tunnel yet?",
    "That does sound interesting! Shall we have a look at those plans, then? I always say it's best to be prepared before plunging blind into the depths of evil villains' hideouts.",
    "Hmm... there seems to be something on here marked as the heart of Arrav.",
    "That sounds like a very noble quest. I think there may be a few significant problems in reaching the heart, though.",
    "Looking at the plans it seems that Zemouregal's inner base has state of the art secret hideout security. The corridor into the area is filled to the brim with human detection spells. These will set off the alarm.",
    "In the kitchen there is an entrance to a sewage system that runs under some parts of the base.",
    "Unfortunately, surges of energy are periodically sent through the water there.",
    "The inner corridor is patrolled by zombies. As they're zombies, they don't have need for a shift change, but their patrolling patterns mean there can be five minute periods when they're not covering certain areas. If they see an intruder they will set off the alarm.",
    "If the alarm is sounded, a gas will fill the area incapacitating all living things in the area.",
    "The vault door is made of five-inch thick runite-enforced steel, with a four digit access code. When the code is entered incorrectly more than twice, the alarm will be set off.",
    "Inside the vault there is a criss-cross of special fire ray enchantments that Zemouregal has made. Touching any of these will do significant damage and set off the alarm.",
    "At the back of the vault is Arrav's heart - in the middle of a continuous Mahjarrat spell. Simply removing the heart would kill Arrav.",
    "It does sound a bit of a challenge, but if we engage in a bit of cunning it may not be as impossible as you might think. Now, let me think... The trickiest bit seems to me to be moving Arrav's heart while keeping it alive - unless you want to just put him out of his misery.",
    "Goodness, you adventurer types do get up to some strange stuff. So, do you have an idea how to move the heart?",
    "Ooh, so your mother dabbles in that kind of thing. I see now.",
    "Ooh, right, that sounds like a good idea, too.",
    "Have you spoken to your mummy yet?",
    "Have you spoken to your mummy yet?",
    "Intriguing... So, there's a liquid that can do such things. Well, that's one step dealt with.",
    "Well, I've had a little think about things and I think you're going to have to be inventive and resourceful, to an extent.",
    "If you bring the correct equipment, you should be able to increase your odds of getting through. First of all, you'll need some kind of insulation to protect yourself from the electric shocks in the sewer. Then you'll need to consider surveillance.",
    "What? No, I said surveillance. Some way of remotely viewing what is happening in secure areas. Oh, and no great heist is complete with out the use of a rope and grappling hook.",
    "Yes, I seem to remember that one of the guards in Varrock knows the way to the Chaos Temple. You should speak to him.",
    "Have you made much progress into Zemouregal's base yet?",
    "Of course. You'll need some sort of insulated protection, some way of remote viewing, and a rope and grappling hook. You will need a crossbow to fire the grappling hook, too. When you have all of that, head to Zemouregal's base.",
    "So, how is the grand heart robbery coming along?",
    "That is excellent news! Let's have a look at it.",
    "Wow! This is really interesting - it's still beating perfectly. Well, you've done lots of the hard work so far, I suppose it's my turn to do lots of research and figure out how to get this back inside Arrav, so that he can finally escape Zemouregal.",
    "It's the least I can do. Arrav is a great hero, after all. Anyway, we're making a great team. You've done really well. I feel we're making great progress bringing those nasty Mahjarrat down a peg or two."
  ],
  "Player": [
    "Not right now, sorry.",
    "Yes, that sounds interesting.",
    "Are you sure these tunnels are related to the Ritual?",
    "Did your contact explore the tunnels much?",
    "Where is the tunnel entrance?",
    "Ah, yes, I'm familiar with it, I've been tobogganing there.",
    "Time for me to go to Trollweiss, then.",
    "Well, I must be going.",
    "No, not yet[sic]",
    "Arrav, it's me, Player. Are you able to talk at the moment, or does Zemouregal have too great a hold on you?",
    "Arrav, I want to help you. Please try to fight against Zemouregal's control!",
    "Yes, I found some plans in them, too. I think they are plans of Zemouregal's base in the south of the Wilderness. I've been there before, but there's more of that area I've not been able to get into. I also found a key, which I think might help me get into the deeper chambers.",
    "Really? That sounds interesting. Arrav did say that these plans could help both of us. Maybe if I can find his heart I can help poor Arrav.",
    "Well, that sounds an awful lot to get past. It sounds like an impossible mission!",
    "If there is a way to save him without killing him, that'd be nice, plus I'm sure he has lots of useful information. I've had experience elsewhere with preserved organs of various sorts, too, which should come in handy.",
    "Not as such, but I know someone who might be able to help. I'm off to talk to a mummy.",
    "Yes, that's precisely what I didn't mean. No, I'm talking about an ancient pharoah queen called Senliten.",
    "What? Oh, right, the mummy. No, I haven't spoken to Senliten yet.",
    "I don't suppose you could help me? During my travels, I've run into a tricky conundrum I hoped you might be able to help with.",
    "I have found a place where a great hero's heart is being kept alive outside of his body by magical means. I need to bring the heart back to the hero, but I am worried about killing him in the process.",
    "That sounds precisely like the situation I have discovered. The hero has been the slave of an evil necromancer for many centuries.",
    "Do you have any idea how I can set things right?",
    "What are the dwellberries for?",
    "Thank you very much. I just hope this works.",
    "Unfortunately, I lost that jar you gave me.",
    "Not yet, but I'm working on it.",
    "I have spoken to a mummy and she taught me how to make a special liquid to preserve the heart.",
    "Great! Now what about everything else?",
    "Inventive? I thought people planned meticulously when raiding high security areas?",
    "Sir Veylantz? Is he one of the Temple Knights?",
    "So, to summarise, I need some sort of insulated protection, some way of remote viewing, and a rope and grappling hook. I'll need a crossbow to fire the grappling hook, too. Then I need to head to Zemouregal's base under the Chaos Temple in the south-east of the Wilderness.",
    "Not yet; can we go over the plan of action again?",
    "Ah, yes, and I can speak to Hartwin in Varrock to get to Zemouregal's base in the Chaos Temple.",
    "I need some way to remotely see if there are any patrolling zombies at the other end of this pipe. I don't want to set the alarm off.",
    "I wouldn't worry. Nobody is going to notice a little macaw flying around a dungeon.",
    "Now to take this back to Ali the Wise, so we can think of a way to help Arrav.",
    "I've done it, Ali, I've got the heart! I'm not sure what to do with it, mind you.",
    "That's very good of you."
  ],
  "Arrav": [
    "Arrgh! I really don't wish to attack you, but my master compels me to.",
    "I am terribly sorry, but it is not I who controls my actions.",
    "If you go to the room to the south and look behind the...arrrgh...flame tapestry, you might be able to find something that can...arrgh...help both of us. My master calls. At last I can cease this battle! Good luck, Player."
  ],
  "Senliten": [
    "Greetings, traveller.",
    "State your questions and I will try to help where possible.",
    "What you say is indeed strange. Let me think upon how this can have come about... Well, one can bind parts of a body while preventing the rest from dying. This renders the person an immortal servant. If the heart continues beating, this prevents the remaining person from having the 'spirit' that would otherwise compel them to fight against it.",
    "I have heard theories of this practice, but it is very dark magic. The heart should stay in the body; it is not removed during the usual process of mummification. I did not conceive that anyone would actually do something like this to another. You live in dark times, traveller.",
    "I wish to give you something that will help, but you have no inventory space.",
    "This is a canopic jar, used for carrying organs. You will store the heart in this, but you must supply the preservatives that will keep the heart alive. You will need to first fill it with some sacred oil, then three dwellberries and finally a ring of life.",
    "My people have long considered dwellberries a fruit with a strong link to the heart. We feed them to people with more conventional heart problems, too.",
    "Greetings, traveller.",
    "Have you managed to help that poor soul with his heart condition?",
    "It is fortunate for you that I have many more."
  ],
  "Macaw": [
    "Awk! Landlubber. Be ye sending me first cos it be real dangerous up that there pipe?"
  ],
  "Congratulations! You have completed": [
    "'The Curse of Arrav' - Complete this quest."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:The_Curse_of_Arrav?oldid=36127543’"
  ]
}