{
  "Player": [
    "Hello King Lathas.",
    "Have your scouts found a way through the mountains?",
    "Iban?",
    "I'll do my best Lathas.",
    "Hello King Lathas.",
    "It's a pretty nasty place but I'm OK.",
    "Hello there, are you the King's scout?",
    "That's OK, I've travelled through many a cave in my time.",
    "I'll take my chances.",
    "Tell me more...",
    "What happened to him?",
    "Hello Koftik.",
    "Hello Koftik.",
    "You'll be okay Koftik...",
    "Gulp!",
    "Aargh!",
    "Koftik, how can we cross the bridge?",
    "Charred arrows? They must have been trying to burn something. Or someone!",
    "Interesting... we better keep our eyes open.",
    "Not to worry, probably just litter.",
    "What does it say?",
    "Hi Koftik",
    "Hello Koftik.",
    "Are you OK?",
    "Tyranny of the righteous? What?",
    "Ouch!",
    "Hi.",
    "Hello.",
    "Hello, are you okay?",
    "Actually I do.",
    "Hello there.",
    "Pardon?",
    "Sorry, I don't under..",
    "Hello...",
    "You're ill!",
    "Hello.",
    "Hello.",
    "It's too heavy to move with just my hands.",
    "I heard something breaking.",
    "All that remains is a damaged horn.",
    "Hello Paladin.",
    "I'm looking for safe route through the caverns, under order of King Lathas.",
    "Great, thanks a lot.",
    "Hello Paladin.",
    "Good day.",
    "Hello there.",
    "Hello.",
    "Koftik, you're still here, you should leave.",
    "Koftik you really should leave these caverns.",
    "Dwarfs?",
    "I'll pray for you.",
    "That's right, I'm on a quest for King Lathas. We need to find a way through these caverns.",
    "What gateway?",
    "But how?",
    "Thanks Niloof, take care.",
    "Hello Niloof.",
    "As I can see.",
    "Hi there, you okay?",
    "What's wrong?",
    "Okay then.",
    "Aaarrgghh!",
    "No thanks.",
    "Okay then.",
    "Here you go.",
    "No thanks.",
    "Hello my good man.",
    "Who?.. Iban's followers?",
    "What happened to them?",
    "Iban?",
    "No wonder their breath was so bad!",
    "Not really, just trying to lighten up the conversation.",
    "I'm not searching that without good reason!",
    "Niloof, I found the Witch's house.",
    "I found a strange doll.",
    "I found a strange doll and a book, but I've lost the doll.",
    "Aaarrgghhh",
    "Aaarrgghh!",
    "Hi Klank.",
    "That's right.",
    "Thanks Klank.",
    "Hi.",
    "Hi.",
    "Pardon ?",
    "Is that possible ?",
    "We were losing you to Iban's influence...",
    "Iban's dead, I destroyed him.",
    "At last! I've had enough of caves.",
    "Thanks for getting me out Koftik.",
    "No, not yet.",
    "Yes, I've told him.",
    "Indeed, the quest is complete, Lathas. I have defeated Iban and his undead minions.",
    "I will be ready and waiting.",
    "No milk for you, puss!"
  ],
  "King Lathas": [
    "Adventurer, thank Saradomin for your arrival!",
    "Not quite, we found a path to where we expected to find the Well of Voyage, an ancient portal to the western mainland. However during recent times a cluster of cultists have settled there, run by a madman named Iban.",
    "A crazy loon who claims to be the son of Zamorak. Go meet my main tracker, Koftik. He will help you. He waits for you at the west side of West Ardougne. We must find a way through these caverns if we are to stop my brother Tyras.",
    "A warning traveller, the underground pass is lethal. We lost many men exploring those caverns. Go prepared with food and armour or you won't last long.",
    "Traveller, how are you managing down there?",
    "Well keep up the good work.",
    "The traveller returns; any news?",
    "Incredible! You are a truly awesome warrior. Now we can begin to restore the Well of Voyage. Once our mages have re-summoned the well, I will send a band of troops led by yourself to head into the western mainland and stop Tyras.",
    "Your loyalty is appreciated, traveller."
  ],
  "Koftik": [
    "That I am, brave adventurer. King Lathas informed me that you need to cross these mountains. I'm afraid you'll have to go through the ancient underground pass...",
    "These caves are different... They're filled with the spirit of Zamorak! You can feel it as you wind your way round the stalagmites.. an icy chill that penetrates the very fabric of your being... Not so many travellers come down here these days, ...but there are some who are still foolhardy enough.",
    "Okay traveller, I'll catch up with you by the bridge.",
    "I remember seeing one such warrior. Going by the name of Randas... ..he stood tall and proud like an Elven King... ...That same pride made him vulnerable to Zamorak's calls. Randas' worthy desire to be a great and mighty warrior also made him corruptible to Zamorak's promises of glory. ..Zamorak showed him a way to achieve his goals by appealing to that most base and dark nature ...that resides in all of us.",
    "No one knows...",
    "I know it's scary in there, but you'll have to go in alone. I'll catch up as soon as I can.",
    "Once you're over the bridge keep going straight ahead, I'll meet you further up.",
    "It scares me in there, ... The voices, don't you hear them?",
    "I'm not sure, seems as if others were here before us though...",
    "I found this cloth amongst the charred remains of some arrows.",
    "I have also found the remains of a book...",
    "Well.. maybe?",
    "It seems to be written by the adventurer Randas. It reads...",
    "Hi - I found this cloth amongst the charred remains of some arrows, perhaps you need it?",
    "Do you hear them? The voices tell me things.",
    "The path of the righteous man is beset on all sides by the iniquities of the selfish and the tyranny of evil men.",
    "So many paths to choose... Here we must all take our own path.",
    "Traveller is that you?.. my friend on a mission!",
    "Leave?...leave?..this is my home now. Home with my lord, he talks to me, he's my friend.",
    "Not now, we're all the same down here. There's just you and those Dwarfs left to be converted.",
    "Foolish Dwarfs, still believing that they can resist. No one resists Iban, go traveller. The Dwarfs to the south, they're not safe in the south. We'll show them, go slay them m'lord. He'll be so proud, that's all I want.",
    "Nice job killing those Paladins. You're much closer to his side now. Perhaps you could kill those dwarfs to the south...",
    "Traveller, where am I? I can't remember a thing!",
    "What?..of course, the voices. ...But they've stopped. What happened?",
    "You've done well, now we must inform the King. He'll have to send in some high mages to resurrect the Well of Voyage. Follow me, I'll lead you out.",
    "Always a pleasure squire. Have you informed the king about Iban?",
    "Traveller, this is no time to linger. The King must know that Iban is dead. This is a truly historical moment for Ardougne.",
    "Good to hear, the sooner we find King Tyras the better."
  ],
  "The following text is transcluded from Transcript": [
    "The Diary of Randas."
  ],
  "Slave": [
    "Blood, blood... never enough blood to go round. When I lift up my arm like this, it all pours back into my body. I hope it remembers to go back inside my arm. And don't even ask me about my legs.. how much blood are they going to need? Blood is important. We must offer it to Zamorak every day as proof of our devotion. I just hope I don't run out!",
    "Eating me...they keep eating me! Eating me from the inside. Please stop them! around inside me right now. ... please stop them.",
    "Oh yes, you're a fine one. Nice red cheeks, shiny hair. Let's see now, some potatoes, some cabbage... Maybe half a clove of garlic... ...Yes I think you'd make a fine soup. You don't mind do you?",
    "You're welcome to have some with me of course..",
    "Mwaarrr fnnntchh. Gbpp dng sktd delp?",
    "Kjp lar falut: Gbpp dng sktd delp?",
    "Mwaarrr fnnntchh. Gbpp dng sktd delp? GBPP DNG SKTD DELP!",
    "Kill the villagers, burn them all.. every last one. I want nothing to survive ...nothing but the sweet smell of burning flesh...",
    "What's that.. you've never smelt it before? Well, let's just say that it's an acquired taste...",
    "What's that...Is that a dagger I see before me? Why should I bear the slings and arrows of outrageous fortune, For what is a man but this quintessence of dust? And so I say goodnight sweet prince. The rest is silence.",
    "Danger, everywhere danger! But not from man nor beast! This is the danger that is inside you. Bring it out, nurture it, cherish it. Stroke it like you would stroke a wounded bird... then strangle it before it takes hold of your very being. Don't say I didn't warn you."
  ],
  "Sir Jerro": [
    "Traveller, what are you doing in this most unholy place?",
    "You've done well to get this far traveller, here eat...",
    "You should leave this place now traveller, I heard the crashing of rocks further down the cavern. Iban must be restless. I doubt not that Zamorak still influences these caverns. A little further on lies the great door of Iban. We've tried everything, but it will not let us enter. Leave now before Iban awakes and it's too late."
  ],
  "Sir Harry": [
    "Watch your back, the undead are about here..."
  ],
  "Sir Carl": [
    "Take care down here, Evil things are abroad..."
  ],
  "Sir [Carl/Harry/Jerro]": [
    "You again... die Zamorakian scum!"
  ],
  "Niloof": [
    "Back away! Back away! ....Wait. ...You're human!",
    "Ha ha, listen up. We came here as miners decades ago, completely unaware of the evil that lurked here. There's no way through, not while Iban still rules. He controls the gateway, the only way to the other side.",
    "It once stood as the 'Well of Voyage'. A gateway to the West. Now Iban's moulded it into a pit of the damned, a portal to Zamorak's darkest realms. He sends his followers there, never to return. Only once Iban is destroyed can the well be restored.",
    "If I knew, I would have slain him already. Seek out the Witch, his guide, his only confidante. Only she knows how to rid us of Iban. She lives on the platforms above, we dare not go there. Here, take some food to aid your journey.",
    "You too.",
    "So you still live, not many survive down here.",
    "Don't stay too long traveller. Iban's calls will soon penetrate your delicate human mind. You'll also become one of his minions... You must go above and find the witch Kardia. She holds the secret to Iban's destruction.",
    "And...?",
    "Well it's a good job I found it.",
    "The witch's rag doll. This here be black magic traveller. Iban was magically conjured in that very item. His four elements of being are guarded somewhere in this cave... His shadow, his flesh, his conscience and his blood. If you can retrieve these, with the flask, you will be able destroy Iban and resurrect the 'Well of Voyage'."
  ],
  "Kamen": [
    "Hic!",
    "Ooooh, my head ...I'm fried.",
    "Too much of this home brew my friend. We make it from plant roots, but it blows your head off. You don't wanna put it near any naked flames. Want some?",
    "Here you go... Hic!",
    "Ha ha! I warned you - it's strong stuff. Havea  good meal; it may sober you up a bit.",
    "Your losh... Hic! Well maybe a good meal? I could part with some food for a few coins.",
    "75 coins pleashe.",
    "Thanks... Eat well.",
    "Well come back any time."
  ],
  "Klank": [
    "Good day to you outsider. I'm Klank, I'm the only blacksmith still alive down here. In fact we're the only ones that haven't yet turned. If you're not careful you'll become one of them too!",
    "They're not followers, they're slaves, they're the Soulless...",
    "They were normal once, adventurers, treasure hunters. But men are weak, they couldn't ignore the voices. Now they all seem to think with one conscience... As if they're being controlled by one being...",
    "Maybe... maybe Zamorak himself. Those who try and fight it Iban locks in cages, until their minds are too weak to resist. Eventually they all fall to his control...",
    "You think this is funny... Eh?",
    "Hmph!",
    "Traveller, I hear you plan to destroy Iban?",
    "I have a gift for you, they may help. I crafted these long ago to protect myself from the teeth of the Soulless, their bite is vicious. I haven't seen another pair which can withstand their jaws...",
    "Oh... you have a pair of my gauntlets, look after them.",
    "Good luck traveller, give Iban a slap for me!"
  ],
  "Kardia": [
    "Here kitty, kitty!",
    "Get away... Far away from here!",
    "Ha ha... die mortal!"
  ],
  "[A voice from the tomb]": [
    "Leave me be!"
  ],
  "Disciple of Iban": [
    "An impostor... Die, scum!",
    "Iban is our father, our guide. Soon he will rule all life.",
    "Som Molica Aniul Demonte.",
    "Hail the great one, my lord Iban. I die for you again and again.",
    "Under Iban anything is possible. Death is only the beginning.",
    "Succumb to the might of Iban, the ruler of this world."
  ],
  "Iban": [
    "Begone from my temple!",
    "Fool!",
    "I'll swallow your soul!",
    "You belong in the slave pits!",
    "You will die, frail mortal.",
    "You dare to defy me?!?",
    "Who dares desecrate my temple!",
    "I am the great Iban, I cannot die!",
    "Who dares to bring the witch's magic into my temple?",
    "An imposter dares desecrate this sacred place!",
    "...Home to the only true child of Zamorak.",
    "Join the damned, mortal!",
    "What's happening? It's dark here...so dark!",
    "I'm falling into the dark, what have you done?",
    "Noooooooo!"
  ],
  "Congratulations": [
    "You have completed: 'Underground Pass' - Complete this Experienced quest."
  ],
  "Witch's cat": [
    "Sssss! Thou art brave to wander so far into the domain of Kardia, mine mistress! But soon thou shalt become a soulless servant of Lord Iban, like all who come here. Glad shall mine heart be when I see thee prostrate thyself before the altars of Zamorak the Mighty.",
    "Zamorakus mortem tuum erit!",
    "In nomine Zamoraki, ite!",
    "In Zamorake fides meus."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Underground_Pass?oldid=36211270’"
  ]
}