{
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "Misc dialogue (Some has been gathered but needs to be arranged and reformatted - see comments in wikitext - and much more still needs collecting)You can discuss this issue on the talk page or edit this page to improve it."
  ],
  "Player": [
    "Hello Mord.",
    "Well my name is [Player], but I am known as [Fremennik Name] by the Fremennik. May I ask who you are?",
    "Tell me more about Jatizso.",
    "Phew!",
    "Tell me more about the King of Jatizso.",
    "Can you ferry me to Jatizso?",
    "I'm too busy to help your King.",
    "I may be back later.",
    "Tell me about Neitiznot's geography.",
    "Tell me about the islands' history.",
    "Tell me about Burgher Mawnis Burowgar.",
    "Can you ferry me to Neitiznot?",
    "I just stopped to say 'hello'.",
    "I may be back later.",
    "Indeed I am.",
    "How may I assist your Highness?",
    "You mentioned a task requiring my unique-",
    "Yes, that's probably a good idea.",
    "Will any raw tuna do?",
    "Yes, I have your pet's fish.",
    "Wait a minute! I'm fairly handy with a pick axe. Maybe I can help; what do you need?",
    "If I just happen to have the ore you need in the bank, do I need to go down to your mines?",
    "Hmmm, interesting. I'll get the ore then.",
    "I have the ore here, sir.",
    "Certainly, your Majesty.",
    "Ahem, I see, sir. How may I help in this matter?",
    "You want me to play the lyre? Well actually, I've been working on a few tunes in my spare time. I have this new song abou-",
    "Oh. It's a great tune, very catchy, you'll love-",
    "So this is a covert operation into Neitiznot? You need me to infiltrate the Burgher's hall, undercover, and uncover his evil plans?",
    "Sounds like a task for an elite adventurer like myself. Mission accepted.",
    "So what is the easiest way to get to Neitiznot?",
    "Are you sure that's the best way?",
    "I'll be off then.",
    "Costume?",
    "What sort of password is that?",
    "Fine. What's his name?",
    "So how will I recognise him?",
    "Hello.",
    "...",
    "Not very talkative are you?",
    "...",
    "I'll be off then.",
    "The blue fish leap northwards at dawn.",
    "The cabbages bloom in the spring.",
    "I bought an aardvark from Ardougne market.",
    "...err...sprockets wangle burps in the forked flan.",
    "No, not really.",
    "It rains frogs during the Winter in Neitiznot.",
    "The cabbages bloom in the spring.",
    "I bought an aardvark from Ardougne market.",
    "...err...sprockets wangle burps in the forked flan.",
    "No, not really.",
    "Free stuff please.",
    "Budgie? That's not my name, you can call me-",
    "Shouldn't that be... never mind. So Mr. Hemli-",
    "Sorry, no names, I forgot.",
    "How come you get the cool name, and I get called Budgie? Can't I be called Operative Panther? Yeah I like that, panthers are cool. Rarrrr!",
    "Fine, whatever, I don't care anyway.",
    "Very well.",
    "I am ready.",
    "Hmmm. I'm beginning to think that this spy malarkey is not as cool as I thought.",
    "I just need to visit the bank.",
    "Colourless green ideas sleep furiously.",
    "The cabbages bloom in the spring.",
    "I bought an aardvark from Ardougne market.",
    "...err...sprockets wangle burps in the forked flan.",
    "No, not really.",
    "Errr, hello. I'm an unemployed jester looking for work.",
    "Well, I'm as entertaining as a juggler with a bag of ferrets down his trousers.",
    "I like an easy, I mean appreciative audience. Shall I start?",
    "I hope I can amuse and delight as much as your last jester.",
    "I see, a tough crowd then. I'd better get this right! Let me entertain you!",
    "Thanks.",
    "Yes I have.",
    "I am ready to answer your questions, Operative Nighthawk.",
    "I need to make a fool of myself again.",
    "They are ready now.",
    "They will be ready tomorrow.",
    "They will be ready in two days.",
    "Sixteen militia have been trained.",
    "Seventeen militia have been trained.",
    "Eighteen militia have been trained.",
    "There are two bridges to repair.",
    "There are three bridges to repair.",
    "There are four bridges to repair.",
    "I would not lie to you.",
    "'Big Daddy'? Do you mean the K-",
    "I heard you had an accident whilst juggling?",
    "Is that so?",
    "Ahem. I am indeed known as [Fremennik Name] by those in Rellekka. If I am the one you seek, then how may I assist you?",
    "Ha! It is trolls that fear me! I am Fremennik!",
    "I would be honoured to assist you and your tribe, Burgher Burowgar. Indeed I expected no less. This sort of thing seems to happen to me a lot.",
    "Of course, Mawnis Burowgar.",
    "Is any rope fine for this?",
    "Hmmm, the rope I've seen round here looks exactly the same as the rope I'm used to. It's exactly the same isn't it?",
    "As it happens, I'm carrying enough rope on me right now.",
    "It is.",
    "Err, no. I had a feeling I'd need it.",
    "Not exactly.",
    "No, no, no! It's just a coincidence. Err, I spend my time trading rope. Yes that's right. I'm a rope trader and I just happen to have my wares on me.",
    "You asked for it! Do you want this rope or not?",
    "Right! I'll just go to the bank and get some rope.",
    "I thought rope was made from wool. Not yak hair.",
    "So how come Ned from Draynor makes rope out of wool?",
    "So Ned doesn't make the rope? What a fraud! He had me fooled for so long. Anyway, so that means that all rope is made by Neitiznot from yak hair.",
    "So if I happen to have some rope in the bank then that would also be made from high quality Neitiznot yak hair.",
    "So I could just give you the rope I already have, rather than make more rope?",
    "I've had enough of strange 'coming of age' rituals for the time being. I'm going to go to the bank and get the rope you need.",
    "I have them right here!",
    "I'll do that shortly. So, I've done your menial task; what is this secret quest? That's what really interests me.",
    "Very well, what must I do next?",
    "I see. That shouldn't be a problem.",
    "I would be happy to help your kinsfolk, Mawnis Burowgar.",
    "I have them right here.",
    "Very well, what must I do next?",
    "Very well, I shall get on with that now.",
    "I have a bank note for the split logs with me now.",
    "I have carried out your orders, Sir.",
    "That is most generous of you, Sir.",
    "Troll caves!",
    "I am honoured, Burowgar. I gratefully accept your offer to lead the charge against your foes.",
    "I'm afraid that may be true sire.",
    "I can do this sire.",
    "Err, no. I believe I already have all the... contacts I need.",
    "I have, sir. They have been repaired.",
    "The Fremennik are a very resourceful folk, your majesty.",
    "You majesty.",
    "I'm not sure that's such-",
    "Hey you-",
    "Err, what? I'm not sure I agree with-",
    "Why would I want to be a tax collector for a-",
    "Thorkel, can you tell me about this taxation?",
    "It's tax time I'm afraid.",
    "I'm afraid the King has instituted a new Window Tax. 1000gp per window.",
    "This tax does seem a little harsh on you.",
    "But, rules are rules. Pay up!",
    "I'll think about it a bit.",
    "I am now the royal tax collector.",
    "I'm afraid the King has instituted a new Window Tax to pay for the defence of the realm. It is 1000gp per window.",
    "This tax does seem a little harsh on you.",
    "But, rules are rules. Pay up!",
    "I'll think about it a bit.",
    "I have been appointed by the King to collect taxes.",
    "I'm afraid the King has instituted a new Window Tax to pay for the defence of the realm. It is 1000gp per window. The tax is per building so only one of you have to pay.",
    "This tax does seem a little harsh on you.",
    "But, rules are rules. Pay up!",
    "I'll think about it a bit.",
    "I'm afraid the King has instituted a new Window Tax. 1000gp per window.",
    "This tax does seem a little harsh on you.",
    "But, rules are rules. Pay up!",
    "I suppose I could pay the tax for you.",
    "I'll think about it a bit.",
    "I've collected the Window Taxes as instructed.",
    "So NOW you want me to collect money from everyone that has a beard. I'm not sure whether to laugh or cry. What about moustaches?",
    "Grrr. Of course you do, sire.",
    "I'm back for more tax.",
    "Errm, it's beards this time! According to my books, you owe 1000gp!",
    "I'm afraid all facial hair counts for tax purposes.",
    "Sorry, facial hair is facial hair and is liable for taxation. No arguments.",
    "But rules are rules. Pay up! You owe the state 1000.",
    "I'll think about it a bit.",
    "I'm back for more tax.",
    "This time the King has decided to tax facial hair! According to my books, you owe 1000gp!",
    "But rules are rules. Pay up! You owe the state 1000.",
    "I'll think about it a bit.",
    "I return once more...",
    "Well, I can't say I blame you, since I need to tax you again.",
    "This time the King has decided to tax facial hair! According to my books, you owe 1000gp!",
    "You may have a point there.",
    "But rules are rules. Pay up! You owe the state 1000.",
    "I'll think about it a bit.",
    "I'm back for more tax.",
    "I sympathise; it's been a very taxing day for me as well.",
    "This time the King has decided to tax facial hair! According to my books you owe 1000gp!",
    "Yes you do!",
    "Yeah right, no more excuses!",
    "But rules are rules. Pay up! You owe the state 1000.",
    "I'll think about it a bit.",
    "I'm back for more tax.",
    "It is a bit, isn't it. Still, he's your King not mine!",
    "Don't ask me why, but this time it's beards! According to my books, you owe 1000gp!",
    "Alright, I get the idea.",
    "But rules are rules. Pay up! You owe the state 1000.",
    "I'll think about it a bit.",
    "I have taken money from those with significant facial hair.",
    "Yes, I don't think your citizens would have coped with another round of tax.",
    "Bridge repairing?",
    "Really? I wonder who?",
    "That should not be a problem.",
    "Well, I've got the ridiculous costume on again.",
    "Err, of course sire. I assure you this act will be somewhat different.",
    "Let me entertain you.",
    "Thanks.",
    "Yes, I am.",
    "I am ready to answer your questions.",
    "No, I need to make a fool of myself again.",
    "They are in a secluded bay, near Miscellania.",
    "They are in a secluded bay, near Etceteria.",
    "They are in a secluded bay, near Rellekka.",
    "They will be given some potions.",
    "They will be given some fine ale and meat.",
    "They will be given some party hats and balloons.",
    "Chieftain Brundt of Rellekka has been helping Neitiznot.",
    "Advisor Ghrim of Miscellania has been helping Neitiznot.",
    "I have been helping Neitiznot.",
    "I would not lie to you.",
    "I was following your orders, Sir. I was given strict instructions to go along with Mawnis Burowgar's orders while investigating their island. As I told your fool of a Spymaster, Neitiznot's militia are not going to attack you.",
    "It is no army Neitiznot has trained, but a raiding party, sire. Mawnis Burowgar's goal is to see the leader of the trolls beheaded.",
    "... Right! That's it! I've had enough! No more lying! No more biting my tongue! Do I take you for a fool? Yes I do! You are so paranoid about Neitiznot that you are running this island into the ground! Neitiznot is not going to attack Jatizso. I'll say it again to try and force it into your thick skull! Neitiznot is not going to attack Jatizso. They don't care about Jatizso. They care about the trolls and Troll King who are the real threats to the islands. You are so obsessed with your cousin, however, that you stick your head in the sand whenever it comes to the trolls. But I'm not sure it matters, since I think there is a good chance that you will destroy this village long before the trolls get here! You do not have to dress in a jester's costume to act the fool, your royal crown is more than enough!",
    "Maybe if they had, you wouldn't be in this mess.",
    "I'd like to see you try.",
    "You haven't listened to a single word I've been saying, have you?",
    "Do you even know where to find the Troll King? Your warriors are underfed and tired; your weapons inadequate. You don't stand a chance. Join with your brethren and you may share the glory and perhaps find a way to make peace between your lands. I'm sure the Burgher would be glad of your aid.",
    "Fine. I give up. I will do this final task for you. After that you're on your own – may the gods be with your troops – they're going to need it.",
    "I have, sir. I was instructed to give you this decree by King Sorvott.",
    "Now that Jatizso's spies have learnt of your plans to attack the troll caves, King Sorvott is raising his guards to assault them himself. I believe he plans to depart before you can be ready.",
    "Very well. What do these rites entail.",
    "Thank you, Fridleif. I shall return with the yak-hides soon.",
    "How did you know that?",
    "Cure my yak-hide, please.",
    "Cure all my hides.",
    "Cure one hide.",
    "Cure no hide.",
    "Can you cure any other type of leather?",
    "No thanks, I'll be off then.",
    "Thakkrad has helped me to complete the traditional armour of a Fremennik warrior.",
    "How may this be crafted?",
    "Thank you. I shall return with a shield soon.",
    "Fridleif has helped me to complete the traditional shield of the Fremennik warrior.",
    "I [Fremennik Name] swear to uphold the virtues of courage and honour.",
    "I shall make my way over to them now, so that we may defeat this foul Troll King.",
    "Hmm. Left, right, then left again... I'm lost. Best I head towards the sound of the fighting.",
    "It was a hard journey here. I trust you all made it here intact?",
    "Well said!",
    "I will find the Troll King there, correct?",
    "The fact you've saved any at all proves your bravery.",
    "Ready, men?",
    "Warriors, advance!",
    "I have returned victorious, Mawnis Burowgar.",
    "I offer the beast's head as proof that I have completed your task, sir.",
    "My thanks for the honour you have bestowed upon me, Mawnis Burowgar.",
    "I thank you for presenting me with such a finely crafted helm, sir.",
    "I look forward to any other tasks you may have for me in the future, Burgher Burowgar.",
    "I do not think I can help you with that sire. I don't think King Sorvott is speaking with me anymore.",
    "Fare thee well, kinsmen of Neitiznot.",
    "Thanks Thakkrad. Does that mean that I have access to the drakolith ores on that island?",
    "It was a hard fought battle, but we Fremennik prevailed!",
    "It would be an honour to be remembered in such a way! Thanks.",
    "Fine, whatever.",
    "Good luck with dealing with the King. You'll need it!",
    "I have come to inform you that you may recall your guards; the Troll King was slain by my hand.",
    "Guards! Where are your Guards?",
    "Oh. Are they still recovering from their defeat against the trolls?",
    "Very well, your Highness, I leave you to contemplate this...",
    "Should you have approached me honestly and truthfully, rather than with lies and secrecy,",
    "then it could have been you holding the head of the Troll King aloft today.",
    "We can but hope Thorkel.",
    "No, I was just leaving.",
    "Hello cat.",
    "What?",
    "Thanks. Hmmm, do you know something? This rope has a funny smell.",
    "Yes, It reminds me of... yaks. I was travelling in the Fremennik Isles recently and, do you know what? They made rope out of yak's hair.",
    "There was a lady over there who sold wool, she said she traded rope for the wool.",
    "I don't think you make rope at all. I think you trade balls of wool for rope.",
    "Yes, well, the wool is still pretty good, though yak hair makes fine rope. I don't suppose any harm will come of it.",
    "Well, it's always good to keep on the good side of a sailor. Your secret is safe with me.",
    "I will do that!"
  ],
  "Mord Gunnars": [
    "Hello, are you [Fremennik Name] by any chance?",
    "Of course, I am Mord Gunnars, a humble ferryman. I come from an island north of here called Jatizso, while my wife Maria is from Neitiznot.",
    "The King of Jatizso has requested that I take you to him, as he has an important task for you.",
    "Well now, the history of the isles is a bloody tale. When told in its intended form it takes 9 days and 9 nights. However, I will give you the abridged version.",
    "Four generations ago there was a mighty king who ruled wisely and was loved by all. He had many sons, most of whom proved themselves in the usual Fremennik ways of fighting, sailing, drinking, and so on. His youngest two sons, however, were a problem. Ever since they were old enough to hit one another they had bickered and fought.",
    "Hey! Who's telling this story? Ahem. At the time it was customary for the King's sons to claim a prize from his treasury when they came of age. Each brother rallied support and strode out to confront the other on the field of battle to claim the same prize. The brothers met on the field, limbs were bruised, bones were crushed and heads clashed.",
    "Can I finish the story without interruptions?",
    "Anyway, long into the night they fought, until they stood alone, facing each other. On the second day the old king, whose patience was exhausted, strode out onto the battlefield and demanded to know who had claimed his prize. Jatizso looked at his father and told him yes, it was his, to which the other called out 'No! It's not'. And so, the argument continued through to the third day, with the sounds of 'Jah! 'tis so!', 'Ne! It's not!' echoing over the field, becoming more hoarse as the darkness enveloped the brothers.",
    "At the end of the third day, when the brothers lay unable to move, let alone stand, the King stood between them in shame. As punishment for their squabbling he banished his sons from his realm, ordering that neither should return until they had conquered lands of their own. Jatizso set sail with a band of loyal followers, sailing into the east, while Neitiznot went west. Jatiso ventured far into uncharted oceans, his crew dwindling as the trials of sailing and sea monsters took them. Jatizso's ship limped through the frozen wastes, in need of repairs, fighting off pirates who thought them easy pickings. At last a promising land was sighted, a land rich in minerals, deep fjords and sweeping mountains. Jatizso claimed the land and named it after himself. A mighty citadel was constructed to protect his land, then Jatizso set forth to explore his new kingdom. Crossing a few fjords, Jatizso spied an island which remained green and fertile, even at such latitude. With a mighty cheer Jatizso and his men marched on the island. Upon reaching the island, however, they discovered a wooden stockade. Determined to be master of all the land, Jatizso stood in front of the gates. He looked up and demanded that those within the stockade surrendered. Jatizso was horrified when his brother appeared on the battlements and cried 'This is my land! Go find yer own'. To which his brother replied 'No it's not!', throwing some rocks for good measure. And so the blood feud continued. The fighting between the towns has continued for generations with little sign of improvement. Quite recently a massive troll army seized one of the islands to the north, while our townships' militia were busy fighting one another. They marched down and razed Neitiznot to the ground while Neitiznot's troops laid siege to Jatizso.",
    "Yes, dear. Anyways, a hasty sort of peace has been agreed until the trolls are dealt with. But you can still see the bitter rivalry as guards hurl insults between the towns.",
    "Ha! Our benevolent King Gjuki Sorvott IV. He is short-tempered, arrogant and cares little about anything except outdoing Neitiznot's Burgher.",
    "I'm surprised King Sorvott wishes to talk to you. Don't expect much in the way of gratitude.",
    "Of course.",
    "I guess I won't be getting paid for finding you then.",
    "Bye.",
    "Well, as I have mentioned, I am from an island called Jatizso, while my wife is from another island called Neitiznot. Neitiznot is a far less sophisticated and successful island which will not see reason with Jatizso.",
    "Ja it iz so!",
    "Jatizso is rich in minerals, and trades extensively, while Neitiznot has stolen all the decent arable land.",
    "Well, that wealth is needed to buy the food from Neitiznot at extortionate rates!",
    "Ok Maria, stop that!",
    "Thank you!",
    "'Soft' is the word we use in Jatizso.",
    "You mean while Neitiznot's militias were assaulting Jatizso.",
    "May their journey to our ancestors' halls be swift."
  ],
  "Maria Gunnars": [
    "Hello.",
    "Their names were Jatizso and Neitiznot.",
    "They probably didn't notice the head-clashing bit. Too thick skulled!",
    "Carry on dear.",
    "Bah! What they needed was a good clip round the ear.",
    "The smoke damage was atrocious, I had to replace my entire wardrobe.",
    "He's not at all like Burgher Burowgar.",
    "[Dialogue before The Fremennik Isles missing]",
    "Sure.",
    "Ne it iz not!",
    "Ahem, anyway, the islands are in a small volcanic archipelago north of here. Along the main isles there are numerous small islands and a frozen northern island that was recently overrun by trolls.",
    "Only because Jatizso hogs all the wealth.",
    "Only because Jatizso hogs all the wealth.",
    "Ok dear!",
    "Where was I? Yup, that covers the layout of the islands.",
    "Well Burgher Mawnis Burowgar is a gentle soul at heart. His kinsfolk are happy and content with their lot.",
    "Well a soft Burgher is better than a stupid King. Anyway, there was a time when Burgher Burowgar was similar to King Sorvott. Argumentative, short tempered; I am sure you know what I mean. The change happened when the trolls came and razed Neitiznot to the ground.",
    "Yes, well out tribes have been at war for nearly four generations now. Anyway, the Burgher lost his wife and youngest son in the trolls' raid and has been a changed man ever since.",
    "Personally, I am much happier with the considerate Burgher we have now.",
    "Thanks, and good luck with the Burgher's tasks.",
    "Bye."
  ],
  "King Gjuki Sorvott IV": [
    "Guard, who is this outlander?",
    "Is this true? You are the outlander who has been given a Fremennik name?",
    "Excellent.",
    "Behave Hrafn!",
    "I have a task that requires your unique-",
    "Not now, Hrafn. Now where was I?",
    "Ah, yes. Your unique position among Fremennik-",
    "Hrafn! Oh, alright, alright, I give in.",
    "Look, could you fetch my cat some fish? Then we can finish our conversation in peace.",
    "Thank you. Hrafn will only eat raw tuna.",
    "Yes, fussy though Hrafn is, he doesn't care where the tuna comes from. If you don't already have any, you can catch some down by the docks, or you can buy some from my fishmonger, Flosi Dalksson.",
    "Hello again, [Fremennik Name]. Do you have a piece of raw tuna for Hrafn?",
    "Excellent.",
    "Now, what was I saying? Ah, yes, so the Burgher of Neitiznot Island is an enemy of free-thinking Jatizso citizens. My informants tell me an increased number of trade ships have been seen docking at their ports. They must be preparing for something. Chancellor, fill in the details.",
    "What? We cannot afford to offend the Red Axe traders. Where are they now?",
    "Another good reason to get them their ore and get them out of town. Get all our miners on the job now!",
    "Bah! Those miners haven't learned their lesson. It may be time for some extra incentives.",
    "Hello again, [Fremennik Name]. Do you have all the ore my Chancellor requested?",
    "This [man/woman] has gathered the remaining ores needed by Keldagrim's merchants.",
    "Please reward this [man/woman] for [his/her] efforts.",
    "Right. Now let us get down to business, young [Fremennik Name]. Let us hope we have no more interruptions.",
    "Neitiznot's Burgher, Mawnis Burowgar, is a simpleton and a fool. I have bested him before and will do so again! He is surely plotting a new plan to defeat me. He's up to something, he's always up to something. I will not be kept in the dark about his plans any longer. I must know what underhand tricks he'll use to undermine me. He's out to get me! Get me I say!",
    "Well, I have heard that some call you 'bard' in Rellekka. Your lyre-playing reputation has carried this far.",
    "Silence! I do not wish to hear your wailing. All bards are charlatans and fools. However, a fool is exactly what I need right now.",
    "Bah! Bards are all the same, they never shut up! If I need to be entertained I'll hire a mime; maybe I'll get some rest then. Now if you'll listen, I'll explain what I want you to do. In the past I have sent my Spymaster to 'entertain' the Burgher, and to see what he can find out. You see, the Burgher of Neitiznot and his aides like a drink when they are being entertained, and their tongues are loose when they drink. However, yesterday my spy had an accident and could no longer help me in this task. However he is still stationed on Neitiznot.",
    "Exactly, [Fremennik Name]. So are you interested?",
    "Excellent, [Fremennik Name], you and I will get on very well.",
    "I suppose you catch Mord's ferry back to Rellekka and then catch a ferry from there.",
    "You may find a way across the islands, but the bridges are almost certainly broken, and there are trolls which are a bit of a nuisance. The ferry is probably both quicker and safer.",
    "Oh, there is one more thing. In order to gain an audience with the Burgher, you will need my Spymaster's, err, costume.",
    "The costume is in my chest. Don't forget to pick up all the pieces. Then travel to Neitiznot and talk to my Spymaster. He is still over there. He will fill you in with the details, and you may report to him. Oh, the Spymaster is a secretive kind of guy. He will require a password. The password is 'free stuff please'.",
    "Don't ask me, it was his idea.",
    "His name is Slug Hemligssen, but don't expect him to answer to it.",
    "Don't worry, you'll find him.",
    "Have you gathered the information about when Neitiznot's bridges will be repaired?",
    "Outrageous, how are they working so rapidly?",
    "We must amass our troops immediately. We must be ready for Neitiznot's army to attack us.",
    "Chancellor, how are the city's coffers? We will need to pay for weapons and food for our soldiers.",
    "What! That is not acceptable! How am I supposed to run this city when I am surrounded by incompetence! Now, more than ever, we need to protect ourselves from the threat of Neitiznot. This is a time of national crisis. Every citizen of Jatizso must bear the burden of protecting our homes. If it means that as citizens we must sacrifice some luxuries for the good of Jatizso, then it must be so. We must raise more taxes.",
    "Yes, well, whatever. Needs must. Think up a new tax.",
    "Be quiet serf.",
    "Yes, I was having a discussion with King Vargas the other day. He was saying some places have taxes for all kinds of things; fur taxes, blueberry taxes, tea taxes, playing card taxes. All we need to do is pick something that lots of people have. How about a Window Tax? We have windows on the island.",
    "Yes, yes. That's an excellent idea. I now institute a new Window Tax. Every building with windows. Other countries have Window Taxes, we need them as well.",
    "Well, you had better find a way, and fast! Oh, [Fremennik Name] you seem like someone who gets things done. I now appoint you official tax collector of Jatizso!",
    "Did you say something?",
    "[Fremennik Name]! I command you to refill the royal coffers! Thorkel will work out the details.",
    "Excellent. Chancellor, we must have enough to pay for the new equipment.",
    "Bah! Again, brave Jatizso citizens, sacrifices must be made.",
    "Hmmm. Any ideas anyone?",
    "Beer? No that's a silly thing to tax. No, that really would cause a riot. Hmmm, beer, beers, beards. Beards! Beards, Only the King and his advisors should be allowed un-taxed beards. I now proclaim there will be a new tax on beards.",
    "Oh yes, tax those too.",
    "Good, good. Chancellor, how do our finances look now?",
    "Ah, much better. I always find the sound of gold coins being poured into the treasury relaxing.",
    "I have another task for you. Your espionage mission was so successful that I need you to do the same thing again. Except this time I want you to find out more about the bridge repairs they have been doing.",
    "Indeed! I have heard rumours that they have been getting some help from somewhere.",
    "You'd better find out and quickly. Get on it! Go to Neitiznot with all haste! The Spymaster will have the details, as last time.",
    "I have just one final task before you leave [Fremennik Name]. Guards, secure the doors! So you admit that it was you who repaired Neitiznot's bridges?",
    "Then why does Burgher Mawnis Burowgar amass an army?",
    "Do you take me for a fool [Fremennik Name]? It's all lies! You must have been brainwashed by my cousin! He is EVIL and wants to destroy me! Jah Tiz so! Tiz so!",
    "... No-one has ever talked to me like that before.",
    "I should have you beheaded.",
    "So it seems that my cousin's plan is to demonstrate his superiority by killing the Troll King. I cannot let that happen! I will not let him steal the glory.",
    "We amass our forces now! There is no time to lose. At dawn my men will march upon my ancestor's nemesis, the Troll King.",
    "Bah! Don't be ridiculous! He would just stab me in the back and claim the glory himself. My brave warriors will find the Troll King and slay him first. How could they not, they are Jatizso warriors, not Neitiznot scum. You will deliver my decree to Burgher Mawnis Burowgar. You shall inform him that my troops attack the western troll caves at dawn and that his interference shall be considered an act of WAR! Long live Jatizso! Long live ME!",
    "Fine. Take the decree and go.",
    "You again. Come to tell me how to run my kingdom again?"
  ],
  "Hrafn": [
    "Meeow? (An outlander, how unusual. Welcome.)",
    "Miouw...meow. (You have a human Fremennik name, how unusual.)",
    "Meouw! (Well, outlander, one requires a fish immediately.)",
    "Meeeiouw! Mewwww! (Behave yourself human! One shall behave as one likes.)",
    "MEEEEOOOUW!!!! (Will you stop interrupting one? For the last time one requires tuna immediately.)",
    "MEEEIOOOOUW! MIOOOOOEW! YOOWLLL! (For goodness' sake! One might acquire the mistaken impression that the human rules this place. I command you to feed me.)",
    "Purrr. (And about time too, insolent human-pet.)",
    "Meow. (Hmmm, one will lower oneself to eat the fish, despite the human's insult.)",
    "Purrr. (One is satisfied with the freshness of the tuna. The humans have acted satisfactorily in this matter.)",
    "Purrrrz!",
    "One wishes the tuna-bearing outlander well. One would prefer for him to stay.",
    "Meow!",
    "One does not wish to be disturbed."
  ],
  "Guard": [
    "This is [Fremennik Name] your majesty.",
    "Actually his juggling was quite funny. Shame about the accident though."
  ],
  "Thorkel Silkbeard": [
    "Sire, Sire! The Kelda merchants have arrived, they are three days early. We're not ready!",
    "They are in the hall, eating and drinking us out of food and beer. It's costing us a fortune.",
    "I already have. They'll never get enough ore in time, the bunch of lazy no-good layabouts.",
    "We need [eight/seven/six] pieces of [tin/coal/mithril] ore for Keldagrim's merchants. The entrance to our mines are to the north-east of the western gatehouse, outside the walls.",
    "If you bring us the ore, we won't ask where it came from. Don't worry we're discreet.",
    "Excellent news, your majesty.",
    "Of course, your majesty.",
    "Thank you [Fremennik Name]. If only our miners were as efficient as you.",
    "That may be, but we are very different from the vermin on Neitiznot.",
    "Would you like the financial report now, sir? Once we have paid for all the supplies you... er... I have ordered, your Royal Highness, then the coffers will be at their lowest ebb for some time. However, if we tighten our belts and delay your plans for extra defences, then-",
    "But we have already collected Island Taxes this month! We'll never persuade anyone to pay it. Everyone is surviving on coppers as it is.",
    "A new tax!",
    "A Window Tax?",
    "How am I going to sell this one?",
    "Shhh! Please whisper, [Fremennik Name]! For both our sakes just agree, otherwise he'll get into one of his moods, and who knows what he'll pronounce.",
    "How is this island supposed to develop if we keep spending all out money on his paranoid schemes?",
    "You need to speak with some of the citizens of Jatizso and collect their taxes. Count the number of windows on each building and tax the people who work inside. 1000 per window. The only people who earn any real money on the island are shopkeepers. Soldiers clearly do not need to be taxed, as paying soldiers' wages is part of the reason for the tax in the first place. Once you have finished collecting the taxes, come and speak to me again.",
    "Thank you for helping our fine city [Fremennik Name].",
    "Err, not quite.",
    "Yes sire.",
    "How about beer?",
    "Errr.",
    "Thank the gods, we finally have enough.",
    "I hear you killed the Troll King. Thank you for that, however I'm afraid I can't really talk to you any more, the King would be unhappy!",
    "Yes, your majesty, of course your majesty.",
    "Guards.",
    "Thanks, [Fremennik name], you are the first person to stand up to the King's bullying in many a year. Maybe he has learnt something today?",
    "Fare thee well brave warrior, fare thee well."
  ],
  "Slug Hemligssen": [
    "Hello.",
    "...",
    "Nope.",
    "...",
    "Yup.",
    "Oranges are not the only fruit.",
    "My cows produce milk in the evening.",
    "Yellow balloons are heavier in boxes.",
    "You have no idea what you are talking about do you?",
    "Oranges are not the only fruit.",
    "My cows produce milk in the evening.",
    "Yellow balloons are heavier in boxes.",
    "You have no idea what you are talking about do you?",
    "Ah, Operative Budgie. Welcome to the island.",
    "Shh! No names! Names are unnecessary. Loose lives cost tongues.",
    "Shhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhh!",
    "Call me Operative Nighthawk.",
    "This is not a democracy, Operative! Panther already exists and he's working on a mission in Al Kharid. It's my way or the highway.",
    "To business. Here are the details of your operation. You will infiltrate Burgher Burowgar's hall, deep undercover as a travelling entertainer. Burgher Burowgar and his men are known to relax in the presence of a jester – and a few barrels of beer. To get the information required from the court of Burgher Burowgar you must entertain him. While you are obeying the Burgher's instructions you should listen in on the conversations of his council and make note of what they discuss. When you return I shall ask you a few questions about what you have learned.",
    "You must wear all four pieces of the jester costume without anything in your hands, as the Burgher's guards will search you thoroughly. Are you ready to begin?",
    "Indeed, you look very dapper in your costume.",
    "You're ready to entertain the Burgher. Good luck with your mission, Operative Budgie. Stay alert. When you are done, come back and talk to me to give your report. I will make sure the King is informed.",
    "Oranges are not the only fruit.",
    "My cows produce milk in the evening.",
    "Yellow balloons are heavier in boxes.",
    "You have no idea what you are talking about do you?",
    "Have you obtained the information we require?",
    "Now I will ask you some questions, but be warned I have other sources of information that will corroborate your answers.",
    "How soon does Thakkraid think Neitiznot's troops can be ready?",
    "How many militia have been trained?",
    "How many bridges does Thakkrad need repairing?",
    "Hmmm. I believe you're telling me the truth.",
    "Well done! I shall inform the King of your good work. I have been authorised to give you this...",
    "Thanks to you, we know a little more about Neitiznot's plans. While you were deep undercover, I received instructions from 'Big Daddy'.",
    "Shhhh! Yes, I mean the head operative back at home-base. He has given me permission to follow any leads based on your intelligence. It would be useful to know exactly when the Neitiznot engineers intend to repair the bridges. I'd do it myself but my injury stops me. Curse this arm and my reckless bravery in the pursuit of intelligence.",
    "*ahem* Misinformation my boy. Misinformation and misdirection.",
    "Anyway, enough chit-chat. You should gain the trust of the Burgher. You must not mention our arrangement. Indeed, if you are offered tasks by Neitiznot's folk or Burgher, you should go along with them to avoid arousing suspicion. Once you know that the bridges have been repaired then return to me. Oh. I'd take your jester's costume off first, if I were you.",
    "I am sure you know what I require of you by now. You must entertain the ruler of Neitiznot while listening to the conversations of his council. When you return I shall ask you a few questions about what you have learned.",
    "You must wear all four pieces of the jester costume and nothing in your hands, as the Burgher's guards will search you thoroughly.",
    "Excellent. Time to visit the Burgher and get jestering.",
    "Are you ready to make your report, [Fremennik Name]?",
    "Now I will ask you some questions, but be warned I have other sources of information that can corroborate your answers.",
    "Where are Neitiznot's militia?",
    "What will Thakkrad delvier to Neitiznot's militia tonight?",
    "Who has been helping Burgher Mawnis Burowgar?",
    "Hmmm, that is very interesting. I believe you're telling me the truth.",
    "Clearly not. Well, here is your fee.",
    "Right, [Fremennik Name], you had better go and talk to the King. I expect he'll want to discuss your intelligence.",
    "Shhh. Go away. I'm not allowed to talk to you."
  ],
  "Mawnis Burowgar": [
    "Ah! A fool. Excellent. The last entertainer I had was not up to standard.",
    "HA HA HA! Now that's funny.",
    "Mm? Oh yes of course... bag of ferrets eh? Haha!",
    "Well, new Jester! This had better be good.",
    "If you can amuse or delight me at all, you'll be doing much better than the last one.",
    "Bah, if he'd been a decent juggler, he could have juggled the battleaxe, flaming torches, and greased pigs we threw at him.",
    "Well, thank you, that was much better than the last jester.",
    "Hmmmm. Guard! Who is this outlander who has been brought before me?",
    "You jest! [He/She] doesn't look that impressive to me.",
    "Well, I have sought an audience with you several days now. I have need for a courageous and valiant individual. One who will not flee at the sight of jest a few trolls.",
    "Ha! Well said! However, this is no jesting matter. Although a Fremennik name goes a great way towards my trust, I must ask that you prove your loyalty to me and my kinsfolk.",
    "Trust me Fridleif, I think in this case it is necessary. Anyway, there are many tasks that need to be done. Some of them are menial, and [Fremennik Name] needs to show me that [he/she] can handle these as well as the ones that simply require bravery. We on Neitiznot are warriors, but we are not just warriors.",
    "Good. Thakkrad, which tasks remain?",
    "Well then, [Fremennik Name], are you willing to assist my engineer?",
    "Of course not. Neitiznot rope is the best. Real men use yak rope. You need to make the rope yourself.",
    "Well yes, of course it is. We supply rope to all the rope traders in Gielinor. It's an excellent business.",
    "Anyway, once you have obtained the rope we shall speak more about the quest I have for you. So get a move on!",
    "That's a coincidence.",
    "Do you normally carry all that rope around with you?",
    "Are you some kind of seer?",
    "Hey! You're not some sort of witch are you? Maybe I have trusted you too much.",
    "You have come to the home of all rope to sell us...rope. What a load of old rope (ahem).",
    "Alright then. Let's have a look at his rope then.",
    "Bank? Why do you need to go to a bank? Neitiznot is the home of quality rope. The hairs of the local yak have the perfect combination of strength and hardness required from modern rope. Yak rope is stronger and better than any other rope.",
    "Wool? Wool? What a load of old rope. Wool would make awful rope – it's far too soft and it would soak up the water too easily.",
    "Ned? I don't know anything about Ned. I do know we make regular trades with someone in that area. We send them rope, and we get wool in return.",
    "Indeed.",
    "Yell, yes.",
    "I suppose so. You should really try to make some rope yourself though. Fighting the dual challenges of the yak's hoofs and its smell is part of becoming a man over here.",
    "Suit yourself.",
    "Thakkrad! Please reward [Fremennik Name] for [his/her] efforts.",
    "Good work, we will need that rope later. Put it somewhere safe for the time being would you?",
    "My, you are both impertinent and impatient. I have two more tasks for you before I am willing to tell you the full details.",
    "Thakkrad?",
    "Well then, [Fremennik Name], are you willing to assist my engineer?",
    "Ah, a bit more respect. That's better. I shall speak with you again once you have prepared these split logs.",
    "Hello again; do you have the eight split logs that Thakkrad asked you to make?",
    "[Fremennik Name] has returned with the split logs you asked for. Please reward [him/her] for their efforts.",
    "Once this is complete I shall explain the quest I have for you.",
    "Thakkrad, could you explain what needs doing next?",
    "I shall speak with you again once you have repaired the bridges.",
    "You can't build bridges with notes! Get me the real thing.",
    "Ho there! Have you repaired both bridges for my engineer?",
    "Excellent. We are one step closer to putting my plan into action. Now that the bridges are repaired I feel I can tell you of our plans. First, I shall have my engineer reward you for your efforts. [Fremennik Name] has repaired both bridges. Please reward [him/her] for their efforts, Thakkrad.",
    "Long ago, the ancestors of this isle fought heroically against the troll menace upon these isles. But, for the last few generations, we have been preoccupied with fighting our neighbours on Jatizso. In our complacency, the trolls have grown in number and strength and have become increasingly brazen in their raids, attacking our kinsfolk, stealing and destroying our belongings. Now the time has come for us to drive the trolls from this isle. We must defeat their leader, the foul Troll King. Although I am confident we will be victorious, I am a cautious man. We have suffered for many generations and the blood of our ancestors grows weak. But now, in this time of prosperity, Fridleif has recruited the bravest Fremennik warriors from far and wide to win back our honour. Now that you have proven your loyalty, I offer you the honour of leading my forces into battle. What say you, [Fremennik Name]?",
    "Excellent! Once Fridleif's militia arrive and are fully equipped we shall head north into the troll caves.",
    "I have one last concern. I suspect that King Sorvott may have some idea that we intend to make this raid.",
    "If he and his men are willing to aid us in this task then that would not be a problem, however I suspect that Sorvott will see our actions and misinterpret them. He may well attempt to prevent us. I need to know the extent of his knowledge so that I may plan. [Fremennik Name], I suspect that you may be able to help us here. I find underhand methods distasteful, however I ask you to go to Jatizso and find the King's plans by whatever means you are familiar with.",
    "Do you need anything from me to help you?",
    "Excellent. Then make your way with haste.",
    "Ah, good timing. I was just thinking I needed a bit of light entertainment.",
    "Ah, back again. I hope you've got a new act.",
    "Get on with it then.",
    "Well, thank you, that was much better than the last jester.",
    "My militia are en route from Rellekka. Have you found out anything about Jatizso's plans yet?",
    "King Sorvott has spies that have learnt of the troops you have trained. Until recently, they believed that you planned to assault their town.",
    "That paranoid fool. It would bring great shame upon my family to break the truce that was signed between King Sorvott III and my father.",
    "Well, if he thinks the folk of Neitiznot can be intimidated by his threats, he best be ready to accept defeat.",
    "We have no time to lose. Fridleif, please guide [Fremennik Name] through the traditions laid down by our ancestors. Once you have completed these rites I shall appoint you as head of my raiding party.",
    "Have you completed your suit of yak armour?",
    "Excellent news. Now you have just one more item to craft and I can appoint you as leader of my warband; then you may lead our raid against the trolls. The final piece of traditional arms is a large Fremennik round shield. With this you will be able to deflect the large rocks that some of the trolls like to throw at you.",
    "Have you completed the final piece of your Fremennik garb?",
    "Excellent work, [Fremennik Name]. There is little more for me to say. You have proven your worth to my kinsmen and I, but I must continue with the traditions so... Do you, [Fremennik Name], solemnly swear to uphold the virtues of courage and honour?",
    "Then it is done. I hearby appoint [Fremennik Name] as Champion of Neitiznot.",
    "You have made our township very proud today. We hope you continue to match up to our hopes in the quest which we have for you.",
    "As my kinsmen have mentioned, there is a foul beast dwelling in the caves on the northernmost isle. We ask that you lead our militia against this brute and return with the beast's head as proof of your heroism.",
    "I thank you for bringing me this trophy, [Fremennik Name], you have done much to bring honour to this isle.",
    "As a mark of my gratitude for slaying my nemesis, the foul Troll King, I offer you my helm.",
    "It makes me proud to know that the helm of my ancestors will be worn in battle. I thank you on behalf of all my kinsmen, [Fremennik Name].",
    "Thakkrad, I believe you have finished repairing the remaining bridge.",
    "Ah, so that is how we compete with the mineral wealth of Jatizso. Indeed, the wealth of these isles may not be spread evenly, but we certainly make the most of what we have.",
    "My next task is to make peace with the King of Jatizso.",
    "Ah, I see you too have angered King Sorvott IV. Not to worry, I have my ways of pacifying the King. Fare thee well, my Champion.",
    "It makes me proud to know that the helm of my ancestors will be worn in battle. I thank you on behalf of all my kinsman, [Fremennik name]."
  ],
  "Fridleif Shieldson": [
    "When do we assault the caves?",
    "Good, my recruits are nearly ready.",
    "Seventeen, so far.",
    "And the armour?",
    "And the two bridges we need repaired?",
    "Sire, this is the one who has been honoured with a Fremennik name. A rare honour indeed, for an outlander.",
    "Sire, surely that isn't necessary! Anyone who has passed the Trials of Manhood can be trusted.",
    "I apologise for speaking out of turn. The Burgher is wise as always.",
    "You may find a bridge to a small isle, rich in resources. You will not be able to repair it, as I still have to replace the main supports. Leave that bridge – we don't need it to make our raid.",
    "So what do you think of the Burgher's Champion?",
    "What about their collaboration with King Sorvott?",
    "And the Champion did help repair your bridges.",
    "I have them anchored near Etceteria.",
    "Then we are ready to launch our raid at dawn?",
    "And may the Troll King be short-lived!",
    "Blasted spies, how can King Sorvott call himself a Fremennik when he resorts to such dishonourable tactics?",
    "Indeed, it is written in the sagas of Neitiznot that the Champion of the isle must equip himself with the tools of a Fremennik warrior.",
    "Praise be; may the blood of our ancestors flow strongly in our new Champion.",
    "My guards have secured a foothold within the easternmost caves. We have not seen Jatizso's militia yet, but some of my scouts have reported hearing distant fighting in the tunnels.",
    "You should head to the eastern end of the northern isle. You don't want to run in to Jatizso's troops now.",
    "Hail, Champion of Neitiznot.",
    "Praise be to our brave Champion.",
    "Fare thee well.",
    "Congratulations, Champion [Fremennik name]. Thank you for defeating the Troll King."
  ],
  "Thakkrad Sigmundson": [
    "I can be ready in two days.",
    "How many militia have you trained?",
    "More shields will be completed by noon.",
    "I will finish the armour tomorrow.",
    "I will fix them as soon as I can.",
    "There are a few building projects that could do with a strong extra hand.",
    "The bridges to the troll islands need repairing if we are to send a party over. First of all, we will need eight lengths of rope; maybe [Fremennik Name] could assist me with this.",
    "It's quite simple really.Gather some yak hair and take it to the spinning wheel in the south-east of the village.",
    "There you will be able to spin the yak hair you have collected into strong lengths of rope.",
    "Have you collected the eight pieces of rope we need yet?",
    "Ah, excellent quality rope. Good work, [Fremennik Name].",
    "I require eight arctic pine logs, which have been split in two. Arctic pines grow around the village, and woodcutting stumps are positioned nearby. You can split the logs on them.",
    "Once you have eight pieces of rope and eight split logs I will explain how you can use them to repair the bridges that the trolls attacked a few days ago.",
    "My, that was fast.",
    "Good work. Now that you have both the rope and split logs I shall explain how you go about repairing our bridges.",
    "I would like you to repair the two bridges leading to the northern isle. To repair each bridge you will need four pieces of rope, four split logs and a knife.",
    "We are a generous folk, over here on Neitiznot.",
    "Good work! Now that you have repaired our bridges I can make the final preparations for our next assault on the troll caves.",
    "Glory to the Fremenniks.",
    "[He/She] seems honourable and courageous to me.",
    "Well I trust Mord Gunnars, and he works for the King.",
    "Yes, well. So are your militia ready?",
    "Then I shall sail the potions to them tonight.",
    "Absolutely. Long live Burgher Burowgar.",
    "I offer to act as a guide to [Fremennik Name] during the traditional rites.",
    "Firstly, you must equip yourself with the traditional armour of Neitiznot. You will need to cull several yaks in order to craft yourself a suit of yak-hide armour. Once you have a few pieces of yak-hide, return to me and I shall cure them for you. Then I will give you instruction on how this hide may be crafted into a thick jerkin, ideal for protecting yourself from the granite clubs that the trolls of these isles prefer to weild.",
    "You will need to cull several yaks in order to craft yourself a suit of yak-hide armour. There is a fenced-in field to the west of the village where yaks roam freely. Once you have a few pieces of yak-hide, return to me and I shall cure them for you. Once cured, a normal needle and thread will be needed to craft the yak leather in the same way as any other leather. You are currently carrying yak-hide, are you not?",
    "That aroma, outlander! It's very distinctive. So, do you wish to get your hide cured?",
    "I will cure yak-hide for a fee of 5 gp per hide.",
    "There you go.",
    "You will need two arctic pine logs, a length of rope, some bronze nails and a hammer. When you have all of these, you should find the tree stump outside of town. You will be able to hammer together the shield.",
    "(Thakkrad whispers in your ear.) Just repeat what I say. 'I, [Fremennik Name], swear to uphold the virtues of courage and honour.'",
    "Welcome to the clan of Neitiznot; you shall be welcome in this township forever more.",
    "Hail, Champion [Fremennik Name].",
    "That I have sir, we should be able to mine 'runite' once again; now that I have repaired the north-eastern bridge.",
    "Fare thee well.",
    "Thank you for leading the Burgher's militia against the Troll King. Now that the trolls are leaderless, I have repaired the bridge to the central isle for you as best as I can.",
    "Yes, you should be able to mine drakolith there if you wish."
  ],
  "Trogen Konungarde": [
    "Death to the trolls."
  ],
  "Skuli Myrka": [
    "But we only paid our Island Tax last week!",
    "What? *sigh* How much do you want?",
    "*sigh* It seems a lot of money for some windows.",
    "No more! This is an outrage!",
    "Oh, thanks a lot 'friend'. What is it this time?",
    "WHAT? This is the last straw. My father wore a beard, my father's father wore a beard; many generations of Fremennik have worn beards with pride, without having to worry whether his pride and joy would cost him money. A beard is the core of a Fremennik's identity, it is the gateway to his soul, it is..."
  ],
  "Hring Hring": [
    "More taxes; how depressing.",
    "Why should I pay a Window Tax when I don't want any windows. I'd be more than happy staring at the blank walls. How much money are we supposed to pay?",
    "*sigh* It seems a lot of money for some windows.",
    "No more! Haven't we all suffered enough?",
    "Groan! Your lame attempts at humour do not save me money. Come on, break it to me gently, what is it this time?",
    "But I don't have a beard!",
    "No, this hair is just an extension of my head hair, which is currently not being taxed.",
    "Awww come on, be a gent."
  ],
  "Keepa Kettilon": [
    "More taxes? How depressing.",
    "Why should I pay Window Tax when I don't want any windows. I'd be more than happy staring at the blank walls. How much money are we supposed to pay?",
    "*sigh* It seems a lot of money for some windows.",
    "I cannot take any more of this! What ridiculous thing is worthy of taxation this time?",
    "But I don't have a beard, I have a finely waxed moustache. I'm definitely not beardy at all.",
    "Surely, facial hair should be taxed on percentage of the face covered. In which case I should owe no more than 20% of the tax that wild-bearded Fremennik men pay.",
    "That's not fair!",
    "My faith in humanity has been sapped again. Thanks for that. Here take the money and get out of my sight."
  ],
  "Vanligga Gastfrihet": [
    "It's tax time I'm afraid.",
    "But we only paid our Island Tax last week!",
    "What? *sigh* How much do you want?",
    "*sigh* It seems a lot of money for some windows.",
    "Thank you, thank you! I owe you one."
  ],
  "Flosi Dalksson": [
    "I should have guessed.",
    "Please no. I have a wife and seven kids to support."
  ],
  "Raum Urda-Stein": [
    "I would say I'm happy to see you, but that would be a lie.",
    "Gah! What weak excuse for sucking his populace dry has the King come up with this time?",
    "By all that is holy, this is a travesty!"
  ],
  "Bork Sigmundson": [
    "Hold your ground men!",
    "[He/She] will be here soon. The Burgher trusts [Him/Her]. That's good enough for me.",
    "Sir, Champion [Fremennik Name] has arrived! I knew [He/She] wouldn't let us down!",
    "A little bruised but nothing a true Fremennik can't handle!",
    "Yes sir! I have some supplies with me if you need them, but I only have a small amount left. We took a heavy toll getting here.",
    "Thank you [sir/ma'am]. We have food, Strength potions and Prayer potions to see us through this battle. A fine tale we will tell once you have claimed the beast's head. Men, follow [Fremennik Name]'s orders.",
    "Charge!"
  ],
  "Honour guard": [
    "The Champion had better arrive soon. We can't wait much longer!",
    "Our supplies are starting to run a little low; we should make our charge soon. Once you have helped to slay 10 trolls then you should be able to assault the Troll King. We will hold back the troll forces while you cross the bridge to the south of the cave.",
    "Aye Champion!",
    "Aye [Sir/Ma'am]!"
  ],
  "Kjedelig Uppsen/Trogen Konungarde": [
    "Ho, [Fremennik name]! The brave warrior returns!",
    "I expect we'll be hearing songs about the 'Slayer of the Troll King' for many years to come."
  ],
  "King Sorvott IV": [
    "What are you doing in my court? Guards!",
    "Preposterous. Lies, I tell you, lies!",
    "Guards.",
    "Outlander, leave me in peace before I am forced to bear arms against you myself.",
    "Be gone with you. I have heard enough of your insults for one day.",
    "Useless, disloyal cat."
  ],
  "Ned": [
    "Really?",
    "What a coincidence?",
    "Who would have thought it?",
    "Oh, I confess. You have found the truth. I used to make the rope myself, but my fingers aren't as nimble as they used to be and so many people wanted my rope. Demand was so high I had to find another source. But I couldn't tell anyone since Ned's Handmade Rope (100% Wool) is a high profile brand now.",
    "Thanks. Here take this, a free sample! Please, don't tell anyone.",
    "Oh, if you're in the Isles again, tell Jofridr that her Neddie will be there soon."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:The_Fremennik_Isles?oldid=36111954’"
  ]
}