{
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "Other conversations/dialogue options with CyrisusYou can discuss this issue on the talk page or edit this page to improve it."
  ],
  "Player": [
    "Hello?",
    "Can you hear me?",
    "Don't move, don't move! You'll be okay. You'll be fine.",
    "I will, just stay still.",
    "Can you hear me?",
    "Just don't worry.",
    "Well...",
    "Of course.",
    "Well, probably not, to be honest.",
    "I'm going to have to go soon.",
    "It's quite dark down here.",
    "I wonder what monster carved this cave out?",
    "Did you hear that noise?",
    "I thought I heard something...",
    "No, it's okay. I must have been imagining things.",
    "You're looking better now.",
    "No, honest.",
    "You don't look dead any more, for a start.",
    "Well, you look and sound more lively.",
    "How long have you been down here?",
    "That's quite terrible.",
    "This place gives me the creeps!",
    "I'm afraid I shall have to soon.",
    "Feeling positive?",
    "Oh.",
    "Are you looking forward to getting out?",
    "Just take it a step at a time.",
    "That's the spirit!",
    "Why do you look so sad?",
    "I imagine so.",
    "Cheer up, it may never happen!",
    "Always so negative. It's not good for you!",
    "Those are some deep cuts on your legs.",
    "There, just above your shin.",
    "Stop panicking!",
    "I think I feel a bit ill.",
    "I can't help being ill.",
    "You seem like a nice guy.",
    "I thought I had better say it before it's too late.",
    "Just being honest.",
    "I can't believe how many suqahs are on this island.",
    "Perhaps you're right.",
    "Don't you think you should give up being an adventurer?",
    "Well, erm... you know.",
    "You don't seem to be doing too well at the moment.",
    "When we get out of here I'll buy you a drink!",
    "Naturally.",
    "Whatever and wherever you want – my treat.",
    "Something cheap. Although it's my pleasure, helping you is costing me.",
    "Hope you don't mind me saying, but you smell a bit.",
    "It's okay.",
    "It'll be a while before we get out.",
    "Well you have to. You just have to.",
    "I'm very impressed you managed to get into this cave.",
    "Did you not want to give up?",
    "I thought so.",
    "I would have given up personally.",
    "That's good!",
    "Congratulations on not dying!",
    "Good job you didn't find more suqah down here.",
    "I wonder why nothing lives down here.",
    "It's probably not very easy to survive down here.",
    "I trust you usually look smarter.",
    "Just a bit.",
    "Not to worry.",
    "It's a bit damp in here.",
    "Just concerned that it will make your condition worse.",
    "Spider!",
    "Just kidding.",
    "You'll survive this easily.",
    "Come on. Think positive!",
    "Think of all the places you can visit when you get out!",
    "Such possibilities and adventures!",
    "Because otherwise you'll fail.",
    "Yes. So you must think positive.",
    "I had better be going now.",
    "Why?",
    "But why?",
    "What are you going to do when you get out of here?",
    "That's up to you. You could travel with me!",
    "If I were you I'd stay indoors.",
    "Any chance you could pay me for this?",
    "Shame.",
    "It's very cold down here.",
    "No, sorry. I don't have any on me.",
    "It's a good thing that you have me to look after you.",
    "I rule!",
    "No, I don't have to worry about anything because I'm the best!",
    "Not that I'm bragging or anything.",
    "What would you do if I wasn't here?",
    "Quite the coincidence that I found you!",
    "That you have.",
    "So you don't know how long you've been down here?",
    "That's quite scary.",
    "Not long now and you'll be back on your feet.",
    "That kind of depends.",
    "On whether we have to amputate your legs or not.",
    "Ooops, erm, no I'm sure it won't come to that.",
    "On whether you mind me helping you further.",
    "I am glad.",
    "Do you think there is anyone else down here?",
    "Hmm, hopefully someone nice.",
    "You've got quite the collection of bruises there!",
    "They will mend in time.",
    "Since when did you only have one leg?",
    "Hahaha.",
    "Just kidding.",
    "You look like I feel.",
    "Pretty tired and dirty to be honest.",
    "I'm tired, I think I'll take a nap.",
    "Why not?",
    "Do you think this cave is stable?",
    "I don't know, hence why I asked you.",
    "You're sounding much better.",
    "Yes, much more positive. Which is great.",
    "But you probably want to sort out the bad breath.",
    "I'll let you off. But just this once.",
    "If you need anything, just let me know.",
    "You have a big appetite.",
    "I'll let you off I suppose.",
    "Let's sing a song!",
    "Half a pound of tuppenny rice, half a pound of treacle.",
    "That's the way the money goes. Pop goes the weasel!",
    "Half a pound of tuppenny rice, half a pound of treacle.",
    "That's the way the money goes. Pop goes the weasel!",
    "It's quite cosy in here.",
    "The perfect environment for getting back on your feet!",
    "You don't like it?",
    "There's no pleasing you, is there?",
    "How about a joke?",
    "How does the queen bee get around her hive?",
    "She's throne.",
    "This would probably make a nice home.",
    "Yes, do you?",
    "We could do with something for you to sit on.",
    "Well, I just thought it would be a bit more civil.",
    "Can you smell gas?",
    "I just thought I could, you know... mines often have poisonous gases.",
    "You're very safe in this little cave.",
    "Just one entrance.",
    "The suqah will never fit through that tunnel.",
    "Let me tell you about myself.",
    "I started off my life as a simple adventurer, battling goblins, picking up coins on the floor...",
    "I remember the day when I was excited to find a thousand coins.",
    "Now it is nothing!",
    "Not a fan of stories, then? Fair enough.",
    "What do you want to talk about?",
    "Your loss.",
    "Is it ok if I talk to you?",
    "Tell me a bit about yourself.",
    "Yes, you.",
    "Fishing?",
    "Sounds a bit boring to me.",
    "Fishing!",
    "I like fishing too!",
    "I'd love to!",
    "Just don't worry.",
    "Well...",
    "Of course.",
    "Well, probably not, to be honest.",
    "I'm going to have to go soon.",
    "Sorry, I have work to do.",
    "It's quite dark down here.",
    "I wonder what monster carved this cave out?",
    "Oh, erm, never mind.",
    "Can you hear me?",
    "I'm so pleased you're getting better! You must stay still though. You're not fit to walk yet.",
    "My name's [Player]. You're on Lunar Isle, in a cave.",
    "What?",
    "It's okay, it's okay. You're safe now.",
    "Yes.",
    "No, just trust me, I'll see that you get out of here. Don't give up.",
    "There we are.",
    "Don't worry. So what are you doing on this island?",
    "I can relate to that, and Lunar Isle is definitely worth a visit. Where else have you been?",
    "Impressive. You must have a great many stories and mastered loads of skills.",
    "Wow. No need to say more. But why have you had difficulty with the suqah? Surely you're a skilled warrior?",
    "You must have mastered all forms of combat?",
    "Why?",
    "Why?",
    "Oh, okay. If you wish. So, what now?",
    "I suppose I could loan you some armour?",
    "Oh?",
    "And what does he look like? What's his name?",
    "Okaaay.",
    "Hi there, this may sound a bit random, but do you know Cyrisus?",
    "I do?",
    "What!",
    "Wait a minute! Now I recognise you; you're the navigator on the ship that first took me to Lunar Isle! The first time I visited this place your navigation was useless!",
    "Ahh. Of course. Well, if it wasn't for me you would never have reached this place.",
    "Oh, the wit.",
    "Er, no it isn't.",
    "Er. No, it... Stop. Let's not do that again. So, why are you working here now?",
    "Oh no. It's just that the job of banker doesn't seem quite as... 'exotic' as 'pirate'. Seems like a step-down to me.",
    "Er, yeah, whatever you say mate.",
    "What a heart touching story.",
    "Anyway, as I was saying, do you know Cyrisus?",
    "Well, he's down in the caves at the north of this island, and I need your help.",
    "I need to get some items out of his bank account. Is that possible?",
    "Hi there!",
    "I'd got a chest and filled it with some items.",
    "There is... [lists the equipment and Cyrisus responds to each of them]",
    "I'm glad you know what you want.",
    "Hi, I've been to see 'Bird's-Eye' Jack, and I've got a chest. I've also filled it with some armour; what do you think?",
    "Oh, I won't. I'll close my eyes.",
    "Excellent!",
    "Looking good in your kit!",
    "Excellent! You certainly look the part.",
    "Now, Cyrisus. Please tell me. Why did you have such difficulty against the suqahs?",
    "Just tell me.",
    "What?",
    "Now that surprises me.",
    "I have indeed. A very strange day I must say, but very valuable! Especially gaining the Lunar spells.",
    "Well, I suppose. Can't see why not.",
    "Hello again.",
    "Not at the moment. I've come on behalf of a friend. You will probably have met him – his name is Cyrisus.",
    "Well, I...",
    "Hello!",
    "Sounds simple.",
    "Why?",
    "Don't worry Cyrisus, we can do this. Oneiromancer, how do we make the potion?",
    "Very well.",
    "Thanks.",
    "Okay, I have the Potion of Shared Dreaming; now what?",
    "Okay, I have the Potion of Shared Dreaming; now what?",
    "Yes, let's go!",
    "Not yet.",
    "Arrghhh!!! What on RuneScape is that? ... Cyrisus? Cyrisus...",
    "Cyrisus.",
    "Turn. Around. Please.",
    "Don't ask me, it's your dream! You must really be afraid of combat!",
    "What do you mean 'why'? This huge creature must symbolise your fears!",
    "Cyrisus. Let's do this!",
    "Now, now, now! Cyrisus! Get it!",
    "You did it!",
    "I knew you'd do it.",
    "Back to reality, I suppose, and on to the Oneiromancer!",
    "Okay!",
    "We did it!",
    "We beat those monsters well and good, didn't we?",
    "Okay, in what way?",
    "Huh?",
    "Oooh. That was a weird sensation. I must admit, I do feel enlightened already. Thank you!",
    "Be careful!"
  ],
  "Fallen Man": [
    "Uuummmpf...",
    "Owww... paaaain.",
    "Help me.",
    "Just about."
  ],
  "Cyrisus": [
    "Just about.",
    "You think things will turn out okay?",
    "Oh thanks, I feel a bit better now.",
    "I hadn't noticed. Who knows what danger lurks in the shadows. I'm so scared.",
    "What!",
    "Oh no, they're coming to get us!",
    "You're lying. I look dreadful.",
    "Really? In what way?",
    "Well it's a start, I suppose. Doesn't sound too promising.",
    "That's promising. Perhaps I will make it out of here.",
    "I don't know, probably days. I just can't remember.",
    "I know.",
    "Me too. I'm so scared. Please don't leave me.",
    "Oh no.",
    "Not really.",
    "Definitely. A good wash, fresh clothes, a nice meal.",
    "Sorry, I was getting a bit over-excited there, I think.",
    "Thank you, your help really is appreciated.",
    "Wouldn't you if you were about to die?",
    "True, I may never get out of here.",
    "Cuts? I hadn't noticed. Where?",
    "Oh no, oh no, oh no.",
    "Easy for you to say!",
    "Ill? You can't feel ill, I'm depending on you!",
    "Oh dear.",
    "Ah, thanks. That's a really nice thing to say.",
    "Oh, I see. I understand.",
    "Thank you. Right back at ya!",
    "You're right. I really should never have come to this island.",
    "What makes you say that?",
    "No, what?",
    "Thanks for the support, friend.",
    "Really?",
    "That's nice, what kind?",
    "That's really appreciated. Thank you.",
    "Okay. Fair enough.",
    "I'm sorry.",
    "No it's not, this is embarrassing.",
    "Oh no. I don't think I can stand much more.",
    "Air. I wish I could breathe fresh air.",
    "I must admit it was hard to crawl this far.",
    "I suppose at times I did.",
    "Really? I was determined to survive.",
    "Oh. Erm. Thanks.",
    "I suppose so. But now that I think about it, I don't know why there are none down here.",
    "I haven't really thought about it.",
    "Good point.",
    "Yes, I am a bit scruffy at the moment.",
    "Sorry.",
    "Is it? Why do you say that?",
    "It wouldn't surprise me. I don't seem to be having much luck recently.",
    "Arrghh! Where?",
    "Oh, you scared me to death.",
    "I'm not so sure.",
    "What's the point?",
    "That's true.",
    "Yes. I can't wait!",
    "Failure...",
    "I'll try. Maybe when I feel a bit stronger...",
    "Oh no please don't go.",
    "Please.",
    "I... I... need you to help me.",
    "Well I don't know. What should I do?",
    "You'd do that for me? That sounds marvellous! I will look forward to it.",
    "You have a good point there.",
    "Perhaps. Oh, but I don't think I have any money left on me.",
    "Yes. Could you perhaps give me a blanket?",
    "I'll probably be okay. Thanks, though.",
    "That is true.",
    "You ought to be careful with that attitude.",
    "We'll see.",
    "That's okay. I think you deserve it a bit for saving my life.",
    "Probably be dead I suppose.",
    "Yes, I think I've been very lucky.",
    "No. Could have been days. I don't remember much after stumbling down the ladder; just crawling.",
    "I know.",
    "Oh, my friend, you really think so?",
    "On what?",
    "Amputate! You can't be serious?",
    "Oh no. Why can't I die peacefully?",
    "I'm so glad to have your help. I would never turn it down!",
    "Depends on what the person is like.",
    "Oh I do hope so!",
    "I know. It hurts to move.",
    "Time is something I don't have much of.",
    "One leg! What the?",
    "So mean.",
    "And how do you feel?",
    "Okay, I understand.",
    "Now?",
    "Oh, no reason. Just thought you would help me out.",
    "I'm not too sure. What do you think?",
    "Oh. I hope it's safe.",
    "My voice, you mean?",
    "Thanks.",
    "Oh, sorry.",
    "Will do.",
    "I am hungry. Sorry for eating all your food.",
    "Is it really the time to?",
    "But...",
    "Please go away...",
    "Is it really the time to?",
    "But...",
    "Please go away...",
    "That's a strange thing to say.",
    "Not sure I agree, but thanks for thinking of me.",
    "No, not really.",
    "Please, I don't...",
    "Okay, go on.",
    "That was bad.",
    "You think?",
    "Not really, I think I'll stick to living ABOVE ground.",
    "Why?",
    "You're a bit weird.",
    "Gas? Why would you smell gas?",
    "Please, let's talk about something else.",
    "I suppose I am.",
    "Very true. I think I picked a good spot.",
    "Oh, okay.",
    "Sorry to stop you, but are you going to help me?",
    "I don't know, I don't think I feel like talking.",
    "No, I think I'd rather be left alone.",
    "Me?",
    "Well, I grew up in Ardougne. Erm, I quite enjoy Fishing.",
    "What?",
    "Don't knock it till you've tried it.",
    "What?",
    "Perhaps we can fish together one day?",
    "You think things will turn out okay?",
    "Oh thanks, I feel a bit better now.",
    "I thought so. I'm doomed!",
    "Oh no, please don't leave me alone!",
    "I don't think I will survive much longer.",
    "I hadn't noticed. Who knows what danger lurks in the shadows. I'm so scared.",
    "Monster? What monster?",
    "Thank you.",
    "Where am I? Who are you?",
    "I'm Cyrisus. Oh yes, I remember, I was on the island and... Suqahs! There were suqah monsters!",
    "They attacked! I ran and ran. I crawled down here.",
    "I am?",
    "I was so afraid. Oh my head hurts. And my legs. I'm so tired. Please, just leave me, I'm a waste of effort, my body is in ruin.",
    "Thank you [Player]. I would surely be dead without you.",
    "Exploring. I greatly enjoy travelling the world and taking in all the experiences available.",
    "Well, I've travelled from the frozen wastes in the Wilderness to the pyramids of the Kharidian Desert. I've lived with the monkeys of Ape Atoll and dined with the TzHaar under the volcano of Karamja.",
    "You could say that. I could smith you full rune, farm spirit trees and still have time to cook you a summer pie for tea.",
    "Err, well...",
    "No. Not really.",
    "I... erm...",
    "Please, let's leave that line of conversation.",
    "I still don't feel fit enough to go outside. I could also do with some armour.",
    "Oh, there's really no need to worry.",
    "Trust me, there's no need. Please, just go to the bank on this island, I have a friend working there. Just tell him I sent you.",
    "Trust me: when you see him, you'll know.",
    "Oh, and if you want, you can contact me with the NPC Contact spell in the Lunar Spellbook. It might save you running back and forth.",
    "Hi have you managed to get my armor yet?",
    "Superb! What have you got?",
    "Okay, I'll try it on. No peeking!",
    "Still changing.",
    "(if the armor is correct) Hmmm... Perfect! I couldn't ask for a better set-up!",
    "Thanks.",
    "Perfect! I feel healthy, I'm positively charged and I'm dressed like a war machine!",
    "Why thanks, I feel it too!",
    "Ah, well. Best I tell you. The thing is... the thing that I should say... the problem I have, for which you should know...",
    "Okay. I'm afraid of combat.",
    "I've tried so hard over the years, but I simply cannot gather the courage to fight monsters. I've learnt the techniques, I've got the equipment. I just get so afraid. My legs turn to jelly, I'm dripping with sweat. All I can do is run.",
    "I know it seems bad, but honestly, I've tried. It was part of the reason I came to Lunar Isle to see the Moon Clan. I trust you've gone through the ceremony to visit the Dreamland?",
    "Yes, so I came to the Moon Clan again to see if they could help me visit my dreams again and conquer my fear of combat. But then I came across the suqah. Say, would you come with me to the Oneiromancer? Perhaps you can give me some support or guidance?",
    "Excellent! Please, you go on ahead. I'll make my way there myself. I'm not walking out of this cave past those suqahs again!",
    "Good. We were hoping you could help us.",
    "I need to get over my fear of combat. Surely I can sort that out in the Dreamland?",
    "Okay, I shall just take your word for that bit, but I still can't see the dangerous part...",
    "I'm not so sure about this anymore.",
    "Wait. Do we need to wear the clothes we had to wear to go to the dreamland before?",
    "See you at the brazier!",
    "Best you light the brazier with a tinderbox first, then give me the potion.",
    "Pass it to me and I'll put it on the brazier. Okay?",
    "That lectern is rather pretty.",
    "Yes?",
    "Huh? Arghh! What's that?",
    "Why?",
    "I'm guessing we're going to be fighting my fears.",
    "I'm still scared. Show me how you fight, and I should gain courage.",
    "Okay! Take this!",
    "I did! Yes! Thanks!",
    "What now?",
    "See you there!",
    "Yes, I've conquered my fear of combat.",
    "We sure did! I was very afraid to start off with, but once I saw how you dealt with combat I felt sure I could do it too.",
    "Thank you [Player]. I really couldn't have done it without your help. Please, let me pass some of my knowledge onto you.",
    "On my last visit to this island I spent a good while with the Moon Clan. It seems it isn't all that impossible to instantly transfer knowledge to one another.",
    "I shall just use lunar magic to pass some information onto you. Just keep your mind blank , relax and hold still.",
    "My pleasure. And I best be off, I think I am going to put my courage to the test! I have a new goal to reach – the ultimate warrior!",
    "I will. I'll see you around, I'm sure!"
  ],
  "\"Bird's-Eye\" Jack": [
    "That I do. But I must say you seem quite familiar too.",
    "... Why! You're that insolent fool who insulted my navigational skills!",
    "Accusing me of navigating in circles!",
    "How dare you! It was a jinx.",
    "Oh, behold the great adventurer [Player]. How the world would crumble without [him/her].",
    "Better than yours.",
    "Er. Yes it is.",
    "Why, you have a problem with it?",
    "How dare you! I'll have you know that the job of a banker is far more exciting than that of a pirate!",
    "It is! And it's an honest living. I was tired of looting and hunting for treasure. It was time to turn my life around.",
    "Don't patronise me.",
    "Yes.",
    "Listening.",
    "I suppose. Knock yourself out. I suppose you had better take this chest to carry his stuff. Don't want you losing any of it."
  ],
  "Oneiromancer": [
    "Oh hello [Player]! It has been a while. What brings you here again? Creating more astral runes?",
    "Oh yes, I know him. A bright man. What is it about him, my dear?",
    "Oh my.",
    "Cyrisus. It's been a while. Your kind friend here was just talking about you.",
    "Yes? I can try.",
    "Of course. With the Potion of Shared Dreaming. It'll send you both into the Dreamland, and sort out your biggest issue.",
    "In most ways, yes. However, it will be dangerous.",
    "To get you into the dream together, the potion works by binding your subconsciousnesses together. The brazier has its own intelligence in interpreting your subconscious so it will understand your intensions when placing you in the dream.",
    "With your minds melded as one, you need each other to survive. If one of you dies, you both die for real. Unlike before, you will die just as if you were killed by a monster in the wild.",
    "Simple. I shall give you a vial, within you should place water followed by one ground astral rune and goutweed. Then just use it on the brazier. Oh! You'll have to light it first, of course.",
    "Good luck!",
    "Oh no, no need. They were simply ceremonial clothes, you can wear whatever you want.",
    "You did?",
    "Oh, I'm pleased. Congratulations."
  ],
  "Warning": [
    "You can proceed into the dream, but if you die you will lose your items and have to find your way back to the island. The lectern in the dream has a right-click option to leave should you want a fast exit!"
  ],
  "The Inadequacy": [
    "*Are you good enough to fight?"
  ],
  "The Everlasting": [
    "*Can you endure long enough?"
  ],
  "The Untouchable": [
    "*Can you bring yourself to hurt another?"
  ],
  "The Illusive": [
    "*What if you don't know how to win?"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Dream_Mentor?oldid=35532757’"
  ]
}