{
  "Caelyn Kadaan": [
    "Look, Annie. It's our old pal Bob! How are you doing mate?",
    "Look, Annie. It's our old pal Player! How are you doing mate?",
    "I should hope you remembered us! How could anyone forget the mysterious, the daring, world-renowned master thief-",
    "Like ourselves.",
    "I still can't believe you forgot about us! How could anyone forget the mysterious, the daring, world-renowned master thief-",
    "Look Annie, an adventurer! Not here to rat us out to the guards, are you mate?",
    "Unless you're here to trade any goods you may have... liberated... from the wealthy.",
    "Like ourselves.",
    "I'm sure you've already heard of me. I'm the mysterious, the daring, world-renowned master thief-",
    "...",
    "Oh, what's the point?",
    "The past few months have been nothing but petty theft, pick-pocketing boorish nobles, and tax fraud. There's just no fun in thievery anymore.",
    "Good riddance! Can't say I'm a fan of seeing a pair of twenty-four carat buttocks mooning me every time I go to the washroom.",
    "Right, Player, now that Annette has gone, there's something I need your help with.",
    "I knew I could count on you mate. It's a matter of love or death!",
    "No! Well... maybe a bit... Or a lot... But it's a matter of love or death!",
    "Just hear me out mate. It's a matter of love or death!",
    "It's for Annette. I've been trying to find an amazing gift for our wedding anniversary, but I can't find anything good enough. It's tomorrow, and I still don't have anything for her!",
    "Annette's buyer is in Falador, so she should be gone long enough. You see, the Varrock museum is hosting a gala this evening, to celebrate the donation of a ridiculously expensive, heart-shaped ruby. It's everything she loves. Expensive, heart-shaped, red... And it doesn't belong to us... Yet! But even I can't pull off a heist like this on my own. I need your help to infiltrate this party and steal the ruby. What do you say? Are you in?",
    "That's a shame. There's still time though. Let me know if you change your mind.",
    "Cheers mate! Now, let's get started. There's a few things we need to do before we can start the heist. We need disguises if we're going to sneak into that party! And I have just the seamstress in mind. We need to find some plans for the gala so we know what we're dealing with. Smoke bombs are an essential tool in both burglary and showmanship, two of my favourite things! I need your help making some. What should we do first?",
    "Good choice. Thessalia is a seamstress who runs a store, 'Thessalia's Fine Clothes' over in Varrock. She should have something we can use. Here's some gold, it should cover everything.",
    "Hmm... I'm not sure. The gala will be a formal affair, so let's get something classy. With masquerade masks to conceal our identities! I hear they are all the rage among the nobility right now.",
    "It's not, usually. But that poor gal's been through some rough times lately. Also, she's rather cute.",
    "Try to find something that will look flattering on me.",
    "Perfect! Knowing the layout you're working with is a vital part of any heist. I'm sure the museum's curator, Haig Halen, will have plans for the gala on him. Swipe the plans from him and use these specialist tools to make a copy. if you can plant the original back on him he should be none the wiser.",
    "The stain adds character!",
    "Just tell them that you're doing an inspection. Or checking the plumbing. or making a piece of modern art, I dunno. I'm sure you'll think of something.",
    "Good luck.",
    "This is my favourite part of preparing for a heist. I've got some unfinished Smoke bombs lying around that I need your help finishing off. You'll find everything you need around the room...",
    "There's still time. I need your help infiltrating the gala at the Varrock museum this evening and stealing that ruby. Are you in?",
    "Hey Player. Have you got those disguises?",
    "Let me know when you have them.",
    "I need you to take the gold I gave you to Thessalia at 'Thessalia's Fine Clothes' in Varrock, and buy some disguises.",
    "Cheers mate. These are... A lot less than I was expecting.",
    "What a joke. Usually I get far more for far less.",
    "Exactly!",
    "That's a whole two less adjectives than she used last time! I must be growing on her. Now, on to business.",
    "There's still some things we need to do before we can start the heist. We need to find some plans for the gala so we know what we're dealing with. Smoke bombs are an essential tool in both burglary and showmanship, two of my favourite things! I need your help making some. What should we do next?",
    "Last, but certainly not least, we need to make those Smoke bombs. this is my favourite part of preparing for a heist. I've got some unfinished Smoke bombs lying around that I need your help to finishing off. You'll find everything you need around the room...",
    "Do you have the plans?",
    "Then you'd better get a move on!",
    "Swipe the gala plans from Haig Halen at the Varrock museum and make a copy. If you can plant the original back on him he should be none the wiser.",
    "Be a bit more careful will you mate? This isn't cheap equipment you know.",
    "Do you have the plans?",
    "There's still some things we need to do before we can start the heist. We need disguises if we're going to sneak into that party! And I have just the seamstress in mind. Smoke bombs are an essential tool in both burglary and showmanship, two of my favourite things! I need your help making some. What should we do next?",
    "Great. Now, let's see what else needs doing. Last, but certainly not least, we need to make those Smoke bombs!",
    "There's a workbench for bashing things...",
    "Some parts for the mechanisms...",
    "Some stinky fish for putrid odour...",
    "And some powder to make them explosive!",
    "Just follow my instructions as I shout them out and we'll have the perfect set of Smoke bombs in no time. Be quick though, otherwise they'll explode!",
    "So are you ready to get started?",
    "I've got some unfinished Smoke bombs lying around that I need your help finishing off. You'll find everything you need around the room...",
    "Are you ready to get started on those Smoke bombs?",
    "Right, Player. Let's get started on those Smoke bombs!",
    "Something isn't right... Give them a bash!",
    "The mechanisms need adjusting. Throw in some extra parts!",
    "They aren't smelly enough yet. Add some fishy odour!",
    "Those bombs aren't explosive enough. Stuff some extra powder in!",
    "What are you doing Player? Try giving them a bash!",
    "That doesn't look right. Try throwing in some extra parts!",
    "That isn't quite right. Try adding some fishy odour!",
    "That isn't working. Try stuffing some extra powder in!",
    "Are you ready to have another go at making those Smoke bombs?",
    "Shall I make it a bit easier for you then?",
    "Alright, from now on the Smoke bombs will take a little longer to explode. I'll also point you in the right direction.",
    "Thanks mate, those are looking good! Looks like that's everything! We're ready to start the heist. Meet me outside the Varrock Museum, and we can begin.",
    "It looks like all that's left is to get those disguises.",
    "Thessalia is a seamstress who runs a store. Thessalia's Fine Clothes' over in Varrock. She should have something we can use.",
    "Here's some gold, it should cover everything.",
    "The gala should be starting soon. Truth be told, I'm a bit nervous about this. It's been a long time since I pulled off a heist like this one. I hope I haven't lost that spark for good.",
    "Yeah... You're right. Thanks, Player.",
    "Anyway, are you ready to get started?",
    "Perfect! Here's your disguise.",
    "Now get that on, we have a museum to rob!",
    "Okay, but hurry.",
    "Get that disguise on, we have a museum to rob!",
    "Funnily enough, I stopped by Thessalia's on the way here so I've got plenty of spares.",
    "Now get that on, we have a museum to rob!",
    "Are you ready for the gala?",
    "Nice one mate, let's get going.",
    "Just let me know when you're ready.",
    "It was about ten gold to rent the printing press.",
    "You don't get far in this business if you can't forge a simple party invitation. How do you think me and Annette were able to swipe Duke Horacio's bejeweled birthday cake?",
    "How do you-",
    "Yeah, it was.",
    "What? How ccan you recognise her with a disguise that brilliant?",
    "Exactly!",
    "We don't have time for speculation!",
    "She must be a twisted villian! Here to steal the ruby for her own selfish purposes.",
    "Well, yeah. But we aren't villains. We're just... Err... 'Differently-motivated Heroes'",
    "Yeah, because-",
    "Wait, what were we talking about?",
    "Let's check out the basement. According to the plans that's where the ruby is being held.",
    "Can you believe they throw parties like this when there's so many going hungry within the city walls?",
    "I do enjoy sneaking into events like this. It's a completely different world from the one I grew up in.",
    "Is there something you need mate?",
    "These croquettes are delicious! I wonder if I can steal the recipe.",
    "We should go and check out the basement.",
    "If we want to get into the basement we're going to have to create a diversion. Let's see if we can find someone on the first floor who can help us.",
    "We still need to get hold of X more drink tokens for the dwarf.",
    "Let's try working our charm on some of the guests, see if they can be persuaded to part with their tokens.",
    "We still haven't found Mordaut's cheese yet. That'd bag us a drink token.",
    "We've got Mordaut's cheese. Let's get it back to him and bag ourselves a drink token.",
    "We've got all of the drink tokens that the dwarf asked for. We should get them back to him.",
    "We should ask the dwarf to start a distraction so that we can get into the basement.",
    "The guards are distracted. Let's head down into the basement!",
    "Ah, it was back when I was on the cusp of womanhood, living on the streets of Varrock and struggling to make ends meet. I'd scoped out an estate belonging to one of the city's most prominent noble families. My first big heist. But when I reached the family's vault I was caught by their eldest daughter. I was sure I was done for. Instead of calling the guards, she talked to me. We ended up chatting into the early hours of the morning. By sunrise, the vault was cracked, their family treasure was stolen, and the two of us were long gone.",
    "Yes! That ruby isn't going to steal itself.",
    "Let's do this.",
    "I'm right behind you.",
    "Oh, this is delicious! I've never had Vintage Kharidian Spiced Wine before.",
    "...",
    "The bartender smiled at me and everything. How could I say no? Let's pickpocket a token from one of the attendees to make up for it.",
    "Such poetry.",
    "I don't suppose you have a spare drink token?",
    "If we want to get in there we're going to have to create a diversion. Let's head upstairs and see if we can find someone who'll make a distraction for us.",
    "We should try checking out the basement before we go upstairs.",
    "Nope. That's definitely just a pompous noble thing. You should see the parties me and Annette throw over in Edgeville.",
    "Before we go, I don't suppose you happen to have a spare drink token?",
    "Say my good man... Err... Dragon. You wouldn't happen to have a spare drink token would you?",
    "Let's have a look around, Player. That platter has to be here somewhere.",
    "We'll get back to you as soon as we find it.",
    "Thanks mate. Enjoy the rest of the party.",
    "In battle?!",
    "She has a point.",
    "You sure about this, Player? This whole thing seems pretty suspect.",
    "You're right. You'll have to take this one though, I can't dance to save my life. No matter how much Annette tried to teach me.",
    "Say, if we were able to get you some drink tokens, would you be willing to cause a bit of a scene for us? You know... to liven things up?",
    "Let's grab our tokens from one of the bartenders. Then we can try working our charm on the other guests, see if they can be persuaded to part with theirs.",
    "Not yet.",
    "Not all of them, we only have X so far.",
    "Now, about that scene we asked for...",
    "Yeah, who would do something like that?",
    "By the way, I don't suppose you have a spare drink token?",
    "What are you looking for Player? Let's get a move on.",
    "Let's get this cheese back to Mordaut before it gets too warm.",
    "We've already found Mordaut's cheese. Let's get it back to him and bag ourselves a drink token.",
    "What are you doing Player? Don't risk blowing our cover.",
    "We've already stolen a drink token, let's not risk getting caught.",
    "Good job mate! We're one step closer to snagging that ruby.",
    "Nice one! You're getting good at this.",
    "We just need to get hold of [number] more drink token[s] now.",
    "That's the last of the drink tokens. Let's get them back to the dwarf.",
    "Let's get down to the basement whilst the guards are distracted.",
    "Do you see that?",
    "There's the ruby! But it looks like there's some kind of barrier protecting it. According to the plans there are three power sources, one in each of the other wings.",
    "There must be some way we can disable them...",
    "We'll have to sneak past the guards. Looks like there are some empty boxes lying around for us to hide in too!",
    "We've got our work cut out for us! Lets[sic] get started.",
    "Is there something you need mate?",
    "Keep an eye out for guards.",
    "That ruby is so close I can almost taste it... It tastes like redberries.",
    "We're almost there!",
    "We've got this.",
    "What is it?",
    "We need to disable the three power sources to remove the barrier around the ruby. Make sure you don't get spotted by the guards! Hiding behind objects should help us sneak past. I think I saw some crates we can hide inside as well.",
    "Looks like there are still [number] power sources remaining.",
    "Looks like there's just one power source left!",
    "We should check out the north wing.",
    "Seems like the eastern wing's power source is still active.",
    "The west wing's power source needs to be disabled.",
    "The defences around the Display case are down, let's get that ruby!",
    "We've broken into the Display case, now grab that ruby!",
    "I'm right behind you.",
    "Yes! That ruby isn't going to steal itself.",
    "Let's do this.",
    "Looks like that's done it. The barrier is down!",
    "Keep a look out for guards, I'll take care of it.",
    "Right, that's done the trick. Now grab that ruby!",
    "Finally, the ruby is ours for the taking.",
    "It's enormous! It's beautiful. It's... It's a fake!",
    "I've made enough frauds and counterfeits to know one when I see it.",
    "You!",
    "Annie! It was you the whole time?!",
    "I don't understand.",
    "Annie...",
    "I wouldn't say that.",
    "What the-",
    "You've heard of me?",
    "...",
    "But you have heard of me.",
    "The daring-",
    "Caelyn!",
    "Well, we may not have a priceless ruby, but we have something even better!",
    "With this many we could buy the Archaeology Guild's entire stock of tea... And then sell it back to them for gold when they get desperate for their fix.",
    "This is why I love you.",
    "Yes! I've not experienced a heist that invigorating in years. And it wouldn't have been the same without you, mate. An up and coming master thief like yourself needs the clothes to match. So here's something I had Thessalia whip up while we were gone. I paid her fairly this time. Promise!",
    "Now you can look as fabulous as me while you're out robbing the elite!",
    "Well, we didn't actually steal a priceless ruby in the end. But who doesn't love a fabulous coat and hat?",
    "Great to see you again mate. Just let me know if there's anything you need stolen, OK? We owe you one.",
    "Actually on that note, this lamp came into my possession recently and no-one seems interested in buying it. Perhaps you would be interested in taking it off our hands."
  ],
  "Annette Kadaan": [
    "I've been keeping tabs on you since our previous dealings, Player. I know that wasn't your real name. But it's nice to see you again.",
    "I've been keeping tabs on you since our previous dealings. You've been busy! It's nice to see you again.",
    "If I never see another egg again it will be too soon.",
    "We're master thieves, who steal from the rich of Misthalin, to give to the less fortunate.",
    "Well, yes...",
    "But we give a lot of it to others in need as well. I'm Annette. And this is my wife-",
    "I don't know what she's talking about. We run a perfectly legal, law-abiding and lawful operation here.",
    "We're philanthropists.",
    "We're always looking for people who are willing to help with our plight.",
    "To redistribute the wealth of Misthalin to the less fortunate.",
    "Well, yes... But we give a lot of it to others in need as well!",
    "Likewise. I'm Annette. And this is my wife-",
    "Sorry, Player. Caelyn's been stuck in a bit of a rut lately.",
    "I told you, you just need to find an elaborate, high-stakes heist to get your kleptomaniac heart pumping again. Anyway, I need to get going. I finally found a buyer for Duke Horacio's solid gold lawn gnome.",
    "See you soon.",
    "What? No! We're not that corny. We have this huge pile of Chronotes the museum gave me for donating that fake hunk of rock.",
    "That is devilish, dastardly and completely and utterly morally bankrupt. Let's do it! We can give half the proceeds to the Varrock orphanage.",
    "Thank you for your help in all this, Player.",
    "You have our gratitude as well. Hopefully one day we can make it up to you.",
    "You have our gratitude as well. Hopefully one day we can make it up to you.",
    "Thanks again for everything you've done for us. For me. Caelyn's been more motivated than ever, because of your help."
  ],
  "Player": [
    "I remember you two! You were selling the Easter Bunny's chocolate eggs on the black market, right?",
    "Who are you again?",
    "Tell me why I shouldn't call the guards right now.",
    "Hmm... I'm listening.",
    "What's that?",
    "I see. I'm Player, pleased to meet you.",
    "...",
    "What do you need?",
    "Let me guess, it involves stealing something?",
    "Whatever it is, I'm not-",
    "Where do I fit into this?",
    "I'm not interested right now.",
    "I'm in.",
    "Let's get the disguises.",
    "What should I be looking out for?",
    "You've given me gold to purchase them legally? That doesn't seem like your style.",
    "I'm on it.",
    "Let's case the joint.",
    "'Specialist tools'? This is some crayons and a sheet of lined paper. With what appears to be a coffee stain.",
    "What if someone catches me making the copy?",
    "I'll get started on that.",
    "Let's create some Smoke bombs.",
    "I'm looking for a pair of costumes for a gala this evening. Ideally something that conceals the wearer's identity.",
    "Sorry. This is all she gave me.",
    "That's fine.",
    "Possibly.",
    "Oh, the one that only made second place?",
    "Right...",
    "I will. Thank you.",
    "I will.",
    "I'm really sorry, I've managed to lose those masks.",
    "Thanks! I'll be more careful this time.",
    "Not yet.",
    "What do I need to do again?",
    "Right.",
    "Yep. Here they are.",
    "Thessalia said that this was all we could afford with the gold you gave me.",
    "Because you steal it?",
    "She also said that this is the last time she'll accept your 'morally repugnant, reprehensible and positively vile' patronage.",
    "I was just... Err... I remembered that I needed to get some groceries and decided to jot down a shopping list.",
    "...",
    "You know, I was just downstairs, and I think someone may have accidentally locked Mr. Mordaut inside the Red Dragon exhibit.",
    "Whew. That was close.",
    "I'll be honest with you. A thief is trying to steal that ruby of yours at the gala this evening. And she's asking me to help.",
    "I'll consider it.",
    "Not yet.",
    "What do I need to do again?",
    "Right.",
    "I've lost those 'specialist tools' you gave me.",
    "Yes, here they are.",
    "...",
    "That was tougher than I expected.",
    "Yes please.",
    "That's alright, I'll keep trying.",
    "I finished off those Smoke bombs you asked for.",
    "I'm sure you can do it. You're a world-renowned master thief! And I'm here to help.",
    "I'm ready.",
    "There are some things I need to do first.",
    "I've managed to lose my disguise.",
    "...",
    "Yes, I'm ready.",
    "Not yet.",
    "How exactly did you get these invites? Were they expensive?",
    "These are forgeries?",
    "...",
    "What was that about?",
    "Well that was ominous.",
    "I recognise that voice! What's she doing here?",
    "It's a mask just like ours.",
    "But she's clearly-",
    "But Caelyn... we're here to steal the ruby too.",
    "Really?",
    "Never mind.",
    "What do we need to do again?",
    "How did you and Annette meet?",
    "That's quite the tale.",
    "We should get going.",
    "Hey, do you happen to know where we can get our free drink tokens?",
    "I heard it's only one token per person?",
    "That's alright.",
    "Caelyn, did you just use your drink token?",
    "What were you thinking?!",
    "I have a feeling they wouldn't give us a drink token even if they had one.",
    "It's good! I'm really enjoying it.",
    "It's fine, I guess.",
    "To be honest, I'm not a fan.",
    "I understand.",
    "Hopefully.",
    "I'm sure it's just a coincidence. Enjoy the party Lottie.",
    "No problem. Enjoy the rest of your evening.",
    "I see, thank you.",
    "I didn't expect to see an Ilujanka here. Where are you from?",
    "How are you finding it?",
    "Nice to meet you Carthalo, I hope you enjoy the party.",
    "Thanks anyway.",
    "Hello Mr. Mordaut. I hope you're enjoying the party.",
    "I'm glad you're enjoying yourself.",
    "Not yet.",
    "Here you go, one cheese platter.",
    "What of it?",
    "Why are you offering to help us?",
    "Why a dance battle, of all things?",
    "We accept your challenge.",
    "We need these tokens.",
    "Hello there my inebriated friend.",
    "Sounds like a plan then.",
    "We do! Here they are.",
    "Yes, as soon as you can.",
    "Not yet. There's something I want to do first.",
    "Hello there. How are you finding the party?",
    "I hope things pick up for you.",
    "There's a Cheese platter in here! I wonder how it got in there...",
    "Did you just- Nevermind.",
    "What should we do next?",
    "Let's get to work.",
    "We should get going.",
    "Argh, it won't budge. It's sealed shut.",
    "What?!",
    "Are you sure?",
    "I knew it. This whole thing has been a set up.",
    "* Audible gasp* What a twist!",
    "It was so obvious.",
    "What's going on here?",
    "That's so sweet.",
    "This is sweet and all, but maybe it can wait until we're out of the museum.",
    "So all of this was for nothing?",
    "Love?",
    "Thank you.",
    "Is this all? I was expecting... I don't know. Gold, or something."
  ],
  "New Task": [
    "Obtain disguises from Thessalia in Varrock.",
    "Make a copy of the Varrock museum curator's gala plans.",
    "Create some Smoke bombs."
  ],
  "Thessalia": [
    "Hello there. How can I help you?",
    "Oh, I have a plethora of fantastic gowns, suits and masks. Do you have a budget in mind?",
    "Oh...",
    "I should be able to give you two masquerade masks for this. But they'll be second hand. With unusual stains.",
    "Wait a minute... Concealing identities? Suspiciously low budget? This 'she' wouldn't happen to go by the name of Caelyn, would she?",
    "Ugh! At least she's paying me anything at all this time. Though I have half a mind to take her ill-gotten gains and chuck them right back in her smug face! But unfortunately I need all the gold I can get. I blew all my savings buying material to make the largest top hat in Gielinor.",
    "... Yes, that one.",
    "Here, take the masks. But tell Caelyn this is the last time I'll accept her morally repugnant, reprehensible and positively vile patronage.",
    "You should probably get those masks back to Caelyn. Oh, and make sure you tell her that-",
    "...",
    "Luckily for you, I have plenty more lying around."
  ],
  "Curator Haig Halen": [
    "Hey! Just what do you think you're doing?!",
    "And why exactly does your shopping list include annotated drawings of a museum?",
    "What? Not again!",
    "Caelyn Kadaan... She's been causing chaos in the city for years. Perhaps this is an opportunity to finally put her behind bars. I say you play along with her for now. If I can catch her in the act she'll finally face justice for her crimes.",
    "Order! Order!",
    "You're leaving? I think not.",
    "I would.",
    "You three are coming with me.",
    "Ah, you must be Caelyn Kadaan.",
    "I've heard that you are loud, arrogant, and surprisingly incompetent for a criminal of such notoriety.",
    "Be that as it may, you have trespassed on museum grounds, damaged our property... And gave Mr. Mordaut awful bloating and indigestion by supplying him with an entire cheese platter! What do you have to say for yourselves?",
    "Nooo!"
  ],
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "Dialogue differs slightly if this is not the last task pickedYou can discuss this issue on the talk page or edit this page to improve it."
  ],
  "Smoke Bomb Progress": [
    "[x]/10"
  ],
  "Masked woman": [
    "A master thief and a hero. Such a peculiar partnership. I wonder what brings you to this little soiree.",
    "Good luck. You'll need it.",
    "I hear the two of you need to find some drink tokens.",
    "I may be willing to give you mine... but only if you can defeat me in battle.",
    "In a DANCE Battle!",
    "Because it's entertaining.",
    "What's a gala heist without a dance scene?",
    "It's time to put your boogie where your mouth is and join me on the dance floor!",
    "Not bad. Not bad at all. You definitely earned this.",
    "I suppose I should explain."
  ],
  "Masked Woman": [
    "Don't worry, your secret is safe with me. For now."
  ],
  "Attendee": [
    "It's great to have the opportunity to chat with so many different people.",
    "This amazing donation will make a great addition to the museum.",
    "What a wonderful gala. The curator has really outdone himself this time."
  ],
  "Bartender": [
    "Let me know if there is anything I can help you with.",
    "Of course. If you show me your invitations I can sort that out for you right now.",
    "It is. Apologies for any inconvenience. We have quite an extensive guest list and drinks are in short supply this evening. Though I believe the Curator arranged for the shortage, given some of the more... eccentric partygoers we were expecting tonight."
  ],
  "Curator Haig": [
    "I'm very busy right now, if you don't mind.",
    "I'd hardly call such a heinous crime 'sweet'."
  ],
  "General Bentnoze": [
    "Blood is red. Bruises is blue. Me love roses. You smell like shoe.",
    "Ha!"
  ],
  "General Wartface": [
    "Chocolates is best. For love so true. You smell of yak. And look like one too!",
    "Old lady's right."
  ],
  "Lottie Reiniger": [
    "Hello there. How are you finding the gala?",
    "That's great to hear.",
    "I know galas like this aren't everyone's cup of tea.",
    "That's a shame. Feel free to speak to the Curator if there's something he can do to help.",
    "For me, it's nice to have an evening where I don't have to be 'Acting Guildmaster Reiniger' for once. I can just be Lottie, you know?",
    "Maybe when we find an official replacement for Tony there will be less pressure.",
    "Though things have been a lot easier since we got our new Guildmaster. You know, it's hard to tell with the mask but you look just like-",
    "I'm afraid not. I couldn't resist a glass of Kharidian Spiced Wine.",
    "My dress! It's ruined.",
    "What was that?!"
  ],
  "Museum guard": [
    "The basement is currently off limits. You'll find the gala upstairs.",
    "Stop right there!"
  ],
  "Carthalo": [
    "I hail from Iaia, the homeworld of my people. I arrived on Gielinor with several of my kind only recently. I have been teaching Mr. Mordaut about the ways of the Ilujanka, and our history. He in turn is showing me the culture of Gielinor, such as this 'gala'.",
    "It's fascinating. Very different to celebrations back home. Is the food always this small here?",
    "I would like that.",
    "Likewise, friend.",
    "I'm afraid not, friend. I couldn't pass up the opportunity to try Gielinorian wine. It was quite nice, though it doesn't compare with Redcane rum.",
    "So this 'cheese' is created by fermenting a white fluid gathered from lactating animals?",
    "I'll pass.",
    "Impressive!",
    "Are all Gielinorian parties this violent?"
  ],
  "Mr Mordaut": [
    "Well, yes... But I promise you it is a lot nicer than that makes it sound. You're welcome to try some if you'd like.",
    "I am indeed! What a splendid soiree Halen has organised. Anachronia and Orthen certainly have their charm. Exploring Dragonkin history directly is invigorating. But it's nice to be back at the museum, if only for a moment.",
    "Why thank you. I hope you are having a pleasant evening as well.",
    "I do still have mine. Can't say I have much interest in redeeming it. I was promised a full cheese platter this evening, but I have yet to see anything of the sort. Tell you what, if you can find this elusive cheese I'll give you my token.",
    "Hello again. I don't suppose you've found that elusive cheese?",
    "Marvelous! As promised, here is my drink token. Don't spend it all at once, as they say.",
    "Bravo! Bravo!",
    "Not at all. I can hardly bear to watch such depravity! Yet I cannot look away. Could you be a dear and pass me the Gorgonzola?"
  ],
  "Wise Old Man": [
    "Let the battle begin!",
    "I'm having a pleasant evening.",
    "Don't be silly Zinny. You saw how much security the museum has in place tonight. Who would be foolish enough to try stealing that thing on a romantic whim?",
    "Who let these goblins in here?!"
  ],
  "Zenevivia": [
    "Meh. I've seen better.",
    "Really, Dissy? This party is duller than ditchwater. Don't you think we could spice things up with a little robbery, like we did back at the Wizards' tower? Perhaps we could steal that ruby they won't stop going on about for ourselves. It would be oddly romantic.",
    "Ha! I downed our two glasses the second we got here. Not that it's helped.",
    "You and me both!",
    "I'd say it's an improvement.",
    "'Order' this, you pompous prat!"
  ],
  "Drunken Dwarf": [
    "Pah! I aint 'inebriated' yet matie. Unfortunately. This party is drier than the Kharidian. Can you believe it's only one drink token per person?",
    "If you find me four drink tokens I'll do whatever ya want.",
    "You got those tokens?",
    "Well hurry up! I'm dying of thirst over here.",
    "Well hurry up! I'm dying of thirst over here",
    "You got those tokens?",
    "Finally! Thank ya both.",
    "Sure thing, matie. You want me to do that now?",
    "Well, here goes nothin'.",
    "Just let me know when you're ready.",
    "You want me to start that distraction for you now?",
    "Everyone! Hey, Listen! I wanna propose a toast, to-",
    "Whoops!"
  ],
  "Curator Haig Halem": [
    "Saradomin save me! Guards! Get this under control!"
  ],
  "Defences Disabled": [
    "[number]/3"
  ],
  "Annette": [
    "Hello Cae.",
    "I felt awful seeing you in that rut. I knew that you needed a big, high-stakes heist to get your passion for thievery back. So I created this fake ruby and donated it to the museum. I knew you wouldn't be able to resist stealing it for me tonight.",
    "Happy anniversary Cae.",
    "You can have your 'ruby' back Haig, if you let us go. We don't need it any more.",
    "That you're a fool if you think you can catch the mysterious-",
    "World-renowned master thieves:",
    "And Annette."
  ],
  "Caelyn and Annette": [
    "Kadaan!"
  ],
  "Congratulations! You have completed": [
    "'Heartstealer' - Complete this Novice quest.",
    "'Redistribution of knowledge' - Claim Thieving XP from Caelyn after 'Heartstealer'."
  ],
  "You have unlocked the title": [
    "Heartstealer Player"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Heartstealer?oldid=36010855’"
  ]
}