{
  "Mosol Rei": [
    "Run! Run for your life! Save yourself! I'll keep them back as long as I can...",
    "Your very life is in danger. Rashiliyia has returned and we are all doomed.",
    "Rashiliyia is the Queen of the dead. She has returned and has brought a plague of undead with her. They now occupy our village and we have them trapped. I warn people like yourself to stay away.",
    "We're doing all we can to keep the undead at bay. The village is covered in a deadly green mist. If you go into the village, a terrible sickness will befall you. And the undead are even stronger beyond the gates. My guess is that it has something to do with the Legend of Rashiliyia. But you would need to talk to the Shaman in Tai Bwo Wannai village to get more details about that. I really have to go now and fight these undead.",
    "Rashiliyia! The Queen of the undead has risen! She is the mother of the undead creatures that roam this land. But alas I know nothing of the legend that surrounds her.",
    "Yes.... I said it is a legend that I know nothing about.",
    "Ok, perhaps you'd like to be on your way now?",
    "Well, let me think now...",
    "Hmmrr., there was something I think that might help...",
    "Nope, sorry. It's gone.",
    "My guess is that this has something to do with the legend of Rashiliyia. But you need to speak to the Shaman in 'Tai Bwo Wannai' village to get more details about that. I really have to fight these undead now Bwana, before they take over the world!",
    "Ok, I understand Bwana! You may as well be on your way then.",
    "I don't think so Bwana, but you may want to consult with Trufitus the Shaman in Tai Bwo Wannai village, he may have some information which could help.",
    "Well, that would be helpful Bwana. If you're sure you want to go, you can take a Wampum belt to him for me. It will give the Shaman, Trufitus the story of our problems down here. Are you sure you want to go?",
    "That's Ok Bwana, it's a big responsibility. Come back and see me if you change your mind.",
    "I would be very grateful if you did. Here take this...",
    "Please can you give it to Trufitus. He may be able to give you extra details on the legend surrounding Rashiliyia. Good luck!",
    "Quite right, Bwana, please make all haste! Before your spine turns to water as we speak.",
    "Can you not see Bwana? This whole area is infested with the living dead.",
    "Arrggghhh, here are some now!",
    "Arrggghhh, here are some now!",
    "God speed to you my friend.",
    "I am Mosol Rei, I am a Jungle Warrior. I used to live in this village, but it is too dangerous for you to stay around here.",
    "Thanks, but you really should leave.",
    "You're welcome Bwana, good luck.",
    "Sorry Bwana, I cannot allow you enter the village at this time.",
    "Hey there Bwana, have you delivered that Wampum Belt to Trufitus yet?",
    "Well hopefully Trufitus will come up with some good ideas on how to resolve this problem with Rashiliyia. You should talk to him if you really want to help.",
    "If you can take it to him quickly, it would help me out a lot. If not, please can you give it back to me so that I can send a scout to deliver it.",
    "You must be a maniac to go in there! The whole place is swarming with zombies!",
    "Greetings Bwana! We've removed the threat of Rashiliyia and though there are still some random outbreaks of undead activity we are more than able to deal with it. You're welcome to enter the village now Bwana, shall I show you the way?"
  ],
  "Player": [
    "Why do I need to run?",
    "Rashiliyia? Who is she?",
    "What can we do?",
    "Why are the undead here?",
    "Legend you say?",
    "Oh, Ok, sorry for bothering you.",
    "Oh come on, you must know something?",
    "Maybe you know someone who does know something?",
    "Sorry, but I don't think this is something that I can help with at the moment!",
    "Can I help in any way?",
    "I'll go to see the Shaman.",
    "Errr, I'm having second thoughts now.",
    "Yes, I'm sure and I'll take the Wampum belt to Trufitus.",
    "Uh, it sounds nasty, just the kind of thing I want to avoid!",
    "What danger is there around here?",
    "Yeah... Ok, I'm running!",
    "Who are you?",
    "Mosol Rei, that's a nice name.",
    "Ok. Thanks for your help.",
    "Yes, of course!",
    "Not yet, I've been busy.",
    "I'd probably have just scraped my knees up as well.",
    "What do you know about Rashiliyia?",
    "So there is nothing we can do?",
    "Oh, ok!",
    "Should I start to evacuate the island?",
    "Will you pack your things now?",
    "Is her resting place important?",
    "What are minions?",
    "What are onions?",
    "Yes of course, I mean Minions, what made you think I said Onions?",
    "Does she have any weaknesses?",
    "Mosol Rei said something about a legend?",
    "Why was it called Ah Za Rhoon?",
    "Thanks for the information!",
    "About Ah Za Rhoon and where it is.",
    "I am going to search for Ah Za Rhoon!",
    "Yes, I will seriously look for Ah Za Rhoon and I'd appreciate your help.",
    "Actually, now it comes to it, I'm having second thoughts.",
    "It's a pity that I can't search for Ah Za Rhoon now.",
    "Do you know anything more about the temple?",
    "Tell me more.",
    "Are there any traps there?",
    "Well thanks...",
    "Erm, I don't know where to look?",
    "Do you think it was floating on water?",
    "Ok thanks for your help.",
    "Greetings...",
    "I think I found something, but I am not sure what it is.",
    "I think I have found the temple of Ah Za Rhoon. I excavated a hole and found a fissure. Should I go through it?",
    "What's a fissure?",
    "Ok, thanks!",
    "Are fissures dangerous?",
    "I think I have found the temple of Ah Za Rhoon. I excavated a hole and illuminated it, there is a fissure with a large drop.",
    "I think I found the temple of Ah Za Rhoon.",
    "I need help with Bervirius.",
    "I have some items that I need help with.",
    "I need help with Zadimus.",
    "Ok, thanks!",
    "I need help with Rashiliyia.",
    "I need some help with the Temple of Ah Za Rhoon.",
    "It looks very dangerous, and dark... Scary!",
    "** Gulp! **",
    "Weeeeeeee!",
    "Weeeeeeee!",
    "* Uh oh! *",
    "Can you decipher this please?",
    "What do you make of this?",
    "Have a look at this, tell me what you think.",
    "In an underground building of some sort.",
    "Anything that can help?",
    "Ok, thanks!",
    "What do you make of this?",
    "I found the corpse in a decomposing gallows. I get a very strange feeling every time I try to bury the body.",
    "Is there any sacred ground around here?",
    "Can you dispose of this for me?",
    "Greetings...",
    "I think I found the temple of Ah Za Rhoon.",
    "I have just buried Zadimus' corpse.",
    "It just so happens that I have!",
    "Yes, it was pretty grisly!",
    "Could you have a look at this please?",
    "It appeared when I buried Zadimus' corpse.",
    "He said something after he gave it to me.",
    "The spirit said something about keys and kin?",
    "The spirit rambled on about some nonsense.",
    "I'm not sure.",
    "No reason really.",
    "Greetings...",
    "I think I found Bervirius' Tomb.",
    "No, I didn't find a thing.",
    "Actually I did find the tomb, I was just joking.",
    "I actually need help with something else.",
    "I didn't find anything in the tomb.",
    "It is?",
    "How do I make a bronze necklace?",
    "Thanks!",
    "What should I put on the necklace?",
    "Take a look at these.",
    "Take a look at this...",
    "Have a look at this!",
    "I made it from the bone shard that Zadimus gave me.",
    "Yes and I explored inside some sort of cavern.",
    "Not really.",
    "Yes, I found lots of things.",
    "I don't know, I haven't tried it yet.",
    "Do you know what it opens?",
    "* Gaaaa.... *",
    "Oh no, I'm going to be stuck in here forever!",
    "How will I ever get out!",
    "I'm too young to die!",
    "Ooooff!",
    "Hello.",
    "What should I do now?",
    "Thanks!",
    "Could you have a look at this..",
    "Yes, I think so.",
    "What should I do with them?",
    "Can you take them off my hands?",
    "Greetings",
    "Hello!",
    "Greetings!"
  ],
  "Undead one": [
    "You cannot escape me, prepare to die.",
    "Soon you will be undead!"
  ],
  "You approach the cart and see undead creatures gathering by the village gates. There is a note attached to the cart. The note says,": [
    ": Danger :: Deadly green mist DO NOT ENTER IF YOU VALUE YOUR LIFE !"
  ],
  "Trufitus": [
    "Hello Bwana, this message from Mosol Rei bears bad news... Yes, things do look very bad indeed.",
    "Hmmm, it's been a long time since I heard that name. Rashiliyia is the Queen of the Undead. And a more fearsome enemy you will be unlikely to find. I fear that you bring me news that she has returned to plague us once again?  Alas I know of no weakness that she has.",
    "Not that I can think of.",
    "Yes, it's a bit sad really, I liked that village.",
    "Well, I hope you will excuse me, but I need to get back to my studies.",
    "Yes, that may be a good idea. Many people could die! If only there was a way to defeat her!",
    "I will wait and see what will happen. Maybe Rashiliyia does not have the power to strike too far from her resting place? But there are many things that I need to do now.",
    "I believe it is! It might be that her physical remains are the focal point of her supernatural powers. It is said that many years ago, a group of adventurers once infiltrated her tomb to try to rid the world of Rashiliyia. These adventurers reported seeing a wraith- like creature. Although the adventurers disturbed Rashiliyia's bones, they were not able to properly sanctify them. And this is the most likely reason why she still plagues us today. Of course, she only has to order one of her minions to move her bones and she can quite quickly and easily set up a new headquarters anywhere and continue to launch her plague of undead.",
    "Minions are the fiendish undead creatures that she controls. She has very few living worshippers, but they need to be dealt with at some point. Usually a strong creature of some sort will be guarding her remains. And of course, she is a very powerful spell caster herself. Not to be tackled lightly.",
    "Surely you mean Minions?",
    "Minions are the fiendish undead creatures that Rashiliyia controls. She has very few living worshippers, but they need to be dealt with at some point. Usually a strong creature of some sort will be guarding the bones and it is not to be tackled lightly.",
    "I am not sure, but the legend about her certainly is long. It's a pity that the temple of Ah Za Rhoon has crumbled as there may be some clues that could help us to defeat her. I think the largest problem will be in locating her resting place.",
    "Ah, yes, there is a legend, but it is lost in the midst of antiquity... The last place to hold any details regarding this mystery was in the temple of Ah Za Rhoon....and that has long since vanished... it crumbled into dust...",
    "It is from an ancient language. The direct translation is... 'Magnificence floating on water'. But my research makes me believe that the temple was built on land. And most likely between large bodies of water, for example large lakes. However, many people have searched for the temple, and have failed. I would hate to see you waste your time on a pointless search like that.",
    "What information?",
    "Hmmm, well, you are welcome bwana.",
    "What?! You must be crazy! That place has passed into myth and legend, it has been buried under rubble for years. It's most likely buried 20 men deep, and that's if you can actually find it. Are you sure you're going to go and look for it? I may be able to do some research into this if you agree. Only I don't want to waste my time if you're not serious about this!",
    "Ok then Bwana, good luck with your quest, and remember to stock up well with adventuring supplies before setting off. You never know how useful some fairly ordinary things might be when you're adventuring.",
    "I'll hold on to this Wampum belt for you for the time being. I'll give it back to you when we have completed this quest.",
    "Well, I understand. Perhaps you can search for it another time? Come back when you think you're ready. now won't you while I return to my studies.",
    "Well, I understand. Perhaps you can search for it another time? Come back when you think you're ready. now won't you while I return to my studies.",
    "Not much... I would say that is about it... Even the great priest Zadimus who built the temple did not survive. Some say that Rashiliyia caused the temple to collapse. She was angry at Zadimus for not returning her affections. She was a great sorceress even before they met.",
    "I don't know anymore. You're very demanding aren't you!",
    "How am I supposed to know? A lot of what I know is most probably wrong but some of it seems right to me. Excuse me but I must get back to my studies.",
    "Hello Bwana, how goes your quest to find Ah Za Rhoon?",
    "Well that's very good news. Let me know if you find anything useful, I may be able to help out.",
    "Hmm, that doesn't surprise me. have refers to its name. Ah Za Rhoon, its name means 'Magnificence Floating on Water'.",
    "It's very doubtful. I suspect it was built to 'appear' as if it was floating on water. Perhaps on an island or between large bodies of water. If you search for somewhere like this, you may find something worth investigating.",
    "You're welcome Bwana, I only hope it helped.",
    "Greetings Bwana, you have been away! The situation with Rashiliyia is worsening! I pray that you have some good news for me.",
    "Well, investigate it further, you may find something interesting!",
    "Well, I would certainly investigate it..",
    "A fissure is a long, narrow crack, usually in rock. Just the kind of thing that adventurers love to find  and explore.",
    "You're quite welcome Bwana.",
    "It most likely is, but that isn't normally a barrier to most adventurers! And it may very well lead to something very interesting.",
    "Perhaps you should explore it? If it's the temple of Ah Za Rhoon, it may be our only chance against Rashiliyia. I implore you to  investigate Bwana.",
    "Well that sounds great Bwana. Tell me, what did you find?",
    "Bervirius is the son of Rashiliyia. His tomb may hold some clues as to how Rashiliyia may be defeated.",
    "Well, just let me see the item and I'll help as much as I can.",
    "Look for something that can identify the place. Leave no stone unturned.",
    "We need to identify that the place you have found is indeed Ah Za Rhoon.",
    "Look for details of Rashiliyia's kin, these may be well hidden.",
    "Any scrolls or information about Rashiliyia's kin would be helpful.",
    "There is a legend about Rashiliyia, look for it in the temple.",
    "Have you got any items concerning Rashiliyia? If so, please show me them.",
    "Look for something relating to Zadimus at the temple. He was the Priest who built the temple.",
    "There must be something relating to Zadimus at the temple. Did you find anything? If so, let me see it.",
    "And best of luck!",
    "All I know is that Zadimus was a high priest of Zamorak. Rashiliyia loved him, but he did not return her affections. When she became a more powerful sorceress she attacked Ah Za Rhoon, reducing it to rubble. What Zadimus' fate was, I do not know. If you find anything relating to him at the temple of Ah Za Rhoon, please let me see it.",
    "Zadimus is a spirit yearning for freedom. Bury him in a sacred place to release his spirit.",
    "You're quite welcome Bwana.",
    "We need to find Rashiliyia's resting place and learn how to put her spirit to rest. You may find some clues to her resting place in Ah Za Rhoon or Bervirius' Tomb.",
    "If you have found the temple, you should search it thoroughly and see if there are any clues about Rashiliyia.",
    "This is an ancient artefact!",
    "I can certainly try! Hmm, incredible, it seems very ancient and mentions something about Zadimus and Ah Za Rhoon. It says, 'Here lies the traitor Zadimus, let his spirit be forever tormented'.",
    "If you have found anything else that you need help with, please just let me know.",
    "Truly amazing Bwana, this scroll must be ancient. I'm not sure if I get more meaning from it than you though. Perhaps Bervirius' tomb is still accessible?",
    "I am speechless Bwana, this is truly ancient. Where did you find it?",
    "You must truly have found the temple of Ah Za Rhoon! The scroll gives some interesting details about Rashiliyia, some things I didn't know before.",
    "Hmmm, well just that part about the wards...",
    "It may be possible to make a ward like that... But what is the best thing to make it from? Perhaps something close to Bervirius, an item of some significance to him.",
    "You're quite welcome Bwana.",
    "! GASP ! That's incredible, where did you find it?",
    "Hmmm, that sounds very strange. I sense a spirit in torment, you should try to bury the remains.",
    "The ground in the centre of the village is very sacred to us. Maybe you could try there?",
    "I dare not touch it. I am a spiritual man and the spirit of this being may possess me and turn me into a minion of Rashiliyia.",
    "Greetings Bwana, you have been away! The situation with Rashiliyia is worsening! I pray that you have some good news for me.",
    "Well that sounds great Bwana. Tell me, what did you find?",
    "Something seems different about you. You look like you have seen a ghost?",
    "Oh! So you managed to bury Zadimus's corpse?",
    "It looks like a simple shard of bone. Why do you think it is significant?",
    "Ah, interesting, so you think that Zadimus gave you the bone? What makes you say that?",
    "What did he say?",
    "Hmmm, maybe it's a clue of some kind? Rashiliyia's only kin was a son, 'Bervirius'. His remains were entombed on a small island which lies to the South West. I will do some research into this to see if I can find any other details. But I think we must take Zadimus' clue literally and get some item that belonged to Bervirius as it may be the only way to approach Rashiliyia. Perhaps something like this exists in his tomb?",
    "Oh, so it most likely was not very important then.",
    "Oh, right. Come back and talk with me if you get an idea.",
    "Well why are you showing it to me then?",
    "Greetings Bwana, did you find Bervirius' Tomb?",
    "Congratulations Bwana, show me any items you have found though. I may be able to help.",
    "That is a shame Bwana. We really do need to act against Rashiliyia soon if we are ever to stand a chance of defeating her.",
    "Well, Bwana, this is no laughing matter. We need to take this very seriously and act now! If you have found any items at the tomb that you need help with please let me see them and I will help as much as I can.",
    "What could I possibly help you with Bwana?",
    "Maybe you need to look around a little more. There must be some small detail at least that can help us.",
    "Hmm, these notes are quite extraordinary Bwana. They give location details of Rashiliyia's tomb, and some information on how to use the crystal. The information is quite specific, North of Ah Za Rhoon! That's a great place to start looking!",
    "This is incredible Bwana.",
    "Absolutely! This will help you to locate the entrance to Rashiliyia's tomb. Simply activate it when you think you are near, and it should glow different colours to show how near you are.",
    "It is a very nice item Bwana. It may be just what you need to gain access to Rashiliyia's tomb. While you were away, I did some research. Rashiliyia would spare the lives of those who wore bronze necklaces. This pommel may have some significance to Bervirius. Perhaps you can craft something from it that can help? My guess is that you will need some protection from Rashiliyia if you intend to enter her tomb!",
    "Well, Bwana, I would guess that you would need to get some bronze metal and work it into something that could be turned into a necklace?",
    "You're more than welcome Bwana! Good luck for the rest of your quest.",
    "Perhaps Zadimus' clue has the answer? Now, what was it that he said again? Something about kin and keys? That sword pommel belonged to Bervirius didn't it?",
    "Hmm, very interesting Bwana, your abilities are much more focused than I had initially thought. I presume these are to be part of the ward to protect you from Rashiliyia?",
    "This is very impressive Bwana, I'm quite surprised at your ingenuity. This should be a good protection against Rashiliyia if you ever find her Tomb.",
    "This is amazing Bwana, the level of detail is incredible. Where did you find it?",
    "How very inventive Bwana. You must have seen the lock to have crafted it so well. Does the key work?",
    "How interesting Bwana, did you find anything?",
    "Maybe you should go back and try to find some more things. Show me any other items that you may have. We need any clue to locate Rashiliyia's resting place.",
    "If you let me see them Bwana, perhaps I can offer you some extra information.",
    "It may be an idea to try it and then scout out the area. If it relates to Rashiliyia, it might help us  to defeat her.",
    "You must already know what it opens to have carved it so perfectly. Perhaps in your travels you have come across some unique doors with a unique lock? I hope this helps with your quest.",
    "Greetings again Bwana. I hope that you have managed to locate Rashiliyia's Tomb. Again, if you found anything interesting, please show it to me.",
    "Well Bwana, if you have Rashiliyia's remains, you need to find a way to put her spirit to rest. Perhaps there was a clue with one of the artefacts that you have? Why not have a look through the artefacts that you have found and see if there is some clue that might help? If you do not have her remains, you will need to find them.",
    "You're more than welcome Bwana! Good luck for the rest of your quest.",
    "This is truly incredible bwana... So these are the remains of the dread Queen Rashiliyia?",
    "Hmm, I'm not exactly sure... Perhaps there is a clue in one of the artefacts you have found?",
    "I dare not take them, I may be taken over by the evil spirit of Rashiliyia!",
    "Hello Bwana. I conclude that you have been successful. Mosol sent word that the village is clearing of zombies. You have done us all a great deed! Why not go and visit him and have a look around Shilo village. You may find some interesting things there!",
    "Hello again Bwana! Well Done again for helping to defeat Rashiliyia. Hopefully things will return to normal around here now."
  ],
  "Spirit of Zadimus": [
    "You have released me from my torture, and now I shall aid you. You seek to dispell[sic] the one who tortured and killed me. Remember this... 'I am the key, but only kin may approach her.'"
  ],
  "Rashiliyia": [
    "Which non-kin dares enter my tomb?",
    "Let me squeeze the life from your mortal frame!",
    "My minions will finish thee!",
    "You have my gratitude for releasing me, there is still much that needs to be done before Shilo Village is utterly destroyed. Please excuse me, I have plans and people to execute!",
    "You have my gratitude for releasing my spirit. I have suffered a vengeful and evil existence. I was tricked by Zamorak. He returned my son to me as an undead creature. My hatred and bitterness corrupted me. I tried to destroy all life... now I am released. And am grateful to contemplate eternal rest..."
  ],
  "Nazastarool": [
    "Who dares disturb Rashiliyia's rest?",
    "Who dares disturb Rashiliyia's rest?",
    "I am Nazastarool! Prepare to die!",
    "I am Nazastarool! Prepare to die!",
    "Quake in fear, for I am reborn!",
    "Your death will be swift.",
    "Nazastarool returns with vengeance!",
    "Nazastarool returns with vengeance!",
    "Soon you will serve Rashiliyia.",
    "Soon you will serve Rashiliyia.",
    "May you perish in the fires of Zamorak's furnace!Rashiliyia's curse is upon you!"
  ],
  "You hear a disembodied voice fading away into the distance": [
    "May you perish in the fires of Zamorak's furnace!Rashiliyia's curse is upon you!"
  ],
  "Congratulations! You have completed": [
    "'Shilo Village' - Complete this Experienced quest."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Shilo_Village?oldid=35392915’"
  ]
}