{
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "post-quest dialogue, transcripts of the other bard songs and combination door riddlesYou can discuss this issue on the talk page or edit this page to improve it."
  ],
  "Brundt the Chieftain": [
    "Greetings outerlander!",
    "Do not take it personally, outerlander! We are a simple people, and it is our experience that keeping ourselves to ourselves is best. This is why speaking to outerlanders is forbidden. We do not wish to enter war with the outerlanders and their strange magics, so we limit all unauthorised communication.",
    "Ah, this is because I am the chieftain. I am the one who authorises contact. You will not find many of my tribe so forthcoming with you, as I.",
    "Well, there is one way... but I doubt it is of any interest to you.",
    "Quests, you say outerlander? Well, I would not call it a quest as such, but if you are brave of heart and strong of body, perhaps... No, you would not be interested. Forget I said anything, outerlander.",
    "It is as I thought outerlander. Your kind care nothing for the Fremennik, and we feel the same about you. This is the way of the world.",
    "You would? These are unusual sentiments to hear from an outerlander! My suggestion was going to be that if you crave adventure and battle, and your heart sings for glory, then perhaps you would be interested in joining our clan, and becoming a Fremennik yourself?",
    "Well, there are two ways to become a member of our clan and call yourself a Fremennik: be born a Fremennik, or be voted in by our council of elders.",
    "Well, that I cannot answer myself. You will need to speak to each of them and see what they require of you as proof of your dedication. There are twelve council members around this village; you will need to gain a majority vote of at least seven councillors in your favour. So what say you? Give me the word, and I will tell all of my tribe of your intentions, be they yea or nay. So what say you? Give me the word, and I will tell all of my tribe of your intentions, be they yea or nay.",
    "As I say outerlander, you must find and speak to the twelve members of the council of elders, and see what tasks they might set you. If you can gain the support of seven of the twelve, then you will be accepted as one of us without question.",
    "I am sorry to say that I expected such a response from an outerlander. I thought perhaps you might have been different to all the others...",
    "Not really my affair, outerlander.",
    "A reduction on sales taxes? Why, I am the only one in the Fremennik who may authorise such a thing. What does an outerlander want with that?",
    "Hmmm. Interesting. Your trials seem to be very different to those I took as a young lad. Well, I am not adverse in principle to giving a slight tax break to our shops. There will of course be a shortfall in the tribe's income, that will need to be made up for elsewhere, however. How about this. For many years Sigli has been the only one in the tribe who knows the locations of the best hunting grounds where game is easiest to catch. If you can persuade him to let the entire tribe know these hunting grounds, then we can increase productivity within the tribe, and any shortfall caused by lowering sales taxes will be covered. I think this is a more than fair arrangement to make, don't you?",
    "Speak to Sigli then, and you may have my promise to reduce our sales taxes. And best of luck with the rest of your trials.",
    "Ah, outerlander... if you wish to become a Fremennik you should try and pay more attention to what people tell you... Sigli the hunter is the only one who knows of such hunting grounds. Go and request his knowledge.",
    "Excellent work outerlander! And so quickly, too! Here, you may take my financial report promising reduced sales taxes on all goods.",
    "Not unless it's a map of the hunting grounds.",
    "Not at all outerlander; now that we have Sigli's map we can increase the amount of hunts we run, and make up any shortfall that way.",
    "Greetings again outerlander! How goes your attempts to gain votes with the council of elders?",
    "Go and speak to the twelve members of the council of elders who live in this village. I am sure at least a few will be prepared to vote for you.",
    "Hmmm... well that is certainly a good start I would say. Keep up the good work! Remember: You need to get at least seven council votes to be accepted as a member of the Fremennik.",
    "Hmmm... you are doing very well so far, outerlander. Keep up the good work! Remember: You need to get at least seven council votes to be accepted as a member of the Fremennik.",
    "If you need any help with your trials, I suggest you speak to Askeladden. He is currently doing his own trials of manhood to become a true Fremennik.",
    "I know outerlander, for I have been closely monitoring your progress so far! Then let us put the formality aside, and let me personally welcome you into the Fremennik! May you bring us honour!",
    "From this day onward, you are outerlander no more! In honour of your acceptance into the Fremennik, you gain a new name: [Fremennik name]."
  ],
  "Player": [
    "Why will no-one talk to me?",
    "Then how come you're talking to me?",
    "Is there a way for you to authorise your tribe to talk to me then?",
    "Do you have any quests?",
    "You're right. I really couldn't care less.",
    "Actually, I would be very interested to hear what you have to offer.",
    "What would that involve exactly?",
    "Well, I think I've missed the first way, but how can I get the council of elders to vote to let me join your clan?",
    "I think I would enjoy the challenge of becoming an honorary Fremennik. Where and how do I start?",
    "No way do I want to become like YOU! Forget you, and forget your whole stupid town! You're a bunch of stupid primitives, from what I've seen!",
    "Hi. Are you a member of the council of elders?",
    "That's right, to become a Fremennik.",
    "It's okay I guess...",
    "I know this is a bit of a long shot... but are you a member of the council of elders?",
    "I guess you're not then.",
    "Uh... I'll take that as a no.",
    "I guess not.",
    "Er.... okay.",
    "Hi, I don't suppose you are a member of the council of elders are you?",
    "Hello, are you a member of the council?",
    "Hi. Are you a member of the council?",
    "Fair enough.",
    "Are you a member of the council of elders?",
    "Okay, thanks.",
    "Hi. Are you a member of the council?",
    "Oh, okay then.",
    "Are you a member of the council of elders?",
    "Okay, thanks.",
    "Hello. Are you a council member?",
    "Er... I do.",
    "I would like to become a Fremennik!",
    "That's right! So can I have your vote?",
    "Yes?",
    "WHAT?!?!?! I don't have 100,000,000,000,000,000,900,470,093 coins!!!! NOBODY has that many coins!!!",
    "Are you a member of the Fremennik council?",
    "Well, I was told by Brundt that I could be voted into the tribe as an honorary Fremennik if I could find seven members of the council of elders to vote in my favour.",
    "So can I have your vote?",
    "Um... do you have any estimate when that is?",
    "Hello. I'm looking for a member of the council of elders who will support my application to become an honorary Fremennik.",
    "So can I somehow persuade you to vote for me at the council of elders?",
    "But you don't even know me!",
    "I didn't come all the way up here just to be insulted!",
    "You know what? Forget you, you stupid barbarian! I don't need your stupid vote!",
    "I'm looking for a council member...",
    "As a matter of fact, I am!",
    "Uh... yeah, something like that...",
    "What? But... that's impossible!",
    "Do you know any council members?",
    "Great! Can you vote for me at the council of elders for me to become a Fremennik?",
    "(sigh) What condition?",
    "It's kind of mean to trick me like that...",
    "Hello there!",
    "That's right! Why, are you on the council?",
    "Great!",
    "And what's that?",
    "A drinking contest? Easy. Set them up, and I'll knock them",
    "I don't think drinking myself into a stupor is a very good way of testing my worthiness.",
    "I'm going to find someone else to vote for me then.",
    "What do I have to do to earn your vote again?",
    "Oh yeah. Okay, I will do.",
    "Yes, let's start this drinking contest!",
    "Ish no' fair! (hic) I canna drink another drop! I alsho feel veddy, veddy ill...",
    "I'm not quite ready yet...",
    "Hello.",
    "So you fixed the bridge?",
    "What is it?",
    "Hello.",
    "Didn't you used to sell poison?",
    "Uh, yeah, I've already heard the sales pitch.",
    "So you don't sell poison any more?",
    "Into alcohol?",
    "And what is that?",
    "So... when you say 'all good stockists'...",
    "How many inns actually sell this stuff?",
    "So what is the point?",
    "I see...",
    "Actually, I would like some. How much do you want for it?",
    "Yes please!",
    "No, not really.",
    "I understand you have some low alcohol beer for sale...?",
    "I'm going to have to find some way to distract this guy while I cheat...",
    "I don't have anything I really want to put inside a smelly old drain pipe.",
    "That is going to make a really loud bang when it goes off! It would be a perfect distraction to help me cheat in the drinking contest!",
    "Yes, let's start this drinking contest!",
    "Aaaah, lovely stuff. So you want to get the next round in, or shall I? You don't look so good there!",
    "So I can rely on your vote at the council?",
    "Are you a member of the council?",
    "Well, I ask because I am currently doing the Fremennik trials so as to join your clan. I need seven of the twelve council of elders to vote for me.",
    "So how would I do that?",
    "Sure! This certainly sounds pretty easy to accomplish - I'll have your vote in no time!",
    "Forget it! This all sounds like way too much work for a stupid vote at a meeting! I'll find someone else instead.",
    "So how would I go about writing this epic?",
    "How do I make an instrument?",
    "Then what do I need to do?",
    "Anything else?",
    "Who or what is Fossegrimen?",
    "So what would be a worthy offering?",
    "Okay, what else do I need to do?",
    "Can you remind me about making a lyre again, please Olaf?",
    "Can you remind me about getting a blessing from Fossegrimen again?",
    "Can you remind me about how to perform at the long hall again, please?",
    "No thanks, I think that's all pretty straight forward. I'll go and make my lyre now.",
    "Hello there.",
    "Actually, I'm not after your golden apples. I was wondering if I could have some golden wool; I need it to string a lyre.",
    "Yes, yes, you are incredibly clever. Now please can I have some golden wool?",
    "Other human? You mean someone else has been there and you gave them wool?",
    "I see... okay, well, bye!",
    "No, honest, you're REALLY clever. Why, I could not contemplate a mere chicanery with an advanced intellect such as you currently present.",
    "Can I give you a present? Or maybe exchange you something for some wool?",
    "Erm... okay then.",
    "Hello there. I understand you managed to get some golden wool from Lalli?",
    "So how did you manage to get the wool?",
    "Indeed he is. So how did you manage to get some golden wool from him?",
    "What pet is this then?",
    "Do you have any spare rocks then?",
    "So this is the exact same type of rock you managed to sell to Lalli as a pet?",
    "Can I have another rock? I lost mine...",
    "Hello there.",
    "As a matter of fact I do! So tell me, Lalli. Have you ever tried a human delicacy known as stone soup?",
    "Well, that is where you are wrong. I will now put this rock, into your cauldron over there, and make soup from it.",
    "Ah, that is simply seasoning. Stone soup is delicious by itself, but the taste is really brought out if you use onion, potato and cabbage too.",
    "Not just yet...",
    "Indeed it is. Try it and see.",
    "Indeed it is. But I'm willing to trade it.",
    "Hello there.",
    "I. DON'T. WANT. ANY. GOLDEN. APPLES. ALL. I. WANT. IS. A. GOLDEN. FLEECE.",
    "Glad you're happy Lalli!",
    "The thought of lots of questing",
    "leaves some people unfulfilled,",
    "but I have done my simple best",
    "in entering the Champions' Guild.",
    "When it comes to fighting",
    "I hit my share of zeroes",
    "But I'm well respected at",
    "the Guild reserved for Heroes.",
    "I cannot even start to list",
    "the amount of foes I've killed.",
    "I will simply tell you this:",
    "I've joined the Legends' Guild!",
    "When people speak of training",
    "some people think they're fine.",
    "But they just all seem jealous that",
    "my [skill]'s ninety-nine!",
    "Player is my name,",
    "I haven't much to say.",
    "But since I have to sing this song,",
    "I'll just go ahead and play.",
    "So can I rely on your vote with the council of elders in my favour?",
    "Erm... so that's a yes, then?",
    "Hello there!",
    "Are you a member of the council?",
    "I was wondering if I can count on your vote at the council of elders?",
    "How did I know it wouldn't be that simple for your vote?",
    "A flower? What's the catch?",
    "Well... I guess that doesn't sound too hard.",
    "Okay. I don't think this will be too difficult. Any suggestions on where to start looking for this flower?",
    "No help at ALL?",
    "You know what? No. This all sounds like a lot of hassle to me, and frankly I just can't be bothered with it right now. I'll go get someone else to vote for me.",
    "Hello there!",
    "I'm still working on it... Do you have any suggestion where to start looking for it?",
    "I don't suppose you have any idea where I could find an exotic flower from across the sea, do you?",
    "I don't suppose you have any idea where I could find a finely balanced custom bowstring, do you?",
    "I don't suppose you have any idea where I could find an exotic and extremely obscure fish, do you?",
    "I don't suppose you have any idea where I could find a map of deep sea fishing spots, do you?",
    "I don't suppose you have any idea where I could find a weather forecast from the Fremennik Seer do you?",
    "I don't suppose you have any idea where I could find a brave and powerful warrior to act as a bodyguard?",
    "I don't suppose you have any idea where I could find a token to allow a seat at the champions table, do you?",
    "I don't suppose you have any idea where I could find the longhall barkeeps'[sic] legendary cocktail, do you?",
    "I don't suppose you have any idea where I could find a unique flower from across the sea, do you?",
    "I don't suppose you have any idea where I could find a finely balanced custom bowstring, do you?",
    "I don't suppose you have any idea where I could find an exotic and extremely odd fish, do you?",
    "I don't suppose you have any idea where I could find a map of deep sea fishing spots, do you?",
    "I don't suppose you have any idea where I could find a weather forecast from the Fremennik Seer do you?",
    "I don't suppose you have any idea where I could find a brave and powerful warrior to act as a bodyguard?",
    "I don't suppose you have any idea where I could find the token to allow your seat at the champions table?",
    "I don't suppose you have any idea where I could find the longhall barkeeps'[sic] legendary cocktail, do you?",
    "I don't suppose you have any idea where I could find a written promise from Askeladden to stay out of the Longhall?",
    "I don't suppose you have any idea where I could find a unique flower from across the sea, do you?",
    "I don't suppose you have any idea where I could find a finely balanced custom bowstring, do you?",
    "I don't suppose you have any idea where I could find a weather forecast from the Fremennik Seer do you?",
    "I don't suppose you have any idea where I could find a brave and powerful warrior to act as a bodyguard?",
    "I don't suppose you have any idea where I could find a token to allow a seat at the champions table, do you?",
    "I don't suppose you have any idea where I could find the longhall barkeeps'[sic] legendary cocktail, do you?",
    "I don't suppose you have any idea where I could find a written promise from Askeladden to stay out of the Longhall?",
    "I don't suppose you have any idea where I could find a unique flower from across the sea, do you?",
    "I don't suppose you have any idea where I could find a finely balanced custom bowstring, do you?",
    "I don't suppose you have any idea where I could find a map of deep sea fishing spots, do you?",
    "I don't suppose you have any idea where I could find an exotic and extremely odd fish, do you?",
    "I don't suppose you have any idea where I could find a weather forecast from the Fremennik Seer do you?",
    "I don't suppose you have any idea where I could find a brave and powerful warrior to act as a bodyguard?",
    "I don't suppose you have any idea where I could find a written promise from Askeladden to stay out of the Longhall?",
    "I don't suppose you have any idea where I could find a unique flower from across the sea, do you?",
    "I don't suppose you have any idea where I could find a finely balanced custom bowstring, do you?",
    "I don't suppose you have any idea where I could find an exotic and extremely odd fish, do you?",
    "I don't suppose you have any idea where I could find a map of deep sea fishing spots, do you?",
    "I don't suppose you have any idea where I could find a weather forecast from the Fremennik Seer do you?",
    "I don't suppose you have any idea where I could find a brave and powerful warrior to act as a bodyguard?",
    "I don't suppose you have any idea where I could find the token to allow your seat at the champions table?",
    "I don't suppose you have any idea where I could find the longhall barkeeps'[sic] legendary cocktail, do you?",
    "I don't suppose you have any idea where I could find a written promise from Askeladden to stay out of the Longhall?",
    "I don't suppose you have any idea where I could find a unique flower from across the sea, do you?",
    "I don't suppose you have any idea where I could find a finely balanced custom bowstring, do you?",
    "I don't suppose you have any idea where I could find an exotic fish, do you?",
    "I don't suppose you have any idea where I could find a map of deep sea fishing spots, do you?",
    "I don't suppose you have any idea where I could find the token to allow your seat at the champions table?",
    "I don't suppose you have any idea where I could find the longhall barkeep's legendary cocktail, do you?",
    "I don't suppose you have any idea where I could find a written promise from Askeladden to stay out of the Longhall?",
    "I don't suppose you have any idea where I could find a finely balanced custom bowstring, do you?",
    "I don't suppose you have any idea where I could find an exotic fish, do you?",
    "I don't suppose you have any idea where I could find a map of deep sea fishing spots, do you?",
    "I don't suppose you have any idea where I could find a weather forecast from the Fremennik Seer do you?",
    "I don't suppose you have any idea where I could find a brave and powerful warrior to act as a bodyguard?",
    "I don't suppose you have any idea where I could find the token to allow your seat at the champions table?",
    "I don't suppose you have any idea where I could find the longhall barkeep's legendary cocktail, do you?",
    "I don't suppose you have any idea where I could find a written promise from Askeladden to stay out of the Longhall?",
    "I don't suppose you have any idea where I could find a unique flower from across the sea, do you?",
    "I don't suppose you have any idea where I could find an exotic and extremely odd fish, do you?",
    "I don't suppose you have any idea where I could find a map of deep sea fishing spots, do you?",
    "I don't suppose you have any idea where I could find a weather forecast from the Fremennik Seer do you?",
    "I don't suppose you have any idea where I could find a brave and powerful warrior to act as a bodyguard?",
    "I don't suppose you have any idea where I could find a token to allow a seat at the champions table, do you?",
    "I don't suppose you have any idea where I could find the longhall barkeep's legendary cocktail, do you?",
    "I don't suppose you have any idea where I could find a written promise from Askeladden to stay out of the Longhall?",
    "I don't suppose you have any idea where I could find a unique flower from across the sea, do you?",
    "I don't suppose you have any idea where I could find a map of deep sea fishing spots, do you?",
    "I don't suppose you have any idea where I could find a weather forecast from the Fremennik Seer do you?",
    "I don't suppose you have any idea where I could find a brave and powerful warrior to act as a bodyguard?",
    "I don't suppose you have any idea where I could find a token to allow a seat at the champions table, do you?",
    "I don't suppose you have any idea where I could find the longhall barkeep's legendary cocktail, do you?",
    "I don't suppose you have any idea where I could find a written promise from Askeladden to stay out of the Longhall?",
    "I don't suppose you have any idea where I could find a unique flower from across the sea, do you?",
    "I don't suppose you have any idea where I could find a finely balanced custom bowstring, do you?",
    "I don't suppose you have any idea where I could find an exotic fish, do you?",
    "I don't suppose you have any idea where I could find a brave and powerful warrior to act as a bodyguard?",
    "I don't suppose you have any idea where I could find a token to allow a seat at the champions table, do you?",
    "I don't suppose you have any idea where I could find the longhall barkeeps'[sic] legendary cocktail, do you?",
    "I don't suppose you have any idea where I could find a written promise from Askeladden to stay out of the Longhall?",
    "I don't suppose you have any idea where I could find a unique flower from across the sea, do you?",
    "I don't suppose you have any idea where I could find a finely balanced custom bowstring, do you?",
    "I don't suppose you have any idea where I could find an exotic and extremely odd fish, do you?",
    "I don't suppose you have any idea where I could find a map of deep sea fishing spots, do you?",
    "I don't suppose you have any idea where I could find a weather forecast from the Fremennik Seer do you?",
    "I don't suppose you have any idea where I could find a brave and powerful warrior to act as a bodyguard?",
    "I don't suppose you have any idea where I could find a token to allow a seat at the champions table, do you?",
    "I don't suppose you have any idea where I could find a unique flower from across the sea, do you?",
    "I don't suppose you have any idea where I could find a finely balanced custom bowstring, do you?",
    "I don't suppose you have any idea where I could find an exotic and extremely odd fish, do you?",
    "I don't suppose you have any idea where I could find a map of deep sea fishing spots, do you?",
    "I don't suppose you have any idea where I could find a weather forecast from the Fremennik Seer do you?",
    "I don't suppose you have any idea where I could find a brave and powerful warrior to act as a bodyguard?",
    "I don't suppose you have any idea where I could find the longhall barkeep's legendary cocktail, do you?",
    "I don't suppose you have any idea where I could find a written promise from Askeladden to stay out of the Longhall?",
    "I don't suppose you have any idea where I could find a unique flower from across the sea, do you?",
    "I don't suppose you have any idea where I could find a finely balanced custom bowstring, do you?",
    "I don't suppose you have any idea where I could find an exotic and extremely odd fish, do you?",
    "I don't suppose you have any idea where I could find a map of deep sea fishing spots, do you?",
    "I don't suppose you have any idea where I could find a weather forecast from the Fremennik Seer do you?",
    "I don't suppose you have any idea where I could find a brave and powerful warrior to act as a bodyguard?",
    "I don't suppose you have any idea where I could find a token to allow a seat at the champions table, do you?",
    "I don't suppose you have any idea where I could find the longhall barkeeps'[sic] legendary cocktail, do you?",
    "I don't suppose you have any idea where I could find a written promise from Askeladden to stay out of the long hall?",
    "I don't suppose you have any idea where I could find a unique flower from across the sea, do you?",
    "Can I buy it from you?",
    "Maybe you could let me have the flower and do something else to impress her?",
    "So if I can find someone to write you a romantic ballad, you will give me your flower?",
    "I don't suppose you have any idea where I could find a love ballad, do you?",
    "I don't suppose you have any idea where I could find a love ballad, do you?",
    "Great! Can you write me one then?",
    "let me guess; here comes the 'but'.",
    "Why is that then?",
    "I don't suppose you have any idea where I could find some custom sturdy boots, do you?",
    "I don't suppose you have any idea where I could find some custom sturdy boots, do you?",
    "They're not for me... I need them for Olaf.",
    "Okay, I will see what I can do.",
    "I don't suppose you have any idea where I could find a guarantee of a reduction on sales taxes, do you?",
    "I don't suppose you have any idea where I could find a guarantee of a reduction on sales taxes, do you?",
    "Actually, it's not for me. I need to get it as part of my trials.",
    "Yeah, that sounds very fair.",
    "I don't suppose you have any idea where I could find a map to unspoiled hunting grounds, do you?",
    "I don't suppose you have any idea where I could find a map to unspoiled hunting grounds, do you?",
    "No, I guess not. So can I have it?",
    "What? Power? Money? Women? Wine?",
    "So where would I get that?",
    "I don't suppose you have any idea where I could find a finely balanced custom bowstring, do you?",
    "I don't suppose you have any idea where I could find a finely balanced custom bowstring, do you?",
    "It's for Sigli. It needs to be weighted precisely to suit his hunting bow.",
    "What's that?",
    "Then maybe you'll accept something else...?",
    "Sounds good to me.",
    "I don't suppose you have any idea where I could find an exotic and extremely odd fish, do you?",
    "Er... no, it's the one for you that I'm looking for...",
    "I don't suppose you have any idea where I could find an exotic and extremely odd fish, do you?",
    "You have it? Can I trade you something for it?",
    "Is that all?",
    "I'll see what I can do.",
    "I don't suppose you have any idea where I could find a map of deep sea fishing spots do you?",
    "I don't suppose you have any idea where I could find a map of deep sea fishing spots do you?",
    "Great! Can I have it?",
    "Perhaps I can trade you something for it?",
    "Where could I get a weather forecast from then?",
    "I don't suppose you have any idea where I could find a weather forecast from the Fremennik Seer do you?",
    "I don't suppose you have any idea where I could find a weather forecast from the Fremennik Seer do you?",
    "Can I have a weather forecast then please?",
    "I knew you were going to say that...",
    "That's all?",
    "I don't suppose you have any idea where I could find a brave and powerful warrior to act as a bodyguard?",
    "I don't suppose you have any idea where I could find a brave and powerful warrior to act as a bodyguard?",
    "Is there no way you would do this for me?",
    "So you want me to go kill one of them off for you? Make it look like an accident?",
    "Okay, I'll see what I can do.",
    "I don't suppose you have any idea where I could find the token to allow your seat at the champions table?",
    "I don't suppose you have any idea where I could find a token to allow a seat at the champions table, do you?",
    "Cool. That sounds pretty sweet! So I guess you don't want to give it away?",
    "That's all?",
    "I don't suppose you have any idea where I could find the longhall barkeeps' legendary cocktail, do you?",
    "I don't suppose you have any idea where I could find the longhall barkeeps' legendary cocktail, do you?",
    "But you still remember how to make it, right?",
    "And you have all the ingredients here? I don't need to go chasing round the world for obscure ingredients to make it?",
    "Can you make me your legendary cocktail then?",
    "Any way I could change your mind?",
    "That kid outside? Sure.",
    "Any idea how I can get him to do that?",
    "I don't suppose you have any idea where I could find a written promise from Askeladden to stay out of the Longhall?",
    "I don't suppose you have any idea where I could find a written promise from Askeladden to stay out of the Longhall?",
    "Yup, she really did.",
    "Yeah, I really do...",
    "That's all you want in return? Sure thing. Here you go.",
    "I don't think so... That's really quite a lot of money...",
    "I've lost one of the items I was supposed to be trading.",
    "I thought you really liked the long hall?",
    "Then why did you sign this guarantee that you will never enter it again?",
    "Knowing you, I guess I didn't.",
    "Hi! Can I please have one of your legendary cocktails now?",
    "Uh... yeah... yeah, you probably won't see someone called Askeladden coming in here...",
    "I'm trying to remember who I was meant to give this trade item to.",
    "Thanks for making me this cocktail. Why don't you make them anymore normally?",
    "Thanks, I'd like that.",
    "Hey. I got your cocktail for you.",
    "It's just a drink...",
    "I guess you're happy with the trade then!",
    "Is this trade item for you?",
    "So it doesn't bother you at all that you just gave up your place here for one drink?",
    "So it was nice?",
    "What did it taste of, then?",
    "I would like your contract to offer your services as a bodyguard.",
    "It's a good thing I have the Champions' Token right here then, isn't it?",
    "Is this item for you?",
    "You didn't take much persuading to 'lower' yourself to a bodyguard.",
    "Can I have a weather forecast now please?",
    "Yeah, I know; I have one right here from Thorvald.",
    "I've got an item to trade but I don't know if it's for you.",
    "So, about this forecast...",
    "I still don't know why you didn't just let me have one anyway in the first place. Surely it means nothing to you?",
    "Okay... I... think I understand...",
    "I would like your map of fishing spots.",
    "What, like this one I have here?",
    "I have a trade item here.",
    "If this map of fishing spots is so valuable, why did you give it away to me so easily?",
    "Here. I got you your map.",
    "Is this trade item for you?",
    "I don't see what's so special about this so called exotic fish.",
    "Hi there. I got your fish, so can I have that bowstring for Sigli now?",
    "Thanks!",
    "Is this trade item for you?",
    "So about this bowstring... was it hard to make or something?",
    "Here. I have your bowstring. Give me your map to the hunting grounds.",
    "I have an item to trade.",
    "So you really don't mind giving this away to me?",
    "I got Sigli's hunting map for you.",
    "I've got this trade item. Is it for you?",
    "So cutting sales tax isn't going to ruin your economy here or anything?",
    "Hello. Can I have those boots now? Here is a written statement from Brundt outlining future tax burdens upon Fremennik merchants and shopkeepers for the year.",
    "I have this trade item but I can't remember who it's for.",
    "Hey, these shoes look pretty comfy. Think you could make me a pair like them?",
    "Hello Olaf. Do you have a beautiful love song written for me?",
    "As a matter of fact - I do!",
    "I've got a trade item; is it for you?",
    "So you think this song is pretty good then?",
    "Thanks! That sounds perfect!",
    "You'll be glad to know I have had a love song written just for you by Olaf. So can I have that flower of yours now?",
    "I've got an item to trade.",
    "So tell me... who is this woman that you are trying to impress anyway?",
    "Hello there!",
    "I'm still working on it... Do you have any suggestion where to start looking for it?",
    "I was making some trades, but then I lost the goods...",
    "Here's that flower you wanted.",
    "Hello there!",
    "So I can count on your vote at the council of elders?",
    "Are you a member of the council?",
    "I was wondering if I could persuade you to vouch for me as a member of your clan?",
    "How can I prove my hunting skills to you? I can go kill, like, a hundred chickens for you right now!",
    "Cows then? I can kill cows until, er, the cows come home.",
    "Not... Giant Rats?!?!",
    "What's a Draugen? Some kind of cheap barbarian rip-off of a dragon?",
    "...Let me get this straight; You want me to hunt an unkillable, invincible, and invisible enemy? How am I supposed to do that?",
    "Well, I need every vote I can get in the council of elders, but this certainly sounds impossible to do...",
    "Forget it! This all sounds like way too much work for a stupid vote at a meeting! I'll find someone else instead.",
    "Not yet...",
    "Not yet... I lost the talisman you gave me.",
    "I defeated the draugen, but I have lost the talisman to prove I did.",
    "Thanks!",
    "Hello! I am trying to become a member of the Fremennik clan! The Chieftain told me that I may be able to gain your vote at the council of elders?",
    "What kind of test?",
    "Well, how would I go about showing that?",
    "A maze? Is that all? Sure, it sounds simple enough.",
    "Oh really? Watch and learn...",
    "No thanks. I think I can get someone else to vouch for me to the council of elders, without going through a stupid maze like some lab rat.",
    "Ah, forget it.",
    "Erm.... sorry I guess.",
    "Hello! Man, your maze is pretty tough!",
    "Can't I do something else for your vote at the council of elders?",
    "Yeah, it is really confusing down there...",
    "So does that mean I can rely on your vote at the council of elders to allow me into your village?",
    "Thanks!",
    "Hello!",
    "Thanks. So I can rely on your vote in my favour at the council of elders?",
    "Hello. I'm looking for members of the council of elders to vote for me to become a Fremennik.",
    "How can I prove that to you?",
    "An intelligence test? I thought barbarians were stupid!",
    "So what exactly does this puzzle consist of, then?",
    "I can't take anything in there with me?",
    "Yes, I accept your challenge. I have one small question, however...",
    "Well... you say I can bring nothing with me when I enter your house...",
    "Well...",
    "Where is the nearest bank?",
    "And what is that?",
    "Yes, thank you!",
    "No thanks. Nobody touches my stuff but me!",
    "No, thinking about stuff isn't really my 'thing'. I'd rather go kill something. I'll find someone else to vote for me.",
    "So I can bring nothing with me when I enter your house?",
    "So I just have to enter by one door of your house, and leave by the other?",
    "So you will vote for me at the council?",
    "Hello!",
    "Erm... are you a member of the council?",
    "Well... I was wondering if you could vote for me to become a Fremennik.",
    "So how can I prove that? You want to fight me? Come on then, bring it on! Right here, right now, buddy!",
    "Am I prepared? I'll show you what combat's all about, you big sissy barbarian type guy!",
    "Is that all? It will be easy!",
    "No thanks, I'm pretty sure that I can find someone else to vote for me.",
    "So what do I have to do to earn your vote at the council again?",
    "So, who is my opponent?",
    "But he can't REALLY be unkillable... ...can he?",
    "And what do you believe?",
    "I don't really like fighting that much... Isn't there something else I can do to earn your vote at the council of elders?",
    "REALLY?!?!?",
    "So can I count on your vote at the council of elders now Thorvald?",
    "But... I don't understand... I did not manage to beat Koschei...",
    "I don't have any votes yet.",
    "I only have one vote so far.",
    "I only have [3-6] votes so far.",
    "I have seven members of the council prepared to vote in my favour now!"
  ],
  "Askeladden": [
    "Me? On the council? Ha ha ha ha! Sorry buddy, I'm not a 'real' Fremennik yet! Let me guess, you're trying to get some council members to vote for you?",
    "You and me both buddy! We're both doing the same trials! This is my trial of manhood! How you finding it so far? Pretty easy, huh buddy?",
    "Yeah, that's the spirit buddy! It's all real easy, I wouldn't worry yourself about it, you'll be quaffing beers in the long hall as a Fremennik in no time!",
    "HAHAHA! Yeah, that Lalli... what a maroon!",
    "Well, as you know, I am doing the same trials that you are as part of my test of manhood, and that troll is the only one who can get that wool. You might have noticed he's kind of... messed in the head buddy! He's real paranoid about people stealing his golden apples, isn't he?",
    "It was easy buddy! I persuaded him he needed a pet to help him guard his apples. A pet that would never sleep! A pet that would never need food, or exercise! A pet that would never need him to clean up its... well, you know, buddy. A pet that would always be loyal to him! A faithful companion for life!",
    "A pet ROCK! Man, can you believe that stupid troll traded me some of his golden wool for a worthless ROCK? Buddy, I hafta say; if brains were explosives, that troll wouldn't have enough to blow his nose!",
    "Sure thing buddy, although I have to say, I doubt even that troll is stupid enough to fall for the SAME trick TWICE in a row! You can try anyway though!",
    "Yup, sure is buddy! That Lalli is stupid, even by troll standards!",
    "Sure thing buddy! I'd say take better care of this one, but it's just a rock! I have hundreds of them! Go wild!",
    "Nope, sorry buddy!",
    "What? I can't believe she asked you to get a written promise from me to stay out!",
    "Awwwwwww.... but the longhall is just SO MUCH FUN! I'd live there if I could! I suppose you really need that promise to help become a Fremennik, huh?",
    "Well I'll tell you what buddy; As it's you, I'll give you that written promise. All I ask in return for it is a measly 5000 gold. What do you say?",
    "Done, and done. Let me know if you got any more cash burning a hole in your pocket I can relieve you of, buddy.",
    "Hey, suit yourself buddy. You change your mind, the bank of Askeladden is open for deposits 24 hours a day! Eh-heh- heh-heh-heh.",
    "That's a shame. You should speak to the merchant.",
    "I do!",
    "Aha! It is because I am cunning! That guarantee says that Askeladden will never enter the longhall again! But when I have completed my Fremennik trials, and passed my trial of manhood, I will be given a new name, as is our custom, and will therefore not be Askeladden anymore! That guarantee isn't worth the paper it's written on!! You didn't think I would give up going to the longhall for only 5000 did you?"
  ],
  "[Bjorn/Eldgrim]": [
    "Counshil alwaysh meshing up my drinksh 'do thish, do that, pass this tesht something something something something'.. man I hate that counshil.",
    "I'm now a member of the counshil of eblars? Thanksh a lot buddy! (hic) Letsh have a drink to celebrate!",
    "(hic) Washa counshil wha?",
    "Wha? Wassha counshil? (hic) No counshil gone meshup my drink!"
  ],
  "Jarvald": [
    "No, outerlander, I have never had the honour to be asked. I am but a lowly warrior, fighting for my people wherever threats may appear against us... So what do you want from me, outerlander?"
  ],
  "[Borrokar/Freidir/Freygerd/Jennella/Lanzig/Lensa]": [
    "I am afraid not outerlander. Goodbye."
  ],
  "Sailor": [
    "Nope. I'm just a sailor.",
    "Not really my affair, outerlander.",
    "Ah! Even the outerlanders have heard of my mysterious flower! I found it in a country far far away from here!",
    "I'm afraid not, outerlander. There is a woman in this village whose heart I seek to capture, and I think giving her this strange flower might be my best bet with her.",
    "Hmm... that is not a totally stupid idea outerlander. I know she is a lover of music, and a romantic ballad might be just the thing with which to woo her. Unfortunately I don't have a musical bone in my entire body, so someone else will have to write it for me.",
    "That sounds like a fair deal to me, outerlander.",
    "Well, the only musician I know of in these parts would be that terrible bard Olaf... ask him.",
    "Oh. It's by Olaf? Hmm. Well, a deal's a deal. I just hope it's better than the usual rubbish he comes up with, or my chances are worse than ever.",
    "Remember, it's not for me unless it's a love ballad.",
    "It's Thora, the longhall barkeep. Please don't tell her though. She's not like the rest of the Fremennik girls, she has a secret desire to see the world. Being a sailor, I can really relate to that."
  ],
  "Skulgrimen": [
    "No. Weapons are my speciality. Not politics.",
    "I never saw anything like that in my store before.",
    "Aye, I have a few in stock. What would an outerlander be wanting with equipment like that?",
    "For Sigli eh? Well, I made his bow in the first place, so I'll be able to select the right string for you... just one small problem.",
    "This string you'll be wanting... Very special it is. Take a lot of time to recreate. Not sure you have the cash for it.",
    "Heh. Good thinking outerlander. Well, it's true, there is more to life than just making money. Making weapons is good money, but it's not why I do it. I'll tell you what. I heard a rumour that one of the fishermen down by the docks caught some weird looking fish as they were fishing the other day. From what I hear this fish is unique. Nobody's ever seen its like before. This intrigues me. I'd like to have it for myself. Make a good trophy. You get me that fish, I give you the bowstring. What do you say? We got a deal?",
    "What? There's another one?",
    "Ah. I see. I already told you. Some guy down by the docks was bragging. Best ask there, I reckon.",
    "Ohh... That's a nice fish. Very pleased. Here. Take the bowstring. You fulfilled agreement. Only fair I do same. Good work outerlander.",
    "Not for me, I'm afraid.",
    "Not hard. Just a trick to it. Takes skill to learn, but when learnt, easy. Sigli will be happy. Finest bowstring on continent. Will suit his needs perfectly."
  ],
  "Thora the Barkeep": [
    "I am afraid not outerlander.",
    "I wouldn't know about that, outerlander.",
    "How did you hear about that? I didn't think anybody knew about that. Well, it is true that in my younger years as a barkeep, I wandered the lands trying various alcoholic delicacies. Do know how many different types of alcohol there are here in Gielinor? Lots! Well, anyway, I used a fusion of various drinks from all around the world to create the greatest cocktail ever made! Of course, when my wander lust was gone, and I returned to Rellekka to serve as barkeep here, I gave all that up.",
    "Of course.",
    "No, I have them all here. Why?",
    "I would rather not; it is a reminder of a life I left behind when I came back.",
    "You need this to become a Fremennik, right? Well, you seem okay for an outerlander, it would be a shame to see you fail. You know Askeladden?",
    "He is nothing but a pest. He keeps sneaking in and stealing beer. I shudder to think what he will be like when he has passed his trial of manhood, and is allowed in here legitimately. If you can get him to sign a contract promising that he will NEVER EVER EVER darken my doorway here again, you get the drink.",
    "Knowing that little horror, he'll probably be willing to in exchange for some cash. You should go ask him yourself though.",
    "Well, as I say, you should talk to him about that. Knowing the little runt as I do though He'll probably do it for the cash.",
    "What?!?! I can't believe you... Let me look at that... Askeladden would NEVER... Gosh. It looks legitimate.",
    "Here you go, on the house! You have made my life SO much easier! Knowing that little monster won't be bugging me in here all the time anymore! That little weasel will have to abide by this written promise that Askeladden can never ever enter the Longhall again! He can't get round this one!",
    "If it's not the note from Askeladden it isn't me, I'm afraid.",
    "Ah... when I gave up my travels across the world many years back, to return to my expected role as longhall barkeep, as my mother, and her mother, were before me, I gave up a lot of the freedom I had found in the outside world. I know it is our custom to shun outerlanders and their ways, but I didn't find them as bad as the stories say. Sometimes I feel as though we Fremennik live in a prison that we have constructed for ourselves, and that WE are the outerlanders, out here on the edge of the world... I'm sorry, I think it is part of the job of Longhall barkeep to get philosophical about things ocassionally. I wish you all the best of luck with your trials, outerlander. When you have finished, perhaps you will come back here, and we can share a drink over tales of the outside world?"
  ],
  "Yrsa": [
    "No, sorry, I'm not. Best look elsewhere outerlander.",
    "No... sorry, I don't.",
    "Well, I don't usually have many shoes in stock here in my little clothes shop... I will be able to make you up a pair if you are really desperate though?",
    "Oh, that foolish bard... Why didn't he just ask me to make him some? It is his stupid pride, I believe! I will tell you what I will do outerlander; I know that you must have the ear of the chieftain for him to consider you as worthy of becoming a Fremennik by trial. I will make you a pair of sturdy boots for Olaf if you will persuade him to reduce the sales tax placed upon all Fremennik shopkeepers. It does nothing but hurt my business now.",
    "Yes I do outerlander. Only the Chieftain may permit such a thing. Talk to him.",
    "Certainly! Let me have a look at what he has written here, just give me a moment...",
    "Yes, that all appears in order. Tell Olaf to come to me next time for shoes!",
    "Not me, I'm afraid.",
    "Maybe if you pass your trial and become a full fledged member of the Fremennik..."
  ],
  "Agnar": [
    "Could be. Who wants to know?",
    "Well, yes I am. Why do you want to find a council member?",
    "Ah, I see. And you require a majority vote at the council of elders before you will be accepted into the clan, correct?",
    "I don't like outerlanders. The only way you will get my vote allowing you into the clan is...",
    "If you can pay me... One hundred thousand, million, billion, nine hundred thousand, and forty seven hundred and ninety three gold coins.",
    "I guess you don't get my vote then, do you, outerlander?"
  ],
  "Fisherman": [
    "Indeed I am, outerlander. Why do you ask?",
    "Aye, that is indeed true.",
    "You can have my vote on the day the skies turn red, the waters turn pink, the rocks turn yellow and the sun turns black.",
    "I'm telling you that I will never vote for you, you stupid outerlander.",
    "I never saw anything like that in my store before.",
    "Ah, so even outerlanders have heard of my amazing catch the other day!",
    "As exotic looking as it is, it is bad eating. I will happily trade it if you can find me the secret map of the best fishing spots that the navigator has hidden away.",
    "Indeed it is, outerlander. The only reason I sit out here in the cold all day long is so I don't have to pay his outrageous prices. By getting me his copy of that map, I will finally be self sufficient. I might even make a profit!",
    "You should pay attention when I speak! I already told you, that rip off navigator has it, and I want it!",
    "Great work outerlander! With this, I can finally catch enough fish to make an honest living from it! Here, have the stupid fish.",
    "I don't think so.",
    "Me neither, outerlander. That is why I gave it to you."
  ],
  "Inga": [
    "I'm a council member.",
    "No. Frankly, I don't like you.",
    "You also smell bad. And have stupid hair. And bad breath. And you walk a bit funny.",
    "No, I'm quite sure you could have found plenty of people to insult you wherever your home is.",
    "Tch, typical outerlander rudeness. I'm glad I didn't vote for you now."
  ],
  "Pontak": [
    "Well, I am one. Why are you looking for council members, then? Trying to become a Fremennik, outerlander?",
    "Hmph. You outerlanders are so arrogant. I suppose you think you can butter me up into voting for you by doing some silly little trial or something?",
    "Well I have a trial for you then. I'll vote for you if you can bring me all of the following items; The[sic] Mage Gower's skull, a sleeping bag, Saradomin's wig, Zamorak's teddy bear, Guthix's climbing boots, cheese from the moon, a dodo egg and a left-handed chisel.",
    "Not so arrogant now, are you outerlander? Let me clarify: you will NEVER get my vote at the council. I hate all outerlanders, ESPECIALLY you."
  ],
  "Sassilik": [
    "I know that I am one.",
    "Sure. On one condition.",
    "Actually there is no condition! I don't want to vote for you! You seem too gullible to be a Fremennik!",
    "What do I care? I am a Fremennik and you are just some stupid outerlander! You stupid outerlander!"
  ],
  "Manni the Reveller": [
    "Hello outerlander. I overheard your conversation with Brundt just now. You wish to become a member of the Fremennik?",
    "Do not let my drink-soused appearance fool you, I earnt my place on the council many years past. I am always glad to see new blood enter our tribe, and will happily vote for you.",
    "...Providing you can pass a little test for me. As a Fremennik, you will need to show cunning, stamina, fortitude, and an iron constitution. I know of only one way to test all of these.",
    "Why, a drinking contest! The task is simple enough! You versus me, a stiff drink each, last man standing wins the trial. So what say you?",
    "When you are ready to begin, go and pick up a keg from that table over there, and come back here. We start when you have your keg of beer with you, and finish when one of us can drink no more and yields.",
    "Well, perhaps it's not, but it's my way. If you want my vote at the council, I'm afraid you're going to have to drink me under the table.",
    "As you wish, outerlander.",
    "Beat me in a drinking contest! Grab a keg of beer from that table near the bar, and come back here with it.",
    "Ah, I see you have your keg of beer. Are we ready to drink against each other?",
    "As you wish outerlander; I will drink first, then you will drink.",
    "I guessh I win then ouddaladder! (hic) Niche try, anyway!",
    "Come back if'n you fanshy a rematch! (hic) Jusht let me have a coffee firsht...",
    "Want to line your stomach with some food or something, huh outerlander? Come back to me when you're ready to drink.",
    "Thinking of cheating my test, outerlander? I don't think so! You drink that keg fairly, or not at all! Don't let me catch you cheating!",
    "Ah, I see you have your keg of beer. Are we ready to drink against each other?",
    "As you wish outerlander; I will drink first, then you will drink.",
    "Wassha? Guh? You drank that whole keg! But it dinna affect you at all! I conshede! You can probably outdrink me!",
    "I jusht can't (hic) believe it! Thatsh shome mighty fine drinking legs you got! Anyone who can drink like THAT getsh my vote atta consh.. counsh... gets my vote!",
    "Absholutely! (hic) You're one mighty drinker!",
    "I have not the first idea about that.",
    "I'd try at the fish stalls if I were you.",
    "Did you even ask the seer?",
    "Thorvald is pretty handy with a sword...",
    "Uh... call it a crazy hunch, but did you even try asking Askeladden about that?",
    "As a matter of fact, I do. I have one right here. I earnt my place here at the longhall for surviving over 5000 battles and raiding parties. Due to my contribution to the tribe, I am now permitted to spend my days here in the longhall listening to the epic tales of the bard, and drinking beer.",
    "I think it sounds better than it actually is outerlander. I miss my glory days of combat on the battlefield. And to tell you the truth, the beer here isn't great, and the bards' music is lousy. I would happily give up my token if it were not for the one thing that keeps me here. Our barkeep is one of the best in the world, and has worked in taverns across the land. When she was younger, she experimented a lot with her drinks, and invented a cocktail so alcoholic and tasty that it has become something of a legend to all who enjoy a drink. Unfortunately, she decided that cocktails were not a suitable drink for Fremennik warriors, and vowed to never again make it. I have been here every day since she returned, hoping that someday she might change her mind and I might try this legendary cocktail for myself. Alas, it has never come to pass... If you can persuade her to make me her legendary cocktail, I will be happy to never let another drop of alcohol pass my lips, and will give you my champions token.",
    "That's all.",
    "Uh... yes, the longhall barkeep has it. So could you get me my drink now please?",
    "...It is true! The legendary cocktail! I have waited for this day ever since I first started drinking!",
    "Here outerlander, you may take my token. I will happily give up my place at the longhalls table of champions just for a taste of this exquisite beverage!",
    "No, it is an artform. A drink such as this should be appreciated, and admired. It is like a fine painting, or a tasteful sculpture. If what I hear is true, then all other drinks become like unpalatable water in comparison to this!",
    "Not me, no.",
    "Ah, but it was not just any drink... It was the finest cocktail ever created! Now that I have tasted it, I need never drink again, for my tastebuds will never be so excited!",
    "It was... exquisite!",
    "Mostly tomato juice."
  ],
  "Council workman": [
    "Aye, that I did. 'Twas real thirsty work too. If only some kind stranger would buy us a bit of beer to sup, eh? What with that inn at Seers' Village so close by and all, eh?",
    "Just make sure yer don't get me none of that non alcoholic rubbish from that poison salesman guy at the tavern!",
    "Ta very much, like. That'll hit the spot nicely. Here, you can have this. I picked it up as a souvenir on me last hols.",
    "I dunno rightly, but if you use a tinderbox on it, it don't half make a loud noise!"
  ],
  "Poison Salesman": [
    "Howdy! You seem like someone with discerning taste! Howsabout you try my brand new range of alcohol?",
    "That I did, indeed! Peter Potter's Patented Multipurpose poison! A miracle of modern apothecarys! My exclusive concoction has been tested on...",
    "Sorry stranger, old habits die hard I guess.",
    "Well, I would, but I ran out of stock. Business wasn't helped with that stuff that happened up at the Sinclair Mansion much either, I'll be honest. So, being the man of enterprise that I am I decided to branch out a little bit!",
    "Absolutely! The basic premise between alcohol and poison is pretty much the same, after all! The difference is that my alcohol has a unique property others do not!",
    "Ever been too drunk to find your own home? Ever wished that you could party away all night long, and still wake up fresh as a daisy the next morning? Thanks to the miracles of modern magic we have come up with just the solution you need! Peter Potter's Patented Party Potions! It looks just like beer! It tastes just like beer! It smells just like beer! But... it's not beer! Our mages have mused for many moments to bring you this miracle of modern magic! It has all the great tastes you'd expect, but contains absolutely no alcohol! That's right! You can drink Peter Potters Patented Party Potion as much as you want, and suffer absolutely no ill effects whatsoever! The clean fresh taste you know you can trust, from the people who brought you; Peter Potters Patented multipurpose poison, Peter Potters peculiar paint packs and Peter Potters paralysing panic pins. Available now from all good stockists! Ask your local bartender now, and experience the taste revolution of the century!",
    "Yes?",
    "Well... nobody has actually bought any yet. Everyone I try and sell it to always asks me what exactly the point of beer that has absolutely no effect on you is.",
    "Well... Um... Er... Hmmm. You, er, don't get drunk.",
    "Aw man... You don't want any now do you? I've really tried to push this product, but I just don't think the world is ready for beer that doesn't get you drunk. I'm a man ahead of my time I tell you! It's not that my products are bad, it's that they're too good for the market!",
    "Y-you would??? Um, okay! I knew I still had the old salesmans skills going on! I'll sell you a keg of it for only 250 gold pieces! So what do you say?",
    "That I do, and sales are rocketing upwards as word of mouth spreads of it's clean taste and cool flavour! So... you want to buy some?"
  ],
  "(Everyone in the longhall)": [
    "What was THAT?"
  ],
  "Olaf the Bard": [
    "Hello? Yes? You want something, outerlander?",
    "Why, indeed I am, outerlander! My talents as an exemplary musician made it difficult for them not to accept me! Why do you wish to know this?",
    "Ahhh... and you wish to earn my vote? I will gladly accept you as a Fremennik should you be able to prove yourself to have a little musical ability!",
    "Why, by playing in our long hall! All you need to do is impress the revellers there with a few verses of an epic of your own creation! What say you, outerlander? Are you up for the challenge?",
    "That is great news outerlander! We always need more music lovers here!",
    "Well, first of all you are going to need an instrument. Like all true bards you are going to have to make this yourself.",
    "Well, it is a long and drawn-out process. Just east of this village there is an unusually musical tree that can be used to make very high quality instruments. Cut a piece from it, and then carve it into a special shape that will allow you to string it. Using a knife as you would craft any other wooden object would be best for this.",
    "Next you will need to string your lyre. There is a troll to the South-east who has some golden wool. I would not recommend using anything else to string your lyre with.",
    "Well, when you have crafted your lyre you will need the blessing of the Fossegrimen to tune your lyre to perfection before you even consider a public performance.",
    "Fossegrimen is a lake spirit that lives just a little way South-west of this village. Make her an offering of fish, and you will then be ready for your performance. Make sure you give her a suitable offering however. If the offering is found to be unworthy, then you may find yourself unable to play your lyre with any skill at all!",
    "A raw shark, manta ray, or sea turtle should be sufficient as an offering.",
    "When you have crafted your lyre and been blessed by the Fossegrimen, then you will finally be ready to make your performance to the revellers at the long hall. Head past the bouncers and onto the stage, then begin to play. If all goes well, you should find the music spring to your mind and sing your own epic on the spot. I will observe both you and the audience and, if you show enough talent, I will happily vote in your favour at the council of elders. Is that clear enough, outerlander? Would you like me to repeat anything?",
    "There are three parts to making the lyre; First you need to cut some special wood from the special musical tree which can be found just east of Rellekka. When you have the wood, you will need to use a knife to craft it into a Lyre. When you have an unstrung lyre, you will need to string it before you can play it. I would not use anything other than the golden string of Lalli, a troll who lives in a cave just to the South-east. Is that clear enough, outerlander? Would you like me to repeat anything?",
    "Certainly outerlander! Fossegrimen is a lake spirit who lives in the lake just to the South-west of here. She will bless you so that you may play your lyre, if you give her a worthy offering. She will only accept raw fish, so place a raw fish on her pedestal, and she will bless you. The better the offering, the longer the amount of time you will be blessed for. You will not be able to perform on stage without the blessing of the Fossegrimen. Is that clear enough, outerlander? Would you like me to repeat anything?",
    "Not a problem, outerlander. When you have your lyre and have been blessed, you will be able to pass the bouncer at the stage entrance of the long hall. He will not let you pass unless he believes you are ready to perform on stage. Simply go past him and onto the stage and use your lyre, and you will begin to play to entertain the revellers. If all has gone well, you will feel the music come to your mind, unbidden, as you sing an epic of your exploits. I will watch your performance from backstage, and also study how much the crowd likes you. If I believe you have enough talent, then I will vote for you at the council. Is that clear enough, outerlander? Would you like me to repeat anything?",
    "Wow! That was awesome! You are one of the greatest bards I have ever had the pleasure of watching performing! You have certainly earned my vote! I hope we can duet together soon!",
    "You have a truly poetic soul! Anyone who can compose such a beautiful epic, and then perform it so flawlessly can only bring good to our clan!",
    "Absolutely! We must collaborate together on a duet sometime, don't you think?",
    "I'm sorry, no I don't.",
    "Well, as official Fremennik bard, it falls within my remit to compose all music for the tribe. I am fully versed in all the various types of romantic music.",
    "Well... normally I would be thrilled at the chance to show my skill as a poet in composing a seductively romantic ballad...",
    "...but unfortunately I cannot concentrate fully upon my work recently.",
    "It is these old worn out shoes of mine... As a bard I am expected to wander the lands, singing of the glorious battles of our warriors. If you can find me a pair of sturdy boots to replace these old worn out ones of mine, I will be happy to spend the time on composing you a romantic ballad.",
    "That depends outerlander... Do you have some new boots for me? My feet get so tired roaming the land...",
    "Oh! Superb! Those are great! They're just what I was looking for! Here, take this song with my compliments! It is one of my finest works yet!",
    "Only if it's a pair of new boots.",
    "Ahhh.... outerlander... it is the most beautiful romantic ballad I have ever been inspired to write... Only a woman with a heart of icy stone could fail be to be moved by its beauty!"
  ],
  "Lalli": [
    "Bah! Puny humans always try steal Lallis'[sic] golden apples! You go away now!",
    "Ha! You not fool me human! Me am smart! Other trolls so jealous of how brainy I are, they kick me out of camp and make me live down here in cave! But me have last funny! Me find golden apples on tree and me build wall to stop anyone who not Lalli eating lovely golden apples! Did me not tell you I are smart?",
    "Hum, me think you not really think I are clever. Me think you is trying trick Lalli. Me not like you as much as other human. He give me present. I give him wool.",
    "Human call itself Askeladden! It not trick Lalli, Lalli do good deal with human! Stupid human get some dumb wool, but did not get golden apples!",
    "Grrr! Why you insult me stupid human? Me know it are because you jealous of Lalli's huge brain and you try steal apples!",
    "Ha! You stupid human! You think you trick Lalli? Me know you want my golden apples Well! You not get them! HAHAHA!",
    "Bah! Puny humans always try steal Lallis' golden apples! You go away now! Unless you got tasty food for Lalli. Then I might trade you for it.",
    "What? Me am not stupid human! Everyone know cannot make food from stone!",
    "Why you need other stuff too then?",
    "Me have to try this! Me will swap you your wool if you not trick me and really can make soup out of a stone.",
    "It am ready now?",
    "It am ready now?",
    "Hmm... YUM! That are delicious! Me never know human know to make soup out of stone? It some special stone?",
    "Let me think about that, me like to think.",
    "Your soup very tasty, human! But me still not want trade golden apples for your stone. Me think pet rock get jealous.",
    "Gee, sorry human, all you have do is ask, me not need you to shout. You act like you think Lalli am stupid or something...",
    "Here you go. Hah! Me trick you human! All you got is worthless golden fleece! Me got very special soup-making stone!"
  ],
  "Fossegrimen": [
    "Many thanks for the offering outerlander. Please accept this gift as your ability to play the lyre..."
  ],
  "Longhall Bouncer": [
    "You have an instrument now, huh? Go on through the door.",
    "Yeah, you're good to go through. Olaf tells me you're some kind of outerlander bard here on tour. I doubt you're worse than Olaf is."
  ],
  "[Fridgeir/Ospak/Styrmir/Torbrund]": [
    "Hey, I've done that quest too!",
    "I have produced better sounds in the outhouse!",
    "I thought somebody was murdering a cat!",
    "Is your singing some kind of outerlander weapon?",
    "looting and drinking part?",
    "Never before have mine ears been so offended!",
    "My grandmother could do better, and she is dead!",
    "Please tell me that was the last verse...",
    "Please, ye gods! Make it stop!",
    "Thats[sic] kind of catchy. Irritating. But catchy.",
    "The screams of my dying comrades sound better!",
    "Truly, this is the worst sound I have ever heard!",
    "What kind of bard are you anyway?",
    "When do you get to the good parts?",
    "would torture us so, outerlander?",
    "YOU ARE A TERRIBLE BARD!",
    "You call THAT singing?",
    "You know, I actually quite liked that verse...",
    "Your song makes no sense outerlander!"
  ],
  "Sigmund the Merchant": [
    "Hello outerlander.",
    "That I am outerlander; it is a position that brings my family and I pride.",
    "You wish to become a Fremennik? I may be persuaded to swing my vote to your favour, but you will first need to do a little task for me.",
    "Calm yourself outerlander. It is but a small task really... I simply require a flower.",
    "The catch? Well, it is not just any flower. Someone in this town has an extremely unique flower from a far off land that they picked up on their travels. I would like you to demonstrate your merchanting skills to me by persuading them to part with it, and then give it to me for my vote.",
    "Excellent! You will obtain this flower for me, then?",
    "Ah, well outerlander, if I knew where to start looking I would simply do it myself!",
    "We are a very insular clan, so I would not expect you to have to leave this town to find whatever you need.",
    "As you wish outerlander. If you change your mind, come and see me again; I am very interested in getting my hands on that flower.",
    "So... how goes it outerlander? Did you manage to obtain my flower for me yet? Or do you lack the necessary merchanting skills?",
    "I suggest you ask around the other Fremennik in the town. A good merchant will find exactly what their customer needs somewhere.",
    "So... how goes it outerlander? Did you manage to obtain my flower for me yet? Or do you lack the necessary merchanting skills?",
    "I suggest you ask around the other Fremennik in the town. A good merchant will find exactly what their customer needs somewhere.",
    "Hmmm... well try and start again at the beginning. And try to be more careful of your wares in future.",
    "Incredible! Your merchanting skills might even match my own! I have no choice but to recommend you to the council of elders!",
    "Hello again outerlander! I am amazed once more at your apparent skill at merchanting!",
    "Absolutely, outerlander. Your merchanting skills will be a real boon to the Fremennik."
  ],
  "Peer the Seer": [
    "I'm afraid not, outerlander.",
    "Er.... Yes, because I AM the Fremennik Seer.",
    "You require a divination of the weather? This is a simple matter for me, but I will require something in return from you for this small service.",
    "Do not fret, outerlander; it is a fairly simple matter. I require a bodyguard for protection. Find someone willing to offer me this service.",
    "That is all.",
    "If I did, then I would simply have asked them myself now, wouldn't I, outerlander?",
    "I have already told you outerlander; You[sic] may have a reading from me when I have a signed contract from a warrior guaranteeing my protection.",
    "You have not only persuaded one of the Fremennik to act as a servant to me, but you have enlisted the aid of mighty Thorvald himself??? You may take this forecast with my blessing outerlander. You have offered me the greatest security I can imagine.",
    "Not me, I'm afraid.",
    "Yes, outerlander?",
    "That is not true, outerlander. Although I see glimpses of the future all of the time, using my powers brings the attention of the gods to me. Some of the gods are spiteful and cruel, and I fear if I use my powers too much then I will meet with unpredictable accidents. This is why I needed protection.",
    "Uuuh... What was that dark presence I felt?",
    "Ahem, sorry about that. Hello outerlander. What do you want?",
    "Are you now? Well that is interesting. Usually outerlanders do not concern themselves with our ways like that. I am one of the members of the council of elders, and should you be able to prove to me that you have something to offer my clan I will vote in your favour at the next meeting.",
    "Well, I have but a simple test. This building behind me is my house. Inside I have constructed a puzzle. As a Seer to the clan, I value intelligence very highly, so you may think of it as an intelligence test of sorts.",
    "That is the opinion that outerlanders usually hold of my people, it is true. But that is because people often confuse knowledge with wisdom. My puzzle tests not what you know, but what you can work out. All members of our clan have been tested when they took their trials.",
    "Well, firstly you must enter my house with no items, weapons or armour. Then it is a simple matter of entering through one door and leaving by the other.",
    "That is correct outerlander. Everything you need to complete the puzzle you will find inside the building. Nothing more. So what say you outerlander? You think you have the wit to earn yourself my vote?",
    "Yes, outerlander?",
    "Yes, outerlander?",
    "Yes, outerlander?",
    "Ah, I see your problem outerlander. The nearest bank to here is the place known to outerlanders as the Seers Village. It is some way South. I do however have an alternative, should you wish to take it.",
    "I can store all the weapons, armour and items that you have upon you directly into your bank account. This will tax what little magic I possess however, so you will have to travel to the bank to withdraw them again. What say you outerlander? Do you wish me to do this for you?",
    "I am sorry outerlander, the spell is not working. I believe you may have some objects that you cannot bank with you.",
    "The task is done. I wish you luck with your test, outerlander.",
    "As you wish, outerlander. You may attempt my little task when you have deposited your equipment in the bank.",
    "As you wish, outerlander.",
    "Uuuh... What was that dark presence I felt?",
    "Ahem, sorry about that. Hello outerlander. What do you want?",
    "That is correct outerlander, but as I say, I can use my small skill in magic to send your items directly into your bank account from here. You will need to manually go to the bank to withdraw them again however. Would you like me to perform this small spell upon you, outerlander?",
    "Uuuh... What was that dark presence I felt?",
    "Ahem, sorry about that. Hello outerlander. What do you want?",
    "Incredible! To have solved my puzzle so quickly! I have no choice but to vote in your favour!",
    "Uuuh... What was that dark presence I felt?",
    "Ahem, sorry about that.",
    "Absolutely, outerlander. Your wisdom in passing my test marks you as worthy in my eyes."
  ],
  "Sigli the Huntsman": [
    "Greetings outerlander.",
    "Did you even ASK the Seer?",
    "Did you even ASK the barkeep?",
    "Did you even ASK Askeladden?",
    "No idea at all outerlander.",
    "Greetings outerlander.",
    "Well, of course I do. I wouldn't be much of a huntsman if I didn't know where to find my prey now, would I outerlander?",
    "Directions to my hunting grounds could mean the end of my livelihood. The only way I would be prepared to give them up would be...",
    "...a new string for my hunting bow. Not just any bowstring; I need a custom bowstring, balanced for my bow precisely to keep my hunt competitive. Only in this way would I allow the knowledge of my hunting grounds to be passed on to strangers.",
    "I have no idea. But then again, I'm happy with my old bowstring and being the only person who knows where my hunting ground is.",
    "Greetings outerlander.",
    "If I knew I would not have asked you to go and get me one, now would I?",
    "Greetings outerlander.",
    "Well met, outerlander. I see some hunting potential within you. Here, take my map, I was getting too dependent on it for my skill anyway.",
    "Not the one I want, outerlander.",
    "No outerlander... it is hard to explain. That map makes my role as huntsman too easy. I fear my skills are becoming dulled. Now I must track my prey once more. To begin again from scratch... I feel this may keep me sharp.",
    "What do you want outerlander?",
    "The Fremennik council of elders? I am pleased to say that I am. My value as a huntsman is recognised by my position there.",
    "You? ... well... I am not totally against the idea outerlander. If you can demonstrate some hunting skills then perhaps I may offer my vote.",
    "Chickens? You think that would impress me?",
    "No. The prey I have in mind for you to prove your worth to me is something far more dangerous. Far more difficult. Far more deadly.",
    "I suspect you are mocking me outerlander. You will need to prove your skill as a hunter to me by tracking and defeating... The Draugen.",
    "Hmmm. No, the words are slightly similar I suppose, but they are very different creatures. The Draugen is an evil ghost from Fremennik mythology, that devours the souls of those brave warriors who meet their ends at sea. It stalks the coastlines, invisible to all. It brings us bad fortunes, and curses our journeys across the seas. It is also unkillable by normal means.",
    "Well outerlander, should you accept my challenge I will show you a special hunter's trick that will help you. Do you accept the challenge?",
    "Not at all outerlander. The Draugen is indeed impossible to kill, but that is not the same as being impossible to fight against. Every time he takes a Fremennik life, he gains in power, so to keep it from becoming too powerful we hunters hunt it and steal its life force.",
    "We do this with a special talisman. Here, take it; it will let you track the Draugen while it's invisible, and when you defeat it will absorb its essence. I want you to track the Draugen, defeat it, and store its essence in that talisman for me. If you can do this important task for my clan, I will vote for you. Take care of the talisman, and see me when you have completed this task.",
    "Hello again outerlander. Have you managed to hunt down the terrible Draugen yet?",
    "Hmmm. Laziness is not a trait that I admire. I suggest you go and do so if you wish me to vouchsafe for you to our council of elders.",
    "Hello again outerlander. Have you managed to hunt down the terrible Draugen yet?",
    "The typical careless regard for valuable objects I would expect from an outerlander such as yourself. Do not lose THIS one.",
    "An amateurish mistake, outerlander. Any hunt without the proof of it is naught but empty boasting. Take this and try once more.",
    "I saw the entire hunt. Let me take that talisman from you; I would be honoured to speak out for you to our council of elders after such a hunt, outerlander."
  ],
  "Swensen the Navigator": [
    "Greetings outerlander.",
    "Um... from the longhalls'[sic] barkeep?",
    "Er... from Askeladden, maybe?",
    "I am afraid not outerlander.",
    "Greetings outerlander.",
    "Hmmm? Why of course! As the navigator for the Fremennik I keep all of our maps secure right here.",
    "Have it? Just like that? I think not outerlander. This map shows all of the prime fishing locations nearby. It is very valuable to our clan. I am afraid I can not just give it away.",
    "A trade? For a map of the best fishing spots in a hundred leagues? I will trade it for no less than a weather forecast from our Seer. As a navigator, the weather is extremely important for plotting the best course. Unfortunately the Seer is always too busy to help me with a forecast.",
    "I just told you: from the Seer. You will need to persuade him to take the time to make a forecast somehow.",
    "Greetings outerlander.",
    "Uh... from the Seer perhaps?",
    "I have already told you outerlander; I will not exchange it for anything other than a divination on the weather from our seer himself!",
    "W-what...? I don't believe it! How did you...? I suppose it doesn't matter, you have my gratitude outerlander! With this forecast I will be able to plan a safe course for our next raiding expedition!",
    "Here, outerlander; you may take my map of local fishing patterns with my gratitude!",
    "It isn't for me, I'm afraid.",
    "Hmmm? Well, firstly it will be of value to our entire clan, so I have lost nothing from giving it to you. The other reason is of course that I have already memorised it, so I can make myself another copy whenever I want!",
    "You wish to stop being an outerlander? I can understand that! I have no reason why I would prevent you becoming a Fremennik... ...but you must first pass a little test for me to prove you are worthy.",
    "Well, I serve our clan as a navigator. The seas can be a fearful place when you know not where you are heading. Should something happen to me, all members of our tribe have some basic sense of direction so that they may always return safely home. If you are able to demonstrate to me that you too have a good sense of direction then I will recommend you to the rest of the council of elders immediately.",
    "Ah, a simple task! Below this building I have constructed a maze; should you be able to walk from one side to the other that will be proof to me. You wish to try my challenge?",
    "I will warn you outerlander, this maze was designed by myself, and is of the most fiendish complexity!",
    "Well, I am sorry you feel that way outerlander. I cannot vouch for you until you prove to me you have some skill that will benefit our clan somehow. What exactly is a 'lab rat' anyway?",
    "Have you no manners outerlander? This is my home, you will show me the due respect!",
    "Hahahaha it is the most complex route I have ever devised! I am truly a genius at navigation! The world will remember my name!",
    "No, you cannot. It is my maze, or nothing.",
    "Decided you could not solve my labyrinth after all, did you outerlander? Too tricky for you?",
    "Hahaha! Don't worry outerlander, you are not the first to fail it's[sic] puzzle!",
    "Outerlander! You have finished my maze! I am genuinely impressed!",
    "Of course outerlander! I am nothing if not a man of my word!",
    "Greetings again outerlander! I must say, I am still impressed with the way you moved through my maze!",
    "Absolutely! You will be an asset to the clan!"
  ],
  "Thorvald the Warrior": [
    "Not in the slightest.",
    "Know you not who I am outerlander? There are none more brave or powerful than me amongst all the Fremennik! However... The role of bodyguard is below me, as a noble warrior. You might as well ask me to babysit the children!",
    "There is but one way outerlander. Since I was steeled in battle, I have dreamt of earning my place at the Champions Table in the Long Hall. It is a tradition amongst us that the bravest and strongest are honoured with a table of champions to drink and feast all that they can in our Long Hall. Unfortunately, there are only a fixed number of places available at the table, and these places were all filled many moons ago by others. Although my worthiness is undeniable, the only way I may take my place is if one of those already there die, or give up their place to me voluntarily.",
    "WHAT? No, no, not at all! I am shocked you would suggest such a thing! If you can persuade one of the Revellers to give up their Champions' Token to you so that I might take their place, you may have my contract as a bodyguard.",
    "You will need to persuade one of the revellers in the Long Hall to give up their token, and their place, in deference to my own worthiness somehow.",
    "Oh you would, would you outerlander? I have already told you, I will not demean myself with such a baby sitting job until I can sit in the Longhall with pride.",
    "Ah... well this is a different matter. With that token I can claim my rightful place as a champion in the Long hall! Here outerlander, I can suffer the indignity of playing babysitter if it means that I can then revel with my warrior equals in the Long Hall afterwards!",
    "Here outerlander, take this contract; I will fulfill it to my utmost.",
    "I'm afraid not, outerlander.",
    "You misunderstand, outerlander. Normally I will only battle for a noble cause, but have never been recognised as a true champion here. With this Champion's token, I can stand alongside my warrior brethren in the Long Hall, and revel in the glories of past victories together!",
    "Hello yourself, outerlander. What brings you to dare speak to a mighty Fremennik warrior such as myself?",
    "The Fremennik council of elders? Why, of course I am. I am recognised as one the clans mightiest warriors. What is it to you outerlander?",
    "An outerlander wishes to become a Fremennik!?!? Ha! That is priceless! Well, let us say that I am not totally against this concept. As a warrior, I appreciate the value of brave and powerful warriors to our clan, and even though you may be an outerlander, I will not hold this against you if you can prove yourself to be fierce of heart in a combat situation to me.",
    "Hahahahaha! You certainly show some spirit for an outerlander! But spirit does not always make a good warrior. It takes both skill and spirit to be so. I have a test that I give all Fremenniks on their path to be a member of the clan. My test will challenge both your combat prowess and your bravery equally. Should you pass it you will earn my vote at the council, and more importantly my respect for you as a warrior. So what say you, outerlander? Are you prepared for the battle?",
    "Hahahahaha! I'm beginning to like you already, outerlander! Then allow me to present you with my challenge; This[sic] ladder here will take you to a place of combat. I have placed a special warrior down there to challenge you. Battle him to the death, and you will pass my challenge. If at any point you wish to leave combat, simply climb back up the ladder, to leave that place. If you leave you will of course fail the test. You may retry my test in the future if you fail, but you must stay down there until the death if you wish for my vote at the council. You must defeat him three times to prove that you are worthy. The fourth time that you fight him will be to the death, so do not show cowardice.",
    "No, there is one more important rule;[sic] You may not enter the battleground with any armour or weaponry of any kind. If you need to place your equipment into your bank account, I recommend that you speak to the se knows a spell that will do that for you.",
    "Hmm, not so brave after all, outerlander? Perhaps it is for the best. I doubt you have what it takes to pass my challenge.",
    "I will not offer my vote to anybody whose bravery in combat I do not trust completely. You must go down that ladder and fight your foe to the death.",
    "Ah, a wise question before entering combat. His name is Koschei the deathless. He is something of a mystery, even to us. On one of our regular raiding parties, our longship discovered a man in the frozen waters far north-east of here. We took him aboard our ship, thinking he must be dead. To our amazement he was perfectly healthy, even though he must have been in those deadly icey[sic] waters for many weeks.",
    "He has no memory of who he is, or how he came to be there, except for his own name: Koschei. We named him 'The Deathless' because he is seemingly unkillable! Any combat technique used against him, he learns instantly! He also apparently can heal himself from any wound at will! When he attacks, his weapon moves like a whirlwind! He can hide his combat level from his opponents at will as well! He is truly a horribly fierce opponent to face! I am only glad that he has chosen to stay here with us! The daylight makes him feel weak, so we have built him his own battleground beneath this building, where he can train his fiercesome skills without being disturbed.",
    "Some say he cannot die, for he has hidden his heart outside of his body to be kept forever safe in a duck egg. Others say he has been cursed by the gods to wander this land forever, never knowing any peace in his life, but only combat. Some claim that the sword he carries is the source of all his power, and if he should lose it, then exactly one minute later, he will turn back into his true form; A[sic] weakened, lame, old man.",
    "I believe you shouldn't look a gift horse in the mouth. He is a fearfully powerful warrior, but more importantly; He[sic] is on OUR side, not against us. He is content testing the battle skills of anyone taking their Fremennik trials of manhood, and I am content knowing that should an enemy ever invade our town, while our warriors are out on a raiding party, Koschei will be able to hold off ANY invader long enough for us to make our return.",
    "Yes of course outerlander! If you bring me five raw sardines then I will vote for you instead!",
    "HAHAHAHAHAHA! No, of course not! You are stupid, even by outerlander standards! If you want my vote, you must pass my trial. It is as simple as that.",
    "Absolutely! I watched the entire battle, and was extremely impressed with your bravery in combat!",
    "Hahaha! Well fought outerlander! Now come down from there, you have passed my trial with flying colours!",
    "I did not say you had to, outerlander! All I asked was that you fought to the death! And you did! The death was your own! I was not interested in how strong you are! I was interested in how BRAVE you are! You fought a superior enemy to your very last breath – THAT is bravery. I would be honoured to represent you to the council as worthy of being a Fremennik after watching that superb battle!"
  ],
  "Olaf the bard": [
    "I'm sorry outerlander... If I did, I would not trouble you to go and find them for me, would I?"
  ],
  "Peer the seer": [
    "That is correct outerlander. Be warned it is not as easy as it may at first sound..."
  ],
  "Koschei the deathless": [
    "Today is the day you die, outerlander!",
    "It seems you have some idea of combat after all. Outerlander! I will not hold back so much this time! I will crush your dead bones!",
    "Impressive start... But now we fight for real! Prepare for my power, outerlander!",
    "You show some skill at combat... I will hold back no longer!"
  ],
  "Congratulations! You have completed": [
    "'The Fremennik Trials'."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:The_Fremennik_Trials?oldid=35508757’"
  ]
}