{
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "Lots of miscellanous dialogue missingYou can discuss this issue on the talk page or edit this page to improve it."
  ],
  "Commander Veldaban": [
    "Player! Have you heard?",
    "No, not that. It's the Red Axe!",
    "They've left the city! They were already boycotting the trade floor, but now they've completely left the city.",
    "It's never happened before! At the moment, it's unclear yet if they've left the Consortium as well. The directors are in turmoil!",
    "Well... I may require your services again. Are you interested in hearing more?",
    "We need some more information about what the Red Axe is up to.",
    "The other directors of the Consortium don't think so and are likely to expel the Red Axe completely anyway.",
    "That's the problem. We don't know where they moved their headquarters to. But we may have one lead...",
    "There is a dwarf, all the way to the northeast in Keldagrim-East. He talks about kebabs a lot. Don't suppose you've met him?",
    "That's him, poor fellow. He didn't always used to be like that.",
    "But he seems to know something about the Red Axe for some odd reason. He speaks of them sometimes in one of his many rants.",
    "Problem is, no one believes him. Everyone thinks he's completely mad. And perhaps they're right.",
    "But if he indeed knows something about the Red Axe or where their headquarters may be, we need to find out.",
    "What do you say, Player? Do you want to help the Black Guard with this?",
    "Excellent, good luck to you in your quest! May Guthix protect you!",
    "And? What of the Red Axe?",
    "Happy to hear that!",
    "What is it, Player?",
    "Errr, are you alright? Don't you have any important information about the Red Axe?",
    "Poor Player, I think you've been bewitched.",
    "Player, I thought you had something important to tell me?"
  ],
  "Player": [
    "You mean, half the world has suddenly become a farmer?",
    "What have those grumpy little guys done now?",
    "Oh dear, is that serious?",
    "So what happens now?",
    "Some other time, perhaps.",
    "Very interested!",
    "Are you asking me to... spy on them? Isn't that treason?",
    "So where would you like me to go?",
    "Yes?",
    "Yes, I do believe I have. Smashed glasses, wrecked house? Poor personal hygiene standards? Brother or cousin to that other drunken dwarf?",
    "Sounds like just the job for me!",
    "Well, here I am... at the drunken dwarf's relative's residence, who is also drunken. I wonder what drunken tales he can tell me.",
    "I need to know about the Red Axe...",
    "What, what do you mean?",
    "You don't look very sober to me!",
    "Have you ever considered to stop drinking? It's bad for you.",
    "I need to know about the Red Axe...",
    "Yes, here you go.",
    "What's the REALLY good stuff then?",
    "Hey, er, I don't think that's good for you.",
    "What am I supposed to do with a seed?",
    "Where do I get the other seeds then?",
    "Right, I think what you're trying to say is... I need to find some other drunken dwarves, collect Kelda seeds from them until I have four, then grow them into hops so I can make Kelda stout.",
    "Maybe that's just because I don't drink as much as you.",
    "Hold on a second there, I need your help!",
    "No, I try not to get drunk, it's not good for you. But I do need help in brewing some beer.",
    "I need to brew Kelda stout, but I haven't got enough seeds to grow the hops.",
    "Do you know where I can find any seeds?",
    "But you're not going to just give it to me, are you?",
    "Alright then, what do you want for it?",
    "What?? Where am I going to get that?",
    "Do you have any Kelda seeds?",
    "I'm still looking for that.",
    "Do you have any Kelda seeds?",
    "Look, I've got it here!",
    "Now how about those seeds?",
    "Wow, really?",
    "I suppose you wouldn't ever have a proper job or do some decent hard work, no.",
    "Nothing...",
    "And to you! Say, you know a lot about beer, right?",
    "Do you know anything about Kelda stout?",
    "Yes, that's what I heard, so I'm going to brew it myself.",
    "Have you got any?",
    "I don't have anything suitable to toast with.",
    "Drinking is bad for you, but I'll make an exception this time.",
    "Cheers!",
    "Hello there. I'm looking for some Kelda hop seeds.",
    "Strangely enough I survived my ordeal.",
    "I'd rather not... Anyway, I'm looking for some Kelda hop seeds.",
    "It sounds ghastly to me. But I want to brew some to help out, errr, a friend of mine.",
    "Borrow?? How can I borrow a seed? I can hardly give it back once I've grown it.",
    "What if I offer you a drink?",
    "Er, well, I was going to offer you a dwarven stout, but I seem to have left it in my other pants.",
    "I just thought I'd save myself the trouble of waiting for you to ask me this time.",
    "It's not just you, it's everyone!",
    "That's not the point!",
    "Look! Dwarven stout, here! Now do you want it or not? I'm not asking you again!",
    "No wait, I want to borrow it after all.",
    "Of course, of course! After I've grown my Kelda seeds into hops, then harvested the hops and brewed my Kelda stout... sure, I'll give you back your seed!",
    "Only too happy to help!",
    "Err, yes?",
    "Oh, don't worry... like I said, it's not for myself, it's for a friend.",
    "I need some help.",
    "I have four Kelda seeds here, but need some advice on growing them.",
    "Thanks! Is there anything else I need to know?",
    "Thank you! Your advice is much appreciated!",
    "I need some help.",
    "I think I need some more help with this whole farming business.",
    "Do I have to wait here all this time then?",
    "You mean the mining companies? I did jobs for them, they're not very profitable.",
    "Do I have to do that? I just want to grow my hops and get on with my quest for Veldaban.",
    "Alright, I'll deliver that letter for you.",
    "I'll be right back!",
    "I need some help.",
    "No, I haven't been to Falador yet, but I will soon.",
    "No, sorry, I lost your letter.",
    "No, I've decided not to deliver it after all.",
    "Hello there. Are you Elstan?",
    "Well, I've got a letter here from your friend in Keldagrim.",
    "Of course.",
    "I need some help.",
    "I've delivered your letter to Elstan, he told me to give you his regards.",
    "This stout seems absolutely vile and disgusting. Besides, I'm supposed to bring it to my drunken, kebab obsessed friend.",
    "I need to know about the Red Axe...",
    "I've got some Kelda stout right here. I just brewed it in the Laughing Miner!",
    "Are you sure? This is pretty bad stuff.",
    "Here you go then.",
    "The what? The Magenta Accordion? That's not a mining company!",
    "Alright, if you say so...",
    "That was very interesting! I'll ignore that part with the pink dragons though...",
    "But I shall investigate that tunnel immediately! South of the cart station, just south of the carts to White Wolf mountain?",
    "Excuse me, can you tell me what's behind that boarded up tunnel to the south?",
    "I need to go through there. Can you open up the tunnel for me?",
    "Then who do I talk to? I really need to get in.",
    "Can you help me with a boarded up tunnel?",
    "I think it leads to something that might be related to the Red Axe.",
    "Can you help me get the boarding removed then?",
    "Thanks! I'll investigate the tunnel immediately!",
    "I'm deep underground now, but how am I supposed to get across here?",
    "I will have lots to tell you soon, Veldaban!",
    "Pesky human, huh? Well, I think I have enough info now. I'd better explore the rest of these mines.",
    "Looks like another chasm I need to cross.",
    "Statistical data, salary structures, shopping lists... no, I don't think there's anything interesting here.",
    "What the Guthix is this? Another chasm? And even more tracks!",
    "There's the Red Axe director again!",
    "Chaos dwarves!!!",
    "I must tell Veldaban!!!",
    "Nooooooo!",
    "Er, what? Where am I? Errrrr... I must tell Veldaban... something. Yes... ehm. I don't remember what though. Errr...",
    "Veldaban, I must tell you something incredibly important!",
    "I must tell you about... about...",
    "...about my incredible craving for a kebab. Mmm, kebabs. A kebab and a beer, that sounds great right now.",
    "Mmm, yes, I'll be perfectly alright... just after I've had my beer and a kebab. Yes. I'll have a beer and a kebab in the Laughing Miner. Yum!",
    "Watch out kebabs, I come for you!",
    "Yes... yes... Red... ehm. Red...",
    "Red Kebab? Red Ale?",
    "I will feast on kebabs and beer! Ahahaha!",
    "I knew it were you matey! 'Ere, have some of the good stuff!",
    "Right, these kebabsh, right? *hic* A whole g-g-group of kebabs came marching in! I'm telling you! Marching in line!",
    "And then, I'll tell you... Then! Ehm...",
    "Then I'll have another drink!"
  ],
  "Drunken Dwarf": [
    "THE RED AXE WILL COME FOR YOU!",
    "I don't know... I c-c-c-can't think straight when I'm *hic* sober.",
    "DON'T contradict me! Or I won't tell you about ehm... about the... whatever it is you wanted to know.",
    "I'll shtop, right after you get me shome of the good shtuff!",
    "Did you get me shome of the good stuff yet?",
    "What wash that? *hic* No no no, this ish noooooo good! I want some of the REALLY good stuff.",
    "Some of them original Kelda Stout! Ash blue ash the river! Ash strong ash ole Dondakan's rock. Ash foul tasting ash ash.",
    "I know, but get me shome of it anyway. 'ere, have a seed.",
    "You silly human! Silly shilly silly *hic* human. You need FOUR seeds, and grow them into hops.",
    "Hop hop hop! *hic*",
    "Some of me drinking buddies might have 'em. They're quite hard to find, you shee. Oh yesh, quite hard to find.",
    "Drinking buddies. Yes, find me some drinking buddies. No, find the other seeds. Yes.",
    "You're awfully smart for a human!",
    "I want my Kelda shtout!",
    "Now there'sh a good human, gimme that!",
    "You want to hear about the Red Kebabsh or what? I mean... the Red Axe.",
    "Ooooh, THAT'sh the good shtuff! The Red Axe? You want to know about them, do you? Then let me tell you my tale. It is long and quite unforgettable... A long time ago, quite a while ago, yes... I resigned from my mining company, the Magenta Accordion.",
    "It is, it is! It's one of the many minor companies, not part of the Consortium.",
    "Right, so I had just left my company. I'd had enough of slaving away in the mines and decided to become an explorer. Oh yes, like my cousin.",
    "I explored this old mine, you know, just south of Keldagrim. I think it's boarded up now. Some amazing things I saw there.",
    "First of all...",
    "...and then I nearly fell into the abyss! But I...",
    "...so I had to run for my life, but then...",
    "...pink dragons...",
    "...and I don't really remember anything after that. People think I'm a drunken fool.",
    "If you shay sho... I just want to smash up shome shtuff now.",
    "Very kind ob you, Player!"
  ],
  "Rowdy dwarf": [
    "Help, from me? You musht be more drunk than I am.",
    "Mmmm, beer.",
    "Mmmm, Kelda stout.",
    "I might... oh yesh, I jusht might have a sheed like that.",
    "No.",
    "Lemme think... oh yesh. Get me... [random item].",
    "You can at least make the effort.",
    "Where's my ehm... What wash it again? Oh yesh... [random item].",
    "Look a little harder!",
    "Where's my ehm... What wash it again? Oh yesh... [random item].",
    "Shplendid! Give that to me please!",
    "Well, I've got a Kelda hop seed right here! Pashed down generation after generation in my family...",
    "Nah, I'm just kidding! Here, have the seed, you won't catch me farming in shome dirt patch anyway!",
    "What wash that?"
  ],
  "Gauss": [
    "A good day to you, [sir/madam]!",
    "A fair bit if I say so myself, yes. What do you want to know?",
    "Ah, very hard to find that is! This place doesn't stock it. Don't think the Laughing Miner does either.",
    "Then you'll probably need some seeds!",
    "Have a toast to our good health with me and I'll tell you!",
    "Then go get something from the bar!",
    "Hurrah for the human!",
    "Cheers! That was fun! Here, I've got one Kelda seed left. A sociable chap like you is more than welcome to it.",
    "Haha, kebabs!"
  ],
  "Khorvak, a dwarven engineer": [
    "Hey it's you again! Didn't someone shoot you out of a cannon? Haha, that still cracks me up!",
    "Hahahaha, you must tell me about it sometime!",
    "Oh, we've got an expert here! Kelda shtout is delishious!",
    "Oh, I've got a sheed you might like to borrow!",
    "Then we've got no deal!",
    "Ah, err, are you offering?",
    "Haha, you make me laugh human! Shtout's are just on the table over there, help yourshelf!",
    "Whaddayamean? I've only ever asked you to get me a drink once.",
    "Well it'sh hardly a big deal, ish it? We've got a huge shupply of dwarven shtouts right here.",
    "And a dwarven shtout against a Kelda hop seed? I'm not sure if that'sh a fair trade.",
    "Alright, you talked me into it. Hmm, that shtout was delicious... here, have my invaluable Kelda hop sheed now, it wash my lasht one.",
    "You are going to give it back after you're done widdit, right?",
    "That'sh very deshent of you, human.",
    "Hey, err... wait... wait a second! Hey, wait!",
    "How are you goin' to give me back my sheed once you've made the Kelda stout? You'll be too drunk to find your way back here!",
    "That'sh alright then, here you go."
  ],
  "Rind the gardener": [
    "Yes, Player? What can a humble gardener like myself help you with?",
    "Marvelous, those seeds are quite scarce don't you know!",
    "First of all, you must remember that these seeds only grow underground. Sunlight is harmful to them, for some strange reason.",
    "There is a patch in the palace garden that you're more than welcome to use.",
    "Just take care of the weed in the patch and plant your seeds. They'll grow into hops very quickly, if you're lucky. Kelda seeds have a remarkably fast grow rate.",
    "Yes, Player? What can a humble gardener like myself help you with?",
    "Just get rid of the weeds in the patch, plant your seeds and wait for the hops to grow. The miracle of nature will do the rest!",
    "Yea and no. Yes, you do have to wait, but no, you don't have to stay here. You can help out people in the city, for instance, there's always someone who needs help with an urgent job.",
    "No no, just people like shopkeepers and such, they're quite willing to teach you things in exchange for the jobs as well. But here, tell you what, I'll give you some seeds if you can deliver this letter to a friend in Falador.",
    "Oh no, you don't have to do it all, I just thought you wanted something to do while you were waiting.",
    "Happy to hear that! His name is Elstan, he lives just south of Falador.",
    "Yes, Player? What can a humble gardener like myself help you with?",
    "Hello again, Player! Have you been able to deliver that letter yet?",
    "Much appreciated, Player!",
    "That's a little clumsy, Player! Here, I've got a copy, please deliver this one instead.",
    "Oh, I'm sad to hear that.",
    "Oh well, I'll see if I can find someone else instead.",
    "Yes, Player? What can a humble gardener like myself help you with?",
    "Wonderful, that's just wonderful! Here, have these two seeds as a reward. They may not be Kelda hop seeds, but you should be able to grow a decent amount of herbs with them."
  ],
  "Elstan": [
    "Why yes, I am. Have I become that well known?",
    "Ah, you mean Rind? Great to hear from the little fellow again. Can I see it please?",
    "Most enlightening. Please give him my regards next time you see him, I look forward to the next conference."
  ],
  "Cart conductor": [
    "Tickets, tickets, get your tickets here!",
    "Why, that part of the mines hasn't been used in a long time. I don't rightly know what you would find behind there.",
    "I don't have the authority to do that kind of thing.",
    "I don't know. Perhaps you have an influential friend?"
  ],
  "[Company] Director": [
    "Hello Player! Have you seen the statue? It looks beautiful! It's a pity it's been overshadowed by the departure of the Red Axe.",
    "Ah, and what would be lurking behind this particular tunnel?",
    "The Red Axe! This is indeed an important issue. They've gone too far this time. A major company willingly leaving the Consortium has never happened before.",
    "Forthwith, Player, forthwith! I'll order the removal at once!"
  ],
  "Red Axe Henchman": [
    "What's the new plan?",
    "My axe on his head would be more useful!",
    "We are nearly ready with our next test.",
    "Our slaves are too weak, it will never work.",
    "It was a great plan! Sabotaging the base of the statue and bribing that boatman to crash into it!"
  ],
  "Ogre shaman": [
    "Me dead human!",
    "More little fire lookers?"
  ],
  "Red Axe Director": [
    "No, not yet. He may still prove useful to us.",
    "Forget about the human and the statue for now. Our experiments are more important.",
    "This time they'll survive, I hope.",
    "Yes, things would have been so much easier with the statue.",
    "And we would have gotten away with it too, if it wasn't for that pesky human.",
    "How did the experiment go?",
    "Excellent! We are improving. Laneel!",
    "Return to Arposandra and tell your superiors we've had a partial success."
  ],
  "You search the box and find another two stones with markings on them": [
    "one green, one yellow."
  ],
  "Colonel Grimsson": [
    "The test subjects are still alive, director. They will suffice as soldiers.",
    "Look, here comes the first group!",
    "Ha, the spell has worked its magic again.",
    "No one will believe that drunken fool now!"
  ],
  "Gnome emissary": [
    "I will tell them, but I'd like to see some of your test subjects first, if I may."
  ],
  "Grunsh": [
    "Lookings likes we's finding da spying creatures'ies!"
  ],
  "Nolar": [
    "Tell us another tale, Player!"
  ],
  "Factory Worker": [
    "Tell us more about your kebabs!"
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Forgettable_Tale_of_a_Drunken_Dwarf?oldid=36233364’"
  ]
}