{
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "some small pieces of dialogue missingYou can discuss this issue on the talk page or edit this page to improve it."
  ],
  "Sir Owen": [
    "The owl hoots at midnight.",
    "Never mind, good sir/m'lady. Clearly you are not the contact I was sent here to meet. Although...you do look familiar...",
    "Then you are indeed the contact Sir Amik sent me to meet. Well met, fellow Temple Knight. Commence the briefing with haste. What is my quest?",
    "The holy gruel?",
    "I don't think you're taking this assignment very seriously.",
    "A hero? Heroes get killed, my friend. I just do my job as best I can.",
    "With respect, that mission seems a poor use of Temple Knight resources.",
    "Hah! You led me on a merry chase. You may not be my contact, but you do look rather familiar. Have we met before?",
    "Close. That was last week's callsign. Still...coincidence and fate figure largely in our lives, and you do look rather familiar. Have we met before?",
    "I am Sir Owen. a Temple Knight and devoted follower of Saradomin. And who might you be? I'm sure I've seen you before.",
    "Certainly not, good sir/m'lady. But how is it that you know my name? Have we met before?",
    "Ah, yes! You vanquished that beast with great skill. It'd be an honour to work with you again. I had hoped you were the contact Sir Amik sent me here to meet.",
    "He is the leader of the White Knights...",
    "Mighty Saradomin! It is an honour to bear witness to your glory, my lord. Of all the days to neglect to polish my armour....",
    "I don't rightly know. However, I'm sure that Saradomin will lead...",
    "Mighty Saradomin! It is an honour to bear witness to your glory, my lord. Of all the days to neglect to polish my armour....",
    "It is not mine to reason why...",
    "Mighty Saradomin! It is an honour to bear witness to your glory, my lord. Of all the days to neglect to polish my armour....",
    "Ah, yes. Since then, I've completed several operations for the Temple Knights. You're a cautious one. I respect that. Perhaps you could assist me in my mission, when Sir Amik's contact arrives.",
    "I'm sure we will find out soon enough...",
    "Mighty Saradomin! It is an honour to bear witness to your glory, my lord. Of all the days to neglect to polish my armour....",
    "He is the leader of the White Knights.",
    "Mighty Saradomin! It is an honour to bear witness to your glory, my lord. Of all the days to neglect to polish my armour....",
    "I was hoping you would ask! You see...",
    "Mighty Saradomin! It is an honour to bear witness to your glory, my lord. Of all the days to neglect to polish my armour....",
    "[missing]",
    "Your modesty becomes you. I have heard great tales of your deeds from Ozan. I have no doubt that - in your case - he had little cause to exaggerate.",
    "Sir Amik received a vision from Saradomin, telling him to send me here. I travelled to Edgeville Monastery with all haste, but I have yet to discover why.",
    "I'm sure that all shall be revealed in good time...",
    "Mighty Saradomin! It is an honour to bear witness to your glory, my lord. Of all the days to neglect to polish my armour....",
    "I have faith in Saradomin. All shall be revealed in good time...",
    "Mighty Saradomin! It is an honour to bear witness to your glory, my lord. Of all the days to neglect to polish my armour....",
    "He is the leader of the White Knights...",
    "Mighty Saradomin! It is an honour to bear witness to your glory, my lord. Of all the days to neglect to polish my armour....",
    "Mighty Saradomin! It is an honour to bear witness to your glory, my lord. Of all the days to neglect to polish my armour....",
    "Mighty Saradomin! It is an honour to bear witness to your glory, my lord. Of all the days to neglect to polish my armour....",
    "...almighty Saradomin, ruler of all things...[sic] ...whose[sic] power no creature is able to resist...[sic] ...save[sic] and deliver me...",
    "...almighty Saradomin, ruler of all things...[sic] ...whose[sic] power no creature is able to resist...[sic] ...save[sic] and deliver me...",
    "...almighty Saradomin, ruler of all things...[sic] ...whose[sic] power no creature is able to resist...",
    "I have pledged my life to your service, Saradomin.",
    "We pledge our lives to your service, Saradomin.",
    "What must we do?",
    "Disguised as a fellow Black Knight, my lord? I have a set of black armour from a former encounter with the Kinshra. I need only claim it from storage...",
    "For what purpose, my lord?",
    "My strength and intellect are yours to wield, Saradomin. I trust in your wisdom to lead me through the darkness.",
    "Go ahead, 'captain'. You'll need to convince the guard to raise the portcullis before we can enter.",
    "I was born into the Sonde family, a minor noble house in Falador.",
    "I am indeed. I became a squire to the White Knights as a child and - through hard work and service to the order - gained my knighthood when I came of age. As a junior White Knight, I joined their campaigns against the Kinshra. I was part of the Dawn Ascent operation, and it was by my hand that the Black Knight Iban fell.",
    "What? How can this be? I saw him die!",
    "A foul business indeed. Well, you have my thanks. You have rid the world of a great evil.",
    "Iban was a powerful warrior, who trained under Lord Daquarius himself. Our orders were to capture him alive. Iban refused to yield. The White Knights were superior in numbers, and Sir Amik - our leader - was over-confident. Iban slaughtered many good knights that day, and Sir Amik continued to press the advance. I could not tolerate such needless bloodshed. While my companions fell to Iban's blade, I withdrew from the battle. Ignoring my commanding officer, I slipped into the shadows, and found a vantage point high above the melee. I readied my bow, took aim, and put an arrow through the back of Iban's skull.",
    "On the contrary - the White Knights nearly dismissed me from their service. I was accused of cowardice. The White Knights have a strict code of honour...too strict for my liking. They eschew subterfuge and guerrilla warfare. To deceive an enemy is considered an act of cowardice and dishonour. I will use whatever methods necessary, and make any sacrifice to fulfill my mission and protect my allies. Fortunately, Sir Tiffy intervened, and offered me a position with the Temple Knights.",
    "Sir Tiffy Cashien is a retired adventurer, who heads up recruitment for the Temple Knight organisation. You can usually find him in Falador Park.",
    "I wanted to learn how to fight, so I could protect Falador's people from those who threaten the peace. When I was young, my mother - Altra - was captured by a Kinshra raiding party. I tried to stand against them, but I was no match for trained knights. It is how I earned this scar. Stario - my father - heard of the attack, but by the time he returned from court, the Black Knights had long since fled. I wanted my father to be angry, to blame me for the loss of his wife, my mother. Instead, there was only grief and sorrow in his eyes, and father has looked at me with disappointment ever since.",
    "Perhaps you're hoping I'll tell you of the time I witnessed a glorious miracle. Or that Saradomin came to me in a vision, and assured me I had a great destiny to fulfill. It is none of these things. I believe in Saradomin's cause because he wishes the best for his people. Saradomin seeks to protect us from evil, and for Gielinor to be a safe haven where we can live in peace and prosperity. I fight to protect the innocent from those that would do us harm. Our freedom is worth fighting for.",
    "The Temple Knights are an elite order of White Knights, founded by Saradomin himself in the Third Age. We are a covert division of the order, dedicated to defeating threats to peace and sovereignty. Temple Knight operatives are called in for missions involving espionage, surveillance, sabotage, or infiltration. We also get all the best magical gadgets.",
    "The Kinshra are a Zamorakian military order of black knights. They have a long-standing enmity with the White Knights of Falador. The Kinshra were banished from Asgarnia a few years ago, but they maintain several well-defended bases on the outskirts of the kingdom.",
    "It is a well-defended Kinshra stronghold on the outskirts of Asgarnia. The Black Knights built the fortress upon Ice Mountain around the same time as the White Knights constructed Falador Castle. The Fortress was originally the mansion of Lord Shadwell, who founded the order of the Black Knights. He dedicated his home, finances, and the lives of his family to Zamorak, and fortified the mansion as a base of operations. Since then, the Kinshra have established over outposts across Gielinor. Lord Shadwell's reign ended in Year 163 of the Fifth Age. He was suceeded by Lord Milton, and then shortly after by Lord Sulla in Year 164. Lord Daquarius is the current leader of the Black Knights.",
    "He is a descendant of Lord Shadwell; his last surviving relative, or so I've heard. That likely explains why Captain Dulcin has a relatively low military rank, yet maintains control of the Black Knights' Fortress. I've heard that Lord Daquarius does not think fondly of Dulcin, but tolerates him due to his family ties.",
    "What do you mean?",
    "We have a job to do. I cannot afford to surrender to my emotions. I focus on completing our mission as expediently as possible. Saradomin is counting on us.",
    "Saradomin wants me to destroy evil and protect the innocent. Those are noble goals, and they are what drive me ever onwards. We live in a cruel and chaotic world. I trust in Saradomin to guide me on the righteous path.",
    "Why should they? I can't succumb to doubt or despair. I must remain calm and do what is necessary to reach our goal. With a level head, a bold heart, and a sharp blade, there is nothing that we cannot overcome.",
    "Well played.. Now let's find a way up to the next level.",
    "I think attacking the Black Knights will be more than a little suspicious.",
    "Saradomin told us to ascend to the tallest tower. There's little point in searching the cellar.",
    "Well done, we're in. There should be an open stairwell in the north-west interrogation chamber. Let's hope it's not guarded.",
    "Because I've been here before. On my last mission, I got to the armoury without any of the Kinshra noticing my presence. Though I did have to...silence a few. I still think I should have changed out of this heavy armour before we entered, but I'm sure Saradomin has his reasons.",
    "The scoundrels! I hope their library card was revoked.",
    "In all seriousness, the symbol of Saradomin on the cover implies it was a holy tome. Look - it's shining with divine energy.",
    "It's wise to keep a weapon out of your enemy's hands, even if it's not within your power to wield it.",
    "That's most likely artistic license.",
    "That's probably Sir Amik Varze. He was wounded during the Siege of Falador.",
    "Well spotted...though Sir Vyvin lost his right eye to a Wilderness berserker.",
    "Can't say I recognise the holy book. I'll check the Temple Knight archives when we finish our mission.",
    "A good suggestion but unlikely. If such a powerful artefact had once been held by the White Knights, I would have known.",
    "Clearly it depicts a confrontation between the knights of Saradomin and Zamorak...most likely the Siege of Falador. The chap on the right bears a striking resemblance to Sir Amik Varze, the leader of the White Knights.",
    "It could be this Captain Dulcin everyone keeps talking about, but he was in hiding during the War of 164. Most likely it's Lord Sulla, who rose to power after assassinating Lord Shadwell's successor, Lord Milton. Lord Sulla led the War of 164 that culminated in the Siege of Falador.",
    "They've sounded the alarm. Our cover's been broken! We'd best hide until the Black Knights finish their search. The coast is clear. Remember - stay in character.",
    "There should be another stairwell leading to the second floor in the south-east corner of the level.",
    "I wish we could, but we need to focus on the mission at hand. If the Kinshra rise to power, we'll all be living as slaves.",
    "I've known men that suffered under a torrent of boiling oil. It's not a pretty fate.",
    "I think you're taking your commitment to your role a bit far.",
    "We're almost at the tallest tower. I wonder what we'll find?",
    "Thanks for the distraction. You might want to see if he's carrying anything useful. The captain's quarters are just up ahead.",
    "We can't leave witnesses. I'll make sure he doesn't suffer.",
    "As you wish. I hope this doesn't come back to bite us in the future.",
    "He won't feel a thing. It's better this way. Now, let's investigate that attic tower.",
    "Now let's investigate the attic tower.",
    "According to the knight I knocked out, the attic tower can be accessed from the captain's quarters.",
    "It was worth a try.",
    "The door is also barred with a latch. Besides, Saradomin said the magic weapon is in the tallest tower, not the treasury.",
    "Captain Dulcin appears to be quite the dragon slayer! No wonder his men hold him in such high regard. He's clearly a capable warrior. I hope we don't run into this chap in person.",
    "Hmm, we're on the roof of the fortress. We've gone too far up.",
    "Well spotted. The journal's locked with a clasp.",
    "Brutes. This is all too typical of the Kinshra.",
    "The bones are eerily clean and brightly polished. Most likely the flesh was dissolved with some kind of acid.",
    "Strange. The skull is missing.",
    "I suspect these helmets are trophies, taken from White Knights that Captain Dulcin defeated in battle.",
    "A ritual chamber! A dark aura pervades the room. Zamorakian sorcery has been performed here.",
    "Look, up there... A magic circle. Inactive, thank Saradomin. Someone has tampered with it.",
    "I hope not. Circles such as this one are normally used to summon and bind otherwordly creatures. I find it unlikely that Saradomin would seek an artefact so strongly aligned with Zamorak.",
    "I'm hardly an expert, but one of the advantages of a privileged upbringing is a broad education.",
    "I have an academic understanding of magic. Temple Knights have access to a range of magical devices, so we usually receive training in other disciplines. I certainly know enough about ritual magic to proceed with great caution. There are things that well in dark places that are best left undisturbed.",
    "We expected to find Saradomin's weapon in this room, but it's not here.",
    "There seems to be only one path available to us. Complete the ritual!",
    "Indeed. Were this spell to summon forth a powerful demon, we could unleash a great evil upon Asgarnia. Yet I see no alternative. I wonder if Saradomin knew what we would find here.",
    "And yet, that seems to be the only way to progress. That being said, it is my experience that magic has no inherent morality. It is we who wield it for good or ill. We must trust that this ritual will summon forth the artefact we need. All the materials we require should be somewhere in this room.",
    "You have a poor opinion of the Lord of Light. We must trust that this ritual will summon forth the artefact we need. All the materials we require should be somewhere in this room.",
    "Yes, you're right. The light of Saradomin shall guide us down this dark path. We must trust that this ritual will summon forth the artefact we need. All the materials we require should be somewhere in this room.",
    "You have the heart of a mercenary, my friend. We must trust that this ritual will summon forth the artefact we need. All the materials we require should be somewhere in this room.",
    "I know not what the spell shall conjure, but it is our duty to defeat it. If we do not, our enemies shall complete the ritual, and use this power for ill. Be prepared. Let's proceed.",
    "Good thinking. It'll be much easier to refer to the book's contents if you take it with you.",
    "Interesting! But you shan't need this letter to complete the ritual.",
    "You'll need that to replace one of the melted candles.",
    "You shan't need that item to complete the ritual.",
    "The central glyph has been rendered unintelligible. We need to discover what the symbol was.",
    "The symbol you've drawn doesn't quite match the one in the grimoire...",
    "I think you've drawn the correct symbol within the magic circle.",
    "We need to replace all the melted candles.",
    "We need to light all the candles.",
    "We need to chant word of power over the north-west candle.",
    "We need to chant word of power over the north-east candle.",
    "We need to chant word of power over the south-east candle.",
    "Now we'll need to recite the magic words over each candle. Refer to the grimoire. We can't afford any mistakes.",
    "Arom...",
    "Nahrea...",
    "Imperium.",
    "Feritas...",
    "Silenti...",
    "Sepulchrum.",
    "Igasac...",
    "Perdimit...",
    "Ebulam.",
    "Well, it's not a demon. This portal could lead anywhere...",
    "We have no way to even know that for certain. It could take us to another plane, another dimension. We may not be able to return... I recommend you store your disguise in this chest, and bear arms for battle. You might as well put the items you've found in the chest too. You'll need all the supplies you can carry.",
    "Captain Dulcin's armour is ceremonial and cosmetic. It shall be no use to you in battle. You should either store or discard it before we proceed.",
    "We've no idea what horrors await us. Yet we must step forward into the unknown, and find the weapon before the Kinshra. May the light of Saradomin protect us.",
    "Just being in this room makes my skin crawl.",
    "We cannot abandon a damsel in distress! Have you no honour, sir/[missing]?",
    "Well done! Search the bodies. One of them must have the key to the cage.",
    "Good. You have the key to the lady's cage.",
    "We can't just leave that poor woman dangling in a cage!",
    "You fought well. We'd best see what we can learn from the sister of St Elspeth.",
    "We'd best not venture into this tomb unprepared.",
    "Dawn could have valuable information about our enemies.",
    "We should learn all we can from her before we proceed.",
    "I helped as well, you know. I could probably have taken them all on my own.",
    "There's snow at the surface entrance, so we can't be too deep underground.",
    "The other cages are empty. What happened to your companions?",
    "Do the Black Knights know how to breach these wards?",
    "Anything else?",
    "Thank you for indulging our questions, m'lady. We are left, though, with the problem of what to do with the poor woman.",
    "It's too risky. Who knows what dangers await us in the crypt? And the Kinshra may be waiting in ambush. I think it would be safest if she was to wait here...if the lady Dawn would find that agreeable.",
    "A noble suggestion, but we can't afford to delay our mission. The Kinshra could be claiming the weapon as we speak!",
    "Good point. Call out if any arrive. We'll investigate the tomb. Let's go!",
    "We've learned all we can from Dawn. Let us venture forth into this dark crypt!",
    "The architecture of this tomb resembles other dungeons I've seen in the frozen north, dating back to the God Wars.",
    "If I'm right, we've travelled a great distance, deep into the icy mountains north of Trollheim, west of the Wilderness.",
    "That would explain why it's so cold down here.",
    "The God Wars were a series of conflicts that marked the Third Age of Gielinor.",
    "For four thousand years, the gods battled for control of our gorld, and sent forth their followers to die in their names.",
    "The battles laid waste to northern Gielinor, leaving only a blighted wilderness where great empires once stood.",
    "Yes, my teleportation amulet still has a few charges. Are you ready to depart?",
    "We shan't shift that debris.",
    "We have no choice but to go deeper into the tomb.",
    "So many bodies... Hundreds of Saradomin's followers have been inhumed in this crypt.",
    "They died fighting in the God Wars, that we might know peace.",
    "The God Wars raged for four thousand years.",
    "There are several such tombs buried beneath Gielinor, but they soon exceeded their capacity.",
    "As the death toll rose, they resorted to heaping mounds of bodies in these mortuaries.",
    "The Saradominist tombs became charnel pits.",
    "I do not agree.",
    "It is my view that these warriors fought to protect our world from destruction.",
    "Civilisation as we know it would not have arisen without their sacrifice.",
    "Many died to protect our world from evil gods... but Saradomin knew it was necessary.",
    "You're right. All this war and strife brought about an age of prosperity.",
    "The kingdoms of Misthalin and Asgarnia would not have enjoyed such prosperity and growth had Saradomin not fought to protect our world from invaders.",
    "I have to believe their sacrifice was just.",
    "Perhaps you're right.",
    "Merciful Saradomin! To treat the dead with such indignity.",
    "Let's see if there are any chambers adjoining this crypt.",
    "The Kinshra have looted the coffins of these ancient warriors of Saradomin.",
    "Have they no respect for the dead?",
    "Have you no respect for the dead? Stand clear!",
    "Merciful Saradomin! Let the dead rest in peace...",
    "These warriors have suffered enough. Leave them be!",
    "This creature is, or was, a centaur. They fought for Saradomin in the God Wars.",
    "You mentioned Elora's wand. Who is Elora?",
    "How did you come to be here?",
    "Then what happened?",
    "And Elora continued to aid you?",
    "What power does the wand possess?",
    "We only wish to prevent the Kinshra from abusing the wand's power for conquest.",
    "We were sent here by Saradomin himself to claim the wand.",
    "Your long vigil is over, spirit.",
    "We can relieve you of your burden.",
    "You can finally pass into the next world, and know peace.",
    "It grieves me to battle one who gave her life for Saradomin's cause, but we must complete our mission. To arms!",
    "It grieves me to have battled one who gave her life for Saradomin's cause, but we must complete our mission.",
    "The way is open. Let's find this wand, before it falls into Zamorak's hands!",
    "That certainly looks like the wand Fern mentioned.",
    "Now how do we get to it?",
    "We should carefully explore this area.",
    "His outstretched hand has been reduced to a twisted, bloodless stump.",
    "The poor man's spine has been snapped.",
    "Her palms have been cut, yet there's no sign of any blood.",
    "It's like her wounds were cauterised.",
    "I suspect the floor tiles surrounding the pedestal are used to disable the second seal.",
    "We'll have to disable the protective wards before we can claim the wand.",
    "A courageous lion.",
    "A centaur.",
    "The owl of wisdom.",
    "The nimble rabbit.",
    "The graceful unicorn.",
    "A White Knight?",
    "A Star of Saradomin.",
    "The wing of an Icyene.",
    "The tiles on the floor reflect aspects of Saradomin. I suspect we must match them in pairs to disable the second seal.",
    "A matching pair.",
    "I hate puzzles...",
    "I'm glad that's over.",
    "Well done. Only one seal remains.",
    "The final ward requires the blood of a truly virtuous soul. You know what we must do.",
    "The sister of St. Elspeth said that this ward requires the blood of one who is virtuous.",
    "You would bleed an innocent maiden? Have you no honour?",
    "I shall make the sacrifice.",
    "Your valiance is matched only by your piety.",
    "Are you sure you wish to breach the ward with your own blood?",
    "If you are not pure of heart, the ward will utterly destroy you!",
    "Your valiance is matched only by your piety.",
    "Are you sure you wish to breach the ward with your own blood?",
    "If you are not pure of heart, the ward will utterly destroy you!",
    "May the light of Saradomin shine upon you, my friend.",
    "Very well. I shall make the sacrifice.",
    "Very well. I shall make the sacrifice.",
    "Your valiance is matched only by your piety.",
    "Are you sure you wish to breach the ward with your own blood?",
    "If you are not pure of heart, the ward will utterly destroy you!",
    "Very well. I shall make the sacrifice.",
    "Your valiance is matched only by your piety.",
    "Are you sure you wish to breach the ward with your own blood?",
    "If you are not pure of heart, the ward will utterly destroy you!",
    "As you wish.",
    "Dawn!",
    "Hurry, my friend. We must not let her escape with the wand!",
    "We must pursue her, and recover the Wand of Resurrection at any cost!",
    "...",
    "When Fern took Elora's horn and used it, the risen dead were corrupted. If you went through all dialogue with Fern",
    "The undead centaurs turned on Fern and killed her.",
    "Surely you would suffer the same fate. Your intentions are far from pure.",
    "Thank...you...",
    "My sword arm is numb...I feel an icy chill coursing up my shoulder.",
    "The evil that I sought to purge from this world is within me.",
    "The urge to destroy boils within me. The corruption claws at my mind.",
    "No. I must resist its temptation.",
    "I will not allow this evil to consume me.",
    "I will stand firm, proud and with honour.",
    "I will follow the code you taught me, Saradomin.",
    "My body may be tainted, but my intentions are pure and virtuous.",
    "Let me prove that I can overcome the darkness in me, sire.",
    "Remember, I breached the ward with my blood. If Sir Owen's blood was used.",
    "Before my death, at least, the wand judged me worthy to wield it.",
    "Let me travel to the centaur burial ground, and use the wand to resurrect the centaurs.",
    "Remember, he/she breached the ward with his/her blood. If the player's blood was used.",
    "The wand judged him/her worthy to wield it, not I.",
    "Let us travel to the centaur burial ground, and use the wand to resurrect the centaurs.",
    "I can see she's going to be a barrel of laughs.",
    "I shall see what I can requisition from the Temple Knight armoury.",
    "I'm sure I can acquire what I need without being spotted.",
    "I will not disappoint you, Saradomin.",
    "I shall contact you soon, my friend. If you did not took Sir Owen's shield.",
    "It's been an honour to fight at your side.",
    "Oh, and adventurer - about my shield... If you took Sir Owen's shield.",
    "Keep it, with my blessing.",
    "There is hope, my lord. My arm is cold and skeletal, yet I can still control it.",
    "I can sense the virtue in you, my friend. The purity of your heart that allowed you to claim the wand.",
    "It is like a white-hot fire searing my senses.",
    "I yearn to snuff out that light, but I can resist this temptation.",
    "I will not allow the corruption to consume me.",
    "My lord, I have sought to purge evil from this world.",
    "I have stood by my principles, and followed the code you taught me.",
    "Let me prove that I can overcome the darkness within me.",
    "I shall travel to the centaur burial ground, and use the wand to restore the centaur race.",
    "As you wish, my lord.",
    "I shall contact you soon, my friend. If you did not take Sir Owen's shield",
    "It's been an honour to fight at your side.",
    "Oh, and adventurer - about my shield... If you took Sir Owen's Shield.",
    "Keep it, with my blessing."
  ],
  "Player": [
    "Yes. The porridge of the gods. Blessed oats, anointed with honeyed ambrosia, and soaked in the milk of human kindness. It is the breakfast of champions.",
    "I saw you with Sir Tiffy in Falador Park.",
    "I fight against you, Saradomin.",
    "I support [god emissary faction]. Why would I help you?",
    "So you're Sir Owen Sonde?",
    "I think you're mistaken about Iban. You haven't heard? Iban came back!",
    "He was resurrected with dark magic. I had to infiltrate a group of cultists and bind his spirit to a doll to destroy him. I was elbow-deep in demon blood and spider guts by the end of it. Ugh.",
    "So how did you defeat him the first time?",
    "And that's how you were promoted to a Temple Knight?",
    "Why are you so familiar with the layout of the Black Knights' Fortress?",
    "Looks like the Black Knights in this illustration have stolen a book.",
    "...",
    "There's sunlight pouring from the pedestal where it used to sit too. I wonder why the Black knights took it.",
    "The Black Knights in this illustration appear to be on fire.",
    "Do you recognise the White Knight with the head injury?",
    "His eye is wounded. It could be Sir Vyvin.",
    "What about the book he's guarding?",
    "Perhaps this book is the dangerous weapon Saradomin wants to recover.",
    "What do you make of this illustration?",
    "And the leader of the Black Knights on the left?",
    "An enchantment that confuses the subject's mind, and renders them quite harmless.",
    "Do you think me weak, guard?",
    "Perhaps you wish to challenge me to a duel. Will a mortal wound satisfy your curiosity?",
    "Precisely.",
    "I serve Zamorak. I need no tiresome blessing from you to prove my allegiance to the lord of chaos. Stand aside, or I shall strike you down.",
    "When I have claimed the weapon for Zamorak, then I shall return and tolerate your ridiculous ritual. Now leave me be.",
    "Perhaps we can pick the lock?",
    "Well, this is clearly Captain Dulcin's bedroom.",
    "That's a lot of helmets.",
    "Saradomin said there'd be a dangerous weapon here. Where is it?",
    "So you can cast magic spells?",
    "Instead, we find a ritual circle.",
    "Is that wise? What if something goes wrong?",
    "Do you suppose the spell in this book is the powerful weapon that could destroy Falador?",
    "Anywhere in Gielinor?",
    "Player.",
    "You could wear a disguise. It worked for us.",
    "Where are we?",
    "What are the God Wars?",
    "Can you teleport us back to the ritual chamber?",
    "Why are all these skeletons just piled here?",
    "Saradomin clearly cares nothing for his followers.",
    "The war was necessary for Saradomin to achieve peace.",
    "This is why the gods must be stopped.",
    "Who are you?",
    "Tell me about this wand.",
    "I am ready to be judged.",
    "I fight to protect the innocent.",
    "We're on a mission from a god.",
    "I am the World Guardian!",
    "I have yet to be proven worthy.",
    "I do not wish to kill you.",
    "I'm ready.",
    "Bring it!",
    "I need time to prepare.",
    "We shall leave you in peace (Exits conversation)",
    "Shall we go get Dawn and cut her?",
    "Yes",
    "I shall sacrifice my own blood.",
    "Yes.",
    "No, let Sir Owen do it.",
    "No, I've changed my mind.",
    "You may have the honour of breaching the ward, Sir Owen.",
    "Yes",
    "You're the Saradominist. You do it.",
    "Yes",
    "I need time to think about this.",
    "I knew you were lying from the start.",
    "Your damsel in distress act didn't fool us.",
    "Your damsel in distress act didn't fool me.",
    "You're making a terrible mistake.",
    "That wand can only be used by the virtuous.",
    "The wand should stay buried.",
    "The wand belongs to Saradomin.",
    "That wand belongs in a museum.",
    "Give me the wand or you won't live to regret it.",
    "Don't you know what will happen if you use the wand?",
    "Hey!",
    "Merciful Saradomin, bringer of light and protector of peace...",
    "May your loyal servant find rest at your side, and delight in your wisdom.",
    "Lord Zamorak, bringer of chaos and father of invention...",
    "Without chaos, life stagnates. Let me be honed by the obstacles you place in my path.",
    "Grant me the strength to succeed where this follower of Saradomin failed.",
    "Mighty Bandos, Big High War God...",
    "Grant me the strength to defeat my enemies. In exchange, I offer up the soul of this fallen warrior do to with as you will.",
    "Noble Armadyl, god of liberty and justice...",
    "Noble Armadyl, god of liberty and justice...",
    "I pray that you remember Sir Owen's great deeds and strong will. May his soul soar free, unfettered by the bonds of earth.",
    "Lord Zaros, Empty Lord and arbiter of fate...",
    "All that happened here was inevitable, as you decreed it. I submit my will - and the fate of Sir Owen's soul - to you.",
    "Seren...queen of harmony...",
    "Though Sir Owen is not of your chosen people, I beseech your kindness.",
    "May your peace and grave shine apon this lost soul. Welcome him into your crystal city, I pray.",
    "Mysterious Sliske, lord of the Shadow Realm and keeper of secrets...",
    "Here lies a man taken by madness and treachery. I pray that Sir Owen's part has been played out in full.",
    "Marimbo, god of monkeys...",
    "If ever anyone needed to kick back and have a good time, it's this guy. Show Sir Owen to the punch bowl, will you?",
    "Tumeken, god of the Sun...",
    "Husband to Elidinis, and father of Amascut and Icthlarin.",
    "May your falcon eyes watch over Sir Owen in the next life...",
    "Elidinis, goddess of fertility and growth...",
    "Wife of Tumeken, mother of Amascut and Icthlarin...",
    "May your hippos bear Sir Owen into the next life, where he might prosper and enjoy peace.",
    "Icthlarin, demi-god of the dead...",
    "Son of Tumeken and Elidinis, brother of Amascut...",
    "May your cats and jackals guide Sir Owen on his journey into the underworld. Protect his soul from Amascut the Destroyer, I pray.",
    "Amascut the Devourer, demi-goddess of destruction...",
    "Daughter of Elidinis and Tumeken...",
    "I offer up the soul of Sir Owen to you. Feast upon him in your glory.",
    "Apmeken, goddess of friendship and community...",
    "Welcome Sir Owen with open arms, and protect him from Amascut.",
    "Crondis, crocodile god of resourcefulness and responsibility...",
    "Sir Owen was a capable man; strong, smart, and willing to do what was necessary. I think you will enjoy his company.",
    "Het, god of strength and mental health...",
    "Patron of Al-Kharid, I commend this strong warrior to your care.",
    "Scabaras, beetle god of isolation and tranquility...",
    "May Sir Owen find peace and enlightenment in the afterlife.",
    "In battle, you were courageous. You fought bravely by my side.",
    "You were driven to achieve your goals at any cost to yourself.",
    "This was your final sacrifice.",
    "You were resourceful and practical.",
    "You were a great asset to the Temple Knights.",
    "As a Temple Knight, you were useless.",
    "In battle, you were utterly superfluous.",
    "...I hope you find peace in the next life.",
    "...you will never be forgotten.",
    "...you will live in our hearts forever.",
    "...I hope you suffer in eternal fire.",
    "Sir Owen...my faithful companion.",
    "Sir Owen...you poor dead fool.",
    "Sir Owen...follower of Saradomin...",
    "Sir Owen...Temple Knight.",
    "You were always patient, and..",
    "You were always well-mannered, and...",
    "You were always humble, and...",
    "You were always annoying, and...",
    "You will be missed.",
    "I'll never forget you.",
    "You fought bravely.",
    "I hope you rot.",
    "It is with great sadness that I mourn your passing.",
    "Yet I choose to celebrate your passing at this troubling time.",
    "In utter ambivalence, I endure your passing.",
    "Why didn't it work? I proved that I am worthy to wield the wand.",
    "Won't he just come back as a zombie again?",
    "He has suffered enough. Let him rest in peace.",
    "I don't think I can trust you with the wand's power.",
    "I've made my decision.",
    "I will give you the wand.",
    "No. You cannot have the wand.",
    "I will destroy the wand.",
    "I need time to consider.",
    "Corrupted? What does that mean?",
    "Were we too late?",
    "You did this to him!",
    "You said it yourself. The wand draws its power from its wielder. Clearly you are not as pure and good as you think you are.",
    "I stand by you, Saradomin.",
    "You're a monster, Saradomin.",
    "How can a god be invirtuous?",
    "Guthix wanted me to protect the world from gods like you. If the World Wakes is completed.",
    "We don't even know where the centaurs are buried.",
    "Fern! I thought we killed you.",
    "Why would you help us?",
    "The more the merrier!",
    "Yes, teleport me to Edgeville Monastery.",
    "No, I wish to stay and explore this tomb.",
    "If I had raised him, this would not have happened.",
    "I should be immune to god magic! How did you take the wand? Only after The World Wakes.",
    "What has happened to Sir Owen?",
    "Why would you want to resurrect the centaurs?",
    "So that's why you sent us here.",
    "To add more troops to your army, no doubt.",
    "You would resurrect the centaurs, only for them to die fighting.",
    "The centaurs don't even come from Gielinor! Why fight for it?",
    "Yes, teleport me to Edgeville Monastery.",
    "No, I wish to stay and explore this tomb."
  ],
  "Saradomin": [
    "You think I don't know that you've joined Zamorak? I was watching when you crawled under his wing. But...I am a forgiving and just god. Mortals can change, as I am sure you will.",
    "You think I don't know that you've joined Zamorak, World Guardian? I was watching when you crawled under his wing. For the sake of your beloved Guthix, I hope you know what you are doing.",
    "Regardless, only you can stop an event that will lead to the death of thousands. Would you consider helping them, if not me?",
    "Please, there is no need to grovel. I could have done with your loyalty on the Lumbridge battlefield. For now, I entrust to both of you this sacred task.",
    "Please, there is no need to grovel. If you would swear allegiance to me, then do so on the Lumbridge Battlefield. In the meantime, I entrust to both of you this sacred task.",
    "Arise, my faithful followers. There is no need to grovel. I know you well, Sir Owen. You are one of the greatest of my faithful. It is why I entrust you with this sacred task.",
    "Your loyalties are your own to choose. I force no one to bow their knee before me. Now that I have defeated Zamorak, I shall usher in a new age of peace and prosperity. You can be sure of a more peaceful and ordered world with me defending it.",
    "Very well. I understand better than most that loyalty must be earned. It is not too late to choose a side. The Battle of Lumbridge still rages.",
    "You have chosen to fight against Zamorak at the battle of Lumbridge, and for that I thank you greatly. You can be sure of a more peaceful and ordered world with me defending it.",
    "Ah, the World Guardian. I am glad you chose to fight for me at the battle of Lumbridge. You made the right decision, and Guthix would be proud of you.",
    "So, you have sworn allegiance to Zamorak at the Battle of Lumbridge. Such a waste of potential. You could achieve fantastic things on the side of peace and order.",
    "And do get up, Sir Owen. If there is one thing I cannot stand, it is people grovelling. I know you well, my servant. You are one of my greatest advocates. It is why I entrust you with this task.",
    "Your loyalties are your own to choose. I force no one to bown their knee before me. You show great courage to stand before a god without fear. I sense the power radiating from you. The potential in you is great.",
    "Please, Sir Owen. There is no need to grovel. I know you well, knight. You are one of the greatest among my followers. It is why I entrust you with this mission.",
    "Indeed. Much has changed since the death of Guthix. What do you think of my new look?",
    "I've been called many things on many planets. That insult wouldn't even take the top one-hundred.",
    "One does not insult a god without gaining a few broken bones.",
    "This is but a minor manifestation. I prefer talking to mortals eye-to-eye.",
    "This is but a minor manifestation. I prefer talking to mortals eye-to-eye.",
    "This is but a minor manifestation. I prefer talking to mortals eye-to-eye.",
    "Oh, do get up, Sir Owen. If there is one thing I cannot stand, it is people grovelling. I know you well, my servant. You are one of the greatest among my followers. It is why I entrust you with this sacred quest.",
    "I am Saradomin. It is thanks to my wisdom and guidance that the kingdoms of Misthalin and Asgarnia have enjoyed an era of peace and prosperity.",
    "Now that I have defeated Zamorak, I shall usher in a new age of order and enlightenment.",
    "I have returned to protect you from harm, and bring humanity into a new age of order and enlightenment",
    "And Zamorak curses your decision!",
    "With you at my side, how can I fail to defeat him? Peace shall come to my people.",
    "With The World Guardian at my side, how can I fail to defeat him? Peace shall come to my people.",
    "You have no doubt fought his Black Knights, the Kinshra, on the Lumbridge battlefield. They have long sought to rule the kingdom of Asgarnia, and obliterate my White Knights. These dark-hearted knights of Zamorak have discovered a dangerous weapon lasted wielded during the God Wars. If the Black Knights seize this weapon, they will unleash terrible destructive power upon the citizens of Falador. I have chosen both of you to recover this artefact, before Zamorak's minions claim it. Will you aid me?",
    "And Zamorak curses your decision!",
    "These are dark times.",
    "These are dark times.",
    "The protection of Guthix is no more.",
    "The Edicts of Guthix are no more.",
    "Now, lesser gods seek to claim dominion in my world with wearisome tenacity. Dark-hearted knights of Zamorak, the Kinshra, have discovered a dangerous weapon last wielded during the God Wars. They have long sought to rule the kingdom of Asgarnia, and obliterate my White Knights. If the Black Knights seize this weapon, they will unleash terrible destructive power. The innocent citizens of Asgarnia will be slaughtered in their hundreds. I have chosen both of you to recover this artefact, before Zamorak's minions claim it. Will you aid me?",
    "These are dark times.",
    "These are dark times.",
    "These are dark times.",
    "The Kinshra, Zamorak's Black Knights, have discovered a dangerous weapon last wielded during the God Wars. They hope to use its terrible power to obliterate my White Knights, and reclaim Falador. They know not the uncontrollable force of corruption they will unleash upon the world. Even Zamorak wouldn't condone the loss of life without reason. Destruction must serve a purpose.",
    "The pre-meditated slaughter of hundreds of innocents benefits no-one. I beseech you, for the sake of the people of Gielinor, to find the weapon and keep it safe.",
    "Guthix chose you to protect this world, and defend the people of Gielinor. I beseech you, World Guardian, for their sake, to find the weapon and keep it safe.",
    "The Kinshra, Zamorak's Black Knights, have discovered a dangerous weapon last wielded during the God Wars. They hope to use its terrible power to obliterate my White Knights, and reclaim Falador. They know not the uncontrollable force of corruption they will unleash upon the world. Even Zamorak wouldn't condone the loss of life without reason. Destruction must serve a purpose.",
    "The Kinshra, Zamorak's Black Knights, have discovered a dangerous weapon last wielded during the God Wars. They hope to use its terrible power to obliterate my White Knights, and reclaim Falador. They know not the uncontrollable force of corruption they will unleash upon the world. Even Zamorak wouldn't condone the loss of life without reason. Destruction must serve a purpose.",
    "First, your companion shall require a suitable disguise to infiltrate the Black Knights' Fortress.",
    "First, the World Guardian shall require a suitable disguise to infiltrate the Black Knights' Fortress.",
    "Equip the armour I have provided to the south-west, and return to me.",
    "Every moment you hesitate, the forces of evil gain ground.",
    "Kindly equip the armour of a Black Knight captain. Time is of the essence.",
    "Sir Owen has prior knowledge of the layout of the Black Knights' Fortress. He has dealt with their kind before. Moreover, he is willing to make any sacrifice to achieve his mission. I will have need of his devotion. As for you. Well...you shall soon see how important you are to me.",
    "I will provide further information after you've equipped the armour of a Black Knight captain. I apologise that I cannot be more forthcoming, but I have conflicts to address on other fronts. It is why I need your help.",
    "I am able to project a minor manifestation of my form here to speak with you. It is also why I must ask you to do this for me.",
    "I am able to project a minor manifestation of my form here to speak with you. It is also why I must ask you to do this for me.",
    "Although I am locked in battle with Zamorak... I am able to project a minor manifestation of my form here to speak with you. It is also why I must ask you to do this for me.",
    "The ruin I brought to the Naragi is my greatest shame. Civilisations have risen and fallen, and still the actions of my past haunt me. And so they should, for regret begets wisdom, and I have much to regret. I was young and filled with a new and glorious power. I wore the Elder Crown, and thought it granted me the right to rule. In my arrogance, I did not anticipate the Naragi would refuse. I sought to make amends, when the beast and the hunter brought violence of their own. I fought against them for the same reason that I now battle Zamorak... To protect you. To remove a threat. As long as these invaders exist, your world shall never know peace.",
    "Good. You shall impersonate Captain Dulcin, the current overseer of the Black Knights' Fortress. Sir Owen shall accompany you.",
    "No, Sir Owen. I know well of your experience in stealth and infiltration, but great peril lies ahead. You must remain armed and ready for the battle that awaits. You will soon understand the wisdom of my actions. You shall be Captain Dulcin's prisoner. The Kinshra have recently raided White Knight outposts in Asgarnia, and taken every opportunity to capture my followers alive.",
    "That is for you to discover, my faithful knight.",
    "Excellent. With your permission, I shall now teleport you both to the Black Knights' Fortress.",
    "The power that Guthix gave you protects you from godly power. As you recall from our last encounter, I cannot teleport you against your will. Now, are you ready to proceed?",
    "Then make haste, for the Kinshra will not wait for you.",
    "Proceed to the tallest tower of the fortress, and recover the weapon at any cost.",
    "Well done. You have the wand. If we hurry, we can restore Sir Owen to life.",
    "Where is the Wand of Resurrection? Bring it to me!",
    "The witch drained all of the life from Sir Owen, then raised him as a zombie.",
    "When you killed him, he was already dead.",
    "Only the power of a god can restore Sir Owen to life a second time.",
    "The wand's power must flow through me.",
    "Sir Owen's spirit is fading. We have little time.",
    "Please, give me the wand, and I will restore him to life.",
    "The wand draws its power from its wielder.",
    "The witch's wicked heart and allegiance to Zamorak meant she could only animate corpses.",
    "In the hands of one devoted to good, the wand can be used to return lost heroes to life.",
    "Innocents, those who did not deserve to die.",
    "Have faith in me and Sir Owen shall live again.",
    "Sir Owen has the potential to do great deeds in my name. He has dedicated his life to me.",
    "Sir Owen has much work left to do. I cannot squander this gift...",
    "You are wise to be cautious of me. I have done many questionable things.",
    "I do what is necessary to protect my people, that they might live a life of virtue.",
    "It is possible that the wand will not judge me worthy.",
    "Yet I must take the risk...for Sir Owen's sake.",
    "Well done. You will not regret this.",
    "You dare defy a god?",
    "I shall not be denied!",
    "No!",
    "You have defied me for the last time, World Guardian.",
    "The spark of life in Sir Owen is fading. There is no time to waste. Give me the wand!",
    "Alas, it as I feared.",
    "I was able to return Sir Owen to his body, but he is...corrupted.",
    "Sir Owen's body is contaminated with the rot of the grave.",
    "His mind and his heart will soon follow.",
    "No. It seems that I have been deemed unworthy.",
    "I returned Sir Owen to life, but I could not eradicate all of the corruption in him.",
    "It seems that I am not unsullied by my decisions. I cannot wield the wand's full power.",
    "I have made difficult choices. I have sacrificed others for my cause.",
    "I believe it is for the greater good, but my actions have tarnished my soul.",
    "All that I have done has been necessary for the good of Gielinor and its inhabitants.",
    "Nevertheless, some of the actions I had to take were regrettable.",
    "This is my sacrifice.",
    "I appreciate your loyalty. In these dark times, it is a precious gift.",
    "I have lived for countless lives of men.",
    "I was mortal once, a long time ago.",
    "I have done...questionable things.",
    "Yet I have always hoped that the ends justify my means.",
    "I had hoped to use the wand to restore the centaur race.",
    "I try to do what is necessary to protect my people, that they might live a life of virtue without fear.",
    "...and have no cause to dirty their hands, as I have.",
    "I am sorry. There is nothing more I can do.",
    "How do you feel, Sir Owen?",
    "Sir Owen...",
    "For now...",
    "Very well, but we must be cautious.",
    "Prepare for the journey ahead. Gather supplies. Leave only when you are ready.",
    "That will be problematic. You'll have to go into hiding for a time, Sir Owen.",
    "The Temple Knights will attempt to destroy you in your current state.",
    "I am putting great trust in you by relinquishing the wand, Sir Owen.",
    "Do not make me regret my decision.",
    "Now, World Guardian. I wish to reward you for your efforts.",
    "You have fought with piety, and saved Sir Owen from a fate worse than death.",
    "With your permission, I can return you to Edgeville Monastery.",
    "As you wish.",
    "What have I done?",
    "I shouldn't have used the wand in anger.",
    "I have contaminated Sir Owen's mind and body.",
    "You are probably right.",
    "I was too eager to bring Sir Owen back.",
    "I needed him too much to let death take him.",
    "Now all is lost... Though he lives and breathes, the darkness has claimed him.",
    "It is true. Thanks to the protection of Guthix...",
    "I cannot teleport you against your will, and much of my power seems ineffective against you.",
    "As you have seen, though, you are not completely beyond our reach.",
    "He is corrupted, like the centaurs before him.",
    "A creature consumed with the desire to destroy purity.",
    "No, Sir Owen. You have suffered enough.",
    "You may feel that you are in control of yourself, but the corruption will consume you in time.",
    "I must relieve you from your service to me. You cannot remain a Temple Knight.",
    "I cannot endanger my people by bringing you into their mist.",
    "You proved yourself worthy to wield the Wand of Resurrection, World Guardian.",
    "I had hoped that I could persuade you to restore the centaur race.",
    "The centaurs died fighting for me in the God Wars.",
    "I am responsible for their near-extinction.",
    "We needed to keep the wand out of Zamorak's hands, of course.",
    "You saw how the witch used its power for destructive ends.",
    "You speak of war as if it is something I enjoy.",
    "Gielinor is a precious jewel in the looted treasury of the cosmos.",
    "I will not deceive you. I have need of allies in the troubled times ahead.",
    "Since the Elder Gods brought this world into being, it has been beset on all sides, by selfish forces hungering to tear it asunder.",
    "War is here, The Edicts of Guthix have fallen.",
    "If we do not fight back against the tide of darkness, my people will be destroyed.",
    "I seek only to protect this world from outsiders, that you might eventually know peace.",
    "Very well.",
    "Sir Owen, take time to gather supplies for all of you. We shall cautiously prepare for the journey ahead.",
    "If Sir Owen is still sound of mind when next we meet, I shall relinquish the wand.",
    "Now, World Guardian. Let's discuss your reward.",
    "You fought bravely, and saved Sir Owen from a fate worse than death.",
    "With your permission, I can return you to Edgeville Monastery.",
    "As you wish."
  ],
  "Fortress guard": [
    "Captain Dulcin!",
    "You are Captain Dulcin, are you not? It's hard to tell in that helmet. Sir, why are you with a follower of Saradomin?",
    "Returned? I thought you were upstairs, sir. And why are you traveling with a follower of Saradomin?",
    "Yes, captain. It's just that I thought you were upstairs, sir. I didn't see you leave the fortress... And what are you doing with a knight of Saradomin, sir?",
    "Ah, another captive Saradominist, well done, sir! Shall I prepare a rack in the interrogation chamber for your prisoner?",
    "As you wish, captain. I shan't keep you further...",
    "Wait here, 'sir'. I think I need to have a brief word with my superior officer...",
    "Oh, he's to be sacrificed? Very well, sir, I shan't keep you further...",
    "Yes, sir! Sorry to have troubled you sir...",
    "The..tour? Wait here, 'sir'. I think I need to have a brief word with my superior officer...",
    "Captain Dulcin, sir...",
    "I'm sorry to bother you, captain, but prisoners are not permitted on the upper levels.",
    "Er...Your orders. Sir! Your orders, sir.",
    "Please continue up the stairs, Captain Dulcin.",
    "Another Saradominist captive, sir? Very well. Praise be to Zamorak. Please continue up the stairs, Captain Dulcin.",
    "Yes, sir. My humble apologies, captain! Please continue up the stairs, Captain Dulcin.",
    "Excuse me, Captain Dulcin. I cannot permit a Saradominist to access the upper levels of the fortress.",
    "Sacrificed? Sir, you stand before the altar to Zamorak. This is where we perform sacrifices.",
    "For what purpose?",
    "Another Saradominist captive, sir? Very well. May his blood unlock the weapon we seek. Strength through chaos.",
    "I see. It's a long drop from up there, Saradominist - you'll talk if you know what's good for you.",
    "How could you not know that?"
  ],
  "Lieutenant York": [
    "Captain Dulcin! Why is this prisoner not under guard?",
    "Magic, sir?",
    "I wasn't aware of you having mastery of the arcane arts. In fact, you have allowed only swordsmen to enlist a Black Knights in your fortress. Captain Dulcin would never use magic.",
    "No, sir! I merely-",
    "Absolutely not, sir!",
    "That won't be necessary, sir! Please continue, Captain Dulcin.",
    "Could you repeat that, sir? I don't think I heard you correctly.",
    "Captain Dulcin, sir? Where are you going?",
    "Guards! To me. We have an intruder!"
  ],
  "Slave": [
    "...",
    "..."
  ],
  "Heirophant Marius": [
    "Ah, Captain Dulcin. You have arrived at an opportune time. Are you ready to receive the mark of Zamorak?",
    "Don't take me for a fool, captain. It is my duty to bestow Zamorak's blessing upon his servants. Or will you denounce the lord of chaos, before your own men? Now remove your helmet, and I shall administer the mark.",
    "Splendid. Remove your helmet, and I shall administer the mark.",
    "Again you refuse the blessing of Zamorak. What are you hiding, Captain Dulcin? Remove your helmet, and accept the mark. I tire of this dance.",
    "You are not Captain Dulcin! I knew it. Imposter! We have an imposter in our midst!",
    "I will be watching you captain. You cannot hide from Zamorak's gaze. You may proceed up the south-east stairs, Captain Dulcin.",
    "Very well, Captain Dulcin. I shall await your return. Strength through chaos. You may proceed up the south-east stairs, Captain Dulcin.",
    "I will be watching you 'Captain'. You cannot hide from Zamorak's gaze."
  ],
  "Lieutenant Graves": [
    "Captain Dulcin! I have grave news... The magic circle has ceased to function, and I can find no trace of your witch. I fear our operation has been sabotaged, sir. We have lost contact with the artefact.",
    "Gladly, my lord. How can I be of assistance?",
    "The witch you hired, Captain Dulcin, to summon a gateway to the weapon we seek. She claimed to be loyal to Zamorak. I am beginning to suspect she was an agent of the White Knights.",
    "Your witch took up residence in the attic tower. You were there when she cast the ritual, captain. The ritual circle has been damaged. The gateway has vanished, and without the witch, we cannot re-open it.",
    "The weapon sir. The artefact that Lord Daquarius promised would give us the power to destroy Falador.",
    "How could you possibly not know the garb of the Kinshra elite? Our barracks share a hallway with your quarters.",
    "Yes, captain. I shall detain the prisoner while you investigate your chamber's attic tower.",
    "Captain Dulcin...with respect, sir, I must insist... Enemy agents may have infiltrated the fortress in disguise.",
    "Convenience isn't a factor, captain. Enemy agents may have infiltrated the fortress in disguise.",
    "Thank you, captain. There is much that we can learn from a Temple Knight with the right sort of persuasion."
  ],
  "Damsel": [
    "Please help me!",
    "Thank you, brave heroes! I've been trapped in this cage for days. Let me out, please...I'm so hungry. One of the Black Knights should have the key to the cage.",
    "Thank you for rescuing me! I'm so grateful. What is your name, sir/madam?",
    "You fought with great skill."
  ],
  "Dawn": [
    "I'm Dawn. I'm a sister of Saint Elspeth.",
    "A buried tomb in the frozen north. That's all I know!",
    "Saint Elspeth was a singer and musician who became a legend. She inspired Saradomin's troops with stirring songs during the God Wars. My home is the Abbey of Saint Elspeth Citharede, near Al-Kharid, which was founded in her memory. Erm... The abbey was founded in Saint Elspeth's memory, I mean... Not Al-Kharid. We devote our time to music, prayer and contemplation within the abbey's walls.",
    "I was on a pilgrimage from the abbey to Edgeville Monastery, when our caravan was ambushed by Black Knights. They slaughtered the caravan guards, and dragged us back to their fortress. Sister Lara died of infection in their horrible prison. Last week, they brought Sister Esther, Father McGruder and I up to the captain's quarters, and took us through a portal in the attic. They didn't tell us where we are. They just took our things and locked us up in these tiny cages. They've been starving us.",
    "I don't know. They've been dragging us through that door to the east, one by one. They said they'd be back for me, if Father McGruder didn't survive. If you hadn't arrived when you did...",
    "I overheard them talking about some kind of weapon they've found in the tomb, sealed behind holy wards.",
    "There was a Black Knight in a golden mask, and rich red robes. He said that they require blood. Pure blood. The blood of the virtuous.",
    "He said that the blood must be freely given. I guess that's why they're starving us, to force us to help...",
    "I'm right here, you know.",
    "I don't want to go in there!",
    "Yes, thank you.",
    "I'll wait here. I'll be fine, and I can find some food among their supplies.",
    "Through the fortress? Swarming with Black Knights?",
    "I'd really rather not. Even if I made it past the Kinshra, it's a long way back to Al-Kharid...",
    "Besides, someone needs to watch the portal in case any more Black Knights appear.",
    "I'll be fine. I hope.",
    "I'll stand guard here. If I see any more Black Knights come through the portal, I'll call out for help.",
    "So, if you hear screaming...",
    "Run back here as quickly as you can. Please?",
    "Thank you, my knight in shining armour.",
    "Thank you for retrieving the wand.",
    "With it, I shall raise an unstoppable army of the dead!",
    "Am I, poppet? How so?",
    "To restore the souls of the dead to their bodies, yes.",
    "I have little need for self-aware, living minions.",
    "The living require food, rest, shelter... They're far too high-maintenance.",
    "An army of obedient, undead warriors will be more than adequate for my needs.",
    "Technically, the wand belongs to the centaurs...",
    "Another race - like the icyene - nearly extinct thanks to Saradomin's lust for power.",
    "How amusing you are.",
    "Perhaps I'll keep you as a pet when I rule this land.",
    "How amusing you are.",
    "Perhaps I'll keep you as a pet when I rule this land.",
    "I have done my research, you know.",
    "The ghostly centaur you fought cut this horn from her dead sister's head. If you didn't listen to Fern's Story",
    "She hoped to use it to return her herd to life.",
    "The wand can only restore the souls of the dead to their bodies if wielded by one who is completely virtuous.",
    "When Fern took Elora's horn and used it, the risen dead were corrupted...",
    "The undead centaurs turned on Fern and killed her.",
    "The guardian of the wand fell short of her sister's virtue, but despite her flaws, there was still a spark of goodness in Fern.",
    "It is why she still clings to this world, a tortured spirit wracked with guilt.",
    "The undead she raised hungered to destroy that purity and tore her to pieces.",
    "I have no such impediment. My heart is as black and foul as my creations.",
    "The corrupted shall know me as one of their own, and obey my will.",
    "I shall use Elora's wand to destroy you - the brave knight and his faithful squire...",
    "The great hero/heroine and his/her faithful sidekick, then.",
    "Regardless, your noble quest is at its end.",
    "You have rescued the fair damsel, slain the terrible beast, and proven your valour to your god.",
    "Now you die.",
    "Did it hurt, to murder your comrade?",
    "Or did you destroy him without hesitation?",
    "Is he nothing more than an evil, dead thing to you now?",
    "Let's see how well you fare without your brave knight to aid you.",
    "Get away from me!",
    "Begone!",
    "Get back!",
    "Go away!",
    "You cannot hide forever.",
    "Face me, coward!",
    "*cackle*",
    "Come out and play.",
    "Are you afraid of me?",
    "Arise, my warriors! (when summoning first wave)",
    "I shall destroy you myself! (upon defeating first wave)",
    "You shall live again! (when summoning second wave)",
    "Pierce their noble heart! (during wave)",
    "If you want something done right... (upon defeating second wave)",
    "Rise from your grave! (when summoning third wave)",
    "You cannot defeat my magic! (during wave)",
    "Witness my full power! (upon defeating third wave)",
    "Forgive me, Lord Zamorak. I have...failed you..."
  ],
  "Fern": [
    "Come closer, interlopers, and face judgement.",
    "It is my sacred duty to protect Elora's wand.",
    "Leave this place, or be judged.",
    "In life, I was known as Fern.",
    "My mate, Bree, and I came here long ago from the Enchanted Valley.",
    "We fought for Saradomin in his great war.",
    "Thanks to me, the centaurs are nearly extinct.",
    "Now, I am the guardian of the Wand of Resurrection.",
    "Elora the Lifegiver was my elder sister. She was loving, honest and courageous.",
    "Elora embodied virtue. Since the day of her birth, she thought only of others.",
    "During her long life, Elora grew a horn in the centre of her forehead...not unlike that of a unicorn.",
    "Among my people, the most virtuous are granted a horn with healing powers.",
    "This is rare gift. My sister was very special.",
    "Saradomin came to the Enchanted Valley, and recruited the centaurs to fight for him.",
    "We were enamoured. Most of the centaurs left our home, and followed Saradomin.",
    "Bree and I were his generals. We led the centaurs into battle.",
    "The war against the gods raged on, for weeks, then months, then year after year.",
    "The centaur herds were decimated.",
    "We should have returned to the Enchanted Valley.",
    "Bree cautioned me to abandon Saradomin's cause, before any more centaurs died in his name.",
    "I was determined to keep fighting, and because he loved me, Bree acquiesced.",
    "I was stubborn. I was foolish.",
    "I convinced Elora to come with me to Gielinor, and aid us in the God Wars.",
    "I urged to use her power to resurrect our people.",
    "I assured her that if she did not, the centaurs would be extinct.",
    "I was determined that, if only we continued to fight, we would soon turn the tide of the war.",
    "I brought the dead and the dying to Elora.",
    "With great sadness in her eyes, she brought them back to life.",
    "I sent my people back to the battlefield, to die again in vain.",
    "Each time I returned to Elora, she appeared more fatigued.",
    "Her breathing was laboured, her movements stiff.",
    "I tried not to notice. I asked for her aid, and not once did she refuse me.",
    "Elora died exhausted, withered and worn.",
    "She poured out the last of her life to save others.",
    "I wanted to mourn her. I was overwhelmed with guilt.",
    "But I thought only of the war...",
    "What became of the centaurs who fought for Saradomin?",
    "My people looked to me, begging me to revive their loved ones.",
    "In desperation, I cut the horn from my dead sister's forehead. I used it to raise my people.",
    "I was not virtuous like my sister. I did not deserve to wield that great power.",
    "The centaurs I raised were soulless undead, corrupt and wicked.",
    "They thirsted for destruction. The corrupted set upon the living herds.",
    "The undead centaurs turned against their families, and cut them down.",
    "I could not control them. The centaur armies were destroyed by my folly.",
    "The corrupted saved me for last.",
    "I died at the hands of my creations, and I welcomed death.",
    "So deep was my sorrow and regret, my immortal spirit was tethered to my sister's horn.",
    "I cannot leave this world until the Wand of Resurrection finds a worthy successor.",
    "It has been a long and lonely vigil.",
    "The Wand of Resurrection is the horn of my sister, Elora the Lifegiver.",
    "It grants life to the dead, and can protect its wielder from harm.",
    "Only the virtuous can safely wield its true power.",
    "Anything less corrupts and changes the magic of the wand.",
    "I am no mere ghost. My spirit is bound to the wand. I am its guardian.",
    "It is my duty to judge those who seek to claim it.",
    "To this end, I must confront those who enter, and destroy the unworthy.",
    "I must ensure you have the strength, intellect, and purity of heart to bear my burden.",
    "This is a noble and virtuous goal. The sign of a true hero. However...",
    "I long for release, but I cannot blindly trust Saradomin.",
    "The gods blighted this world, diminished its people.",
    "Now the gods have returned, still hungry for power and dominion.",
    "I must test you, chosen of Saradomin.",
    "I sense that it's true. Guthix has given you the power to stand against the gods.",
    "Such power is dangerous if not wielded with virtuous intent. I must test you.",
    "Good. You await the trials with humility and patience.",
    "Perhaps you are the virtuous one that will free me from my burden. I must test you.",
    "Before you can reach the wand, I must test you in battle.",
    "You must kill me.",
    "You will merely destroy a manifestation of my immortal spirit. I will feel no pain.",
    "When a new champion arrives, I will materialise again to test their might. Such is my burden.",
    "Few have defeated me before. All of them failed the trial of virtue.",
    "I fear that none are virtuous enough to return my centaurs to life.",
    "Then I shall guide you.",
    "You merely destroyed a manifestation of my immortal spirit.",
    "I will not know the sweet peace of annihilation until I have atoned for the loss of my people.",
    "I am responsible for the destruction of my people.",
    "It is my grief for their loss that blinds me to the world of the living.",
    "Besides, my soul is bound to Elora's wand. I cannot stray far from my fetter.",
    "It will be a long and dangerous journey.",
    "You may not survive.",
    "I will be watching you, knight.",
    "If you succumb to the corruption, I shall destroy you.",
    "My people have been dead for centuries. I suppose they can wait.",
    "Saradomin speaks the truth.",
    "You merely destroyed a manifestation of my immortal spirit.",
    "I will not know the peace of annihilation until I have atoned for the loss of my people.",
    "If it were in my power, I would give each centaur the option to return to the Enchanted Valley.",
    "Because if we do not defeat the other gods, their conflict will spill out into the Enchanted Valley, to other worlds, other planes.",
    "Only Saradomin seeks to maintain order. We have to fight to preserve our way of life.",
    "Do not forget. It was the World Guardian/this adventurer, not Sir Owen who passed the trial of blood.",
    "He/she should lead the expedition."
  ],
  "'Player": [
    "Fern! I thought we killed you."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:The_Death_of_Chivalry?oldid=36162937’"
  ]
}