{
  "Player": [
    "Hey there!",
    "What's going on around here?",
    "Hey Peter!",
    "Woah there... What are you talking about?",
    "Didn't we send him away through a magical portal?",
    "King Slime?",
    "That doesn't sound good.",
    "I'll pass for now. Don't wanna get slime all over my clothes.",
    "Sure, I'll help you out!",
    "So where is the King Slime right now?",
    "What's happening!?",
    "He's bigger than I expected...",
    "I guess so?",
    "... What?",
    "... I'm really sorry Peter, but that may be the stupidest idea I've ever heard.",
    "Sorry Peter, I didn't mean to offend you.",
    "I just think we really should weigh up our options. We can look at what worked and didn't work last time. The portal was a fair success, we should probably start investigating there! ... Peter, why are you looking at me like that?...",
    "...",
    "What have you done?!",
    "... Gods give me strength. Fine. What am I doing?",
    "How do you make a giant slime monster gorgeous?",
    "A top hat... right... Where can I find a top hat we can use?",
    "Alright, I'll go pay her a visit. ... Did he say chef... costume?",
    "No, not yet.",
    "Sorry. I'll be back with the hat.",
    "Gloop Gloop!",
    "Gloop!",
    "Uh, this is going to be a tough one to explain.",
    "Have you by any chance heard of the King Slime?",
    "I'm sorry.",
    "Uh... I'm afraid I have some good news and some bad news...",
    "The King Slime fiasco is definitely behind us.",
    "It's also in front of us.",
    "I'm afraid so.",
    "Well, it's pretty much the same situation as last time, except now there's two of them.",
    "Yep, a king and a queen.",
    "Yeah, a little bit.",
    "This may sound strange, but Peter has asked me to get a top hat for the king. He has this crazy plan to make the queen fall in love with the king in the hope that they'll cease their violent ways and live happily ever after.",
    "Yeah... I'm not sure, but it's worth a shot. But anyway, I don't suppose you happen to deal in ridiculously large top hats?",
    "Uh...",
    "Right... That's actually oddly convenient. Can I borrow it by any chance?",
    "Thank you! I hope this works...",
    "I'm so sorry, I lost your famous top hat.",
    "Oh! Thank you!",
    "Alright, I'll do that.",
    "Hey Thessalia, you said you created the second largest top hat. Who's the mastermind behind the largest?",
    "I'm just curious, that's all.",
    "The one nearby?",
    "Hm...",
    "Huh?",
    "I'm sure you will.",
    "Hmm... I think this hat might be a bit big for me.",
    "Hey Peter, I got the giant top hat you asked for!",
    "I did yeah!",
    "... Peter, sometimes you say words and I don't know what they mean.",
    "Peter!",
    "Oh right.",
    "Okay, I'll take it back and see if she has a smaller one.",
    "No, not yet.",
    "I'll be back with the smaller hat.",
    "Well...",
    "Peter sent me back because the top hat is too big.",
    "I know... I don't really get it either.",
    "Well, he actually just wants you to give me a smaller top hat. One which is... regularly sized.",
    "Ah... I take it this means you don't have any smaller top hats?",
    "Damn. Okay, well, thanks anyway. I'll go and tell Peter the bad news.",
    "...?",
    "A shrinking machine?",
    "That might just work... Where can I find her?",
    "Great, that's not too far from here.",
    "What do you mean?",
    "Hmmm...",
    "Where can I find Eva again?",
    "Thank you!",
    "I should probably ask permission from Eva before using her machine.",
    "Hi, Thessalia sent me, says you might be able to give me a hand.",
    "That's great!",
    "Well, you see, I've got this giant top hat.",
    "No, it's actually for a slime king.",
    "Uh, yeah... Unfortunately, it's way too big.",
    "Yep!",
    "I was hoping you'd suggest that.",
    "First one to test it? Is this safe?",
    "Uh oh... So, how do I use this machine?",
    "How do I configure the control panel?",
    "Okay... I hope so...",
    "Thanks, I'll give it a go.",
    "Eva, we've met before.",
    "That's me... How do I use this machine again?",
    "I'm not sure i'd[sic] trust this machine to srhink this...",
    "Yes it is.",
    "Okay, I'll keep trying.",
    "Yes, this is just silly.",
    "Well, it seems to be.",
    "What do you mean?",
    "Any idea what they spell?",
    "Okay...",
    "I've lost the hat that we shrunk down.",
    "Is it supposed to do that?",
    "Okay...",
    "It sure did.",
    "Uh... I'll pass...",
    "I better get this hat back to Peter.",
    "I should probably get this back to Peter...",
    "I've got the... wee... top hat here.",
    "Is it?",
    "It's almost as if this was a stupid idea to begin with...",
    "*sigh*",
    "Do you seriously want me to go and have a conversation with the giant slime monster?",
    "Why does this not surprise me...?",
    "This is never going to work!",
    "*sigh*",
    "Not yet, what am I doing again?",
    "... Yep, that's what I thought you said. I'll be back.",
    "I can't believe I'm doing this... What did he want me to say again? Uh...",
    "Hello love what is wrong with you?",
    "Sorry Peter...",
    "Nothing useful! I don't speak slime monster! I just ended up with this chunk of slime.",
    "Oh?",
    "How?",
    "Hmmm... Actually, you may be onto something here.",
    "Alright I'll see what I can do!",
    "Oh it's just Queen Slime.",
    "I found something goopy in the cauldron that she seems to like!",
    "Yeah... were you not expecting me to?",
    "Right... So, what are we going to do with this purple goop?",
    "Alright, I'll go do that now!",
    "She definitely seems more interested this time!",
    "I guess...",
    "Wait. What is she doing?",
    "...",
    "Oh Gods!",
    "... Peter, what have you done?",
    "What do you mean we did it!? She absorbed him! I think you've created something far worse than any form of slime royalty that came before.",
    "*grumble*",
    "...",
    "...",
    "Oh! It's alive!",
    "I guess she is kind of adorable...",
    "Yeah, seems like it's not all bad.",
    "Uh, I think I'll leave that to you Peter.",
    "Good luck Peter!",
    "Hey Eva.",
    "It's great to see you too. Do you happen to have another copy of the top hat your machine produced?",
    "Not exactly... I'd just like one for myself.",
    "Is it supposed to do that?",
    "Okay...",
    "Hello.",
    "I'm not sure I like my chances a second time around...",
    "Nah, I'll leave it to you Peter."
  ],
  "Peter": [
    "'Bout ye. The name's Peter!",
    "I didn't do it!",
    "Oh, haven't ye heard? Thon King Slime fella is knockin' around again.",
    "Aye, you fellas telemeportaled him good so ye did.",
    "Aye, big blobby boyo he is. Was causin' some mischief here a while back. Lotta people popped him into one of them there magic portal thingies.",
    "But as it turns out, he didn't get too far. He was just stewin' down there in some poor soul's basement. Now he's back out and makin' a right mess of the place.",
    "Don't you be worryin' yer wee head. Peter's got a plan, gonna get this situation under control. Though, wouldn't mind a hand though if yer offerin'.",
    "Suit yerself, Peter's got this.",
    "Suit yerself, Peter's got this.",
    "Changed yer mind about takin' down this blobby boyo?",
    "Happy days!",
    "He can't be too far...",
    "Speak of the devil!",
    "Yep... So, are ye ready to hear my grand idea to get rid of 'im?",
    "Alright, picture this... Queen Slime.",
    "Think about it fer a minute. What's the only thing that can tame a big blobby boyo? A giant gloopy gerl! They'll fall in love and the two of 'em will live happily ever after. Awk, it'll be so romantic so it will.",
    "Oh...",
    "Awk, I was fairly sure ye would love the idea.",
    "Well, I guess we're going with my plan then!",
    "That's the spirit! We need to introduce them, but he could do with a wee bit of a sprucin' up. We gotta get him all gorgeous for his wee date.",
    "Awk, I dunno, get him a wee hat or something. Aye! That'd do it! Pop a top hat on his wee head up there and before ye know it the two of 'em will be saunterin' off into the sunset.",
    "I'd go have a chat with Thessalia over in the clothes shop in Varrock. She's a wee dote, sorted me out with this chef costume so she did.",
    "Did ye get it?",
    "Fer dear sake, head on over to Thessalia in Varrock and get a top hat for our boy here. Yer standin' in the way of true love here.",
    "'scuse me. Did you say you got our slime boyo a giant top hat?",
    "Fer dear sake, what part of get him a wee top hat did ye not get? He's gonna look a buck eejit in that thing.",
    "He's gonna look daft so he is! Right, you listen here now. You take that right back to Thessalia and I want you to give her a right tonguin'.",
    "Would you wise the bap, it means a tellin' off.",
    "That thing's ridiculous, what kind of size of top hat is that supposed to be.",
    "Ye better!",
    "That you sorted?",
    "Well ye better get on over to Thessalia right now. That bloomin' hat was desperate.",
    "Would ye look at that, that's class.",
    "Let's get it to our boy and let them get down to courtin'. C'mere handsome!",
    "That's it big lad! I think it's workin!",
    "No!",
    "Awk, son...",
    "Awk, his poor wee heart's broke. I was sure that was gonna work.",
    "'Scuse me, I've had enough of your negativity. Clearly, there's nothin' wrong with the plan. There's just something else around here that's takin' her fancy.",
    "Sure, go have a wee chat with her, maybe she'll tell ye what's got her so distracted.",
    "Aye, I'm deadly serious.",
    "Look, you just dander over there, give her a friendly poke and say... 'Here love, what's the matter with ye?' She'll open her wee heart to ye and let ye know what the craic is.",
    "Awk, don't knock it 'til ye try it. Off ye go now!",
    "Have ye figured out what's distractin' her yet?",
    "Go on and sweet talk Queen Slime to find out what's distractin' her. Just a wee poke and some kind words ye know?",
    "Fer dear sake, quit playin' around would ye?",
    "Well, what'd she say?",
    "Oh!",
    "Maybe we can use that.",
    "Well, that's just a piece of the queen herself right? Surely if she's bein' drawn to something, then it'd make sense if a piece of her slime would be too.",
    "Aye, ye see, not just a pretty face. Use the chunk of slime around the place and see if it's being drawn anywhere in particular. Also...",
    "Here, ye can have my favourite bucket so you can. Never know when ye might need it.",
    "Thon bucket I gave ye earlier might be of use.",
    "Ye did?",
    "Uhhh, ye, I was! I knew somethin' around here was distractin' the big gerl.",
    "Hmmm... Alright, what if we just splashed it over our boyo? Ye know, like one of them colognes. He'll be smellin' right and fancy. She'll be wild keen on him after that I'd bet.",
    "Oh this is lookin' promisin'[sic] Go on my son!",
    "Aye! And why wouldn't she be? Just look at 'im! Our fella's looking wild dapper and got the smell to back it up!",
    "Yes!",
    "Go on ye gerl ye!",
    "...",
    "Uh oh...",
    "... Well we did it!",
    "Awk! Would you lighten up! The King Slime is no more and look, Queen Slime's headed off on her holidays! And you know what, if I were a bettin' man, I'd say we'll never see nor hear from her again.",
    "And look, she was so happy she's left us a pressie! There's a swanky new top hat for me. And you can hold onto that bit of pink slime!",
    "Don't worry about it, you've earned it.",
    "Oh would ye look at that, this is a fine wee hat so it is. Are you enjoyin' yer wee bit of slime?",
    "Awk, well aren't you a wee dote! I think she likes you!",
    "And there was you, sittin' complainin' and all that. All's well that ends well.",
    "Now that's all over... How's about we hit the town and find me a lassie?",
    "Ye sure? Suit yourself!",
    "Who needs luck when you've got a fancy hat like this?",
    "Ye sure I can't interest you on a wee night on the town?",
    "Your loss!"
  ],
  "Thessalia": [
    "Hi there, how can I help you?",
    "I'm listening.",
    "How could I not have? I still have nightmares of the chaos he caused in Rimmington. As I lie in bed at night sometimes I can still hear the GLOOP GLOOP GLOOP...",
    "It's okay. It was just such a tough time for Gielinor. I'm just glad that it's all behind us.",
    "What's the good news?",
    "And the bad news?",
    "No... You can't mean..?",
    "*Sigh* Tell me everything.",
    "Two... slimes?",
    "... I swear, has that imbecile been messing around with his jelly again?",
    "*sigh* Okay, what do you need from me?",
    "I guess that could work?",
    "Well, actually, it's funny you should say that. You'd have to have been living under a rock to not have heard of my world record attempt.",
    "I'm well known around here for being the creator of the second largest top hat in Gielinor. OF ALL TIME.",
    "Go for it, anything to save Gielinor.",
    "Good luck!",
    "Not to worry, I have plenty of spares.",
    "Hey again, you really should take that top hat back to Peter and see what he thinks.",
    "... Why does that matter?",
    "It was that guy over in the fancy dress shop.",
    "Shhhh... He might be listening.",
    "YES! THAT'S RIGHT! I AM GIVING UP ON THE LARGE TOP HAT GAME, THERE WOULD BE NO NEED FOR ANYONE TO CREATE ANY MORE LARGE TOP HATS.",
    "Oh, I'll get him next year.",
    "Did the plan work? Please tell me it worked.",
    "Well?",
    "Too big? How can it be too big!? It's for a massive Slime King!",
    "What does he want me to do about it anyway?",
    "But I specialise in giant top hats! Peter knows this!",
    "No. I do not.",
    "Sorry... Wait. EVA.",
    "I have an idea. Eva has been building a shrinking machine.",
    "Yes. Maybe you could use it to shrink the top hat I gave you to a normal size?",
    "She was setting up her machine in East Varrock. I believe it's in one of the buildings just south of the bank.",
    "Just be careful. And don't blame me if something goes wrong.",
    "Oh, nothing. I'm sure everything will be fine.",
    "Ah yes, she's in East Varrock, try the building just south of the bank."
  ],
  "Eva": [
    "Hey there. It's not normal for me to get visitors!",
    "Oh! Thessalia! She's a great companion of mine. A friend of Thessalia is a friend of mine indeed!",
    "So, spit it out. What am I doing for you?",
    "That is indeed a very large top hat, probably the second largest I've ever seen! Is it for me?",
    "Oh, that's disappointing.",
    "Too big you say?",
    "Oh! Oh! This is perfect! You could shrink it using my machine!",
    "Oh, this is fantastic! You can be the first one to test it!",
    "I am 100% certain that it is probably very safe. Maybe.",
    "It's simple! Just configure the control panel and you're good to go.",
    "Pull some levers, push some buttons, it's not too complicated, you'll figure it out! If you do it wrong it'll tell you how many of the inputs you got correct. Or it will explode. I think it'll tell you about the inputs though.",
    "Yeah, just keep fiddling with it and eventually you'll get what you want!",
    "Hi I'm Eva, how can I help you?",
    "Have we? Oh yes! You're Thessalia's companion.",
    "Is that machine of mine causing you some trouble?",
    "Hmm.... I'm sure the correct configuration had at least something to do with the machine's intended functionality...",
    "Excellent! I'm sure you'll figure it out friend.",
    "Are you still having problems?",
    "I really didn't think it was that difficulty[sic] to operate...",
    "Oh! I'm sure it spelled something!",
    "The first letters. I'm sure they spelled something!",
    "I don't know... No. Just try some words. I'm sure they'll work.",
    "Excellent! I'm sure you'll figure it out friend.",
    "Well, I've got some goods news. Just after you left, my machine spat out another top hat.",
    "I don't know. Probably... Yes!",
    "Did it work?",
    "Splendid! Now that we know it works, how would you feel about shrinking yourself down so you can ride around in my pocket?",
    "Awww, let me know if you change your mind.",
    "Oh, hello! It's marvellous to see you again.",
    "Why, did you lose yours?",
    "Well, I've got some good news. Just after you left, my machine spat out another top hat.",
    "I don't know. Probably... Yes!"
  ],
  "Hetty": [
    "What is that slimy monstrosity, and why is it so interested in my cauldron?",
    "Peter..."
  ],
  "Congratulations! You have completed": [
    "'Once Upon a Slime'."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Once_Upon_a_Slime?oldid=35919768’"
  ]
}