{
  "Player": [
    "Kennith? Is that you?",
    "You look..taller.",
    "But you're MUCH taller.",
    "That's it? You just...grew?",
    "I don't think it quite works like that.",
    "How are things in Witchaven?",
    "What do you need help with?",
    "What are you doing here?",
    "Sir Tiffy?",
    "Count me in. It's time we dealt with the slug threat!",
    "Sorry, I'm a little bit busy right now.",
    "Others?",
    "Kennith, what's s going on here?",
    "Savant? What did she find out?",
    "How do we stop the queen's mind control?",
    "Why are you here?",
    "I've got to admit, it'll be good to have you on our side this time.",
    "How do we stop the queen's mind control?",
    "I still can't get over how tall you are.",
    "Old?",
    "Ezekial! What are you doing here?",
    "What do you know about this mission we're on?",
    "Why are you here?",
    "Explosives?",
    "You're looking...healthy.",
    "You know that your diet probably has something to do with your skin tone. When did you last eat some fruit?",
    "What are we doing at Daemonheim?",
    "..we can use this creature against her.",
    "Why are you here?",
    "I meant nothing by it. It's good to have you along.",
    "Earlier, you mentioned 'Uncle' Tiffy.",
    "I'm ready, let's go!",
    "What should we do now?",
    "How are you doing?",
    "How's the family?",
    "What about Kimberly? Have you two become friends?",
    "So, you and Kimberly, eh?",
    "Haha, I'm just messing with you.",
    "How did you get so good at magic?",
    "Not magic? But you can teleport, cast spells...",
    "Could you teach others to cast spells like you?",
    "What should we do now?",
    "How are you doing?",
    "What have you been up to?",
    "But who are your customers? Everyone in the village is a slave to the sea slugs!",
    "How did you make these explosives?",
    "Has Kennith been causing any trouble?",
    "Yeah, I noticed.",
    "You said Kennith wants to impress me?",
    "What should we do now?",
    "Wow, that's a pretty specific task to get from a seer.",
    "How are you doing?",
    "How did the Temple Knights figure this out?",
    "What happened to Col. O'Niall?",
    "Poor guy.",
    "Sir Tiffy is your uncle?",
    "What happened to your family?",
    "Uh...",
    "Kennith, you're up!",
    "Great work, Kennith!",
    "Ezekial, you're up!",
    "Great work, Ezekial!",
    "Eva, you're up!",
    "Great work, Eva!",
    "What should we do now?",
    "What should we do now?",
    "An actual sea slug. I was afraid you'd say that.",
    "Let's go!",
    "An actual sea slug. I was afraid you'd say that.",
    "So, we can't just bash one of these fishermen on the head?",
    "Not just yet. Let me look around for a bit, first.",
    "You go on without me. I'll meet you there.",
    "Hey, Bailey!",
    "Oh no!",
    "Bailey, what happened?",
    "I doubt that very much.",
    "Can I borrow some of your blood, please?",
    "No reason, forget I asked.",
    "So, you don't feel pain?",
    "No pain? Prove it.",
    "Uh, thanks for the demonstration.",
    "Just checking if you're pain resistant!",
    "What's in there?",
    "Why can't I come in?",
    "Look over there!",
    "Hmm, it was worth a try.",
    "I think we've got all of the serum ingredients.",
    "How did you...?",
    "What's in there?",
    "Wow! Look over there!",
    "Never mind.",
    "Why can't we come in?",
    "I'm not a stranger.",
    "I released your queen from imprisonment.",
    "I wouldn't say he was 'fair'.",
    "I wish to pledge my allegiance to your queen.",
    "We met by the lake in Falador. You held my hand, and in the light of the moon we...",
    "I AM YOUR FATHER!",
    "I seek enlightenment in the joining.",
    "I wish to feel the...uh, drips of knowledge.",
    "I wish to see the...slime of...er...splendour.",
    "I wish to smell the...scent of victorious rule.",
    "I wish to taste the... erm... Do you guys even eat?",
    "I wish to hear the voice of our queen, strong and clear.",
    "What is it?",
    "What should we do now?",
    "You make it sound so easy.",
    "Could you teach others to cast spells like you?",
    "A box. Got it.",
    "Uh...right. How big is this box?",
    "The four wa-? Are you messing with me?",
    "How did you get in touch with Tiffy?",
    "Wow, that's pretty lucky.",
    "You don't seem to get along well with Eva.",
    "I think I am too!",
    "What should we do now?",
    "You said Kennith wants to impress me?",
    "What do you think of Eva?",
    "Yeah, I get the feeling there's more to her than meets the eye.",
    "Me?",
    "She's nice. And really strong. That shield weighs a ton!",
    "She's uh...",
    "Let's change the subject.",
    "She's a bit grumpy.",
    "What should we do now?",
    "Got it.",
    "What happened to your family?",
    "It's okay.",
    "That's terrible. I'm so sorry.",
    "What's it like to be a full-time Temple Knight?",
    "Sorry about that.",
    "What do you think of Ezekial?",
    "He does like to make friends.",
    "I've noticed you're not a fan of Kennith's abilities.",
    "He's grown up a lot.",
    "Hmm.. what is this?",
    "There's a hole in this side.",
    "There's something in here. A mechanism, maybe.",
    "Let's try a different angle.",
    "Second time lucky?",
    "Woop!",
    "Fingers crossed!",
    "I think I've got it!",
    "Let's do this!",
    "Your days of manipulating others are over!",
    "What the-",
    "...",
    "...aaaagh...I...I must...",
    "Aaaaaagh!",
    "Good hit, Eva!",
    "Like my head went through the sawmill.",
    "Uh..hello?",
    "I, uh...",
    "It's okay, it was just a dream.",
    "I'm right here. Rest your eyes.",
    "The nightmares are gone. You can sleep.",
    "I'm afraid your father/mother isn't here.",
    "My name is Player. We came here to defeat the Slug Queen. She was holding you captive.",
    "Are you okay, brother?",
    "Not from where I'm standing.",
    "Uh, that's a long story. Don't worry, we'll get you out of here soon. Have faith.",
    "How do you feel, mayor?",
    "Karamja Rum. Sure...",
    "What should we do now?",
    "Is that such a bad thing? The people of your town are finally free.",
    "How are you doing?",
    "What should we do now?",
    "Do you think that's the last we'll see of the slugs?",
    "How are you doing?",
    "What should we do now?",
    "Couldn't have done it without you...and the others.",
    "And Kennith?",
    "How are you doing?",
    "Well done, everyone. The people of Witchaven are finally free!",
    "So, what will everyone do now?",
    "And you, Kennith?",
    "..."
  ],
  "Kennith": [
    "Player! I've been wondering when you'd show up.",
    "People grow, don't they? It's not that unusual.",
    "... Well, if you must know, after all that mess with Kimberly, I did some thinking. I realized that I'd been acting childish, that it wasn't doing me any good. I guess I just felt like growing up.",
    "Of course! That's how everyone does it, right?",
    "Not so great. Bailry and I were at the Fishing Platform when... well, that's why I'm here. We need your help.",
    "Well, this old guy approached me...",
    "An old guy in white armour told me I could find you here. I think his name was Tefal, or maybe Tiffin.",
    "That's it: Sir Tipsy! He said we were needed for an important mission, killing the Slug queen or somesuch. What do you say?",
    "Great stuff! I'll meet you and the others somewhere a little more private.",
    "Okay, never mind. Come back when you're free.",
    "Let's get the others involved!",
    "Well, I don't know much, but some woman named Savloy found a way to beat the slugs once and for all.",
    "I think it was a way to combat the Slug Queen's mind controlling abilities.",
    "I'm not too sure of the details. Perhaps the girl can tell you more. If she's not busy playing with her hair, or something.",
    "Haha! To stop you all from dying, of course! That old Sir Tipple guy said my abilities would be necessary.",
    "I'm not too sure of the details. Perhaps the girl can tell you more. If she's not busy playing with her hair, or something.",
    "I can't get over how old you are.",
    "Haha! You should see the look on your face!",
    "Just get on with it.",
    "Hi! How can I help?",
    "We need to get our hands on a 'seeker gland'. And not just any seeker gland. A powerful creature once lived here. We should seek it out.",
    "Good, I reckon I'm certainly feeling okay.",
    "Fine, I guess. The slugs won't come into our house, so they're safe.",
    "I uh..she's okay, I guess.",
    "What? I didn't say..uh...",
    "Oh, right, sure.",
    "Well, to me it's not really magic.",
    "Yeah, but to me it's as easy as breathing. You just call it 'magic' because you don't understand why it works.",
    "I could try. Ask me again later. We've got a job to do.",
    "What about that thing?",
    "Don't listen to those chumps. Pick me! You know I'll get the job done.",
    "Good choice, Player. I'll have this done in no time.",
    "Nothing to it.",
    "You picked him? Why the...!",
    "You picked her? Why the...!",
    "Picking the girl *grumble* Silly... long hair...",
    "There's still a few more things we need for the anti-mind control serum. A live specimen.",
    "And the blood of a thrall, freely given. Giving the blood freely has an effect on the composition of the serum.",
    "Are you ready to head to the Fishing Platform?",
    "Settle down. Would you rather walk? Ah, Player. Good to see you made it in one piece. Let's get straight down to business. We need a couple more ingredients for an effective defence against the queen's mind control. Firstly, we've got to catch a live specimen.",
    "Secondly, we'll need the blood of a thrall, freely given.",
    "Unfortunately not. Giving the blood freely has an effect on the composition of the serum.",
    "No problem. Just come speak to me when you're ready.",
    "If you insist. See you later.",
    "Brilliant. Here's the seeker gland.",
    "Now, you just need to mix them using a pestle and mortar. I think I saw one on the table in here.",
    "Excellent, the serum seems complete. Good work! Now, let's get to the citadel.",
    "You lost the seeker gland, didn't you?",
    "Never mind, here it is.",
    "Haha! Busted!",
    "Yeah yeah, we get the picture.",
    "Me? Oh, I'm not here. You have no problem with me.",
    "Hi! How can I help?",
    "Put an end to the Slug Queen, I guess.",
    "It always is!",
    "I might, but they'd need to see it as I do. Imagine a box.",
    "This box contains everything you can perceive with your physical senses. Sight, touch, smell. You need to think outside of that box.",
    "Not very big, but that's unimportant. The box has four walls, and it's behind the fourth that your answers lie.",
    "Haha! Never mind.",
    "Some might call it coincidence. After the mess at the Fishing Platform, I came looking for you, but wasn't sure where to start. After a while, I ended up in a city with white walls and knights. I stopped for a break on a park bench. An old man there offered some tea and we got talking. It turns out he knew of you, and Ezekial, and the slug menace. He gave me a glass orb and told me I should wait at 'Daemonholmes' or something. That's about it.",
    "Luck, uh...yeah, sure.",
    "She started it! She's afraid of what I can do.",
    "Yeah, but she looks down on me...like I'm a kid. Silly long hair, hitting things with a large piece of metal. Neanderthal!",
    "There's nothing else in the room. Perhaps it controls the doors?",
    "Ezekial and I can take the serum. You two just, uh... distract her.",
    "We'll see about that.",
    "Why don't you be good and open this door for me?",
    "You ready, Ezekial?",
    "Yeah, I'm pretty sure she's not getting back up.",
    "She didn't need to hear the truth. You did a good thing.",
    "That was horrible...",
    "Hi! How can I help?",
    "Mission complete. Time to head home, I guess.",
    "Yeah, but...I was really starting to enjoy myself. The life of an adventurer. Your life... I need to think.",
    "Good, I reckon. I'm certainly feeling okay.",
    "Thanks, Eva. You did well too, I guess.",
    "I've been giving it some thought, and I don't think I'm ready to head home just yet. There's more adventure to be had. I may go see the Wizard's Tower. Who knows? Maybe Sir Taffy will have some more work for me."
  ],
  "Ezekial": [
    "I was just wondering that myself. One moment I'm eating a tuna sandwich in my house, the next I'm standing here! Worst thing is, my sandwich didn't come with me.",
    "We're on a mission? Fantastic!",
    "Oh, I assumed I was brought here for my experience in explosives.",
    "Yeah! What did you think I was doing with all that rubium ore we found?",
    "Thanks! It's the tuna sandwiches. Can't get enough of them.",
    "What's a 'fruit'?",
    "Roger that Foxtrot, Tango, uh...Whiskey!",
    "Okay, stand back!",
    "Door's open, let's go!",
    "Fire in the hole!",
    "Hey Player!",
    "Haha, don't ask me! I'm just along for the ride.",
    "Good, I think. Perhaps a little peckish.",
    "I've been keeping busy: fishing, running the shop. Business has been good.",
    "Yeah, but they still need bait! Everyone needs bait!",
    "The key ingredient's that rubium ore we found. As you saw, it reacted with water, so, I thought, what else might it react with? Suffice to say, I found something more... uh.. Volatile.",
    "Nah, not really. He's spent most of his time at the Fishing Platform, helping to manage the slug problem. He's been growing up so fast.",
    "You know, he really looks up to you. I think that's a reason for his change in attitude. He wants to impress you.",
    "Yeah, but let's not chat now. We've got a mission to complete.",
    "What is that thing?",
    "I could do that if you like. The thing looks fishy, and I'm pretty hands-on where that's concerned!",
    "Wow, thanks, Player! I won't let you down.",
    "Cheers, Player, any time.",
    "You should speak to Bailey. He's a good chap and can probably help us out.",
    "Ahem! Greetings, my brethren. Pray, may we enter this glorious place such that...",
    "Ooh, what is it?",
    "Uh...yeah. The pain of this existence is too much to bear.",
    "Hey Player!",
    "Haha, don't ask me! I'm just along for the ride.",
    "Yeah, he's been asking after you, especially since things got interesting at the Fishing Platform. Looks like he went halfway across the world to track you down. And now we are here. He's certainly persistent.",
    "She seems nice, very strong.",
    "She doesn't like Kennith, though. Don't think she trusts him. What do you think of her?",
    "Yeah?",
    "Haha! Perhaps a little. Maybe she has a lot on her mind.",
    "What could go wrong?",
    "But Player!",
    "We've gotten this far, haven't we?",
    "Are you sure?",
    "Hurry up and get into position Kennith!",
    "Always.",
    "We did it!",
    "Player, you need to see this.",
    "What should we tell her?",
    "Hey Player!",
    "Well, the queen is dead, the villagers have regained their senses, and I'm really hungry. I guess we head back to the surface.",
    "Did you not see the squishy mess Eva left behind? The Queen's dead, and, without her, the slugs are merely molluscs. Witchhaven and the Fishing Platform can finally return to normal.",
    "Good, I think. Perhaps a little peckish.",
    "We did it!",
    "I've got to get back to my shop. I wonder if my tuna sandwich is still there.",
    "Haha!"
  ],
  "Eva": [
    "Damned mages, with their magic and their teleports and their- Oh. You're Player, right?",
    "I'm Eva. Uncle Tiffy always said you were to-the-point. That's good.",
    "Hah! Uncle Tiffy always said you were friendly. I'm Eva, by the way.",
    "The Temple Knight seers have located a strange beast within the dungeons. They say it has its own live mind, which should counteract the Slug Queen's mind control. Since mind controlling her thralls is one of Mother Mallum's greatest weapons...",
    "Exactly!",
    "Not you as well. I may be a woman, but I can wield a sword just as well... No, better han any other Temple Knight! I've been following your progress through mission reports, so when the call came, I volunteered to fight by your side.",
    "That's enough chit-chat. Let's get ourselves into this dungeon!",
    "Ezekial, you're up!",
    "Player. What can I do for you?",
    "The seers spoke of a 'Seeker of Truth' within Daemonheim. Withing its body, we can find a gland that is critical to this mission.",
    "They've done their part. The rest is up to us.",
    "I...I'm fine, thank you.",
    "It was the seers. I'm not sure how they do what they do, nor do I care to find out. All I know is that my blade is needed here.",
    "His is not a happy tale. We managed to recover him, but not before he was taken as a slug host. The parasite's feelers went too deep and couldn't be removed safely. I know they interrogated him, but I don't think they revealed much.",
    "We're all soldiers and he knew the risks. But you're right, he didn't deserve this.",
    "I...well...yes. After my parents..He raised me as his own. When I was old enough, I enrolled with the Temple Knights. Uncle wasn't happy and wanted to protect me, but I know this is where I need to be. There's too much..bad in the world. Someone has to face it.",
    "Uh, perhaps now isn't the time.",
    "Hmm, this isn't the creature we're looking for.",
    "That's it! It doesn't look like this fella's going to let us past. Player, take my shield and draw its attention. I'll sneak around and get to the other side.",
    "The kid? I hope you're sure about this.",
    "It looks like we got what we came for.",
    "A wise decision. Let's do this!",
    "All in a day's work.",
    "Good job with the gazer. We managed to get what we came for. I think Kennith wanted to speak with you.",
    "We need to put together the serum, but... I'm not so great with potions and magic. Perhaps Kennith can tell you more.",
    "Looks like we're done here. Chat to Kennith.",
    "Wait...what? Aaaaa...",
    "...aaaaiiii!",
    "If you use your magic on me again, I swear I'll...",
    "What he said.",
    "Enough fooling around. Let's go.",
    "Oh no...",
    "They're using the risen corpses of our fallen comrades, reanimating long-dead White Knights to protect this fortress. We need to put a stop to this. We need to lay them to rest, so their bodies cannot be abused any longer!",
    "Player. What can I do for you?",
    "There's only one thing to do. Put an end to the queen's vile existence.",
    "It's time to take the fight to the enemy. The vile parasites are using corpses to do their dirty work. We should avoid harming the villagers, but don't be afraid to put the risen knights to rest.",
    "I don't normally talk about that. Not even to uncle.",
    "No, I... They were killed. When I was young.",
    "I was young, but I...I remember. This is why I fight for good. So that no one else should feel how I feel.",
    "Early hours, intense physical training, study. I've found time to keep up-to-date with your mission reports. Tracking down Solus Dellagar; the unfortunate release of the Slug Queen.",
    "You'll get a chance to put it to right. I'm sure.",
    "He's nice enough. Quite a friendly chap.",
    "Perhaps, if he bathed more, he'd find it easier.",
    "Mages put me on edge. And he's too willful.",
    "Perhaps, but he's got a lot to learn. He should be enjoying his innocence, not rushing to dispense with it.",
    "What're you doing?",
    "Uh...we'll get this.",
    "About time!",
    "This is it. Beyond here lies the lair of the Slug Queen. She's gonna be tough, until we can get this serum onto her.",
    "Your death, that's what. You underestimate us!",
    "Quickly, while she...it...they're distracted. You must find a way behind them! Hit them with the serum!",
    "Go! I'll hold back the knights!",
    "They're weakening! Now's our chance!",
    "Fine by me!",
    "Player? Is that you?",
    "Bring it on!",
    "Aw, not magic!",
    "Oof!",
    "...Player?",
    "How are you feeling?",
    "Stop whining. You threw me into a pillar!",
    "She must have been a child when the queen took her!",
    "Player. What can I do for you?",
    "I think we're all done here. Y'know, you did pretty well. I'm impressed.",
    "I'll admit, Ezekial is pretty tough.",
    "I guess he's not so bad either.",
    "I...I'm fine, thank you.",
    "Yeah, it was only by working together that we could achieve this victory. You too, Kennith.",
    "I've got to get back to the order and fill in the paperwork. I'll say hello to Uncle Tiffy for you.",
    "It's Tiffy.",
    "Oh, while we were inside Daemonheim, I left a cache of ammunition. It's still there, if you'd like to make use of it."
  ],
  "Player [Plain]": [
    "Yea, that's me. You are?"
  ],
  "Player [Polite]": [
    "Yes, that's me. Pleased to meet you."
  ],
  "'Eva": [
    "Er, that's a long story. Now is not the time. Ask me again later."
  ],
  "Elfinlocks": [
    "Hex bow! woot!",
    "?!"
  ],
  "Qutiedoll": [
    "Dude! This gatestone's goin on the GE!"
  ],
  "Bailey": [
    "Greetings, Player. This one has been waiting for your return.",
    "This one sought enlightenment in the joining.",
    "The yellow-coated one was absent, and the voice of our queen was strong and clear. This one left his kitchen seeking sustenance. By the edge of the blue, we embraced him. Stranger no longer, this one is now brother and son. He is welcomed. You will be welcomed.",
    "This one does not understand why you would want it.",
    "Your efforts are wasted. This one does not feel pain.",
    "This one is not sure what you hope to gain.",
    "You are correct. This one's existence is peaceful. Bliss.",
    "This one would do so gladly.",
    "As you can see, blood was drawn, but this one felt no discomfort.",
    "This one is not sure what you hope to gain."
  ],
  "Slug Thrall #1": [
    "An unbeliever comes to our doorstep.",
    "Beneat the blue, lies our true home.",
    "You are not one of us.",
    "..."
  ],
  "Slug Thrall #2": [
    "Our house is not open to you, thinker of thoughts.",
    "Beneath the blue, our brethren wait.",
    "Beneath the blue, sits the throne of our queen.",
    "No stranger may gain entry to our home.",
    "..."
  ],
  "[Note": [
    "It's the other Slug Thrall talking when there's a line break]"
  ],
  "Slug Thrall": [
    "You are not one of us. No stranger may gain entry to our home.",
    "Beneath the blue our brethren wait.",
    "Beneath the blue, lies our true home.",
    "Beneath the blue...",
    "You are not one of us.",
    "No stranger may gain entry to our home.",
    "We do not recognize you.",
    "It is he/she!",
    "Then you also slew our fair prince.",
    "We require no empty promises. All will join us in time.",
    "the previous actions of this body is no longer of interest to us.",
    "... Begone.",
    "Go on.",
    "It confuses me.",
    "You do not speak our words. Begone.",
    "It speaks our words.",
    "You all wish to join?",
    "Then worry no more, our glorious queen offers relief. You may pass, future brethren.",
    "Wait. What about that one?",
    "He is not here.",
    "We have no problem with him."
  ],
  "Option": [
    "- She's nice.",
    "- She's pretty.",
    "- She's a bit grumpy."
  ],
  "Mother Mallum": [
    "Haha! You are fools to come here!",
    "You have spirit, but what could you possibly hope to achieve?",
    "And you underestimate me!",
    "This one is strong. It...",
    "You will submit!",
    "Silence! This body will respond to my command alone!",
    "You dare touch us?"
  ],
  "Mayor Hobb": [
    "While I stand, you will not pass!",
    "Why is her voice so quiet? I cannot allow you to further harm my queen!",
    "While I stand, you will not pass!",
    "I'b no idea where I ab! I'av a broken dose, and some stranger ib talkig to me like I know her. I ab never drinking Karabja Rum ever again!"
  ],
  "Brother Maledict": [
    "You'll never defeat our queen!",
    "Yes...uh...ah...what are you doing?",
    "N..argh..yes...master!",
    "Am...am I dead?",
    "Wh..where am I?"
  ],
  "Lucy": [
    "Dad/Mum, is that you? I can't see you, my eyes are still sleepy.",
    "I had a nightmare, daddy/mummy. It was horrible, and I was scared.",
    "I wanted to wake up but couldn't...",
    "I...I feel so tired.",
    "No more nightmares?",
    "Thank you, I'll just...I...",
    "But I... who are you?",
    "The slugs from my nightmare! No... I want to go home, I want my daddy/mommy... I..."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Salt_in_the_Wound?oldid=35392725’"
  ]
}