{
  "This transcript or section is incomplete and could do with improvement.Reason": [
    "missing dialogue if the player doesnt have lvl 40 prayerYou can discuss this issue on the talk page or edit this page to improve it."
  ],
  "Awusah the Mayor": [
    "Many salutations to you [sir/madam], what brings you to our little town?",
    "Hmm, well that could be quite fortuitous. We really could do with some help here. Our town seems to have come under a curse, and we are desperate to get it removed.",
    "Well first of all our fountain, which has served us for many years, suddenly dried up. We then started transporting water from the river, but what we carried would always have completely dried up by the time we got it back to the village.",
    "Well it's tough. There is a guy who calls himself Malik the carter down in the market. He's from Pollnivneach, so the curse doesn't seem to have affected him. He's got a cart full of water which he's selling to the people here.",
    "Unfortunately in typical Pollnivneach style he's taking the opportunity to sell the water at outrageous prices because he knows we are desperate. Oh and Rokuh has developed something quite remarkable, called a choc ice which is helping people stay cool.",
    "Well we think it was because we were negligent in our duty to protect a priest of Saradomin. He came to us a few weeks ago from the north and we welcomed him into our town. He taught us much of the wisdom of Saradomin.",
    "Then about a week ago, we found him dead by the river. It seems unlikely that it is coincidence we were then cursed. If you look around the town you might be able to find out more.",
    "Good luck to you.",
    "Well we've not fallen on the best of times here, but there are a few shops to look around and we have someone selling a marvelous new invention called a choc ice..[sic] Oh, and there's the old temple if you're interested in a bit of history.",
    "Oh you don't want to go there at the moment. I hear rumours of plagues and the like down there, I think they've closed off the city anyway.",
    "Many salutations to you [sir/madam], have you made any progress in uncovering the reasons for our curse yet?",
    "Please try your best, that water salesman is not doing much good for the economy of our town.",
    "Look around this town, see if you can uncover any information to why we were cursed and how the curse might be lifted. I suspect that it might be because a priest of Saradomin died while staying at our town, but that isn't much help in getting the curse lifted and it is possible I'm wrong anyway.",
    "Well I hope somebody can find the time soon, the despair of the people of this town increases daily.",
    "Many salutations to you [sir/madam], have you made any progress in uncovering the reasons for our curse yet?",
    "The Spirits of the Elid? I wasn't even sure if they weren't some old wives tale. Why would they do such a thing?",
    "Oh that old thing. Yeah, the priest of Saradomin said we should get rid of that. He said we should become followers of Saradomin, and therefore we wouldn't need it.",
    "Gasps!",
    "Ohh that's not so good if only we hadn't thrown the statue away, we wouldn't have this water problem then. He was a very convincing priest though. He worked many wonders, for example if he prayed hard enough he became impervious to arrows. The way of Saradomin did seem very appealing.",
    "Then truly you are very powerful too!",
    "Ohh there's a strange deep crevice in the desert to the west of here. We threw it down there. I don't know if it's lost forever or not.",
    "If you could retrieve it for us we'll be very grateful. Even if it doesn't give us our water back, maybe it'll calm Shiratti down, she was not pleased at it being thrown away and she's been grumpy ever since.",
    "Have you had any luck retrieving our statuette yet?",
    "Good luck, may Sarad..[sic] errm I mean Elidinis guide you.",
    "In a deep crevice to the west of this village.",
    "Have you had any luck retrieving our statuette yet?",
    "What! That's just asking too much. So, he wants to have my soul when my time to die comes?",
    "That's barbaric! I simply refuse. The price is too high. We'll just have to find other ways to get the town a good supply of water. Don't go bringing any knives near me.",
    "What do you think you are doing?",
    "What, have you lost your mind?",
    "That's barbaric! We'll just have to find other ways to get the town a good supply of water. Keep your knife away from me please.",
    "Hey, leave my shoes alone!",
    "Have you had any luck retrieving our statuette yet?",
    "I suppose sacrificing a pair of shoes for the greater good of the town is reasonable. I don't begin to understand the ways of genies.",
    "Anyway thanks for getting the statue back. You should take it to our temple and then we can see if our fountain starts working again.",
    "Have you had any luck retrieving our statuette yet?",
    "That is not so good. You had best refind it then. I tend to find in life things often return to where you first got them."
  ],
  "Player": [
    "I am an adventurer in search of quests.",
    "A curse? What sort of curse?",
    "So what do you do for water now?",
    "Any idea how you got this curse?",
    "I'm sorry to hear of your plight, but I must be going.",
    "Ok I will have a look around and see what I can do.",
    "I'm sorry to hear of your plight, but I must be going.",
    "I'm just looking around.",
    "I'm passing through on my way to Menaphos.",
    "Thanks for the warnings, though I may go investigate there anyway.",
    "I am working on it.",
    "What was I meant to do again?",
    "I haven't really had the time to investigate.",
    "I am trying to find out the cause of this town's curse.",
    "That's extortionate! Why so much?",
    "Would you happen to know anything about the curse?",
    "It does seem to be slightly exploiting their unfortunate situation.",
    "Hi, I am trying to find the cause of the curse on your town.",
    "Don't you know? The curse that has stopped your fountain working and made all the water dry up when you bring it back from the river?",
    "So any ideas about the cause of the curse?",
    "Hi, I am trying to find the cause of the curse on your town.",
    "Hi, I am trying to find the cause of the curse on your town.",
    "Hi, I am trying to find the cause of the curse on your town.",
    "Yes he has.",
    "I am trying to find out the cause of this town's curse.",
    "Why, what have they been up to?",
    "Good day to you.",
    "Ok calm down,  I'm not going to touch anything.",
    "What is this building?",
    "What do you mean by She?",
    "Errm you still haven't told me what you mean by She.",
    "That all sounds very confusing, I might just call her Elidinis for short.",
    "What is that key on display?",
    "..I just wanted to know what it did.",
    "I am trying to find out the cause of this town's curse.",
    "River spirits, what are they?",
    "So would it be possible for me to find these spirits and ask them what is going on?",
    "Thank you very much for your help.",
    "Thank you very much for your help.",
    "Thanks for your help.",
    "How are things?",
    "Well I hope things pick up for you.",
    "Thats odd. I wonder what I can have forgotten.",
    "Wow, how do you finish each other's sentences like that?",
    "That doesn't really have the same ring to it.",
    "Give Nardah its water back!",
    "Who are you calling little?",
    "Just tell me what it takes to get Nardah some water.",
    "Tell me what I need and I'll leave.",
    "Look, you don't want me to get annoyed.",
    "Okay, yes, I'm annoyed. Now give them their water.",
    "I haven't time for this nonsense.",
    "Yes, it wasn't so easy getting in here. Why have you made it so tough? You must really not like guests.",
    "I come as an emissary from the people of Nardah. Their fountain has dried up and water they bring from the river dries up. What advice can you give on this matter?",
    "Was this due to the death of the Saradominist priest, as the townspeople think?",
    "Is there anything they can do to get their fountain working again?",
    "Well, that's all very interesting. I wonder what the people of Nardah will think of this.",
    "Hey, you've stopped finishing each other's sentences!",
    "There are other desert settlements that don't worship Elidinis. Why pick on Nardah specifically?",
    "Yes, I would like to hear this story.",
    "That does make some sense.",
    "What manner of beings are you?",
    "Tell me more of Elidinis.",
    "Give Nardah its water back!",
    "Yes, it's nice and cool here.",
    "What did the townspeople need to do again?",
    "Yes I have made some progress. It is the doing of the water spirits at the source of the river.",
    "Did you by any chance throw away a statuette of the goddess Elidinis recently?",
    "Well the spirits killed him for imparting that piece of advice about the statuette.",
    "Apparently this town was brought about by Elidinis on the promise that its people would follow her. People here have been waning in their belief of Elidinis for a while now.",
    "It seems the casting away of the statue was the final straw.",
    "Oh but that's easy, I can pray to protect myself from arrows too.",
    "Where did you throw the statuette?",
    "Well it's worth a look anyway.",
    "Not yet, but don't give up hope yet.",
    "Where did you say you threw it again?",
    "I'm told that a statuette was removed from this temple.",
    "Who?",
    "..Ah yes, that She. Well you're right, that would be an insult to Elidinis. In fact it seems that affront is what has brought the curse upon this village.",
    "Er, why didn't you tell me about your suspicions when I was asking around about the curse then?",
    "No I'm here to help.",
    "Yes some actually. I managed to speak to the river spirits you told me about.",
    "Yes the spirits told me that the town is cursed because you guys have thrown away a statuette to the goddess Elidinis.",
    "I heard the people of Nardah threw their statue of Elidinis away.",
    "Where did it go?",
    "I heard the people of Nardah threw their statue of Elidinis away.",
    "But the spirits of the Elid have cursed Nardah for throwing the statue away. Where did you throw it?",
    "I heard the people of Nardah threw their statue of Elidinis away.",
    "A Saradominist priest who was staying here told them too[sic].",
    "You don't seem to notice much. Do you even live here?",
    "I heard the people of Nardah threw their statue of Elidinis away.",
    "I've found out that action seems to have caused this town's curse.",
    "I'm after a statue that was thrown down here.",
    "Maybe I can make a deal for the statuette?",
    "Isn't that a little harsh?",
    "How am I meant to remove someone's soul?",
    "Ok I agree to the deal.",
    "No way am I agreeing to that.",
    "I'm not sure they know you're down here.",
    "You're a genie, grant me a wish.",
    "Well you seem quite scary.",
    "Erm yes that's what I meant.",
    "Well I must be off now.",
    "Why are you sitting here in the dark?",
    "Very pleasant, the snakes are a nice touch.",
    "I'm just looking around.",
    "...Ok I think I can manage that.",
    "How am I meant to remove someone's soul?",
    "I'm still working on it.",
    "No, it's not an easy thing to get.",
    "Err, well I have made some progress. I met a genie down the crevice. He told me that he would give me the statuette in exchange for your soul.",
    "Well not exactly, he sort of basically said I should remove it with a knife.",
    "Errm, I'm trying to remove your soul.",
    "It's for the good of the village. I met a genie down the crevice. He told me that he would give me the statuette in exchange for your sole.",
    "Yes I have it here.",
    "So um, why do you need part of Awusah's footwear anyway? I hope you're not going to do some nasty magic on his feet or something.",
    "I have lost my statuette.",
    "I will go and get one then.",
    "Yes I have one here.",
    "Yes I finally got it. I had to destroy a pair of your shoes though. A crazy genie wanted a sole off your shoe in return for the statuette. I think he got souls and soles confused.",
    "Yes I thought it best not to correct him. He's somewhat less dangerous than he might be if he's a collector of shoe soles.",
    "Well I did, but I lost it again.",
    "I have recovered the statuette of Elidinis.",
    "I have got the statuette.",
    "Well I found the statuette, but I lost it again."
  ],
  "Rokuh": [
    "Come one, come all, buy my amazing choc ice invention here! Chocolate on the outside. Iced cream on the inside. Oh I also have some chocolate left over from making choc ices which I'm selling too.",
    "I really have no idea. It's most regrettable. Fortunately my innovation with my choc ice invention is helping people stay at least slightly cool."
  ],
  "Malik the Carter": [
    "Water, water get your fresh water here, 1000 coins a waterskin, a bargain in these difficult times.",
    "Well it's the cheapest water you'll find in this town.",
    "Yes the people round here can't seem to get the water themselves. It's an ideal business opportunity for one such as myself.",
    "I don't see it like that. Without me they'd be in even more of a mess. I'm doing them a favour and in true Pollnivneachian spirit making a profit along the way."
  ],
  "Garai": [
    "What curse is that?",
    "Ohh that's because of a curse? I didn't think of that.",
    "Absolutely none.",
    "Did they? What did they want to go and do a thing like that for?",
    "There was a Saradominist priest here?",
    "Yes, I just don't get out that much."
  ],
  "Nkuku": [
    "It's terrible isn't it. Surely it is because we let the holy Saradominist priest die.",
    "Yes, we did. We follow Saradomin now, so we had no use for it.",
    "I don't believe you. I am not going to be swayed into thinking that was the wrong thing to do."
  ],
  "Usi": [
    "Well I think that's what everyone wants to know.",
    "Yep we did. Bit of spring cleaning.",
    "I don't remember exactly now. Awusah might know."
  ],
  "Habibah/Meskhenet/Zahra": [
    "Ah I see. Awusah has enlisted your help?",
    "Well, I really dont know why it might have happened. Maybe Ghaslor has some ideas. He's very wise and old and is the town's archivist. He lives in the northeast corner of the town.",
    "Yes that's correct. Why do you ask?",
    "Well, I guess that would be logical conclusion. I don't really know where the statue was thrown. Awusah might know."
  ],
  "Shiratti the Custodian": [
    "Well with the moral standards of this town lately, I'm hardly surprised.",
    "Nothing someone like you would understand.",
    "Be Careful[sic] in here and don't touch anything! There's some old and valuable artefacts around here. Careless outsiders..[sic] you're always coming in and making a mess of things!",
    "Yes, good don't.",
    "This is our local shrine to She.",
    "Such ignorance! I suppose I should come to expect it. People are forgetting the old ways of the desert around here. But then..[sic] What do those bureaucratic fools in Menaphos expect! If they're going to take so long to send us a new priestess of She. Do you know we haven't had one for five years now!",
    "She! Otherwise known as Elidinis, Goddess of growth and fertility, Lady of the river, Wife of Tumeken, Flower of the desert, Mother of Icthlarin.",
    "That's a very valuable artefact. Keep your hands off it.",
    "That's the key to the holy chambers of the great and mighty Spirits of the Elid, and it's staying right there. There are other holy items about this building and keep your hands off them too, but most definitely keep your hands off the key. People already meddle too much with the affairs of the shrine.",
    "Yes, that Saradominist priest brought a group of the villagers in here. Took it by force as far as I'm concerned. I'm not at all happy, standards have been slipping here for a while, but that was going too far.",
    "It's an insult to She!",
    "She! Elidinis! Goddess of growth and fertility! Lady of the River, Wife of Tumeken, Flower of the Desert. Mother of Icthlarin!",
    "Well you know I suspected that all along, but does anyone listen to me anymore? No! Well I'm impressed you've come to the same conclusion as me, maybe I underestimated you.",
    "I have to apologise. We've already had one outsider around stirring trouble, which caused this whole mess in the first place. I feared that you were coming to force your ways on us.",
    "Well I'm grateful, anything you can to do to find the statuette would be appreciated.",
    "That is great news! I could kiss you, but they don't allow shrine custodians to engage in that sort of behaviour. You should put the statuette back on its plinth.",
    "That is not good. I hope you find it again so that we can be freed from this awful curse."
  ],
  "Ghaslor the Elder": [
    "Good day to you young [man/lady].",
    "Oh that's something which no one but the gods and the river spirits seem to know.",
    "They're the guardians of the source of the river Elid, they'll know of our curse, seeing as it's related to water we bring from the river. It's said that nothing happens on the river that they don't know about.",
    "Ahh now the spirits are something which no one from here have seen in a good long time, certainly not in my lifetime, I don't think even in my own grandfather's lifetime. Most the younger people of this town don't even remember that the spirits even exist.",
    "Here I have something around here somewhere which may be of interest to you.",
    "Aha yes here it is, the ballad of Jareesh. This tells of a previous quest to try and find the spirits.",
    "You already have the ballad of Jareesh, which tells of a previous quest to try and find the spirits.",
    "Lousy, young people have no respect for their elders, there's too many confusing newfangled magic carpets and snake charmers around these days and now we don't even have any water.",
    "Good day to you young [man/lady].",
    "Any progress on uncovering the town's curse yet?",
    "You actually managed to find them? I'm impressed. As I say – no one has seen them in many many years.",
    "Ah yes I heard a group led by that Saradominist priest went into the shrine and removed the Statuette. It all seemed a bit unnecessary to me. Didn't realise it would curse us though.",
    "I have no idea what they did with it afterwards."
  ],
  "Golem": [
    "You may not pass!"
  ],
  "Nirrie": [
    "What brings thee to our domain? It has been a long time since",
    "We are a gestalt entity. We each have our own body, but our minds",
    "the toilet seat up.",
    "Okay, we're a mostly gestalt entity. We each have our own body, but",
    "This little one doth come blundering into our abode making demands, with no thought for",
    "You are little in power compared to us.",
    "Well, maybe we're not that desperate for thee to leave.",
    "That's a shame, because thou art annoyed already.",
    "You know thou art really not skilled at diplomacy.",
    "Well, we know ye mortals are always in a rush with",
    "We are powerful spirits with direct contact to the great goddess Elidinis. We do not need to be bothered by the trifles of",
    "How unusual that the one who would come unto us on this issue isn't even from Nardah. Yes, it was indeed we",
    "No, that also was our doing!",
    "He came preaching the ways of Saradomin, which is all well and good, but he also did turneth them from the path of the desert gods, especially from Elidinis. Elidinis is happy to share the worship of followers, indeed Elidinis was allied with Saradomin many ages past. Saradominist mages even gave us those golems you met as a diplomatic gesture, so you can see we have been on good terms; however, this is an outrage.",
    "I do not know. The Saradominist priest persuaded the people of Nardah to throw away a statuette of Elidinis which was in the temple. As long as they do not have that image of Elidinis to pray to, then we must consider them turned away from her and the curse shalt stand.",
    "That seems to be something that happens when we get emotional.",
    "levelled the town. Most of the human citizens perished. Nardarine had the wisdom to escape into the desert before the fighting got really serious, and thus survived; however, she found herself wandering lost and alone in",
    "the wars of the gods, for they have caused me so much hardship already. I wish only for a quiet life somewhere.' Elidinis replied, 'I will grant this unto thee on the condition that thou swearest to forever pay fealty and",
    "a spring of water appear at Nardarine's feet and brought stone from below the sand so that she",
    "of her days in the peacefulness that she craved. The oath was passed down the generations for many ages, but now seemeth to be forgotten. Now maybe thou canst see why we are not best pleased.",
    "We are the spirits of the River Elid. Many ages ago, we used to be mindless wandering spirits, with little mind or purpose. We were here even in the First Age. Then, great Elidinis came to the desert and bound us to her river. We've",
    "Elidinis is one of a group of gods known as the Menaphite Pantheon. She is the wife of their leader, Tumeken. She is the Menaphire goddess of growth and fertility and goddess of the river.",
    "As long as they do not have their statuette of Elidinis to pray to, then we",
    "That's all well and good, but I think thou should give it to the Nardah townspeople, for"
  ],
  "Tirrie": [
    "we have seen any of your kind. Thou art not even",
    "are united and we all think as one. Well, except when Hallak doth leaveth",
    "think as one.",
    "diplomacy or decorum.",
    "Thou shouldst calm down. Getting worked up like that will not help thee.",
    "your very busy little lives. We'd better let thee get on. We",
    "each and every human. This way, only those of much resource and intellect may gain audience with us.",
    "calmer now, though.",
    "It is true many do not follow Elidinis, but there is more to the story than that. The answers",
    "Nardarine came from a town towards the north side of the desert, which does not exist today. This was in the Third Age in the time thou callest the",
    "the desert. She prayed to Saradomin for help, but Saradomin was too concerned with the loss of a strategic outpost to worry about the fate of one small human. Nardarine had wandered towards the realm of",
    "homage to me, and I grant this also unto thy descendents[sic] for as long as they too will pay an oath of fealty and homage to me.' Nardarine said, 'If you would grant me a safe home, with a",
    "might have something to build with. She called forth camels, which have many uses and taste good in kebabs. She then provided Nardarine with a statuette in her image to worship. Nardarine built up her home. Over",
    "become one with the river, and over the centuries become full of the power of Elidinis that was in her river. We are now her trusted guardians of the Elid. We can control the river and anything that happens near the river we know about.",
    "must consider them turned away from her and the curse shalt stand.",
    "must consider them turned away from her and the curse shalt stand.",
    "they hath been cursed and not thee."
  ],
  "Hallak": [
    "one of the desert peoples!",
    "That's the way it's meant to be!",
    "our minds are united, except for some little parts which aren't. We mostly",
    "enjoyed thy visit.",
    "who have withheld their water from them.",
    "He did not respect our ways and the ways of the desert! He did not respect the ways of Elidinis!",
    "We are",
    "lie in the story of Nardarine. Wouldst thou likest to hear the telling of this tale? It is not a short one.",
    "God Wars. Her town was once controlled by Saradomin, but there was a great battle there between Saradominist and Zamorakian forces, which pretty much",
    "the Menaphite Pantheon. Elidinis heard the prayers of Nardarine. She took pity on the wandering human and came unto her with water. 'Oh great goddess,' exclaimed Nardarine 'I wish not to be involved more in",
    "supply of food and water, then I would surely do this, for it is more than any other god would seem to do for me.' Then Elidinis made",
    "time, more refugees from the God Wars found Nardarine's home. Nardarine let them stay with her as long as they did make the same oath as her. Hence the town of Nardah was born and Nardarine lived the rest",
    "Thou art back already?",
    "I thought we had been through this already. You are not in any position to make such demands. As long as they do not have their statuette of Elidinis to pray to, then we",
    "That it is. Praise the power of Elidinis."
  ],
  "Genie": [
    "I am a mighty and powerful genie. Why do you come here? Speak now or I'll have to think of something exceedingly nasty to do to you.",
    "Ahh yes someone did drop a statue on my head recently. Very nice workmanship, looks quite old and valuable too. I'm surprised someone threw it away!",
    "I have accepted it as a gift as they clearly respect my terrible powers. They seek to keep me at bay by giving me valuables.",
    "Hmm a deal eh? I think we can come to some sort of arrangement. I'll give you the valuable statuette in return for, let me think ....[sic]",
    "How about I give you the statue in exchange for the sole of the mayor of Nardah?",
    "I wouldn't have said so. It seems a perfectly reasonable thing to request to me. I can think of many things a lot worse I could have asked for.",
    "Oh that's easy. In my experience soles are very easy to remove with just a knife.",
    "Ah well it's your loss. No sole, then no statuette.",
    "Silence cur! They fear and respect me and that's an end to it.",
    "Not all genies are goody two shoes who go round granting wishes. It's something that my pathetic brother does to make people like him, but that's not my style.",
    "I like to think of myself more as an evil and scary sort of genie, who people talk about in hushed and fearful tones.",
    "Why thank you, I put a lot of effort into my terrifyingness.",
    "Wait! Did you say quite scary? I'll have you know I am VERY scary!",
    "Yes, run. Ruuuun in fear of..[sic] The crevice genie of Nardah! Muhahaha!",
    "Two reasons really. Firstly, I can see in the dark, so light or dark makes little difference to me.",
    "Lastly, I gather it's normal for powerful terrifying creatures to lurk around in dark caves, so I found this one to lurk in myself, nice isn't it?",
    "Why do I get the sense that I'm not being taken seriously here? Please try to remember I am very dangerous and not to be trifled with.",
    "I don't know about that. I can't have just anybody traipsing in here. I have a reputation to keep you see.",
    "Actually I'll tell you what, you can hang around here for a bit, but be sure to spread the word about what a terrifying experience you had when you ran into... The crevice genie of Nardah!",
    "Do you have the sole of Awusah, so that we can make our trade?",
    "Oh that's easy. In my experience soles are very easy to remove with just a knife.",
    "Well no rush. I quite like the statuette too.",
    "Haha, even a pathetic human should be able to manage to get another human's sole.",
    "Hey get your hands off my house.",
    "Do you have the sole of Awusah, so that we can make our trade?",
    "Ah excellent, here, take the statuette then.",
    "I hadn't thought of that. I just read that a lot of the most powerful beings are collecting soles these days. I haven't really got many yet though. You provided me with an opportunity to expand my collection.",
    "Well fortunately for you, I am a mighty and powerful genie and managed to reacquire it. I will give it to you for another sole.",
    "Great! Another one for my collection.",
    "Ah excellent here's the statuette then.",
    "It's good doing business with you again."
  ],
  "Congratulations! You have completed": [
    "'Spirits of the Elid' - Complete this quest."
  ],
  "Retrieved from ‘https": [
    "//runescape.wiki/w/Transcript:Spirits_of_the_Elid?oldid=36190484’"
  ]
}